{
  "website_summaries": [
    {
      "verdict": "A good budget backdrop stand for photographers wanting something small and out-of-the-way.",
      "pros": [
        "Narrow crossbars and support stands fit up against walls to keep the backdrop out of the way",
        "Collapses into its separate components in mere minutes"
      ],
      "cons": [
        "The lighter weight of the stand makes it unstable in outdoor, windy conditions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great buy!",
      "text": "Great for the price.. Might bend eventually if extended all the way and used with heavy material... Would suggest not to hang anything heavy in the middle. Used as maleficent birthday party backdrop stand...",
      "rating": 5.0,
      "verified": true,
      "author": "moore fire",
      "helpful_votes": 66,
      "publication_date": 20160316
    },
    {
      "title": "Event Backdrops",
      "text": "We always use these background stands at our events. They are sturdy enough for the backdrops we use.",
      "rating": 5.0,
      "verified": true,
      "author": "Saunders Inc",
      "helpful_votes": 52,
      "publication_date": 20160704
    },
    {
      "title": "Photo of product is wrong. This is the cheaper ...",
      "text": "Photo of product is wrong. This is the cheaper Neewer background stand just under a different name. The picture is of the more expensive ePhoto Photography Video Backdrop Background Heavy Duty Support Stand with Case for Chromakey or Muslin by ePhotoInc H30.",
      "rating": 1.0,
      "verified": true,
      "author": "David A. Grim",
      "helpful_votes": 53,
      "publication_date": 20151015
    },
    {
      "title": "Support Stand for Home Studio",
      "text": "For its price, this appears to be a well-made product. Works great with the 107\" seamless paper roll using all four of the horizontal bar sections. Light weight so it is portable. An assistant would be helpful raising the bar to its higher extensions.",
      "rating": 5.0,
      "verified": true,
      "author": "Grant Montgomery",
      "helpful_votes": 54,
      "publication_date": 20160614
    },
    {
      "title": "Very sturdy, reliable and easy to use",
      "text": "Very sturdy, reliable and easy to use! You won't regret buying this product. I used it as a back drop for my sisters baby shower!",
      "rating": 5.0,
      "verified": true,
      "author": "R K",
      "helpful_votes": 34,
      "publication_date": 20160316
    },
    {
      "title": "Terrific stand considering its inexpensive price",
      "text": "Stable for indoor use with lightweight fabric. Would have preferred heavy duty, lever release knobs, variable width. But it was easy to shorten the width by using just 3 of the 4 top extensions - and adding a simple collar atop one of the stands (to let the top rail slide through) gave me variable width. After assembly I could not disconnect the top rails without a tool, so the next time I assembled, I simply didn't twist the bars to allow the clips to engage: still stable, yet ready for quick disassemby. Tough to beat at this price. Simple, clean stand - even more useful after a couple tweaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Razmataz",
      "helpful_votes": 7,
      "publication_date": 20171001
    },
    {
      "title": "It's ok.",
      "text": "This stand is not for heavy jobs. It's very light so dont expect to hang heavy drops from it. It comes with 4 cross bars, however you can only use 3 before it bows in the middle... that attests to how flimsy it is. I'll keep it for light jobs, sheer drapes/curtains, balloon garlands, stuff like that. But I wouldn't dare hang a boxwood hedge drop from it. If you need heavy duty, this isn't it. If not, this may work for you. Also, the footprints on the tripods are very large. I worried someone would trip over them. And because the whole stand is so light, the tripods are easy to move by accident.",
      "rating": 4.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Arrived Broken...TWICE. You may not want to take a chance on purchasing.",
      "text": "Arrived with one broken stand (meaning there was no way to use it upon arrival) but customer service replaced it within a few days. It's not sturdy by any means, but does the job as long as you're careful with assembly and disassembly. UPDATE: I received the replacement within a few days, but one of the stands in it was broken too. Fortunately I had not returned the first one yet...ended up having to piece together an unbroken set from both before returning one of them. Not sure how these are getting damaged so easily, the boxes weren't damaged in any way that would indicate it's a problem during shipping. Take your chances, or better yet buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason P Tucker",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "There are Better Options for $35",
      "text": "Repost w/picture I have several backdrop stands from Amazon. All retail around $35. I use them for parties. This is the first one that disappointed me. I knew that it wouldn't come with any clamps or weights, but it shipped faster than the ones that do. Fine. It didn't contract in the middle, I couldn't adjust the height, and it was much flimsier than the others that I have purchased.",
      "rating": 2.0,
      "verified": true,
      "author": "APRIL PRYOR",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "... ordered 2 of these Backdrops and they are so easy to set up",
      "text": "I actually ordered 2 of these Backdrops and they are so easy to set up, I have used them for at least 10 different events now and so far they are holding up well. I love how the product comes with a bag that holds all the parts so you are less likely to lose parts. The reason I only gave it 4 stars is because the legs are a little wobbly but because I use this mainly for backdrops I put the legs up against the wall and that gives it the support that I need.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170210
    },
    {
      "title": "Does the job, won’t win any awards",
      "text": "Perfect for what needed, to step up my home self-taping game. I got this instead of a portable one stand set up. Out the box the pieces were super lightweight but felt cheap. It also doesn’t seem sturdy so sand bags are definitely required if using with groups. For what I need, hands down a great price. It doesn’t come with clamps (I already had some in my kit) or the backdrop so you will have to purchase separate",
      "rating": 4.0,
      "verified": true,
      "author": "Lou Kay",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Love it! Great price. Great system.",
      "text": "Very happy with this purchase. I have another background stand that was more than this one, but I needed another one in a pinch, so I took my chances and I’m pleasantly surprised with this one. I like how the bar snaps/locks into each other. If you have it at 10 feet wide you will need a stand as a support bracket if you want the backdrop not to sag, but I found this to happen with any system. Overall very happy with it and the small price tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Not satisfied.",
      "text": "Flimsly when assembled with just one bar. Their legs arrived with rusty powder coating the knobs. After assembly the legs of the stand were so flimsy I had to adjust em multiple times to get the right angle. Honestly I would not recommend this to anyone who would re assemble and dissemble their green screens multiple times. The hassle to get the height right with the flimsly leg stands is so frustrating. I packed this away as a back up screen.",
      "rating": 3.0,
      "verified": true,
      "author": "dude what?",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "No instructions included",
      "text": "So far I've only used this to test it. It was easy enough to figure out how to assemble, but it does not come with instructions. It actually doesn't come in packaging of any kind except the plain cardboard box it's shipped in, which is strange and makes me wonder if I got one somebody had returned. It held up well for me, but the only draping I used was chiffon, which was very, very light.",
      "rating": 4.0,
      "verified": true,
      "author": "Alissa",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Meh.",
      "text": "It's filmsy, its does the job ok but do not put any substantial weight on it at full length. Definitely for paper and light fabric backdrops not much else. We are convention artist and print sets would be ok but this will flex/ sag under the weight. The screw mounts feel a bit cheap as well, I expect to need to replace this within the year",
      "rating": 3.0,
      "verified": true,
      "author": "Malice",
      "helpful_votes": 2,
      "publication_date": 20171025
    },
    {
      "title": "No instructions included, so be prepared.",
      "text": "Just received the item, its nice and light, weight wise, so will be easy to carry around. I am dissapointed that instrcutions were not included but after messing around with it I finally figured it out...I think. I am dissapointed because it doesnt feel 100% sturdy. I think if you do not bump into it, you should be ok. I am also dissapointed because just as another person mentioned the screws are not made evenly. So one side I can put the washer ontop and secure it. the otherside is not able to be secured properly. I haven't tried to hand anything on it just yet so my review may change/ be updated once I do.",
      "rating": 3.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 2,
      "publication_date": 20161011
    },
    {
      "title": "This is a great stand. It is easy to assemble for 1 ...",
      "text": "This is a great stand. It is easy to assemble for 1 person to handle and a no brainer to figure out. I tested it with an 8' x 8' vinyl banner and it was FABULOUS. The cross poles give you a fixed size. They snap into place with a metal button which clicks into a hole in the adjoining pole. My 1 wish is that the cross poles were telescoping to be wider or narrower. It was NOT advertised as such, so no complaints. IT is a great unit and a good value.",
      "rating": 5.0,
      "verified": true,
      "author": "m is for mom",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Backdrop",
      "text": "I love everything about this product, especially the fact that it's adjustable. On an outdoor windy day, you gonna need to tie it up to something to keep it from falling. Other than than that, it's perfect for indoor settings. Since I recovered my original one, I will be returning this one since I wouldn't be needing two of the same thimg. It had an extra flare to the decoration. I pretty much use it every function. What a great investment. The price is not too expensive. The delivery was timely.",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Might take couple minutes to undertand how things go but make sure to look at the picture!",
      "text": "Missing instruction manuel, so I was pretty frustrated at first but then I kept looking at the picture and finally understood and when it clicked, it all felt so simple. It was able to hold three curtains as my backdrop and still felt sturdy. Don't put many heavy things on the back, if not it might break apart but overall, I am happy with my purchase. My sister-in-law loved her bridal shower and shocked at how well everything looked! I wish it was taller than 8 feet because my brother is very tall and his face covered some of the flowers I made lol.",
      "rating": 4.0,
      "verified": true,
      "author": "Ssultan1",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "I looked this brand and style up on Youtube before purchasing and it got good reviews. It does well for me as I ...",
      "text": "Affordable stand, however, if I'm using it on the tallest setting the ends are a little unstable but it stands well. I looked this brand and style up on Youtube before purchasing and it got good reviews. It does well for me as I use it for backdrops for drink stations or dessert bars; so, no one is leaning on it or touching it to make it fall. Easy to set up, my 2 year old daughter can do it...lol..kidding but it's easy. Love the fact it comes with a carrying bag. I plan to use all the time and the pricing is great. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Bush",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Easy to set-up and works well indoors, but easy to tip over.",
      "text": "Used as a photobooth backdrop outdoors. It is easy to set-up and works well indoors, but as soon as it is windy it is not very stable. Wish the base was a little wider or heavier. Had to anchor it to the wall so it wouldn't fall while people were standing in front of it. Still 4 stars because it would work well inside or without weather issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Guyler",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Five stars all around",
      "text": "Nice tote bag, easy to put up, light weight but strong. I might only use this a few times for photos, but it is just what I wanted. And I will use it to hold a TV screen in the summer for outdoor movie night too. I already have the 120 inch screen I plan to use. Tried it today inside and it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Renfrow",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Sturdy set-up for light screens",
      "text": "Comes in a carrying bad that folds for convenient transport. Lightweight and easy to set-up. It doesn't come with clamps, but I this to use with a projector screen so I didn't need them. The length of the top bar is 10 feet, but you can also adjust the poles to fit a smaller size. I found that one of the stands was easier to set-up than the other. One stand required a bit of muscle to extend even with the knobs removed. Not sure how sturdy it would be with a photography backdrop but it was good for my projector screen. All in all , a nice stand for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Good Value",
      "text": "This is a good quality product. It's about the size of a mic stand with extension arms. I wish I could figure out how to make it just a little bit taller but it will work fine for most applications. I purchased a screen separately. By purchasing the frame and screen separately it was much less expensive then buying them together somewhere else. I also purchased sandbags for really windy conditions.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad D",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Poorly constructed, holes didn't like up the way they should have",
      "text": "Its affordable and the bag is decent enough. The issue is that the top bar was not drilled well, so when it all locks together, the holes that should be at the ends so you can attach it to the two stands/posts are not facing the exact same way. When you screw everything down tight, one of the stands want to twist more out, so they don't stand securely or level. It is a light weight, budget backdrop, and the cost difference does translate. If you have a drill you can make the holes larger so it doesn't strain the stand, or you can put sandbags on the base to force it to be more stable.",
      "rating": 2.0,
      "verified": true,
      "author": "Caitlin Shea",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Gets the job done but not very sturdy",
      "text": "Its very large which was great, fits for my backdrop. But it was very flimsy from what I've put together so far. It fell over twice as I was connecting the poles, but for the price I wasn't expecting incredible durability. Taking the poles apart was a hassle for me. The trick I found was to push in both small \"buttons\", and twist until it comes out. Other than that it's fine",
      "rating": 3.0,
      "verified": true,
      "author": "Teshia Bradford",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Best bang for your buck.",
      "text": "After reading reviews of other background stands and this one, I obviously chose this and glad I did. It's sturdy and packs well in its case to take on the go. If you plan on using it as high as possible and photographing kids you may want to purchase a cheap set of 4 sandbags on here just to be safe. Honestly I don't think it would be an issue without them but someone will always complain it's not sturdy enough. As I stated I absolutely love it and highly recommend it especially if you are just starting out or even an intermediate photographer. The item shipped quickly and on time and came well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160325
    },
    {
      "title": "Perfectly portable, and inexpensive",
      "text": "This is the perfect portable unit. Easy to assemble. This is an inexpensive and portable back drop. At full width it is a little \"floppy\" if you are planning on using heavy drape clothes, I would recommend taking it down one bar width for added support. Also, while it can certainly support paper rolls, I wouldn't put a full one on it, or would leave the roll down and just run over the top. It is extremely light weight. Unless you are inside and using a single sheet drape, or paper (not on roll), I would strongly recommend getting sand bags etc. for the feet. It is perfect for portable photo booths,",
      "rating": 5.0,
      "verified": true,
      "author": "Aisdboss",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Came in handy",
      "text": "I was looking for a cheap way to make a “Hair cutting station” in the garage. Not just for me, but for the bf to go to cut his facial/body hair so that it wasn’t all over the bathroom anymore. I came across this stand backdrop and the lightbulb came on. Some cheap curtains and cheap mirror and now I’m in business! Finally chopped my hair off and the bf has used it too. Easy peasy cleanup! Super pumped!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Perfect",
      "text": "This is very nice for the price. Only draw back is that it only adjusts to certain lengths, but it isn't a big deal to me at all. The cost is way below and this is perfect for watching movies in the yard and I also used it for a funeral backdrop behind the casket.",
      "rating": 5.0,
      "verified": true,
      "author": "Komasi",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "So it's definitely easy to travel with",
      "text": "I initially purchased this to clip up the huge Beauty and the Beast stained glass Fathead decal I purchased as a backdrop for our vow renewal. I ordered some sheer white curtains and a sheer scarf \"curtain\" for the top to go with it. I had no problem setting it up by myself or taking it apart. So it's definitely easy to travel with. After the renewal I will be using it as a backdrop in my office for my Youtube videos and photography.",
      "rating": 4.0,
      "verified": true,
      "author": "Mandilyn",
      "helpful_votes": 4,
      "publication_date": 20160824
    },
    {
      "title": "Easy to assemble",
      "text": "I plan to use this to hang a curtain as a backdrop for a baby shower. It was easy to assemble and the curtain hung on it well, even fully extended, without bowing in the center. We may also use balloons or something else, but I think it will be fine. It comes in a nice carrying case. I'm happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanasi Girl",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "the lightest and cheapest I have ever seen",
      "text": "You get what you pay for. I had to have a stand for my 9 foot seamless. It held the paper fine during the 4 hour location shoot. The aluminum this stand is made of is the lightest and cheapest I have ever seen. The crossbar bows badly under it's own weight. I will be selling this backdrop support system, if I can find someone to buy it, and replacing it with theto use with some heavy duty light stands that I already own.",
      "rating": 2.0,
      "verified": true,
      "author": "Monte Spears",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "50-50",
      "text": "Pros: Cost Carrying case Easy to put together Cons: Very lightweight Plastic compression fasteners Could not support weight of standard vinyl step and repeat (see photos)",
      "rating": 3.0,
      "verified": true,
      "author": "Natalie Sena",
      "helpful_votes": 4,
      "publication_date": 20170819
    },
    {
      "title": "Pretty good for the price",
      "text": "This is a nice set-up for lightweight use. I'm using this to put up a backdrop and banner for a vendor's booth at a convention. It looks to be very easy to transport. However, when we set it up, we have one horizontal rod where the holes for the pins are slightly off so that the entire assembled rod's larger holes for the vertical stands will not line up. We can jury-rig it by not snapping one of the rod pins in place, but it is definitely a mfg defect.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal Gal",
      "helpful_votes": 0,
      "publication_date": 20160925
    },
    {
      "title": "I love it. I have to wonder about some reviews ...",
      "text": "This is a well made Support. I love it. I have to wonder about some reviews that say it's flimsy or won't last a month around children. Do you let your kids play with your $$$$ camera and lenses? I hope not. This is an adult \"toy\"... and or tool. This support looks great and will last a long time for anybody with the maturity level above a 17 year old. And the price makes it a wise purchase. Definitely a thumbs up from me. By the way I do video my kid quite often and she has no problem being careful or respectful of our equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.Natural",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Love it!  Great value for the money!",
      "text": "Great value for the money. I had no problem extending it to its maximum height holding a 6x9 lightweight muslin. A few reviews have reported on it being \"filmsy\". This is definitely NOT a commercial grade unit and it's not advertised as such. But for home use or occasional client jobs, it works perfectly. I was able to do a few head shots at a client location twice and I have zero complaint. You are not going to get anything better for this price. Eventually I'm going to look into converting the two studs (M10 threading by the way) on the top of each stand into something for a light stand.",
      "rating": 5.0,
      "verified": true,
      "author": "Kingmeow",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Perfect For Movie Night",
      "text": "I purchased an 8X8 projector screen then this stand. I just opened the box and put them together. I left one pole out of the top assembly and it fits perfect. It should disassemble quickly for storage. So far I'm loving it.",
      "rating": 5.0,
      "verified": true,
      "author": "G53",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Overall good product",
      "text": "This backdrop stand is good and simple to setup. The bar to hang the backdrop was too long but I was able to take a section off to make it fit the space. Overall it works as a simple yet portable stand and even comes with a bag for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Menglong Cai",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "a bit better than I expected actually",
      "text": "For the price and ultimate use, this works out alright. I was mostly interested in just the two stands to attach my HTC Vive Lighthouses to. It works, a bit better than I expected actually. Only real complaint (and keep in mind my use is not the intended use) is the poles are a bit wobbly. Not enough to be a huge issue, but something to keep in mind. I don't know if adding the cross bar would strengthen it, but I have a feeling it might make it worse with the wright of a backdrop draping down.",
      "rating": 3.0,
      "verified": true,
      "author": "Troy W",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Nice Buy",
      "text": "This is a good buy. Totally worth the price in a less windy environment. Easy to assemble and disassemble. I used it to hang a happy birthday backdrop, and attached a white sheet to use as a projector screen and it worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Love it!",
      "text": "You can use this as many times for events. Makes things easy to put up. I used it for my baby shower backdrop. I bought the cloth and put a non hem tape to make a hole to put through the pole. It stayed put. You can adjust the height and width which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonaddict",
      "helpful_votes": 3,
      "publication_date": 20170722
    },
    {
      "title": "Used and Abused",
      "text": "I received this a while ago but didnt open since the box was perfect, i had no reason to open until my project that was this past weekend. I made a huge mistake by not inspecting it before hand, I opened the box on location and obviously received a used product, not only used but battered and in bad shape. The canvas bag is dirty and has holes in it, the legs are badly bent, and the screws at the top to attach the top pole were pushed down so far I couldn't attach the top pole. I packed up and put back in the box and improvise my set up. Terrible waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Carly",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Good product",
      "text": "The extendable polls are awesome and can go as low as about 1.5-2 feet and as high as over 6 feet. The additional cross beams really make the stands usability large and extensive. Now, if only they could make it a little heavier. If used inside it'd be perfect, but outside with a little wind and with a banner, you better make some sort of weighted hold-down so it won't tip over. Good product though.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan J Bowerman",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Very disappointed that I purchased it for my daughter's bday party ...",
      "text": "Very disappointed that I purchased it for my daughter's bday party and it wasn't able to withstand the weather conditions that day. Unfortunately, it was a bit windy and the stand could not withstand the wind and kept falling over. So to no avail, we didn't use it. However, I get the feeling that this works best indoors where mother nature is not a factor. Also, it is a bit confusing to put up b/c it didn't come with instructions. I found myself literally guessing as I went.",
      "rating": 3.0,
      "verified": true,
      "author": "G8terJazz",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Absolute crap",
      "text": "You get what you pay for. It's crooked, extremely light, and made of very cheap materials. It can barely hold a paper background roll without tipping over. Do yourself a favor and pay more for a superior product that won't stress you out during your shoot.",
      "rating": 1.0,
      "verified": true,
      "author": "Rafael Meneses",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Worked great, holding up a vinyl backdrop and 2 curtain ...",
      "text": "Yes there are no directions but IMO it is very straight forward as to how it is put together. For the space I used it in, I only needed 8 feet across, so I just left one of the cross bars out. Worked great, holding up a vinyl backdrop and 2 curtain panels. I didn't use weights or sandbags to hold it, it didn't move all night. Great buy for the price, and considering that I only needed it once.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Leonard",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Center bar bows",
      "text": "Center bar bows with a normal weight backdrop. Paper backdrops may be fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Studio 316 Photography",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Nice and light.",
      "text": "Used to make a photo area for my child's super hero party. It was a blast and we have wonderful quality super hero photos to prove it. It was annoying that the poles fell inside each other, but then I just turned it upside down and the inner pole fell out. So it took about 2 seconds to solve that problem. Worked great, nice and light. The top bar is NOT telescoping however and you really can't limit size well then. Just 3 interlocking sections for super short or too long. I plan on bringing this out for future kids parties.",
      "rating": 5.0,
      "verified": true,
      "author": "Daria B. Kaval",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Love it",
      "text": "I use this as a backdrop for parties and I love it!!!!! Here's a picture of how I decorated it for my babyshower along with my grandmother's cute pose :)",
      "rating": 5.0,
      "verified": true,
      "author": "lorena sandoval",
      "helpful_votes": 4,
      "publication_date": 20171117
    },
    {
      "title": "Good quality",
      "text": "Really happy with this purchase. It was affordable but still nice quality. The stand is lightweight so it's not a burden to travel with. Assembly couldn't be easier...I'm a person who gets easily frustrated with assembling things so that was important. Holds lightweight back drops easily.",
      "rating": 5.0,
      "verified": true,
      "author": "RK A",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Fast, easy set up",
      "text": "The Background Stand Backdrop Support System Kit was perfect for my needs since I built a White House press room set in my house. First the price is amazing, I looked at other options and by far this was the best. Secondly, it is easy to set up and breakdown. Third, sturdy enough to hold trade show weight curtains. Wide enough and high enough to not see the set up. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "John Di Domenico",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "It's inexpensive for a reason... it's not meant to be heavy duty. It works for me",
      "text": "Overall it works for my purposes. I purchased two and one had misaligned cross bars so one side doesn't fit onto the tripod.Trying to get that replaced. Took me forever to locate a place to actually talk to someone at Amazon. It is lightweight and not made for heavy duty fabric or windy outside conditions... but for home use, ,small studio, or in our case a backdrop for some school functions its great.",
      "rating": 4.0,
      "verified": true,
      "author": "AZ Healthy Shopper",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Product arrived broken",
      "text": "I like the product it was easy to assemble, but one of the tripods was broken !!!! Package was intact with no visible outside damage so I’m assuming the problem occurred before packing. I don’t have time to return, and receive a replacement, because my event I need it for is for this Saturday!!",
      "rating": 1.0,
      "verified": true,
      "author": "Christina Parks",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Very lightweight and quick and easy to setup.",
      "text": "Very lightweight and quick and easy to setup. Not the sturdiest setup, so you may need to weight down the base a bit if your backdrops are heavy. I bought this to use as a mobile backdrop, and for that purpose it has worked very well for me. The carrying bag is convenient, but only meant for the stand and nothing more. You cannot store clamps or accessories in it, as it is a bundle style case, and not a bag type.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Thompson",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "No instructions or numbered bars.",
      "text": "No instructions came with the item. Luckily I set these up quite a bit. No number or letter labeling on any bars as shown in the \"how to videos\" which slowed down the setup process. Shipping was also very slow and the package was damaged and falling apart by the time it arrived. But all in all great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori K.",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Was broken; therefore unable to support",
      "text": "The Background Stand Backdrop Support arrived on time. However when it was time to use it, one of the pieces to hold the vertical pole in place was broken. I had to find a replacement in 4 hours. The other issue is that there are no instructions but thankfully YouTube is a friend.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Steele",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Cheap Background stand setup for Amateur photographers",
      "text": "It is very cheaply made. Very light and thin metal that could get easily bent during transportation. All knobs are plastic and can be completely unscrewed off so if you want to replace them, that's a possibility. Not meant to hold anything very heavy. Very easy to put together and take down. The bag is a roll up bag with 3 compartments: 1 compartment for each stand, and 1 center compartment for the 4 center poles. Recommended for amateur photographers that need a quick backdrop to put up (bed sheets, paper backgrounds, etc). If you want it to hold a full paper roll, or muslin backdrop, you should probably look elsewhere as this will not support the weight safely.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "Adjustable and light weight",
      "text": "Great for use with light backdrops. Really gives a great effect with parties. Used this for an in house party and at a venue. It is very lightweight and easy and quick to put together. Worry about long term use since so light weight but have no regrets in this purchase, love that it is adjustable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim S.",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "well made product. great for backdrop",
      "text": "Used this for my mom's birthday. i hung 2 medium light weight sequenced curtain for backdrop, and put some paper flowers. it is easy to assemble and stands perfectly, but dont hang anything heavy .",
      "rating": 5.0,
      "verified": true,
      "author": "Lovelyme",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Hated it ... now LOVE IT!",
      "text": "I hated this at first but once I figured out how to use it I loved it!! The only bother some thing for me was that it did not come with instruction manuals..... i’m not good at figuring puzzles out and that’s what this was! But once I got it together I will probably find other reasons to use this!!! It worked out great!!! Used cheap sheer curtain ... made the party!!",
      "rating": 4.0,
      "verified": true,
      "author": "Rita29",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great Investment",
      "text": "After wresting with green screening for my video conference I broke down and bought this. Should have done it months ago. The top bar is adjustable for two or three segments, a feature I didn't realize at first.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Keaney",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Flimsy",
      "text": "Doesn’t hold as much weight as I expected. Bought to hang completed quilt tops on so I could take photos. Photos are taken before batting and backing are added, which is done just before actual quilting is completed. Quilt tops do not weigh very much at all, but the stand still doesn’t hold them very well.",
      "rating": 3.0,
      "verified": true,
      "author": "Lorri Hagen",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Very Very Cheap",
      "text": "I received the product as described, but then when I put it together I noticed how cheap it was. All of the poles including the stand legs were very thin. When I put my banner up, it sagged.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason Beal",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Great product",
      "text": "Easy to use and assemble. Worked great with holding up all the balloons and fast shipping! Thanks so much, without this, my daughters first birthday decorations could not have come to life! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Emely G",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Awesome Value",
      "text": "I purchased this stand for a New Years Eve gig and used an 8x8 sequin backdrop purchased on Amazon as well.  The stand worked perfectly and came with a nylon carrying bag. It took less than 5 minutes to setup and break down.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ Joe Freitas",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Decent",
      "text": "Flimsier than I had hoped. Wish the top bar was adjustable for the width. The two bases take up more space than I like, and when working merch, the last thing you want to worry about is tripping over your backdrop! Although it works, I would recommend purchasing a different one.",
      "rating": 3.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 0,
      "publication_date": 20171119
    },
    {
      "title": "This support system stand was very strong and stable for ...",
      "text": "This support system stand was very strong and stable for hanging lighter material on. The only thing I would change is when you drape heavier material the top bar isn’t strong enough when extended fully and it tends to sag downward in the center.",
      "rating": 5.0,
      "verified": true,
      "author": "marsha s fallin",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Great for travel",
      "text": "Easy to set-up but don't think it would support very heavy materials. It is just as described and comes with a case. Not bulky and easy to carry. Great for travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocio Casanova",
      "helpful_votes": 7,
      "publication_date": 20160503
    },
    {
      "title": "Fills the need",
      "text": "Fits the need. I'm not sure I will be able to easily get it back in the storage case. I only take one star away because there are no instructions provided for assembly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "I set it up easily and used it indoors with a light muslin",
      "text": "I read many reviews and they helped me make my purchase. I'm not a professional photographer, so this won't get heavy use. There were no instructions, but there was video online from a competitor for the same type of stand. I set it up easily and used it indoors with a light muslin. I didn't extend it to full width, so I'm not sure about sagging. I'm satisfied for the price. It's perfect for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss D",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Just got it put up and so far so good. Seems sturdy enough",
      "text": "No directions come with it so use your imagination. The bolt at the top that you screw the top rod to will seem too short for the nut but if you just pull on it a little it will come up. Just got it put up and so far so good. Seems sturdy enough. I'm hanging two full size sheets on it as a backdrop because I couldn't find what I was looking for, and I'm sure they are heavier than a regular backdrop but it seems to be sturdy enough to take the weight.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Peebles",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "good for kids",
      "text": "Stay away if you need durable backdrop stand! This one is very flimsy and very light duty product! And no way to reach 8ft height. Feels like it was designed for kids. If someone is rating it as good, either is paid by the manufacturer or did not try better stands before.",
      "rating": 1.0,
      "verified": true,
      "author": "glaboni",
      "helpful_votes": 2,
      "publication_date": 20160504
    },
    {
      "title": "This worked great for the backdrop at my wedding ceremony",
      "text": "This worked great for the backdrop at my wedding ceremony. There were no instructions but you really didn't need any. Becarefull how much weight you use because the center will bow. We used heavy satin panels and heavy sequin drapes",
      "rating": 5.0,
      "verified": true,
      "author": "Basiliojs",
      "helpful_votes": 2,
      "publication_date": 20171121
    },
    {
      "title": "Good value",
      "text": "This is a pretty nice backdrop support system. It's my first backdrop which I used for taking portraits of the kids. They were very curious what was behind the curtain. But even with their prodding, they didn't pull it over. It's a pretty sturdy setup, no sagging, but I've only used 2 horizontal supports at a time. If I tack all 4 together, I'm not sure how it will perform. It works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Book",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Works best inside",
      "text": "I would’ve given five stars but it’s fairly flimsy and shouldn’t be used outside if there a chance of slight wind. Be sure to buy sand bags. We used ankle weights and gazebo picks to hold it down.",
      "rating": 4.0,
      "verified": true,
      "author": "MrsTaeges",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "GENIUS!!!",
      "text": "Whoever designed this was genius! I thought I needed days before my event to figure out how to assemble. Already pretty much assembled with the exception of the top pole which you just snap together. The carrying case is a great addition and makes it simple for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Great for the price!",
      "text": "It's a great value for the price. I agree with other reviews that if it is fully extended it might not be sturdy enough for a very heavy backdrop or set of heavy curtains, but for something more lightweight it's perfect. It's easy to assemble and easy to take apart.",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan Miller",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "great purchase",
      "text": "I love this backdrop kit. I needed something inexpensive that would hold a simple backdrop and this works perfectly. It's made of metal and the legs are sturdy. It's easily adjustable and can be taken apart quickly, fitting perfectly into the carrying case for storage. This was a good purchase and I'm glad I didn't waste my money on a more expensive kit because it wasn't necessary. This one gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Disappointing!",
      "text": "I was sent a way cheaper product then what was pictured. On top of that I was sent the wrong poles. They didn’t even connect to each other. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Pretty sturdy",
      "text": "I've used this stand a few times now and it's still holding up well. I had a sturdier one before this one, but even though this one is a bit wobbly at times, it's never fallen over for me and it hold a paper roll well. I like how small this breaks down too and it's very light and fits into a nice carrying case that's included, which makes it easier to transport/carry in and out of venues.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Great high quality stand.",
      "text": "Great quality backdrop stand. I was able to put 6 pairs of curtain, fabric, and string lights and it helped up really well. I did not try it the full length. I only used 3 bars and not 4, but it didn’t seem like it would matter. Great quality stand! It came in a great carrying case that make it easy to store the stand when not using.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynnaberry",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Great price for what you get",
      "text": "I used this for a party backdrop photo area. Tall enough and is great. Would recommend looking at video reviews of this. Had difficulty extending the height and thought we were missing pieces. Watched a set up video and realized what we were doing wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle C.",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Awesome for beginners!",
      "text": "This is very easy to set up and adjust. I usually need my husbands help with everything, but this wasn't one of them! I believe mine is 6 feet by 9 feet. It also comes with the clamps for your backdrop. Isn't super sturdy, so please keep an eye out for it tipping when photographing active people, children, and babies!",
      "rating": 4.0,
      "verified": true,
      "author": "Kyra Bodnar",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Quick delivery",
      "text": "I love it. Comes in a carry case & me & my 9 year old were able to set it up easy. I do wish it had marking on the sides to ensure it is straight but, for the price it's a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole West",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "OK for the price point.",
      "text": "This is a nice entry-level backdrop stand for the price point. It's easy to pack/unpack and comes with an awesome carrying case. My only concern with this stand is that the legs slip easily on smooth surfaces & cause the stand to be lop-sided on either side if the backdrop is too heavy. I used a 10x12' black muslin backdrop for a Photo Booth & had to keep checking the legs to make sure they weren't slipping even though I tightened everything. Muslin cloth is relatively lightweight, but the next go-around I'll probably invest in a little more sturdy backdrop with weighted & anti-slip legs.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Coffey",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Does the job - for now",
      "text": "It will do the job, I rarely use backdrops so I didn't need something of super high quality and it isnt. The stands are very flimsy and cheap. Having owned a more professional setup this pales in comparison. I bought it because people raved about how sturdy it was and how good it was for the money. Value for money - maybe, you get what you pay for. For the odd job its fine but don't expect it to last. Once those paying jobs start coming in, I would upgrade.",
      "rating": 3.0,
      "verified": true,
      "author": "PhotoB",
      "helpful_votes": 0,
      "publication_date": 20160219
    },
    {
      "title": "Great, for the price!",
      "text": "This worked out so much better than I expected! I needed this for an event and have now used it for more than 5 events over the course of a year. I purchased a beautiful backdrop and it fit perfectly on it. If not careful it can tip over however, it's sturdy otherwise and adjustable in many ways. The set-up and clean-up is super easy and it comes with a bag that makes transporting easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Ortiz",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Great  product!! Easy to assemble and light weight.",
      "text": "We needed a backdrop for our wedding without breaking the bank, this is perfect. I put it together in 10 minutes and down in 5. It comes in a great carrying case. My fiance will take it over as a backdrop for his band after the wedding. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "AuntieChell",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Good And Useful",
      "text": "This was simple and easy to put up. The only thing I’d say is that it’s not as study the wider you make it. You may have to put something to anchor it. Otherwise, it’s a great buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Shari Mclean",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "VERY lightweight and also sturdy!",
      "text": "I'm a weakling and can't carry much weight, but need to table at conventions... This is super lightweight, packs small, and easy to carry. It's also very sturdy when set up (indoors) to hold a 7 foot tall banner. Really nothing wrong with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "It’s an inexpensive alternative.",
      "text": "Did the job but very flimsy. Needed to reinforce to keep middle stable. Base needs to be stronger, had to tighten until I couldn’t anymore and it still was giving out. Does the job for lightweight materials, but not heavy. After researching other options, at $34.69 the price is ok, but know it’s not the best quality. It’s an inexpensive alternative.",
      "rating": 3.0,
      "verified": true,
      "author": "Silvursabl",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Great background stand!",
      "text": "I needed to hold up a canvas for a picture drop and back drop or a skit. I painted the canvas and this stand works just perfect for it!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Sorensen",
      "helpful_votes": 2,
      "publication_date": 20170507
    },
    {
      "title": "Really good",
      "text": "I m trying to put together my first studio. It looks amazing. Fast shipping and all the parts have a nice bag that I can carry it if needed",
      "rating": 5.0,
      "verified": true,
      "author": "Ochk",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Exactly what I needed and it has a cute little case",
      "text": "I've never used a backdrop stand before (I'm not a photographer) and this was super, super easy to put together and use immediately. i love that it came with a little compartmentalized case too! Also, if you don't have a super-wide roll to use with this, it's very easy to just remove 1 or more of the crossbars to create a smaller width. Also, there are some folks complaining that it has no instructions — this is true. But it's not rocket science. I had zero issues.",
      "rating": 5.0,
      "verified": true,
      "author": "bk",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Worth the buy",
      "text": "So easy to set up and take down! I used it on a fairly windy day in the mountains and it never moved which I was impressed with. I had a bag of rice to weigh it down for emergencies. The bag has compartments to organize. I went to the dollar store and bought clips for the decorations and helped for the backdrop. Overall, very pleased. Definitely would recommend for photography peeps and parties.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Good high quality product for those on the go photography sessions!",
      "text": "I and a photographer and have always used backdrops and a pole until that pole on my wall broke. I purchased this product and it came just in time for Graduation photos! I don't know how I survived without this product! it is made well, I use heavy canvas backgrounds and have had no problem with holding the weight of the background. The poles are good quality as well as the bag it comes with and its easy to set up and break down. Perfect for my photography needs!",
      "rating": 5.0,
      "verified": true,
      "author": "yvonne castaneda",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Perfect for beginner photographer",
      "text": "Perfect for home photo studio or lightweight travel. Having the case to keep it all together is great. I only need 3 inserts for my needs and it seems pretty steady, I don't know how it would hold up with 4 under heavier loads. If you plan on using it outdoors or on location I would recommend sandbags to keep it steady as it is pretty light-weight. A lot ore convenient than the one I made years ago from PVC pipes and probably cost about the same.",
      "rating": 4.0,
      "verified": true,
      "author": "Cre8tivemom2002",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "It is very easy to assemble (even with just one person)",
      "text": "This was purchased to use as a backdrop hanger for a Santa Paws pet photo event. It worked perfectly. It is adjustable in height and width. It is very easy to assemble (even with just one person). It folds down compactly and fits into its own carrying bag. I purchased inexpensive clamps from a local hardware store to clamp the backdrop material to the stand. The stand isn't super duper sturdy but it is lightweight and very portable. It is a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "scooterjoey",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "This has made setting up for pictures so easy! I was using PVC pipe for a stand ...",
      "text": "This has made setting up for pictures so easy! I was using PVC pipe for a stand before I bought this. I dreaded having to put it together every time. Now with this stand, I look forward to setting it up! I have taken it to my daughter's school for pictures too. It's very portable and comes with a bag to carry it in. It's a great stand for the price! I have used it to hang paper, cloth, and vinyl backdrops. It works perfectly for all of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Presnell",
      "helpful_votes": 0,
      "publication_date": 20170119
    }
  ],
  "product_meta": {
    "title": "Background Stand Backdrop Support System Kit 8ft by 10ft Wide by Fancierstudio TB30",
    "description": "You are buying a Fancierstudio Professional Heavy Duty Backgound stand. The backdrop stand Supports canvas, muslin and paper. This backdrop stand set is great for home and professional studio use. The background stand can extend to 8ft in height and 10 feet wide lots of room for all kinds of studio shoots",
    "rating": 4.3,
    "feature_bullets": [
      "Background Stand Backdrop Support System Kit With Carrying Case By Fancierstudio",
      "One background stand support system max 8ft height 10ft wide. Carrying case for backdrop stand included",
      "Perfect Lightweight Aluminum Tripods, Solid Safety 3 Legs Stages, Premium Quality Support Bars, Height Adjustable: Min 3.5 ft. to Max 8ft, Width Adjustable: Min 4.5 ft. to Max 10 ft Holds canvas, muslin or paper",
      "It is suggested to secure the stands with gaffer tape, or weight bags when using any background setup where there are several people, or active children on the set.",
      "A collapsible and lightweight background support system can be invaluable. You can get this good Fancierstudio background system without breaking the bank, and the Impact Background Support System is no exception. This background kit great for both studio and location work."
    ],
    "specifications": {
      "Product Dimensions": "35.6 x 7.5 x 6.3 inches",
      "Item Weight": "7.34 pounds",
      "ASIN": "B004HR42LK",
      "Item model number": "TB30",
      "Customer Reviews": "4.3 out of 5 stars2,016 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#106 in Photo Background Support Equipment",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 1, 2011",
      "Manufacturer": "fancierstudio"
    },
    "categories": [
      "Lighting & Studio",
      "Background Support Equipment",
      "Photo Studio",
      "Electronics",
      "Camera & Photo"
    ],
    "price": ""
  }
}