{
  "website_summaries": [
    {
      "verdict": "Despite a few minor shortcomings, the GoFlex Satellite makes an excellent direct-attach external storage solution for anyone and a must-have for those who frequently travel with Apple's iPad.",
      "pros": [
        "Seagate's good-looking and compact GoFlex Satellite is a new breed of external hard drives that can stream digital content stored on it via a built-in Wi-Fi network",
        "As an external hard drive, the device features USB 3.0, is relatively fast, compact, flexible, and offers uncompromising support for both Macs and PCs"
      ],
      "cons": [
        "The GoFlex Satellite supports only three wireless clients at a time, doesn't allow for Internet access, and its USB 3.0 performance could be better",
        "The drive's included GoFlex Media iPad app takes a long time to load photos and doesn't work in the background"
      ],
      "aspects": {
        "Setup": 9.0,
        "Features": 9.0,
        "Performance": 7.0,
        "Support": 7.0
      },
      "publication_date": 20110516,
      "rating": 8.1,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Outstanding",
      "text": "I have had one of these for several years and have recently purchased another one. I use this all the time when I am deployed to stream to my Kindle. I highly, highly recommend this product. If you have a complaint about the formats it supports you need to focus on the player. I use this in conjunction with Maxthon Browser and Mobo video player. I also use ESS File Explorer with it. If it won't support the formats you like then change the player you are using and the app you are using to access the drive. I can connect to it along with several of my friends and it works flawlessly.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20151212
    },
    {
      "title": "Missing folders and files",
      "text": "Seems great in concept but the interface is poor and most importantly, the drive does not \"sync\" with files and folders I just transferred from my mac. Apparently there is a file database issue with the drive. Even after deleting a database file on the drive as suggested on the Seagate forum, the drive does not show all my files. The drive seems to require a lot of maintenance for it to work. Many users have experienced the same missing folder/files issue and I haven't seen any response from Seagate. If it doesn't work seamlessly, the drive is quite useless...",
      "rating": 1.0,
      "verified": true,
      "author": "Regis Haegler",
      "helpful_votes": 4,
      "publication_date": 20120228
    },
    {
      "title": "great addition to Ipad or Tablet",
      "text": "I purchased this Seagate Go Flex WI-FI hard drive at the suggestion of a friend. Rather than spend the extra money buying an upgraded memory unit of the Ipad or Tablet, spend the money on the Seagate GoFlex WIFI drive. I'm glad I listened because for the $100 I spent on the GoFlex, which I got on sale at Amazon, I have a 500 GB hard drive that I can share with the smartphone, Iphone or Tablet. Streaming movies showed initial hiccups while the unit was buffering but went very smooth once it got over the hiccups. The onlt hangup I have with this is I cannot connect to the internet while I am connected to the drive via WiFi",
      "rating": 4.0,
      "verified": true,
      "author": "Reynaldo Reyes",
      "helpful_votes": 2,
      "publication_date": 20130102
    },
    {
      "title": "I love this external drive",
      "text": "Took me a while to figure out how to use the firmware update, honestly I think I made it work by mistake, I copied the firmware update file to the unit and used ITunes to initialize the update.....but I have to say it is WONDERFUL, just went on a cruise and had my whole library with me whenever I wanted to use it. So far it holds for me, about 60 movies and about 200 tv episodes and I still have more storage available..... I travel with a show for a living so hotels are my mainstay during the year and now having this storage unit I can watch what I want when I want......",
      "rating": 5.0,
      "verified": true,
      "author": "tourguy1018",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "Decent Solution",
      "text": "OK so the instructions are really lacking but they are not completely impossible to understand. The drive itself is fine and it works as advertised. What I don't like about it is that the media is just clumped together there is no concept for a folder or any other way to organize the contents. And things are just clumped together when you view the files in the onscreen viewer. Other than this knit, I do like the device itself. I dont think I would personally pay more than the $99 I got it for though. Its original price is $200 which is quite high given the mess of the root directories.",
      "rating": 4.0,
      "verified": true,
      "author": "tmybrgr",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "Dissapointment",
      "text": "Concept is brilliant but the use interface (UI) is terrible. I bought this hard drive to watch movies on my Samsung Galaxy Tab 2. You have two options, either download the Seagate Satellite app on your device and browse your hard drive through that or you just open your web browser on your device and it automatically brings you to crap UI that I mentioned. Either way it just sucks, it doesnt want to play my movies or it wants to waste my time trying to download them to the device. Just dissapointed it wasnt wayyy easier to use. Will return and figure something else out. Hopefully Western Digital makes something worth buying.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20130913
    },
    {
      "title": "So legit",
      "text": "Used with my Ipad on a huge road trip. There were 4 of us in my truck, and 3 would stream various movies while the 4th individual drove, this thing is seriously amazing. Kept my friends and I entertained from Oklahoma to Vegas to Colorado and back to Oklahoma. We used the following devices to stream (simultaneously) Ipad 1 Ipad 3 Galaxy Tablet 10.1 (something like that) It is also nice that the device comes with a car charger for the road.",
      "rating": 5.0,
      "verified": true,
      "author": "ipad user",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "So-So",
      "text": "I bought this as a gift for my daughter who took it with her to another country. Unfortunately she could never get it to do all of the things it claimed. But she CAN use it as a back up drive for her computer, which helps. She thinks it has something to do with her trying to use it on a Mac and not having a driver she needs. She can't find it on the internet to download. I bought her a Maxell AirStash so she uses that instead and uses this GoFlex as her backup.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Stiles",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "The New iPad/iPad3 and Thunderbolt",
      "text": "So here is the deal. When I got \"The New iPad\" in 3/12 the app did not work with it. I have to do a firmware update on the goflex hard drive. You have to got to this url and download the file and put it on the Hard drive and reboot the go flex. [...] Also, I bought the thunderbolt accessory for $100 at seageate. Just know if you do this, the thunderbolt cable does not power it so you have plug in the usb power adapter on the side of it. Also know that the Thunderbold for the goflex is read only. Home this helps",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Combs",
      "helpful_votes": 2,
      "publication_date": 20120407
    },
    {
      "title": "I've had this for several years and it's nice. Load up with video files and multiple users ...",
      "text": "I've had this for several years and it's nice. Load up with video files and multiple users can use to watch different movies. Good for areas with no Internet, since it has local \"wifi\" to \"stream\" to laptops/tablets. I've used it on vacation.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph O'C",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Disappointed Seagate GoFlex Satellite owner",
      "text": "Has not worked properly-can only use it as an external drive for my PC. Wifi useless for Smartphone etc. Will never buy this again. Customer service let me do 4 different things to no avail, still not working, now they want $15.00 to have me speak to a customer service person, but no guarantee that it will work. Bought a inexpensive Ravpowe RP-WD03r and it is doing a MUCH better job than the Seagate Goflex Satellite .",
      "rating": 1.0,
      "verified": true,
      "author": "Godfried Breur",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Great external storage for my IPAD and Ipod Touch.",
      "text": "I ordered this for my Ipod Touch and Ipad devices. It has great capacity to store digital video and music library without taking up too much space on the Ipod or Ipad devices. It also has good battery life. On long road trips, I plugged it to the car lighter outlet and it offers everyone their desired videos and music without carrying a bunch of DVDs. Great product and it is easy to setup and use. When you are away from your home wifi, if you have stored the SSID and Wep of the GoFlex Satellite, the devices with find it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Lee",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Works perfectly",
      "text": "My first attempt to load files onto this failed, the light on the USB connector was flashing. I realized I had not charged it enough. After an overnight charge, I filled it up via my PC's USB3 connector. Then I turned on the unit's Wi-Fi, looked on my cell phone for the signal, connected to it, and watched a video. I am keeping this full load of media files on it permanently, they will take longer than my life span to watch and listen to them :) So I removed the USB3 cable and adapter, and stored it with the unit in a small hard sided portable hard drive case. I couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Jensen",
      "helpful_votes": 0,
      "publication_date": 20120721
    },
    {
      "title": "OK with ipad, most androids, but kindle...?",
      "text": "I was introduced to go flex satellite by a good friend and was fascinated. It works well with most android and he had an iPad & an Asus transformer. BUT a coworker saw mine and bought it for his girlfriends kindle-- not so good. Problem with the kindles media remote app...it doesn't seem to read the go flex satellite & its doesn't want to download go flex remote apps...huh? Well, Good news! I found a free file manager that's great for android tablets...Total Commander reads and moves Go flex satellite files with better ease.",
      "rating": 4.0,
      "verified": true,
      "author": "Dmont1",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Purchased for a gift",
      "text": "I purchased one for a gift and then a friend purchased one from my recommendation. Out of the box, my friend had no issue with recognizing the hard drive on his Windows computer and he loaded it with movies and music. His problems began when he tried to stream the video to his IPAD. Either it would stream or it would start then stop. I suggested he go the website and update the drivers and he did and had immediate success. He likes it and is considering the 1tb version for his next purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "bluesy",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Great product",
      "text": "Love it works great with my iPhone and iPad mini to watch store movies and tv shows. Even the protected items that I downloaded from iTunes play great. The newer model offers twice the storage. Still hard to argue with the benefits of having all that media at you finger tips. Small, good battery life streaming movies so far. It will also connec t like a standard USB HDD so gives you multiple mounting options for use. Down side can only be used in Wifi or USB mode not both at the same time loose on star for that.",
      "rating": 4.0,
      "verified": true,
      "author": "deathknight8338",
      "helpful_votes": 0,
      "publication_date": 20130319
    },
    {
      "title": "Excellent Solution!",
      "text": "After all the bad review, i was skeptical if it going to work at all, but so far so good. 1st I update the software the load the video to it via usb. All play on my iphone 5, ipod touch 4, and iphone 4 with out a glitch. Easy to use, massive 500GB, cool portable charger. This will work great on our vacation. I know the product is not gonna be flawless. I expect wireless device to have issue time to time. But so far, stream 720P movies from the HDD just fine. No buffering",
      "rating": 5.0,
      "verified": true,
      "author": "Oh",
      "helpful_votes": 0,
      "publication_date": 20121207
    },
    {
      "title": "Seagate Goflex Satellite 500 GB purchased on Amazon.",
      "text": "I just purchased the Seagate Goflex Satellite 500GB and was very excited to be able to store movies to be played on my I-pad while travelling. No such luck I experienced problems from the beginning trying to download from Amazon instant video (my Library) would not play wrong formatt. I downloaded to my i-pad from amazon directly no problems worked great. But this is not why i wanted the storage 500. I experienced many diappointed actions such as being told i have to purchase another gadget to make it work, the unit also locked up. When I purchase a gadget I expect it to work as described. I'm sending it back today!",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Koch",
      "helpful_votes": 0,
      "publication_date": 20120920
    },
    {
      "title": "outstanding ¡",
      "text": "Perfect for my lifestyle, discover that i can also connect my wireless internet was a bonus for me, handle the information between my lap and my iPad, not only music and video but my daily office work, is something easy and I don't need a to be online all the time like I have to using google drive or dorbox. Family travels have become more quite for me as a driver, kids enjoy watch their own movies in their tablets son no complains about which movie see first.",
      "rating": 4.0,
      "verified": true,
      "author": "the kiiler tomatoe inc",
      "helpful_votes": 0,
      "publication_date": 20120920
    },
    {
      "title": "Awesome!",
      "text": "I love this product. I bought it for my Kindle Fire and I downloaded a Free Video Streamer/Player which works awesomely! I have had two devices watching movies so far and no skipping or lag. Perfect for traveling! Also, please do not purchase the Case Logic Portable EVA hard drive case which is recommended by Amazon with this HD. The Case Logic case is not bigger enough for this HD!!!",
      "rating": 5.0,
      "verified": true,
      "author": "digitalbeachbum",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "Where was this 5  years ago",
      "text": "We load movies on it for trips and stream up to 3 devices. The firmware, internal webpage and app have been completely overhauled and simplified because they were all poorly tested prior to product launch. It works great now. I have not tested batter life because we have used the power cord in the 12V SAE outlet. It would be better if it had 1T capacity instead of 500G. It could also be improved if the USB and WiFi could be used simultaneously.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Ward",
      "helpful_votes": 0,
      "publication_date": 20130130
    },
    {
      "title": "Great companion for any mobile device.",
      "text": "Android or Apple - play music, movies, and TV shows, store documents and pictures, and see them all through the free app on your device. It's 500 GB so you will pay for the space, but this is a highly useful product that works very well. I take it on every trip. Down side, the unique power/data cable - don't lose it. Connects via WiFi so you can't send/receive emails or other data. But hey, you're watching a movie anyway!",
      "rating": 4.0,
      "verified": true,
      "author": "David Hocutt",
      "helpful_votes": 0,
      "publication_date": 20130909
    },
    {
      "title": "Keeps freezing during wireless playback of movies",
      "text": "Everything is updated. Have no problems loading stuff. My complaint is it will freeze during wireless playback of a movie almost every time. The drive will freeze, and the iPad software will also freeze. When I restart the drive it has lost the place in the movie and starts it from the beginning. Very annoying, and I basically find myself not using it because of this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "A Mom to 2",
      "helpful_votes": 2,
      "publication_date": 20121122
    },
    {
      "title": "Lots to learn",
      "text": "Unfortunately, the only intructions are embedded in video files on the hard drive itself. There's very little to even tell you how to connect it or charge it. It seems to be a nice hard drive, but you'll have to do some digging to learn how to use it and make it sync with your iPad, computer, etc. Let's just say, it's not all that user friendly right out of the box.",
      "rating": 3.0,
      "verified": true,
      "author": "popskirk",
      "helpful_votes": 3,
      "publication_date": 20120504
    },
    {
      "title": "Nice device",
      "text": "This has been a great little device to have. We have two young children and on long trips in the car or on the plane this has really helped keep them at bay. It is nice to be able to put all our videos on the hard drive and not take up space on our iphones or ipads. The only issue I have with it is it can sometimes be picky about connecting but normally we have no problems with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony P. Brown",
      "helpful_votes": 0,
      "publication_date": 20121224
    },
    {
      "title": "Works Great with HP Touchpad",
      "text": "I've had the Goflex Satellite for a few months now and love it. I use it with the kids Touch Pads and my I-phone. I was little worried about how it would work with the touch pad, but so far I have had no problems. I must say though I use BhomePro App to play the movies, and I convert them to MP4 before I put them on the Goflex. So far so good, if you have the touch pad don't be worried, it works great. Also Amazon sells the Goflex at a great price it was only $149, when I picked it up.",
      "rating": 4.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20120327
    },
    {
      "title": "Probably the most expensive paperweight you will ever buy...",
      "text": "What a worthless piece of crap. The instructions are flat out wrong, telling you to download an app that does not exist under the name they give you. Even if you can figure out the correct app name, nothing about it works as the instructions say it should. I now have a $100 paperweight. Seagate tech service is no help either.",
      "rating": 1.0,
      "verified": true,
      "author": "paperhanger",
      "helpful_votes": 2,
      "publication_date": 20150812
    },
    {
      "title": "ok i'm bias but still ...",
      "text": "I have been a fan of Seagate for more years than i like to admit - ok i'm really old so there :^P Seagate's after sales service & support impressed me many years ago so i have stuck with them where possible. Yes, like every other electronic device they do break but i have never had a complaint about the level of support i have received. With my life now being increasing mobile & wireless the features offered by this simple idea are a great advantage to me. This unit, my iPad & Epson projector have made teaching on the go a whole lot easier lol",
      "rating": 5.0,
      "verified": true,
      "author": "Bungy",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Seagate Works Great",
      "text": "I use this device with my iPad and iPhone and have no problem more serious than a slight delay connecting to the wifi. I primarily use it to store movies and TV shows. My 64G iPad is totally clogged with apps and a couple of videos. I definitely needed more storage! Moving vids from the PC is utterly simple. Direct connection to the TV is very easy with the Apple Digital AV Adapter. also appreciate that the plug input is 100-240V which allows me to charge the device internationally. Charge life is very good. Keep in mind, this device is best used in conjunction with the iPad.",
      "rating": 5.0,
      "verified": true,
      "author": "WehoEuro",
      "helpful_votes": 0,
      "publication_date": 20120806
    },
    {
      "title": "Not what you think for PC, okay for ipad",
      "text": "This sounded like a great product. It was easy to install, but when it comes to use, not user friendly, does not act like an external hard drive. Cannot access using 3rd party software, must use GoFlex interface. For Ipad, works okay to view photos and play music. If this is your main or only reason to look at this product, might work for you, else you can get 500m storage for much less.",
      "rating": 2.0,
      "verified": true,
      "author": "Sleepless in White Plains",
      "helpful_votes": 0,
      "publication_date": 20110702
    },
    {
      "title": "Reliable Drive",
      "text": "The storage drive is large, has fast access speed, and has performed without problems so far. I use this as an external drive for my iPad and have traveled around the world with it. The only issue I have is that you have to swap out a cover to DL files to it, a different cable from the charging one. That makes it less convenient in that you have to bring along both with you.",
      "rating": 4.0,
      "verified": true,
      "author": "J24",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "usable but clumsy.",
      "text": "This is, no doubt, a possible way to get 500GB storage for your iPad. But the interface/software is clumsy to the point of almost loosing it. Especially if you have lots of movies, including TV series, you will find it inconvenient that the interface chops off the titles after just a handful of letters - so if the first 15 characters of each clip in the series is the same, you will have to guess which is which. And good luck if you can't remember whether the title started with \"the\" or not... Switching back and forth between WiFi networks is also quite cumbersome.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerome A Smith",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Great Product - Worked Exactly as Stated!",
      "text": "I read a lot of the reviews of this product before giving it a try. I got it yesterday, and I have to say, so far I'm very impressed! Set-up was simple, and it works exactly as promised. I didn't have any problems at all with the set up/software installation (Mac OSX 10.7.5), and just dragged and dropped all of my videos on to the drive. This will be great for our annual drive out to Chicago for the holidays, so the kids can watch just about any video they want.",
      "rating": 5.0,
      "verified": true,
      "author": "mlg1017",
      "helpful_votes": 0,
      "publication_date": 20121215
    },
    {
      "title": "Works. Could be Cheaper.",
      "text": "A bit pricey but needed it for my ipad2 (16GB Wi-Fi Only). Works like any other external drive with my PC, just drag and drop files. Very easy to pair with my ipad2. Considering the price, a carry case or pouch should be included. 5 hours of usage per full charge seems a bit too short. The apps need a lot of improvement (but that's another story). Overall, this will do until a better one comes out.",
      "rating": 3.0,
      "verified": true,
      "author": "LivingInParadise",
      "helpful_votes": 0,
      "publication_date": 20110905
    },
    {
      "title": "i have 4 of these now.. i must love them",
      "text": "easy to use, works great this product does everything is said it would in the advertisement, it was packaged well and arrived quickly. this product will be very useful and I am very happy with the purchase. I would highly recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "darin",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Would be a good product if I could charge it.",
      "text": "I was able to use this after the initial loading and charge but have not been able to charge the drive again. Have tried substituting components to try and trouble shoot and have narrowed the issue down to the AC Adaptor. Unfortunately with the provided adaptor get no response when trying to charge. With one from another piece of hardware the device appears to be charging (lights up, etc.) but doesn't actually get a charge. When it actually had a charge the device was exactly what I wanted, but since I cannot get it to charge again it has become just another paper weight. Unfortunately I am not in a place to return the product now or I probably would.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20120329
    },
    {
      "title": "Wait till there is a better version",
      "text": "I bought this harddrive to store my kids Cartoons. The interface is a little clunky and hard to use. There is no way for me to change the ipaddress . There is also no way to access the harddrive without a browser unless you use the usb cable. I have tried using the hdd with a laptop, samsung galaxy s3 , tablet with cynogenmod and both generations of kindle, even with the app its a little clunky to use.",
      "rating": 3.0,
      "verified": true,
      "author": "KM",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "Great concept and works great when it works",
      "text": "I purchased two of these as gifts. Great concept and works great when it works. One quit working within a couple months and the other within a month. Because I had them outside return date with Amazon, I have to go through Seagate. I am normally a Seagate fan but these things don't last...Very frustrated!",
      "rating": 2.0,
      "verified": true,
      "author": "Scdiver1",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Difficult to use",
      "text": "The size is great. It is very difficult to use. Difficult to get new firmware to load then to move media over. If you down load the auto sinc it moves all your media, all your documents onto drive. I lost a lost of my documents. Not sure I would recommend to others.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Booth",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "Works Great So Far!",
      "text": "Well worth the price paid for this. A brief sale of $99.99, and we had to grab it while it was this price! This was a gift for my son, and he's already loaded some of his itunes video's on it and it works great with his iPod Touch. It will come in handy for a trip he's about to take.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce A",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Travel Companion",
      "text": "Was going back and forth on getting this for a while but decided to get it, best purchase I've made in a while. Though I have more movies then I can fit on this, doesn't matter, I can keep my kids occupied while on a road trip and the peace and quiet from that is more then worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi Glenn",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Limited Usefulness",
      "text": "The disk works fine but only has about enough battery life for one movie. I am disappointed that it will not play when plugged in to either the computer or the power cable. This really limits it's usefulness. I'm mainly using it as a backup for my media files at this point.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Taylor",
      "helpful_votes": 0,
      "publication_date": 20140823
    },
    {
      "title": "Not bad,but a lil goofy",
      "text": "It's a regular drive until you try to go wireless. The connection process is touch and go. You have to detach from your WiFi router to connect to this drive via software or browser. If you've updated the firmware and the software is up to date, it might just connect. Good luck.",
      "rating": 3.0,
      "verified": true,
      "author": "Eaduja",
      "helpful_votes": 2,
      "publication_date": 20120423
    },
    {
      "title": "Great hard drive",
      "text": "The hard works great. I loaded all of my content on to this hard drive and it works like a charm. The only thing I do not like is when I go to the video section and I have a bunch of weird label fines because it is parts of a movie that it is just separate. It works great but there are file in the section that I am not sure if I need them or not and I have to scan through them. Other then that the hard drive is great. I saves me a lot of space that I am not using on my iPad.",
      "rating": 4.0,
      "verified": true,
      "author": "Mellow_nique",
      "helpful_votes": 0,
      "publication_date": 20130202
    },
    {
      "title": "Seagate GoFlex Satellite Mobile Wireless Storage 500GB External Drive",
      "text": "Compact and nice and easy to carry. I have used this on my iMac, my MacPro, and my Sony laptop with no problems at all. Easy to set up and you are ready to save stuff from Mac and Windows. Hope it lasts a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Tarin",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Defective Product...\"Be Warned...Don't Purchase Seagate!!\"",
      "text": "Purchased Seagate External Hard drive from Amazon as a back-up before deploying to Afghanistan. Product stopped working and drive can not be detected. I upgraded software as per directions and now I do not have access to my saved information on the this hard drive. Item has not been dropped or damaged...it just stopped working!! I can't not even access wifi on the product. I have tried contacting customer service and they have not been responsive.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger Edward",
      "helpful_votes": 2,
      "publication_date": 20120518
    },
    {
      "title": "Handy family item",
      "text": "I bought this to store my movie library, especially useful when traveling. Pros: easy to use, multiple users at same time, near-instant streaming. Cons: short battery life, poor support documentation. Overall I was very satisfied with this. My family loved being able to watch what they wanted, regardless of what someone else was watching",
      "rating": 4.0,
      "verified": true,
      "author": "MarathonMom26.2",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "Seagate GoFlex wireless external hard drive",
      "text": "I purchased the Seagate GoFlex wireless external hard drive on impulse. I only reviewed Seagate's technical spec's. Overall It has preformed well, using the sales spec's as a guideline! The battery life could be longer given the promises made, I have not gotten anywhere near the 7 hours advertized. It is great as a file sharing device between the IPad and notebooks and with media streaming, Just be sure to keep a power source handy went traveling. Overall I like and will use the Seagate GoFlex wireless external hard drive, while I look for a better fit to my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Dublin_rfk",
      "helpful_votes": 0,
      "publication_date": 20120529
    },
    {
      "title": "Works great!",
      "text": "I bought this to stream TV shows to my ASUS Transformer and Acer Iconia tablets in the car. It works great. The app/user interface leaves a lot to be desired but it does work. My nine and 11-year olds figured it out quickly. I downloaded the new upgrade and now I can connect the GFS to a wifi network for internet access. If you're going to stream to iPhones or iPads, the files have to be in the mp4 or m4v format. Most of my files were in the mkv format and they work on my Android tablets but not on iPhones. I'm very happy with my GFS and I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Charley Chiang",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "AWESOME!!",
      "text": "Answers all my question relating to adding memory to my iPad/Google tablet. This is a great product and instantly increase you tablets memory. The wi-fi connection is good but at times you do get a minor hiccup but just disable and then enable. I highly recommend this product. In contrast, when 3 tablets are streaming, the battery dies extremely fast. Good thing it comes with a car adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Vega",
      "helpful_votes": 0,
      "publication_date": 20130610
    },
    {
      "title": "Works ok as iPad media server",
      "text": "I like to have all my pictures readily available for display on my iPad, got way too many to keep on it. There is a noticeable delay at each picture when using a slideshow. Wifi works well for streaming videos. Also serves as a backup to all of my pictures that I keep organized on my laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "Zootz",
      "helpful_votes": 0,
      "publication_date": 20121125
    },
    {
      "title": "Streaming is so so, interface is crap",
      "text": "I am expecting this to be a wonderful product, there are 3 flaws. Firstly, the software interface is horrible, it was like using a 30yr old macintosh. At the age of iOS and android, why seagate didn't spend more effort to make it more user-friendly and nicer, I don't understand. Secondly, when I stream videos, it is unable to stream the subtitles. To me this is a minus. Thirdly, stream is not smooth at times, Any, since buying it, I use it religiously for the next few days to try it out, but not so much after that.",
      "rating": 2.0,
      "verified": true,
      "author": "Philip O",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Best...Thing...Ever!",
      "text": "Shipping was on time and I have a PC so right out of the box I was dragging and dropping my music within minutes. I heard complaints of it not organizing your music but there must have been an update or something by now because it displays my music in a very friendly way: song, artist, album etc. I use the GoFlex with my Iphone and the only con I can find is that it crashes sometimes when I switch from the Goflex to my home screen too much. what I love most about the Goflex is that it frees up a lot of the storage space on my devices. 2thumbs up and 4 stars :)",
      "rating": 4.0,
      "verified": true,
      "author": "LethargicSumo",
      "helpful_votes": 0,
      "publication_date": 20121211
    },
    {
      "title": "does not work as advertised",
      "text": "I bought this as extra storage for the ipad and Kindle Fire. the media app is not available for the kindle Fire and when installed on my ipad it doesn't connect, so fairly useless. I can get it to connect via wifi to both but cannot see how to download video to my device which makes it fairly useless as I wanted to be able to download content to watch on planes etc. Yes I read the instructions and watched the getting started videos. Overall just a very expensive external drive",
      "rating": 2.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 3,
      "publication_date": 20120520
    },
    {
      "title": "Does not work!",
      "text": "I was very excited by the possibilities of this product, but alas, it doesn't work as advertised. It freezes up after a minute or less and must be reset in order to turn it off. I have updated it, taped the heat sink to it and still it is not working as a wireless device.",
      "rating": 1.0,
      "verified": true,
      "author": "Texasdiver",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "So Disappointed",
      "text": "Just received my GoFlex. Setup was a breeze. Upgraded firmware as instructed. HD movies (720p) freezes, audio is out of sync. Same problem with SD movies. The installed software (on PC and iPad3) was very slow to respond as was the wi-fi passthrough feature. Returning to Amazon for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "RGT",
      "helpful_votes": 3,
      "publication_date": 20120424
    },
    {
      "title": "Like the concept",
      "text": "Like the concept. Not real happy with the software. Could be so much more. Might risk trying alternative software. Really don't like having to decide between this or the Internet all the time. Would like access to both at the same time.",
      "rating": 4.0,
      "verified": true,
      "author": "ttfn",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Save your money!",
      "text": "I bought this with the expectation that it was easy to set up and to use, especially for my movies. I have exhausted the number of movies available on my iPad and thought this was the perfect answer to the rest of my videos. To begin with, the set up was difficult. It is NOT as simple as \"connect to your computer and the download begins\". It did eventually download my documents and my music but not my videos. I will give this a few more days and then if there is still a problem it will be returned. $200.00 is too much to waste on an item that does not work as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "frpaber",
      "helpful_votes": 2,
      "publication_date": 20110707
    },
    {
      "title": "Does exactly what it says it can do.",
      "text": "If you need a wireless external storage device that works via its on wifi source, this is the device to buy. Great for my iPad so that I can take all those photography videos with me and watch them whenever and wherever I am. Great price, great device.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Kenyon Farrar",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "Awful.  Firmware update does NOT work.",
      "text": "I REALLY REALLY wanted to love, or at least like, this product. I even paid for next-day shipping! However, when I set it up--exactly as the user guide states--it would not work. I am using it primarily with an iPad mini, but am also setting it up on my Macbook. I updated the firmware, as outlined on the website and the same thing still happens: I find the wireless network, I connect, and then it promptly disconnects. Over and over and over. I've tried setting up a different wireless name, a password, resetting the network configurations, reinstalling the app, connecting via the browser. NOTHING WORKS. Did I get a dud? Or is anyone else familiar with this issue?",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa P.",
      "helpful_votes": 0,
      "publication_date": 20130912
    },
    {
      "title": "It loads fast",
      "text": "I love tv shows, but I live out in the country so we have slow Internet. This thing works great because it loads so fast. You can skip to any part you want and not have to wait for it to load. It works great for people who need a lot of extra space.",
      "rating": 5.0,
      "verified": true,
      "author": "Ziggs",
      "helpful_votes": 0,
      "publication_date": 20120909
    },
    {
      "title": "Really very good.",
      "text": "I bought it for my kids in order to play videos on their tablets. I share the same video between an Iphone, a Galaxy phone, an Archos tablet and my Asus infinity tablet. Simply perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Frenchsimmer",
      "helpful_votes": 0,
      "publication_date": 20130118
    },
    {
      "title": "no issues but it is bulky",
      "text": "I haven't had any issues with this hard drive. backing up, setting up wifi, setting up wifi security have all worked well. The only drawback is how bulky it is compared to other 500 gb hard drives. but it's due to the wifi capability",
      "rating": 4.0,
      "verified": true,
      "author": "Win",
      "helpful_votes": 0,
      "publication_date": 20130111
    },
    {
      "title": "Good not great",
      "text": "Works well, Not a great product. Sometimes it won't recognize a movie that plays in iTunes or directly on the iPad. You have to fiddle with the process to make it work. But it does increase the storage capacity of my iPad.",
      "rating": 3.0,
      "verified": true,
      "author": "GAM",
      "helpful_votes": 0,
      "publication_date": 20130216
    },
    {
      "title": "Used with all my IPads, IPhones and even my computers.",
      "text": "This drive is great! I used it with all my portable devices, My IPhone, IPad, Andriod Devices, and computers alike. Plays all my music, plays my Videos and store all my picture and documents without taking up space of the Pads, cellphones and computer. Seagate WiFi Drive is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Kays",
      "helpful_votes": 0,
      "publication_date": 20130125
    },
    {
      "title": "Nice not to be tied down to a HD",
      "text": "This is the best thing sense sliced bread. I can download the information that I think that I will need and then go anywhere and get that information and work with it at my leisure. It's ideal for what I like to doing for work and play.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Harowitz",
      "helpful_votes": 0,
      "publication_date": 20130313
    },
    {
      "title": "Doesnt work",
      "text": "I spent couple of days transferring my movies for upcoming trip so that kid could be kept busy. This thing just doesnt work - the wireless connection keeps breaking up - playing even the smallest of the videos is pain avoid it!",
      "rating": 1.0,
      "verified": true,
      "author": "praveen",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "Works very well",
      "text": "Very good product. It works well every time and allows connectivity from multiple devices wirelessly and with USB. I have been very happy with it and only had minor issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Stuck",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Solid hard drive, works ok with iTunes",
      "text": "As a standalone hard drive, works great and has a long battery life. Has a program to sync iTunes files that works very well. However the program you use to play the iTunes file is hard to use - the more iTunes files you sync the harder it will be to use. Hope they fix this problem in the future.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Peer",
      "helpful_votes": 0,
      "publication_date": 20130210
    },
    {
      "title": "Perfect for a long trip",
      "text": "This was the perfect augment for our vans entertainment system. In addition to the DVD's we dropped a lot of our digital movies onto this drive and connected it to the entertainment system. No more are we there yet!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Davis",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Great Product",
      "text": "I purchased this item to digitally store my movies. We use the drive when travelling and at home. The only downside that I realized is that I need another one to store more movies on. Hopefully Seagate will recognize this winner and develop one with a larger drive. Still the 500 GB size of this unit will be more than adequate for most users.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott E. Sutton",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "Very good option",
      "text": "This drive works very good, with my ipad3 . The battery may not be longer than one hour, but you can recharge. Fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Rolando",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Great Product",
      "text": "The product is user friendly and is on the cutting edge of technology. I highly recommend it if you're a student that uses a computer, or an iPad like myself to write papers, listen to music and use a variety of programs all in one little device.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Monique Johnson",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "A real Lifesaver (when using Ipad/iPhone)",
      "text": "Preordered mine on Amazon, was thrilled to get \"early delivery than expected\" from Amazon. Opened up the box, connected up to my PC, dropped movie files (previously converted for ipad) onto drive, disconnected, found \"Goflex Seagate\" drive on my WiFi ipad, clicked on app and voila- all my files appeared on my ipad for choice of viewing. Great quality, a real lifesaver as now I can load up all my stuff on the drive and not worry about space limitations on my 32gb ipad. Works like a charm!!! (also connected via my iphone, works great there also! Plan on getting another when available!",
      "rating": 5.0,
      "verified": true,
      "author": "Konman",
      "helpful_votes": 0,
      "publication_date": 20110623
    },
    {
      "title": "Seagate GeoFlex Satellite",
      "text": "The overall concept is sound but the device and the software is truly half-baked. Anyone considering purchasing one of these should go first to the Seagate support site for the GeoFlex Satellite and read some of the customer complaints about the GeoFlex Satellite. Complaints range from Firmware issues and overheating during charging, to simply not doing what it is supposed to do. I have returned this item to the vendor today having wasted half a day trying to set the device up and get it to work.",
      "rating": 1.0,
      "verified": true,
      "author": "Antosh",
      "helpful_votes": 4,
      "publication_date": 20120102
    },
    {
      "title": "arrived broken- sent it back",
      "text": "this really doesnt offer the flexibility you might home. i had a lot of connection issues and sent the unit back. the constraints of the iphone makes this device pretty much useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Gilbertson",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "Not working and no support",
      "text": "I received my goflex satellite last friday and its nit working!! I turned it on and the wi-fi led turns green and nevers passes to blue so its not sharing files at all. I have being calling all day to seagate support but they just leave me on the line with no answer to my problems please help!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nicolas Franceschi",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "works great for me!",
      "text": "I am using my devise with an ipad2 most of the time. Pro's: * I found this devise really easy to set up, add files and retrieve them. * It only took me about 2 minutes to secure the wireless connetion. * The menu was easy to navigate. * video streaming was seamless, no lag so far, even when accross the room. Con's: * uses your wireless connection (can't surf web while listening to music) but I knew that when I bought it. I really do like this product!",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Pierce",
      "helpful_votes": 2,
      "publication_date": 20110913
    },
    {
      "title": "Overpriced but awesome",
      "text": "Been interested in this product for a while now, and have been watching the price for about a year. $200 for a 500 gb hard drive is a bit overpriced I believe. So when I saw it drop to $100 about a month ago, I purchased it instantly. Does exactly what it says it does and works fine, couldn't have expected more, although I am disappointed that a newer 1 tb model has been released (at the same price of $200). So for anyone thinking about buying this product for $200, don't. Buy the newer model instead.",
      "rating": 4.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20130112
    },
    {
      "title": "Cool Wireless HD",
      "text": "I really like it, but wish it held power for longer than what it does. Overall, excellent wireless HD for my IPAD and traveling..",
      "rating": 4.0,
      "verified": true,
      "author": "Kunani J",
      "helpful_votes": 2,
      "publication_date": 20130722
    },
    {
      "title": "Good product and idea",
      "text": "This is a good product to help expand your memory of your iPad. I bought a 32gb iPad and wish I bought one with more capacity. This is one way to get more space on your iPad.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Y.",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "What a great product made to work with the Ipad",
      "text": "This really helps me keep my Ipad still working and loaded. Excellent capacity. Though interference may occur sometimes but great overall.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20131129
    },
    {
      "title": "Not a regular read/write type hard drive",
      "text": "This wireless hard drive works ok after setup completely. But be careful it is only \"one way\", meaning that you can only read the drive from your IPad or tablet, you cannot write into the hard drive from your Ipad or tablet. In order to write or transfer the files into the hard drive, you have to connect it to your computer via USB cable.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Loh",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Convenient but hard to organize",
      "text": "It is convenient for ipad owner since there's no USB port on ipad. However, it is hard to organize the folder. Even though I create a folder, it doesn't show on the screen. Everything is everywhere. It takes time to find a file you want to. It also heavier than ordinal hard drive. I still think this can be an option to have extra storage to keep files, photos and videos.",
      "rating": 3.0,
      "verified": true,
      "author": "Hobicat007",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "Good item",
      "text": "Found it easy to use, was great for my Ipad. With this drive I can access a huge amount of data. I did find it better to drag and drop rather than using the software.",
      "rating": 4.0,
      "verified": true,
      "author": "Jchris",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "Won't connect to iPad",
      "text": "At this point, this device is a paperweight. I've spent over a week trying to get the drive to connect to my iPad even after updating the firmware. My iPad sees the device but will not connect. The Seagate support page is lacking in assistance Hopefully, my support request will yield better results. If not, this will be returned and I'll think twice about Seagate wireless products. Hopefully others will have better success.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Soderling",
      "helpful_votes": 0,
      "publication_date": 20130120
    },
    {
      "title": "great device",
      "text": "This device works great it is also nice to see they don't change software upgrades between product changes! Thanks Seagate..",
      "rating": 5.0,
      "verified": true,
      "author": "LumberKing",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Sweetest Little Hard Worker",
      "text": "I love, love, love this hard drive, I have downloaded all of my files for my I-Pad and it has worked flawless for months. I waited to see how this had drive performed and I can say I LOVE, LOVE, LOVE this little work horse. I wish I had found this before I bought my tablet i would have bought the cheaper less memory model and saved some money! I have the Samsung tablet also and it works flawless with is tablet as well. Thanks Seagate",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20120730
    },
    {
      "title": "Needs a bit more of work for perfection.",
      "text": "This concept is the best. However this drive needs some more time in the lab if it wants to be more non tech user friendly.It does what it is suppose to do just really have to work around the software.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaesco1",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "it was to complicated",
      "text": "The seagate didnt transfer My data from the kindle fire. And it was to hard to understand with my kindle fire hd",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie Campbell",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Might work for some...",
      "text": "I was disappointed with the software that allows access to files on this drive, and could not find an alternative. Returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephen Ingraham",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "nice item, and tecnology!",
      "text": "new product as advertised, perfect! I really liked it and a new experience! Thank you. recommend with 100% success !",
      "rating": 5.0,
      "verified": true,
      "author": "LEONARDO JOSE SEBBA",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "use it everyday",
      "text": "easy to carry, doesn't require to be plugged in, stores TONS of information. I recommend this to just about anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Pereeli",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Nice product",
      "text": "Product works ok as source for data. However it is to bad you can not manipulate (copy, delete or upload) files over WIFI from your tablet. You can download from the GoFlex to your tablet. I use it with an Samsung Galaxy Tab 2 10.1. Weird thing is you have upload capability in the webbrowser when connected to IE on a PC though. Still no option to delete or copy/move. If you could manipulate files over WIFI than it would get my 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "great product",
      "text": "this product is great. easy to setup. the best on the market for streaming to an IOS device. there are free alternatives that allow streaming if you have a wifi connection. however, with a ipad with wifi only and on a long trip in a car, this is a must have. I have a 16GB ipad with wifi only and with the amount of apps i have i only have room for 2 or 3 movies that can be stored on the ipad. this product solves my problem.",
      "rating": 5.0,
      "verified": true,
      "author": "nguidry",
      "helpful_votes": 0,
      "publication_date": 20121230
    },
    {
      "title": "Awsome",
      "text": "Got this for a 3200 mile road trip. It work better then I thought. We had multiple people using on the trip. This thing is a must if you have a Ipad, ipod touch, or smart phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Dahbin2012",
      "helpful_votes": 0,
      "publication_date": 20130129
    },
    {
      "title": "Not very nice for a product of this class",
      "text": "After 2 years of very light usage, the wireless part simply died. I could use the drive in direct USB connection, as a regular USB drive, but the wireless part just didn't work. Not very nice for a product of this class...",
      "rating": 2.0,
      "verified": true,
      "author": "SV_huMMer",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "It works but needed more space hence bought the 1TB vesion",
      "text": "It took me a while to get used to it and though it does get connected in my wireless Tablets and can be share too.",
      "rating": 3.0,
      "verified": true,
      "author": "Jose M. Garcia",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Get a USB 2 cable if your pc or hub are just 2.0",
      "text": "WARNING: If you have only USB 2.0 connections from your pc or hubs to connect to you'll have to use the USB 2.0 cable only. I didn't know that and plugged the drive in with the supplied 3.0 adaptor. That blew my external External hard drive (2.0) so now it's not seen from my system. Ouch! So, be safe and understand that USB 2.0 & 3.0 compatibility only means that USB 2.0 devices can be plugged into 3.0 ports and NOT the other way around.",
      "rating": 3.0,
      "verified": true,
      "author": "Vaughn v. B. Sayre",
      "helpful_votes": 0,
      "publication_date": 20110705
    },
    {
      "title": "Great portable harddrive",
      "text": "Device works perfectly with my iPad using the Seagate app. Perfect for those long flights from coast to coast. Wifi connection worked just as I had hoped.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Craig",
      "helpful_votes": 0,
      "publication_date": 20130324
    }
  ],
  "product_meta": {
    "title": "Seagate GoFlex Satellite Mobile Wireless Storage 500 GB USB 3.0 External Hard Drive STBF500101 Black",
    "description": "FROM THE MANUFACTURER\n\n\n\nGoFlex Satellite mobile wireless storage allows you to carry your media library with you while on-the-go and wirelessly stream movies, photos, music and documents to your iPad, tablet or smartphone. The GoFlex Satellite device includes a fast USB 3.0/USB 2.0 connection and downloadable Media Sync software to easily transfer media and documents from your PC or Mac computer. The GoFlex Satellite device can store over 300 HD movies, so you'll never have to worry about running out of space on your iPad or tablet.\n\n\n\nStream and surf on almost any device that has Wi-Fi and a web browser\n\n\nAlways have easy access to your media with Seagate's free app\n\n\n\nThree different HD movies on three different devices-- all at the same time\n\n\nEasily access and stream your media library wherever you are\n\nEASY MOBILE WIRELESS STORAGE\nTake your media library with you. Stream it to your iPad. GoFlex Satellite allows you to take more than 300 HD movies on-the-go, and stream media over Wi-Fi to 3 iPads at the same time. You can also automatically sync media and documents from your PC or Mac computer. Satellite also enables you to stream media and connect to a nearby Wi-Fi hotspot to surf the Internet.\n\nYOUR ENTIRE MEDIA LIBRARY, NOW MOBILE\nThe GoFlex Satellite device goes wherever your iPad goes and lets you wirelessly access all your movies, photos, music and documents. No more worrying about running out of space on your iPad. Satellite offers 500GB of storage capacity, with up to 7 hours battery life and up to 25 hours standby time.\n\nSTREAM HD TO THREE IPADS SIMULTANEOUSLY\nThree different HD movies, three different iPads, all at the same time. Everyone in the family can wirelessly access the hundreds of movies you load on your GoFlex Satellite storage. Stream to almost any Wi-Fi enabled device using a web browser or the free app optimized for iPad. Up to 8 users can connect to the GoFlex Satellite to access photos, music, or documents.\n\nRELIABLE WIRELESS STREAMING WITH TABLETS AND SMARTPHONES TOO\nWith a GoFlex Satellite device in your backpack you can stream all of your HD movies to your iPad--without tangled cords or cables. A GoFlex Satellite device streaming wirelessly by your side means you can multi-task to your own beat. While you stream your favorite tunes or ebook, stay on top of email or surf your favorite sites. 802.11 b/g/n Wi-Fi connectivity delivers reliable skip-free streaming, with a wireless range of more than 30 feet.\n\nStream to almost any device that has Wi-Fi connectivity and a web browser--including laptops, Android phones and tablets, iPhone, iPod Touch and more.\n\nSIMPLE 1-2-3 SETUP WITH FLEXIBILITY BUILT IN\nSimply plug the GoFlex Satellite device into your PC or Mac computer and load your media. Next, charge it with the included portable wall charger or car charger. Now you're ready to start wirelessly streaming media to your iPad for up to 7 hours of continuous play.\n\nThe GoFlex Satellite mobile wireless storage device is part of the Seagate GoFlex Storage System. This innovative system makes it incredibly easy to upgrade or change the interface on your GoFlex Satellite device, so you can always get optimal transfer speeds when loading and syncing your media. Satellite includes USB 3.0 connectivity for fast data transfers (fully compatible with USB 2.0). Other available interfaces include FireWire 800 and powered eSATA using compatible cables (sold separately).\n\nWHAT'S IN THE BOX?\nGoFlex Satellite mobile wireless storage device, USB 3.0 USM adapter with detachable USB 3.0 cable, compact wall adapter with retractable pins, compact car charger, USB to DC cable, quick start guide, warranty.\n\n\n\nSEAGATE SATELLITE GOFLEX MOBILE WIRELESS EXTERNAL HARD DRIVE SPECIFICATIONS",
    "rating": 3.8,
    "feature_bullets": [
      "Carry your media library with you and wirelessly stream to your iPad",
      "Syncs the media and documents on your PC or Mac, so that you can take your library with you on-the-go",
      "Stream 3 different movies over Wi-Fi simultaneously to 3 iPads",
      "Never worry about running out of storage capacity on your iPad or forgetting a file at home",
      "Stream up to 5 hours of video on a single charge"
    ],
    "specifications": {
      "Product Dimensions": "6.3 x 2.13 x 6.69 inches",
      "Item Weight": "1.24 pounds",
      "ASIN": "B004Z0S7K6",
      "Item model number": "STBF500101",
      "Customer Reviews": "3.8 out of 5 stars621 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#1,452 in External Hard Drives",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 16, 2011",
      "Manufacturer": "SEAGATE",
      "Language:": "English"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "External Hard Drives"
    ],
    "price": 128.09
  }
}