{
  "website_summaries": [
    {
      "verdict": "More imposing twin-hook design to deter thieves. Has an improved lock housing for added strength.",
      "pros": [
        "Universal fit for a range of vehicles",
        "Cro-moly steel construction can resist sawing, hammering, freon, and prying attacks",
        "Locks without needing a key",
        "A good visual and physical deterrent against would-be thieves"
      ],
      "cons": [
        "Plastic coating has some peeling issues"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Car stolen easily",
      "text": "My car was stolen easily with this device installed... when it was recovered the device shown was in the back seat.",
      "rating": 1.0,
      "verified": true,
      "author": "Glortho",
      "helpful_votes": 168,
      "publication_date": 20190709
    },
    {
      "title": "WORTHLESS PIECE OF GARBAGE!!!",
      "text": "Ford F-350 was stolen With this Club on the steering wheel. Truck was recovered 3 days later and I thought there would have been damage to the steering wheel or metal filings all over the seat and the floor, but there were none. Apparently all the thieves did was bend the Club. They did have to use tools to cut the door lock out, but not to get the Club off the steering wheel This thing was worthless. I want my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 267,
      "publication_date": 20170630
    },
    {
      "title": "Bent!",
      "text": "We purchased this after my husband's car was stolen in hopes of saving ourselves another $500 insurance deductible. It lasted about a month before the car was broken into and the club was bent. This was in a highly visible public transit center with lots of cameras, so it must not have taken the thief much time or effort to render this product unusable. I am so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 209,
      "publication_date": 20171019
    },
    {
      "title": "Easy to remove...",
      "text": "Useless. Vehicle stolen. Did get the car back... no sign of the Club though.",
      "rating": 1.0,
      "verified": true,
      "author": "K Petersen",
      "helpful_votes": 32,
      "publication_date": 20180222
    },
    {
      "title": "I used this item only 6 or eight times and ...",
      "text": "I used this item only 6 or eight times and it is not working already. I suppose this particular model is defective because i have another one same brand that i have been using in another car for about three years with no problem",
      "rating": 1.0,
      "verified": true,
      "author": "Pedro Luy",
      "helpful_votes": 31,
      "publication_date": 20180221
    },
    {
      "title": "Stopped working after three weeks",
      "text": "Worked for like three weeks, now it wont even lock, the metal bar just comes off loose no matter how much I mess around with the key.",
      "rating": 1.0,
      "verified": true,
      "author": "Juan L.",
      "helpful_votes": 26,
      "publication_date": 20180116
    },
    {
      "title": "Its not a solid",
      "text": "Some tried and almost succeed but they manage to bent it off, it probably took them a while but they still manage to take it off, if the club was solid instead of a hallow piece, it would of stayed on",
      "rating": 2.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 12,
      "publication_date": 20180713
    },
    {
      "title": "Good Deterrent",
      "text": "I like the rubberized coating. Good grip and easy to lock. I’ve had no problems operating the lock itself though it doesn’t seem very high quality. I could see how a thief would be able to bend this but it would take a lot of effort. I got this to be a deterrent more than anything. I think it does that well. Keep a reasonable expectation about products like this. It’s a deterrent, not a sure fire way to prevent theft. 4 stars because I wish the lock and key were higher quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelli Hansen",
      "helpful_votes": 4,
      "publication_date": 20191021
    },
    {
      "title": "Failed to work.",
      "text": "Key was stuck, would not operate right out of the package. Glad I didn't put it on the car until I tested it.",
      "rating": 1.0,
      "verified": true,
      "author": "William Brooks",
      "helpful_votes": 18,
      "publication_date": 20170201
    },
    {
      "title": "Love this design.",
      "text": "I've had an older Club product that I've used successfuly for many years, but after losing a key, I decided to replace the device. The double hooked ends of this new device, straddle the steering wheel spokes, and I think that if a thief were to cut the steering wheel, they would have to cut it in 2 places, rendering the vehicle almost undrivable. I also like the bright yellow color that makes for a visual deterrent.",
      "rating": 5.0,
      "verified": true,
      "author": "L. South",
      "helpful_votes": 5,
      "publication_date": 20180714
    },
    {
      "title": "Feels Sturdily Made",
      "text": "I moved to Albuquerque this past summer and guess who's number one in auto thefts currently!!! If you said Albuquerque give yourself a prize! I like the dual prongs on each end. One way criminals overcome these is to cut the steering wheel, so this makes it just a little harder to take. I put on super tight too which I think makes it more of a pain to overcome. It is just a deterrent though. If they want your ride they are going to get it. I just hope this makes them look for a little bit easier vehicle to steal.",
      "rating": 5.0,
      "verified": true,
      "author": "diverdude",
      "helpful_votes": 5,
      "publication_date": 20171014
    },
    {
      "title": "Lock got stuck in the first week.",
      "text": "After just 3 days of use, it got stuck and I had a lot of trouble unlocking it. I had to hit it with a hammer to get the lock un-jammed before the key would work. I almost got stranded. Sad!",
      "rating": 1.0,
      "verified": true,
      "author": "ESH",
      "helpful_votes": 14,
      "publication_date": 20160625
    },
    {
      "title": "WOW!  PERFECT !!  STRONG EASY TO USE",
      "text": "Fits perfectly into the steering wheel and is easy to slide/adjust prior to the final 'lock' (you take the key with you/put it on your key ring) I love it is yellow: then potential thieves can see it prior to going up to the vehicle. Super strong. REMEMBER AFTER YOU PLACE THIS TO TURN YOUR STEERING WHEEL A BIT UNTIL THE STEERING WHEEL 'LOCKS' AND DOES NOT MOVE Then you have double protection",
      "rating": 5.0,
      "verified": true,
      "author": "Pat Davis",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Not safe at all, threw it",
      "text": "I'm disappointed with this product! After using a month, the lock couldn't be locked properly...I can feel it very loose, not firm at all. I had similar one, it always locked firmly, so I knew what exactly good condition look like. I think the quality is not very good, it's not as heavy as my old one...I can understand what are those bad reviews now regarding car still got stolen even using this product...So now I just throw this one in garbage and use my old one... I don't want any bad thing happened and realize how worthless this product is...",
      "rating": 2.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Exactly what I was looking for",
      "text": "I bought this after my car was broken into for the second time in three months. The police recommended it to me because, in my area, they have noticed that clubs are a bigger deterrent than alarms. It's very bright, and very visible to passerbys. It is very easy to use and put on. It comes with two keys and is fairly lightweight for it being an anti-theft device. The only downside is that it clearly states on the front that the $500 insurance deductible guarantee does not apply to my home state, Wisconsin, which sucks... Because that is where my car is being continually broken into. Anyway, great product regardless.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz C",
      "helpful_votes": 5,
      "publication_date": 20161030
    },
    {
      "title": "No longer locks after 2 months of light use. Junk",
      "text": "I've only had this for 2 months. It no longer locks. I don't even use it every day. There was no trauma to it or anything. It just no longer locks. I work in a very bad area in a bad city. I like having something to deter people from stealing my car. It's unfortunate that I had to pay for a product that fails at the only thing it's supposed to do, which is lock. If I could, I'd ask for a refund, but I doubt they would give it to me. So, that's awesome.",
      "rating": 1.0,
      "verified": true,
      "author": "FeatherpinTop Contributor: Eye Makeup",
      "helpful_votes": 3,
      "publication_date": 20180206
    },
    {
      "title": "Peace of mind, sturdy and easy to use.",
      "text": "I just bought a new car after mine was stolen and totaled. I’m wanting extra protection now and have read so many reviews of several steering wheel locks. I decided on this one and am very pleased. It’s heft gives me confidence in it. Easy to place on the wheel, then pull it somewhat tight and it self locks. Key works well to release. No form of security is 100% infallible. If a pro wants your vehicle, they’re going succeed. But this will stop the amateurs and joyriders. Great value and peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Gray",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Club 3000 Twin Hooks Steering Wheel Lock",
      "text": "Going on six years with this Club. It has become a little testy in that I have to wiggle the lock cylinder to remove the key. But, it still works. Keep in mind these steering wheel locks can all be defeated in less than a minute by experienced car thieves; the idea behind steering wheel clubs is to offer a visual deterrent. Don't rely solely on that to protect your car - add a kill switch and/or car alarm.",
      "rating": 3.0,
      "verified": true,
      "author": "Chuy!",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Piece of junk!",
      "text": "I put the key in and it wouldnt come out now their charging me over $8 to send back & $1 label fee what a rip off dont buy this thing@",
      "rating": 1.0,
      "verified": true,
      "author": "Irene",
      "helpful_votes": 8,
      "publication_date": 20170611
    },
    {
      "title": "Got this one for a work vehicle after seeing more broken window glass near my work than I'm comfortable with. Being familiar with the twin-hooks style",
      "text": "I have an older twin-hooks Club model for my personal vehicle (maybe an off-brand one?). Got this one for a work vehicle after seeing more broken window glass near my work than I'm comfortable with. Being familiar with the twin-hooks style, I can't go back to the 'standard' fork design. I really like that you don't need the key to extend it from the compact form, only to retract it from the 'locked' position. Less fumbling with keys is always preferred. As for function, these all work similarly - deterrence, not prevention. No model of steering wheel lock will deter a knowledgeable criminal with time. You just want to make it not worth the while for any opportunistic criminal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Easy to use.",
      "text": "This is a good product, easy to use, no hassel at all. The only reason I gave it 4 stars instead of 5, is that when you rempve it from the wheel, the bottom claw swings around and gets caught on anything it's near while I'm putting it away. We solved that by putting a couple of large scrunchies around top and bottom claws. They hold it together.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy Watson",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Visible Deterent",
      "text": "I bought this to have a bright yellow lock on the wheel as a deterrent. It fights perfect in my 96 suburban so that a person can not sit in the seat. The lock looks cheap and has a rubber filler in the side. The metal looks like it could be snapped with bolt cutters. I would not trust this to stop determined thief. May stop a crack head from trying. The unbreakable autolocks that go on the brake/clutch pedals are much better quality.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "It's a club, what more is there to say?",
      "text": "I have always liked the club as an added deterrent for my truck. The color is bright enough that its visible thru the window so that I appreciate. Easy on, easy off, and easily adjustable. Very heavy and it gives me peace of mind that it would at deter someone from breaking into my truck at least.",
      "rating": 5.0,
      "verified": true,
      "author": "AsianPhoenix808",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Maybe not a good buy......",
      "text": "According to the internet's, \"Lock-picking Lawyer; this device has a design glitch which allows the lock to be easily defeated. Nice to know this if you lose the key for this lock. Otherwise its not a secure lock.",
      "rating": 2.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Saved my truck!",
      "text": "There was an attempted theft of my F150 4 weeks ago, the thieves broke into the truck, trashed the steering Column and ignition system trying to get it started. They could only get one of the 4 hooks off the steering wheel so they gat up, even after disconnecting the transmission linkage. So all the pinheads got was a flashlight, 50ft of tie down rope and my Channel locks, ALL of a FELONY!!!!!!! Thanks to the CLUB for saving my truck!",
      "rating": 5.0,
      "verified": true,
      "author": "AgHauler",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Getting duplicate keys is problematic",
      "text": "I gave it 3 stars because before I bought it I enquiered if duplicate keys were available, and was told yes, and the info was in the literature. It wasn't so I called and was informed I could download a form, photostat the original key, buy blanks, then bring them to be cut. That wasn't what I was told, and felt there was a deceptive response",
      "rating": 3.0,
      "verified": true,
      "author": "Abercrombe",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great easy to use.",
      "text": "I lived in a neighborhood where it was like Grand Theft Auto. This is an affordable deterrent for theft.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Tarantino",
      "helpful_votes": 2,
      "publication_date": 20191122
    },
    {
      "title": "it's not a universal lock",
      "text": "The lock arrived today and I was very excited about using it for my car. They've tried to steal my car 3 times already it's not an easy car to steal but I decided to buy a lock as a second measure of precaution. I was disappointed because it didn't fit my car a linconl mkz. Thankfully my dad had a different lock in his car that actually fit my car and we ended up trading locks. overall the lock looks sturdy it just wasn't of use for my car.",
      "rating": 4.0,
      "verified": true,
      "author": "karina",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "So far so good!",
      "text": "I use this on my Honda fit because they are stealing the Airbags where I live. It covers the center of the steering wheel so I hope to dissuade any attempt to steal the Airbag.",
      "rating": 5.0,
      "verified": true,
      "author": "RicAndTheWorld",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Live in ABQ - you already know",
      "text": "I live in Albuquerque NM and its equivalent to satan's nether parts. The crime is insane, the people are worse. This played a part in keeping my truck un-stolen for nearly 2 years. Still works, keys are real keys. If it can survive this modern day warzone then itll work for wherever you live.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Worked great for a couple weeks until it randomly broke and I couldn't drive my car.",
      "text": "This lock was great until 2 weeks after buying it, I came back to my car in the parking lot and my key wouldn't open the lock. Now I can't drive my car. Got my wife to drive over with her key, and hers doesn't work either. Ended up watching a video on picking the lock (VERY EASY!?!) Once I picked the lock I could drive again, only wasted 3 hours of my life and now I don't have a way to lock my wheel.",
      "rating": 1.0,
      "verified": true,
      "author": "Lucas Weisensee",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Good product",
      "text": "I bought because there are a lot of thieves in Lexington KY. Even with this product with the advanced knowledge of this world anyone break and end you property by watching a YouTube to hack whatever there is. I bought this in addition to my security features of my vehicle.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenroy Williams",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Great claw design and $500 theft guarantee",
      "text": "An excellent product. I bought this for my sisters 2002 Honda Civic. The claw design seems far superior to other designs and it is very heavy. It expands without the key, but will not collapse unless you have unlocked it. This is useful because she can use two hands to pull it tight into the steering wheel. It comes with two keys (so I’m keeping one) it comes with a $500 theft guarantee if the form is mailed back within 3 days of purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Clara",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "The double hooks makes it extra sturdy! It does not slip at ALL on the ...",
      "text": "5 Stars all the WAY! The double hooks makes it extra sturdy! It does not slip at ALL on the steering wheel. I would think this would be a huge deterrent for a thief and at around $20 its kind of a no brainer if you are worried about your car at all. I would feel stupid if I lost my car and could have saved it for only $20. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "CerchOne",
      "helpful_votes": 6,
      "publication_date": 20160126
    },
    {
      "title": "Less than my expectations",
      "text": "It is heavy, takes a lot of space, I have to keep it in my trunk. A liitle expensive than other vendors for the same product. A decent buy, not completely satisfied, but needed it badly, so I bought it. Nice color of the product",
      "rating": 3.0,
      "verified": true,
      "author": "Pratik S.",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Dead on Arrival",
      "text": "I opened the product and the keys will not lock or unlock. Seems to me that either 1. send a wrong key or 2. The lock mechanism was jammed. Meaning the product was never inspected but just assembled and packed. Not sure why this product has so high ratings? 3. I had to return it for a refund",
      "rating": 1.0,
      "verified": true,
      "author": "Ramakrishnan Manivannan",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "NOT A GOOD PRODUCT",
      "text": "Bought this product 10/3/2019. Used it daily on my golf cart. On 3/14/2020 it took me over a half hour to unlock this product. Tried both keys, neither would work. Finally opened after 35 minutes of fooling with the lock. Do not waste your money on this. It should last longer than 5 months only being used once a day overnight. This product has been used only in Southern California so has never seen any snow or freezing conditions.",
      "rating": 1.0,
      "verified": true,
      "author": "Alan",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Locked itself right out of the packaging, unable to get key in!",
      "text": "I'm glad I tried this out before getting in my car! As soon as I got it out of the package, I pulled it up and despite multiple efforts, cannot get the key in to unlock it. Got a refund from amazon but still, beware, you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Stbknrlx",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Anti-Theft device for '78 VW Superbeetle",
      "text": "Simple steering wheel lock for 78 VW Superbeetle. Once locked cannot rotate the wheel. Bright yellow color even matches the car color. Only drawback so far is the locking cylinder holds onto the key - need to wiggle a lot to get key out once unlocked.",
      "rating": 4.0,
      "verified": true,
      "author": "Scooterdog",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Single Hook is a Better Option",
      "text": "Purchased this model along with the single hook version for our vehicles. Definitely prefer the single hook for ease of use in our Mustang, but the twin hooks certainly does the job in my '07 Frontier. Just a bit more of a \"struggle\" to align the hooks correctly.",
      "rating": 4.0,
      "verified": true,
      "author": "Rangers Fan",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "You may need to turn steering wheel slightly to curb for best fit",
      "text": "I like the bright yellow color to show it on steering wheel. However on my Van steering wheel has controls on 2 sides inside wheel which seem to interfere slightly when locking club. The way feet are made I wish they could have been slightly longer. Still better than old model which I also have.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Seems to work, I still have my car as of this writing.",
      "text": "I recently attended a lecture where I learned that my car happens to be #2 on the most stolen car list. I can't say it deters car thieves, as I don't know if it has or not, but I do still have my car, and it does give me peace of mind. Easy to employ, and I find that I'm still using it regularly after a couple of months, which was the real test in my eyes. With the double loops, I think you'd have a hard time cutting your way past this.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel M. Poppleton",
      "helpful_votes": 3,
      "publication_date": 20151226
    },
    {
      "title": "Just For Looks",
      "text": "I use this as a theft deterrent. The chrome bar is too thin and can be defeated easily. If a thief wants your truck/car and its out on the street this will not stop them. On the other hand they may see this and go on to an easier target.",
      "rating": 3.0,
      "verified": true,
      "author": "tailu66",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "wrong keys included, had to wrench club off steering wheel",
      "text": "The keys that came with this club do NOT work. They must be for another club. We almost got stranded in the middle of nowhere with a U-Haul because of this mistake by the seller. Luckily we were able to wrench it off the steering wheel of the truck, but the fact that that was possible means it's not very secure.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Gilbert",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Locks up tight!",
      "text": "This item is great for deterring the thieves. Auto locks as it clicks, no need for an extra turn of the key to lock. I have bought on a couple of these for my cars and they've all worked great",
      "rating": 5.0,
      "verified": true,
      "author": "NonnaBeth",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "MasterLock sells a less expensive, heavier duty one offered at Walmart (Juss Say'n)",
      "text": "The extended bar is very thin and I could see how a determined thief could easily bend it to remove the entire unit from the steering wheel.. I wish I would have bought the MasterLock one from Walmart. It was $2 less and seemed more robust then this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Rhonda Porter",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "I still have my car.",
      "text": "No one's stole my car yet. Appears sturdy and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Ellsworth",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Stopped locking after a month",
      "text": "Worked great for about a month before the lock just didn't work anymore. Too big for a paperweight, so it's just useless. Maybe I just got a defective product. If I had bought it from a brick and mortar store I would have returned it by now. Instead I have to navigate Amazon's Labyrinth. Actually; I just checked, and Amazon closed the window for returns a week or two before their product broke. What a scam.",
      "rating": 1.0,
      "verified": true,
      "author": "GeoMon",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "CLUBBING",
      "text": "After having a Car Alarm and still being robbed! I wanted extra protection. Not knowing how they got past that alarm system. (maybe Fob was cloned?) The Club is sturdy and pleasing to look at. Love the no-key locking feature!",
      "rating": 5.0,
      "verified": true,
      "author": "Rudy W. Rivers Jr.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "It only takes a moment to put it on. ...which is EXACTLY how long it takes to steal your car without it!",
      "text": "My daughter bought a car a month before I bought mine, and within a few weeks, it was stolen TWICE. Since I was buying the same type of car, I was on notice that I'd better buy a club, and I'm SO GLAD I did! The last time my daughter's car was stolen, she HAD the club, but was only planning to be gone for a moment, which was JUST how long it took to steal it!",
      "rating": 5.0,
      "verified": true,
      "author": "lynn",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Extra Protection",
      "text": "Excellent and easy to use in a new Acura. Even with the key less locks criminals have managed to get access to ways to electronically fool the locks. Once inside with push button starting all they do is drive away. This takes some time to cut off if one is even inclined to do so. Most car thieves just leave and move on to something easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen R. Herndon",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Much better than my old club",
      "text": "I've had a Club for my truck since 2000, and it only recently broke. Was so happy to find this model. Really like how it ratchets close, and the double hooks on each side of the steering wheel give a more solid feel. Got it in yellow for \"stay away, don't bother\" visibility. Really liking it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Suastegui",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Broke after 15 months light use",
      "text": "Initially liked the product, heavy metal with rubberized protective coating, however the lock mechanism broke after 15 months of light use and unit slides freely and cannot be locked, making it completely nonfunctional. Light use in that it was on an old truck used maybe once a month, so unit locked/unlocked less than 20 times since purchase. Now out of warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "SDHI",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Quality Product",
      "text": "I work on the outskirts of Milwaukee's north side, so I'm prone to auto theft. It's a shame I have to use this to begin with, but it's definitely done it's job so far. Car hasn't been stolen since I started using it. It's easy to quick put on and take off. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 5,
      "publication_date": 20160122
    },
    {
      "title": "Easy to use, great theft prevention",
      "text": "We purchased several of these for all of our family cars after the theft of one. They are easy to use, quick to install and take off, and have so far prevented any theft. We got into the habit of putting them on when we pulled in the driveway so we wouldn't forget. Inexpensive theft prevention!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary-Leah Moore",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "ITs a club",
      "text": "So far my car hasnt been stolen. Of course it wasnt stolen before I installed this either. But I feel more secure, so thats nice.",
      "rating": 5.0,
      "verified": true,
      "author": "One Reader",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Came with 2 keys, one doesn't work.",
      "text": "Using this on my '65 Karmann Ghia. Tried to unlock it to move the car and the key didn't work. Tried the other key and thankfully that one worked. Other than that, a good product.",
      "rating": 3.0,
      "verified": true,
      "author": "James A. Morrison",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "not recommended",
      "text": "Finally went to use it and the keys do not even fit into the lock. Now it is stuck in the fully open position. Complete waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "BookLover698",
      "helpful_votes": 6,
      "publication_date": 20171021
    },
    {
      "title": "Great product.",
      "text": "It does the job as long as you make you sure it's tight enough and pretend you are the jacker to see if you can snap it out in a timely manner which I've done several times, and never succeeded, unless there is a special technique using a tool. Otherwise, it is well made, good quality, and smooth key maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Lachgar",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great reliable car lock",
      "text": "This is a great visible lock. I’m unable to park my car in the garage so I reverted back to one of these that I used yrs ago. Impossible to break, so wheels are locked. I also have a car alarm , but this is what I depend on",
      "rating": 5.0,
      "verified": true,
      "author": "JGHOSPRN",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Bad lock mechanism",
      "text": "Something was defective with the lock assembly which prevented inserting the key to unlock. Good thing it was not yet on the steering wheel! Company’s customer service was very helpful and directed me to return to amazon",
      "rating": 2.0,
      "verified": true,
      "author": "Nandini",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Good deterrent",
      "text": "I use this for my truck I have to leave in storage on another island and I have less worries the truck will be stolen. I know any lock can be bypassed but it’s a deterrent",
      "rating": 5.0,
      "verified": true,
      "author": "Kauluhala",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great",
      "text": "The best thing is the auto locking. You don’t have to turn the key to lock it. Highly visible.",
      "rating": 5.0,
      "verified": true,
      "author": "hotshot",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Upgrade to double hooks...",
      "text": "Nice upgrade from previous single hook for more secure. But the best upgrade is you don't need the key to lock it, way more convenient, just pull to lock. The lock itself doesn't look solid as the club. Finger crossed.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay D.",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Beware of small pitfall",
      "text": "Someone broke into my car, luckily it was not stolen. However, they were able to remove the twin lock, but didn’t rake the car. I researched further about this lock only to discover that it is not full proof . There is a tricky way that this lock can be accessed from and entrance hole beneath the lock. I will continue using it until I find a better solution and hope that this menace does not return",
      "rating": 1.0,
      "verified": true,
      "author": "Nickkuhen",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Works as expected.",
      "text": "So far so good. It clamps onto my truck steering wheel pretty well and locks in tightly. I dinged a star because the packaging was already half open and cut across the top but the device itself still seemed new and unused.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug E.",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Locks instant its extended",
      "text": "Looks reliable, and easy to spot so its more likely to deter entry in your vehicle in the first place.",
      "rating": 5.0,
      "verified": true,
      "author": "R.C.",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Peace of mind, easy to use.",
      "text": "Peace of mind when I have to leave my \"classic\" car parked outside of the garage for extended periods of time. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Cameron",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Want it new and works",
      "text": "Second one i ordered key works this time. Package it came in was damage.This club seems to be used by the time i get one in thats in new condition my vehicle will probably be stolen🤪",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Easy to lock,Security features, Easy to use.  All in One",
      "text": "Easy to lock, Security features, Easy to use. All in One. what more can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Kim",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Great for traveling !",
      "text": "Use every time I travel and park my car somewhere new! Watched a guy from my hotel room walk up my car, check the handle, peer in the window, and walk away. He prob saw it was locked inside 😂🤙🏽",
      "rating": 5.0,
      "verified": true,
      "author": "Ry",
      "helpful_votes": 2,
      "publication_date": 20170810
    },
    {
      "title": "A greater sense of security with this installed!",
      "text": "I like it! I bought the single hook Club for my truck and it is a little loose and sloppy but this double hook is made sturdier and fits my Jeep steering wheel just right!",
      "rating": 5.0,
      "verified": true,
      "author": "Augie",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Lock is defective!",
      "text": "Buyer beware!!! Apparently a common defect that the key just stops working. Lock was working fine for a month and then suddenly, the key refuses to turn in the lock. Customer service was of little help but thankfully I have AAA and they were able to remove the club. Would not recommend because searching online shows that others have had this same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Marissa Fergerson",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Love it",
      "text": "Bought it as yet another level of security for my truck. Works great. The yellow color is flashy enough to be seen from the street which is what I wanted. A visual deterrent. Overall great product",
      "rating": 5.0,
      "verified": true,
      "author": "George Calonge",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Highly recommended",
      "text": "I bought two!!!! We love it! We do not park our trucks without using this lock! Super to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittney Klarissa Garcia",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Good item",
      "text": "Works like it should , it has double hooks . I know they still can cut the steering wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Safety for the car.",
      "text": "I got this for my grandson who is a freshman in college and parks his car quite a distance from the dorms. I told him that this sort of parking is a goldmine for car thieves. I sent this to him and he is very diligent about using it. At least he says he is. I have this exact same one I use even when I park at the 7-11. I have had my car stolen two times and have become paranoid about it..",
      "rating": 5.0,
      "verified": true,
      "author": "McPenguin5",
      "helpful_votes": 0,
      "publication_date": 20151009
    },
    {
      "title": "Easy And Secure",
      "text": "This is simple and fast to install and remove. Nobody without a key or a good metal cutting tool is going to remove it.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Harden",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Not 100%",
      "text": "The lock was not easily busted with a screw driver, however the metal cut right in half with a dremel, and truck was stolen. It helps but doesn’t prevent someone who’s prepared.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Not what I'd hoped for",
      "text": "Metal shavings fall out when opening/closing. Sometimes doesn't unlock or lock, metal feels cheap, surface rust below the cheap chrome paint, used as a hood prop momentarily and the rubber coating on the hook started sloughing off...would not recommended :(",
      "rating": 2.0,
      "verified": true,
      "author": "Hannah Herschy",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Peace of mind.",
      "text": "I live in Humboldt county, where crime rates are ridiculous. Came here for school. My car was broken into and stolen within 6 months of arrival. Luckily they found it a few days later in the town over, broken down, without a front tire. So yeah, I bought one of these. Fits well in my Honda, feels solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Lysergieyes",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Great deterrent",
      "text": "No one has tried to steal my van, so this works as a great deterrent...",
      "rating": 5.0,
      "verified": true,
      "author": "Chile'",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Very sturdy, easy to apply, easy to remove and BRIGHT color",
      "text": "So far so good - we bought the \"off brand\" to save $ and after 2 months, its in the trash - its past the 30 day return, and the lock broke, with it ON the wheel. Just luckily after about 20 mins. of working the key, it opened. So, ordered this as a replacement. The keys seem smoother and hope it lasts. BUT so easy to apply - easier than the one hook version we had. You can see it for a block on the wheel, so should deter break in at all - and has a 90 day warranty!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy L. Burdue",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Pretty, but that's pretty much it!",
      "text": "This product no longer works, and I've had it just over 6 months. I no longer locks! And, I am not sure why. I should have adhered to the low ratings. Hopefully, having in on my steering wheel anyway will deter folks from stealing my car again.",
      "rating": 1.0,
      "verified": true,
      "author": "Penny Gilmore",
      "helpful_votes": 12,
      "publication_date": 20150506
    },
    {
      "title": "Not happy",
      "text": "The plastic coating at the hooks was worn and peeling off the first one ordered. The second replacement had the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dano",
      "helpful_votes": 10,
      "publication_date": 20150319
    },
    {
      "title": "Mr. Bizy says...",
      "text": "Works great as a visual theft deterrent. Had my car stolen twice without one of these but since putting it on everyday it hasn't been touched. Seems to be holding up well and fits snug on the steering wheel around the thumb control spokes. Well made and durable. Will definitely buy again for other vehicles!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Bizy",
      "helpful_votes": 2,
      "publication_date": 20160122
    },
    {
      "title": "Great product - works exactly as described",
      "text": "Super easy to use. Locks without issue. Is bright yellow too so thieves see it when driving by. I’d definitely buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "Murphy Outdoors",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "so far so good!",
      "text": "Ive been using this for over a year on my 98honda civic.. i live in a neighborhood where cars are broken into and/or stolen, especially older hondas (including my mothers car) .. so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "NOT FOR PRIUS MODEL",
      "text": "Paint already came off some part after the original packaging was open before use. DO NOT get this if you have any Prius model, the twin hooks don't work on the wheel, still able to use it but very awkward n loose fit because only one hook can fit. Too bad the packaging had to be broken or else I would have exchange it.",
      "rating": 3.0,
      "verified": true,
      "author": "melonP",
      "helpful_votes": 2,
      "publication_date": 20160411
    },
    {
      "title": "Get what you pay for",
      "text": "Although all of these steering wheel locks can easily be thwarted, hopefully the mere sight of it will deter a car thief. Item appears solid however a weak spot is that cheap locking mechanism. I guess it works. No one has made off with my car in the last ten days.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hogan",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "The Club rocks",
      "text": "I bought the club to protect our classic Chrysler New Yorker on a road trip through multiple states recently. I felt completely safe in all motel parking lots, regardless of where it was. The club performed flawlessly and looks great as well. Not sorry for this purchase at all, and will buy more in the future if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "oldranger53",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Lost Money! Did not included the keys!",
      "text": "I lost my money here. The club did not have the keys.....",
      "rating": 1.0,
      "verified": true,
      "author": "Ricardo",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Key Tumbler needs to be improved.",
      "text": "Only had this lock for four months and it is sticking to unlock it. I tried to spray silicone lubricant and it still is refusing to unlock.",
      "rating": 4.0,
      "verified": true,
      "author": "hawaiiannovice",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Thin",
      "text": "Looks good locked in place but if I were a gambling man I think I could bend it off. Maybe use this with a well hidden kill switch.",
      "rating": 3.0,
      "verified": true,
      "author": "Phin",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Protect my vehicle",
      "text": "I had this exact product before sold it with my truck was very happy with it and re-ordered another one just like it",
      "rating": 5.0,
      "verified": true,
      "author": "Jerome W. Wringer",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "good car thieft deterant",
      "text": "Nice product that works fine and is less expensive than an alarm. Had car stole previous to this purchase, now someone stole my face plate off the stereo!? Starting to think civics are \"trash people\" magnates. This product seems to do what it is intended to do but does not ward off people willing to take anything.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Robertson",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "It works well for the price",
      "text": "It came damaged but really needed it so didn't return it",
      "rating": 5.0,
      "verified": true,
      "author": "conni",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Simple and Secure",
      "text": "I have one that I use on one of my vehicles and recently bought one for my daughter. It is a great deterrent.",
      "rating": 5.0,
      "verified": true,
      "author": "Conga Nopalero",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "the lock works great when locking or unlocking this item with one of ...",
      "text": "No problems whatever so far in fitting my steering wheel even with with a wheel cover, the lock works great when locking or unlocking this item with one of the two keys provided. It's lighter and easier to handle than the single hook club it's replacing. I'm hoping it does better than the one that someone placed on top of my single hook club (nothing is perfect or fool proof but. Frankly, prayer helps too. Luke 18:1).",
      "rating": 4.0,
      "verified": true,
      "author": "Redeemed",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Excellent I recommend that it's a good idea to have one..",
      "text": "This will save your car from the thieves once they see it's on the wheel..",
      "rating": 5.0,
      "verified": true,
      "author": "Basel",
      "helpful_votes": 0,
      "publication_date": 20200320
    }
  ],
  "product_meta": {
    "title": "The Club 3000 Twin Hooks Steering Wheel Lock, Yellow",
    "description": "Color:YellowThe Club 3000 Twin Hooks Steering Wheel Lock is a part of The Club line of quality products by Winner International. Prevent professional thieves and joy riders from taking your vehicle with The Club Twin Hooks. The Club Twin Hooks locks on to the steering wheel, making the vehicle impossible to steer. Its \"twin hook\" design makes it more durable and tougher to defeat, while keyless locking makes it easy to use. This product is guaranteed for up to $500.00 against the owner's comprehensive insurance deductible (not valid in New York, Hawaii, Texas, or Wisconsin, where it is prohibited by insurance law). Winner International is committed to providing products to meet everyday safety and security applications. From steering wheel locks to utility and everyday locks, to other safety necessities, the Club brand name guarantees that you are buying peace of mind. Expect a product manufactured for innovative, quality security and safety created by a team you can trust that's dedicated to serving and building safer communities. Why can you expect this? It is Winner International's mission.",
    "rating": 4.5,
    "feature_bullets": [
      "The twin hook design is tougher for thieves to defeat",
      "Universal fit that works on cars, vans, and SUVs. Max opening (inside of hooks) 365mm/ 14.4 inches",
      "New and improved lock housing for added strength",
      "The Club's patented self-locking feature locks with one pull",
      "Cro-moly steel construction resists sawing, prying, hammering, and freon attacks"
    ],
    "specifications": {
      "Manufacturer": "Winner International",
      "Brand": "Winner International",
      "Model": "The Club 3000 Twin Hooks Steering Wheel Lock, Yellow",
      "Item Weight": "3.5 pounds",
      "Product Dimensions": "5.3 x 6.5 x 24.8 inches",
      "Item model number": "3000",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "3000",
      "Folding": "No",
      "Cover Included": "The Club 3000 Twin Hooks Steering Wheel Lock, Yellow",
      "ASIN": "B004HNT4WQ",
      "Customer Reviews": "4.5 out of 5 stars2,223 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#466 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "Date First Available": "September 1, 2004"
    },
    "categories": [
      "Locking Devices",
      "Interior Accessories",
      "Automotive Parts & Accessories",
      "Automotive",
      "Anti-Theft"
    ],
    "price": 18.9
  }
}