{
  "website_summaries": [
    {
      "verdict": "You don't get much in the way of storage space, but this CamelBak is an excellent choice for people who are primarily concerned about portable hydration.",
      "pros": [
        "Minimalist, lightweight design holds 3 liters of water (around a gallon) and even has a small pocket for a tiny accessory or two",
        "Does not bounce, slosh or slow you down"
      ],
      "cons": [
        "This is not the hydration backpack to get if you need to carry accessories such as bicycle tubes, changes of clothing, etc"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Updated review...",
      "text": "The materials used is top notch, and the construction is excellent. The zippers are great, and the pull tabs on them are convenient. The bite valve covering and on/off switch are great designs. The bladder compartment is large enough to insert a couple power bars...very nice. No rubber after tasting water either! I figured out how to adjust the sternum strap...prior to that, it was very uncomfortable to wear. That's why I'd rated it with 4 Stars, but now it's a definite 5...after I figured it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Branden M.",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "I did not need the waist belt clipped and wore it more like a book bag",
      "text": "I am giving this item 5 stars because it worked perfectly for my use. I went to EDC NYC this year (2016). I needed to stay hydrated and didnt want to wait in line all day for refills. Filling this thing up gave me and 4 friends enough water all day (one additional refill).... I am a large man and the straps fit me well. I did not need the waist belt clipped and wore it more like a book bag, I will say that it looked like there was plenty of room for adjustment on all straps, and didnt cause any discomfort for the 7 hours at the festival (never even switched carrier)",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 4,
      "publication_date": 20160706
    },
    {
      "title": "Glad I purchased this.",
      "text": "I use this for Adventure riding on my motorcycle. Very comfortable, so much that I forget it's on my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Durfeemark",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Rings back memories from military",
      "text": "I used to hate wearing this, now I love it because it’s not forced upon me anymore. Unable to die of dehydration mow",
      "rating": 5.0,
      "verified": true,
      "author": "Angeleno",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Love my camelbacks for outside and gym activity",
      "text": "Great size with sturdy materials. Love to hike with a camelback especially in the heat. Also use it in the gym when sweating on the upright bike. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Nolan C. Babcock",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Awesome product, definite must-buy!",
      "text": "I love this camelbak. I bought it for a spartan race (13 mile obstacle course) and it might have save many people's lives (or at least it felt like it at the moment haha) but also took it with me to EDC and was everything I needed and looking for, Def recommend this if you need a camelbak!",
      "rating": 5.0,
      "verified": true,
      "author": "Sal K",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "Quality without doubt",
      "text": "I purchased this to make sure I have hydration capabilities with me whilst on duty at all time, and I am very pleased with this product! forget the other packs, this is the one to take a beating and still stand up!",
      "rating": 5.0,
      "verified": true,
      "author": "Dj Nexxus",
      "helpful_votes": 4,
      "publication_date": 20140430
    },
    {
      "title": "comfort",
      "text": "easy to run with but the nozzle is tough when your gasping for air and need to get some water when your running",
      "rating": 4.0,
      "verified": true,
      "author": "Everyday",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Great Hydration System",
      "text": "What more can you expect from CamelBak? Solid rugged construction that holds up under heavy use. I like how the plastic cap is hidden under a zip flap. I also really like how it has 6 D-Rings along the sides so that I can strap it to a MOLLE pack when needed. Also... its holds 3 liters of water!! Great for hot environments where the next water hole is a long way off.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20120306
    },
    {
      "title": "High Quality Product",
      "text": "Product came on time, as described, and the item was very high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan Sipser",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great for those long days on a trail",
      "text": "Wanted a high capacity but not bulky hydration pack and this one fit the bill nicely. The pack is very adjustable and the material is pretty rugged and durable. Even when filled with 3 liters of water the weight isn't awful and there is still room to stuff a few small items (granola bars) in the pocket. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "CamelBak ThermoBak",
      "text": "Greatly impressed with this product! Keeps water cold for a very impressive amount of time and is of fantastic quality. Insulated tube and bite valve cover along with the quick connect system and shut off valve are great touches of this CamelBak and are one of the biggest reasons I decided on this over others. Five stars, great product! Worth the money, fantastic quality of everything pack and bladder.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20131105
    },
    {
      "title": "Best friend for hydrating on the go!",
      "text": "This camelbak is awesome. It fits almost a full gallon and is perfectly sized to wear for short or long periods. It's well made and very durable. I have been using this same pack for over 3 years now and have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Gotta love the black",
      "text": "I've run countless races with this, taken it to concerts, I used it on long distance bike/long board rides, and hikes. Still works great.",
      "rating": 5.0,
      "verified": true,
      "author": "daniel chen",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Great",
      "text": "Very military like pack. Holds a great amount of water. Using it for music festivals. (EDC, Lollapalooza)",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Martinez",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Very comfortable and easy to disassemble",
      "text": "Great pack that is very comfortable while walking long distances and running. Since this was my first pack, I had no idea what to do with the really long hose, but if you tuck some in with the reservoir and have the bite valve tucked under the chest strap none of the hose bounces around.",
      "rating": 5.0,
      "verified": true,
      "author": "a2d2p",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "Amazing product. If you ride a bike",
      "text": "Amazing product. If you ride a bike, this item is a must for you. Buy an extra pouch and freeze it for long mountain biking rides.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer5390",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "It was awesome.",
      "text": "Yes it does taste like plastic when first use it but so did the canteen in Basic Training when I used it also. It fitted to my Tacticial vest with grimlocs using the D rings. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Harp",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "Great build material and it worked better than i thought ...",
      "text": "Great build material and it worked better than i thought it would. The amount of liquid it holds is enough for an extended run but light enough to not get in the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Jakob",
      "helpful_votes": 0,
      "publication_date": 20140420
    },
    {
      "title": "I really like the slim design and durable construction",
      "text": "I really like the slim design and durable construction. It is the only hydration pack I like besides the full military backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Kunzman",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "... the shipment was delayed but product is worth and good",
      "text": "Although the shipment was delayed but product is worth and good",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Functions as described. Mouth nozzle occasionally requires adjustment. ...",
      "text": "Functions as described. Mouth nozzle occasionally requires adjustment. No storage compartments. Bladder and delivery system are well made and efficient. Fastens against back and torso well. Tested in demanding, fast-paced environment.",
      "rating": 4.0,
      "verified": true,
      "author": "CDN_1",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "Held up through the DNC too!",
      "text": "It was everything that I wanted and was the perfect match! It arrived quickly and surpassed all my needs. It was perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaleigh Owen",
      "helpful_votes": 0,
      "publication_date": 20131004
    },
    {
      "title": "I can easy drink on the move on my motorcycle with having ...",
      "text": "I can fill it with ice and water and stay cold for 3 to 4 hours in 110 degrees heat. I can easy drink on the move on my motorcycle with having to stop..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Camelback Thermo is Great",
      "text": "My Air Force guy loves this pack and has used it many times for personal and professional needs.",
      "rating": 5.0,
      "verified": true,
      "author": "BCDavis",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "CamelBak Thermobak 3L",
      "text": "Good product, deffiantely alot tougher than the non-MI versions. I have several other CamelBak products like the BFM pack, this is just as good especially for short hiking excursions where you dont need to carry alot of stuff. Easy access to the bladder inside and it is pretty comfortable. Water stays at good temperatures and is easy to fill.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 0,
      "publication_date": 20120412
    },
    {
      "title": "Very Cool, Worth the Purchase.",
      "text": "I've used it several times, so not too heavy usage, but I have enough to say the quality of this is unmatched by any competitors. Buy a camelbak or don't buy a hydration pack. My only complaint for this product is that for the first few uses, the water does taste a bit funny like rubber/plastic but this is no issue or danger so I can tolerate this. Otherwise, perfect hydration pack to store water, with an additional pocket where I like to store my small notebook and papers from briefings/lessons. My friends said they loved mine. They get the boring old/used standard issue ones, but I have the flawless and fancy Camelbak.",
      "rating": 5.0,
      "verified": true,
      "author": "Collin",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "This is an amazing bargain. The camelbak is top quality and very ...",
      "text": "This is an amazing bargain. The camelbak is top quality and very durable. I added a magnet clip from osprey. Now its perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "David Hadley",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "This is the exact size",
      "text": "It's the classic brand, comfortable adjustment straps, easy access to the bag, clean it. It is really comfortable and has a long hose ideal.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 0,
      "publication_date": 20130723
    },
    {
      "title": "Great value 3 liter pack",
      "text": "I have been using this pack for about three months now. While working as a photographer the pack is great hands free way to maintain. Hydration in the extreme heat! I also like its large capacity of 3 liters.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Vaughn",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Cool pack",
      "text": "Keeps the water cold longer than other camelbak hydration pack. I could put the reservoir in the fridge overnight so i can have cold warer for my ride.",
      "rating": 5.0,
      "verified": true,
      "author": "Dagger",
      "helpful_votes": 4,
      "publication_date": 20130722
    },
    {
      "title": "Best for hydrating",
      "text": "Holds a lot of water and stays cool for hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Erick A. Lopez",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Utility",
      "text": "This camelbak is exactly what i expected it too be, useful on my runs high capacity and pefect for jogs karathons or whatever your into.",
      "rating": 4.0,
      "verified": true,
      "author": "CA",
      "helpful_votes": 0,
      "publication_date": 20130903
    },
    {
      "title": "Excellent hydration pack.",
      "text": "Sturdy construction with several plastic rings on which I can attach accessories. Purchased a pocket to tie there to hold gel packs and first aid. Holds water. Mouth piece has a protector on it to keep it from getting mud all up in it. Good stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch Caley",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "Great for skiing",
      "text": "Large capacity, zero leaks, very durable. I've had many other hydration packs. All of them leaked, were hard to fill, or were ugly. This one is outstanding. Worth the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Rakowski",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "it's like a fountain that never",
      "text": "3L is now my new standard, it's like a fountain that never ends",
      "rating": 5.0,
      "verified": true,
      "author": "Alex N.",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Great!",
      "text": "I wish I had bought this sooner. This is great to use during any occasion. I work in distribution , and it can get really hot. The water stays cooler much longer than if it was in a bottle, and it also enables me to hydrate while I work. Told some co workers to consider buying one.",
      "rating": 5.0,
      "verified": true,
      "author": "Music Lover101",
      "helpful_votes": 4,
      "publication_date": 20130625
    },
    {
      "title": "Camelback military grade",
      "text": "This is a heavy duty version of camel back. Everything about this is more durable than a regular camel back.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Prime Lover",
      "helpful_votes": 9,
      "publication_date": 20130413
    },
    {
      "title": "JLW",
      "text": "This product is AWSOME, first tru camel back i've owened. Money is tight right now but I'm looking forward to changing out a cheap resivior from a excellent Tactical back pack to a tru camelbak resivior.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason L Woods",
      "helpful_votes": 0,
      "publication_date": 20121007
    },
    {
      "title": "Great investment",
      "text": "Quick shipping and a great product over all. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "stephen novak",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Great !",
      "text": "Great overall product. Very quick delivery. Easy to use and very light weight and portable. Holds a good amount of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario Checchi",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Excellent Hydration System",
      "text": "Product arrived promptly and did not dissapoint. It is very comfortable to wear and holds a lot of water. Living in the Carribbean with 90o weather, it is good to know that your hydration system keeps your water cool for such a long time while out in the blazing sun!!! Very good Camelbak!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DELROCHA",
      "helpful_votes": 0,
      "publication_date": 20110928
    },
    {
      "title": "brilliant",
      "text": "Best thing since sliced bread...ive gotten rid of the botle in my hand so i have my 2 hands to work with...thanks you camel bak",
      "rating": 5.0,
      "verified": true,
      "author": "frank",
      "helpful_votes": 0,
      "publication_date": 20110127
    },
    {
      "title": "Great product",
      "text": "Came in good condition, including 2 cleaning tablets although the little arm thingeys for drying the bladder were missing. All in all great bag, the stitching fantastic, although major face palm on my part ... did not anticipate the lack of cargo space. The bag rides comfortably on my rides, no swaying of the bag due to the massive amounts of water on my bag. The D rings seem to be load bearing ... have not broken on me with a consistent 10kg load on long rides. The bladder does not leak and the bite valve still works. Took a while to figure out how to remove the bladder, which requires some force.",
      "rating": 5.0,
      "verified": true,
      "author": "Isaac Tan",
      "helpful_votes": 3,
      "publication_date": 20140313
    },
    {
      "title": "CamelBak",
      "text": "Product was new like stated. I received the item within the estimated time with no delays. Very satisfied!! Highly recommended!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony",
      "helpful_votes": 0,
      "publication_date": 20110820
    }
  ],
  "product_meta": {
    "title": "CamelBak Thermobak 3 Liter Hydration Pack Black 60304",
    "description": "Now with external fill access to the OMEGAÂ HydroTanium Reservoir. Its ergonomic design keeps you comfortable for hours. Low infrared reflective [LIRR] buckles, webbing, and materials on the Coyote and Army Universal Camo models provide an edge on the battlefield during night ops. With streamlined features, external fill OMEGAÂ Reservoir, and zippered front access panel, operators ask for it by name.The ThermoBakÂ can also be purchased with our NEW Chem-Bio Reservoir (4.0) which attaches easily to Type M, A, or S Gas Mask Adapters.Adapters sold separately (see Related Products).ThermoBakÂ 3L in 500D available in ABU and Digital Woodland.",
    "rating": 4.4,
    "feature_bullets": [
      "Black blends in with the night. And dark clothes."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "20 x 9 x 3 inches; 1 Pounds",
      "National Stock Number": "8465-01-532-6427",
      "Date First Available": "August 27, 2010",
      "Manufacturer": "Camelbak",
      "ASIN": "B00412CU74",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hydration Packs",
      "Accessories",
      "Sports & Outdoors",
      "Outdoor Recreation"
    ],
    "price": ""
  }
}