{
  "website_summaries": [
    {
      "verdict": "Asus updates the Eee PC line with AMD's excellent ultraportable CPU, making for a powerful, portable package, but the field is getting crowded in this category.",
      "pros": [
        "The Asus Eee PC 1215B gets a CPU upgrade, as well as excellent battery life and USB 3.0"
      ],
      "cons": [
        "The long-standing Eee PC design is starting to look more than a little dated, and comparable systems offer bigger or faster hard drives"
      ],
      "aspects": {
        "Design": 6.0,
        "Features": 8.0,
        "Performance": 7.0,
        "Battery": 8.0,
        "Support": 6.0
      },
      "publication_date": 20110617,
      "rating": 7.5,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Really nice mini laptop",
      "text": "This is more like a mini laptop vs a netbook. Likes: Speed vs an older netbook, screen resolution, web cam cover & operating LED. Dislikes: Keyboard bounce, having to tear it apart to upgrade the hard drive. Mine came with USB 3.0 and Windows 7 Home Premium 64 bit, scores a 3.8 on the Windows index with CPU being the low score. I did add a 2GB RAM stick before first boot for 4GB total. Ability to charge via the left USB must be selected on in settings, it is off by default. No trackpad issue so far. A very good value for a small travel netbook that can do HD video.",
      "rating": 5.0,
      "verified": true,
      "author": "4 of us",
      "helpful_votes": 0,
      "publication_date": 20110421
    },
    {
      "title": "Terrible touchpad, poor screen adjustment",
      "text": "My touchpad frequently freezes. I was too stupid to listen to others with the similar comments so I called Amazon.com and they assured me there was not a problem. Dumber than dumb was I and I bought it anyway. Very sorry. I am also too tall for this laptop. When I put it on a desk, I have to put a book under the front of it to get a decent image. Screen does not tilt back enough.",
      "rating": 1.0,
      "verified": true,
      "author": "RBP",
      "helpful_votes": 0,
      "publication_date": 20111012
    },
    {
      "title": "Great laptop, bad touchpad",
      "text": "This is a great laptop for the money. Feature rich, including USB 3.0, 320 GB hard drive, 2GB ram, HDMI output, and beautiful 12.1 inch screen. The only caveat is the Synaptic touchpad. Either their is a physical problem with it or the drivers are defective. It exhibits erratic behavior, even when I boot into Ubuntu. I have had to resort to a wireless mouse. Other than that, I recommend it highly.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20110518
    },
    {
      "title": "Asus 1215",
      "text": "Windows 7 is a plus. I actually like it better than my Asus 1225b. Handles both Bluetooth keyboard and mouse while multiple thumb drives are using the same USB ports. As a net book in the field and plugged into a 24in. monitor at home it is great tool for work,",
      "rating": 5.0,
      "verified": true,
      "author": "scott mullan",
      "helpful_votes": 0,
      "publication_date": 20140428
    },
    {
      "title": "EEE PC Does Deliver including the faulty track pad.",
      "text": "*EDIT* Unfortunately after having this unit for a day my track pad has indeed starting going whacky, I wont attempt to fix it myself and void the warranty. It isnt capable of streaming or even light HD playback. Not even youtube videos in 1080p. Very disappointed in it, and returned.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam2Lucky13",
      "helpful_votes": 0,
      "publication_date": 20110520
    },
    {
      "title": "dont buy, manufacturer defect on the touchpad",
      "text": "asus wont admit there is a defect in this model, but its well documented on the internet. I followed the online instructions to remove the extra pad under the touch pad & now it works perfect. Asus wanted me to send mine in, just so I will be w/out a netbook for a few weeks; then they were going to send me a brand new one w/ the exact defect. Boo Asus. Last Asus product I will buy. Support is terrible.",
      "rating": 2.0,
      "verified": true,
      "author": "J. A. Lehman",
      "helpful_votes": 0,
      "publication_date": 20110808
    },
    {
      "title": "Nice Computer",
      "text": "Works well. Has 1 USB 3.0. Takes 8GB ram. I have it dual booted with SUSE 11.4. Down side is very risky or difficult to disassemble for installing a SSD, and comes with an enormous amount of bloatware. Google \"ABR\" (Activation Backup and Restore) for hints on how to deal with the bloatware.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom L.",
      "helpful_votes": 2,
      "publication_date": 20110605
    },
    {
      "title": "I luv this thing..",
      "text": "Initially got a 1215B with only two USB ports, so I returned it to Amazon with no problems. Replacement arrived quickly and was complete. I'm old, and not too techy, but this thing really packs a punch.Learning Win 7 not too difficult, and I look forward to watching some of my favorite DVD's as soon as I figure out HDMI connections...I'd say \"Beginner's Welcome\" as it comes with excellent instructions and EZ operation. Beats a tablet all to hell.....bought the recommended extra memory,Kingston case with the extra pockets and the DVD player. I'm the envy of the techies down at the local Office Depot....",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20110615
    },
    {
      "title": "About Trackpad Issues...",
      "text": "I just received this baby this morning and im going directly to the point: There no trackpad issue so far. I always been a guy who doesn't care about not having a mouse around, because I really like the whole trackpad concept. And let me tell you that this awesome computer don't have any issue so far. Instead, this very powerfull netbook got those things that put this machine in a very nice spot. USB 3.0, W7 Home Premium x64, Bluetooth, great screen etc. Don't know if is just lucky or Asus got the trackpad issue solved, so I think is a good deal give this baby a try.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfredo Hernandez",
      "helpful_votes": 0,
      "publication_date": 20110701
    },
    {
      "title": "Much slower than my previous ASUS",
      "text": "I'm not impressed with this netbook. It touts that it's faster has an 8 hour battery life, etc. And it doesn't hold up to anything. It's also much, MUCH slower than my ASUS Eee PC 1005HA-PU1X-BK 10.1-Inch Black Netbook.",
      "rating": 2.0,
      "verified": true,
      "author": "Chic Kitty",
      "helpful_votes": 0,
      "publication_date": 20120515
    },
    {
      "title": "Touchpad Issues",
      "text": "Beginning with the first start up the touchpad was erratic. It would freeze for a minute or two. At times it would jerk and lurch around the screen during use. Other times it would work normally for 10-15 minutes, then suddenly stop working. I made many sensitivity adjustments with no effect. I also updated the driver and the bios. Using the Asus troubleshooter suggested that I contact Asus support. I shouldn't have to do that with a new PC. Ended up returning it to Amazon for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Fisher",
      "helpful_votes": 0,
      "publication_date": 20111228
    },
    {
      "title": "dismal performance",
      "text": "If all you need is to type an email, this might work for you, but put any nominal demands on it and the system slows to a crawl. Add to that an incrediblly unresponsive touch pad which after hours of recalibration is still so worthless that an external mouse is absolutely required. I would definitely NOT purchase this machine. I have just placed an order for a replacement notebook.",
      "rating": 2.0,
      "verified": true,
      "author": "mr4e",
      "helpful_votes": 0,
      "publication_date": 20110722
    },
    {
      "title": "So far not impressed",
      "text": "This was a gift for my son from Santa. He opened it Xmas morning and it worked for exactly one week. He charged it on New Year's Day and tried to use it the Monday after but it wouldn't power on at all. I tried taking the battery out and doing the hard boot, etc....no luck. Sending it back to ASUS today for repair which has me concerned as it is only a week old and i can only imagine what other issues may arise...will keep you posted. Told my son we had to send it back to Santa's workshop to be fixed...he is understandably upset.",
      "rating": 2.0,
      "verified": true,
      "author": "Yokie123",
      "helpful_votes": 0,
      "publication_date": 20120103
    },
    {
      "title": "awesome computer",
      "text": "For the cost this is a great computer and since I need something that I can leave on 24/7, this is great. Low cost but when I watch movies, it is crystal clear.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Estevez",
      "helpful_votes": 0,
      "publication_date": 20111108
    },
    {
      "title": "track pad defective out of the box",
      "text": "I just got my computer out of the box and within the first 30 minutes of using the computer the track pad had stopped working twice requiring a re-boot. I am returning the computer. Very disappointing as I have been excited to try it out but there's not point in installing any programs if I can't use the mouse!",
      "rating": 2.0,
      "verified": true,
      "author": "Kirsty Maciver",
      "helpful_votes": 0,
      "publication_date": 20111101
    },
    {
      "title": "Nice but touchpad is crap",
      "text": "Nice little netbook, thats great to carry around. The only complaints are that the case attracts finger prints like crazy, the touch pad issue which still isnt solved, and the speakers are on the bottom of the laptop making them hard to hear on soft surfaces.",
      "rating": 2.0,
      "verified": true,
      "author": "shuttlecock",
      "helpful_votes": 0,
      "publication_date": 20110706
    },
    {
      "title": "Display defects",
      "text": "I bought on two occasions, and these brought defects. The first hard disk and the second LED screen. Asus does not have global warranty, this is a problem because I have to pay for the repair. With respect to the operation, it has a good processor. This is a great netbook.",
      "rating": 2.0,
      "verified": true,
      "author": "Cristian",
      "helpful_votes": 0,
      "publication_date": 20120108
    },
    {
      "title": "\"Bestest\" budget power-netbook you can get",
      "text": "Considering the power, price and staying cool even under loads this is the best you can get for that money. AMD really did it with it's Fusion APU. Kudos!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikita Petrovs",
      "helpful_votes": 0,
      "publication_date": 20110512
    },
    {
      "title": "pleased client",
      "text": "This netbook is gorgeous. Excelent graphics card. Pictures are awesome when viewed on a large LCD. Doesn't build temperature, most pleasant to work long hours with netbook on my lap. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "mandreo",
      "helpful_votes": 0,
      "publication_date": 20110617
    },
    {
      "title": "Another defective touchpad",
      "text": "This could be a very nice computer, but, as with many others, the touchpad has proven to be defective as described in other reviews. I am returning it, but if the problem is corrected by ASUS, and I have not purchased something else in the meantime, I will try it again.",
      "rating": 1.0,
      "verified": true,
      "author": "riverlink",
      "helpful_votes": 0,
      "publication_date": 20110429
    },
    {
      "title": "very good!",
      "text": "its not noisy..very cute keyboard i also like the resolution.. touchpad is working fine... My only problem is my sweaty palms because it leaves fingerprints lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxanne",
      "helpful_votes": 0,
      "publication_date": 20110424
    },
    {
      "title": "No QA at Asus?",
      "text": "this touchpad is broken and is unusable... so i will have to fix it. Good job Asus!!! You must have a great quality control department!!",
      "rating": 1.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 3,
      "publication_date": 20110810
    }
  ],
  "product_meta": {
    "title": "ASUS Eee PC 1215B-PU17-BK 12.1-Inch Netbook (Black)",
    "description": "12.1\"/1366x768 (WXGA)/AMD E350 CPU/2GB DDR3/ATI HD6310 Graphics/320GB HDD/No ODD/Windows 7 Home Premium (32-bit)/802.11 bgn/10/100 LAN/Bluetooth 3.0/0.3M Pixel Camera/HDMI and VGA out/3x USB 2.0 Ports/2-in-1 Card Reader/56W/h battery (up to 8.5* Hrs)/1 Year Global Warranty, (6 months for battery)/Black. It has 1x USB 2.0 and 2 x USB 3.0.\n\nAMAZON.COM",
    "rating": 3,
    "feature_bullets": [
      "AMD E350 CPU; 2GB DDR3 RAM (1x2GB), 2 Slots, 4GB Max",
      "12.1\" WXGA (1366x768) LED screen; ATI HD 6310 graphics; HDMI VGA out",
      "320GB SATA Hard Drive (5400RPM); No Optical Drive",
      "Wi-Fi 802.11b/g/n; Bluetooth 3.0; 10/100 LAN; 0.3MP Webcam; 2-in-1 Card Reader (SD/MMC); 3 x USB 2.0 Ports; 1 x USB 3.0 Port",
      "Windows 7 Home Premium Operating System; Up To 8.5 Hours Battery Life"
    ],
    "specifications": {
      "Standing screen display size": "12.1 Inches",
      "Screen Resolution": "1366 x 768",
      "Max Screen Resolution": "1336 x 768 Pixels",
      "Memory Speed": "1333 MHz",
      "Graphics Coprocessor": "AMD Radeon HD 6310",
      "Chipset Brand": "NVIDIA",
      "Wireless Type": "802.11bgn",
      "Average Battery Life (in hours)": "8 Hours",
      "Brand": "ASUS",
      "Series": "Eee PC",
      "Item model number": "1215B-PU17-BK",
      "Operating System": "Windows 7 Home Premium",
      "Item Weight": "3.2 pounds",
      "Package Dimensions": "12.8 x 10.8 x 2.9 inches",
      "Color": "Black",
      "Processor Brand": "AMD",
      "Computer Memory Type": "DDR3 SDRAM",
      "Hard Drive Rotational Speed": "5400 RPM",
      "Audio-out Ports (#)": "1",
      "Power Source": "AC",
      "Voltage": "230 Volts",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B004Q7LHVE",
      "Customer Reviews": "3.0 out of 5 stars88 ratings3.0 out of 5 stars",
      "Best Sellers Rank": "#26,502 in Computers & Accessories",
      "Date First Available": "March 2, 2011"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": 299.0
  }
}