{
  "website_summaries": [
    {
      "verdict": "A heavy-duty hoe that will become a reliable workhorse in your garden.",
      "pros": [
        "Hoe does a great job on thick weeds",
        "Shorter length on the handle is good for smaller gardeners",
        "Sturdy head",
        "Handle can be easily replaced",
        "Works well to break up the soil",
        "Gets to roots well",
        "Solid forged construction on the head makes it stronger"
      ],
      "cons": [
        "This hoe does not ship sharpened, and will have to be sharpened after it arrives"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Poorly made cast metal blade snapped.",
      "text": "I used the hoe for two days and then the blade snapped. It appears the steel is cast, not forged as advertised. I enjoyed it for the short time I used it and am disappointed it is so poorly made. Forged iron tools would not snap in this manner.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael J. Skinner",
      "helpful_votes": 9,
      "publication_date": 20190415
    },
    {
      "title": "Impressed with the strength of the blade",
      "text": "I used this hoe to did a trench full of rocks. I read the negative reviews of the blade breaking and soft. These are all older (2014 - 2015) reviews. The manufacturer must have taken notice and improved the blade since then. I was impressed with how well this blade held-up against the conditions. I live in a region where it is very rocky. I ran into large rocks (> 8\" in diameter) often while digging a trench. I even used the hoe to pry the rocks from the ground. The blade is solid and did not bend, crack or break.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike H",
      "helpful_votes": 5,
      "publication_date": 20190205
    },
    {
      "title": "Kelly it ain't. The metal is Rough and soft!",
      "text": "It will function, but it's not a step up standard tools. It's a poorly made eye hoe compared to \"grandpas\". The metal is a extremely rough and the blade does not thicken towards the eye like the older ones I own. However it will function with a little work to the edge. Spring for the 60 inch handle if your over 5ft 9",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen R",
      "helpful_votes": 24,
      "publication_date": 20150512
    },
    {
      "title": "Lightweight is right.",
      "text": "Super cheap weld. Looks waaaay better in the picture than it actually is. Won't be surprised if this doesn't last into next season. It was expensive enough that it should have been a decent implement. The handle is rough. Don't try to get after the bermudagrass with it. Does okay if the ground has been well worked up already. Disappointing. I guess this is why it is always better to buy a tool after looking it over.",
      "rating": 3.0,
      "verified": true,
      "author": "walkingrock",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "With some prep, can handle clay and hard packed dirt",
      "text": "Purchased the 2 1/2 lb head with 54\" handle Pros: Easily leveled an 8' by 6' area with this bad boy. Long enough for me at 6' tall. Delivered as one piece. Cons: THE INFERNAL STICKER. Had to sand off an obtrusive sticker that sits where my hands go. Would have been awful to work with that still on there. Also came extra dull. Had to sand the entire handle until smooth, and use an angle grinder to sharpen the blade. Not as heavy as I'd like so it takes a little more effort in hard ground.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimbo",
      "helpful_votes": 6,
      "publication_date": 20160621
    },
    {
      "title": "It's pretty good",
      "text": "The handle is good, but the blade doesn't look like it will hold up. The description should mention that it needs to be sharpened because it ships too dull to use for anything except already loose garden soil. I guess for $46 I expected more, if the blade holds an edge and the tool doesn't break I'll upgrade my rating. It is lightweight, easy to handle, was delivered on time and packaged nicely.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Coons",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Get this hoe, and never get another.",
      "text": "I've used this hoe for a few weeks now, and I've put it through the paces. This thing is hands down better than anything my local home depot carries. It's strong, long and awesome. I'm using it to build a trail up a mountain side so it's taking its fair share of a beating and still going strong. I have previously bought a wooden handle hoe and it broke the first day so the fact that this is going strong after weeks of use is an A+ in my book.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 8,
      "publication_date": 20160406
    },
    {
      "title": "You can beat this hoe but it always is ready for more!",
      "text": "I like this hoe a lot! It’s great construction helped me cut out a garden from an over grown yard pretty easy. The grass was thick & soil rocky/clay. It was no problem for this hoe. I just wish the head was a couple pounds heavier & handle about 2 feet longer. Other than that it’s a wonderful tool to use. I go over it with a file/stone during breaks to make sure it’s still “sharp” & cuts effortlessly.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny Cayo",
      "helpful_votes": 5,
      "publication_date": 20180302
    },
    {
      "title": "A tool that works in a big way",
      "text": "I used to have one of these made seventy years ago and it broke. This is its replacement. I was worried it might not be made as well as the old world version. No fear, it is. It is a perfect angle to do some serious sod busting, ditch digging, or soil scraping. Better than the silly hoes sold in big box store. If you have never used a hoe like this and you buy this one, you will be writing a similar review.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue  Ackley",
      "helpful_votes": 5,
      "publication_date": 20160908
    },
    {
      "title": "Decent",
      "text": "I paid $32 for the grub for at the time, 4 years ago. I liked it after and only after I cut off about 1/2” on each side of the blade. Awhile back the blade snapped in half, my fault... I used it to pry a root. Would buy again but not for the price of $50 today. Not worth it. Only issue I have with this is the head needs a hole for screwing a bolt on so the blade doesn’t slide down after awhile of tamping dirt a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "GPM",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Think about how it will ship",
      "text": "I should have thought about shipping before ordering. This showed shipped with no box. The sticker shipping labels were attached to the surface of the hoe and also wrapped around the handle. It is only to help clean up the yard from dog waste during the winter but I have OCD and the stickers wouldn't pull off well and it is all ugly looking now.",
      "rating": 2.0,
      "verified": true,
      "author": "Alyce",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Poor build quality",
      "text": "Wood to metal fit at bottom of handle is very poor. Build quality is poor, Edge was ground poorly and is rough and dull. The shank was welded to the handle bell and is not a single forged piece like the ones I’ve bought in the past. It’s becoming very hard to find a good hoe.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael C.",
      "helpful_votes": 4,
      "publication_date": 20190322
    },
    {
      "title": "Bad quality ... really bad",
      "text": "Há! Há! Almost like a bad joke, it fell apart as I touched it, literally, I think it was broken on the box already... really bad",
      "rating": 1.0,
      "verified": true,
      "author": "Monica Miotti",
      "helpful_votes": 2,
      "publication_date": 20200512
    },
    {
      "title": "Hoe, hoe hoe!! 🌾",
      "text": "After removing about three yards of tape and bubble wrap, the tool was ready for use. I used it to chop down poke weed and other weeds in my yard. The thicker weeds (>~1/2 inch or with brown stems) were not cut. Perhaps, sharpening the blade more may help with that. I also want to use it to level off and fill in some ground hog holes but haven't gotten to that yet. Seems like it should work.",
      "rating": 4.0,
      "verified": true,
      "author": "TomC_NJ",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Bought this for my gardening housemate",
      "text": "My housemate owes me rent, so now he has gone gonzo helping out in the yard. It's wonderful. I got him this triangular headed garden hoe because I knew it was the best tool for making trenches around our fruit trees. The review from him is that the hoe is perfect. Hurrah. You should see the oranges on my orange tree since this guy's been tending the trees. Yow.",
      "rating": 5.0,
      "verified": true,
      "author": "@your6Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Just what I needed",
      "text": "This is a great hoe. The fine point allows me to do detail hoeing around plants, and I can do lethal harm to weeds with that sharp point. This is a great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla Ballou",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "The cost and the durability. The cost has already proved beneficial.",
      "text": "I used this hoe this morning and it worked great. I was using it around scalloped edging and it did a very good job bringing up the roots of the weeds. I cannot judge durability until I've used it for one season but I do believe it's going to hold up for more than one season of gardening.",
      "rating": 5.0,
      "verified": true,
      "author": "LADYBUG",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "superior design and construction",
      "text": "Bought this one single reason, all the hoes in my garage had some sort of wiggle between the head and the handle. The forged construction of this one means it can last for generations. The fairly standard handle means you could replace quite easily at a later time (you could even take a branch and fashion a custom handle, which I might do as a future project).",
      "rating": 5.0,
      "verified": true,
      "author": "aTypicalEngineer808",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Just what I needed. 50/50 on price.",
      "text": "Good product. Feels strongly built and ergonomic. I will put it to use this spring and update the review if needed. If I haven’t is because I’m satisfied with the product and it outlasted the crap they sell at Home Depot or Lowe’s .",
      "rating": 5.0,
      "verified": true,
      "author": "yoanny batista",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Not just any old hoe",
      "text": "This Hoe is the best hoe, in fact if you ask any number of elder italians they will tell you they have big respect for this hoe because it reminds them of the old country where hoes were meant to hoe. This is a hoe that other hoes aspire to be.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "THE WORST HOE I EVER PURCHASED!",
      "text": "I don't know who are these people who write positive reviews about this hoe, I would say they are getting paid to post positive reviews for this piece of crap. There is no sharpness to the edge! You will work very hard to get anything done, especially if you have some weeds to take out. Not to mention that the this hoe is very light, and with no sharpness, this hoe is USELESS!",
      "rating": 1.0,
      "verified": true,
      "author": ".",
      "helpful_votes": 2,
      "publication_date": 20190325
    },
    {
      "title": "Truper 30002 Tru Tough 54-inch Welded Warren Hoe.  4 3/4 inch Head Wood",
      "text": "I find this indispensable when gardening. I had a smaller version that went missing so I wanted another one. I was unable to locate one in this locale so I checked in Amazon and sure enough I found what I wanted. though it was somewhat larger than the original. I was concerned about how it could be shipped but I received it in perfect condition and I used it to make rows for planting. It is a very handy tool and very well made! I also find it good for dispatching weeds. The point is stout enough to pry under weeds. I would recommend it to anyone who raises a garden but it is useful for other chores, too.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Thompson",
      "helpful_votes": 0,
      "publication_date": 20130608
    },
    {
      "title": "It may seem like a minor complaint",
      "text": "It may seem like a minor complaint, but when will companies quit putting \"sticky back\" labels on products that require a razor blade and/or prolonged soaking in hot water to be removed? l'm guessing the people who make theses labels never have to deal with removing them from the products to which they're affixed. This garden hoe was plastered with labels that wouldn't come off. What a pain in the ass. Doesn't give me a positive view of the company that packaged and distributed this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Kathleen Myers",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Great back saver when you need a heavy duty hoe.",
      "text": "I have heavy caliche soil with lots of limestone rock and would break any normal hoe within minutes. This hoe is heavy duty enough to be used in this soil without any danger of breaking. I spent quite a bit of the afternoon today grubbing up small yucca plants without any issue as regards the hoe (me, I got real tired). I previously used a very sturdy short handled grub hoe but although it worked very well, I had to use it in a bent over position which quickly made my back ache. This eye hoe is much easier on my back for extended use.",
      "rating": 5.0,
      "verified": true,
      "author": "Penly",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "A dependable heavy-duty hoe",
      "text": "This hoe is a bit heavy, but looks like it will stand up to heavy-duty use. I needed a tool to break up some root-heavy soil where even a rototiller would not have worked. The handle is true and feels solid. The head looks to be drop-forged and is heavy enough to tolerate abuse and be re-sharpened when needed. It does take some man-muscles to work--it's almost like swinging a mallet. I'm not sure how solid the bond between the head is; I haven't had any problems, but I firmed it up with a masonry screw before I started using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "Handle is too short!",
      "text": "This thing has a good head on it but the handle is only 4 ft 6\" long. I am 6 ft and have to really bend over to use it...hard on the back.",
      "rating": 2.0,
      "verified": true,
      "author": "BCVS",
      "helpful_votes": 2,
      "publication_date": 20170703
    },
    {
      "title": "Sturdy, Sharp, Amazing",
      "text": "This Warren hoe is one bad A tool. I plowed 200 feet of ditch so the rainwater would drain easier in 20 min. Breaks dirt better than any other garden tool I have hands down!",
      "rating": 5.0,
      "verified": true,
      "author": "Kozmo",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Worth the money",
      "text": "High dollar hoe but......I've bought many for half the price that might last 2 year's. I think worth the money. A little heavier than I'm used to and a little wider but I'm adjusting fine.",
      "rating": 5.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Good value....",
      "text": "I wanted a particular shape & quality tool for cutting weeds below the surface & sending, at arms length, any found snakes to their ancestors. This is a good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Horse Pedigree Enthiast",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Springy wood for the handle",
      "text": "Maybe I was spoiled by my previous tool which I somehow lost, but the quality of the wooden handle in this recent purchase appears not to be of the quality of my previous one. The wood is almost rubbery and not as stiff as I'd like it to be.",
      "rating": 3.0,
      "verified": true,
      "author": "Sutiikare",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Tough Hoe",
      "text": "Cleared stubborn weeds from a piece of land behind my house with this hoe after I broken my new standard-type hoe from Home Depot. The standard-type hoe lasted a half hour or so in the rock hard soil, but this thing is great. Very tough and heavy duty. Costs more than the standard garden hoe, but is able to do heavy work.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Laidig",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "my favorite type of hoe",
      "text": "good, solid hoe. Nice handle. My old carp is that the edge is too blunted. I'll have my husband go at it with a grinder when he has a chance.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia Stilley",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Good deal for a good quality product.",
      "text": "Well balanced and nice straight grained handle. Steel seems to be of good quality but I would have appreciated it to come a little better sharpened. Handle could be a little smoother finished but is fine when wearing gloves. Overall I am happy wiht the tool and consider it to be money well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Merlin",
      "helpful_votes": 0,
      "publication_date": 20190309
    },
    {
      "title": "Dirt mover",
      "text": "This hoe is not heavy like other pick hoe combinations, it helped me buried a 100ft drain trench that I dug up with a backhoe. Highly recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "It's built very well!",
      "text": "It's built to work! It's like the one I had years ago, only sturdier.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great hoe at a great price!",
      "text": "Very sturdy hoe. Works great for lifting the sod we need to vget rid of. Great price and good value!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Priester",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Great tool",
      "text": "Truper brand has never let me down with any tool. It has a protective plastic waxy coating that is easily filed off or wears off after a few uses. The handle could be longer for those over 6 ft but its still a top notch tool.",
      "rating": 5.0,
      "verified": true,
      "author": "randy",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Worth the steep price",
      "text": "This is the best piece of garden equipment I now own, so well made. My only comment is that the hoe needed to be attached to the handle but luckily a neighbor placed a sturdy wood screw. I hope to have this forever and am careful where and how I store it.",
      "rating": 5.0,
      "verified": true,
      "author": "m.s.",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Bob's garden.",
      "text": "Like the light weight, purchased to make seed furrows but so many other uses.",
      "rating": 5.0,
      "verified": true,
      "author": "John H Martin",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Very good quality. Came fully assembled",
      "text": "Very good quality. Came fully assembled. Great for digging hole and weeding. Wish I bought this few years ago, cause I broke couple of those hoes with the goose neck, before buying this one. I don't think I can break this hoe unless I let the handle rot.",
      "rating": 5.0,
      "verified": true,
      "author": "SiBlue",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "A solid hoe for years to come.",
      "text": "Far Far better than the hardware store model. Ive been through more cheap hoes then most. I use these these warren hoes for digging in rocky areas. The welded ones fail in no time. This has a solid forged connection sharp edges and a reinforced handle like Ive not seen before. Even If the handle cracks I can replace it and know Ill have a solid hoe for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "renderranch",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Good working tool",
      "text": "I didn’t like the price. What I like is that it feels good in my hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian l Ortiz",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Looks exactly like the picture",
      "text": "Personally I think the bottle is abit too big, but that also depends on personal preference. Shipping is fast, well made, looks exactly like the picture.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "AMAZING!",
      "text": "We tried to dig a new garden in our backyard and this worked perfectly. Amazing product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tinyteacup",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Great garden tool",
      "text": "I have looked for one of these for over 3 years around town and was unable to find one. My grandmother had one when I was a kid and she still had it 50 years later although it was not the same exact brand. She used it so much that it was oblong with rounded corners. I hope mine will last as long. It sure looks like a great garden tool.",
      "rating": 5.0,
      "verified": true,
      "author": "dix",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Would not recommend. Disappointing because it wasn't even the cheapest option",
      "text": "Blade broke the first time i put it into the ground. Would not recommend. Disappointing because it wasn't even the cheapest option. DO NOT BUY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Otto Szebeni",
      "helpful_votes": 3,
      "publication_date": 20180620
    },
    {
      "title": "Five Stars",
      "text": "Just the right weight, cuts into the soil well for hoeing out thick-rooted clumping grasses",
      "rating": 5.0,
      "verified": true,
      "author": "M. S. Michels",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "This forged eye hoe will outlast several dozen of the flimsy, welded hoes",
      "text": "This forged eye hoe will outlast several dozen of the flimsy, welded hoes sold at the hardware/big box stores. It's made for heavy jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell H Reese",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Little Head...",
      "text": "It's a good hoe and it mixes mud the way it should... the surfaces are not overly rough, so cleaning it is easy. I know the description indicates the size, but I didn't go out and measure a \"standard\" mud hoe before buying. It seems that the 7\" head is a little small. Maybe will be perfect when I get a little older and my back starts to give out.",
      "rating": 4.0,
      "verified": true,
      "author": "Hoefner",
      "helpful_votes": 0,
      "publication_date": 20121201
    },
    {
      "title": "If you're tall, the handle might be a little short.",
      "text": "I'm 6 feet tall and the handle is just a little short. I ended up getting a 60 inch handle from a local store. The hoe head itself is exactly what I was looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Mclain",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Durable, good balance, effective",
      "text": "This product has quickly become one of favorate tools for opening new planting beds. The mass of the head enables me to put some explosive force into my tough soil",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Broke with very little use",
      "text": "I bought this hoe for small jobs in my garden. I used it no more than five times and it broke. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Paulo A.",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Cheap",
      "text": "Cheap just plain cheap. Wish I would have bought one local. Wood handle also. Thought it would be a good one. NOT",
      "rating": 1.0,
      "verified": true,
      "author": "Glen W. Smith",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Hard to find hoe, good not great quality.",
      "text": "Had a hard time finding one of these, not available locally. A bit more time putting a decent edge on the blade and I'd feel like I bought a higher quality product.",
      "rating": 4.0,
      "verified": true,
      "author": "JeB @ Amazon",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "NE Ohio.... A real work horse",
      "text": "NE Ohio....This is a real work horse in the right hands....the 7\" wide business end of the tool is just the right width to drag and spread out dirt. I use it also to scrape weeds and unwanted plant growth down.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Good hoe.",
      "text": "I'm 6'2\" tall, so having a hoe with a long handle was something I needed. This hoe, is almost long enough for me to hoe without having to bend my back. It is a huge improvement over regular hoes, but I wish it was 6\" longer. I'll be using the hoe, as the only way to get a longer hoe would be to make one myself with a wood handle.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20120916
    },
    {
      "title": "Love it for all purposes",
      "text": "I love this item and am doing for all my backyard work, its not good for digging but remaining all are fine",
      "rating": 5.0,
      "verified": true,
      "author": "Pramod",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "... wider then I thought but rips threw the weeds like nothing else",
      "text": "the blade is a bit wider then I thought but rips threw the weeds like nothing else!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Ramsey",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "I really like how I will be able to change the handle ...",
      "text": "It's a lot lighter than I expected. I really like how I will be able to change the handle really easily. I thought this thing would be super heavy. I'm super stoked to weed with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mikel DeHart",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Hoe, Hoe, Hoe",
      "text": "Well made; chops down thick weeds with one whack and metal does not bend twist, unlike ordinary hoes. Well worth the money if a heavy duty, dirt-busting hoe is needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil K.",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Just like how I remember how hoes were manufactured back then",
      "text": "Met my expectations. Just like how I remember how hoes were manufactured back then.",
      "rating": 5.0,
      "verified": true,
      "author": "B T",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Five Stars",
      "text": "Nice, solid, professional-level hoe! Way better than the one it replaced!",
      "rating": 5.0,
      "verified": true,
      "author": "xdpsn",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Tough like an army tank!",
      "text": "This heavy duty hoe takes care of the thoughest garden problems. A great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Texas Customer",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Works great and well built, good value for the price.",
      "text": "Works completely exactly as I would expect it to. I think the only way it could be improved would be if someone ELSE was doing the hoeing, and I was directing them from the shade, with a glass of lemonade. Certainly well built for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas A. Oehser",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "This is a great hoe! I use my onion hoe for all ...",
      "text": "This is a great hoe! I use my onion hoe for all my weeding in the garden!",
      "rating": 5.0,
      "verified": true,
      "author": "Aitkenhead",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Great Quality",
      "text": "Great tool! If you need to work hard ground, this is the tool that I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bronnie & Matt",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Just love this. Have used it to create a furrow ...",
      "text": "Just love this. Have used it to create a furrow in which to plant seeds. Saves lots of work. Great quality too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Johnson",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Very pleased",
      "text": "High quality and rugged. Nice weight; punches right into the soil. Handle is very comfortable to use; long handle saves some backaches due to less bending and reaching.",
      "rating": 5.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 3,
      "publication_date": 20130511
    },
    {
      "title": "It was pretty sharp when it arrived and I finished the sharpening ...",
      "text": "Finally have the hoe that I've wanted. cleared about an eighth of an acre of weeds and blackberry vines in a couple of hours. It was pretty sharp when it arrived and I finished the sharpening with a file. Banged some stones a few times when using it with no noticeable damage to the hoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Nice tool.",
      "text": "Wish it came with a sharpened cutting edge (edge must be sharpened upon receipt to be functional).",
      "rating": 4.0,
      "verified": true,
      "author": "Skip MacLean",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Five Stars",
      "text": "We look forward to using this hoe at our school beautification event this weekend!",
      "rating": 5.0,
      "verified": true,
      "author": "STACEY ZAVALA",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Five Stars",
      "text": "Love this tool, so much more useful than a standard flat edged hoe",
      "rating": 5.0,
      "verified": true,
      "author": "ShopperR",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Five Stars",
      "text": "This hoe is well made and exactly what I needed for the work I do in the garden.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Real old fashioned high quality tool",
      "text": "This is the same tool I remember an old Missouri farmer friend used when I was a kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen R. Wasden Sr.",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Good deal.",
      "text": "Good heavy hoe: let the tool do the work and not your back. Well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Not good in gravel or rocks.",
      "text": "This blade can be \"flown\" through sandy or loamy soil like a wing. In gravelly or rocky soil, it's a frustration.",
      "rating": 4.0,
      "verified": true,
      "author": "Wackezoid",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Westward Hoe",
      "text": "These hoes are thinner so one can be more percise in tight spots in the garden. They're lighter. When I landscaped, this was my favorite tool. It continues to be so.",
      "rating": 5.0,
      "verified": true,
      "author": "tatermusic",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "Durable well made Warren Hoe",
      "text": "I've used the hoe for several weeks now and have no complaints. It is a simple tool that works as intended and great for weeding in tight spaces saving my back muscles from constant bending to pull weeds. Also, great in setting rows for planting working better than a garden hoe.",
      "rating": 5.0,
      "verified": true,
      "author": "John G",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "It would be nice if the hoe was a little sharper when received ...",
      "text": "Heavy duty will take allot of force to break the wood handle. It would be nice if the hoe was a little sharper when received but that's not a big deal to correct.",
      "rating": 4.0,
      "verified": true,
      "author": "Ange",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Handle could have been little bigger for comfortable handling. So far it has been ok not ...",
      "text": "I ordered this hoe for weeding. Blade is not very sharp. It barely cuts the weed. Handle could have been little bigger for comfortable handling. So far it has been ok not very great.",
      "rating": 3.0,
      "verified": true,
      "author": "Bhupendra Mishra",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "weeding",
      "text": "By being large, it makes getting weeds out quick and easy. This replaces the one I bought 20 tears ago which a neighbor \"borrowed\".",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Foster",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "need a long hanly a foot long",
      "text": "I light the hoe but i wish handle been one ft long you do not been down to lowe 33119",
      "rating": 5.0,
      "verified": true,
      "author": "hank",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "My Triangle Hoe",
      "text": "Great tool. I had one years ago and have been trying to replace it. Thanks to Amazon and my triangle hoe I can really snag those pesty weeds and grasses out of places they should not be..",
      "rating": 5.0,
      "verified": true,
      "author": "Majel Powell",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Great being with this hoe",
      "text": "Uber quality hoe. Stands up to hours of field work.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert D.",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Heavy duty hoe",
      "text": "This is a professional grade tool. In the process of relandscaping, all our old tools broke. This tool looks like it is built to last longer than I will.",
      "rating": 5.0,
      "verified": true,
      "author": "LindaK",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "I had something similar years ago that worked a little better. But i would recommend this to anyone who ...",
      "text": "It works well for cleaning the curb at the street....I had something similar years ago that worked a little better. But i would recommend this to anyone who needs to clean the weeds that grow between the curb and the street...",
      "rating": 4.0,
      "verified": true,
      "author": "mary burns",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "diggorius rex",
      "text": "if you treasure hunt, namely the SPWC medallion, this is the one to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "somewhere in st. paul",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Five Stars",
      "text": "best helper for my garden work, the weight help dig deep and wide.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Chain",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Good quality. Basically an axe for your garden soil.",
      "text": "This is a hoe that is meant for REAL work in the garden. I would tear through the cheap hoes you get in the hardware store but this one can dig up my heavy clay garden soil.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "EXCELLENT WEEDING TOOL",
      "text": "MY FAVORITE WAY TO GET THE WEEDS OUT. I ONLY GAVE IT A 4, HOWEVER, BECAUSE I WOULD HAVE LIKED TO SEE THIS ITEM SHARPENED. IT COMES BLUNT. I LIKE IT SHARP SO IT ALSO CUTS OFF WEEDS AS WELL AS PUSHING THEM AND DISLOCATING THE ROOTS. IF IT HAD BEEN SHARP, IT WOULD HAVE A HANDS DOWN 5. I GUESS I WILL HAVE TO GET OUT A FILE AND SHARPEN IT MYSELF.",
      "rating": 4.0,
      "verified": true,
      "author": "ARTHUR  TYRRELL",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "Five Stars",
      "text": "I have been looking for one of these for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "John Riphahn",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "Very good garden tool,  commercial grade",
      "text": "Best damn garden tool I own. It's a little big but built like a tank.",
      "rating": 5.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "This is a good heavy-duty hoe for big jobs",
      "text": "The hoe arrived promptly and was as described. We had to have the blade sharpened. This is a good heavy-duty hoe for big jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol F. Masson",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Truper 30002 Tru Tough Welded Warren Hoe,...",
      "text": "Handle says medium duty I will need to disagree . I'm 65 years old and the head is lose after 15 minutes in sandy loam with miracle grow and compost added I would say light or even a childs . I'm not much into giving bad ratings but this needs one .. Rodney",
      "rating": 2.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 5,
      "publication_date": 20160425
    },
    {
      "title": "Not durable! Broke within two hours.",
      "text": "Was not durable! Broke within two hours. Definitely intended for very light duty use. I would not buy another one. I don’t know what the wood handle was made of. It was very weak. Not tough like a oak handle. My next hoe will have a oak handle.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 6,
      "publication_date": 20140506
    },
    {
      "title": "Five Stars",
      "text": "Great price on a hard to find item. Fast shipping, all around great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyclone7",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Superior materials and quality.",
      "text": "Great quality, works well, but would have liked a sharper factory honed edge.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul O'Mara",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "One Bad Mamba Jamba!",
      "text": "This is an awesome tool! Its heavy enough to break nearly any kind of soil, however, it doesn't wear you out. The craftsmanship is superb.",
      "rating": 5.0,
      "verified": true,
      "author": "The Dude",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "Nice, sturdy hoe",
      "text": "Very good hoe for my needs. The 60 inch fiberglass handle is perfect for the long reach I need. Seems very sturdy so far and not too heavy when reaching far away.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary G. Anderson",
      "helpful_votes": 0,
      "publication_date": 20140420
    },
    {
      "title": "The best hoe you can buy.",
      "text": "If you need a good hoe for gardening that you don't have to worry about the head slipping off and one that will hold up to hard work day after day, this is the one you want. I looked everywhere for a hoe like this. My grandparents and parents had this very type of hoe and it is a lifetime tool unlike the junk sold at the big box stores that fall apart after any real work is done with them. This one has a nice manageable weight to it and comes sharpened right out of the box so chopping through weeds or roots is no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "mcosby",
      "helpful_votes": 0,
      "publication_date": 20140520
    }
  ],
  "product_meta": {
    "title": "Truper 33119 Tru Pro Forged Eye Hoe, 7-Inch Head, Ash Handle, 54-Inch",
    "description": "Size:54-Inch| Style:Tru Pro - Forged Eye Hoe w/7-Inch HeadTruper 33119 Tru Pro Forged Eye Hoe, 7-Inch Head, Ash Handle, 54-Inch",
    "rating": 4.4,
    "feature_bullets": [
      "54-inch professional grade premium north american white ash handle",
      "White ash handles give optimum ratio of resistance and flexibility",
      "7-inch eye hoe head",
      "Use on farm or ranch for a lifetime of use",
      "Tru pro is the contractors choice for professional use"
    ],
    "specifications": {
      "Product Dimensions": "53 x 7.5 x 7.43 inches",
      "Item Weight": "2.77 pounds",
      "Manufacturer": "HORIZON DISTRIBUTION",
      "ASIN": "B0046VAH84",
      "Item model number": "33119",
      "Customer Reviews": "4.4 out of 5 stars304 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#14,775 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Hoes",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Hand Tools",
      "Gardening & Lawn Care"
    ],
    "price": 44.99
  }
}