{
  "website_summaries": [
    {
      "verdict": "Heavy-duty trimmer that pulls double duty as an edger. Some find the spool and string mechanism challenging.",
      "pros": [
        "Durable telescoping aluminum shaft",
        "Head rotates 180 degrees for ease of use",
        "Can use for both trimming and edging",
        "Cuts through even nettles with ease"
      ],
      "cons": [
        "Corded",
        "Some report trouble with the spool and line feed"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good strimmer but with string caveat",
      "text": "Excellent line trimmer. Solidly built and the string lasts quite a while as it doesn't seem to break as often as my previous Flymo. Would recommend. However the line is a bit of an anomaly as it is difficult to find and buy online! It has to be sent for on a special order from Germany! A bit concerned about this but I did eventually find ONE seller online who had to order the string from Germany so bought several reels at one go just in case I could not find it again! Very odd that you can buy this item in this country but not the string!",
      "rating": 5.0,
      "verified": true,
      "author": "Midnight",
      "helpful_votes": 12,
      "publication_date": 20161028
    },
    {
      "title": "Light powerful great",
      "text": "Had 2 stroke trimmers in past the last one was beyond servicing so thought I would try this ..makita I thought are good make it's about half the price of petrol version..result was it strips really well it is a fraction of weight so is so much easier to use ..if you have electric supply anywhere close to lawn this is too for you",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200524
    },
    {
      "title": "Great piece of kit if you get rid of the ...",
      "text": "Great piece of kit if you get rid of the wire gauge that's supposed to keep the strimmer away from obstacles. it took me a while to find out what was destroying the line every few seconds - it was getting caught in the gauge and breaking :-(. Removed it and then all was well as it dispatched all the long grass, weeds, nettles, thistles etc with ease.",
      "rating": 4.0,
      "verified": true,
      "author": "AndyN01",
      "helpful_votes": 22,
      "publication_date": 20150801
    },
    {
      "title": "Good piece of kit",
      "text": "The box it arrived in was really beaten up.... however its a great piece of kit... i will probably get thicker cord for it after i use up the spool thats on there... however it cut through a pretty overgrown garden really well.. its only a small step down from a small 4 stroke strimmer .. definitely recommend it to anyone who is using it for home... not quite powerful for commercial use",
      "rating": 5.0,
      "verified": true,
      "author": "liam",
      "helpful_votes": 3,
      "publication_date": 20200404
    },
    {
      "title": "Good value for money.",
      "text": "Seal was broken and box damaged and open on arrival. Used once and found it very good for strimming and edging. No line breaks at all. It’s a bit on the heavy side but once the shoulder strap (not mentioned in sales addvert) was fitted it became a lot lighter.",
      "rating": 5.0,
      "verified": true,
      "author": "George Mann",
      "helpful_votes": 2,
      "publication_date": 20200613
    },
    {
      "title": "The contents did not match the list of items on the advert",
      "text": "This product has 2 line spools on the list of items provided. A second spool was not provided. To me that was important as the line spool is quite small and it is useful to have a second spool ready when the other runs out. The strimmer works as advertised and does the job for which it is intended.",
      "rating": 4.0,
      "verified": true,
      "author": "james murdoch milne",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Great gardening product",
      "text": "Great product does the job it is made for. In my opinion it cuts down the time you have to get garden in order. So great value for the money paid for it. It's better than some products on the market which are more expensive to buy",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "very good bit if kit",
      "text": "very good bit if kit. Just remember to use the retaining screw or the shield rotates around ! Shoulder strap useful in taking some of the weight but very well balanced and powerful. 10 m power cable usefully long aswell ( I have also bought this  ) Have not successfully taken the spool out however, the instructions show it just pulls out but I haven't manage that yet hence 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "stu75",
      "helpful_votes": 3,
      "publication_date": 20160825
    },
    {
      "title": "Don't buy",
      "text": "Don't buy used every dia of strimmer wire available all snap after 2ft/60cm or all get pulled out and whips and cuts you around the ankle and shins",
      "rating": 1.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "GREAT UNIT",
      "text": "IT DID THE JOB ALL WEEDS GONE AND GRASS GREAT MACHINE",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Sarsfield",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Mr Angry",
      "text": "Looks great but how the hell am I supposed to use it without a cable??? The lead from the strimmer has a two pin European plug but no cable!!! 10m cable?????? I don't think so. The write-up says it comes with a lead and 3 pin plug. Who do I call and how do I let anybody know????",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160904
    },
    {
      "title": "Line keeps breaking",
      "text": "Line keeps jaming and breaking far to often main machine seems good have ordered another spool to see if the one that came with it is faulty",
      "rating": 3.0,
      "verified": true,
      "author": "s clark",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Great value and power for an electric strimmer",
      "text": "Very good strimmer, cut through my quite thing grass with ease, I like the neck/shoulder strap which you can use, the item isn’t heavy but it was a nice touch.",
      "rating": 5.0,
      "verified": true,
      "author": "Gavin",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Very happy with them .J",
      "text": "Loved the Marita strummer good price and came on time .Jason",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Good quality item",
      "text": "Very good quality machine, big improvement on my old Bosch!",
      "rating": 5.0,
      "verified": true,
      "author": "dba",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "Great",
      "text": "A well built Trimmer that has a hands free reel lengthener. Would recommend :) 5*****",
      "rating": 5.0,
      "verified": true,
      "author": "Dan3716",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "... motor a little heavy but supplied with strap etc good all",
      "text": "strong motor a little heavy but supplied with strap etc good all rounder",
      "rating": 5.0,
      "verified": true,
      "author": "D. James",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "... hesitation to replace with the same as its the best strimmer i have ever",
      "text": "replacement for the one stolen-no hesitation to replace with the same as its the best strimmer i have ever used",
      "rating": 5.0,
      "verified": true,
      "author": "rosemary brook",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Job done",
      "text": "Does what it says, I use makita professionally so natural choice",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie worrall",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Would recommend this to anyone.",
      "text": "Very pleased with the trimmer, new Makita would not let me down.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G Taylor",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Excellent for the larger garden",
      "text": "Excellent for the larger garden but some may find it rather heavy",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. N",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "item missing in the box",
      "text": "i found that the Protection cover not include in the box.",
      "rating": 3.0,
      "verified": true,
      "author": "borhanuddin",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Arghhhh!! Line Breakage.",
      "text": "Puzzling, isn't it, how many people can have such different views of the same machine. For myself this has been a virtually unusable machine- shocking for me because I have been using MAKITA electric tools for years and rate some of them the best in the world. The reason it is unusable is line breakage. The longest I have used it for without a line break and having to reload the spool is c. 2 minutes. I have tried using a much thicker cord. No difference. Ditto removing the guard. Not good at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Stormflex",
      "helpful_votes": 7,
      "publication_date": 20170504
    },
    {
      "title": "Five Stars",
      "text": "Delivery 23 hours after order on standard delivery Good quality...well pleased with service and quality strong case and a long lead the only down side is the manal that only show picture,s and very little written over all good price for the quality",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160304
    },
    {
      "title": "Tool shed asset.",
      "text": "A good buy, I am using it regularly. Easy to put together, very durable. Its an asset to my tool shed.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Humphreys",
      "helpful_votes": 5,
      "publication_date": 20130712
    },
    {
      "title": "Makita goes down market",
      "text": "This machine has many design flaws. The bumb and feed system is rubbish - and a nightmare to operate. The machine was cheap but packed up within a very short time. Would not recommend this makita product at all",
      "rating": 1.0,
      "verified": false,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20170510
    }
  ],
  "product_meta": {
    "title": "Makita UR3000 Electric Lawn Line Trimmer Rasentrimmer / 220V 60Hz Europe C Type Plug",
    "rating": 4.1,
    "specifications": {
      "Manufacturer": "Makita",
      "Part Number": "UR3000/2",
      "Item Weight": "5.72 pounds",
      "Product Dimensions": "4.72 x 39.17 x 11.02 inches",
      "Item model number": "UR3000/2",
      "Is Discontinued By Manufacturer": "No",
      "Power Source": "Corded-electric",
      "Voltage": "240 Volts",
      "Wattage": "450 watts",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B004Z55FGA",
      "Customer Reviews": "4.1 out of 5 stars331 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#1,426,340 in Patio, Lawn & Garden",
      "Date First Available": "July 10, 2013"
    },
    "categories": [
      "Walk-Behind Lawn Mowers",
      "Patio, Lawn & Garden",
      "Lawn Mowers & Tractors",
      "Outdoor Power Tools",
      "Tools & Home Improvement"
    ],
    "price": ""
  }
}