{
  "website_summaries": [
    {
      "verdict": "A slightly different style on this soft sided case allows for more internal storage space for attachments on your crossbow.",
      "pros": [
        "Comes with a removable shoulder strap",
        "Includes two exterior pockets for accessory storage",
        "Camouflage material",
        "Well-constructed",
        "Good zippers",
        "Heavy-duty for a soft sided case",
        "Plenty of room in this case"
      ],
      "cons": [
        "This kind of universal case is less likely to provide the \"perfect\" fit for your crossbow",
        "You may find it oversized"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very Roomy Case",
      "text": "I think this is a well made quality soft case. It has a nice sized accessory pocket that holds a MTM crossbow bolt case perfectly. With that being said it really is huge inside. My Barnett Ghost 375 swam in it. If they had incorporated straps inside with Velcro to secure the crossbow limbs I think I would have been more satisfied with it. I ended up returning it and purchased a Plano Manta hard case. That case allowed me to customize it for a perfect fit to my crossbow. Plus it will offer much better protection for my $500 crossbow.",
      "rating": 3.0,
      "verified": true,
      "author": "DTSully",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Regretful purchase for oversized crossbow case that needs modifications",
      "text": "I was disapointed in this case. it is basically like throwing your crossbow in a mini room. it is way to oversized in the wrong spots. I have a barnett ghost 360 and wish i had gotten a more fitted case. I bought a different type for my sons crossbow and it is much better. This one is not as high as i would like for the scope. the compartment for the bolts on the top could be longer and larger. all of the dimensions are just too universally odd. i would go with a different type. I regret this purchase. the photos people posted where it looks like someone is swimming inside is accurate.",
      "rating": 2.0,
      "verified": true,
      "author": "master Irrigator",
      "helpful_votes": 2,
      "publication_date": 20161014
    },
    {
      "title": "For Bear Fisix good case",
      "text": "The case inside measurements are 30 inch wide and 40 inches long. More than enough for the Fisix reverse limb crossbow. I will add/glue foam blocks to sides of case to keep the cross bow from sliding around inside of the case during transport. Maybe add a couple of Velcro staps. The Case has outside storage pockets for quiver and another for other stuff. I like the case. I'll try to post other pics once the modifications to the case are complete.",
      "rating": 4.0,
      "verified": true,
      "author": "Swarg",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Highly recommend",
      "text": "This this is wide. I have a Bear X Fisix (reverse limbs), and it fit in there no issue. Legnth wise was perfect, even with the buttstock extended. Width wise it is a rediculeless among of room. If there is a crossbow that wide I have not seen it yet. The large pocket fit the quiver with 5 20\" bolts in it, along with the broadhead package and still room for some more stuff. The smaller pocket is a good size too. The materials seem to be tough and water repellant, also has a sling. I do not like soft cases, but I am impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "ljgorski",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Pretty Nice",
      "text": "Well I must admit it is kinda big but I’m okay with it because it’s functional. My Barnett Recruit Recurve fits right in and it has pouches for bolts and another for accessories. Seems well made and will do the job for my needs without any problems. I do think they should try and streamline it a little just to help cut down on size a dab. Overall a good value and a case that serves its pourpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Pracht",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "HUGE case",
      "text": "This is a “HUGE” case! I bought this for my hubby who travels a lot with his crossbow. This case is massive. We can put both our Jackal and Game Crusher Barnett crossbows in this case with lots of room to spare. I did read the reviews, but thought since his bow was pretty big, it would probably be perfect. I was sooooo wrong. Honestly, I don’t think this case would be a snug fit for any brand or model crossbow. The structure is awesome, just way too big.",
      "rating": 2.0,
      "verified": true,
      "author": "NC Lady",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Perfect Case 4 my Barnett Jackal Compound Crossbow",
      "text": "The best choice for your Barnett Jackal Crossbow, or any compound crossbow of the same size. This case has plenty of room for the compound crossbow, scope and quiver. However it also has a special pocket for the quiver and bolts, as well as another pocket for wax and other accessories. It also comes with a nice shoulder carry strap, as well as handles to carry it by hand. This is just what I was looking for, a case to keep together all my crossbow accessories. I'm very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "H Trans Svcs",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Won’t hold what it says",
      "text": "Purchased this to hold my Barnett cross bow yet it would not fit at all! The part for the stock wouldn’t hold it and the bow part was enormously to large. I returned it and bought a generic case that actually held the cross bow. (For reference I have a Barnett whitetail pro str.)",
      "rating": 1.0,
      "verified": true,
      "author": "Adam Lyons",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Really, Really disappointed!",
      "text": "This case is way to big for my Ghost 360. It has no interior padding and no straps to keep the bow from sliding around. I don't see where this case provides any protection for my crossbow other than keeping it from getting dusty. It appears to be well made, with good zippers, and the pockets are a nice feature but it's nothing more than a large bag. I guess I'm stuck with it unless I decide to pay the $10 bucks to ship it back. Really, really disappointed. I don't see how Barnett can say that it fits Barnett crossbows, does a size 10 foot fit in a size 13 shoe? Not in my book....",
      "rating": 3.0,
      "verified": true,
      "author": "d greenwald",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "GREAT CASE, GREAT VALUE, A MUST HAVE!!",
      "text": "This is a truly nice case. The camo is good and it fits my Barnett Jackal and ALL the accessories perfectly. It has room for at least 10-15 bolts, broadheads and plenty of room for other accessories too. The price is right and Amazon delivered it in ONE DAY!!! I HIGHLY recommend this case for the Barnett Crossbows. ATTN: BEFORE you buy this, check with Barnett to make SURE it will fit your crossbow. Happy Hunting!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Noll",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Not as useful as it could be.",
      "text": "It serves its purpose, but could definitely be better. No straps or securing mechanism inside to hold bow without which it is simply an over priced cover providing no real protection against anything but dust. It could also be made with shoulder straps like a backpack which would make it much less cumbersome and add to its usefulness in carrying in the field. Overall could use many improvements but works great as a storage case to keep the dust off of the bow.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "It's a basic generic crossbow soft case.",
      "text": "It's not going to be a snug custom fit for your crossbow, nor will it provide much protection against being dropped off a cliff or run over by a tank. It's a basic, inexpensive padded soft case with pockets for your quiver and accessories, with handles and a shoulder strap that make it easier to carry your stuff around without breaking it. If you want to be able to run your xbow over with your pickup, or chuck it out of your tree stand without breaking it, you should probably spend the extra money and get a hard case. If you just need something basic to carry your xbow and stuff around, this will do just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20131218
    },
    {
      "title": "World's largest crossbow case?",
      "text": "Great quality product. The case is the size of a giant manta ray (at least it seems like it), if you don't have a crossbow get this anyway and sleep in it. How much nicer to get more than you expected. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mournblade14",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Okay but not great.",
      "text": "Could be better designed. Pockets open on the wrong side. When there is a crossbow in the case, the pocket openings face down and stuff slides out when the zippers are opened. When the crossbow is out of the case, the case is too flimsy to open the pockets easily. It would be better if the zippers opened on the same side as the handles. More, smaller pockets would be nice too. Case is okay otherwise. Lightweight and durable.",
      "rating": 2.0,
      "verified": true,
      "author": "USERDUDE7",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Nice case, not sure why it's so big",
      "text": "I returned it, but not because there was anything wrong with it other than it was just HUGE! My Barnett crossbow filled about half of the case.The pockets on the outside are really nice, I wish they had one that didn't look like adult pajamas on a little boy. It kind of defeated the purpose of the case, trying to carry it by the handle or strap would cause the bow to slide around inside. I decided to do without.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "cross bow case",
      "text": "It fit my quad 400 perfectly. Plenty of room for my wax, string puller and arrows with room to spare. My fellow hunters thought it was really nice. Wish they had one like it.",
      "rating": 5.0,
      "verified": true,
      "author": "duchy68",
      "helpful_votes": 20,
      "publication_date": 20130619
    },
    {
      "title": "Terrible, laughably large",
      "text": "Terrible case. It is HUGE, and had basically no padding or protection. This is literally laughably large, and any modern crossbow will just flop around inside. Do not be fooled by the Barnett name. This is just a repackaged case, made by a company Cross. Do not waste your time on this.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Will no fit a Barnett Jackal",
      "text": "This case is way to big for a Barnett Jackao Crossbow! My bow swims in this case and there is no protection for the scope of it is bumped in any way, shape or form! The only good part about this product is the amount of pockets it has for extras! I can put all of my hunting accessaries in the two pockets! Okay quality but way to big!",
      "rating": 3.0,
      "verified": true,
      "author": "Nehuskerfanatic",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Just ok...",
      "text": "This case holds EVERYTHING! It's huge.. Not sure what xbow wouldn't fit in it! That saying, I wish it was smaller. It works ok, just big and I'll probably get a smaller one later for my Barnett Whitetall bow.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Medama",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great soft case",
      "text": "The case is a perfect fit for my Barnett Wildcat C5 with scope. The section of the case that covers the scope had extra padding (nice!). The pockets are great for carrying items like a rope cocking device and a small box of broad-heads. Plus the larger pocket is just big enough to carry a small box of extra bolts. An all-a-round good deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Camper-Alex",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "A Little Big for my Barnett Black Raptor FX2 Crossbow Package",
      "text": "I own a Barnett Black Raptor FX2 Crossbow Package and this case swallows it up. It is very large, so I anticipate movement unless I come up with some additional padding to keep everything still. Not a bad product, just be aware of its very large size.",
      "rating": 3.0,
      "verified": true,
      "author": "Dagger77",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Bulky case.. storage for days",
      "text": "Pretty good soft case.... But it has way too much material... I could put my bow in there and all of my hunting gear in there and still have room in the storage compartment. Just bulky..",
      "rating": 3.0,
      "verified": true,
      "author": "Diggums",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "would have preferred some nice YKK metal ones but other than that very nice ...",
      "text": "Bought this for a very old Bear Devastator crossbow because the measurements said I should have a couple of inches extra room, bow JUST fits this case, it will work but you have to fiddle with it a bit to get the bow in amd zipped up, only gave 4 stars because of the cheap plastic zippers,would have preferred some nice YKK metal ones but other than that very nice case.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg w.",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "MAKES CARRYING YOUR BOW AND ALL THE THINGS YOU NEED WITH IT A LOT EASIER",
      "text": "I LIKED THE FACT I COULD ALL MY BOW STUFF IN ONE PACKAGE AND HAVE IT PREPPED COME HUNTING MORNING. WITH ALL IN ONE PLACE STOPS MY FORGETTING SOMETHING AT HOME AND MESSING UP OPENING DAY HUNT. NICE WELL MADE BOW CASE.",
      "rating": 5.0,
      "verified": true,
      "author": "UR8UP2",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Too big",
      "text": "It was a great case. I’m giving it this rating because it said it would fit my bow but it was way to big.",
      "rating": 4.0,
      "verified": true,
      "author": "grandmac",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "RIDICULOUSLY TOO LARGE!",
      "text": "I like the design and the features of this case BUT, its WAY TOO BIG! Its borderline ridiculous how big the case is. You can almost fit 2 average size bows inside. Come on Barnett really!",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Good buy",
      "text": "Bought for my boyfriend and he loves it. It is bigger than he needed but he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Gravelle",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Nice case",
      "text": "Plenty of capacity, zippers work well. Purchased two for our crossbows. Nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "James B.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Having said all that it is a nice quality padded case",
      "text": "The ad says that it will fit all Barnett bows. Well I guess so because this thing is freakin huge. It even swallows a Ghost 350 whole so don't think for a minute that this case will work for a Recruit or a Quad Edge. Having said all that it is a nice quality padded case. It's just too big for most Barnett bows.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim Haskins",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Ok",
      "text": "It's ok. This thing is massive though. Like to big. Barnett whitetail str has way to much room inside and it's a bigger xbow.",
      "rating": 3.0,
      "verified": true,
      "author": "cdemarse",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Convenient Storage",
      "text": "Great product for the money. Keeps all my cross bow stuff in one place. There are two pouches well suited for extra bolts and broadheads. I didnt want a hard side case and this certainly fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "David Argent",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Ok for starters",
      "text": "This case is too big to fit my Ghost 360 properly. Way too much wasted space inside-allowing for shifting and movement of crossbow-the padding is definitely good enough to protect the bow from light knocking around. The accessory pockets are perfectly sized for an arrow case and a small parts bin. It's ok to start with, but a hard case is what's needed for decent security of a scoped crossbow, and also peace of mind.",
      "rating": 3.0,
      "verified": true,
      "author": "David C. Goetz",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Nice case, great pockets for separating gear",
      "text": "Nice but very big, especially since Barnett sells it, can first 2 fx2 Raptors in it (or very close.",
      "rating": 5.0,
      "verified": true,
      "author": "HarleyDave",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "It does a good job of protecting it",
      "text": "The case is well made. The main problem is it is so huge. I have a reverse technology crossbow so it is not as wide as some of them. It does a good job of protecting it. but I'll need some added foam to make the fit better. Like the picture shows there is a lot of extra room in the case, which is great for another box of arrows inside. The only thing better would be one made exactly for the Vengeance model crossbow.",
      "rating": 4.0,
      "verified": true,
      "author": "John McGuire",
      "helpful_votes": 0,
      "publication_date": 20141114
    },
    {
      "title": "Way to big for Barnett Crossbow",
      "text": "This bag id WAY too big for just about every Barnett Crossbow. I have a Barnett Brotherhood and it practically got lost in this bag. I would not recommend this for any compound crossbow. It works well for an Excalibur recurve bow but not the smaller compound crossbows.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "A well made product",
      "text": "Larger than expected, but a well made product with good size pockets and adequate padding for protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafal Madderdin",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Great case",
      "text": "I Love This Case. I've had it for awhile now.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Lopez",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Perfect for my Barnett crossbow",
      "text": "Very durable. Several pockets for storing extra bolts and broadheads. Exactly what I needed to transport my crossbow to and from my hunting spot in the bed of my truck. Would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Cox",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Too big for Barnett whitetail ll crossbow",
      "text": "First off this case is very large if you are looking to pack a bunch of equipment in your case this is for you.. on the other hand I have a Barnett whitetail ll I could put two in this case way to much room to move around and slide in case. Storage wise it’s great, but to keep your crossbow in place unless you have a large one it sucks and it was recommended to buy with the crossbow....",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Pierce",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "The pockets work great for accessories that don't fit in my small backpack",
      "text": "Hauled my Ghost 360 back and forth to the blind all season without any problems. The pockets work great for accessories that don't fit in my small backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "An OK Short term solution, but not for the long haul",
      "text": "Provides protection and makes carrying your supplies easier. However, slight disappointed in the quality. Feels like a good solution in the short term, but I believe I will upgrade to the hard case by next season. Also, a couple of more small compartments for storage would have been good and maybe a little more padding.",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny L",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "This thing is HUGE! Any crossbow ever made will ...",
      "text": "This thing is HUGE! Any crossbow ever made will fit into it. You could put 3 or 4 in it! You could put a stand up bass in it. Since its camo I am going to use mine also as a hunting blind.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Jastifer",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "a lot bigger than expected",
      "text": "Holy cow this thing is big! I could store the body of a deer after I shoot it with my crossbow and put my crossbow in there too! Top cross pocket looks to be for arrows in a hard case or if you want to detach and store your quiver. Can't get over how much space is in this thing",
      "rating": 4.0,
      "verified": true,
      "author": "Arctic Ink",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Heavy duty and well made",
      "text": "Heavy duty and well made. Fits the Barnett crossbow perfectly. Many pockets to store arrows, string cocking rope, ect.",
      "rating": 5.0,
      "verified": true,
      "author": "BobS",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "I love it.",
      "text": "I read a lot of reviews and what got my attention was the size that everyone was talking about. It is pretty large for my Whitetail bow but that's what I like about it. I also have a pistol crossbow and it fits inside the case with the Whitetail with plenty of room. I might install a couple of straps to keep them secure but for now it's great. The case also has a couple of pockets that hold both types of bolts. For me it's perfect. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "James Villanueva",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "It works perfectly. Holds my husbands bow and all ...",
      "text": "It works perfectly. Holds my husbands bow and all his accessories in one convent and safe place. The bow does not fit in our gun safe, so we put a pad lock on the zippers and now it is safe from my children and their very curious hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "The quality of this bag is nice but it is HUGE",
      "text": "The quality of this bag is nice but it is HUGE! It was way too big for my Barnett Whitetail Hunter 2 and I returned it for an Allen Hardcore Subcompact crossbow case which is a perfect size.",
      "rating": 4.0,
      "verified": true,
      "author": "Penguin",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Fits Barnett Kryptonite 370 with Scope and AMS Big Game Gator Kit!",
      "text": "This case fits my Barnett Kryptonite 370 with Scope and AMS Big Game Gator Kit!. The arrow pouch is too short my solid graphite alligator bolts. Someone else has already reviewed all the other features/",
      "rating": 5.0,
      "verified": true,
      "author": "The Honest Critique",
      "helpful_votes": 2,
      "publication_date": 20160830
    },
    {
      "title": "Very nice crossbow case at an excellent price!",
      "text": "I purchased this case for my new Barnett Whitetail hunter 2. While it is a little large for this particular crossbow, I really like it. There’s plenty of room and the zippered storage pouches on top and very handy. The material this case is made from seems sturdy and there is plenty of padding.",
      "rating": 5.0,
      "verified": true,
      "author": "Landon Goltry",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "good quality, looks very durable",
      "text": "Absolutely huge at least a third larger then my wicked Ridge crossbow, good quality, looks very durable, extra pocket for bolts, tips, anything for a day in the field. I will use the extra space to put camping gear, tarps paracord etc to be able to use one bag for a day trip, I like it, would recommend",
      "rating": 5.0,
      "verified": true,
      "author": "David P. Henn",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Two additional pockets ensure that you can pretty much fit everything you need into one container",
      "text": "Arrived on time and as described. Very large bag, plenty of room in the main compartment for my Barnett Ghost and a few accessories. Two additional pockets ensure that you can pretty much fit everything you need into one container. The bag is padded enough to protect your crossbow from most bumps, but I wouldn't suggest tossing the thing around, bag or not. The sling it comes with is functional, and the camo pattern that comes printed on the pockets is a nice touch. Overall a very nice soft-case, would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan Ward",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "Nice",
      "text": "For $26 bucks this is awesome. Seems well built with several storage compartments.",
      "rating": 5.0,
      "verified": true,
      "author": "RH",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Big enough for recurves.",
      "text": "This thing is enormous--I currently have a Barnett 360 Ghost (compound) in it but this case will easily hold a recurve. A shortcoming is no internal restraint to keep my crossbow from sliding around inside the bag. The zippers look a little flimsy, too, but so far I'm pretty happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "jdb",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "looks like a nice set",
      "text": "looks like a nice set. bought as a Christmas gift and will update once it is opened and used. Amazon needs to add an option for Christmas gifts so the seller knows it wont be used till after the dec 25th......",
      "rating": 5.0,
      "verified": true,
      "author": "drewman",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Perfect!",
      "text": "Just what was needed to protect my crossbow! Lots of storage pockets and compartments!",
      "rating": 5.0,
      "verified": true,
      "author": "NStull",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Nice storage, zipper pockets",
      "text": "Case is large enough, with room to spare for crossbow with scope. Nice storage, zipper pockets, for bolt hard case and other accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Kirk",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "Large case!",
      "text": "Bought this for my Barnett DOA Gen 2 crossbow. The case is huge and fits the crossbow. Could be a bit smaller for better protection but it's well padded. Also has a couple of pockets that provide you with more than enough room for extra arrows and miscellaneous gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph M",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Awesome!",
      "text": "This thing is huge & squishy & padded & exactly what you need for that crossbow of yours. It's spacious which allows room for your arrows so you can pretend to be a wookie while you shoot squirrels in your backyard!",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Well made, but big !",
      "text": "This thing is huge, I could fit two crossbows in it.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Fox",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Great Crossbow Case",
      "text": "It works with crossbow well and has enough room for all my bolts and spare heads.",
      "rating": 5.0,
      "verified": true,
      "author": "Les Green",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Case is huge",
      "text": "Price was cheap but this case is twice the size it needs to be.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe A. ",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "but it sure does serve it's purpose and at a great price. I have a Barnett DOA crossbow and ...",
      "text": "Sure, this isn't a \"fitted\" bag, but it sure does serve it's purpose and at a great price. I have a Barnett DOA crossbow and it's 11\" to the top of the scope and this accommodates that. Can't be beat for the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Just me",
      "helpful_votes": 0,
      "publication_date": 20151121
    },
    {
      "title": "Nice construction but sizing is terrible",
      "text": "I have a barnette quad edge. This case swallows it. Way too big. There is no storage for bolts that are 22\" unless you want to put them in the main compartment. Overall, it is a nice case. Appears to be well constructed. You just need a huge crossbow that fires small bolts for it to fit properly.",
      "rating": 3.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "This case seems to be made of very good quality and is very spacious",
      "text": "This case seems to be made of very good quality and is very spacious. I would recommend this case for crossbow enthusiasts.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian K. Evans",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Great product (especially for the price)",
      "text": "Exactly what my husband needed to store his crossbow. Nice product and very well made!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Forbes",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Descent Case",
      "text": "This case is a little large for my Barnett Droptine, and is a little things to me. I'm used to a hard case though, so may be a little skewed. Has area for arrows and quiver, as well as a second pocket for cooking device, lube, keys, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Seems to be a nice case. Has some large pockets to store extra ...",
      "text": "I have a Barnett ghost 415 it fit in this case but without any room to spare. Seems to be a nice case. Has some large pockets to store extra arrows, etc. good straps for carrying",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Everything fits!",
      "text": "Great case for my Barnett. Padded and protects the bow, quiver and the scope. The MTM bolt case fits perfectly in the large external pocket. A broad head box fits in the other pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "blubusdrvr",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Lots of room",
      "text": "The case is a great buy. Lots of room for almost any size crossbow. No need to remove scope or any accessories (that I found). Handy pockets for carrying extra bolts, flashlights, tips, or whatever.",
      "rating": 5.0,
      "verified": true,
      "author": "holybluemonkey",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Bit Large for DOA Crossbow!",
      "text": "Case is larger than my DOA Crossbow. Wish Barnett would make a smaller case for there smaller width crossbows. It's a nice case, would have been a 5 star if case was smaller.",
      "rating": 3.0,
      "verified": true,
      "author": "Rodsterman68",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "overall nice case",
      "text": "A bit over-sized for my Barnett Jackal, but it fits the crossbow with scope attached and has pockets for the arrows and an additional pocket for other accessories like rail wax and rope-cocking tool.",
      "rating": 3.0,
      "verified": true,
      "author": "curious george",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "It is very durable but yet still pretty large even with the crossbow in it",
      "text": "I bought this crossbow case for my husband's new crossbow to protect it. It is very durable but yet still pretty large even with the crossbow in it. It does have nice compartments for you to put your extra items.",
      "rating": 4.0,
      "verified": true,
      "author": "Rae McCormick",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "... that just gives me room for more extra stuff like it very much",
      "text": "I finally put my crossbow 10 point site this place fit a little loose but that just gives me room for more extra stuff like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Great item to store and transport your crossbow.",
      "text": "This case was able to fit my crossbow, Barnett Jackal, easily and store an additional 5 arrows with the cocking device and wax. The only negative I would mention is that I ended up detaching the quiver just to make it a little less bulky in the case but that took 5 seconds and was not a big deal at all. Great item!",
      "rating": 5.0,
      "verified": true,
      "author": "David Lyons",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Five Stars",
      "text": "Great construction. Perfect for storing our crossbow. Keeps it safe and secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied Customer",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Very nice case",
      "text": "The case fits my Barnett Jackal very well and I believe it will protect it during travel. I am very pleased with this purchase. It has pockets to hold my bolts and quiver with room to spare and another for your tools of the trade.",
      "rating": 5.0,
      "verified": true,
      "author": "GDT2",
      "helpful_votes": 2,
      "publication_date": 20140806
    },
    {
      "title": "Nice Case",
      "text": "Plenty of room! Nice zip storage pockets. HD zippers. Nice soft case!",
      "rating": 5.0,
      "verified": true,
      "author": "LuLu",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Barnett Crossbow Case",
      "text": "I bought this as a gift for my husband who had just bought a cross bow. I was pleasantly surprised to find this a very thick, sturdy case! It is an awesome buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "K.T.",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Five Stars",
      "text": "Used it for a few years now and still holding up!",
      "rating": 5.0,
      "verified": true,
      "author": "Cnm0924",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Bought this for my recruit because Amazon recommended it and well it's huge I'm sure it would ...",
      "text": "Bought this for my recruit because Amazon recommended it and well it's huge I'm sure it would fit a midevil crossbow but not mine so I returned it. As far as product it seemed nice though for price and how it's made",
      "rating": 4.0,
      "verified": true,
      "author": "Keith G.",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Durable, performs its function.",
      "text": "I purchased this case in 2012 and it's still going strong. Performs its function for my Barnett RC150 crossbow.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen H.",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Perfection for Barnett Crossbows!",
      "text": "Really nice case! Lots of extra storage for crossbolts, wax, broadhead wrench, broadheads, etc. Fits Barnett Quad Edge Extreme with plenty of protection and storage space.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa H. Dulinski",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "No real complaints",
      "text": "Perfect fit for my Barnett Jackal. If it had Velcro straps in it I'd give it 5 stars. Other than that it's a great soft case. I can fix the strap problem with some Velcro, needle and thin fishing line. I've done it in gun cases so I'm sure it will work fine with this",
      "rating": 4.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "crossbow bag",
      "text": "I got this on a \"deal\" because the box was damaged. I was a little concerned but took the chance. It turns out the item was in perfect condition, and yes the box was damage. That made no difference. The bag itself is pretty oversized, and had plenty of room for my crossbow. It has addition outside pocket that accommodated extra space for bolts and broad-heads, etc. Very pleased and would recommend to friends.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "better than expected,good value for the price",
      "text": "I own a Barnett Jackal crossbow with a red dot scope,and this case is perfect. Fits like a glove. The outside compartment holds the quiver that came with the bow perfectly, and does not flatten the fletchings. In responce to a fellow review,yes the case doesn't have the words Barnett on it,only Cross on the tag. Upon further examination,the product tag does state that the brand Cross belongs to Barnett,so there you have it. The other compartment is great storage for the string pull and broadheads,and any necessary tools etc.I would highly recommend this case as a very well made product. Looks great and i will use it for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Kimble",
      "helpful_votes": 45,
      "publication_date": 20120201
    },
    {
      "title": "Does the job, a bit too big for compund crossbow",
      "text": "Bought this for a compound crossbow. It is HUGE and there is lots of empty space in the case. I think this case will fit a recurve much better. It does its job, and there is plenty of space for arrow case, rope cocker, quiver, in the zipper pockets.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew A",
      "helpful_votes": 0,
      "publication_date": 20151128
    },
    {
      "title": "One Star",
      "text": "way to big....to soft...should have gotten a hard case...save your money",
      "rating": 1.0,
      "verified": true,
      "author": "Mark P",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Five Stars",
      "text": "Fits everything you need to protect for your Barnett crossbow.",
      "rating": 5.0,
      "verified": true,
      "author": "Superdad",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Too big. Update",
      "text": "UPDATE: zipper broke😡 This case is extremely big, very bulky and hard to carry. I am pretty sure I can fit my brotherhood, all my gear, and my blind in this case. Way too big.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20160813
    },
    {
      "title": "Its way too big for all but the largest crossbows ...",
      "text": "Its way too big for all but the largest crossbows. I should have looked more closely at the dimensions. Not worth it unless your crossbow is huge.",
      "rating": 2.0,
      "verified": true,
      "author": "AMC in WV",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Crissbie case",
      "text": "Very roomy bow fit perfect extra room for accessories well padded",
      "rating": 5.0,
      "verified": true,
      "author": "Chris White",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great cross bow case",
      "text": "This Barnett Cross Bow Case is Great! it is very well made, rugged and fits awesome! It has a large pouch for your arrows and a smaller one to put your license and misc smaller items. Also it has a handle for carrying out to the woods.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Gekle",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Glad i got it!!",
      "text": "OMG!! This thing is huge!! Easily fit my Barnett Wildcat with no problem!! This same case was $60+ at Bass Pro but got it waaayyy cheaper here!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Devil's Reject",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "Xbox case",
      "text": "Great item arrived on time and it big and roomy. My Xbow fits nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "i love this case",
      "text": "i love this case . i have a quad 400 with a scope on it . everything fits in the pockets . bow fits perfect in this huge case . the price is great . well made product . i would recommend this to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "randall lowe",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "it is very large will hold the largest crossbow ever made",
      "text": "no straps inside the case to keep cross bow secure",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "he loves it and my son liked it so much he ordered one",
      "text": "Was a gift for my husband, he loves it and my son liked it so much he ordered one too",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20170602
    },
    {
      "title": "Nice case for the price.",
      "text": "My Barnett Jackel fit this case with room to spare. It has extra storage also and appears to be well made.Even though it is a soft case it will keep the cross bow shielded from the elements.",
      "rating": 4.0,
      "verified": true,
      "author": "Glenn S. Capron",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "This was recommended for the crossbow I purchased",
      "text": "This was recommended for the crossbow I purchased, it seems to be well made and has extra storage for tools, accessories and bolts, it is quite a bit larger than needed.",
      "rating": 4.0,
      "verified": true,
      "author": "J Thomas",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "great bag",
      "text": "great bag. I wish the straps were on a little differently to make it easier to swing across your shoulder, but a great bag at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Lampkin",
      "helpful_votes": 0,
      "publication_date": 20170105
    }
  ],
  "product_meta": {
    "title": "Barnett Crossbow Case",
    "description": "\"This soft side case from Barnett provides not only protection for your bow, but offers you easy access to your hunting or shooting accessories. Additional compartments provide room and protection for your quiver, accessory case and more. Details are not missed in this case for user comfort and convenience. The shoulder strap is padded and removable. Cross branded by Barnett\"\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :34 x 11 x 8 inches; 0.8 Ounces\n * Item model number :17083\n * Department :Unisex-adult\n * Date First Available :January 3, 2011\n * Manufacturer :Barnett Archery\n * ASIN :B004HW5NLI\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #222,490 in Sports & Outdoors (See Top 100 in Sports & Outdoors)  *  #99 inArchery Bow Cases \n   \n   \n\n * Customer Reviews:4.2 out of 5 stars857 ratings \"This soft side case from Barnett provides not only protection for your bow, but offers you easy access to your hunting or shooting accessories. Additional compartments provide room and protection for your quiver, accessory case and more. Details are not missed in this case for user comfort and convenience. The shoulder strap is padded and removable. Cross branded by Barnett\"",
    "rating": 4.2,
    "feature_bullets": [
      "Imported",
      "Additional compartments provide room and protection",
      "Padded shoulder strap is also removable",
      "Offers easy access to accessories",
      "Dimensions: 35” x 42” x 5”",
      "Soft side case provides protection and easy access to your hunting accessories.",
      "Comes with padded shoulder sling that is removable.",
      "Two outer zippered compartments for additional accessories.",
      "Fits all Barnett crossbows with scope attached.",
      "Large zipper side opening. Item is Cross branded by Barnett.",
      "Soft side case provides protection and easy access to your hunting accessories.",
      "Comes with padded shoulder sling that is removable.",
      "Two outer zippered compartments for additional accessories.",
      "Fits all Barnett crossbows with scope attached.",
      "Large zipper side opening. Item is Cross branded by Barnett."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "34 x 11 x 8 inches; 0.8 Ounces",
      "Item model number": "17083",
      "Department": "Unisex-adult",
      "Date First Available": "January 3, 2011",
      "Manufacturer": "Barnett Archery",
      "ASIN": "B004HW5NLI"
    },
    "categories": [
      "Archery",
      "Bow Cases",
      "Sports & Outdoors",
      "Clothing, Shoes & Jewelry",
      "Sports & Fitness",
      "Hunting & Fishing"
    ],
    "price": ""
  }
}