{
  "website_summaries": [
    {
      "verdict": "The Panasonic Lumix DMC-ZS8 is a fine compact megazoom, if not the best value.",
      "pros": [
        "The Panasonic Lumix DMC-ZS8 is a basic compact megazoom with very good photo quality and shooting performance for its class, as well as long battery life"
      ],
      "cons": [
        "The ZS8 is somewhat expensive for what it's offering"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Image quality": 7.0
      },
      "publication_date": 20110410,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked well for a little over 2 years",
      "text": "I was really impressed with this camera when I first got it. Nice LCD screen, good zoom (although I wish I had found the shortcut to quickly zoom in all the way before going to yellowstone), and a decent mic if you only plan to use video on a rare occasion. Overall a very nice little camera. My only complaint right off the bat was at short range it made skin tones look strange. After about two and a half years the zoom started acting up- once zoomed in youd have to turn the camera all the way off to zoom out again and about half a year after that started happening the zoom function broke down completely.",
      "rating": 3.0,
      "verified": true,
      "author": "Mandy & Zachary",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "wonderful camera",
      "text": "We replaced an earlier version of the Lumix, which was a wonderful camera but the zoom was acting up and repairing it would have cost more than half of the cost of this better camera. Everything about this camera is great. The best positive I will leave you with is to describe the picture quality. We have three pictures from a Europe trip which we had made into 24 x 36 prints on canvas. Everyone that sees them cannot stop staring. They look like beautiful paintings and on one we made of a canal in Bruge, you can look into a window of a home and appreciate the 5 red apples on a kitchen counter. Terrific!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren T",
      "helpful_votes": 16,
      "publication_date": 20110612
    },
    {
      "title": "Two crapped out on me",
      "text": "Bought this camera in December 2011. Within a few months there were gray splotches on my photos. In an Internet search I found that others also had the same problem with this camera. I thought perhaps dust got into it so...in July 2012 I bought another camera, same one because when it took clear photos I loved the camera. Within 4 weeks it stopped working. I tried two different fully charged batteries that worked in the first camera (that is unusable because of the gray splotches) so it wasn't a battery issue. It just died, and I babied this camera. So now I'm stuck with two of these cameras--one dead and one unusable. I wouldn't buy this product again.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Patrick Clark",
      "helpful_votes": 0,
      "publication_date": 20120827
    },
    {
      "title": "Performs well except",
      "text": "I like the camera overall and has performed well except for one issue. These cameras are prone to dust finding its way in and shows up on photographs. A YouTube video guided me through disassembly and cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "mark a stueber",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Adequate camera",
      "text": "We liked it at first although not as small as we wanted for second camera. Also not nearly as good as our Lumix FZ28. But more compact and handier to carry around. Did a great job a year or two, then picked up some ghosty artifacts on the image sensor or inside the lens. Thereafter this ZS8 is pretty good but the artifacts can get right in the way on pictures so not our first choice anymore.",
      "rating": 3.0,
      "verified": true,
      "author": "Debra Wood",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Where's my user manual!!!!!",
      "text": "So far so good. I am not a novice camera user. Yes, I could charge the battery, insert it, get a memory card inserted and take a couple of photos without a manual. But PLEASE give me a manual - even if I have to pay extra for it. Sure, I printed it out but what I print on my printer compared to a nice compact user manual doesn't even compare. I've always tucked my user manual into my camera bag for quick reference. \"Tuck\" hardly describes what I'd have to do with this printout. For now, I would say I like the camera but the documentation leaves lots and lots to be desired.",
      "rating": 4.0,
      "verified": true,
      "author": "Moldy in Maryland",
      "helpful_votes": 3,
      "publication_date": 20111215
    },
    {
      "title": "Great Point and Shoot",
      "text": "Just got back from vacation and had purchased this camera a month prior to replace an older Lumix my daughter had accidentally broken. I won't go into all the technical details since it seems all this has been covered sufficiently by others. I will say that this camera took excellent quality pictures and was easy to use. I love the 16x zoom and was able to get clear shots of houses at the top of mountains while standing at the bottom. Pictures are clear, colors are nice, and the automatice setting is all I used. I should have used the night setting on a couple of shots, but for the most part it wasn't neccessary. I recommend this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "hastep",
      "helpful_votes": 2,
      "publication_date": 20110718
    },
    {
      "title": "Wow - a great camera",
      "text": "I've had a few digital cameras, but I wanted one with more zoom - and this one has it. Great zoom. BUT I underestimated how useful the 'wide-angle' lens is - Had I known how much better many photos can be with a wide angle lens, I would have gotten one sooner. With both a great zoom and a wide-angle, this camera does it all for me. And for all that it does, it's still small enough to be easy to carry. My wife liked it so much, that she bought one too - she's a realtor and says it takes great indoor wide-angle photos that are as good as another realtor's $5000 camera.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Ebben",
      "helpful_votes": 3,
      "publication_date": 20110710
    },
    {
      "title": "Fine little camera exceeds expectations.",
      "text": "I like to go on birding trips and foraging for wild mushrooms, and am approaching 72. These days I find my aging joints need to carry less, so bought this sleek little camera for portability, expecting some reduction in quality. What a revelation! The pictures are so sharp and clear, it is so light to carry, and most of all, the on-screen instructions are so easy to understand; so much better than having to look everything up. It also is very good at taking shots with indoor lighting. This has largely replaced my big Canon, maybe completely, although on sunny days I do miss the viewfinder.",
      "rating": 4.0,
      "verified": true,
      "author": "HeatherTee",
      "helpful_votes": 0,
      "publication_date": 20121024
    },
    {
      "title": "An excellent little camera",
      "text": "I always carry a small camera in my purse for those times when an unexpected opportunity happens. I bought this one as a replacement for an earlier panasonic, but I have also had a Nikon Coolpix and a Canon elph. This camera is totally amazing. The clarity of the images, the speed, the telephoto and close-up functions are beyond reproach. I would very highly recommend this camera to anyone wanting a small, convenient travel camera. The battery is long lived and not expensive, so I always have a second at the ready. I find myself using this camera even more often than my DSLR.",
      "rating": 5.0,
      "verified": true,
      "author": "Schoodic Lady",
      "helpful_votes": 0,
      "publication_date": 20130220
    },
    {
      "title": "Highly recommended",
      "text": "So far, after a week of using it over the holidays, I am very happy with this camera. One feature I am thankful for is the ability to zoom while recording video. The only bad thing I can report at this point is the failure of good photos using the automatic scene setting. Several indoor photos turned out grainy and dark. It worked much better when I chose my own scene setting. However, I have heard this is a problem with most cameras. All in all, great photos and great videos. I would highly recommend it... especially for the low price (paid $150) to get 16X optical zoom and wide angle.",
      "rating": 5.0,
      "verified": true,
      "author": "Groovy Chick",
      "helpful_votes": 0,
      "publication_date": 20111231
    },
    {
      "title": "Dust issue on sensor..beware!",
      "text": "Beware of the dust bunnies...either learn to clean the sensor yourself, pay someone big bucks to clean it or get another camera. I love the quality of the photos, but it now has a dust spot... This makes for a very nasty situation, and Panasonic needs to clean up its act. Wish that I had known about this issue BEFORE I made my purchase. I now feel like I own a worthless camera.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Hansen",
      "helpful_votes": 2,
      "publication_date": 20150121
    },
    {
      "title": "Great camera for the money",
      "text": "This camera has been amazing. The wide angle is exceptional. People who are professional photographers have even been grudgingly impressed with the wide angle capability of this camera. The video is nice quality as well. I have used this camera for two years, and love it. Lots of manual settings to experiment with, and good automatic settings as well. The zoom is very nice as well, and the quick zoom button is a cool feature. Decent performance in low light. Highly recommend for a point and shoot, or for someone who wants to use more manual settings. Great camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "Photos were great as long as you didn't zoom in too much",
      "text": "Photos were great as long as you didn't zoom in too much. Noticed a good amount of sand/lint intrusion on the lense inside. overall was a great camera. due to junk inside of focals, don't really use this much anymore and don't wanna send it in to be cleaned or anything. In the market for a new, better and bigger upgraded camera.",
      "rating": 4.0,
      "verified": true,
      "author": "MACKHAUS",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "GrandmaBonnie",
      "text": "DMC-ZS8 replaces a DMC-TZ3. It is nice having very similar settings...with some extra features on the newer model. The extra zoom is wonderful! Only disappointment is what seems to be an even longer delay from picture snap to clearing of the LCD screen to capture the next picture. I'm still hoping there will be info somewhere to determine if there is a setting to shorten that delay. Otherwise, this camera is everything one could want in a compact zoom point-and-shoot camera for travels and active grandchildren!",
      "rating": 4.0,
      "verified": true,
      "author": "Grandma Bonnie",
      "helpful_votes": 3,
      "publication_date": 20110920
    },
    {
      "title": "Love this camera!",
      "text": "I love this camera. The pictures are clear, colors good and the size just right for my purse. I'm very pleased with it. I bought the caseto protect the camera. It's a tight fit but does hold the camera. There is no room for anything else even though there's a side zipper. It serves the purpose of protecting the camera and for the price, not a bad deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20110627
    },
    {
      "title": "Short life",
      "text": "Great little camera with easy to adjust functions. Very portable and took excellent photos under various conditions. Only problem after thousands of photos - dust got into the lens mechanism, and I was told it would be cheaper to replace than to send it to Panasonic for repair. I was hoping it would have more longevity as a workhorse camera.",
      "rating": 2.0,
      "verified": true,
      "author": "luvboox",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "ONE OF MY FAVORITE digital cameras.",
      "text": "I love the portrait pics. Happy Face is awesome feature which other cameras don't have.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelie Decleor",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "I Like This Camera",
      "text": "This is a great little camera. I don't expect the same quality as an SLR, but I get some darn good photos with it. I got tired of lugging a camera case around. I always have it with me for the \"unexpected\" photo op. In one compartment of my purse, I can carry the camera in the small carry case that I also bought on Amazon, an extra card, an extra battery, and the charger! If I just want to take the camera, I can hook it on my belt loop and don't even know it's there. For its size it has a great zoom and takes very good quality pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "IMA",
      "helpful_votes": 0,
      "publication_date": 20120902
    },
    {
      "title": "Amazon reviewer enabled me to purchase the right camera.",
      "text": "Before purchasing yet another small camera, I read the reviews about this Lumix. I've been following these cameras for about a year and, on the detailed critique of another patron, I purchased the camera. The earlier critique was spot on. It's easy to use: the common features are intuitively easy to find and to set. The best part of my evalutation must focus on the quality of the photos--exceeding my expectations for quality. If you have been disappointed by other brands with nonsensical menus and sub-standard photos, then this easy-to-use, high quality camerea is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "jpbreon@hotmail.com",
      "helpful_votes": 0,
      "publication_date": 20120104
    },
    {
      "title": "Don't Buy This!",
      "text": "Ironically this faulty item was recommended by my Digital Photography professor. When I turned on the camera the OIS (Optical Image Stabilization) message continues to come on and rather than allowing you to set it, does not allow you to use the camera. After reading on line that other people had the same problem and were not able to correct it. I decided not to waste any more time or money trying to fix it. This is not the only negative Amazon review of this product. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Ken Wahlstrom",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "What a difference a few dollars make",
      "text": "I didn't anticipate buying a camera in this price range but I'm glad I did. Right out of the box the camera takes the best pictures that I have ever taken. I leave it set on the automatic setting and it makes every picture right. Makes me look like a pro. I'm just thrilled with it. (And I should also note that I'm no camera smartie so folks should know that even though this camera is fairly sophisticated... it's very easy to use if you leave it set on automatic.)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20111209
    },
    {
      "title": "Quality camera for great price",
      "text": "Awesome camera. I've had 3 lumix / panasonic's now. and love them all. Pro: Small, comfortable grip, strong zoom, lots of pixel, depth of field, easy to use and powerful features of my pro DSL, good movies too Con: heavier than many cheap POS cameras due to the real glass lens used., not waterproof or sand proof so need to protect with a case.",
      "rating": 5.0,
      "verified": true,
      "author": "TechMan",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "I lost my first Lumix and bought it again on Amazon",
      "text": "Oh Lordy, lord......I was soooooo upset when I could not find my camera. I take lots of pictures every week. So I bought the next model up that had come out since my original purchase. As with the first camera, I am VERY pleased with this one. It has many features that I have not used yet but I like knowing they are there is I need them. I LOVE the large image viewer and the camera is very light weight and easy to hold for someone like me with small arthritic hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Dona A. Monroe",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "Dust behind lens ruins every picture.",
      "text": "This started out as nice little camera with good zoom. After less than a year I started getting spots in the same position on all my pictures. At certain distances I can use the focus to get rid of some of the spots. There is an online tutorial showing how to open the camera and clean it. I might try before I buy a new camera. In any case, I say stay away from this one.",
      "rating": 2.0,
      "verified": true,
      "author": "PameltheCamel",
      "helpful_votes": 3,
      "publication_date": 20131003
    },
    {
      "title": "Replacement camera",
      "text": "This camera replaces the exact same camera I had which I broke removing dust from its sensor the second time. I read where sensor dust is a common problem with this camera, but I love it too much to change. Now I will try to keep it in a waterproof pouch to extend its life. For the cost and its features, this camera cannot be beat. Pictures are sharp, videos clear, and zoom is fantastic for its size.",
      "rating": 5.0,
      "verified": true,
      "author": "Tuffys",
      "helpful_votes": 0,
      "publication_date": 20130817
    },
    {
      "title": "Nice camera",
      "text": "I love this camera! I wanted a good little point and shoot camera that took clear crisp pictures and that is just what I got. I have a new great grandson and getting a clear picture of him was impossible the way he would move. But not anymore with this camera and I want to order one for my grandaughter for her birthday. I have never owned a panasonic camera but after reading many reviews I decided on this one and it was a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Or Shelly Quail",
      "helpful_votes": 0,
      "publication_date": 20120213
    },
    {
      "title": "Outstanding Underwater",
      "text": "Coupled with the [ASIN:B004TLK8GM Panasonic DMW-MCTZ20 Underwater Marine Case for Lumix DMC TZ20 Digital Camera]], the ZS8 is great dive camera for less than $500 complete. That's crazy. I've taken several thousand exposures with this camera underwater. The results are stunning. (See the images.) The built-in flash is ready to be used to trigger an external strobe. You get through-the-lens exposure control with no fuss. When the dive is over, the ZS8 comes out of the u/w housing to become a great pocket camera again. So much versatility, portability, and image quality for so little expense.",
      "rating": 5.0,
      "verified": true,
      "author": "SnowBird",
      "helpful_votes": 0,
      "publication_date": 20110926
    },
    {
      "title": "Worked for maybe 20 pictures",
      "text": "I purchased this camera as a Christmas gift, and it was used maybe twice before it stopped working. I thought it may be a battery issue, but I ordered a replacement battery and charger and it still doesn't work. My best friend had an earlier model of the same camera, and she's had it for a few years with no problems, which is why I chose the Lumix. I didn't realize until it was out of warranty that it wasn't just a battery, so now I guess I'm just out of luck for this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "fannbea6",
      "helpful_votes": 2,
      "publication_date": 20130530
    },
    {
      "title": "Good point and shoot like a pro",
      "text": "This is a replacement for another Panasonic camera with 10X zoom. I bought this one because it has even longer zoom. I found the swithc for shoot and view on the back of the camera is a bit not convenient. The old one you just turn the dial to select shoot or review. All in all, it's a great camera. By the way, my old one was soaked in water on the beach for a short time. It stopped working in a few days. However, just on the day this new one arrived, the old one went back to work again. This make me believe the quality of the Panasonic camera is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Web Ranger",
      "helpful_votes": 0,
      "publication_date": 20110922
    },
    {
      "title": "Lasted 1 year and 3 months",
      "text": "I was a good camera while it lasted. I cannot believe we purchases in July 30, 2012 and it died today... what a waste of money.. Update ... to review. The cost to repair or send a recondition camera will be around $180... Not worth it... Repair Fee Return Shipping Estimated Tax $172.75 $7.50 $0.00 Estimated Total$180.25",
      "rating": 3.0,
      "verified": true,
      "author": "R. Cortez",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "Happy Customer",
      "text": "Just came back from out west using our Panasonic Lumix DMC-ZS8 camera for the first time. The zoom quality was excellent & the camera was very easy to use. We got great pictures. The only negative thing I have to say is the problem with the sun glare on the screen. It was impossible to see what you were filming. Have ordered glare shields but haven't received yet. Hope this solves the problem. Other than that I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanie",
      "helpful_votes": 0,
      "publication_date": 20110708
    },
    {
      "title": "Awesome camera!",
      "text": "I use this for work as a property inspector. The optical zoom allows me to get great shots from a distance without necessarily having to get right up on the subject. I have it set up as needed and have not used many of the other features. I am just happy to be able to get a 16x optical zoom at such a great price. This was a replacement for a Panasonic DMC-TZ1 that took over 10,000 pictures before starting to wear out mechanically. Took a real beating out in the field. I hope this one lasts as long.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 2,
      "publication_date": 20110618
    },
    {
      "title": "Love this camera",
      "text": "Love this camera! Easy to use automatic settings. But also has manual settings if you want to get creative. Great zoom. Only complaint is that the colors are not always true to life. But that's true for all cameras in this price range. Also, the automatic settings does not do well with macro pictures. The battery has great longevity but takes a long time to charge (several hours to fully charge). If you are planning on going on a vacation and taking a ton of pictures, buy an extra battery. So one battery charges while you use the other one.",
      "rating": 5.0,
      "verified": true,
      "author": "Rukshana Ahmed",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Junk. Dust on photos",
      "text": "Google this model to see how many users report dust entering the camera through the extended lens and ruining their photos. Some report bad dealings with warranty coverage. I did not bother trying. Finally the multiple dust blurs became too numerous and I have junked this camera.",
      "rating": 1.0,
      "verified": true,
      "author": "calart",
      "helpful_votes": 5,
      "publication_date": 20130320
    },
    {
      "title": "So simple your mother can use it!",
      "text": "I gave this as a gift to my technology challenged mother, she loves it. The camera is simple to use and takes great portrait style pics in full auto mode, which is where she leaves it. If doesn't do a great job of capturing the grandeur of a landscape, but if you need a camera for intimate family settings, this is a great choice.",
      "rating": 5.0,
      "verified": true,
      "author": "craig w",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "great digital camera, easy to use, and large view",
      "text": "I've been using an olympus Optio waterproof camera for 10 years - all around reliability. I wanted to try another digital and got this Lumix. It has a better zoom and better image quality. It's not a professional camera, but I just use this for family and travel photos. I shared it with my nephew and he really enjoyed taking photos and piecing together great panorama shots of Yosemite and the Sierras. Good camera!",
      "rating": 5.0,
      "verified": true,
      "author": "close reader",
      "helpful_votes": 0,
      "publication_date": 20120812
    },
    {
      "title": "Great small camera",
      "text": "I added this camera to supplement my Olympus E 520 SLR because I wanted a small camera to take along hiking. This camera does everything and more. The only thing that is missing, as with so many products today, is a small, maybe 4x6 Manual instead of the on line stuff. Something you could take along on a trip or read anyplace and be able to switch pages without having to fuss with keyboards.",
      "rating": 5.0,
      "verified": true,
      "author": "CWOLF",
      "helpful_votes": 14,
      "publication_date": 20110530
    },
    {
      "title": "Like new quality.",
      "text": "Cameras and accessories were like new, very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "The best for the price",
      "text": "I had this camera for a few years now and must say , that it is a great camera for the price. It has performed incredibly well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jose  Ramos",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "With out a doubt one of the best small cameras on the market",
      "text": "With out a doubt one of the best small cameras on the market. I have had 3 Lumix Cameras and loved everyone of them. Great lens, tough little camera, great zoom range.",
      "rating": 5.0,
      "verified": true,
      "author": "chuck rouse",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "nice little pocket camera",
      "text": "Great little pocket camera. I have a 5 year old lx2 and used the same sd card and the pictures taken with the dmc-zs8 are virtually identical. The real difference is that the display monitor of the zs8 is oustandingly superior. There in nothig wrong with the lx2 but the zx8 is easyer and much simpler to use. But I miss the RAW feature of the lx2. YOU REALLY DO GET WHAT YOU PAY FOR.",
      "rating": 3.0,
      "verified": true,
      "author": "George A. Dapsevicius",
      "helpful_votes": 0,
      "publication_date": 20110919
    },
    {
      "title": "Lousy tech support",
      "text": "The camera is ok but the one star is for the terrible Panasonic tech support. First the printed manual is eliminated and then when I email for a problem answer I am told to call an 800 number. I call the 800 number I am told I would have to pay $7.00 for an answer. So, buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Tina from Brooklyn",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "LOW LIGHT AND CONCERT SHOTS NOT PERFECT!",
      "text": "Still not getting the low light and concert stage photos I really need, for I am an entertainer. Been fooling around with several settings and still not what I wanted the camera for. I now own 4 cameras..Canon, Kodak, Nikon and Panasonic (plus the camera on my phone). It does real nice photos and it is more stable than the Nikon.",
      "rating": 4.0,
      "verified": true,
      "author": "Eve Holmes",
      "helpful_votes": 0,
      "publication_date": 20130622
    },
    {
      "title": "Great camera decent price",
      "text": "My first Panasonic Lumix DMC-Zs8 camera broke (accident) and I immediately went to find another. Best Buy said they don't have them anymore, so bought this one from Amazon. Takes great photos, excellent close ups, even though I am not a skilled photographer. I hope Panasonic starts making these again, because it is the best camera ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Mothership",
      "helpful_votes": 0,
      "publication_date": 20131030
    },
    {
      "title": "in this almost 3 years that i own the camera ...",
      "text": "in this almost 3 years that i own the camera doesnt have much problem. Just the lens got a lot of dust (not just mine, a friend have the same camera and had the same problem), but i saw a tutorial on youtube and followed the steps to clean it. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Paulina Escobar",
      "helpful_votes": 0,
      "publication_date": 20141017
    },
    {
      "title": "Panasonic Lumix DMC ZS8",
      "text": "As advertised and a great camera. This is our 2nd Lumix and for the price point it's terrific. Highly recommend it for the average user that's looking for an excellent point and shoot with a few extra features, should you want to use them. We find the stabilization feature one of the best on the market. We choose Lumix again after reviewing everything out there in the product category. Can't go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Al B.",
      "helpful_votes": 0,
      "publication_date": 20110905
    },
    {
      "title": "Terrific camera",
      "text": "My husband and I recently purchased the Panasonic Lumix DMC-ZS8 camera and are totally satisfied with our purchase. It is the best small camera we have ever owned. The options for taking pictures are easily understood; it was so easy to catch my 3 year old grandson speeding down the driveway on his tricycle using the sports adjustment: absolutely no blurring! The 16x zoom is very satisfying when you want to catch something at some distance away. The burst adjustment allowed me to photo a rabbit in the yard who might move any second by taking 4 photos in quick succession: we caught him perfectly! I'm looking forward to trying out some of the other options!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 2,
      "publication_date": 20110917
    },
    {
      "title": "best compact camera I ever owned we have 3 of them",
      "text": "best compact camera I ever owned we have 3 of them - rugged, user friendly, full featured and uses SD cards which in class 10 absolutely rock ... both pictures and videos are excellent - I can't say enough good things about this model from Panasonic - buy it you too will love it",
      "rating": 5.0,
      "verified": true,
      "author": "jackbnimble",
      "helpful_votes": 0,
      "publication_date": 20140112
    },
    {
      "title": "Good Pocket Cam.",
      "text": "Great little travel camera but some real limitations when trying to focus at full (optical) zoom. Still glad I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "KjelRay",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "A GREAT camera to consider!",
      "text": "I was on a trip with friends in June and saw first hand the capability of this camera. The zoom enables many photo ops that other \"hand-held\" cameras didn't offer to me before. I was able to get pics in situations that I wouldn't have considered getting with my other cameras. The camera is light weight and fits in the shirt pocket easily, but it feels substantial, not cheap. Good directions are provided. I needed them to help locate how to use the MANY features that are available. (For the first time, I successfully took pictures of last 4th of July fireworks!) I'm now a believer in Panasonic products after being a Canon user for years.",
      "rating": 5.0,
      "verified": true,
      "author": "J. M.",
      "helpful_votes": 0,
      "publication_date": 20110912
    },
    {
      "title": "Great camera for its price!",
      "text": "My old 5 year old Canon Powershot was going out of commission and forced us to look for a new camera. I knew what I wanted, which was the following: 1. High optical zoom 2. Fast shutter speed 3. Good battery life 4. HD video 5. Big lcd display 6. Price under $150 So far, it's been almost a month and all those criteria were met. Other brands offer something similar, but would not have the optical zoom or the price. Great buy for this price range. This is my first Panasonic camera, but I have a lot of confidence in the company and do enjoy the camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Bargain Hunter",
      "helpful_votes": 0,
      "publication_date": 20120202
    },
    {
      "title": "great!",
      "text": "I had a Kodak easy share for years and loved it- but I could not get photos of my kids on stage at there performances without the being dark or blurry. With this camera I can get those shots! I also love the zoom- very crisp and clear even on the high zoom setting (I have not used the digital zoom- but haven't needed it due to the high optical zoom). my only complaint is when taking close ups - a few inches away- there is often a dark shadow in one coroner of the photo unless taken in a LOT of light.",
      "rating": 4.0,
      "verified": true,
      "author": "Shannon Dixon",
      "helpful_votes": 0,
      "publication_date": 20111010
    },
    {
      "title": "Leica Wide Angle Lens and sturdy. GREAT point and shoot.",
      "text": "fantastic camera, sturdy, wide angle lense. Mine is a little \"beat up\" and will buy same camera again. easy to use you can take nite photos of fireworks with the scene feature. fits in your purse or backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Shari Moy",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Great camera",
      "text": "Great Camera. This is a great camera and my second one. I used the other one for quite a few years doing food photography in hot kitchen and the only reason I had to buy a new one was because I dropped the old one.",
      "rating": 5.0,
      "verified": true,
      "author": "James Peter Walsh",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Just love this camera",
      "text": "Just love this camera. Have not had a bit of problem with it. It takes great pictures, is easy to use and the greater zoom than most cameras have is great.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Ogden",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Lumix DMC-ZS8",
      "text": "This is a great camera. My favorite part of it is the zoom+stability control capability. The interface is pretty good. It doesn't have as many cool options as other cameras like picking just one color to stand out in pictures but it has a bunch to choose from. The picture quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mihai Marin",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "can't be beat for the price",
      "text": "i was eager to try panasonic and bought this when i had to send my canon sx-130 for repair. wow, i was impressed right off the bat. the lens is incredibly sharp, focus is fast, and the controls all seem to be in the right place. it has its limitations like all point and shoots, (particularly low light), but for a camera that will fit in my pocket i can live with that. it feels right in my hand.....sturdy. i now have my canon back, but use the lumix more often because of the way it feels. they both take good pictures, and each can outdo the other at some things.",
      "rating": 5.0,
      "verified": true,
      "author": "chard",
      "helpful_votes": 0,
      "publication_date": 20111023
    },
    {
      "title": "great camera for the price and features",
      "text": "Bought this because my old camera was a pain in the a-- when you pushed the button to take the picture there is a too long delay before it snapped off the picture . Have to admit that I leave it in auto mode but that is good for me also like the zoom lense to pick out how to frame my picture(s)",
      "rating": 4.0,
      "verified": true,
      "author": "Got Here As Soon As I Could",
      "helpful_votes": 0,
      "publication_date": 20130608
    },
    {
      "title": "Small but mighty",
      "text": "I booked a week long safari to coincide with a business trip. I had a weight limit which included work computer and clothes in addition to the binoculars, camera and safari outfits. This camera was just right. The wide angle lens and 16x optical zoom produced beautiful photos. I didn't even use a tripod or bean bag and the pictures were just as steady. I highly recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "PeggyC50",
      "helpful_votes": 0,
      "publication_date": 20120604
    },
    {
      "title": "Panasonic Lumix DMC-ZS8 14.1 MP digital Camera",
      "text": "I love, love, love this camera. It is so easy to use, pretty much point & shoot and the results are super. It is small and light weight so I can drop it in my purse and not be weighed down. I really like the wide angle lens. I mainly use the camera to take pictures of properties that we have listed for sale and upload the pics to the various web sites on the internet. This is one of the best cameras I have found that serves my purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "jbornhorn",
      "helpful_votes": 0,
      "publication_date": 20121128
    },
    {
      "title": "The lens cover stops working after a few months, ...",
      "text": "The lens cover stops working after a few months, on 2 separate cameras, a problem I have not had with other brands line Cannon.",
      "rating": 2.0,
      "verified": true,
      "author": "MAGA",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Love this camera... really needs sd card.",
      "text": "This is the best camera I've owned. Takes wonderful pictures in the dark, while things are in motion and nice video. That being said you absolutly need an sd card. You can only take about 5 pictures at the 14 MP setting with the built in memory. Otherwise this camera would get 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20120808
    },
    {
      "title": "Lens cover failed",
      "text": "This is my second Lumix camera, and will be my last. These cameras have great lenses, a nice user interface, excellent features, but for me the reliability has been awful, and it's a hassle to ship them to the repair center. The built-in lens cover failed the third time I turned the camera on.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Martin",
      "helpful_votes": 0,
      "publication_date": 20120820
    },
    {
      "title": "Do NOT buy this camera!",
      "text": "This camera sucks! I have it for 8 months and I am forced to open it each month to clean the sensor (I learned that from a youtube video). Unfortunately I can't clean the huge amount of dust accumulated inside the lenses (not on the sensor). Panasonic need to recall all these cameras and replace them with new ones for the people who spend over 200 dollars for a camera worst than a $50 one. In few months my camera will be impossible to use because of the dust accumulated between lenses. Do NOT buy this camera!",
      "rating": 1.0,
      "verified": true,
      "author": "Cristian",
      "helpful_votes": 4,
      "publication_date": 20120531
    },
    {
      "title": "Excellent Camera!",
      "text": "Camera is perfect! (Got this for my husband) He used it during a hunting trip and although it wasn't a very successful hunt, from his tree-stand he did get a great zoomed in picture of a bright red cardinal foraging for food in a sea of brown leaves.... We would definitely recommend this camera! (definitely makes me want to replace my not so old camera with a Panasonic!)",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ramos",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "DON'T BUY THIS CAMERA ...",
      "text": "After using this camera for about 1 year, dust started to appear in the pictures I took. For what I read it seems it's a problem in the fabrication facility. It only got worst and worst week after week. More spots appear in the pictures I take and it seems that dust already existed inside the cam since before I bought it. DON'T BUY THIS ONE.",
      "rating": 1.0,
      "verified": true,
      "author": "Sandro Martinez Placencia",
      "helpful_votes": 4,
      "publication_date": 20130612
    },
    {
      "title": "Great Pocket Camera",
      "text": "The 16X wide angle optical lens sets this pocket camera apart. The wide angle lens (equivelent to about a 28mm on a 35mm SLR) is great for group pictures, landscapes and interiors. The settings are pretty standard and easy to figure out. The lens really makes this one worth the extra $s.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20120509
    },
    {
      "title": "Panasonic Lumix camera",
      "text": "Panasonic Lumix DMC-ZS8 14.1 MP Digital Camera with 16x Wide Angle Optical Image Stabilized Zoom and 3.0-Inch LCD (Black and , absoulutely works fabulous, i luv them and this dealer. top seller in my books highly recommmend. best camera i've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "ladykent",
      "helpful_votes": 0,
      "publication_date": 20120509
    },
    {
      "title": "Panasonic Lumix DMC-ZS8 14.1 MP Digital Camera LOVE< LOVE This camera",
      "text": "I WISH Ii COULD FIND ANOTHER, BUT NO LONGER AVAILABLE. SIMPLE TO USE, THE NEW ONES HAVE TOO MUCH ON THEM FOR JUST A SIMPLE POINT AND SHOOT.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Worked fine for 2 years - then it happened.",
      "text": "Liked the camera for the most part for almost 2 years. Then started seeing fuzzy spots on the pictures. From doing some research found out that the ZS-8 is known to get dust inside the camera which makes spots on the pictures. To fix the camera, one would have to send it back to Panasonic to have cleaned and that would cost almost as much as the camera. Since this is a on going problem with this model not worth fixing.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Win",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "Great Camer",
      "text": "After reading enough camera descriptions to blurr my vision, I decided on this Panasonic. The size isperfect to fit in my purse, so I will always have a camera when all of \"those great shots\" that grandkids present. The pictures are of good quality also. What else could I say....great choice",
      "rating": 5.0,
      "verified": true,
      "author": "Bonita Balla",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "great, dirty & easy",
      "text": "I used the DMC ZS8 for 6 months of tough back country photography. Great camera/features untill a spot showed up inside on the lens. I'll probably buy another one since it will be close to $200 to fix this one. REVISITED 1 year later- Shortly after my original review I found a youtube video showing how simple it is to clean this camera. I cleaned the lens, and have used the lumix ever since under tough conditions (ice to dust) and still love it. It is an awsome camera and, due to the size, I have it with me all of the time while my larger cameras gather dust.",
      "rating": 4.0,
      "verified": true,
      "author": "snolion",
      "helpful_votes": 0,
      "publication_date": 20121021
    },
    {
      "title": "Happy with my Purchase!",
      "text": "The cameras exterior was a little more banged up that I expected, however, it has performed very very well. I'm extremely happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "B.P.",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Used Camera but works great.",
      "text": "The camera was used, not new as advertised. The box was open, thumb print on the front of the camera, and the date was set. Not happy. Camera takes beautiful pictures but I am returning for replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Kay (Chicago, Il USA))",
      "helpful_votes": 3,
      "publication_date": 20120307
    },
    {
      "title": "Worthy Successor to my ZS3",
      "text": "I have bought this as a back up for my 3 years old ZS3 . Overall it is a good value for money as there is jump of 4 megapixels from ZS3 (does not matter much), more zoom. Only gripe is NO HDMI out and Movie format is not mts (which makes smaller file). Overall Good VFM.",
      "rating": 4.0,
      "verified": true,
      "author": "Amit",
      "helpful_votes": 0,
      "publication_date": 20120315
    },
    {
      "title": "Glad I purchased this one",
      "text": "I have NO complaints so far, and am impressed with it's many features which are not difficult to understand even if I may never use them all. I especially like the 24mm wide angle, which is one of the main reasons I selected this camera. It is just the right (small) size and seems very well made. It apparently will do all I need without the bulk and weight of a SLR. My three old film SLRs can't compare.",
      "rating": 5.0,
      "verified": true,
      "author": "OneOldMan",
      "helpful_votes": 0,
      "publication_date": 20120428
    },
    {
      "title": "Lumix Camera",
      "text": "It works well and as expected. Bursts option works great. I caught many good pictures by using that option. The 16x zoom is great, but pictures aren't very clear. The camera is fairly heavy for a handheld, but still fits in my pocket. I like that the zoom can be changed while recording a video, but it takes up lots of space on the memory card. Overall I like the camera. But my 3x kodak camera seemed to take better portrait photos than this camera, despite all the options to make it work.",
      "rating": 4.0,
      "verified": true,
      "author": "RunningFool",
      "helpful_votes": 2,
      "publication_date": 20120103
    },
    {
      "title": "great camera lousy instructions",
      "text": "I love this camera. It takes great pictures and movies,which of course was my main objective. What I do not like is the instructions. The owners manual is very difficult to read and not user friendly. This camera has a great many features that would make custom picture taking possible but I am not a camera expert and have no idea how to use the many features. I really wish it came with a video tutorial. I don't even know where I could go to find better instructions. So five stars for the camera, no stars for the owners manual.",
      "rating": 4.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 2,
      "publication_date": 20110805
    },
    {
      "title": "Excellent quality camera!",
      "text": "I bought this camera after buying multiple others which did not meet my expectations. DO NOT BUY A KODAK. They do not stand behind their products! After using this Panasonic, I am very pleased to have finally found my camera. The picture quality is great. When using the zoom, the picture remains very clear. It is very user-friendly. I would recommend this camera for anyone who is looking for a mid-level camera. Spending the little bit more for this one was definately worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 4,
      "publication_date": 20120222
    },
    {
      "title": "Good Camera",
      "text": "I bought an older version 7 yrs ago and loved how it worked and how it lasted so much I bought this for my parents for Christmas. It takes great pictures and is very easy to use. The battery lasts forever and charges quickly when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "S Bolger",
      "helpful_votes": 0,
      "publication_date": 20130104
    },
    {
      "title": "Super camera!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "text": "Excellent and amazing camera. Pictures absolutely crisp,perfect in light or darkness. Many features to get any situation or moments in your lens. Easy to use and don't spend your time loking for another point and shot,,,buy this now.",
      "rating": 5.0,
      "verified": true,
      "author": "ivango",
      "helpful_votes": 2,
      "publication_date": 20111217
    },
    {
      "title": "A & S manual modes are ok, however",
      "text": "it takes multiple button pushes to toggle through the available apertures or shutter speeds one at a time. It would be better to list all available settings onscreen, and then just hold an arrow-button to scroll through them.",
      "rating": 4.0,
      "verified": true,
      "author": "Divot",
      "helpful_votes": 0,
      "publication_date": 20120603
    },
    {
      "title": "Great pocket camers",
      "text": "Great small camera. Bought to replace Lumix I lost. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael A. Colley",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Beautiful pictures, easy to use.",
      "text": "Excellent quality. Takes wonderful pictures. Used the camera on numerous outings: Ireland, JMT, horseback riding, camping, canoeing, etc. The ease of use and and zoom make all the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Graywolfnine",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Dust infiltration spoiled a GREAT camera for me",
      "text": "GREAT zoom. Too bad ththis model has the problem with the dust creeping in to the sensor. I have the tools and the youtube video on how to clean it out, but I don't have the guts to pull it apart. It takes a GREAT picture, though. I'm afraid if & when I clean it out, it will just happen again & again. What a shame.",
      "rating": 4.0,
      "verified": true,
      "author": "bob",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "Ok.",
      "text": "This camera worked great for the first 2 weeks, then it got dust inside it. It eventually quit working all together after a short while, giving me an Auto Focus Error.",
      "rating": 2.0,
      "verified": true,
      "author": "Kayhold",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "This is the best kind of point and shoot camera made! I added a photo I took of a raccoon going to eat my cats food.",
      "text": "Best point and shoot camera I've ever had with a Leica lens. The only other I would use is a Sony with a Zeiss Lens. I have a degree in photograph and can tell you those two companies make the clearest lenses, and a professional camera like that would cost thousands. For most general photos it's all that you need.",
      "rating": 5.0,
      "verified": true,
      "author": "jeremy borders",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Chamber of excellent quality and good price",
      "text": "This is an excellent camera where photos and videos taken by a tourist and become very easily amateur in a professional quality photos, simply knowing how to use all its excellent and easy to operate for the particular time and she plows the remaining work. I recommend it for its small size, powerful and very lightweight zoom lens for your leisure or just to have it at home and have memories of those special events to save. Sending this seller was very fast and safe, 100% recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "TONI",
      "helpful_votes": 0,
      "publication_date": 20110905
    },
    {
      "title": "Broke after 2 weeks",
      "text": "I have chosen this camera, because I already had a Panasonic DMC-ZR1, which made very good pictures, but got some dust/dirt into the lens. The lens shutter of the new ZS8 stopped opening/closing properly just after 2 weeks. Returned it to the seller and got reimbursed promptly. I will give an another try with the Panasonic ZS19. The big plus is, all this models have the same battery and loading socket.",
      "rating": 2.0,
      "verified": true,
      "author": "Atlanta housewife",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Five Stars",
      "text": "Worked great until we had wind blown dust get behind the lense cover",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "Great Camera for the Price",
      "text": "This camera is great for me. It has excellent zoom capabilities. Awesome pictures, not too bulky, still fits in a shirt pocket. Cameras keep getting better, with more features, for less money all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "John Greene",
      "helpful_votes": 0,
      "publication_date": 20120102
    },
    {
      "title": "Should have been told in advance that the last was bent",
      "text": "Lens was bent when the product arrived, I will never purchase a used item again.",
      "rating": 1.0,
      "verified": true,
      "author": "brian burton",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Great!",
      "text": "Great camera for this price not only that the zoom is super but the video qaulity is wayyyy better than alot of other cameras out there I really have no complains. Me and my girlfriend take pictures of our son and your able to keep track of his age with each shot very cool feature I liked on this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryon",
      "helpful_votes": 0,
      "publication_date": 20130317
    },
    {
      "title": "love it",
      "text": "Purchased this one for my Husband last Christmas. I already have one, and like it so well I was sure he would also. Great pic's, love the lens. Zooms out to get far away items.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20130402
    },
    {
      "title": "Good with a caveat",
      "text": "This is a great camera. However, BE WARNED, the zoom mechanism, as I understand it, has a tendency to admit or suck in dust that mars the exposures, which means the camera has to be disassembled and cleaned (an expensive proposition--but there are some DIY instructions on YouTube). This has happened to any number of people, including myself and a friend. Still, I love the camera, so be very careful; get a case and don't zoom while you're pointing out the car window.",
      "rating": 4.0,
      "verified": true,
      "author": "Henry Jankiewicz",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "Great camera for the price",
      "text": "Got this for our office after having had an earlier version at home for years. I can't believe how quickly this camera takes pics when you push the button! Wonder if my boss would notice if I switched them... :)",
      "rating": 5.0,
      "verified": true,
      "author": "PNW Jenn",
      "helpful_votes": 0,
      "publication_date": 20111007
    },
    {
      "title": "Good camera with impressive zoom",
      "text": "Great semi-compact point and shoot. Zoom is amazing! Menu options are simple to use after a little practice. The black and white feature looks better than my digital SLR. Shutter lag is very short compared to other cameras I've used. Very pleased with my purchase. My one criticism is image quality is only fair in low light. Camera is a good balance in weight and durability. Found video format compatible with Picasa 3 photo software. For under $200 its a bargin.",
      "rating": 4.0,
      "verified": true,
      "author": "red400",
      "helpful_votes": 2,
      "publication_date": 20120101
    },
    {
      "title": "Excellent camera.  Extended stabilized zoom.",
      "text": "Durable. Useful size. Great reach with 16x reach. Very good images.",
      "rating": 5.0,
      "verified": true,
      "author": "path0103",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "This camera makes amazing pictures. It is simple to use and the ...",
      "text": "This camera makes amazing pictures. It is simple to use and the quality is excellent. I am sold on the Lumix.",
      "rating": 5.0,
      "verified": true,
      "author": "T Izzy",
      "helpful_votes": 0,
      "publication_date": 20140826
    }
  ],
  "product_meta": {
    "title": "Panasonic Lumix DMC-ZS8 14.1 MP Digital Camera with 16x Wide Angle Optical Image Stabilized Zoom and 3.0-Inch LCD (Black) (OLD MODEL)",
    "description": "Color:BlackFROM THE MANUFACTURER\n ZS8 \n\n 24mm Ultra Wide-angle 16x Optical Zoom LEICA DC Lens\nThe compact, versatile lens system is the hallmark of LUMIX ZS(TZ) series and now this lens system is totally redeveloped for the DMC-ZS8 in both optical and mechanical design. The new high-quality LEICA DC VARIO-ELMAR lens system is even more versatile with 24mm ultra wide-angle* to powerful 16x optical zoom (35mm camera equivalent: 24-384mm). Comprising 12 elements in 10 groups, including an ED lens and 3 aspherical lenses with 6 aspherical surfaces, this advanced lens unit suppresses chromatic aberration which tends to occur in telephoto shooting. It also boasts a short total length of lens unit despite its higher versatility with longer zoom range, which is made possible by development of a new mechanism for the structure of lens barrel. The lens system is also compatible with high shutter speed of min.1/4,000 sec.\n\n*Converted to standard 35mm camera equivalent, at the maximum wide position.\n\nPowerful 16x Optical Zoom\nThe DMC-ZS8 features a powerful 16x optical zoom lens (35mm camera equivalent: 24-384mm). This gives you highly natural expressions from people and animals that you can't get close to. It can also be used for shooting movies, and is designed to suppress noise while zooming. This compact, pocket-sized camera can easily go wherever you do for both everyday snapshots and traveling.\n\n\n\n\n\nVenus Engine VI\nThe high-speed, high-performance Venus Engine VI is incorporated in the DMC-ZS8 to enable the recording of beautiful images with higher quality signal processing including the Intelligent Resolution technology. An advanced noise reduction system in the Venus Engine VI applies noise reduction (NR) to luminance noise and chromatic noise separately. As a result, beautiful images with minimal noise can be reproduced all the way up to ISO1600 high sensitivity at full resolution for beautiful night shots or dimly lit indoor shots.\n\n\nIntelligent Scene Selector Scene Detection\nWhen the camera is in the iA Mode, the Intelligent Scene Selector automatically sets the Scene Mode to one of Scenery, Portrait, Macro, Night Portrait*1, Night Scenery or Sunset. The camera judges it from the various detection results such as focusing and brightness level of the circumstance*2. You are free adjusting settings every time the scene changes when taking images with these frequently used Scene Modes to get beautiful results.\n\n*1 In the iA Mode, the Night Portrait is not identified when the flash is turned off.\n*2 With some subject and shooting conditions, it is just not possible to judge the best shooting details. When this happens, it is recommended that you shoot with the Scene Mode that best suits your purpose.\n\n\n\n\n\n\n\nAF Tracking Subject Detection\nOnce you focus on your subject, the AF Tracking automatically tracks it until you press the shutter. When you're taking images of an active subject, like children or pets, this function eliminates the need to press the shutter button halfway down repeatedly to readjust the focus. The AF Tracking makes sure you don't miss those once-in-a-lifetime shooting opportunities\n\n\n\n\n\n\n\n3.0-inch, 230,000-dot High-resolution LCD\nThe DMC-ZS8 is equipped with a 3.0-inch LCD with 230,000-dot high-resolution. The big screen reflects fine details, making it easy to check the focus before shooting. It also serves as a photo and video viewer, allowing you and friends to enjoy viewing the still and motion images together.\n\n\n\n\n\n\n iA (Intelligent Auto) Mode\nWhen you don't know which mode will give you the best shooting results, or when a sudden photo opportunity pops up and you don't have time to change any settings, simply choose the iA (Intelligent Auto) Mode and let the camera do it all for you. You just choose the iA Mode, aim at your subject, and shoot. Seven detection and correction functions are simultaneously activated to optimize the settings, so you get stunning photos every time. In addition, the Intelligent Resolution technology is always activated in the iA Mode which results in clearer and higher image quality in every photo with extended zoom range equivalent to 20x by the Intelligent Zoom.\n\nPOWER O.I.S. (Optical Image Stabilizer) Shake Detection\nEveryone has had an experience of taking a photo at night and hoping to capture all the memories and beauty, only to be disappointed at the poor result. Panasonic has worked on the low-frequency vibration hand-shake component, which is physically generated when pressing the shutter button or when shooting at night with a slow shutter speed. The POWER O.I.S. (Optical Image Stabilizer)* nearly doubles the hand-shake correction power of conventional MEGA O.I.S. You get bright photos without blurring even from handheld shooting at slow shutter speeds.\n\n*The POWER O.I.S. is automatically turned on in the iA Mode and can be turned on or off in the P/A/S/M Mode or some Scene Modes. \n\n\n LUMIX Image Uploader\nThe DMC-ZS8 gives you a new form of communication by letting you share your photos and movies. All you have to do is checkmark the photos and movies you want to share and connect the camera or SD/SDHC/SDXC Memory Card to a computer. Uploading automatically starts by simply following the guidance.* Facebook can be used for photos and YouTube™ for movies. You can join these social networking services without having to install any special software. It's easy to share photos and movies on the spot, which means that your friends don't have to wait for you to come back home to see them.\n\nEasy Computer Connection\nSelect \"Upload Set\" from the playback menu, and then select the photos and movies.\n\nUpload Photos and Movies\nThe software is launched after connecting the camera or SD/SDHC/SDXC Memory Card to a computer.*\n\nShare with Your Friends\nYou can share the URL by e-mail right after the upload!\n\n\n\n\n* LUMIX Image Uploader starts up automatically on the computer the supplied software \"PHOTOfunSTUDIO Ver. 6.0\" or later is installed.\nIn other case, start up the menu by double-clicking the file \"LUMIXUP.EXE\" in the folder below:\n[My Computer] > [Removable Disk] > DCIM > AD_LUMIX (Windows)\n* YouTube is a trademark of Google Inc.\n* Facebook and the Facebook logo are registered trademarks or trademarks of Facebook, Inc.\n\n\n\n\n\nWhat's in the box\nLumix ZS8 digital camera, Battery Charger, Battery Pack, AV Cable, USB Cable, Hand Strap, CD-ROM",
    "rating": 4.3,
    "feature_bullets": [
      "The DMC-ZS8 features a powerful 16x optical zoom lens.",
      "The 16x Optical Zoom Keeps the Subject Sharp While Giving the Background a Soft focus.",
      "The DMC-ZS8 features a 1/2.33-inch CCD with effective 14.1-megapixel high-resolution;displkay size 3.0",
      "Images remain clear and sharp even when they are enlarged to A2 size.",
      "The Sonic Speed AF system includes numerous re-engineering enhancements, including a higher-speed actuator."
    ],
    "specifications": {
      "Product Dimensions": "1.31 x 4.13 x 2.27 inches",
      "Item Weight": "7.4 ounces",
      "ASIN": "B004KKZ0HE",
      "Item model number": "DMC-ZS8K",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars440 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#158,986 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 25, 2011",
      "Manufacturer": "Panasonic"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 67.99
  }
}