{
  "website_summaries": [
    {
      "verdict": "Uses a mini-size kibble, so small-breed dogs can easily chew and eat it. Made by one of the most popular brands in dog food.",
      "pros": [
        "Low price per pound compared to most other foods",
        "Contains 23 vitamins and minerals to enhance the dog's overall health",
        "Has a tasty mixture of crunchy and soft textures",
        "Easier to chew for older dogs than most dry foods"
      ],
      "cons": [
        "Some dogs will suffer from gastrointestinal issues with this formula"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Our new favorite!",
      "text": "We’ve always loved all the varieties of Beneful, but just recently gave the IncrediBites a try and LOVE THEM! They’re our new favorite! We have 3 dogs ranging from 5lbs to 15lbs. Our middle sized dog is a 14 year old Italian greyhound rescue with rotten and missing teeth. We’ve always had to add water to her food so she could eat more comfortably, but she devours these little ones before we even get the chance to add water! It’s great to see our old gal eating well. Our other two dogs also seem to love these just a little more than the other varieties, the smaller bites are definitely easier for their little mouths to chew. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Annie Alexander",
      "helpful_votes": 11,
      "publication_date": 20171127
    },
    {
      "title": "Defective Bag Closure",
      "text": "The bag arrived opened and the closure at the top did not function properly, so I could never securely close the bag. I can't tell whether the track is missing a zipper to slide across, but the closure does not grip to close. Dog food is great - the only dry food my dog eats without adding anything to it, but 15.5 lbs lasts a long time with one small dog. Preserving it is important.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170511
    },
    {
      "title": "IncrediBites",
      "text": "This is perfect for my older dog 🐕. The smaller bite size makes it easy to eat and he just loves the food. He's been eating Beneful brand for years. I switch the flavors or mix together to give him a variety of flavors and he is happy...and getting older. At 14 years old he's doing pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Meena",
      "helpful_votes": 8,
      "publication_date": 20170226
    },
    {
      "title": "I went through several brands of dog food to find one that they liked and would eat without adding canned food to it",
      "text": "My little dogs used to eat Chef Micheal's which is no longer being made. I went through several brands of dog food to find one that they liked and would eat without adding canned food to it. They have been eating Beneful Incredibites for small dogs and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Beatrice Pinkney",
      "helpful_votes": 8,
      "publication_date": 20160513
    },
    {
      "title": "Good dog food at a great price",
      "text": "Good dog food at a great price. I have a 15 year old dog and he's been eating beneful as long as I can remember, the incredibites is perfect for him as he has lost some teeth and has trouble with the regular beneful. I got my purchase prompt, and it was everything I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "michael rebeiz",
      "helpful_votes": 4,
      "publication_date": 20170411
    },
    {
      "title": "Olive Garden For Fur Babies!",
      "text": "Okay so my moms terrier thinks this is Olive Garden!! He typically loves to eat veggies and was not enjoying his previous dry food! Enter Beneful! And now he can't stop eating it! He also suffered from constipation a lot before, but now the little guy is a walking pooper with no problems! Lol! The bag was huge so he will have it for a while! Great price, huge bag and lil pup is happy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Such-A-Sweetie",
      "helpful_votes": 5,
      "publication_date": 20170711
    },
    {
      "title": "Cost Prohibitive",
      "text": "Our small dog loved the initial purchase of this dog food; however, in attempting to purchase a second time, price has tripled. Knowing that Rachel Raye’s brand Is unhealthy for all dogs, Purina is price gouging. Why would a dog food company want to charge $60 for a standard 15.5 lbs. (one month supply) to discourage any family from rescuing a pet? Very sad.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Good for the finicky eater",
      "text": "The product satisfies my 45 pound dog that eats whatever she can find, and my wife's finicky eater dog that has \"meal mood swings\". The bag volume is good, all of the food fits in our large dispenser with room for the scoop and a cereal size box or extra dog treats that we don't want to leave out for the ants to find. Prime shipping was on time and I can get a dash button for it if I want",
      "rating": 4.0,
      "verified": true,
      "author": "Kalani - Newport Beach CA",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Great food for a mixed sized dog household!",
      "text": "I have been feeding my dogs Purina Beneful Incredibites made with real beef for years. I have four dogs ranging in size from an 8lb mini doxie to a 55lb yellow lab/Akita mix, and they all love it. The Incredibites make it easy to use only one size of food for all of the dogs. It's easy to eat for my two smaller dogs, while still providing a satisfying meal for my two larger girls. I have a chihuahua/terrier mix that has a very sensitive stomach and he never has a problem with Beneful. I will definitely continue to be a loyal customer for as long as my fur babies own me!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy K.",
      "helpful_votes": 2,
      "publication_date": 20170517
    },
    {
      "title": "Jack wasn't too fond of his extremely expensive (named after ...",
      "text": "Jack wasn't too fond of his extremely expensive (named after an animal and a color) dry food. I tried adding some of this to his expensive kibble. It worked ! Now he gets 2/3 of Beneful Incredibites with 1/3 the \"other\" and he is quite happy",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Desert",
      "helpful_votes": 3,
      "publication_date": 20170307
    },
    {
      "title": "Made my dogs sick",
      "text": "After eating this food for 1 week my 2 dogs became extremely ill. I immediately stopped feeding it to them. I have read many people experiencing similar instances now. Something is wrong with this dog food. Be very careful.",
      "rating": 1.0,
      "verified": true,
      "author": "KM",
      "helpful_votes": 3,
      "publication_date": 20170709
    },
    {
      "title": "Great for tiny dogs",
      "text": "My tiny old chihuahua who has trouble eating anything even remotely large in size eats these perfectly! These are great for small dogs who can't chew big bites. No matter if you have a puppy or a miniature chihuahua these are great! My dog has been eating beneful for the majority of his life and he's perfectly healthy and the vet is impressed how good of shape he's in for his age. Dogs love this stuff! Mine won't eat anything else!",
      "rating": 5.0,
      "verified": true,
      "author": "LeeTop Contributor: Activewear",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "My 2 baby boys!!!!! Thank you 4 making this.",
      "text": "My 2 babies are my pride and joy. I can't have kids after cancer and everything, so I would give them anything. I tried the blue food and they wouldn't eat it. However when I gave them this one they loved it and will only eat this one. It funny cause 1 is a lab and the other is a Shepard. Thanks for making this 1, plus a lot of other brand made them sick this one they could keep down.",
      "rating": 5.0,
      "verified": true,
      "author": "Samadeo78",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "my Dogs love it",
      "text": "My dogs love this stuff so much they refuse to eat their regular dog food (purina naturals ) i just wish they would add the real chicken to this. Purina healthy weight has real chicken pieces. My only complaint is my dogs go though a bag of this faster then they do the other brands and they are getting quite chubby. The pieces are very small and easy for toy breeds to eat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Bad food received",
      "text": "I thought this food was suppossed to have tender birs in it. My bag did not. I called Purina and adked about it and they told me that thete should be crunchy and tender bits in it. It made my dog sick as it must have been sitting on a shelf somewhere Will NEVER buy dog food from amazon again",
      "rating": 1.0,
      "verified": true,
      "author": "kmh",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Reordered Twice for Happy Doggy!!",
      "text": "My yorkie Ollie loves Purina Beneful IncrediBites Chicken. I like that it’s a large resalable bag that is often cheaper than any store. He is a very picky dog and this is ALL he will eat. It is important that it is delivered to our door so he will never be without. He likes the favor of the real chicken; I like the protein and nutrients that kept him youthful over the years.",
      "rating": 5.0,
      "verified": true,
      "author": "Nise Jenkins",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "Fresh & Pup loves it",
      "text": "This was delivered within two days thanks to prime membership. My morkie pup loves it since it’s small pieces and easy for his little teeth. The zipper keeps the food fresh and it’s convenient. This bag was so affordable and much much bigger than I expected. It will last me about 6 months I’m sure since my puppy is so little. (17.6lbs)",
      "rating": 5.0,
      "verified": true,
      "author": "Chevy",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Sadie loves it 🐕",
      "text": "My dog named Sadie is a little 6 lbs miniature docson loves this food and she's very excited when I opened the bag, I've never seen her eat her food like she does with the food, she's usually very picky about what kinda food she eats but not with this food so when the time comes I will definitely be ordering more of this food for her.",
      "rating": 5.0,
      "verified": true,
      "author": "David L ( Rochester, Mn",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "3.5 lbs is not 15.5 lbs",
      "text": "I was surprised when the dog food finally arrived and at first I thought it was part of my cat food order. 3.5 lbs won't last long and I should we great full that I got something. Just disappointed. Don't know if I will look for another source for the dog food or find something else for the old guys.",
      "rating": 1.0,
      "verified": true,
      "author": "MTmama",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Lulú is very happy!!!",
      "text": "Lulú loves this food, I like the zip to seal the bag for fresheness.",
      "rating": 5.0,
      "verified": true,
      "author": "Johanna Astua",
      "helpful_votes": 7,
      "publication_date": 20171104
    },
    {
      "title": "Great size for small dogs.",
      "text": "I really like the size of the bites. My picky eater dog really likes most of it, however there is one of the pieces that he spits out on the floor. I have decided that I would rather sweep it up than sort it out! Lol. Hmm.. I wonder if they would make his without that one piece??",
      "rating": 4.0,
      "verified": true,
      "author": "S. J. Grider",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "More Meat!",
      "text": "My small Pomeranian mixes love this stuff and the incredibites are just the right size for my toy poodle. No complaints here and ever since they added the Real Chicken my dogs actually pick thru the meaty morsels first and leave the veggies for later.",
      "rating": 5.0,
      "verified": true,
      "author": "Ti",
      "helpful_votes": 2,
      "publication_date": 20171009
    },
    {
      "title": "I love Beneful dog food",
      "text": "I love Beneful dog food! I have 4 dogs and it's hard to find a food that they all will eat. My oldest dog is 14 and my youngest is 3. They all have different health problems and are all different sizes. This food works for them all!",
      "rating": 5.0,
      "verified": true,
      "author": "LCFTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20170301
    },
    {
      "title": "Loose stool",
      "text": "The ingredients seem right, but my dog had loose stool for as long as she had it. Once I switch she had better stool. But that’s just my dog, I don’t think it’s true for all dogs. It might be better for others",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Wheeler",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "I love the size of this bag for the price!!!",
      "text": "I love the size of this bag for the price!!! I $8 bucks on a 7 lb bag is the norm for our dogs but this is way better!!! The only issue I am having is that I don't really have anywhere to keep it. The bag is huge but comes with an airtight seal/zip close to keep it fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Our dogs love it",
      "text": "I can't speak to the nutritional value since I am not educated like that but I can tell you that our two maltipoo's eat it ALL when their bowls are filled. They didn't like other dry foods as much. We'll be ordering more shortly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Tadlock",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Great food for picky small dogs",
      "text": "The kibble is a great size for small dogs and they love the taste. Comes in a re-sealable bag which is always great and keeps it fresh. Highly recommend for a good food on a budget.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "For the price, this is a big deal of ...",
      "text": "For the price, this is a big deal of food. It has a zipper bag so it will stay fresh. I don't think I will have to buy more dry food for a year. My dog is a 9 pound mutt-a-doodle. He loves this food. We call it his cookies.",
      "rating": 5.0,
      "verified": true,
      "author": "goandgetmom",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "They consumed it as my love once consumed my soul",
      "text": "My dogs have never ate their kibble with such fervor in their lives. They consumed it as my love once consumed my soul, leaving no traces for anyone to ever taste again. Their bowl like myself, was left empty and disregarded.",
      "rating": 5.0,
      "verified": true,
      "author": "Babs",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "CHINTZY COST REDUCTION",
      "text": "Great product at a fair price. However, the package I received did NOT have the WONDERFUL “Stay Fresh Zipper” on it. Hopefully, the vendor will spend the additional $0.13 in the future to give us the quality we deserve.",
      "rating": 2.0,
      "verified": true,
      "author": "Public Servant",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "A great dog food",
      "text": "Been using this dog food for my crybabies for 3 years and they have no issues with it at all. Nice coat, active and healthy weight. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Williams",
      "helpful_votes": 2,
      "publication_date": 20171124
    },
    {
      "title": "We like the price",
      "text": "We like the price, and being able to purchase this to be delivered. All of my Bostons & my Pekingese love this food. Amazon beats the big box store price, and with prime we don't pay for shipping. No complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Bartow",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "My little Princesses LOVE this food!",
      "text": "I have 2 rescue Chihuahuas and they love this food. They are very picky and I have tried other foods and this is the only food they will consistently eat and not turn up their noses or walk away. And this is so much cheaper and easier to buy from Amazon, not to mention that my grocery store will only carry the very small bag of this food so a very poor value from the store. I only wish the ziplock on this would work more than just a few times.",
      "rating": 5.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 3,
      "publication_date": 20140628
    },
    {
      "title": "Know it is good food, but my little bitty girl won't eat ...",
      "text": "Know it is good food, but my little bitty girl won't eat it. But works out My daughter has two big dogs, German Shepard & Great Dane & Shepard mix, live next door & that what they feed them, problem solved.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer  Linda",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Arrives on time",
      "text": "Arrives on time. The big bag seems to have weavels or some type of bug infestation at bottom 1/3 of bag. Even when sealed in airtight container. Three times this has happened, we won’t be ordering it anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Recommended",
      "text": "I love the bag this comes in. I wish they all were made of that material and had a zipper. My damn dogs on the other hand won't hardly eat it, but then again they won't eat any kind of hard food.",
      "rating": 5.0,
      "verified": true,
      "author": "she_she_kay",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "My Chi’s love this!",
      "text": "I’ve used this food for years for my chihuahua and now I’m using it again. Lots of variety and it doesn’t upset their stomachs. Will continue to buy this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Williams",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Five Stars",
      "text": "My little dogs love Incredibites! Perfect size pieces, and they enjoy both flavors.",
      "rating": 5.0,
      "verified": true,
      "author": "PrincessDhy",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Incredible Incredibites!",
      "text": "This dog food gives my dogs shiny coats, energy and the all-important healthy bowel movements. In addition, they love the taste. The Incredibites small size kibble is perfect for our little dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Matu Mom",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Great Deal",
      "text": "My doggies just love this and its so nice to get it delivered right to my door. I will buy again. Food was fresh just as if I bought it from the store and it was even less expensive!",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Great!",
      "text": "I use this for my small dog. He loves it. Best of all.... it's delivered to my front doir. I don't have to lug it out of the grocery store!",
      "rating": 5.0,
      "verified": true,
      "author": "Florida",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "GOOD STUFF",
      "text": "DOG LIKES THIS MIXED WITH SOME MOIST OR WET FOOD... HE LIKES GRAVY.... PRICE IS LESS THAN EVEN AT WALMART....",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Pups gobble like treats! Way to go, Beneful !",
      "text": "I don't actually love it, but my dogs do. They will turn their noses up at other brands of dry food, but gobble this like treats! Way to go, Beneful.",
      "rating": 5.0,
      "verified": true,
      "author": "S Hall",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "My little dachsund loves it!",
      "text": "My little guy eats his food better, now. This is the only food I have found that does not upset his tummy. I love that. I will purchase more for him in the coming month, and always. Thank you for the great delivery efficiency, as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Pedigo",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "My dogs love it, except for the carrot bits",
      "text": "My dogs (Chihuahuas) both seem to like this food more than any other kibble I've given them. One issue though is that they don't seem to like the carrot flavored bits. As a result, my floor is littered with these unwanted pieces until the dogs get hungry enough (by me not feeding them again) to go around and eat the discards.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian Pitts",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Yummie",
      "text": "My dog loves this food. She is not food oriented, but will actually finish a bowl twice a day. She especially likes the red and green balls...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "excellent buy",
      "text": "My puppy(10 yrs old) loves this food, plus the wonderful heavy duty bag with zipper closure is great This is my 3rd bag and I am sad to say the food is rancid and not safe for my puppy",
      "rating": 3.0,
      "verified": true,
      "author": "Runesong",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "the price got even better than what I paid for it at my store",
      "text": "I have a toy fox terrier and we started her out on Fromm. It started to get pricey and I literally ran into this dog food on sale at my grocery store. My dog loves this and had no problem switching over. Once I found out I could buy it on Amazon, the price got even better than what I paid for it at my store.",
      "rating": 5.0,
      "verified": true,
      "author": "woodtickgirl",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Satisfied with my purchase",
      "text": "I like this dog food because it's price is comparable to grocery store brands and sizes. It's small kibble that my poodles like. Why not let the mail carrier bring my dog food... Sounds like a win win to me 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi Grayson",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "The dogs like the smaller pieces better",
      "text": "Incredibites is hard to find in grocery stores. They usually carry the regular Beneful. The dogs like the smaller pieces better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Our Dogs really love the food",
      "text": "Our Dogs really love the food, Hubby loves that he doesn't have to put the lg. bags into a cart tem lug them in. LOL",
      "rating": 5.0,
      "verified": true,
      "author": "Annamomof7",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Dogs love this food",
      "text": "We switched to this food for all 7 of our dogs. They love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr & Mrs Kayser",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "size",
      "text": "my are dogs are up there on age and this food is perfect for them to chew and swallow",
      "rating": 5.0,
      "verified": true,
      "author": "juice30",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "My dogs love it",
      "text": "My 4 dogs love this stuff. I'm buying it here because the W M store doesn't always have it in stock. I had a 135 lb Yellow Lab that always ate Beniful live to 13 years. Exceptional for a dog that size.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry L. White",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Great price, good value",
      "text": "I bought this in an emergency because the price was right and my pit bull loves the tiny bites and the taste. The pieces are a fraction of the size of most small bite dog food. Would be great for a tiny dog",
      "rating": 5.0,
      "verified": true,
      "author": "Kaye T.",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "... bags at our supermarket - this is a much better deal plus it's delivered",
      "text": "The only dry food my dog will actually eat - can only get the small bags at our supermarket - this is a much better deal plus it's delivered!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Great dogfood",
      "text": "This dog food has great benefits for my pet and he loves it. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Ewart",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Five Stars",
      "text": "Our dog has been given this food since we adopted her from the humane society. She loves this food.",
      "rating": 5.0,
      "verified": true,
      "author": "Rottsr4u2",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "my dogs love this food they have been eating it for years",
      "text": "my dogs love this food they have been eating it for years! They are small dogs approx 25lb and the size of the pieces are just right for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Gale Lewandowski",
      "helpful_votes": 2,
      "publication_date": 20170411
    },
    {
      "title": "Dog food",
      "text": "My 3dogs love this' will be buying more from you'",
      "rating": 5.0,
      "verified": true,
      "author": "robin hull",
      "helpful_votes": 3,
      "publication_date": 20170326
    },
    {
      "title": "My dogs eat this with no tummy problems",
      "text": "I have a weenie dog & a French bulldog and they eat this food but can't eat the other cheaper dog food. This is our 4th bag ordered, it usually lasts us two months.",
      "rating": 5.0,
      "verified": true,
      "author": "Catie Houston",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "really nice to have an easy seal zipper at the top ...",
      "text": "dog loves this food, really nice to have an easy seal zipper at the top for easy storage",
      "rating": 5.0,
      "verified": true,
      "author": "sportychick989",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "This dog food is a great meal for 3 year old lab!  Approved by my vet!",
      "text": "My orders always come quickly, which my hungry lab loves!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia A. Gort",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Yum? I guess?",
      "text": "My dog loves this stuff, but she's a dog, so ... I can't really account for her taste. Seriously, though, I love that this big bag can get delivered to my house instead of me lugging it from the grocery store.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna C.",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Happy Family Dog!",
      "text": "This is the only dry dog food our little dog, Oz, will eat. Any other brand and he goes on a 'snobbish' hunger strike. If he were a human (as we're sure he was in a former life), he'd be wearing an ascot and smoking a pipe. :)",
      "rating": 5.0,
      "verified": true,
      "author": "EdieBlount",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "Five Stars",
      "text": "m y two dogs seem to like the product .. They seem to look forward to their meal.",
      "rating": 5.0,
      "verified": true,
      "author": "robert w quaranta jr",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "My dog doesn't like it it makes him sick",
      "text": "For some reason my dog gets sick every time I feed him this. Guess it just doesn't sit well with him",
      "rating": 1.0,
      "verified": true,
      "author": "Ann Love",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Great Convenience.",
      "text": "It's great having a heavy bag such as this, delivered to my door!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Fresh and fairly priced",
      "text": "Product was fresh and my dogs really like this brand, I know it’s not the most expensive brand but also not the cheapest... it’s a good mid point and my dogs keep eating it...",
      "rating": 5.0,
      "verified": true,
      "author": "alfredo negrete",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "My dog is a small breed chihuahua and Pomeranian mix ...",
      "text": "My dog is a small breed chihuahua and Pomeranian mix, tried more expensive brands but toward the end of those dog food he hates it, but with Purina he loves it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick SJC",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great for my small Pomeranians!",
      "text": "This is my three pomeranians favorite flavor of Beneful! They are small little girls and need the tiny bites in this food. All the regular Beneful is too hard for them to chew because of it's size.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Williams",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Perfect for my Babies",
      "text": "I have 2 small dogs and 1 medium sized dog and all 3 love this food. 2 of my dogs have reactions to red food dye in other foods, but not this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris4956",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "Cheap",
      "text": "We love the small bites and the dogs seem to like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mtchcnnr",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "It’s what the dogs want",
      "text": "My dogs love this food. The morsels are just the right size for my 5 lb and 9 lb dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Awesome price",
      "text": "The dogs like this variety of food and for under $15 bucks for about 15lbs of dog food is a steal. Will continue purchasing as it's the cheapest I've found in store and online.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Five Stars",
      "text": "My bichon loves this food and it is great on her sensitive digestive track!",
      "rating": 5.0,
      "verified": true,
      "author": "V Allen",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Fuzzy monster chow",
      "text": "Basic doggo food. What more do you want? My weenie dog loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mister C.",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Not the healthiest but my dog loves it!",
      "text": "My dog loves it, but it does have A LOT of fillers... This will be the last bag I give my dog....",
      "rating": 2.0,
      "verified": true,
      "author": "V. Harr",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Nice",
      "text": "My small dog loves this food. Its a big bag",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 2,
      "publication_date": 20171026
    },
    {
      "title": "(6) 3.5 lb. Bags Six (6) 3.5 Lb. Bags -",
      "text": "It said : (6) 3.5 lb. Bags Six (6) 3.5 Lb. Bags - Purina Beneful Incredibites With Real Beef Adult Dry Dog Food .that's what I ordered. But only give us 1 bag of 3.5lb dog food. I want my 5 bags refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Lily ",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Good but......",
      "text": "Zipper feature fell off the bag first day. Had to cut open and now I'm afraid the freshness will be lost. 2nd time ordering (I hit the but it again button). Well, at least it arrived on time!",
      "rating": 3.0,
      "verified": true,
      "author": "Karma",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Negative",
      "text": "Never record my item twice. A bit disappointed that they first lost my package then the second so happen to be damaged.",
      "rating": 1.0,
      "verified": true,
      "author": "Hazel's Splurging moments ",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Perfect way to get your dog food!",
      "text": "I absolutely love getting my dog food through the mail instead of heading out to get it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Repeat customer for sure",
      "text": "I used this to transition my pup from Purina Puppy Chow to adult food. She absolutely loves this! Nice small bites and great crunch. Great deal on amazon, too!",
      "rating": 5.0,
      "verified": true,
      "author": "mayil",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Great food!",
      "text": "My go to brand for my dogs, I love that its more natural for them and they love the beef or chicken flavors.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Wild",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Food for my fur babies",
      "text": "I used to buy my dog food at the grocery store, now I have it delivered to my house and it's cheaper. My dogs are very picky they only eat this food.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Steven",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Good buy",
      "text": "I could not find this formula at 4 stores. I thought I would check Amazon and found it at a competitve price, free delivery and arrived quickly. This was is where I will buy the next bag as well. They dropped it right at my front door.",
      "rating": 5.0,
      "verified": true,
      "author": "globug",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "I had since put him back on his previous food and he is fine now.",
      "text": "After a week of this food my dog started vomiting. I had since put him back on his previous food and he is fine now.",
      "rating": 1.0,
      "verified": true,
      "author": "Sherry",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "My doggy loves it!",
      "text": "My Cavalier King Charles Spaniel eats this as if it were a treat and not dinner. Go figure. It's balanced nutrition and she loves it - I'm a happy camper.",
      "rating": 5.0,
      "verified": true,
      "author": "Xwickslady",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "She likes it, she really likes it.",
      "text": "My papillon, fussy papillon. Really likes this and will eat it without me adding enticements, like a bit of cheese etc...",
      "rating": 5.0,
      "verified": true,
      "author": "flc",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "My pit loves it",
      "text": "My pit bull loves the small bite food - these are especially tiny compared to other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaye T.",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Well balanced dog food",
      "text": "I feed this brand to all my dogs. The small kibble makes it easier for my two older dogs and it’s just right for my little ones",
      "rating": 4.0,
      "verified": true,
      "author": "grammadee",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Cheap and convenient",
      "text": "I always buy incredibites for my two chihuahuas. The 15lb back in the store is 14.99. This is a steal and i dont have to carry it to my car.",
      "rating": 5.0,
      "verified": true,
      "author": "L.Hend",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "No beef flavored bits init.",
      "text": "Dogs eat it without problems, but not their favorite. But it's hard to find food without beef flavored bits in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Clarence",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great Stuff",
      "text": "Well it was cheaper than at the store this time and my dog loves it so all is well.",
      "rating": 5.0,
      "verified": true,
      "author": "AMK",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "Three Stars",
      "text": "Have to entice them with dried liver, . . . they are not real fans of dry food",
      "rating": 3.0,
      "verified": true,
      "author": "Susan Alicea",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "It's dog food",
      "text": "Well its dogfood. The dog seems to like it, then again, she'll eat almost anything. Seriously, it is well received by the girly dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert OReilly",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "When pets are happy, Owners are Happy",
      "text": "I've been buying this brand for many years and I have no problem knowing which brand to order, my two Chi's always let me know what they want ?",
      "rating": 5.0,
      "verified": true,
      "author": "gejome",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Also same great as in big chain grocery stores",
      "text": "My dogs loves the small pieces it come in. Their sizes are just right for my dogs tiny mouths. With other brands, they have to open their mouth very wide and hence they don’t eat as much. Also same great as in big chain grocery stores. But without going to the grocery store!",
      "rating": 5.0,
      "verified": true,
      "author": "Coke",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Good quality food for dogs",
      "text": "Great food for my fur-baby, he loves the flavor and eats it well.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20180818
    }
  ],
  "product_meta": {
    "title": "Purina Beneful Incredibites with Real Chicken Adult Dry Dog Food",
    "description": "Flavor Name:Beef| Size:15.5 lb. BagGive your small dog big flavor in every bite with Purina Beneful IncrediBites With Real Beef adult dry dog food, formulated specifically for small dogs. With real farm-raised beef as the #1 ingredient, this nutrient-rich blend helps support your small dog's higher metabolism. The easy-to-chew mini bite kibble is also created with your small dog in mind to cater to his tiny mouth and teeth. Accents of real carrots and peas add to the deliciousness of this tasty kibble for a flavor your dog loves. With 27 grams of protein in each cup, this premium dry dog food helps to maintain strong muscles. Feel good about filling his bowl, knowing that the 23 essential vitamins and minerals found in each serving aid in supporting his overall health. With savory flavor and high-quality ingredients, Purina Beneful IncrediBites dry dog food gives your little dog 100% complete and balanced nutrition. For a tasty experience your canine companion craves, order Purina Beneful dry dog food from Amazon. \n\nIngredients:\nBeef, Whole Grain Corn, Barley, Chicken By-Product Meal, Corn Gluten Meal, Whole Grain Wheat, Rice, Beef Fat Preserved With Mixed-Tocopherols, Soybean Meal, Poultry By-Product Meal, Glycerin, Egg And Chicken Flavor, Oat Meal, Poultry And Pork Digest, Calcium Carbonate, Salt, Mono And Dicalcium Phosphate, Potassium Chloride, Dried Carrots, Dried Peas, Iron Oxide (Color), Vitamins [Vitamin E Supplement, Niacin, Vitamin A Supplement, Calcium Pantothenate, Pyridoxine Hydrochloride (Vitamin B-6), Vitamin B-12 Supplement, Thiamine Mononitrate (Vitamin B-1), Vitamin D-3 Supplement, Riboflavin Supplement (Vitamin B-2), Menadione Sodium Bisulfite (Vitamin K), Folic Acid, Biotin], Minerals [Zinc Sulfate, Ferrous Sulfate, Manganese Sulfate, Copper Sulfate, Calcium Iodate, Sodium Selenite], Choline Chloride, L-Lysine Monohydrochloride. H-4085. \n\nFeeding Instructions:\nFeeding Adult Dogs: Most adult dogs can be fed once daily. However, when high activity or other factors create a higher feed intake, twice-a-day feeding is recommended. Dogs should be maintained in ideal body condition and not be allowed to become overweight. The food intake required to maintain ideal body condition will vary, depending on age, activity and environment. Consequently, the amount of food required for each dog will vary and should be adjusted accordingly. The daily feeding amount can be divided into 2-3 smaller servings throughout the day. Feeding Tip: When switching your dog to Beneful IncrediBites dog food, please allow 7-10 days for the transition. Gradually add more Beneful IncrediBites and less of the previous food to your dog's dish each day until the changeover is complete. This gradual transition will help avoid dietary upsets. For your pet's health, see your veterinarian regularly. Provide adequate fresh water in a clean container daily. \n\nGuaranteed Analysis:\nCrude Protein (Min)...27.0%, Crude Fat (Min)...13.5%, Crude Fiber (Max)...4.0%, Moisture (Max)...14.0%, Calcium (Ca) (Min)...1.1%, Selenium (Se) (Min)...0.35mg/kg, Vitamin A (Min)...12,500 IU/kg, Vitamin E (Min)...150 IU/kg.",
    "rating": 4.5,
    "feature_bullets": [
      "Real Farm-Raised Beef Is The #1 Ingredient",
      "Accents Of Real Carrots And Peas Add Variety To His Diet",
      "Nutrient-Rich Recipe Helps Support Your Small Dog'S Higher Metabolism",
      "Easy-To-Chew Mini Bites For Small Dogs",
      "15.5 Lb. Bag - Purina Beneful Incredibites With Real Beef Adult Dry Dog Food"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.5 x 16 x 23.5 inches; 15.5 Pounds",
      "Item model number": "17800136396",
      "Date First Available": "August 31, 2010",
      "Manufacturer": "Purina Beneful",
      "ASIN": "B004VLNOOI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Dry",
      "Pet Supplies",
      "Food"
    ],
    "price": ""
  }
}