{
  "website_summaries": [
    {
      "verdict": "A extremely sturdy plastic storage box that is sized right for small to medium decks and yards.",
      "pros": [
        "Strong, durable, and easy to assemble",
        "Practical size makes the box easy to handle"
      ],
      "cons": [
        "Utilitarian appearance adds nothing to your yard's decor, but if you are looking for practicality, this is one to consider"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The top of the container has peeled back.. ...",
      "text": "The top of the container has peeled back...I thought this was a quality product...How do I get a hold of the company?",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Gruff",
      "helpful_votes": 201,
      "publication_date": 20170609
    },
    {
      "title": "Best Poolbox on the Planet",
      "text": "I absolutely LOVE this storage box. Its my second one, the fist one we had for almost 10 years and it STILL looks new. We use the old one to store pool salt bags in and the new one is for patio pillows and pool towels, etc. This thing is a tank and! you can sit on it too. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Janis LaRochelle",
      "helpful_votes": 9,
      "publication_date": 20190821
    },
    {
      "title": "Warped",
      "text": "Warped in the sun after 1 month. Do not recommend if you live in Florida.",
      "rating": 1.0,
      "verified": true,
      "author": "Rachel Chambers",
      "helpful_votes": 24,
      "publication_date": 20170609
    },
    {
      "title": "It was completely messed up it prep for assembly.",
      "text": "I am a carpenter and handyman. I have worked with tools all of my life. I remodel homes. Assembly on this was a nightmare! We got half way through and boxed it back up and returned it. Some of the hardware did not match what was shown on the instructions and did not fit where it belonged. Some holes were not predrilled and could not be drilled correctly because of the seams and location on the box. The difficulties never stopped.",
      "rating": 1.0,
      "verified": true,
      "author": "BonJoV",
      "helpful_votes": 7,
      "publication_date": 20190701
    },
    {
      "title": "Not recommended",
      "text": "The screws that came with it did it work (too small for the holes). We tried to use our own screws (and had to drill the correct sized holes too). I am hoping we were able to find a work-around, but it is definitely NOT water tight. I would return if I could, but do it feel like disassembly, finding a box to ship it in, and take it to a UPS store. Not recommended. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Monica Lawrence",
      "helpful_votes": 13,
      "publication_date": 20180114
    },
    {
      "title": "Assembly difficulties makes this not worth buying",
      "text": "The box is nice. However, the assembly was a nightmare as things were misaligned requiring a lot of extra work, Plus, some items (hinge) had to be held in place by home made brackets. See pictures. I would not ever buy anything again from this manufacturer. If returning it would not have been so difficult (repacking and lugging it to UPS), we would have returned it ASAP. Not worth your time no matter how good you are at assembling things.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon fan",
      "helpful_votes": 5,
      "publication_date": 20190729
    },
    {
      "title": "Sturdy box",
      "text": "Okay, this product is going to take you a while to put together. Especially if you are doing it on your own, like I did. But it is very sturdy. I was worried that someone would be able to pull open the top lid even with a lock on and just kind of stick their hand down into it. That is not going to happen. There is a really nice iron bar that runs across the bottom of the lid that stops anything like that. It's really pretty spacious, and I'm very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ally Warner",
      "helpful_votes": 13,
      "publication_date": 20160621
    },
    {
      "title": "Not Recommended",
      "text": "The quality of this product has decreased immensely since I bought one several years ago. Factory drilled holes were off so that there is no room to put nuts on bolts unless you dig away part of the plastic. Other holes for the lid were off so that the lid brace is not flush to where it should be. I’m really disappointed in the quality now. The box I bought in 2016 went together perfectly. I won’t recommend this unless you’re a do it yourselfer with tools and ability to correct this yourself.",
      "rating": 1.0,
      "verified": true,
      "author": "VH",
      "helpful_votes": 6,
      "publication_date": 20181102
    },
    {
      "title": "Nice size",
      "text": "We already had two, large capacity. We wish the place to put a snap through was made on the vertical so a snapcan beter secure the lid shut. If you use a snap that is large it will allow the wind to lift the lid somewhat.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom B",
      "helpful_votes": 4,
      "publication_date": 20190714
    },
    {
      "title": "One of the tightest boxes I have ever seen!",
      "text": "This unit is awesome! Bought 2 a year ago and got one more for extra storage. Same quality from over a year ago. Assembly easy... Just carefully follow the instructions. I caulked all the inside seams with about 1 1/2 tubes of caulk and it really did well for over a year outside in GA weather. No dampness/ no bugs. If you assemble properly and always close the lid completely, this box is one of thw most wat we resistant boxes I have ever seen/ used. Very very 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Looks good, needs some better instructions on hardware & tools needed.",
      "text": "This storage box looks very nice when finished. The sides and top fit VERY easily together! The only problem with it is that the screws and other bolts do not fit very well when putting the top on, and it was very tough to get them into the holes and tightened. The screws were not marked very well, and we had to guess at what went where. One set of screws and bolts just barely held it tight, and we're going to have to go to a hardware store to get some that will hold it. Otherwise, it looks good and seems very sturdy for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Wonder Woman",
      "helpful_votes": 8,
      "publication_date": 20160904
    },
    {
      "title": "Wonderful product, Bad Amazon experience again!",
      "text": "Great product! Very heavy duty, and made to withstand the elements of the weather. Large storage capacity for all of our pool items. The only problem: It was missing several important pieces of hardware, that are required for basic operation of the lid, and I am still unable to use the box. I have had horrible experiences with several amazon orders lately, so decided to call the manufacturer directly for replacement parts. Lifetime has shipped the missing parts, free of charge, but there’s a few week delay because of COVID. Great customer service for Lifetime, another bad experience with Amazon.",
      "rating": 4.0,
      "verified": true,
      "author": "FirefighterCin",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "I was really happy with the 1 st one",
      "text": "This is my 2nd box. I was really happy with the 1 st one, but the 2nd one... the side panel was made with thin plastic that the handle part just bends and does not allow you to lift / move the box. I will try to get a replacement part (side panel). but Will see if I get one. Otherwise it is a hard return due to its large size.",
      "rating": 1.0,
      "verified": true,
      "author": "Sebastian",
      "helpful_votes": 8,
      "publication_date": 20180308
    },
    {
      "title": "Great Outdoor  Storage solution",
      "text": "This LIFETIME brand storage box is an excellent choice for outside storage. I is delivered unassembled in a relatively flat box. Assembly is straight forward and took about 35 minutes. The storage capacity is awesome. It easily holds multiple chaise cushions, pillows, throw rugs and even the two fans I keep on the patio for air circulation on hot days. So far, it has proved to be 100% water resistant in even heavy downpours and high winds. Meaning- that although it is not 'water-sealed', the built in lip of top all 4 sides where the top cover meets the box DOES provide a total block to rainwater and wind.",
      "rating": 5.0,
      "verified": true,
      "author": "lrkap",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Assembly is not for the faint-of-heart",
      "text": "I've only had the container in service for one day, so I cannot comment on its durability. Overall, its appearance is good, as is its size (it's big). However, assembling this box was frustrating, and I have a full shop of tools. Instructions are clear enough (though with room for improvement) but the engineering and choice of various fasteners seemed random and not well-considered. Driving a heavy-duty single-slot screw with no pilot hole? You're going to find that as frustrating as I did. Just a little better engineering would make a huge difference. It shouldn't be this tough for the purchaser...",
      "rating": 3.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Nice size, but I think they could have done better",
      "text": "The sides design have changed. I had the older design and the sides held up better. The lid latch on one was totally a different design. It makes this one need a very long lock or clip to keep it closed (during heavy winds the lid will open if you don't lock or clip the latch tight)I thought I put it on wrong and took it apart and then realized it was manufactured differently (I bought two this time). None of them close perfectly. The size is nice as it can hold a lot of things. Haven't had water leak into it even though the lid is not perfectly tight.",
      "rating": 3.0,
      "verified": true,
      "author": "W. LEE",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Buyer Beware.",
      "text": "Positives- Box looks nice on the patio. It has a lot of storage space. Negatives- The cover doesn't line up right/came warped. By the time we took the time to put it together it was too late to return. So, it gets water into it and doesn't shut all the way. It has become an overflow bench in our backyard when there are too many people for our patio chairs. I gave it 3 stars because the material feels sturdy and it does look nice, if we had taken the trouble to go through customer service maybe we'd have a nice working patio box. If you don't want to buy a product that could come with defects, beware though",
      "rating": 3.0,
      "verified": true,
      "author": "J. Khan",
      "helpful_votes": 7,
      "publication_date": 20160112
    },
    {
      "title": "Was concerned that this would be difficult to put together ...",
      "text": "Was concerned that this would be difficult to put together based on previous reviews- but it wasn't. Took 2 people and went together fairly quickly. Use a rubber mallet for any \"hammering\" that needs to be done. It hasn't rained since we put it together, so we aren't quite sure how it will do with summer storms and winter snows in Maryland. Has a tremendous amount of storage! Using it to store Smoker Pellets, gardening supplies, pots and special plant potting soil with room to spare. Covered it with fabric and pillows for additional seating when having a party.",
      "rating": 5.0,
      "verified": true,
      "author": "ams",
      "helpful_votes": 2,
      "publication_date": 20180617
    },
    {
      "title": "Much better than Keter, and better customer service too!",
      "text": "Updating my rating since Amazon and manufacturer came through and sent a replacement for the part that was missing. Compared to my Keter the quality is much much better. One thing to note - some reviews talked about Lifetime products being made in the USA but this one is definitely made in china (as described on the box). Doesn’t mean it’s not good quality - we definitely like how sturdy and well made it is. Just wanted to share in case it matters to someone. Docking a star for the part missing which meant waiting for getting a replacement.",
      "rating": 4.0,
      "verified": true,
      "author": "Madame Scuderi",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Beautiful sturdy box",
      "text": "This box took me a couple hours to assemble, but I wasn’t in a hurry. The instructions were nicely done, but the instruction booklet was a little intimidating until I realized that it was done in three languages. All the tools you need were pictured, but in reality, more tools than that were needed. I had to use the rubber mallet several times to line things up, and a C-clamp to help with screwing the reinforcing bar to the front of the lid. There was barely enough room to install most of the screws, but, somehow, it all worked out. The finished product is a very attractive, functional storage container that looks good on our patio.",
      "rating": 5.0,
      "verified": true,
      "author": "Fdavet",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Difficult to assemble & price differences",
      "text": "I bought a 130 gallon storage box, Model number 60012 online through Amazon at $ 149 plus tax. Today, the same storage box sells for $ 129 on Amazon and only $ 99 at Costco. The screws that came in the box were bigger in diameter for the predrilled holes. I had to buy different size screws to assemble. It took more than 3 hours for 2 of us to assemble the box. It does feel sturdy but the real test will be how it fares outside in FL weather. One thing which I did not do was I could have seen assembly on \"YouTube\".",
      "rating": 2.0,
      "verified": true,
      "author": "YAGNESH  RAVAL",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Horrendous Assembly",
      "text": "I don’t think I have ever purchased anything that is so hard to put together. I had to purchase a socket set and I am hoping that will help. So far, I have been unable to get the screws in on the hinges. Some of this should’ve been assembled before shipping. Even though I think it will be a nice box when assembled, I would not purchase again. Beware of assembly!",
      "rating": 2.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Deck box that appears weatherproof!",
      "text": "This deck box holds all my outdoor items safely and securely. I love the fact that is has a place to lock the lid. I have checked it after heavy rains and all the items stay dry inside. I would recommend this product. It wasn't hard to install, either and took my father and I about 20 minutes. We used youtube to insure we were doing it right since the directions were a little confusing. Overall, a nice solid box that should last several seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Prime Member",
      "helpful_votes": 4,
      "publication_date": 20170923
    },
    {
      "title": "Missing Hardware Otherwise Excellent",
      "text": "The construction is very sturdy and it looks smart. I like the spring hinge on the lid to prevent it from slamming shut. Best of all it is Made in the USA. Unfortunately, I have not been able to put it to use as it is missing one of the BET for a spring cylinder. An email was sent on September 12, 2020, requesting a replacement; however, I've not had so much as a \"we'll respond shortly.\" One star reduction for the overall review due to the lack of response to the missing hardware.",
      "rating": 4.0,
      "verified": true,
      "author": "BeenThere",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Nice box",
      "text": "\"read\" the assembly instructions carefully. Read in quotes, because there aren't many words. I ran into a little issue attaching the hinges until I looked carefully at the picture and realized the bolts go from the outside in. If I'd looked more carefully then assembly would have been a breeze; it was once I turned things around the right way. Box is spacious and was dry after a tremendous downpour just after I put it in place. Review is based on opinion after having it a week - I'll try to edit it if my opinion changes - but I'm pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt Schurenberg",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Assembly was easier than i thought it would be",
      "text": "Assembly was a breeze. The hardest part was getting bolts though the plastic that wasn't quite cleaned out of the holes. Quick fix with a utility knife and screwdriver. This thing is big and the lid makes it need a little more space than I thought but we are talking about an inch. I wanted something I could store the pool filter and pump in along with all the floats, noodles, goggles, and pool toys. This is as big enough to squeeze our solar cover into it on top of all the items list above. Worth the price to clear out the shed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Meh",
      "text": "It's okay. It's a big outdoor storage box, but mine got warped in the hot sun. Mine is no longer waterproof because of that. That's the problem with online shopping. You can't see, feel, or test products before you purchase them. I wouldn't recommend this product, but I'm stuck with it now. Because of how warped it got, spiders got into it and made their homes in it. The only reason I don't give it one star is because it's still better than leaving your furniture cushions outside to be destroyed by the sun and rain.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "Outstanding deck/dock boxes",
      "text": "I have bought 3 of these now. The original one I purchased over 5 years ago. They truly are outstanding. Very durable. Completely waterproof. The one on our deck is housing all my hubby's grilling & meat smoking accessories, including charcoal. We put 2 of these boxes on our dock to hold life jackets, floats, cushions, etc. All three boxes sit in uncovered areas and are exposed to the elements. No leakage what so ever. The only maintenance we've had to do to them is to spray them down with a pressure washer each spring. Great boxes! Excellent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "dholc",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Some assembly required",
      "text": "This thing comes flat in a box and takes about an hour or so to assemble The Instructions are fabulous. DON'T over tighten the hardware...it's plastic, dude. The perfect fit for a small balcony. I fit my tabletop grill, and all the other clutter on my deck into this box",
      "rating": 5.0,
      "verified": true,
      "author": "F. Turner",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "GREAT DECK BOX BUT THE RECOMMENDED ASSEMBLY  DID NOT WORK",
      "text": "The deck box works great for us but assembling it was a challenge. Most of the pre-drilled holes did not line up and the telescoping rods for the top did not work. After these rods were installed per the assembly instructions, the top would not close. We threw the rods out with the trash. The top works better without them. We had to make changes to get everything to work. The deck box works fine now and we are happy with it. You might want to consider a different manufacturer or assembling it before breaking it down for shipment.",
      "rating": 4.0,
      "verified": true,
      "author": "AustinNW",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Quick, post assembly review",
      "text": "I'll add to this review if the deck box fails in some way but I'd like to comment after assembling it. Assembly is NOT difficult if you take your time and pay attention to ALL the directions. I know to some that is difficult but it's important. I don't like reading directions either and probably could've slapped it together in half the time (and probably would have had to take part of it apart again to re-assemble it the correct way) so it's wise to pay attention. Took me about an hour by myself to assemble the product and it works as intended.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Milani",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Stays Dry",
      "text": "Large storage capacity deck box that was easily assembled. Stays outside on pool deck and is bone dry even after torrential downpours and blowing winds. Easily accommodates many cushions, pool equipment, and accessories while keeping everything dry, organized, and easily accessible. Update: Had a torrential rainstorm last night. Put 2 1/2 inches in my pool in less than 3 hours. Storage box was bone dry. Take the time to assemble it properly and it will serve you well.",
      "rating": 5.0,
      "verified": true,
      "author": "N8860",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "LARGE SOLID EASY TO ASSEMBLE NICE LID OPENING AND CLOSING MECHANISM.",
      "text": "I USE THIS TO KEEP PATIO COVERS, CUSHIONS, BATTERY BLOWER, AND MISC SMALL ITEMS WHEN NOT IN USE. IF YOU FOLLOW THE INSTRUCTIONS THE SET-UP IS 15 MINUTES EASY TO DO WITH 2 PEOPLE ALTHOUGH I DID IT MYSELF. VERY HEAVY GUAGE PLASTIC ITS LARGE AND HOLDS A LOT I RECOMMEND THIS PRODUCT.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike's Review",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "seems like a good buy",
      "text": "I have yet to test this storage container bu so far seems pretty good. Assembly is more difficult than it needs to be and I am extremely handy with tools and mechanical things. This company needs to review how they organize the unit to make it simpler to put together. They could probably put some of the pieces together themselves before delivery. It is lightweight enough for one person to handle and put together. We will use it for emergency supplies like water bottles etc.",
      "rating": 4.0,
      "verified": true,
      "author": "chic80",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great storage option",
      "text": "It took me about 1 hour to put this together by myself. I am a 56 year old woman. It was simple and all peices fit together easily. It holds so much! I have my electric blower, power washer, weed killer mix and sprayer in it along with a bag of tools, shears, gloves, etc. And I still have room! It does not hold moisture or condensate. Mine sits on my covered deck so I can't rate sun exposure. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Nurse Donna",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "The instructions were fine but somehow 1 of the 4 holes provided was ...",
      "text": "Beware--when constructed, this is a decent storage box, but as with all things Made In China, it seems, it was hard to assemble. The instructions were fine but somehow 1 of the 4 holes provided was missing. I had to do no end of adjusting and drilling to get this together. If you're able to waste two hours, fine. Assuming that the defects you get aren't worse than those I had. I really do wish it were possible to start making things like this in the USA, with quality control. I'd pay double just to have something that works out of the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Peg",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "This has solved my messy deck problem",
      "text": "I it is very nice looking and easy to use. I am a gardener and have a large deck attached to my home. I keep everything I need from bagged soil to hoses to garden tools in this Deck Box. They are nicely protected from elements. Now I know where they always are now and I feel so organized Utah girl",
      "rating": 5.0,
      "verified": true,
      "author": "carcar",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Missing part",
      "text": "The storage box was missing the stiffer bar which makes the unit unlockable. The missing part was ordered by a Lifetime rep over a month ago and I still do not have the part. Attempts to reach Lifetime is met with a phone response stating they can not take any call's due to high volume. Their is not web service link to reach Lifetime. The storage box is manufactured in China. I would not purchase anything from Lifetime, they do not have adequate customer service representation. Update, I did finally reach a customer representative after a month only to find out that the part is back ordered from their Chinese facility.",
      "rating": 2.0,
      "verified": true,
      "author": "James W. Milligan",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Easy enough, big enough, nough said.",
      "text": "Instructions recommend two people to assemble, and I agree, but one person can do it (I did). Nice and big, should work great. Liked that the lid has a metal bar to reinforce it, and the color/design looks good. Definitely recommend caulking the seams, after a week outside before I got around to silicone caulking the seams one already had dust inside even though they were kept closed. In Arizona it would take a hermetic seal to keep dust out, so I don't take an overall star off the rating. Hopefully they last, things don't survive outside long in Arizona. Will try to remember to update if they impress me for good or ill.",
      "rating": 5.0,
      "verified": true,
      "author": "Jones",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "One month old, but easy to put together and so far, so good.",
      "text": "It's easier to put together with a screw gun & nut drivers. Don't expect that keeping this storage unit in a high crime area will protect your outdoor valuables... it's a simple plastic based locking mechanism. It's a great bin to store grass seed, fertilizer, pool equipment & lawn furniture/pillows... perhaps even a mother-in-law. I assembled it by myself with a beer in hand and cigar in mouth. Follow the available company provided assembly video on your smart phone and you'll be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "New York Area Amazon Prime Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Will need proper tools to assemble",
      "text": "I'm giving this five stars because it seems to be a good, sturdy product. BUT, you will need the proper tools to assemble. These include socket wrenches, box wrenches, rubber mallet, philips screw driver and possibly a drill plus bits. But it's pretty simple until you get to the lid hinges. Just pay attention to what the instructions say and show. You will be able to put this together in about an hour.",
      "rating": 5.0,
      "verified": true,
      "author": "Rufus",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Not waterproof.",
      "text": "I purchased this five years ago. It's always sat on my deck throughout all the elements. IT IS NOT WATERPROOF. I don't know how the water gets in but EVERY spring we pull out the patio cushions, umbrella, etc., and find a huge colony of ants and everything moldy and wet. We tried caulking, cedar planking the bottom and still the water, and the ants.It still looks great. I'm considering moving it into the garage now, which defeats the purpose of \"deck\" storage. Great looks, storage but NOT waterproof.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "challenging assembly",
      "text": "We consider ourselves are quite experienced furniture assemblers until we got this box. There are quite a lot mismatched holes, or the size of the holes don't fit. We had to stop at step 2.3. We also decided on giving up returning the box since it is too much hassle (the packing box was already ripped up in recycle bin)...kind of disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "ubee",
      "helpful_votes": 2,
      "publication_date": 20180930
    },
    {
      "title": "Difficult assembly",
      "text": "Product is sturdy and big enough for what we wanted, but holes that were supposed to be \"pre drilled\" for the lid brace were not. I had to do them. Also, lid bracket bolts were too large to be able to tighten so had to go to the hardware store and get smaller ones, plus drill out the holes for them. All in all, disappointed with the assembly part for being \"made in the USA\".",
      "rating": 3.0,
      "verified": true,
      "author": "G. Carnicelli",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Pay attention to the instruction and look at the online videos",
      "text": "This is s great looking deck box at a great price. Have sockets and open face wrenches of the same size available, since the nuts and bolts used to attach the lid require each. Consider using a awl (pointy tool) to start screws. I was skeptical about how water proof the box would be, but in South Florida the box has not leaked. Take your time putting the unit together. I put it together by myself, but having a partner would require less contortion. The capacity is huge. I am very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Alfonso",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Heavy Duty plastic storage box",
      "text": "This box is AMAZING. VERY sturdy. LOVE it. My brother in law came over to put it together for me - it arrives in a flat shaped box - so it has to be completely constructed. Took him about 1 hour. It's beautiful and very sturdy. Weighs around 50lbs. I am looking forward to having this box for a long time - but I never hesitate to update my reviews should new info seem useful.",
      "rating": 5.0,
      "verified": true,
      "author": "ForeverYOUNGTop Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Very Hard to Assemble, Brilliant when assembled",
      "text": "The headline says it all. We're experience at assembling items for our home and found this one really difficult. The flipside is that when assembled it's a very high quality, capacious, robust, & good-looking storage unit. Can't give it 5 stars on account of assembly steps that should have been better thought-thru by the manufacturer.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank Kennedy",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "So durable and excellent over the years am buying another",
      "text": "I bought my first Lifetime Deckbox seven years ago and it still looks great and has held up incredibly! It’s been outside on my dock since day one. Despite direct sunlight and salty air, it looks and works great after all these years. Hinges, struts, and hardware haven’t rusted out. I sealed the inside seams with silicone caulk as the tide sometimes comes high enough to cover the dock but never had water get in. Ordering my second one and hope it’s as great as the one I bought back then. Not too hard to assemble and easier if you have help.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Super Strong",
      "text": "I own the Lifetime Glider which is still going strong. So when I chose this storage box I thought it would be a sturdy product. And it is. I assembled it myself. Assembly was the most part easy. The metal bar installation was probably the toughest. The video you could scan with your phone really helped. Two days after putting it out in the elements we had torrential rain for like 10 hours. I was happy to see that the inside was bone dry.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Burns",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Love Lifetime stuff",
      "text": "So for about the past 20 years, I've had a vinyl Lifetime brand garden shed in my backyard. The steel framing members are starting to show some rust here and there, but overall it's held up like a champ to the harsh Florida environment. So I bought this box hoping for comparable quality, and I'm not disappointed. It went together very easily, and the construction is solid. We've had a lot of heavy rain lately, yet everything in it stayed dry.",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Definitely not a $200 storage container.",
      "text": "I must be one of the few unlucky people, because I would not recommend this to anybody. First, the entire container is plastic, including the small connectors on side pieces that are supposed to \"snap\" into the bottom. The bottom came warped, and the small plastic connectors all bent in because they are hollow and made of cheap, thin plastic. Definitely going to find something better. Upsetting because I was excited to have this.",
      "rating": 2.0,
      "verified": true,
      "author": "Adam Hofmann",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Great deck box",
      "text": "This is my fourth purchase of this box. I have three of the larger ones and just bought the smaller size. I'm using them at my mountain cabin which gets a few inches of snow several times during the winter. So far over the course of 2 years, the boxes have held up with no leaks. Easy to put together and fairly secure when locked.",
      "rating": 5.0,
      "verified": true,
      "author": "dh515",
      "helpful_votes": 18,
      "publication_date": 20140417
    },
    {
      "title": "happy happy Joy joy",
      "text": "This a BIIIIIIIIG storage box. I have not stored anything in it yet but I will start this week. I put it together myself in my apartment and stood it up lengthwise to slide out to my deck. Easy-Peasy. Not all holes lined up for screws but my crafty little mind made it work. I am very happy with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Chantilly Lace",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "LIFETIME 60103 Deck Storage Box, 80 Gallon, Desert Sand/Brown",
      "text": "Purchased the Lifetime storage box to be used as a drop box for packages purchased through the mail. So far it has been water tight. It appears to be heavy duty and very sturdy. The hydraulic cylinders seem to work very well with a tight seal to keep moisture out. Would definitely purchase this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie M.",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "My super box.",
      "text": "I carefully measured the larger 150 gl unit vs this only slightly smaller 135 gl. and found for the large price difference this one was the best for me. I love it ! super easy to put together (just don't confuse the top with the bottom fitting). Its very strong and will easily hold 2 people sitting on it. I am sure it will last for years. I am very happy A+",
      "rating": 5.0,
      "verified": true,
      "author": "Barry C. Lawrence",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Strong and easy to put together",
      "text": "Strong and nice. We bought this to hold our Intex Easy Set 15 foot by 4 foot swimming pool for winter storage. The pool, filter pump and tubing fills the box with a tight fit, but it has keep our pool nice for 2 years. I have never had water or moisture in the box. During the summer time when the pool is in use we use the box for storage of pool toys and other patio items. It sets at the side of our patio. So we throw a table cloth over it and use it for a buffet when we have guests over. It is strong and was easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Purchase something else...",
      "text": "I don’t understand how this has so many reviews that are positive... this thing is garbage! We have cushions stored in ours for a couch and love seat. We have it loaded to the top and a little pressure from the cushions causes the walls to bow out which then allows rain in. I expected so much more! Hard pass!",
      "rating": 1.0,
      "verified": true,
      "author": "Brad S.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Elegant, spacious and perfect for my deck gear",
      "text": "Assembly was pretty straightforward. I especially like the lid openers that hold it open while you hunt for things inside or put things away again. Lid snaps down firmly to keep out water. The old one this replaced warped badly within a month of installation and allowed water to seep in the seams. This one is sturdy and well built, no warping.",
      "rating": 5.0,
      "verified": true,
      "author": "Skye-writer",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Looks great and spacious",
      "text": "The only issue I have with this is assembly time. I'm handy and it took me sometime to put it together, even with all the right tools. Otherwise it's great, even use it as another sitting place on the deck. It would be nice to have some accessories to it, maybe a divider panel so you can separate the space better.",
      "rating": 4.0,
      "verified": true,
      "author": "Irina B.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Shipment damage",
      "text": "Just opened my box. The top of the lid is scratched pretty badly. Nobody purchases a new product and is satisfied when it arrives looking “used.” I’ve called the company to complain. It went to a recording and could not even leave a message. I then emailed them and still haven’t heard back. 😡. So much for a lifetime warranty!",
      "rating": 1.0,
      "verified": true,
      "author": "Anneke",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Better than Expected",
      "text": "Great packaging - the assembly was easy and probably took 45 minutes. The fit and finish are outstanding. We’re going to store Kayak equipment as well as some patio cushions. Tons of room.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Coghlan",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Good product for outdoor deck",
      "text": "We had what looks like the same product already so this was just what I needed. It's really easy to put together, the instructions are very clear. These will work out side on your deck great. However, the bottoms will get wet inside if it sits in an area that floods. So if your porch retains water after a rain, be aware of this. On a deck, they are always dry.",
      "rating": 5.0,
      "verified": true,
      "author": "hoytpr",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Massive Storage!  Looks Sharp!  Quality-Made!",
      "text": "I have 6 full-sized cushions (seat, back, neck) for 3 patio chairs and a 3-person swing, 4 additional seat cushions for a long bench, 3 outdoor pillows, a broom, a couple towels, and extra fire rocks for our fire-pit in this and I might could fit another pillow if I wanted! It's perfect, sturdy and looks nice. Excellent buy for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa H.",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Works fine and looks good but not super secure",
      "text": "I like the item and it's plenty strong but be sure and follow the instructions carefully - if you don't install the metal brace in the lid right - I wouldn't recommend putting it in direct sunlight though as I suspect it will warp if it gets overheated. Also, you can put a lock on it but all someone would need to do to break into it is carve the plastic away from the lock and they will get right in - I just don't keep anything valuable in it, just keeps my patio less cluttered. It looks good though",
      "rating": 4.0,
      "verified": true,
      "author": "donald",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Functional, good looking, mess to put together",
      "text": "This is functional, not waterproof my any means, and assembly was difficult. Instructions were easy to follow however, some of the holes for the screws were started and some weren’t, 3/8 socket wrench is not the right tool even though it is listed in the instructions.... use 10mm instead. Once together it was big enough to hold the metal pieces for our 24 ft wide 5 ft deep pool parts with room to spare.",
      "rating": 2.0,
      "verified": true,
      "author": "Stephanie Regan",
      "helpful_votes": 2,
      "publication_date": 20170930
    },
    {
      "title": "Very Nice!",
      "text": "Love my new storage box! Put in on my patio and I store chair covers , garden supplies etc. It's very large. My son put it together off site and said it took him a good 30 minutes maybe longer. He's very handy and said he didn't have a problem. It's been raining cats and dogs and everything inside it is dry.",
      "rating": 5.0,
      "verified": true,
      "author": "ChangingLeaves",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Wrong size hinge screws shipped with bolt pack.",
      "text": "Wrong size screws (DRF) shipped in the bolt pack which won’t fit through the holes in the hinge assembly. Going to have to try to find some alternatives from local hardware store. Lack of attention to detail in the bolt pack has killed the assembly. Turns out I’m not the only one - many reviews mention this issue - foolish me for buying it !! UPDATE ; turns out the screws were likely correct - it was 4 holes in the hinge brackets that were incorrectly punched too small at the factory. I ended up buying a small hand file to open up the size of the 4 holes, after which I completed the assembly.",
      "rating": 1.0,
      "verified": true,
      "author": "DuncanATL",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Keeps all of our cushions DRY!",
      "text": "There was a little difficulty with the hinges, but works great when finished. Lots of room for 8 large cushions and some pool toys. We had a big rainstorm, but everything inside stayed perfectly dry!",
      "rating": 5.0,
      "verified": true,
      "author": "squeezy",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Returns take forever! Now been 45 days and 45 nights",
      "text": "My return began Sep 1st. Item shows being picked up and so it must STILL be in transit. But 45 days? I NEED to get another kind of storage box as a replacement for this item. BUT, it is tough to purchase another item when the money is still being tied up in the return process.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Well built",
      "text": "This a very well built product. The panels and lid are double walled with about 1/2\" air space inside them and approximately 1/16\" thick plastic in the sides of the walls (I cut it open in several places to adapt it for a special project). The two sides of each wall are plastic-spot-welded at periodic intervals (roughly on an inch or so grid), maintaining the 1/2\" spacing between them. I am very pleased with the quality of this box and would recommend it to anyone looking for a large container box with a lid.",
      "rating": 5.0,
      "verified": true,
      "author": "retired_engineer",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Looks good once done, but.....",
      "text": "Horrible engineering. Took 3x the time to put together than it should have.",
      "rating": 3.0,
      "verified": true,
      "author": "William C. Earle",
      "helpful_votes": 2,
      "publication_date": 20200123
    },
    {
      "title": "Wrong Color & Faulty Part",
      "text": "We ordered a Desert Sand/Brown box & received a Grey/Black box. Assembly went well despite the normal challenges until I got to the last part - the AKF Gas Springs for the AND Lid. The first AKF readily snapped into both BET Ball Studs as did the the cylinder end of the second AKF; however, the rod end of the second AKF would not snap onto the second BET Ball Stud. So here we have a complete wrong color box that failed the absolute last assembly test!",
      "rating": 4.0,
      "verified": true,
      "author": "Jenks",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Perfect for Outdoor Dry Storage",
      "text": "I use this to keep all the covers for my outdoor furniture as well as excess cushions and other odds and ends. It sits out on some gravel and is fully exposed to sun and rain. I've had it 6 months now and have never seen a drop of water in it. It is attractive, able to hold a lot, and well built (one could easily sit on its lid). I agonized a lot about what box to buy and absolutely could not be happier with my choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Music Enriches Life",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Disappointed",
      "text": "Doesn’t hold together in windy settings. The support arm fell down inside the side panel the 2nd day and cannot be retrieved. The rain soaked through and now all my new patio cushions are mildewed :)",
      "rating": 3.0,
      "verified": true,
      "author": "Rebeca MCNAMARA",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Love it.",
      "text": "I absolutely love this storage box. I put it on my deck to store buckets of bird seed and all my tools for flower projects, even my broom fit in there. My deck looks so much cleaner and neat now. Seems very heavy duty. My husband and I are in our 70's and we put it together. I highly recommend. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "beargrammy",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Warped after less than 2 weeks!!",
      "text": "Lid warped in less than 2 weeks, short sides warped out to the point the lid wont go down on top either. What a waste of over $200.",
      "rating": 1.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 3,
      "publication_date": 20190714
    },
    {
      "title": "Great looking, sturdy and good size - take care when connecting the pneumatic bracket ball socket",
      "text": "Perfect size and very sturdy - only reason didn’t get 5 star is that one of the pneumatic brackets did not fit properly so only one works now. But still love the box Take great care when connecting the ball socket of the bracket as they don’t go in easily and can fail...",
      "rating": 4.0,
      "verified": true,
      "author": "Charles Bransby-Zachary",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Use it for deliveries.",
      "text": "I use this box for a delivery drop point. Mainly to protect deliveries from the weather. This box is good sized and fits most any standard delivery items/boxes that we receive. It is also \"weather proof\" to the point that it keeps items dry. It does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "David D.",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Lasted 4 years with no problems",
      "text": "I just ordered another of these 130 gallon boxes for storage. The first box is now 4 years old. I have had NO rust or peeling problems, unlike some owners. It sits under an eve of my house in So. Cal. It does gets hot here, but rain is infrequent. Again, I have had no issues at all.",
      "rating": 5.0,
      "verified": true,
      "author": "steveinriverside",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Very hard to assemble. Wrong size screw.",
      "text": "the plastic quality is ok, however it is very hard to assemble. Some screws are wrong size, would not fit in small hole of metal part. My feeling is the manufacturer don's not pay attention to supply proper part.",
      "rating": 1.0,
      "verified": true,
      "author": "KYW",
      "helpful_votes": 10,
      "publication_date": 20170526
    },
    {
      "title": "Excellent quality & Very Practical",
      "text": "Top of the line quality and features. The lid is effortless to open with gas spring assist. Easy to assemble looks amazing. The lock hasp is semi hidden & works well with most padlocks. Master has a new type of a combo lock with a center 4 way motion button that works great for quick & easy response.",
      "rating": 5.0,
      "verified": true,
      "author": "JAMES VANBIBBER",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "great product but for a design, or perhaps part packaging, flaw",
      "text": "This could earn 5 stars but for the 2 hinges connecting the top to the base. They should be opposing 'thumbs,' but they're duplicates rather than mirror images. Consequently, the top doesn't sit flush & tight when closed as 1 side is necessarily cocked slightly up because the hinge cannot rest flush against the base to which attached. Has not been a problem at this writing. The outdoor furniture cushions I store in it fit perfectly & have remained dry & otherwise well protected from the elements. Nevertheless, this design, or perhaps parts packaging mistake, is quite aggravating.",
      "rating": 3.0,
      "verified": true,
      "author": "k.williamson",
      "helpful_votes": 3,
      "publication_date": 20150630
    },
    {
      "title": "All our pool winterizing products in one place",
      "text": "Needed a little help because all of the holes weren't punched completely out for snapping together. Have a drill, no huge deal. Seems like it's water and bug tight. Fits our in-ground pool winter cover and all the items to shut the pool down. Very, very pleased with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "William Laughlin",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Sorely disappointed",
      "text": "Just trying to do the first two steps, attaching the front and back and \"sliding\" them over to secure - is impossible. They aren't sliding or moving. I'm stuck - neither front OR back will slide over, despite firm pressure, then gentle rubber mallet taps and now frustrated kicking. The plastic is too soft to tap at the notch peg things themselves, so there is no leverage to \"push/slide\" the front or back piece over. For every 4 screws needed, there are only 3. So one corner of everything is not attached securely. Will put this out fromt on the curb for someone else to take home and get frustrated with.",
      "rating": 1.0,
      "verified": true,
      "author": "Auntie Pedantic",
      "helpful_votes": 9,
      "publication_date": 20171205
    },
    {
      "title": "Big storage. Better than home depot",
      "text": "Using this for outdoor furniture accessory storage. Needed something big that even home depot didn't have and turned out to be cheaper than home depot's largest storage bins. Most difficult step is towards the end, just a heads up. Otherwise, this is a wonderful unit for outdoor storage with plenty of state",
      "rating": 5.0,
      "verified": true,
      "author": "Aku",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Built like a tank.",
      "text": "When I ordered it I was thinking I may have overpaid for this unit. I should never have doubted a Lifetime product. This Deck Box is well worth the money. High quality materials and hardware. Detailed instructions that are easy to follow. It took me a little more than an hour to assemble by myself. Engineered to be rugged. You could put this thing in the back of a pickup truck and use it for a tool box. Last but not least, it is huge! So glad I chose this box over those no name cheap imitations.",
      "rating": 5.0,
      "verified": true,
      "author": "Blackbeard",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Love this",
      "text": "I have this on our porch and keep crates it to hold recyclables and bagged garbage for the transfer station. Everything is clean when I put in. It's convenient for putting in the truck and a lot easier than carry things up from the basement.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "terrible value",
      "text": "Everything was fine until I tried to assemble the top. The metal braces would not fit to the plastic top. The pieces were off and did not fit no matter how much adjustments., I still just have a top and a bottom without the hydraulic opening it is suppose to have. This piece was not inexpensive and should have fit easily. Wouldn't buy again!!",
      "rating": 1.0,
      "verified": true,
      "author": "john Y",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Tough assembly",
      "text": "It’s a sturdy box, no doubt about that. Unfortunately, it took my husband hours to put it together. Every bolt hole had to be widened - even the ones on the metal hinges. So if you don’t own a drill, this is not for you. Also, I find it very hard and awkward to open. I hope it is at least waterproof",
      "rating": 2.0,
      "verified": true,
      "author": "Beachtime0408",
      "helpful_votes": 2,
      "publication_date": 20180502
    },
    {
      "title": "Excellent quality, waterproof",
      "text": "Outstanding outdoor storage. Easy to assemble, waterproof and not an eyesore. I took me about 30 to 45 minutes to assemble even though the instruction manual stated it would take three people to put together. At another point in the manual it stated it would need two people. But the truth is you can do it alone. Just follow instructions and don't jump ahead. If you jump ahead with this one, you may not be able to reverse. But the instructions are clear, graphic and on the money. Their manual also provides a video for your Smartphone or other device as sell as for desk top. This bin is much better than the Rubbermaid I purchased a few years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Great buy!",
      "text": "The box came and everything was in tact and complete. I'm 5' and over 50 and was able to put this together myself. I was able to put the following: pressure washer, chain saw, trim hedger, leaf blower, 2 big luggages, 1 folding chair, 2 - 2 gallons or organic weed killer and a couple of Tide detergents. Pros: - Easy to install - Easy to follow instructions - Material is strong Cons: - Some of the holes were to small. I had to use my drill to stretch the holes a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Pooh9rfan",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "As advertised.",
      "text": "The first one I got had been repackaged and badly taped together box without hardware or directions. However I think it was the shipper. I returned it and got very quick turn around. It has amazing storage space and will be very useful to store my greenhouse supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "Mimi",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Seems good for the price.",
      "text": "I keep this in a breezeway/ patio that is covered so I can't comment on how dry it would stay if left outside. Keeps my boat stuff organized and dust free ( cushions, tackle, lines, hats, etc.). I may buy a second one to further organize the area as it is very good looking. After 8 months of use it still looks good and is keeping the Key Largo salt air of off my stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "PERFECT!!",
      "text": "LOVE! This storage box is honestly more than expected, it is very large like the description states and the material is heavy duty plastic. Best part, made in the USA! You will need some tools but that goes for any box you have to build. Makes our garage look even better. Super happy with this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170406
    },
    {
      "title": "Impossible to assemble",
      "text": "Very hard to assemble. Cannot even get past the first step as the front and back will not slide in slots on the bottom. We have tried sliding, pushing, using a mallet, etc.",
      "rating": 1.0,
      "verified": true,
      "author": "tharp83",
      "helpful_votes": 4,
      "publication_date": 20180617
    },
    {
      "title": "Definitely worth the purchase.",
      "text": "I bought this about a month ago to store our pool cover, some cushions, as well as pool toys. So far it’s worked great! Eventually I’ll likely buy another to store more, as our HOA doesn’t allow anything like a shed. I can’t speak the how easy it is to assemble personally, as my boyfriend did it while I was out of the house lol but he said it wasn’t bad at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "the price is pretty good. But the assembly tolerances on this product ...",
      "text": "For the size of this box, the price is pretty good. But the assembly tolerances on this product are horrible...I need to really push the lid to the side to get the box to close all the way. You should have a drill ready to get the screws started because the ones included aren't self tapping, there aren't holes pre-drilled (or molded) and the screws aren't sharp enough to penetrate the plastic. My lid also came with a nice dent in it.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "... able to assemble by myself -Found assembly instructions not super clear -I had hard time assembling lid -Good quality ...",
      "text": "Shipment arrived on time -Box was not very heavy -I was able to assemble by myself -Found assembly instructions not super clear -I had hard time assembling lid -Good quality and enough storage space -Using it on backyard.Even through lid I installed has some issues.After rains for several days,i do not see any water leak. If you have patience and some help with assembly, this is a good product",
      "rating": 4.0,
      "verified": true,
      "author": "AMfrenzy",
      "helpful_votes": 2,
      "publication_date": 20170815
    },
    {
      "title": "Love It",
      "text": "I've got this unit on my shooting range to hold targets and other items. It works great. Plenty of room, and the double cylinders to hold the lid open are a great feature. I've had good luck in the past with Lifetime products, and this is no different.",
      "rating": 5.0,
      "verified": true,
      "author": "Fishing Show",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Parts don't fit together",
      "text": "Comes with nuts and bolts that do not fit together. Had to buy different ones from the hardware store instead. Don't be fooled by their demo videos, the guy's handling a completely different nut than the product comes with.",
      "rating": 1.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20200812
    }
  ],
  "product_meta": {
    "title": "Lifetime 60040 Deck Box, 130 Gallon, Desert Sand",
    "description": "Size:130 Gallon| Color:Desert SandNeed to expand your patio storage, but have limited space available? Store your things outside in a Lifetime Storage Box. The rigid, double-wall, high-density polyethylene (HDPE) construction makes the box strong and durable, sturdy enough to be used as a patio bench. It's UV-protected construction and the weather and water resistant seal helps keeps the interior dry. The spring-hinge lid opens greater than 90°, won't slam shut and is lockable.",
    "rating": 4.5,
    "feature_bullets": [
      "Rigid Double-Wall High Density Polyethylene (HDPE) Construction",
      "Weather-Resistant Steel Hinges",
      "Controlled Spring-Hinge Lid Opens Greater than 90 degrees- Won't Slam Shut",
      "Weather and Water Resistant Seal - Helps Keep Interior Dry",
      "Easy Straight-Forward Assembly"
    ],
    "specifications": {
      "Product Dimensions": "60 x 24 x 23.7 inches",
      "Item Weight": "54 pounds",
      "Manufacturer": "Lifetime Products Inc.",
      "ASIN": "B004Q0B4UU",
      "Item model number": "60040",
      "Customer Reviews": "4.5 out of 5 stars3,289 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#1,572 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Outdoor Storage",
      "Deck Boxes",
      "Garden & Outdoor"
    ],
    "price": 159.99
  }
}