{
  "website_summaries": [
    {
      "verdict": "A budget-priced wine cooler that can fit especially large bottles.",
      "pros": [
        "Clearly displays contents",
        "Can accommodate some larger-than-average bottles"
      ],
      "cons": [
        "A few complaints of machinery noise",
        "The cooler may struggle to maintain temperature in hotter climates"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not really a cooler",
      "text": "They should clearly explain up front that this product will not bring the temp down below 20 less that the area It is in. If your house is 78 degrees it will not chill below 58. You can not put in your outside cabana because it will not chill below 70 if it is 90 outside. I have purchased many wine coolers and they have always been real coolers. This should be in bold letters at the top of the offer.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven A West",
      "helpful_votes": 16,
      "publication_date": 20170920
    },
    {
      "title": "Nice quality, quiet, but smelly",
      "text": "Hi, I like it but I also have a tip and question for all of you. It's been working fine for over a year now, and is very quiet. Tip: break out the metal retainer on the lower 'standing vertical' section to fit any size bottle like the larger Champagne bottles. Question: Mine smells of production plastic when I open it. I've soaped it clean. I've not seen any leftover shipping materials or plastic over the light bulbs that I imagine would produce that smell. Does anyone else have this problem or more importantly a solution for me? I would buy another one if I could solve this problem. Thanks in advance.",
      "rating": 4.0,
      "verified": true,
      "author": "woody",
      "helpful_votes": 3,
      "publication_date": 20170910
    },
    {
      "title": "Not good",
      "text": "We have owned the product less than a year and it’s not keeping the wine cold ! Right now it shows 70 degrees in the unit ! Some times it will go a bit lower but will not stay at 48 degrees which is where I want it . I want to complain to manufacture but can’t find a contact number.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamela Garcia",
      "helpful_votes": 4,
      "publication_date": 20180106
    },
    {
      "title": "Doesn't work and I can't get a refund",
      "text": "We bought this as a gift. When we gave it to the people, and got it all set up, the temperature would not cool down. I tried to send this back to the seller since it didn't work, and they refused. So I called Avanti and got the number for a service technician to do a troubleshoot over the phone. That technician was unwilling to help us over the phone. I'm disappointed with this purchase. We spent a lot of money on this and it does not work at all! I want someone to take it back and refund our money!",
      "rating": 1.0,
      "verified": true,
      "author": "HCro",
      "helpful_votes": 3,
      "publication_date": 20180104
    },
    {
      "title": "Four Years of Perfect Performance",
      "text": "This was the first (and only) wine cooler that I've ever purchased. I bought it in 2015. It's been sitting in my dining room, efficiently doing its job, ever since. My reason for writing this review is to report that the product is incredibly RELIABLE. It has never given me one problem of any kind, keeps my red wine at a perfect 56 degrees, has an almost inaudible fan, and makes an attractive addition to my liquor cabinet. I'm not making any of this up. It's a wonderful product. Should it die at this point, which I certainly don't expect, I'll promptly order another one. I am really impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Hays",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "I bought this as a gift and it looked sleek but very disappointed. The racks were all too small and would ...",
      "text": "Racks did not fit in the cooler. I bought this as a gift and it looked sleek but very disappointed. The racks were all too small and would not hold a bottle up. I called the company the day of. They told me they would send new shelves within 5-7 business days. It has now been 6 weeks. Their customer service is a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20161211
    },
    {
      "title": "looks nice but doesn't work!",
      "text": "ordered this cooler based on so many positive reviews and because of the \"upright bottle storage\" feature ... received yesterday ... worked fine overnight ... went haywire today ... nonstop beeping and then turned off ... called Avanti ... they suggested we try to reboot ... did that several times and still didn't work ... it's packed and ready to go back ...",
      "rating": 1.0,
      "verified": true,
      "author": "retiree",
      "helpful_votes": 6,
      "publication_date": 20160629
    },
    {
      "title": "Nice wine refrigerator",
      "text": "Beautiful wine fridge. Very nice look and cools well. A little bigger than I thought it was, height wise. I like that the digital controls can't get bumped..... you have to press and hold 2 buttons to change anything. But I wish the light could be turned off and on without holding to unlock the control panel. Nice curved door and light inside very stylish. All around good product and I would recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "JClark",
      "helpful_votes": 5,
      "publication_date": 20160925
    },
    {
      "title": "It seems like all of my bottles have just the tiniest bit ...",
      "text": "The dimensions of this are rather odd. It seems like all of my bottles have just the tiniest bit of trouble fitting in (the bottles are maybe 1/4\" / 1cm too wide for the shelves. They still fit, but I have to force them in a bit. Same for the width on the standing rack. Unless you only have rather \"thin\" wine bottles, just be aware of this. The design would be significantly improved if they made it just an inch or two taller and wider.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160619
    },
    {
      "title": "Not happy after 3 years",
      "text": "It is sleek and quiet but i would never buy this again. I have had many problems. The first being that it takes forever to get it down to a lower temp and we had to pull the wires out from under the plastic cover to remove and reinsert and then it would lower the temperature (to 52 F). The only time the light turned on without pressing multiple buttons was if you unplugged and reinplugged it. I’ve had it for 4 years and still put ice in my wine when I pull these bottles out. Not happy. Would find a different brand next time. Never buy again!",
      "rating": 2.0,
      "verified": true,
      "author": "Katie Rita",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Happy Birthday present",
      "text": "I actually bought this as a birthday present recently. I love the idea of having some bottles sit up right. If you dont finish you ha e a place to store it. Good size. Light weight. She was ecstatic to receive it.",
      "rating": 3.0,
      "verified": true,
      "author": "Miss.CLP",
      "helpful_votes": 4,
      "publication_date": 20160305
    },
    {
      "title": "Temperature varies too much",
      "text": "After receiving the unit it worked great for 1 month, then the temperature started going up from 49 degrees for my white wine to 52-54. I unplugged the unit and let it sit for a while. Still no change. Would not go back past 52. Called company, they told me to cut the plug off and peal serial number off and send it to them. They did replace the unit after 3 weeks. Received the replacement unit and only had it for 2 months and doing the same all over again. I will contact company again. I do not recommend this unit. Go with another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Lindsey Arnett",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "... to put an ice pack in it first to cool it down but once it's running it works like ...",
      "text": "you have to put an ice pack in it first to cool it down but once it's running it works like a charm. as long as the room you keep it in is relatively temperature stable, the fridge works well. follow the directions, give the ventilation holes plenty of space. update: had this for 1.5 years. The temperature never fluctuates and remains quiet and in perfect working order",
      "rating": 5.0,
      "verified": true,
      "author": "Youngrin L. Kim",
      "helpful_votes": 2,
      "publication_date": 20151220
    },
    {
      "title": "Does not Last",
      "text": "Buyer Beware! This wine cooler has problems with the controls on the door. First unit controls ( Light,temp settings) did not work at all. I should have seen that as a bad omen. Sent back and received replacement. Cooler only lasted 2 years! Door panel controls do not work at all anymore. Cooler shuts off for days at a time and then goes back on intermittently.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Get a low profile wine stopper.  You can’t stand bottles vertically with regular wine stopper.",
      "text": "Overall a good product, except for one annoying flaw and that is you can’t put a regular size wine stopper in the bottle and stand the bottles up vertically. You'll have to get a low profile stopper. You can use the original cork but it must be driven in a good distance. Don’t forget to remove label over temperature readout. I forgot and thought the LED temperature readout was defective. For the first 24 hrs. the temperature got down to 48°. Now, almost two days after, it won’t get lower than 52°. 8^\\",
      "rating": 4.0,
      "verified": true,
      "author": "BrianS",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Love this product!",
      "text": "This is a perfect product for keeping your wines chilled, and keeping them for much longer times. Love that it has a section to stand a bottle up to keep it fresh, and chilled. Works just like they say, with easy instructions on starting the cooler. Keep wines at a set temp., small, and perfect for counter top or set on the floor. Looks great, and the quality is great. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "R. haskins",
      "helpful_votes": 2,
      "publication_date": 20160624
    },
    {
      "title": "Not a good buy",
      "text": "Sorry to say, but it isn't even two years old yet and it's no longer functioning. I unplugged it for a couple of months (no wine) and once plugged back in it lights up but isn't cooling down. So disappointed. Also to note ... the temperature I set back when it was working didn't hold. It frequently changed from red wine to white. I don't think I would recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Arlis",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Will fit champagne bottles",
      "text": "I just got this today so I can’t speak to it’s longevity yet. But within an hour it was cooled to its set temperature and very quiet. If you remove the bottom rack it will comfortably hold 10 bottles of champagne. If you’re not planning on storing only champagne you can use the top rack for the larger bottles and leave the other rack in for regular size bottles. You will not be able to stand up open bottles of champagne in the bottom rack. But I never seem to have an open bottle of champagne leftover so not an issue for me. So far loving this cooler.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Hartoog",
      "helpful_votes": 3,
      "publication_date": 20171108
    },
    {
      "title": "Good wine fridge",
      "text": "A cute little wine fridge. My husband got it for me as a gift and it does the job nicely. I drink Moscato and Champagne, both of which come in larger bottles and the racks accommodate them just fine on the top. My only warning is that the temperature does not go down below around 50 degrees, which may be great for some wines but the bubbly ones we like ice cold. This fridge is great to keep the wines below room temp so in case of company I can just throw the bubbly in the big fridge to cool all the way down for drinking. I love the fact that I can store open bottles standing to prevent leaks!",
      "rating": 4.0,
      "verified": true,
      "author": "Rosemary",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Great buy. No problems. Very quiet.",
      "text": "I have had this wine cabinet for awhile. I never write reviews immediately. I want to see how well the item holds up. I live the versatility of this cabinet that stores 4 bottles standing. Works beautifully- no problems and no noise. I have it sitting on the floor at the end of my kitchen cabinets.",
      "rating": 5.0,
      "verified": true,
      "author": "pinecone",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Stopped working on day one.",
      "text": "It never worked correctly from day one. (I did not want to return it because of the return shipping costs.) The temperature settings would freeze all the time. The only way to control the temperature was to unplug it and \"restart.\" Then after a few months, it stopped cooling entirely. Don't buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "figment",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "A TOTALLY WASTE OF $133 POOR EXCUSE OF CUSTOMER SERVICE DONT WASTE ...",
      "text": "After doing research we decided upon this model. We purchased it in July 2016 and 3 months later we smelled smoke and sparks were coming out of the motor. This happened 1 day before we were leaving on vacation and upon our return I just spoke with Avanti products warranty... THEIR REPLY IS THE WARRANTY DOES NOT INCLUDE ALASKA OR HAWAII... LAST I CHECKED WE ARE STILL IN THE UNITED STATES OF AMERICA... A TOTALLY WASTE OF $133 POOR EXCUSE OF CUSTOMER SERVICE DONT WASTE YOUR MONEY ON THIS",
      "rating": 1.0,
      "verified": true,
      "author": "Liana B",
      "helpful_votes": 9,
      "publication_date": 20161111
    },
    {
      "title": "Great little wine fridge! While it lasted.",
      "text": "We temporarily put it in our bedroom. It’s super quiet. I guess silent. And it does the job of keeping our wines at the set temperature. Like that it has some room for standing storage, as we don’t always finish the bottle at once.. I know.. shame on us.. haha. So far happy about it. UPDATE (4/10/2020) - It stopped working. Just Two years and it broke. Downgraded to three stars. Can’t recommend anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "HuzuBarista",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "but now seems to hold better. It'sabout 2 years old and none of the ...",
      "text": "When new it had trouble hoding to desired temperature, but now seems to hold better. It'sabout 2 years old and none of the buttons work. Can't change the temperature, can't move from celsius to Fahrenheit, nothing. At this price point I expect things to last a bit longer.",
      "rating": 2.0,
      "verified": true,
      "author": "rick bentley",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "It is cute and love that it is too big",
      "text": "Got this as a gift! It is cute and love that it is too big. The only thing I didn't like is that it doesn't get as cold as I like but I found out you have to turn the temperature down to like 40s to get it colder. The directions recommend the 50s but it barely chills the wine.",
      "rating": 4.0,
      "verified": true,
      "author": "Mila",
      "helpful_votes": 2,
      "publication_date": 20161208
    },
    {
      "title": "which is great if you want a blue Night light",
      "text": "Arrived with cosmetic dent and LED always on, which is great if you want a blue Night light, terrible if it's a room that you might not want filled with blue light, like entertainment area, have to use cloth to cover when watching TV or relaxing with lights low. Also, if you open door all the way, everything shuts off. No actual On/Off Controls. Only functions in climate controlled environment and away from heating source, like adjacent to heating vent. Left for week and turned down heater to save energy and temp of chiller well below desired temp. But, it is just a chiller, not a refrigerator... so some of this was to be expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Seem ok for price. Quality is yet to be seen.",
      "text": "First one shipped didn't work. Sent back for refund and ordered new one. Cost $20 more for exact same one. Seem to be made very cheap. Would not have reordered but gave as Xmas gift and person loved so reordered.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "works Great",
      "text": "I h ave this in the corner of the dining room and it works wonderfully.Its runs very quietly and really keeps the wine and a few bottles of beer cool. I had enjoyed this cooler till it just quit on us its just over a year old so sad.I've been checking on line but a lot fail like this one!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20160707
    },
    {
      "title": "Great for about a year, decent afterwards",
      "text": "Worked great for about a year, but now is unable to keep the temperature below 60 if the room temp is above 70. It will also scratch off labels or not fit any bottles that have some curves to them (champagnes, burgundies, etc.) Otherwise, it now (2 years in) does keep the temp around 59-61 pretty consistently so if you're looking to shield your bottles for a few months from room temp, it does the trick.",
      "rating": 3.0,
      "verified": true,
      "author": "Caitlin Miller",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Unit stopped working after 120 days",
      "text": "The unit stopped working after 120 days. Now I don't expect a $130 wine fridge to last for ten years but this is pretty weak.",
      "rating": 1.0,
      "verified": true,
      "author": "michaelr",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "Broken and not fixable",
      "text": "This will not go below room temperature. We have tried everything recommended in the comments here on Amazon, and in the product manuals. We were clearly shipped a defective product. Really not worth shipping back, but certainly would not recommend buying this.",
      "rating": 1.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 2,
      "publication_date": 20171209
    },
    {
      "title": "Love it! The stand up factor is the best ...",
      "text": "Love it! The stand up factor is the best quirk! The noise factor on previous reviews had me concerned, but it's just a small fan noise. You can't hear it unless you listening for it. Please notice that this is not an actual refrigerator, just a chiller. Temp doesn't go below 49 degrees, so it keeps the wine at about room temp. Still great buy though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150401
    },
    {
      "title": "I have an older Avanti cooler that does not have ...",
      "text": "I have an older Avanti cooler that does not have temp setting. This one does, and it is quite accurate. I set unit at 62 for red wine, and placed a thermometer inside to test it; right on. My old one has worked for 10 years of intermittent use (four months per year) and without an accurate temp setting, works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Green Valley Golf",
      "helpful_votes": 2,
      "publication_date": 20160423
    },
    {
      "title": "Great little unit, especially for an RV!",
      "text": "We actually got this for our RV so we could take some of our favorite wines from home when we travel. It is quiet, compact, and works perfectly. I would say it is just as nice as our built-in unit. However, it does not fit on countertops if you have upper cabinets.",
      "rating": 4.0,
      "verified": true,
      "author": "BadBear",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Trash",
      "text": "There is a reason this is the cheapest wine cooler you can find. Broke within a few weeks. Now it's just a wine holder. I knew better than buying the cheapest possible and I got what I deserved. Don't be foolish like me.",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Just good for storage, not cooling",
      "text": "I bought this for my home bar area. I only drink white wine and I like them to be cold! I like to have alot on hand as I have company over quite a bit. I figured this would be a good fit, however it doesn't get cold enough for me and after only a few months, the buttons no longer work. The temperature is stuck at 54 degrees permanently. Other than looking aesthetically pleasing to the eye, it's a waste of money in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Realestatechick",
      "helpful_votes": 0,
      "publication_date": 20170524
    },
    {
      "title": "Great if your power supply is dependable",
      "text": "Love the option of storing bottles both upright and in the standard position. Works quietly and efficiently. The only problem, which may affect others less than us, is that we have frequent power outages, and, whenever the power goes out, the cooler automatically defaults to the lowest temperature, which is a problem as we are storing red wines, and cannot always reset the temperature promptly (being out of the house).",
      "rating": 4.0,
      "verified": true,
      "author": "JimGO",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "Stopped cooling after 1 year",
      "text": "Good size and layout with a few standing bottles. Similar to other reviewers though after 1 year of use - sat in the same spot unmoved or damaged it suddenly stopped cooling. Tried switching on and off like other users described, but no luck. I'll probably try cracking open the back and fixing it like other reviewers did. Seems like the quality control Avanti uses (at least for this model) is pretty poor with how much variability people are getting in lifetime. Not a good deal in a wine fridge for such a short life span.",
      "rating": 2.0,
      "verified": true,
      "author": "William Jaegle",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "It won't power up!!",
      "text": "My product was just delivered today and it was dirty on the bottom once I unpackaged it. I plugged it in it never came on. I uplugged it checked the circuit breaker still won't power up. I press the power button by pressing the up-and-down button still won't power up it's completely defective. I have a wine party this Friday and I am very very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Andre walton",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Overall a good unit and look",
      "text": "Arrived fast and exactly as advertised. Overall a good unit and look. One piece of feedback is that the temperature does not seem to get below 53-55 even when not opening the unit. White wine inside is nice and cold and no issues to date. Also you have to activate the unit to turn the internal light on versus the light just coming on like in a normal refrigerator. Not a big thing as we rarely turn on the light anyway. Overall a nice unit for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Auerbach",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Nice quiet cooler",
      "text": "This wine cooler keeps our bottles of wine at a constant cool temperature of our choice. It actually holds 14 bottles of wine. We are very pleased with it. It is also very pleasing to the eye.",
      "rating": 5.0,
      "verified": true,
      "author": "mghastings",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Stops after 1 year.",
      "text": "Product worked great for just about a year then stopped cooling even though light was on and it appeared to be \"working\".",
      "rating": 1.0,
      "verified": true,
      "author": "rustd408",
      "helpful_votes": 2,
      "publication_date": 20170910
    },
    {
      "title": "Works Good",
      "text": "This is a very good product for the price. My first on lasted about 10 years. Service was fast and efficient. Would us e them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "The one to get, customer service great!",
      "text": "I was so happy when I first got this wine cooler. But then I thought it was acting up and not working properly. I tried working with it for quite a little bit hoping that maybe I could get it to work for me. But operator error, my bad. A quick call to Amazon and they got me in touch with Avanti who helped me resolve the problem and it works beautifully. So glad that I did not need to return or exchange it at all. Would recommend it to anyone! Runs very quietly and chills my wines to the right temperature. Being able to store opened bottles upright is the greatest feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Brande",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "The price and size are great! Some said that is was noisy",
      "text": "The price and size are great! Some said that is was noisy. I do not find it to be noisy. I live in an area where it gets very hot in the Summer and I try to save energy on my cooling bills, but this caused my wine to get too warm. This wine cooler solves that problem. I like the stand up area inside to keep my opened bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Pickett",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "So good we bought a second one",
      "text": "We now own two of the Avanti 12 bottle wine fridge. We were so pleased with the first one we purchased three months later we purchased another for a different location. The price was very attractive as well as the ability to place open bottles back into the fridge. If you have not had the chance to have your wine kept at the perfect temperature the treat yourself and purchase this one. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "NOMAAD",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Works great",
      "text": "We have been using this for about 6 months now and it keeps our wine the perfect temperature. We are using it in the kitchen next to the counter. the slots for the wine are very snug but I have been able to get 12 bottles in of all shapes.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri S",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Revised after 2 years: no longer functional.",
      "text": "Had this unit for a while now and I love it. I find it silent and effective. I have red and white wines it it and a couple bottles of whiskey. Suits my needs great, even in Hawaii summer weather. The slim design really lets it fit where I wanted it. Revision: after a couple years in the same location, the cooling elements stopped working. Noticed a lot of reviews were good until a year or two. Was good while it lasted, but not a long term investment.",
      "rating": 3.0,
      "verified": true,
      "author": "B. K. Rubio",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "You will buy more wine...",
      "text": "This wine bottle cooler/fridge has been the catalyst for us joining a wine club and buying more bottles of wine than normal. Because if you keep them at the right temp, they don't go bad and you can stock more! Right? Right. Great price, and quiet as all get out. Virtually no add to our electric bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Works for my Needs",
      "text": "Nice unit for holding up to 12 bottles. Designed for 750ml size bottles not the 1.5L bottles (even for the bottles that stand up). Has separate one touch temp settings for white and red wines, but does not have separate cooling compartments. I like design and pricing combo. Does the job well.",
      "rating": 5.0,
      "verified": true,
      "author": "TonyKend",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "Doesn’t hold its temperature setting",
      "text": "Sorry to say I loved the size and convenience of this little fridge but it doesn’t hold it temperature setting and I will be replacing it.",
      "rating": 1.0,
      "verified": true,
      "author": "Roni Lee",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Worked great for about 2 years",
      "text": "Someone else said the same thing. It must be very cheaply made. I unfortunately do not have the ability to repair it so it’s trash. Don’t waste your money. For the price it definitely should have lasted longer.",
      "rating": 3.0,
      "verified": true,
      "author": "Living Life to the Fullest",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "WONT HOLD A STEADY TEMP",
      "text": "This fridge does not hold its temp it will sometimes be 35 them it will be 60. it has not worked right since we got it. it also makes alot of noise all of the time. I would not recommend this fridge. Ours now sites unplugged holding the wine.",
      "rating": 1.0,
      "verified": true,
      "author": "kimberly",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great wine chiller!",
      "text": "Great wine cooler! So far it works perfectly and makes no sound which I find amazing. Wine stays cool at preferred setting, love it. Perfect for a small space but too large for counter top placement.",
      "rating": 5.0,
      "verified": true,
      "author": "Katt77",
      "helpful_votes": 4,
      "publication_date": 20170129
    },
    {
      "title": "Great Wine Fridge",
      "text": "It's worked great for over a year and still going. the temp controls are very simple and it looks nice. The price is reasonable so all good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose A. Mesuro",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Stylish and Functional Wine Chiller",
      "text": "Great chiller. Plenty of space for multiple bottles, easy-to-set temperature controls, and it looks pretty slick. I do wish, however, that the interior light was able to be left on for longer than 10 minutes at a time for display purposes. Other than that, though, we're loving it.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad J.",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Poor product",
      "text": "buy this if you only want it to work for 2 years. after that time the display will go out and it will make your wine hot and not even room temperature. my friend purchased a different one and 6 years later it still keeps her wine cold. definably would not recommend this product!",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Bierman",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "It was 20F outside and 70 inside and the unit would not cool to below 63",
      "text": "You get what you pay for. It was 20F outside and 70 inside and the unit would not cool to below 63. I have requested an exchange in hopes I have a defect. It does NOT take every size wine bottle. Unless the bottles are thinner you will be lucky to get 8. I'll update when I receive the replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "No problems",
      "text": "Love it. Had it for a few years and I haven't had any problems. Very quiet. Keeps wine nice and cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "After a year, works great - and excellent vertical bottle feature",
      "text": "We've used this for a year and still love it. We keep it in the basement, and it seems flawless. The vertical bottle feature is awesome. It has a cool, sleek look and functionally, it's working great. I read someone commenting on the sound - it's quieter than a regular refrigerator and doesn't seem too loud at all. However, it IS in the basement, so the noise wouldn't bother us. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "professorroyhinkley",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "... what it says it will do and I am pleased with it",
      "text": "Update: After several months of continuous use it is holding the wines chilled to the correct temperature. Very pleased with it. Product description says it all and it does what it says it will do and I am pleased with it. Good packaging, quick shipping and a good price. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "MH8",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "MY CHRISTMAS GIFT FROM THE HUBBY & I LOVE IT. HOLD A LOT OF BOTTLES & DOESN'T ...",
      "text": "MY CHRISTMAS GIFT FROM THE HUBBY & I LOVE IT. HOLD A LOT OF BOTTLES & DOESN'T TAKE UP A LOT OF ROOM & VERY QUIET...THANKS",
      "rating": 5.0,
      "verified": true,
      "author": "Monika Gray",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great purchase!",
      "text": "Love this little wine fridge! It's taller than I expected, but is still very compact. I read the reviews and was a bit nervous how loud people said it was. It's only a tad noisy when you first plug it in, and it has to work hard in order to cool the unit down. I bought it as a birthday gift for my boyfriend, and he loves it! Great purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 2,
      "publication_date": 20150406
    },
    {
      "title": "An excellent buy for the money!",
      "text": "Took less than 10 minutes to get out of box and set up. Unit is completely silent... Fully loaded unit with room temperature wine bottles and within a couple hrs temp was down to 48F",
      "rating": 5.0,
      "verified": true,
      "author": "Sal La Rosa",
      "helpful_votes": 3,
      "publication_date": 20160508
    },
    {
      "title": "This is Perfect, for the first two days I was worried",
      "text": "This is Perfect , for the first two days I was worried , because the temp never goes down , but it looks like it has to adjust to the your home temperature , and ever since it's working Perfect I just love it .",
      "rating": 5.0,
      "verified": true,
      "author": "Amalvi A.",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "This cooler works great and is extremely classy in its design",
      "text": "This cooler works great and is extremely classy in its design. I love that it fits 12 bottles; it is the perfect amount to ensure that I have a wide variety chilled whenever I need it. I also LOVE the fact that it has slots for 4 upright bottles. The only reason I put 4 stars is that the upright stands struggle to be adaptive to different wine bottle sizes; the bottles with a larger base don't naturally fit. All in all, a fantastic product that I would certainly recommend to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "Cody",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Second one in three years - stopped working over one year of use",
      "text": "These last about 1.2 years - horrible. They seemed to be designed to fail right after the warranty period. During warranty, they're nice - look good and function great. Then one day, that's it. It won't get below 62 degrees. Crap engineering.",
      "rating": 1.0,
      "verified": true,
      "author": "A.-NJ",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Nice wine cooler",
      "text": "Love it! I especially like the stand-up area . Does not hold the large wine bottles, can fit a few Bordeaux bottles. So far no problems. Bought extended warranty which was affordable compared to replacing unit on my own.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Phelps",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Wine lover!!!!",
      "text": "I was sick of all the wine bottles taking up room in the refrigerator so I bought this. We live in a small townhouse and this is a perfect size. My favorite is that it holds a few bottles upright in case they are open you don't have any leaks. It is very easy to adjust the temperature.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ016",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Would purchase again. Great price and lovely product",
      "text": "Purchased as a gift. The receiver loved it and even more so upon using it! It's not huge but it's a good size. Pretty quiet and the stand up bottle idea is lovely! Because once wine has been opened, you do not want it laying down!!! Such a beautiful design too.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Should've Gotten this Years Ago!",
      "text": "Love the size, style and the standing bottle feature for bottles that are opened. The temperature got down to my desired 58 degrees in only a few hours after plugging it in. I was surprised that it worked so fast since we live in hot area with no AC. (It was 90+ degrees in my home today) I couldn't be more pleased to have a 58 degree glass of wine on such a warm day. A great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "jilly bean",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Good value for the $ so far",
      "text": "This is the only one available on the market that fits in the space we have. Have had it installed for about 3 weeks and it seems to be doing ok. Stylish unit I like the vertical and horizontal storage. Only complaint/concern is it only seems to get/stay within 2-4 degrees of temp we set it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Love this fridge- buy it",
      "text": "Love this fridge- buy it!! It is exactly what it says it is, it does the job annnnnnnd it's a good looking piece to have in the dining room or kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany_H",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Temperature is not consistent",
      "text": "I bought this product over a year ago. For the first year, it was great. Then I started to notice that the fridge was unable to keep my white wines or Roses at an adequate temperature. The temperature read 54 and when you opened the bottle it was room temperature. Aesthetically it looks great but it is not functional and with a limited warranty of one year. Not worth it!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "More or less works well, stays at 55 deg ...",
      "text": "More or less works well, stays at 55 deg Fahrenheit, but every once in a while goes up to 63 deg then cycles back down to 55 deg. It should just stay at 55 deg all the time. Using indoors out of direct sunlight, constant 72 deg in house at all times - nothing to do with that.",
      "rating": 3.0,
      "verified": true,
      "author": "R. Pannini",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Bought this as a Gift",
      "text": "I bought this as a gift and the person was pleased. One perk is that it can hold a couple bottles up-right. The cooler also doesn't take up much space. A couple of down sides is that it will only accept standard sized wine bottles. We've already found an few bottle sizes and shapes that don't fit well. A wider temperature setpoint range may also be nice. All in all, a good product for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph P. Bradley",
      "helpful_votes": 4,
      "publication_date": 20130107
    },
    {
      "title": "Very nice. Temp control very easy to use and the ...",
      "text": "Very nice. Temp control very easy to use and the in unit light lets you check over your wine stock easily. I like the temp indicator that lets you know if temp is in the white or red wine range. Very quiet not much noise at all. I have purchased a second unit.. One for white wines and one for red wines. Will place the units side by side and will only take up the space of a small refrigerator unit I already have. Very satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Greg L.",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "A little larger than I expected but happy",
      "text": "I purchased this wine cooler for use in my pantry to store red wine. It was a little larger that I expected but shame on me for not thoroughly reading the product details. It is in my pantry so I don't hear any noise from it which seemed to be the major complaint people had. It looks sleek and I LOVE the fact that I can stand up open bottles of wine. This feature is very hard to find in wine coolers of this size and price range. I'd say go for it!",
      "rating": 4.0,
      "verified": true,
      "author": "Fred A.",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Great wine frig for small spaces",
      "text": "Perfect for the narrow space I had in my house. I am very pleased with it because I mostly buy small bottles of wine. The only downside I see is that even if a shelf is removed, it doesn’t fit a large bottle of wine",
      "rating": 4.0,
      "verified": true,
      "author": "Ellen G",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "but I like my white(s) and sparkling much cooler",
      "text": "I thought it would actually keep the wine much cooler than it does. I turn it down to 48, but the liquid seems much warmer. Not sure if it is the unit or the way it works, but I like my white(s) and sparkling much cooler.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt Hall",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "So far so good! My first wine fridge took a s*** after ...",
      "text": "So far so good! My first wine fridge took a s*** after 5 months so after some research I replaced it with this one. I've had it about a month and it is working great! Only complaint I would have is that it cannot cool less than about 25 degrees below the room temperature so when we get 80 plus degree days and I don't want to turn the air on I have warmer wine than I would like. I'm still very happy with it for now.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150530
    },
    {
      "title": "So far so good",
      "text": "Hesitated to purchase due to some of the reviews. So far I love this little wine fridge. Temp stays steady. What I like the most about this specific wine cooler is that you can have an open bottle , recorded of course, standing up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mcash",
      "helpful_votes": 6,
      "publication_date": 20140328
    },
    {
      "title": "Not a good product. Had this item for a few years ...",
      "text": "Not a good product. Had this item for a few years but all along never truly regulated the temperature well - at all. Always had to fiddle with a fickle thermostat - if thats what you call it. From evaluating other reviews, I though I could fix it but that would just mean putting more $ into this \"cooler\". Good luck you might get a good one maybe a bad one?",
      "rating": 1.0,
      "verified": true,
      "author": "Helena Martinez",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Standing room rack may not fit your bottles",
      "text": "Wine fridge works well but the standing room doesn’t hold our white wine bottles. We have to sit them on top of the rack instead of sliding into the holes. Otherwise the product works as described and looks nice!",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Benoit ",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Finished my wine cabinet perfectly!",
      "text": "Some reviews said the fridge was loud. We have it in a cabinet with doors vented at the back in our family room and we cannot hear it. Quickly cools to temperature settings and looks nice. Only complaint is that it was hard to get balanced. Very reasonably priced for the value.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "One Star",
      "text": "Soooo unhappy with this wine fridge. DO NOT BUY if you want an assortment of wine, champagne bottles or wider base bottles - it can not accommodate them!",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Quinn",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Doesn't last long",
      "text": "I like the look and it was great at first, but I've only had it a few months and it stopped working. It just flashes EE on the temperature window and wont actually cool anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "MacPherson",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Love it",
      "text": "Great wine cooler, and it is loved by many (guest). It keeps the bottles chilled, and I have purchased a total of three coolers for gifts. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Naturalfactual",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Keeps wine and anything you put in at the perfect temperature. We use it for salad dressing as ...",
      "text": "Keeps wine and anything you put in at the perfect temperature. We use it for salad dressing as well as wine.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene R.",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Dont buy",
      "text": "So initially this wine cooler looked and worked great. After about 6 months in use it just flat out died. The fan still works but doesn't keep anything cool. It also had a smoky smell coming from the back area. Not Happy!",
      "rating": 1.0,
      "verified": true,
      "author": "Aloha means goodbye..",
      "helpful_votes": 11,
      "publication_date": 20160825
    },
    {
      "title": "Freestanding unit not meant for enclosed space mounting.",
      "text": "Works great! Only thing to remember, this is not meant for in the counter mounting, it is meant as a freestanding unit. If you do install in an enclosed space, you must ventilate well.",
      "rating": 5.0,
      "verified": true,
      "author": "krazydaze",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Its a nice little fridge",
      "text": "Its a nice little fridge, been going strong for 6 months now with no problems. Only draw back is that it fills up fast. We found ourselves wanting to stock 3-4 bottles of wine we liked at a time and a few singles to have on hand. A 24-40 bottle fridge might be a little bit better.",
      "rating": 4.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great Cooler",
      "text": "After using this cooler for a couple of months I can say I am very happy with this product. The cooler maintains a steady temperature that is within on or two degrees of a thermometer. The cooler is much quieter than my old one and is easy on the eyes. I would recommend this cooler to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Hometown72",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "Love this little thing",
      "text": "Love this little thing , perfect for tight places or narrow spots, needs to be a little taller but not a big deal, Also doesn't hold big bottles well but works well for mechanical",
      "rating": 4.0,
      "verified": true,
      "author": "marley",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Loved tbis product",
      "text": "Wonderful wine fridge! Only complaint is that they was not a child lock to prevent little ones from opening the fridge",
      "rating": 4.0,
      "verified": true,
      "author": "Ladd family",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "The only bad is on me",
      "text": "The only bad is on me. I expected it to look nicer than it does and that was unrealistic. From a function standpoint it has been everything advertised. I saw reviews that talked about noise. I have mine sitting on a wood floor in the dining room and there simply is no noise.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Rogers",
      "helpful_votes": 3,
      "publication_date": 20150708
    },
    {
      "title": "... store all my wine and it keeps them chilled wonderfully. Definitely worth",
      "text": "Use it to store all my wine and it keeps them chilled wonderfully. Definitely worth it",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro G. Ramirez",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Temperature changes randomly",
      "text": "I’m pretty disappointed in this product. I have had it opened since Christmas Day and it seemed to work fine for about a month and then the temperatures started jumping randomly. I read through the manual but there was really nothing that could help. I would recommend finding another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric S Pfister",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Item exceeded expectations",
      "text": "I love this product because I loved the exact same one I owned before it, that finally died after many years of use. Prompt fulfillment of promises in time for my Christmas company. I have this wine cellar in my diningroom. Highly recommend the product and seller. A win win for any wine drinker.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Not good at all",
      "text": "From the moment I bought it the screen malfunctioned and the fridge Temperature kept shutting off and on. It’s now broken and doesn’t work as of 11 months. Not worth your money unless they have a warranty program. It’s basically a self now.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20191216
    }
  ],
  "product_meta": {
    "title": "Avanti 12 Bottle Thermoelectric Counter Top Wine Cooler - Model EWC1201,Black",
    "description": "Avanti 12 bottle thermoelec wine cooler\n\nFROM THE MANUFACTURER\nAVANTI 12 BOTTLE WINE COOLER",
    "rating": 4,
    "feature_bullets": [
      "12 bottles total",
      "Thermoelectric Cooling System",
      "Curved Glass Door. Defrost System: Auto",
      "Compact and Lightweight. No Vibration - Bottle Sediment is not Disturbed"
    ],
    "specifications": {
      "Product Dimensions": "20.25 x 10 x 25.25 inches",
      "Item Weight": "27 pounds",
      "Department": "Refrigeration",
      "Manufacturer": "Avanti",
      "ASIN": "B004SUXZ5U",
      "Item model number": "EWC1201",
      "Customer Reviews": "4.0 out of 5 stars837 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#142,824 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Wine Cellars",
      "Small Appliances",
      "Garden & Outdoor",
      "Home & Kitchen",
      "Freestanding Wine Cellars",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}