{
  "website_summaries": [
    {
      "verdict": "Good puppies in training will quickly suck down these small and squishy treats, making them an excellent alternative to crunchy options that take longer to ingest.",
      "pros": [
        "A large bag of soft and bite-sized mini-treats",
        "Made with real cheddar cheese",
        "Will not dry out over time",
        "Low calorie training treat",
        "Other flavors available, like salmon or liver"
      ],
      "cons": [
        "Not for grain-free diets"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "These spongy chicken-based training treats are combined with top-tier ingredients like oatmeal, blueberries, and skim milk for a healthier snack.",
      "pros": [
        "Chicken is the first ingredient",
        "Low calorie treat",
        "Includes real nonfat yogurt and blueberry puree",
        "No wheat or corn",
        "No artificial flavors, colors, or sweeteners",
        "For dogs of all sizes"
      ],
      "cons": [
        "Not for dogs on grain-free diets"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy online; very dry.",
      "text": "Having purchased a bag of these treats at a brick and mortar store I was excited to see it was available on Amazon as well. I just opened the bag from Amazon and neither myself nor my dog were impressed. They were dry and crumbly, whereas the ones I bought at a physical store had been soft and moist. It’s not convienience if the product has been somehow degraded.",
      "rating": 2.0,
      "verified": true,
      "author": "Cricket",
      "helpful_votes": 33,
      "publication_date": 20180304
    },
    {
      "title": "My dogs ate these happily. Granted",
      "text": "My dogs ate these happily. Granted, they'll eat anything. My review is based on the mold. I've never had treats that went bad. Especially only after having opened them a week prior. After a couple days, I noticed some white fuzz on a couple of the treats. I threw those out, and continued using the rest. It didn't take long before everything was covered in fuzz. I would not recommend these.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 38,
      "publication_date": 20170210
    },
    {
      "title": "My dogs love them!",
      "text": "My potty training method has always been “go potty get treats.” If they go they get one. If they don’t no dice. I have found it very effective but for obvious reasons the treats must be small. These are perfect. They are very tiny but still something my girls want as you can see in the picture. I have bought other brands of training treats that were dry when opened or quickly got dry but these arrived fresh and stay fresh. Also the bag is fairly large so it’s very economical. This is my second time to purchase these and I’m positive I will again.",
      "rating": 5.0,
      "verified": true,
      "author": "NJS",
      "helpful_votes": 7,
      "publication_date": 20190103
    },
    {
      "title": "The BEST treats, jumbo bag, great price!",
      "text": "All of my animals--dogs and cats--go absolutely NUTS for these. Even the \"picky eaters\" in our house gobble them up in seconds. The liver flavor is definitely their favorite; it has a very strong scent, which is probably why. There's definitely real liver in there! The rest of the ingredients are all good too. I've been buying these years for years and the quality is always great. A smaller bag is the same price or more at Petsmart or PETCO, so it's a great value, too. Getting this on Subscribe & Save makes it even better.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Mulholland",
      "helpful_votes": 5,
      "publication_date": 20190505
    },
    {
      "title": "Excellent Low Cal training treats",
      "text": "When I was looking for a training treat for my puppy, I wanted something lo cal since this would be in addition to her regular food (which I also use as a training treat) and meat (which is her big reward training treat). The salmon ones are her favorite! We always carry these around in a baggy (only downside is they do dry out if not in a sealed container) and use them when needed, if you have ever trained a puppy you know you go through a lot of 'treats' so being lo cal is important. My pup loves them so they get a five star review from her.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 4,
      "publication_date": 20190121
    },
    {
      "title": "Bang for the Buck!",
      "text": "We absolutely love this. From the moment my dog got a whiff of this, she was obsessed. We chose the liver flavor and can't recommend it enough. At $8 for 14oz, it's the best bang for the buck high quality dog treats on Amazon Prime (quality based on ingredients list - definitely not just filler). They're small, soft, and moist. Perfect size for training (fast to eat, low choking risk, easy to handle, not too smelly on your hands). All in all, definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bailey",
      "helpful_votes": 5,
      "publication_date": 20190203
    },
    {
      "title": "New favorite training treats",
      "text": "I am a big fan of the Crazy Dog Train Me! treats. Those have been my go-to treats for awhile. But I thought I'd give these a try because they are a few dollars less for a few ounces more. My dog loves them. Like the Crazy Dog treats, they are sufficiently stinky to get and hold my pup's attention during training sessions. They also work very well in treat dispensing toys. While I also really like the Crazy Dog product, I'll probably start buying these instead based on value.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark C.",
      "helpful_votes": 4,
      "publication_date": 20190125
    },
    {
      "title": "Arrived on time, puppy loves",
      "text": "I was introduced to these at our Puppy Obedience Training class. They are so small that you can give them A TON while working on obedience and tricks. Far superior to the small milk bones that need to be broken up! We'll use those milk bones as cookies! These do not mush or melt in your pocket or left in a hot car, also do not crumble. Excellent. He loves the smell of the liver! On our way to a well-trained dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Britterny",
      "helpful_votes": 4,
      "publication_date": 20180914
    },
    {
      "title": "Poor quality",
      "text": "We’ve used these tricky trainer treats for years for training/treating our dogs and also hiding nightly medication pills inside with no issue, but this particular bag arrived stale/poor quality. The treats weren’t soft like they have always been and instead crumbled. Both of my dogs experienced stomach issues after eating them, issues which went away when I switched to a different bag of treats and came back when I returned to this one. Unfortunately I had ordered ahead and by the time I realized the treats were bad, it was past the return window.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon W",
      "helpful_votes": 4,
      "publication_date": 20181120
    },
    {
      "title": "My Finicky Hannah Loves These!",
      "text": "My rescue dog has forgotten her lowly roots and become extremely fussy about what she will eat. And I am fussy about what ingredients go into her food and treats. This is an excellent compromise. I like the ingredients; she likes the flavor. Because they are very small, I can use them in her puzzles, or just give them to her for a random treat (she prefers small bites). This was a great find.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Mettam",
      "helpful_votes": 2,
      "publication_date": 20190713
    },
    {
      "title": "Nibbles -to tempt our noisy beasty",
      "text": "WE use these because our trainer suggested them to work with our very anxious doggie. She loves them and she responds much better to her training. They are tasty- per her response to them. She must like the flavor and the only downside at all is the smell is pretty potent even in a baggie... lol we tie them shut to make sure the smell stays away from us. Other doggies in the building love them too... They don't cause any stomach upset and that is great of course, cuz who needs to deal with that sh*t... ..... We will be buying more of these for our little pooch!",
      "rating": 5.0,
      "verified": true,
      "author": "crowgirl follower",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Dogs love them",
      "text": "Dogs love the taste and smell of these treat. I'm also happy to see quality ingredients in these. You can be happy to serve these little treats to your best pal.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 4,
      "publication_date": 20190419
    },
    {
      "title": "My dogs love these!",
      "text": "I got these as training aides along with a clicker and success was almost instant! They quickly learned to respond to my commands because they know these treats will follow. This was my 2nd order and I'm going to need more!",
      "rating": 5.0,
      "verified": true,
      "author": "Manny Camacho",
      "helpful_votes": 4,
      "publication_date": 20190209
    },
    {
      "title": "These won over our reluctant, picky rescue dog.",
      "text": "We have a rescue dog from the streets of Mexico. She has no interest in traditional dog foods or treats. It has been a struggle to get her to eat appropriate foods or motivate her with treats. We noticed she had an affinity for cheese and struggled to find a cheesy treat that attracted her. These were first and only treat that has worked so far. It is the first food she will eat from our hands.",
      "rating": 5.0,
      "verified": true,
      "author": "NorthwestMama",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "wonderful, this is the only ones i buy now can't beat price, dog loves them",
      "text": "they are the best in price, amount you get and quality, my dog loves them, they go far since big package for way less than others, I buy them two packs at a time, only ones I use now to train my duck dog. thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Derrick007",
      "helpful_votes": 4,
      "publication_date": 20181101
    },
    {
      "title": "My Dog's Favorite",
      "text": "My dog really loves these - and would do just about anything to get these as a reward. Only 3 calories a treat and quality ingredients: Cheddar Flavor (barley flour, maple syrup, tapioca starch, potato flour, cheddar cheese, glycerin, natural flavor, gelatin, salt, phosphoric acid, sorbic acid, citric acid, mixed tocopherols, rosemary). Smells like Slim Jims to me but what would a human know? The company also donates to nonprofits that \" promote the human-animal bond\".",
      "rating": 5.0,
      "verified": true,
      "author": "G. Carlin",
      "helpful_votes": 3,
      "publication_date": 20171109
    },
    {
      "title": "Great treats for training",
      "text": "My dog LOVES these. They are a great size, and a bit soft so they don't have the same issue with breakage as the more cracker-like treats I have used. I have been training dogs for a long time, and actually used to make my own training treats by cutting up liver, adding some garlic powder and drying it. Let me tell you...these save alot of time and effort and smell MUCH better. I will definitely buy more when we run out.",
      "rating": 5.0,
      "verified": true,
      "author": "Melise Gerber",
      "helpful_votes": 5,
      "publication_date": 20170112
    },
    {
      "title": "Less expensive & Just as Good",
      "text": "Don't let the smaller size bag fool you. When comparing ounce per/ounce pricing, this brand is a less expensive than bigger bags of this type of dog treat. Both my dogs love them. Great for training puppies. These are not big dog treats. Both my dogs are under 15lbs",
      "rating": 5.0,
      "verified": true,
      "author": "RickR",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "Cheaper alternative to Zuke's",
      "text": "I hate going for the lowest price / best value, but I couldn't ignore how much cheaper these are than Zuke's. My boy has been eating Zuke's for nearly a decade (they're great for training or putting into treat toys), but they've continued to climb in price every year. He loves his treat ball, so I was on the hunt for an alternative. We've now tried every flavour from Cloud Star, and he's a fan of them all! I was sad to stop supporting Zuke's (they're a great company!) but these are easier on the wallet and make my dog just as happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikola",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great for agility training!",
      "text": "My Border Collie loves these. Use in treat puzzles and during agility classes.",
      "rating": 5.0,
      "verified": true,
      "author": "DerbyCityVintage",
      "helpful_votes": 4,
      "publication_date": 20190309
    },
    {
      "title": "Perfect size",
      "text": "These are the perfect size for training. Dogs don't care how big the treat is, they just want the treat. This size allows for much training without giving them so much they don't eat their regular dog food and the bag is a hefty size compared to other training treats.",
      "rating": 5.0,
      "verified": true,
      "author": "pixie nolin",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "We love these",
      "text": "These are the perfect size and the dogs love them. We use them for our regular training sessions at home. The salmon ones do have a salmon smell I dont get with the liver ones but it only makes the dogs love them more.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystaphaze",
      "helpful_votes": 3,
      "publication_date": 20190104
    },
    {
      "title": "Will buy again! Delicious treats for dogs, low calories.",
      "text": "These treats are 3 calories or less per treat, Perfect for my mini dachshunds. Drawback--So stinky! The dogs love them but other family members objected to having to handle these treats. They do smell strongly of salmon --the dogs gobble them up! Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Atkinson",
      "helpful_votes": 2,
      "publication_date": 20190630
    },
    {
      "title": "Great Training Treats",
      "text": "My dog absolutely loves these treats. Your hands smell a little after touching them, but for me it was worth it to find a treat that motivated my picky puppy to pay attention to me. They're nice and soft, which is great for training since she didn't spend forever chewing and then licking up crumbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara",
      "helpful_votes": 3,
      "publication_date": 20180706
    },
    {
      "title": "Very picky dog LOVES these",
      "text": "I spend lots of money buying bags of treats for training my very picky Kane Korso, (all of them made in USA) it is very rare to find ones that she actually eats. SHE LOVES THESE ONES. I love these ones!! This is the first bag of soft/moist treats she has actually eaten and I’ve tried tons!! These treats made training this dog easy and affordable with how small they are/how many come in a bag!",
      "rating": 5.0,
      "verified": true,
      "author": "RyfknT ",
      "helpful_votes": 2,
      "publication_date": 20190702
    },
    {
      "title": "Great for geriatric dogs",
      "text": "Our small, geriatric dog has loved these little liver bites. They’re just the right size for her, and they’re fairly soft which helps with her teeth sensitivity. I hate the smell of liver treats, but these aren’t that overwhelming. Either way our old gal likes them & can easily chew them, so that’s a big win!",
      "rating": 5.0,
      "verified": true,
      "author": "Dora England",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "So good they're trouble",
      "text": "So good they're trouble, wait... Am I talking about the treats or the dogs?!? Both! My puppy loved these so much he stole the bag, off a high shelf none the less. We've since used some of the remainder of the treats to train him not to jump on tables (no more treat thieves in this house).",
      "rating": 5.0,
      "verified": true,
      "author": "Ross",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Good value",
      "text": "Great value, my puppy loves them! They are similar in size to other brands of training treats, same calories per treat, but a better value. My puppy likes them as much as the other treats. I cut them in half since I go through them quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 4,
      "publication_date": 20180407
    },
    {
      "title": "Awesome training treat",
      "text": "Our dog absolutely loves the flavor of these treats. They are great because you can break them into smaller pieces for little dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 4,
      "publication_date": 20190313
    },
    {
      "title": "Best bang for your buck training treats out there",
      "text": "The best bang for your buck training treats out there. Just remember to re-zip your bag consistently to keep the treats squishy. I use these with a clicker for training and they're the perfect size (not so big that my dog has to stop and lose concentration to chew ig) and my dog loves the taste. Perfect size for all of the activity/treat balls as well. Pro tip: they're so squishy you can use a few to mash around and cover a pill for your pup! Save your money on the pill pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "janewin",
      "helpful_votes": 5,
      "publication_date": 20160916
    },
    {
      "title": "Dogs love them!",
      "text": "These are a great training treat for my dogs. The smell is strong, but not gross. Clearly smells a dog would be into but doesn't make you want to gag like the smell of some treats can, it actually smells like something reasonably appetizing. But the dogs go crazy for it. Mine get bored of flavors so I like that they have a few that I can rotate so they don't get sick of any and they lose their reward status. They're also small enough that even with my dogs all under 25lbs I can still feed them a decent amount during a training session and not overdo it.",
      "rating": 5.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Good",
      "text": "I use this for work (Dog Training) and they’re a great buy. Very helpful and great looking product, definitely will buy again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "Raja Magic",
      "helpful_votes": 4,
      "publication_date": 20181028
    },
    {
      "title": "A must for hiding medication, Awesome Product!",
      "text": "We love this product! Hide my dogs medication in it and it is a winner! It is soft to mash and WONDERFUL for furBaby with an over bit or limited teeth! We keep it in the house all the time!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Juanita McFall-Bishop",
      "helpful_votes": 3,
      "publication_date": 20181109
    },
    {
      "title": "Consistently good.",
      "text": "I have used them for training treats for over two years. Very popular with the dog. The quality is consistent and they don't dry out and crumble before you finish the bag. (I give five at a time twice a day.)",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20181015
    },
    {
      "title": "Recommended for price!!! Great deal!",
      "text": "Best treats for the price! Love these dog treats! All 3 of my dogs love to train for these yummy treats! They are great because you can break them into a few pieces if necessary. They are a great deal for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 2,
      "publication_date": 20190527
    },
    {
      "title": "Puppy approved",
      "text": "Bought these for my mom’s new dog to get her a stock of treats. She uses them in their training classes, on walks, and at home. She, and her dog, love them so much that they’ve ordered more in other flavors to expand their variety!",
      "rating": 5.0,
      "verified": true,
      "author": "Meghan s.",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Give your dogs EXTRA treats they deserve to be pampered.",
      "text": "All around excellent product and a good value. My dogs love them and I don’t have to worry about rewarding them often and getting too tubby for their little joints to handle.Last thing I need is my Boston Terriers getting arthritis from being too hefty In a home with stairs.I have cushions and accommodations but sometimes they get frisky and go full on alpha and fly across the couch etc doing stunts on their own accord. Anyway...I can really depend on this brand being something my dogs enjoy and that makes me happy to give them the little extras they deserve.",
      "rating": 5.0,
      "verified": true,
      "author": "Monoceros138",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "She loves them and because they are low in calories I don't feel bad giving her alot!",
      "text": "I've been using these treats to positively reinforce my doggie (Beagle/Dachshund mix, 4 years old, 23 lbs). She loves them and because they are low in calories I don't feel bad giving her alot! They do dry out if not kept in the zipped bag, but my dog still eats it. I've also trained her to hunt these when we play hide and seek.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 2,
      "publication_date": 20190717
    },
    {
      "title": "5 Paws Up",
      "text": "Okay well \"I\" don't love it... but our jack russell/chihuahua does. These are soft enough to break into 2-4 pieces to make them last even longer. I wouldn't do that for a full-size dog, but ours is only 12 lbs and is enticed by the taste, not by the quantity. She loves these and responds very well to them (and the liver flavor, too). As the human, I like that it's made in the USA, and that the ingredients are quality and identifiable - I know I'm not feeding her toxic garbage. I now have this on subscription to receive every month.",
      "rating": 5.0,
      "verified": true,
      "author": "toxiccookie",
      "helpful_votes": 3,
      "publication_date": 20160811
    },
    {
      "title": "Great choice!",
      "text": "I bought a small package of these a week ago to make sure my pup would enjoy them, and he did! So I went straight to Amazon to grab a larger bag for him, and I’m so happy with them. They’re low calorie and I personally don’t think the salmon flavor has a harsh scent to it at all. 🤷🏽‍♀️ 10/10 recommend! 💞🐶",
      "rating": 5.0,
      "verified": true,
      "author": "Faline✨",
      "helpful_votes": 2,
      "publication_date": 20190702
    },
    {
      "title": "Great treats!",
      "text": "My dog loves these and they are half the price charged at a local pet supply store. They are a little soft and very chewable, but if the zip-top seal isn't closed properly, they get hard and dry out quickly. This is a large bag for my little guy, so I immediately transfer half the contents to a ziploc bag and seal it, then double bag that, and set aside for later use. This way my dog gets his treats nice and fresh!",
      "rating": 5.0,
      "verified": true,
      "author": "Barometer of Consumer Satisfaction",
      "helpful_votes": 5,
      "publication_date": 20160930
    },
    {
      "title": "Recommend",
      "text": "My dog trainer lady always has these on hand when she's training my dogs. I decided to buy some for myself to bring to dog training instead of using hers all of the time. My dogs love them. I cut them up into halves which allows for a little bit more in the bag. They work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 3,
      "publication_date": 20180311
    },
    {
      "title": "Good value for money",
      "text": "The treats themselves are a perfect size for training my dog and he really seems to like them (although he likes pretty much anything he can eat). Also, the bag has a lot of treats in it, so you are getting a good value for the price. Also, the bag seals nicely to keep the treats fresh and moist. Overall very happy/no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 4,
      "publication_date": 20170422
    },
    {
      "title": "Our dog LOVES these treats!",
      "text": "Our 1 year old Mini Goldendoodle will do ANYTHING for these treats. They smell very strongly of liver and are small, soft & chewy - perfect as training reward or just a treat anytime. We also put them inside his ‘Game Changer” toy (also bought in Amazon) and he flips that over & over again with his nose until the treats drop out of the holes and he gets his reward. Keeps him amused for ages. 😀",
      "rating": 5.0,
      "verified": true,
      "author": "LBlume",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Only treats my dog will eat",
      "text": "I have a Chihuahua who is somewhat picky about treats, specifically she pretty much won't eat any except these! They are super useful to push pills into as well, which is how we predominately use them (she does NOT like very many brands of pill pockets so we had to find these), and the chewiness is easy on her tiny teeth. Highly recommend. She loves the smell (admittedly it is unpleasant to me as a human, but that is to be expected with pet foods) and comes running for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190710
    },
    {
      "title": "Great for training",
      "text": "Great size and texture for training rewards. I've had a few dogs not care for them but not many. The scent isn't horribly strong compared to most treats, but still not pleasant.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Burkhardt",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "Great tiny treats for small and large dogs alike.",
      "text": "Used these for puppy training and general treats. Getting them again to use on walks. They have a strong smell that is not offensive... smells like a quality little snack and the dog loves them. They are very effective motivators even with just one or two little nibbles. (Don't be like my dad and give the dog a giant handful... that's not the point. these are potent training snacks. lol.)",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Bearable smell",
      "text": "I bought two different kinds of treats at the same time and must say I prefer these to the other (although I can't attest to the taste). When I close the bag, I am not hit in the face with a nauseating smell which I very much appreciate. My 4 month old pup loves these as well so we are both happy customers.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie J Wright",
      "helpful_votes": 2,
      "publication_date": 20190511
    },
    {
      "title": "Small, perfect size for training. You don’t have to keep breaking pieces off a large treat.",
      "text": "I’m writing for my dog as he dictates. He says he really likes these treats. It’s annoying that my mom has to keep reminding me of my manners, but at least I get a treat and keep her happy.",
      "rating": 5.0,
      "verified": true,
      "author": "BookaholicTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20180807
    },
    {
      "title": "These treats are lit 🔥",
      "text": "My border collie asked me to get him some new treats. So we decided to try out the tricky trainers salmon flavored treats. I told him I would only buy them if he took his training seriously and let me tell you he loves them so much that he’s kept his promise. He wants more and more treats, he’s even willing to do backflips for them. I told him he can’t get greedy so that’s enough for today. Hope I don’t cave into the level 10 puppy eye stare he is currently giving me.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Oteo",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Kai-approved, mom-approved.",
      "text": "These are very similar in flavor (that's right, I tried it) and smell to Beggin Strips, but the ingredient list is much better. All the meaty, cheesy, soft-chewy goodness, without the carcinogens and dyes. Happy mom, happy pup.",
      "rating": 5.0,
      "verified": true,
      "author": "Daifan",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Would purchase again",
      "text": "Very small treats. Puppy loves them. A lot in the bag. Will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenda",
      "helpful_votes": 4,
      "publication_date": 20180829
    },
    {
      "title": "Dog begs for these loves them....",
      "text": "The treats are just the right size and my dog absolutely loves them and she knows when I get the bag out and sees it she runs for it and begs for them. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lana",
      "helpful_votes": 2,
      "publication_date": 20190618
    },
    {
      "title": "Despite the convenience and great price, I won't be purchasing from this distributor ...",
      "text": "I purchase these treats regularly for my dog at a local pet store and through Amazon, and new bags usually contain extremely soft and fresh treats. My dog would do anything for one of these. I recently ordered a pack of two from this distributor, and noticed that the treats seem to be much harder/a different texture that my last few bags, and seem stale. Despite the convenience and great price, I won't be purchasing from this distributor again.",
      "rating": 1.0,
      "verified": true,
      "author": "Courtney Litman",
      "helpful_votes": 4,
      "publication_date": 20170613
    },
    {
      "title": "My two pups are VERY happy with these treats",
      "text": "My two pups are VERY happy with these treats! The ingredients aren't bad either, and I find I can tear each treat into a few pieces to make a little really go a long way! I find they are EXCELLENT for training. They have a smell to them my dogs just are addicted to, and their easy to tear little pieces off so that my dogs get just a taste and then want to keep working to get more. They scent is also very useful when doing distraction work, as tey are very enticing to dogs!",
      "rating": 5.0,
      "verified": true,
      "author": "Ravyn",
      "helpful_votes": 4,
      "publication_date": 20160621
    },
    {
      "title": "Got my Lab through training class",
      "text": "I adopted a 14 month old yellow lab and training was a bit of a challenge with standard/normal treats. She really loved the flavor of these treats and would do anything for them. They get your hand a little greasy, but that's a small price to pay. We were able to finish our 8 week obedience class using these treats. Although I did use 3 bags. Good thing they are low calorie.",
      "rating": 5.0,
      "verified": true,
      "author": "Metza",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Dog likes them",
      "text": "They are a nice small size for puppies and small dogs. All three of our dogs seem to like the flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "KariTurk",
      "helpful_votes": 3,
      "publication_date": 20190108
    },
    {
      "title": "Great treat very fresh and my dogs love them!",
      "text": "My dogs love these insanely!!! They do smell delicious lol great training treats!! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jahoo",
      "helpful_votes": 3,
      "publication_date": 20190105
    },
    {
      "title": "Dogs love them!",
      "text": "These little treats are great for training! Both of my dogs love them (and one dog is very picky about treats). They are big enough that the dogs feel rewarded but small enough that you can give them several (if training) without worrying about excess calorie intake.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 3,
      "publication_date": 20180128
    },
    {
      "title": "Only treat my 10lb dog with only one tooth will eat!",
      "text": "It was such a heartbreaking and frustrating battle to get dog's (what will be lifelong) 11 doses of different eye meds daily. Then I offered her 2 of these treats after a dose and from that moment on she gets excited at eye drop time and is totally cooperative!! BEST TREAT EVER FOR US! Sure changed our lives!!!! Cannot say thank you enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Joan Anderson",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "Wholesome ingredients=happy dog",
      "text": "My chihuahua is very picky! I’m working on training him and didn’t want the treat to be too big or take him too long to chew. From the moment I opened the bag he was hooked. The smell is not too strong and he is able to chew it with ease! He is working on losing weight and this is a great treat to assist with his weight loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Sotelo",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Dog loves it.",
      "text": "My dog loves these treats, she is blind and she has no trouble at all to find them. She is always happy to have them.",
      "rating": 5.0,
      "verified": true,
      "author": "Laetitia Loretan",
      "helpful_votes": 4,
      "publication_date": 20181101
    },
    {
      "title": "Keep the bag sealed",
      "text": "My dog loves them and I like that they're small for training and easy to break in half, but if you ever leave the bag open, they get stale and rock hard so they're a little annoying",
      "rating": 4.0,
      "verified": true,
      "author": "becca",
      "helpful_votes": 2,
      "publication_date": 20190301
    },
    {
      "title": "Stinky dogs love these stinky treats",
      "text": "My dogs love these treats so much. They smell terrible to me so I guess that means they smell delicious to dogs? I accidentally got the salmon because I wasn’t paying attention but my dogs are really happy with these treats. They’re the perfect size for training my puppy and rewarding my little dog who is obsessed with treats.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa ellery",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "My dog LOVES these!",
      "text": "My dog is not terribly food-motivated, so it's been hard to train him with other treats. He LOVES these and will do almost anything for them. We bought two flavors, and we mix them together. He can't get enough of them. I love the size - nice and small so you can use a lot of them, but large enough so he can catch them and find them if they fall on the ground.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Ryan",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "My dog eats them.",
      "text": "I have a 8 pound min pin and I cut these small treats into half, and give them as snacks. She thinks she's getting more, by getting more, smaller sized bites. She will eat just about anything, but the ingredients in these treats are better than some of the other treats, that go for around the same price. I would order these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sleepy Eyes",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Small but don't crumble in your pocket.",
      "text": "These are my favorite little training treats. They are big enough to entice my big dogs and small enough not to fill them up quickly (not that I'm sure that could ever happen). But my favorite part is, I can put them in my pocket and I don't end up with a crumbled mess like many treats. I'm very happy with my monthly subscribe & save orders.",
      "rating": 5.0,
      "verified": true,
      "author": "CDS",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Great tool",
      "text": "My Lab loves the taste and was willing to listen, learn and remember directions and commands almost immediately with the treats.",
      "rating": 5.0,
      "verified": true,
      "author": "TF",
      "helpful_votes": 3,
      "publication_date": 20180922
    },
    {
      "title": "Excellent pocket training treats",
      "text": "We purchased these to help train our dog during walks. They're small, relatively low calorie, and very effective. This is the highest value treat we routinely bring on walks. In fact, they're so high value, we often cut them in half before we go out. The only big note, is that you must make sure to reseal the bag, otherwise they dry out and your dog may no longer love them.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Trevino",
      "helpful_votes": 3,
      "publication_date": 20170217
    },
    {
      "title": "My dogs love these treats",
      "text": "My dogs love these treats! You can squish them flat super easily without them falling apart and split them in half as well. Great size for training and super delicious. The liver is, by far, my dog's favorite but the other ones are good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 3,
      "publication_date": 20180316
    },
    {
      "title": "GSD loves them",
      "text": "Our GSD seems more motivated by these than brands we've used previously. We bought the liver flavor. They're good size, and soft, in case your dog doesn't fully chew treats during training.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180820
    },
    {
      "title": "They're Great",
      "text": "The pups love these. I've been using them for clicker training, but I cut them up since my dog is on the smaller side and I don't want to overload him with treats when training. There's a really decent amount in the bag already, but cutting them up has made the bag last a really long time. The smell reminds me a lot of Beggin Strips, which is a strong, but not unpleasant smell. The dogs certainly seem to like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Good treats",
      "text": "Just got a small Pomchi, who needs a lot of training/re-training. He LOVES these treats. He is so small I cut them up, but for a bigger dog, they would be perfect as is.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Witham",
      "helpful_votes": 3,
      "publication_date": 20180608
    },
    {
      "title": "Pug loved these",
      "text": "Pug puppy loves these, made training much easier. Will be buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "KR",
      "helpful_votes": 3,
      "publication_date": 20190118
    },
    {
      "title": "Perfect for puppies or small dogs",
      "text": "Got these to start out with my new German shepherd puppy and they worked great, but for him they’re pretty low value compared to other treats so I would recommend these for new puppies to use without giving other treats before or to use as a low value treat during training. They’re nice and small so they’re perfect for small dogs and they’re nice and soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Low calorie great for a food hound",
      "text": "The dog loves them I use them to lure the dog with a low calorie but delicious treat! I also stuff the bottom of the Kong ball with these!",
      "rating": 5.0,
      "verified": true,
      "author": "Marg",
      "helpful_votes": 3,
      "publication_date": 20181001
    },
    {
      "title": "Not for sensitive stomachs/puppies?",
      "text": "Gave less than 10 of these treats to my 15 week old puppy, and she had diarrhea for a day and a half. We had to change her normal food just to get her to have solid poops again. I would double check the ingredients with your vet before use because it’s safe to say we have stopped feeding her these. I was really excited to try these treats as they weren’t too high in calorie compared to other training treats. The package came as pictured, but the treats were bigger than I thought they’d be. They smelled tasty and flavorful, so I’m sad they didn’t work out for our girl.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Fouts",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great for small rewards!",
      "text": "Love these! My dog can be reactive on walks and so I carry these in my pocket to reward/ distract her! She loves them!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaymi N. Plank",
      "helpful_votes": 4,
      "publication_date": 20181025
    },
    {
      "title": "Our dogs love these",
      "text": "Our dogs love these. We use them in our Furbo treat tossing monitor. If you don't have a Furbo, get one and use these treats. 2 Maltese and 1 Toy Poodle",
      "rating": 5.0,
      "verified": true,
      "author": "Tony D",
      "helpful_votes": 3,
      "publication_date": 20180623
    },
    {
      "title": "Pup doesn’t like",
      "text": "Pup doesn’t like. They don’t stay soft and fresh in the small sealed plastic containers I use to carry treats with me and have around the house for training. I’ve thrown out a lot of these treats because they don’t hold their moisture and pup. I longer has any interest in these treats.",
      "rating": 2.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "👍",
      "text": "Our picky eater Chihuahua loves them! They're still a tiny bit bigger than I would like for her, she is 11lbs. They are soft enough I am able to put her Zyrtec pill in them and mold the treat around it which is great because she won't eat pill pockets. I'll definitely be purchasing again!",
      "rating": 5.0,
      "verified": true,
      "author": "Rowan O.",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Perfect for training bribes",
      "text": "Great value for the price. I have always used these since my cockapoo was a pup and they worked great for training. He especially loves the liver flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 3,
      "publication_date": 20180601
    },
    {
      "title": "My two toy poodles love this snack",
      "text": "My two toy poodles love this snack! My poodles are small and this snack is soft and easy for them to chew. Great price! I paid as much for half as much at my local store.",
      "rating": 5.0,
      "verified": true,
      "author": "rms",
      "helpful_votes": 3,
      "publication_date": 20180430
    },
    {
      "title": "Works awesome",
      "text": "Amazon asked me to rate the flavor and scent of this product. To me it smells terrible and tastes even worse!!! BUT to my dogs.. they go nuts over this stuff. I use these for training a border collie, a pit bull, and a chihuahua, and they all respond the same way to a single little morsel, so they must think it's great, that's what matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "My dog loves this",
      "text": "I have an almost 12 weeks mini golden doodle and we are teaching him some commands. He loves this, I cannot tell if the quality is good nor if the flavor is good, but I can say that he love them. Will recommend them Also I like the fact that they are low calorie.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sada",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Great training treats!",
      "text": "My 1-year old GSD loves these while training! Small enough to minimize choking but the taste and smell is strong enough to keep pups motivated.",
      "rating": 5.0,
      "verified": true,
      "author": "naturally",
      "helpful_votes": 3,
      "publication_date": 20181106
    },
    {
      "title": "Good treats.",
      "text": "Goods treats, but I don't eat them. My dog will eat any treat anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Green",
      "helpful_votes": 3,
      "publication_date": 20181127
    },
    {
      "title": "Good treats for my good dog",
      "text": "My dog wrote a lengthy positive review for these treats but then she deleted it by mistake (blame her IT trainer, no the dog). These treats are nice and soft so are good to rip into smaller pieces for training and for older dogs with few or bad teeth. They are not greasy or stinky so easy to carry in a treat pouch and don't gets human hands sticky icky. Good price, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheff Jeff",
      "helpful_votes": 3,
      "publication_date": 20161119
    },
    {
      "title": "Great for dogs without teeth",
      "text": "These are great treats especially for dogs without teeth, It's something soft and chewy for them, and no big deal if they swallow it whole. their small, so you can use a bunch if your dog is more treat motivated without a lot of worry. really the only thing I would like better is if the zipper worked a little better, because once they dry out, not so great for dogs without teeth. I just put them in a separate container at this point.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Sterling",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Good and Not so Good",
      "text": "Dogs love them, great for occasional treat. a treat for training probably not that good. 1- they are a little bigger and for training they would be almost a meal. They break but it's not easy, they are hard crumbly when breaking so you end up with a lot of crumbs and odd sized pieces. ( this just might be me but it's a mess by the time I try and break them up)",
      "rating": 5.0,
      "verified": true,
      "author": "gpawlow",
      "helpful_votes": 3,
      "publication_date": 20170105
    },
    {
      "title": "use these often but not every day",
      "text": "the dog loves these and they are small brought to fit in her exercise ball",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "My dog goes crazy over these",
      "text": "These smell strongly like liver which makes them very effective for training. My dog is crazy about them. I hide them in pockets in a snuffle mat and my dogs unloads his energy by hunting them. He can't find the scent of other treats as easily when we use the snuffle mat. I'm on my third bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly Rice",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Great treats from a great company",
      "text": "My dog has issues with wheat and corn and so these treats are great. I've used the liver variety for quite a while and wasn't sure he'd like the salmon but he likes these just as well. They are a nice small size, so if you have a dog that you need to count calories for, this is nice as it's a tasty treat but small in size.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 3,
      "publication_date": 20170317
    },
    {
      "title": "Great training treats",
      "text": "I am working with a dog trainer on our yellow lab puppy. He is an absolute pain but cute. He is motivated by food and these treats are perfect. He loves the taste and responds well the nuggets. Because they are small, I can give him a lot while training him.",
      "rating": 5.0,
      "verified": true,
      "author": "Trade Wind Products",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great for Training and good quality product.",
      "text": "This is perfect for my furry clients. I use these when I dog walk. Fast shipping too.",
      "rating": 5.0,
      "verified": true,
      "author": "Wishbear1215",
      "helpful_votes": 2,
      "publication_date": 20190610
    },
    {
      "title": "My Beagle loved this one but I couldn't stand the smell of ...",
      "text": "I typically get the liver flavored one but decided to try this one. My Beagle loved this one but I couldn't stand the smell of it so back to liver flavor it is :)",
      "rating": 5.0,
      "verified": true,
      "author": "Rashid",
      "helpful_votes": 3,
      "publication_date": 20180413
    },
    {
      "title": "Very good product for dogs",
      "text": "Our furry babies liked it from the first bite! Excellent quality and well-packed! Worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Lana Z.",
      "helpful_votes": 2,
      "publication_date": 20190602
    },
    {
      "title": "Dogs test, mom approved.",
      "text": "Dogs love them. They're easy to break and use for treats while walking and training.",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Perkinson",
      "helpful_votes": 3,
      "publication_date": 20181204
    },
    {
      "title": "highly recommend",
      "text": "my 11 week old cavapoo loves these! i got him when he was 9 weeks old and very picky -- he would not eat crunchy treats. as soon as i bought these for him, he loved them! because they aren't puppy treats, i do cut them into thirds so that they are only 1 calorie (since, because we are in the training stage, he is given at least 2-3 per day, and 3 calories per treat for a 3 pound puppy is a lot of food!). my older/bigger dogs love these treats too. the liver flavor is popular with almost all dogs.",
      "rating": 5.0,
      "verified": true,
      "author": "DanielleTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20170424
    },
    {
      "title": "Dog really likes them, and there's a lot in here",
      "text": "Dog really likes them, and there's a lot in here. It's really good for being able to reward my dog without having to give him a ton of food or spend a lot of money.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Sperling",
      "helpful_votes": 3,
      "publication_date": 20180401
    }
  ],
  "product_meta": {
    "title": "Cloud Star Tricky Trainers Chewy - Soft Low Calorie Dog Training Treats",
    "description": "Flavor Name:Cheddar| Size:14oz.We’ve got the perfect trick to train your dog: Cloud Star Tricky Trainers Chewy Dog Treats. Reward your dog with delicious flavors and ingredients that are actually good for him. We use simple ingredients that include and healthy whole grain to make these dog treats. Then, we leave out artificial colors and flavors and fillers like corn, soy and white potatoes. The results are delicious dog biscuits that will make your dog’s tail wag.\n\nEach puppy training treat is oven baked right here in the USA. Tricky Trainers are sure to make your pup drool over delicious flavors, like Liver, Salmon and Cheddar.\n\n• Only 3 kcal per treat \n• Never any artificial flavors\n• Used by professional trainers\n• Official training treat of AKC Good Citizen Program\n• Wheat and Corn free\n\nGive your dog Cloud Star Tricky Trainers Chewy Dog Treats for a crave worthy and effective training treat with the ingredients you want for your dog.\n\nAMAZON.COM\n\n\nYour Name Here \n\nExplore Cloud Star’s complete line of\nall-natural pet products!\n\nALL NATURAL DOG TREATS:\n\nOriginal Buddy Biscuits\nThe original low allergen dog treat.\nBacon & Cheese • Roasted Chicken • Molasses • Peanut Butter • Veggie • Sweet Potato\n\nSoft & Chewy Buddy Biscuits\nQuite possibly the best soft dog treats ever, with low fat options.\nGrilled Beef • Bacon &Cheese • Roasted Chicken • Duck • Peanut Butter • Lamb • Sweet Potato\n\nItty Bitty Buddy Biscuits\nSmaller sized Original Buddy Biscuits, with the same big taste.\nBacon & Cheese • Roasted Chicken • Molasses • Peanut Butter • Veggie • Sweet Potato\n\nBake at Home Buddy Biscuits\nEvery good dog deserves freshly baked dog treats.\nCheese\n\nChewy Tricky Trainers\nThe perfect chewy training treats - free of corn and soy.\nCheddar • Liver• Salmon\n\nCrunchy Tricky Trainers\nThe perfect crunchy training treats - free of wheat, corn and soy.\nCheddar • Liver • Salmon\n\nProvenance\n100% Grain Free, wholesome treats.\nCheese & Potato • Chicken & Potato • White Fish & Potato\n\nMuttos\nTwo delicious flavors in every treat.\nOatmeal & Blueberry •Peanut Butter & Green Apple\nTurkey & Cranberry • Duck & Sweet Potato\n\nTrail Hound\nLow fat dog snacks, rich in vitamins, minerals and antioxidants.\nYogurt, Apple &Banana • Peanut Butter • Chicken & Sweet Potato\n\nKing Voltaire Natural Dog Treats\nWholesome, delicious, and fun natural treats.\nChicken Pot Pie\n\nKing Voltaire Soft & Chewy\nSoft and chewy treats, made with natural ingredients.\nMacaroni & Cheese •Peanut Butter & Jelly • Chicken Pot Pie\n\nALL NATURAL GROOMING PRODUCTS:\n\nBuddy Wash\nGentle two-in-one shampoo + conditioner\nLavender & Mint • Rosemary & Mint • Green Tea & Bergamot\n\nBuddy Rinse\nDeep conditioner, leaving coats shiny, soft and tangle free.\nLavender & Mint\n\nBuddy Splash\nSpritzer and conditioner, perfect for lasting freshness.\nLavender & Mint • Rosemary & Mint • Green Tea & Bergamot\n\n\n\nChewy Tricky Trainers are just the trick to train your dog! \n\nChewy Tricky Trainers are just the trick to train your dog. They’re small enough to fit in your hand for easy rewarding, but big enough on flavor to keep your dog’s attention. These chewy training treats are made in the USA with natural and wholesome ingredients, and are free of wheat,corn, and soy. Low fat and low calorie, Chewy Tricky Trainers are ideal for small or older dogs, work well with treat-dispensing toys,and make a great snack, anytime! Available in three mouth-watering flavors, it’s the treat with no hidden trick except tastiness! \n\n\n\n\n\nPromoting Dog Happiness...\n\nFor more than a decade Cloud Star has been producing all natural and wholesome products for dogs, even those with allergies.\n\nThe company got its start in 1999 when Jennifer Melton and Brennan Johnson adopted their dog Samantha. She was a picky eater, and because they could not find a commercially available treat to satisfy her finicky palate and yield to her allergies, they ended up baking their own. When they whipped up a batch of Samantha’s low allergen dog treats for a local animal shelter fundraiser, the treats were a huge hit and people started calling wanting more.\n\nBeginning with Buddy Biscuits, Cloud Star has since expanded to include a wide variety of wholesome and natural dog treats, grooming products,and Wag More Bark Less® merchandise. Simple, easy to read ingredient statements resonate with pet parents and thrill dogs with even the most finicky palate. Our treats and grooming products are made in the USA,with only first-quality ingredients.\n\nThe company has come a long way since the first batch of Buddy Biscuits was born in the home oven, but we remain committed to providing our customers with the most wholesome and natural products available.\n\n\n\nGiving back, thanks to you!\n\nAs part of Cloud Star’s commitment to giving back, we have pledged to donate at least 10% of our net profits to nonprofit organizations that benefit animals, women, children, and the environment. It’s a simple premise that can provide incredible results.\n\nOur green way of thinking has been in place since we started business in 1999, and we remain committed to being good corporate and environmental stewards. We aren’t doing these things because they are trendy, rather we feel that, in the current state of the world, this is the only way to conduct business. We too have children to whom we want to leave a world that is a little better than we found it.",
    "rating": 4.7,
    "feature_bullets": [
      "TOP QUALITY DOG TREATS – Your dog deserves the best, so feed him delicious, simple ingredients, including cheddar cheese.",
      "NO UNNECESSARY FILLERS – We skip the artificial colors and flavors and fillers like corn, soy and white potatoes and stick to nutritious ingredients your dog craves.",
      "HEALTHY WHOLE GRAIN – Treat your dog with these dog treats that include whole grain.",
      "PERFECT PUPPY TRAINING TREATS – Reward good behavior & tricks without spoiling their diet with unnecessary extra calories.",
      "DOG TREATS BAKED IN USA ONLY – Oven baked in the USA, these dog treats will make your pup’s tail wag."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.25 x 2.5 x 9 inches; 14 Ounces",
      "Item model number": "16102",
      "Date First Available": "September 10, 2010",
      "Manufacturer": "Cloud Star Corporation",
      "ASIN": "B0042RIOPK",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Treats",
      "Dogs",
      "Pet Supplies",
      "Cookies, Biscuits & Snacks"
    ],
    "price": 12.45
  }
}