{
  "website_summaries": [
    {
      "verdict": "If you need an external hard drive that is as durable as it is speedy, this rugged StoreJet is the model for you.",
      "pros": [
        "Built with 3 layers of shockproof protection",
        "Slim profile, yet high-storage capability",
        "Moves large amounts of data quickly",
        "Auto backup feature",
        "Available in purple and blue"
      ],
      "cons": [
        "Its USB cable is a little on the short side, but it works just fine"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I now own 6 of these and they're the best!",
      "text": "I started buying these drives a few years back. Started with a 1 terabyte, I have several 2 Ts and now just purchased a 4 terabyte. I do a lot of video work, so video files and projects are enormous. I've literally hauled these drives around the world in my bags. They are sturdy, durable and I have never ever had an issue with any of them. They've never crashed. They've always performed. This is the only brand of external hard drive I purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "John M.",
      "helpful_votes": 16,
      "publication_date": 20190302
    },
    {
      "title": "Drive lasted just long enough to be ineligible for return.",
      "text": "I bought this on October 10. Today, January 23, 2018 the drive failed. Windows Diagnostic confirms it is a failure in the drive, with a message recommending I back up my files. Support on this drive ended last month. Yay.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric in Central California",
      "helpful_votes": 18,
      "publication_date": 20180123
    },
    {
      "title": "Nice durable drive",
      "text": "This is my second one, as a mac owner the first thing to do is reformat. Shows up in NTFS and without the proper driver the mac can only read. Easy enough to open disc utility and change to MS-DOS (FAT) aka Fat32 or ExFat for files over 4 GB such as programs that are memory hogs. Plenty of space to back up your computer and bring a few thousand hours of TV shows, Movies, Audio files everywhere. Also to back up the ol' digital camera! Having had the previous one for almost a year, it has survived drops, splashes and vibration without a hitch. Can't beat the price or the standard MicroUSB 3 cable that comes with.",
      "rating": 5.0,
      "verified": true,
      "author": "AJrhymeswithhay",
      "helpful_votes": 33,
      "publication_date": 20150122
    },
    {
      "title": "Very difficult to use, incredibly slow",
      "text": "This is the worst backup drive I've ever seen. It is *very* difficult to figure out how to use; it is hands-down the most user-UNfriendly and least intuitive device I've ever owned. It also takes 3-5 times longer to complete the backup than any other drives I've used. I had to leave it over night to get a complete backup because it just took so many hours. By comparison, my older Toshiba drive can back up my entire system in about 2 hours. I would never recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex (mouse)",
      "helpful_votes": 18,
      "publication_date": 20160711
    },
    {
      "title": "It made of sturdy material which looks like it could withstand being dropped",
      "text": "It’s tiny, it's portable, and it’s powerful! It made of sturdy material which looks like it could withstand being dropped. (That alone is tremendous, drop a smartphone or any other electronic device without a good protective case & it's a wrap...) It's easy to set up, it copies quickly, and it has a tremendous amount of memory. I have had big book sized storage units which were slow & complicated, and eventually crashed & stopped working. I don't know how long this will last, but so far it seems much better than the huge expensive paperweight storage monsters I had in the past. Plus again I can carry this in my pocket, it practically the size of a fat phone.",
      "rating": 5.0,
      "verified": true,
      "author": "ACE JOHNSON",
      "helpful_votes": 2,
      "publication_date": 20180405
    },
    {
      "title": "Incompatibility with \"Windows7 Backup\": I/O error 0x8078002A",
      "text": "I own more than 6 Transcend StoreJet HDDs. Generally they work very well. But . . . For the Transcend StoreJet HDDs larger than 2.5TB, there is an incompatibility with \"Windows7 Backup\". Attempting to run \"Windows7 Backup\", always gets I/O error 0x8078002A after about 20 minutes of processing on 3TB and 4TB StoreJets. I tried to phone Transcend at 714-921-2000, but they never answer the phone. They do answer emails, but their suggestions do not comprehend the problem nor fix the problem. So, as long as you don’t try to run Windows 7 Backup, the HDD works nicely.",
      "rating": 3.0,
      "verified": true,
      "author": "Craig Marco Polo",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Two of these; both failed",
      "text": "I bought two of these. Both failed - not in the drive - which is a solid Western Digital hard drive - but in the cheap, junk SATA to USB adapter that Transcend uses. Those parts just FAILED - in both drives. Transcend web site is a joke. No phone number - long-winded runaround to even make an inquiry through a form. Just a waste of time. Don't buy this after-market packaging wrapped around a Western Digital drive. Just buy the WD in the first place.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Bailey",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Amazing how powerful this little drive is",
      "text": "Amazing how powerful this little drive is!! I used to have a portable drive that had to be plugged into the wall and another plug I to the computer making it so bulky and heavy and taking up more space to store when not in use. I hated having to drag it out and use it. But this works amazing and is fast and is so small to store. Makes backing my computer up so much easier!! Wish I had this one first!!! This is solid too not flimsy and the rubberized edges is great so it doesn't slide around. VERY HAPPY!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Antoinette P. Schukay",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Recommended backup drive",
      "text": "This is the 6th one I have puchased over about the past decade. Use them for periodic full disk backups. Speed seems fine. Our main need is a drive that is reliable and can take some minor abuse from being transported from office to backup location. Have not used accompanied software - preferred Redo or Macrium. Both of those work well for our needs. Don't know how well drive would work in daily use, especially given the micro B connectors which are notoriously finicky. Have never needed tech support, so I can not rate that.",
      "rating": 5.0,
      "verified": true,
      "author": "WeatherGeek",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Not compatible with Mac",
      "text": "I have a couple of other Transcend storage devices, which work fine. The comparison chart doesn't indicate what operating systems this model is compatible with, but when I could move files to the HD, I went to Get Info and saw that it's formatted for Windows. That should be clearly stated somewhere.",
      "rating": 2.0,
      "verified": true,
      "author": "Santa Fean",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Stopped working after 2.5 years",
      "text": "I spent the money on this because it came highly recommended. It worked well generally, but stopped working suddenly after 2.5 years.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer - Foxy",
      "helpful_votes": 3,
      "publication_date": 20180802
    },
    {
      "title": "YES MY FAVORITE EXTERNAL HARD DRIVE",
      "text": "I have been buying Transcend for 12 years now. Ever since my WD, Seagate and other stupid external hard drives wiped out, Transcend never let me down. It is my number one external hard drive I recommend it to all my friends and family. I even buy them as gifts because it is so reliable. I never ever had a problem with Transcend's External hard drive ( I have bought most of their different hard drives and they are all amazing). I am never going back to WD or any other external hard drive. If you are looking for a hard drive, this is the one to buy. It won't let you down.",
      "rating": 5.0,
      "verified": true,
      "author": "Eli",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "My picture backups. (Cheaper than cloud storage)",
      "text": "Alright, so I have tons of pictures of my 3yo son that I wouldn’t want to lose. So I bought two of these (blue & purple). One disk, I keep at work. One I keep at home. Every now and then, I rotate them. It is my way of keeping my stuff safe against distasters. I am fully aware of the invention of cloud storage. Don’t get me wrong. I also use iCloud & Amazon Cloud. But if you think of it, these disks are way cheaper! They will last for 3 years, that is a lot of monthly payments for cloud storage. And god knows what happens to those.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Beautiful!  It is small and responsive!",
      "text": "Beautiful design and color. Since some reviewers mentioned various cables and software, I wanted to say that what is in the box is exactly what the listing says: StoreJet 25H3P USB 3.0 portable hard drive Warranty Card Quick Start Guide USB 3.0 Cable The cable is a conventional one, not double USB. I have been helping a friend with a book and had multiple versions of edits and wanted to give her all the files on one drive in her favorite color. So, I installed the files and have to say, the plug and play worked like a dream, everything was smooth and I have no doubt that she will appreciate this gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Iconoclast",
      "helpful_votes": 2,
      "publication_date": 20150517
    },
    {
      "title": "Good unit or just defective model?",
      "text": "I was hoping to find a good external hard drive for my travel purposes between college and home, file transfers and games and the like. Upon unboxing this item I was pretty excited to plug it into my laptop and get everything backed up, but.. There was nothing. Fast forward about a week into my classes and I bring it in during tech labs to see what the prof thinks, and the general consensus I got from him was that the innards were fried beyond repair.. Not sure if it was an issue in manufacturing or shipping, but either way I'll be needing to find a new hard drive.",
      "rating": 1.0,
      "verified": true,
      "author": "Roman Powers",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Six months to the day, it's a brick.",
      "text": "Six months to the day, it's a brick. Not dropped or abused in any way. Cannot get the product to respond on multiple PC's or devices. $10/month is hardly great value.",
      "rating": 1.0,
      "verified": true,
      "author": "Slartibartfast",
      "helpful_votes": 15,
      "publication_date": 20150426
    },
    {
      "title": "It doesn't work!!!!!",
      "text": "After having trouble getting it to show up on my computer I searched the internet, many many more people are having the same trouble and there isn't an answer that works. I spent 79 dollars on a product that is worthless. Just so disappointing, I thought it would back up my system but my system doesn't recognize it, I tried drivers, mapping, but nothing works.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "The power supply via USB is great as one does not have to 'fiddle' with a ...",
      "text": "This is my backup drive. My computer (windows 10) recognized it immediately and it loaded quick - several hundred GB. The 3 TB should handle ALL of anyone's 'critical' files and the USB 3 is fast and the unit is extremely rugged. I did buy a rugged case to ensure even if its dropped there will be no damage. The power supply via USB is great as one does not have to 'fiddle' with a power supply and associated cables.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "So good I bought another one!",
      "text": "I own two of these and I really like them! I use them with my Mac and pc. They are bus powered which is nice, I've had no issues with the cable or the port, data transfer is fine as I'm using USB 3.0, and they seem really durable. I've dropped one once or twice when cleaning/rearranging my home studio and it still looks and acts new. A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Cameron S",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "This Unit Was Defective",
      "text": "I tried this on three different laptops. In each case it powered up upon connecting but failed to detect it at all. I consider it to be defective and returned it. Too bad because these are great tough little portable hard drives are usually nevertheless reliable.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian M. Edwards",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Failed after 2 years of bi-monthly backup use.",
      "text": "Drive has failed after 2 years of use. Unable to recover the data. You would hope a backup drive would last longer than 2 years, disappointed. Never will buy Transcend drive again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike G",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Sort of works, but slow",
      "text": "Took 12 hours, but it let me copy about 400 GB of data. On the second time I've connected it, it spins, but won't mount. I'd used Trascend flash media in the past, but I guess I'll go back to known brands for hard drives. ETA: It mounts now, almost every time it's connected, but it's still the slowest drive I've used. It takes at least 10 times longer to copy the exact same set of files as the two other drives I regularly use. Various Macs, 10.7 and up, most USB2. Still a regretted purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Arnett",
      "helpful_votes": 20,
      "publication_date": 20140617
    },
    {
      "title": "Fast, Durable, and a Great Price!!",
      "text": "This is an incredibly durable and fast hard drive! For the price it's a STEAL! I used this for my school work, because as a design student my files were huge and the drive never failed me. It transfers files fast. It is also very durable and withstood many drops on the floor. I've had it for 3 years now and it works as well as the first day I bought it. As a bonus, purple is my favorite color!",
      "rating": 5.0,
      "verified": true,
      "author": "that_cats_meow",
      "helpful_votes": 0,
      "publication_date": 20160116
    },
    {
      "title": "Works just as expected (even with Linux!)",
      "text": "This works just fine for me. I put tech support at 3 stars simply because I didn't use it. I did not measure transfer speed (yet), so can't really say much on that front, other than to say I was not at all displeased with the speed while transferring a large volume of information.",
      "rating": 5.0,
      "verified": true,
      "author": "The Duke",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Not transcending expectations",
      "text": "Nice compact size external storage unit. Biggest drawback is that it does not perform as it claims. There have been times when I have not been able to get the product to back up my laptop or save files to the product. One button push also has not worked to backup my laptop.",
      "rating": 3.0,
      "verified": true,
      "author": "Honest Reviews",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "OK but does not play well with others",
      "text": "I originally gave it a 5 star and dropped it two 3. Transcend drives do not play well together. I have 3 of them 2 x 3TB 1 X 2TB and they will not all 3 run together. I can get 2 of them to run together but never all three. I would welcome any suggestions. I have tried to use \"Computer Manager\" to recognize them individually but so far no luck. This is a great driver I've dropped it a couple of times and it didn't even phase it. I wish it came in more colors that makes it easier to distinguish between different drives.",
      "rating": 3.0,
      "verified": true,
      "author": "G. M. S.",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Quiet, fast and reliable backup option for your desktop or laptop computer",
      "text": "Quiet and fast. Works well as a back-up drive for my iMac. I keep a complete copy of my internal hard drive contents (including the OS-X operating system) on this drive and carry it with me in my backpack so I don't have to worry if my desktop computer is somehow destroyed or stolen. I can even boot to this drive and run my iMac using it if the internal drive has problems or fails.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Nelson",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Decent. Quiet. Speed is fine. Cable is cheap. Holds 931G",
      "text": "Seems fine. Actually holds 931GB (out of 1TB) which is in the ballpark of ok. The cable is on the cheap side and just a touch shorter than the Toshiba one it replaced. Speed is fine. Reasonably quiet.",
      "rating": 4.0,
      "verified": true,
      "author": "Arclight",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "doesn't arrive Mac-compatible.",
      "text": "This device is much heavier than I was expecting: it weighs about 3 times as much as the 1TB passport that it replaced. The weight is pretty significant considering I'll be carrying it with my Air for remote work. It is marketed as Mac-compatible, however it does not arrive Mac-compatible: I needed to partition it. After partitioning it worked great for backing up my desktop files. Haven't had it long enough to comment on its stability.",
      "rating": 4.0,
      "verified": true,
      "author": "E G",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "It's Dave-proof!",
      "text": "This thing is built like a tank. I had it fly out of my bag while I was running for the train because I forgot to zip the side pocket. It tumbled along the asphalt and down three concrete steps. I picked it up and tossed it back into the bag thinking I'd ruined it. When I got to work I plugged the thing in and it worked like a champ. The drive I replaced never would have survived. If you're clumsy or forgetful like me, this is the HD for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Kuhar",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Very easy to connect the hardware and the software to run ...",
      "text": "Uber-fast delivery. I use Prime and I think this came on a Sunday. Very easy to connect the hardware and the software to run the backup was easy. If anything I wish the instruction booklet was in a little larger font but it was so simple most people wouldn't even really need to read them. I bought the suggested hard shell case with it and that too was surprisingly better quality than expected. Not a necessity but keeps the cable from getting lost and protects the drive from getting beat up. The drive feels like it will last forever. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Sundance",
      "helpful_votes": 2,
      "publication_date": 20140826
    },
    {
      "title": "Great External Hard Drive",
      "text": "Everything gets dropped around here and we are a military family so anything that is military tested and approved I am ok with it, military guys are hard on products and need things that can withstand. This has been prefect we bought it so my husband could back up all his games and hook it up to his Xbox. I will be looking to get another one to backup all of the computer information photos and music. Great product and I would recommend to anyone looking to buy an external hard drive.",
      "rating": 5.0,
      "verified": true,
      "author": "homesteadingwithkatedags",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "Great Hard Drives",
      "text": "These hard drives great have been using them for a number of years now with no problems and tech support is great also. the order was fast and with a great price also. RB",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "As soon as I puguued in the Transcend 3 I had a ton of useful storage And theSurface Pro had a whole new life ...",
      "text": "My Microsoft was near the end of its usefull life because the 128Gb SSD was full of windows stuff. As soon as I puguued in the Transcend 3 I had a ton of useful storage And theSurface Pro had a whole new life to enjoy. Works perfecttly, especially quiet, spins down when not in use for a while to save power,and it turns onn again the next time it is used. And it is Super Sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "steubenvillian",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "This \"heavy-duty\" Transcend Model Stalls for a Few Seconds Before Displaying Files",
      "text": "For some reason, when this stays plugged into the USB, and you open a folder, it stalls for a long few seconds before displaying the files inside the folder. I have owned three other Transcend heavy-duty external drives and they do not do this--as in when I click on their drive from windows explorer, the files display and open immediately. Not with this particular model of Transcend. Not sure if that is meant to be like that for this model or I got a weird one.",
      "rating": 4.0,
      "verified": true,
      "author": "Consumption Gumption",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "Excellent backup drive.",
      "text": "Use them to backup my server. I like the rugged case, protects the drive when taking it offsite. Didn't need to use tech support. Simple to setup.",
      "rating": 5.0,
      "verified": true,
      "author": "JAD",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Reliable, safe and big enough",
      "text": "This is the fifth external memory I get from Transcend as need more and more memory. All of them have been working without a problem ever, from the moment I have begun using them. I do a lot of photography and on a disk of 1,5 TBA I have saved over a million photos. Now I also do videos, so 2 TBA is a fantastic size. I recommend it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Amex",
      "helpful_votes": 2,
      "publication_date": 20160201
    },
    {
      "title": "Durable, fast, reliable",
      "text": "I carry this around a lot in a soft-sided briefcase, so I wanted something rugged. I've owed one of Transcend's similar hard drives for a couple of years and it has been great. That one is still going strong, and I needed another. So far, this one is every bit as reliable and durable. It's fast enough for video editing, which I do often. There's not much else to say. It is priced well, is durable, fast, and does what I need so well I can forget all about it. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "M Vire",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Transcend External Hard Drive is great.",
      "text": "This is my second Transcend Military Tested External Hard Drive. I have a 1 TB and now a 2 TB. Both operate terrifically. I really like the fact that they are incased in rubber in case of accidental dropping. I use both of these hard drives all the time with no problems as they work great and I would highly recommend these particular hard drives to anyone. Plus you cannot beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Sperringer",
      "helpful_votes": 0,
      "publication_date": 20160326
    },
    {
      "title": "I love this",
      "text": "I have bought several external hard drives WD, Passport etc.. My work computer requires administrator approval ( write up a work order and have someone from the district to come to the school etc..) to run new hardware and my passport could not be opened.The transcend opened no problem. Plus it seems pretty durable and being a kindergarten teacher I needed something that was fairly indestructible.I've been able to back up my home computer, work laptop and clear all my music and photos of my computers and 1000's of teaching materials containing a lot of graphics. My computer is running much faster without all that stuff on it.",
      "rating": 5.0,
      "verified": true,
      "author": "ANN DANELLA",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Built like a Tank",
      "text": "Over one year of use, the Transcend 2TB external drive has performed without any glitch. Every colleague of mine who has picked this device up has remarked on the unexpected mass; with comments like \"built like a battle tank\". No, I haven't dropped it from a height of 5' 6\" onto a concrete floor: but the solid, rubberized feel of this device does inspire confidence that it will bash on, regardless.",
      "rating": 5.0,
      "verified": true,
      "author": "S1289C",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "High Quality Drive - Transcend is hard to beat.",
      "text": "I have purchased several Transcend products over the years. They never disappoint. The dive was easy to set up and comes with a really complete backup software that has rich features.",
      "rating": 5.0,
      "verified": true,
      "author": "kim",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Super easy to use",
      "text": "Works great great software (several choices ) auto back up is great hit the button let It run and your done!",
      "rating": 5.0,
      "verified": true,
      "author": "Kaiten",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Slow",
      "text": "Take time to read the files. I is not fast... looks need extra power.. some of my USB does not hold the power to be able to be use..",
      "rating": 3.0,
      "verified": true,
      "author": "Algy Fonts",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Bought 3 of them",
      "text": "I liked mine so well that I bought another for my college son and another for my father to backup their computers. Easy to set up and use.",
      "rating": 5.0,
      "verified": true,
      "author": "CSmith",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Awesome drive",
      "text": "The drive arrived perfectly. Am using it on a Mac works A-OK. Got 2 old version of these drives and still working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Solid and tough!",
      "text": "I haven't torture tested or drop tested this thing, but from the construction and outward appearance of it, I have no doubt it will survive pretty much anything I could throw at it. I'd sure hate to lose some important data because I was too cheap to spring for the extra few bucks for a drop tested and fortified portable drive!",
      "rating": 5.0,
      "verified": true,
      "author": "dlh",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "I have had very good luck with each of the 3 drives I have ...",
      "text": "I have had very good luck with each of the 3 drives I have purchased. This brand has not crashed once, and it has been under a great deal of pressure being taken on multiple trips, dropped, packed, left in the car, etc. No worries at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "its a good drive",
      "text": "I got this for my wife because it fit \"ALL\" of her criteria: 1. Pretty It is very hard to find good tech when the number 1 must have is a \"Pretty Color\" Thank you transcend for making a good product that also fits the needs of the less tech savvy! This has performed very well when I tested it, fast, easy to use and its a good price I would recommend even if you don't care about the color",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "rugged",
      "text": "never used tech support, so can't tell. great storage capability. plug and play. using it for media storage",
      "rating": 5.0,
      "verified": true,
      "author": "barry pham",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Storage Storage Storage",
      "text": "Works great and I love the color. I had no issues with set up and everything is easy to retrieve when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "KDillard",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Dear Transcend: What happened? You used to be cool.",
      "text": "Not recommended. The build quality is very cheap. The cable connection is not snug or solid. I have to position the drive perfectly to keep the cable plugged in. Any deviation and it slips out. The cable is very short, making it difficult unless you have a lot of clear space off the USB port you are using. The rubber protective cover is very loose, and flimsy. The drive actually moves inside the cover. I purchased an earlier version of a Transcend drive several years ago, and it was rock solid in all aspects. I don't know how they could release a product this shoddy. It's virtually unusable unless you have extreme patience.",
      "rating": 1.0,
      "verified": true,
      "author": "FFB Photo",
      "helpful_votes": 13,
      "publication_date": 20140822
    },
    {
      "title": "Excellent hard drive",
      "text": "Excellent hard drive. The rubberized case makes sure it doesn't slip out of my hand. Transfer rate with USB3 is great and even USB2 transfer rate is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Narine Charran",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Working A-OK",
      "text": "Arrived early, working good. Used to make portable copy of media server drive Have a number of Transcend USD drives and they all work great",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Hossler",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "I am a technical professional and feel totally comfortable tossing this in my bag and having it thrown ...",
      "text": "I took this apart and it is definitely hearty. The 2.5\" drive inside is WELL protected from G shocks. I am a technical professional and feel totally comfortable tossing this in my bag and having it thrown around.",
      "rating": 5.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 4,
      "publication_date": 20150615
    },
    {
      "title": "Sweet unit. Must have been built in the",
      "text": "Very solid in construction. The casing alone should last 100 years and the transfer rate seamed up to par. Have not used the built in backup feature yet but still filling it with irreplaceable data. Sweet unit. Must have been built in the USA",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Holliday",
      "helpful_votes": 0,
      "publication_date": 20161011
    },
    {
      "title": "Just got it today",
      "text": "I got this today and I am impressed by how light it is and how nice the padding on the exterior is compared to my other external hard drive, which is a My Passport. I got this for a backpacking trip so I need something durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Great product, wonder why other companies haven't come up with this idea.",
      "text": "I bought this in Dubai not knowing anything about the company that made the product I must say it exceeds Western Digital and Seagate combine, I haven't had any worries to which I felt like the hard-drive was going to die for any mistakable damage done to it like a 2 ft drop or tumbling in my bookbag while going to work. Also the cable to hardwire connection didn't feel like it could break on the harddrive.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 2,
      "publication_date": 20140428
    },
    {
      "title": "Best Hard drive external with good price. Its safety and portable. I recommend for this product",
      "text": "Thank you for the shipping. I have received the package in full and the conditions of the package are all in good condition. I am very satisfied with the service. Thank you for your cooperation.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Hendra",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great portable hard drive",
      "text": "This is a really easy to use product. Really like the physical size of the drive given the 2TB capacity. Transferring files from my older machine was extremely fast. It is well designed and looks to be a very durable portable hard drive. I would recommend this product, especially if your looking for a smaller but durable hard drive option.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss State 1990",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "Great portable hd",
      "text": "Great USB 3 portable hard drive. Hooked it up, reformatted it (I do that as a first step on all HDs). Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian MazurskyTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Data cable is loose",
      "text": "This product provides what they have specified, but the data cable is loose, gets disconnected every time. This makes it vulnerable to crashes.",
      "rating": 3.0,
      "verified": true,
      "author": "Vijay S.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Quality Item with Military Quality",
      "text": "I have bought 5 of these over the years. They have never failed. Quality feels military grade.",
      "rating": 5.0,
      "verified": true,
      "author": "DougR",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "I love how easy it is to use",
      "text": "I love how easy it is to use. I plugged it in and immediately started transferring data from my computer. The size makes it easy to carry and it is very study so I am not worried about damaging it if I drop it. It holds a lot of photos, music, videos and files.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Super fast, very happy",
      "text": "Bought this for our office server, tons of docs and pics to back-up. This device is super fast, easy to use (copy/paste), I am very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ariane Sassen",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Works great",
      "text": "I have not had to use tech-support pretty much just plug-and-play",
      "rating": 5.0,
      "verified": true,
      "author": "Michael D Smith",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Highly recommend",
      "text": "This is the second drive that we have purchased. Both have been extremely reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven D.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Didn't work",
      "text": "Product was rec'd, packaging was good, but product was defective and didn't work at all. Shipped product back for refund.",
      "rating": 2.0,
      "verified": true,
      "author": "MM_review",
      "helpful_votes": 4,
      "publication_date": 20151008
    },
    {
      "title": "Excellent to load and run alternate OS's on.",
      "text": "Love this disk! I partitioned it and have a dual boot Linux Mint 17.2 system and a CentOS 6.6 system configured and running. Using grub2 boot loader and have a shared /swap and /home partition. When I want to run Linux software (not in a VM), I just plug this disk in and I am good to go!",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Mike",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "Great product, easy to use",
      "text": "These are amazing. We purchased 2, one for business and 1 for home. So easy, just plug and play. They are very small, smaller than a cell phone which makes them so easy to use. Tons of storage. I'm so happy with them. I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne Anthony",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Not compatible with all Macs",
      "text": "This is probably a good hard drive, but it wasn't compatible with my 2016 MacBook Pro 13\".",
      "rating": 3.0,
      "verified": true,
      "author": "Baxter",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Best external hard drive I've ever had",
      "text": "Best external hard drive I've ever had, love the shock proof capability. The blue is very nice and looks great. If using with Mac OSX. The hard drive will need to be unmounted in disk utility and reset to be used on Mac. Some Directions included",
      "rating": 5.0,
      "verified": true,
      "author": "FlynnE",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Great item",
      "text": "Nice product that works well. I got the 4 TB's of memory and the price was great compared to others",
      "rating": 5.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Super fast and reliable for Linux.",
      "text": "I bought this in March of 2013 (1TB model) to rsync files to it as a backup from Linux Laptop. Super fast as a backup. Still works great, looking to buy a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "These are great drives",
      "text": "I own six Storejet drives, two 500MB, a 750MB, two 1TB, and a 2TB. I have had the oldest ones for over five years and have had zero problems with them. They are reliable, reasonably fast, and as far as I have been able to find, there are no other portable hard drives on the market with the shock resistance that these drives offer. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dane Hartman",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "Works Great",
      "text": "High capacity and easy to transport. A great local data backup solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "So far so great",
      "text": "USB connected immediately and after Kaspersky checked for any issues, the downloading was speedy. All of my pictures and files are safe. It's a bit smaller than I anticipated, but that's absolutely fine and it can sit out on my desk all the time. Color is fantastic. I'd buy another with no hestitation. Amazing that we need 1 TB for just storage these days!",
      "rating": 4.0,
      "verified": true,
      "author": "SFO Bro",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "hate storing things in cloud where one day those things ...",
      "text": "hate storing things in cloud where one day those things will be costing folks to store and held hostage to access sans payment. this gives the perfect autonomy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Five Stars",
      "text": "Light weight which makes it perfect for travel. Have purchased this item before.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda L. Matlack",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Worth its weight in data protection peace of mind",
      "text": "Hassle-free backup of my computers... I own 3 of these; replacing \"MyBooks\" as they wear out / fail",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Talbert",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "No Probs So Far With This Drive Other Than I Eventually Ran Outta Room On It!",
      "text": "Hardy Drive Enclosure, Worked Fine For Storing & Editing Gigs OF Video Files Directly Off Of...After Several Months Of Lugging It Around In A Gig Bag, No Probs So Far With This Drive Other Than I Eventually Ran Outta Room On It!",
      "rating": 5.0,
      "verified": true,
      "author": "Lil Mike",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Five Stars",
      "text": "fast and durable... looks strong... my first transcedn HD had almost 6 years and still working perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Carlitos Bonilla",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Transcend External Hard drive",
      "text": "Large capacity, very reliable external hard drive. I have previously purchased Transcend flash drives and external hard drives and very happy with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Satyaprakash",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Affordable and best hard disk with great protection",
      "text": "Transcend always. Best portable hard disks. Three layer military grade protection on the hard disk. Connects directly to my smart TV. Backward compatible with USB 2.0. Best part is the connector cable, comes with split USB, one for charging and one for transfer. Speeds up the process.",
      "rating": 5.0,
      "verified": true,
      "author": "Amit",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "Solid device",
      "text": "Solid device, transfer rate with USB 3.0 is true to the description. I would be very confident in the data integrity if this device took some abuse it is very robust, well built, with quality materials. Would be nice to have a longer Usb cable!",
      "rating": 5.0,
      "verified": true,
      "author": "MJD",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Portable external drive",
      "text": "I tested it with 2 different Vista machines and 1 window 7 operating system. Drivers were plug and play and and needed no additional assistance. As easy to use as a thumb drive. I should be able to back up our lap tops easily, and other drives as needed. I would recommend the Transcend Storejet Portable drive as a useful tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles R. Carey",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Robust, Quiet & Reliable",
      "text": "I use this as a Time Machine backup and for extended storage of non-critical data. It seems robust, pleasing to the eye (to the beholder I guess) and most important of all (other than the fact it works and is reliable) it's quiet! Doesn't overheat either. So, definitely pleased with this purchase and would recommend. (I don't use the software that comes with it. No need.)",
      "rating": 5.0,
      "verified": true,
      "author": "Nick L.",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Great Value!!",
      "text": "Low price, high capacity, great looking drive. No trouble at all with encryption and backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Stone",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Purple one looks very nice.",
      "text": "Great portable hard drive. Very well made. Has a rubber outside and seems to be very reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy L Baker",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Super Fast! Very recommended. :)",
      "text": "Wow! Super Fast! Well constructed. Reliable quality. Excellent size and no issues so far! Using it with MacBook Pro 13\" Retina 2017. Very recommended indeed. Thank you. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ghanem",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Works fine. Thicker than previous model.",
      "text": "Not sure why, but it seems to be 50% thicker than my other 2TB Transcend StoreJet. I do not have the exact model # of that one as it is not printed on the bottom. Could just be a thicker case on the new one, although the old one met milspec drop requirements as well. No issues with this new one.",
      "rating": 4.0,
      "verified": true,
      "author": "Vinnie C",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Very sturdy and good speed",
      "text": "Have purchased 2 of these. Liked the 1st one so much, purchased a second one for work. Very sturdy and speed is good.",
      "rating": 5.0,
      "verified": true,
      "author": "westinflorida",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Great little drive",
      "text": "Perfect little backup drive. And it’s purple and black. Ozzy’s colors!!",
      "rating": 5.0,
      "verified": true,
      "author": "RP",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Product Fails",
      "text": "This is the 4th Transcend hard drive that I have tried. 2 of the 4 completely failed about a month after the warranty ended.",
      "rating": 2.0,
      "verified": true,
      "author": "Joseph Vespa",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "The drive works good. I use one for a backup drive for ...",
      "text": "This is the second one I bought. Very tough and durable. The drive works good. I use one for a backup drive for both work and home computers I use the other one to keep my karoke music on",
      "rating": 5.0,
      "verified": true,
      "author": "Francis J. Schirck III",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "External data storage",
      "text": "Wish I had something like this a few years ago, before my hard drives crashed.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt Benn",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Exactly what I wanted",
      "text": "Super easy to use. Comes with its own USB cord. Exactly what I wanted . Haven't had the chance to drop test it yet 😀",
      "rating": 5.0,
      "verified": true,
      "author": "abbyeb ",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "Recommended and would buy a couple more down the road ...",
      "text": "Recommended and would buy a couple more down the road for my wife and I. Save our game statics between her Xbox One and my PlayStation 3-4 systems.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger ",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Best portable hard drive on the market",
      "text": "Best portable hard drive on the market! Bought it for my son to use at college. In addition to providing him with a safe, secure backup of all of his work, he can worry less about someone stealing his (dumb) laptop. If that happens, we can get him a new laptop and he's good to go!",
      "rating": 5.0,
      "verified": true,
      "author": "Gorman Family",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Unlike other portable drive like WD its not user friendly to auto back up ...",
      "text": "Unlike other portable drive like WD its not user friendly to auto back up and it failed to back up and I am carrying it in vain.",
      "rating": 1.0,
      "verified": true,
      "author": "Unwise to Reveal",
      "helpful_votes": 4,
      "publication_date": 20160419
    }
  ],
  "product_meta": {
    "title": "Transcend Storejet 1T Portable USB 3.0 Hard Disk (TS1TSJ25H3P)",
    "description": "Capacity:1 TB| Color:PurpleTranscends Store Jet 25H3 ruggedized external hard drive combines supreme shock-resistant qualities with the USB 3. 1 Gen 1 interface, allowing for ultra-fast file transfers and the highest level of anti-shock protection. With up to 4TB storage capacity, the Store Jet 25H3 eliminates all fears of running out of storage.",
    "rating": 4.6,
    "feature_bullets": [
      "1TB USB3.0 External portable hard drive",
      "Transcend StoreJet 25H3P",
      "Purple and black design",
      "Drop resistant, US Military approved"
    ],
    "specifications": {
      "Brand": "Transcend",
      "Series": "StoreJet 25H3",
      "Item model number": "TS1TSJ25H3P",
      "Operating System": "Microsoft Windows 7, Microsoft Windows 8, Microsoft Windows 10, Mac OS X 10.7 or later, Linux Kernel 2.6.31 or later",
      "Item Weight": "9 ounces",
      "Product Dimensions": "5.16 x 3.19 x 0.87 inches",
      "Item Dimensions  LxWxH": "5.16 x 3.19 x 0.87 inches",
      "Color": "Purple",
      "Processor Count": "1",
      "Computer Memory Type": "DDR3 SDRAM",
      "Flash Memory Size": "1",
      "Batteries": "AA batteries required.",
      "Manufacturer": "Tristan Pub",
      "ASIN": "B004XFZTSQ",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 11, 2011",
      "Customer Reviews": "4.6 out of 5 stars2,495 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#316 in External Hard Drives",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Data Storage",
      "Computers & Accessories",
      "Electronics",
      "External Hard Drives"
    ],
    "price": 54.99
  }
}