{
  "website_summaries": [
    {
      "verdict": "A sturdy bead maze from a trusted brand. Not too big and not too small, this option has plenty to keep kids interested without taking up too much floor space.",
      "pros": [
        "Good size with a reasonable number of dips and curves",
        "Suitable for babies as young as 1 year old, but appeals to older kids as well",
        "Chunky wooden beads are easy to grip",
        "Wide base offers excellent stability",
        "Made using child-safe materials",
        "Built to last"
      ],
      "cons": [
        "Might be a bit too simple for some children",
        "Some parents weren't entirely satisfied with the size"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great toy!",
      "text": "My son loves this toy! He is almost 16mo old and it is a great size for him. The 3 tracks allows his older sisters to play with him as well. It seems durable as he drags it around the house and it is holding up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20170823
    },
    {
      "title": "Love",
      "text": "Very well made, I'm almost always a fan of Melissa and Doug products, I am sad to notice they make all their stuff in China :( I thought they were us made:( hopoefully they will get on board and support the US and make products in house. Bead maze is sturdy and my 7 month old is obsessed with spinning the beads and pushing them all over. Very well made reminds me of when I was little and it's actually a good size un like these other tiny ones I was finding for close to the same price",
      "rating": 5.0,
      "verified": true,
      "author": "RidingMagee",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Top of the line childrens toys",
      "text": "What a very nice product. This bead maze is very well built and very safe .I can see this toy getting passed down to children for generations to come.I would expect nothing less from Melissa and Doug products. We have several friends who have also purchased their products and we all rave about them. They're really that good. have several friends",
      "rating": 5.0,
      "verified": true,
      "author": "luv10nis4ever",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Good M&D Quality, nice plywood base, no fear of splinters, well made; \"user\" quite enjoys it upright as well as  on it's side.",
      "text": "Great size, lots of fun. Color beads correspond to the pads at either end of each maze run. Excellent M&D quality. Heavy enough to stay put, but still easy to move around with the \"user\" in one arm. I am a little concerned about it's ability to sustain \"user\" attempting to pull themselves up on it. Ours likes it as much on it's side as upright as the beads fall differently, so you can get extra use out of it by rotating it rather than always having it on it's base.",
      "rating": 5.0,
      "verified": true,
      "author": "B. C.",
      "helpful_votes": 2,
      "publication_date": 20161206
    },
    {
      "title": "Perfect size for the high chair.",
      "text": "My grandson loves it, it fits on the high chair tray and has a suction cup to keep it there. What more could you ask for. It was a decent price for Melissa and Doug. I trust their brand not to be harmful so I will pay a little more but sometimes they are a LOT more. Watch the toys on Amazon to make sure you are getting genuine branded ones not knockoffs shipped directly from China. It took a lot of research.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela M. Gasper",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Beautiful classic toy",
      "text": "I must confess I was a little worried about some of the reviews regarding this toy's tendancy towards breakage, but after a month of use we have yet to see any signs of defect... which means we are just as pleased as punch with this beautiful mini version of bead mazes. This is smaller version, fits great in a small toy setting, yet still has quite the fun maze experience with beautiful wooden beads. I love the complimentary color system and the variety of paths. It holds up well and looks beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily J. Morris",
      "helpful_votes": 3,
      "publication_date": 20150415
    },
    {
      "title": "Durable toy for a 12 month old",
      "text": "My 12 month old enjoys messing with this toy. Its durable enough for her to use it to stand up with as shes learning to walk. She has chewed on the beads a few times and no paint chipped. Seems to be good quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Love Melissa and Doug",
      "text": "Unfortunately the quality of Melissa and Doug toys has declined recently. Somehow my 1 year old bent one of the lines on here ( the red one if it makes any difference) and we can't get it back into place!",
      "rating": 3.0,
      "verified": true,
      "author": "J Gill",
      "helpful_votes": 17,
      "publication_date": 20140225
    },
    {
      "title": "Great toy for infants and toddlers",
      "text": "So far the little guy has played with this, spinning the balls mainly (he's 9 months) - then he will discover moving up and over the maze. Eventually he'll do more but this initial experience is providing a boost to mental and digital dexterity.",
      "rating": 5.0,
      "verified": true,
      "author": "LHC",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great second level beads maze for those babies who love ...",
      "text": "Great second level beads maze for those babies who love beads maze :) our 12 months old spends a lot of time figuring it out. One of the lines is quite easy, so it keeps his attention for now. There are 2 more that are a little more difficult, meaning the toy will stay with us for some time for sure",
      "rating": 5.0,
      "verified": true,
      "author": "Daria Burtseva",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Manufacturers need to pay closer attention to the quality",
      "text": "The bead maze is overall pretty good, but there were a few issues I saw that convinced me to return it. Two of the sides of the base were not well sanded or contained knots/other imperfections, this resulted in rough or splintered edges. Also one of the beads was cracked/splintered.",
      "rating": 2.0,
      "verified": true,
      "author": "DU",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Sharp edges on base.",
      "text": "It’s a good to for toddlers to learn hand eye coordination. I just wish the wood on the bottom was finished. The edges are a little sharp. It cut my toddlers shin, but it wasn’t bledding.",
      "rating": 3.0,
      "verified": true,
      "author": "oscar ortiz",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great developmental toy",
      "text": "Great developmental toy. My 14 month old baby loves to play with it. I bought this for her when she was only 10 months and she was attracted to this toy at the doctor's office during one visit. She didn't show a big interest at first when it arrived, but as she grows, she is showing increasing interest on this toy. Now she can play with the beads moving up and down and in different directions. Every little progress she has makes us very excited. For that single reason, I highly recommend this to other parents.",
      "rating": 5.0,
      "verified": true,
      "author": "F.W.",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "Great toy!",
      "text": "I bought this toy for my friends son who was 18 months at the time and she said he loved it and is always playing with it. She said it's a great size, not too big or too small. Her son's able to pick it up and carry it with him to wherever he goes. My friend loves it herself as well because it's not only entertaining for her son but education at the same time, she's able to teach him his colors with the toy.. She spoke so good about this toy and how much her son loved I'm planning to also buy it for my son.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamarah Borges",
      "helpful_votes": 0,
      "publication_date": 20140518
    },
    {
      "title": "Attention Grabber",
      "text": "First of all, I love anything Melissa & Doug. All of their toys that I have purchased have been of great quality. I was looking for birthday presents for my daughter's 1 year birthday and I came across this Bead Maze. Both of my girls are always playing with them at the doctor's office so I thought it might be a hit. Although it isn't great for holding their attention (if thats possible), it is an attention grabber. They spot it, play with it for 10-15 minutes, get bored, play with something else. But they do go back to it time and time again.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 0,
      "publication_date": 20121129
    },
    {
      "title": "Very cute.",
      "text": "He toy has a small chip in it but that’s what I expected for the used deal I got. My husband can possibly sand it down I’m sure and make it safe. The toy is fairly big which is what I wanted. Very cute toy.",
      "rating": 5.0,
      "verified": true,
      "author": "kattirichard",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Awesome!!  Love it",
      "text": "Fantastic! My 1 year old daughter loves it. She bangs it around, hits it with other toys.... drags it across the floor and its held together great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Beads arrived chipped",
      "text": "The product arrived with 4 out of 6 bases chipped! The paint was peeling off in the bottom red, orange, yellow, and green bases. Now I have to go through the hassle of returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Vannie",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "A great toy",
      "text": "Our grandson loves this! We bought it for him for his first birthday. A toy to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Chloe Ellie",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Son loves the bead maze!",
      "text": "He sees them in the doctor office so I bought him his own. My son loves ths!",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "It's nice but I think it was kind of expensive",
      "text": "It's nice toy, but I thought it was kind of expensive. My sister bought one from Ikea that looks as nice or better than this one for half the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Butterfly80",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "A must",
      "text": "Bought this for my 18 month year old and he loves it. He was actually obessed with it for a while. He's 2 now and it's still one of he's favorite toys. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Paulson",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Happy!",
      "text": "It arrived quickly and in good condition! It's bigger than I expected, but still not huge, which is good. If the two year old I bought it for pulls it off a child-height table, I don't think it's going to cause any serious injuries. It's colorful and the beads move great. I think he's going to love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Very entertaining",
      "text": "Bought this toy for my 2 y.o. nephew. He goes to Montessori school and toys like that are not something new to him. However when he got it for his birthday, he left all the cool presents like helicopters and toy cars with the quickness and started doing \"work\" with his new maze. He doesn't get tired playing with it and can sit there playing for at least an hour, which is amazing on it's own, considering that it is quite hard to keep 2.o. attention for so long. He also always sings when he plays with it!",
      "rating": 5.0,
      "verified": true,
      "author": "RussianBlu",
      "helpful_votes": 0,
      "publication_date": 20120503
    },
    {
      "title": "Great toy for 1 year olds!",
      "text": "Great toy! Excellent quality! We purchased this bead toy for both my son and nephew for their first birthdays and they both love playing with it! Both interested in exploring it as soon as it came out of the box!",
      "rating": 5.0,
      "verified": true,
      "author": "LErl ",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Melissa & Doug Products are Great!",
      "text": "You can't go wrong with any Melissa & Doug product. The \"Classic Bean Maze\" is built well and bigger than others I've seen. Our 20 month granddaughter loves playing with it!",
      "rating": 5.0,
      "verified": true,
      "author": "New England Grandma",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "One year old likes it very much!",
      "text": "I see our one year old developing his motor skills as he works the blocks and beads move along the paths in the Melissa & Doug Classic Bead Maze. It was definitely worth the buy! Of course, as with another purchase (Sparky the flipping dog), all toys need adult supervision because babies and toddlers like to put everything into their mouths and one can never be too careful.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexandra",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Pretty but sharp!",
      "text": "I love that this maze has an all-wood base and beads, but the edges of the base are very sharp! Wish the company had sanded these down and rounded them out. It seems like little ones could cut themselves on the sharp corners. Like the size of the maze and how it looks, but will be returning.",
      "rating": 3.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "2 year old twins LOVE this!",
      "text": "our 2 year old twins love this! Product is durable (trust me, its been dropped down a flight of carpeted stairs)!",
      "rating": 5.0,
      "verified": true,
      "author": "Krystal Miller",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "A classic toy.",
      "text": "We were introduced to Melissa and Doug toys when we brought our year old grandson to an indoor play area. This particular toy was there and he played with it a lot so we bought it for him for Christmas. He still enjoys playing with it both at the play center and at home. It's not something that keeps him busy for hours but it's one of those toys that he \"visits\" often during the day for short periods of time. We've seen many other little ones playing with it at the play center as well. Definitely a good purchase for us.",
      "rating": 4.0,
      "verified": true,
      "author": "GrammyJ",
      "helpful_votes": 0,
      "publication_date": 20120111
    },
    {
      "title": "Great for the price",
      "text": "Was a good addition to his room and he loves playing with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Melissa and Doug toys never disappoint!",
      "text": "My 18 month old grandson LOVES this toy. I always purchase Melissa and Doug toys, they never disappoint in quality and will last for years and years!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa White",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "A must for any kid",
      "text": "This maze keeps my kids occupied for hours! Great for problem solving and fine motor skills.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Balaban",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Sturdy structure",
      "text": "Absolutely love the sturdy structure of this product. Bought for my 2 yr old grandson and ended up buying 2 more for some friends kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Kryztals2",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Bead maze",
      "text": "Fun toy, love the colors and shape. The kids love it. The price is waaaay too high for size/quality. If I had to buy this all over again I'd look around and find more for your money plus I'm not too fond of mellisa&doug products, they use bad material for outrageous $$$$.",
      "rating": 3.0,
      "verified": true,
      "author": "BowserJagerTop Contributor: Amiibo",
      "helpful_votes": 2,
      "publication_date": 20140714
    },
    {
      "title": "My 16 months old LOVES it!",
      "text": "My 16 month old loves to play with these at dorctors offices so we decided to get one. Its a perfect size, big enough to be fun but not too large that it takes up alot of space. Its made of very quality materials, not flimsy at all. That being said, if you have a little one who likes to throw or move things around, this could hurt! Overall, great product and my little one loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "TxMom",
      "helpful_votes": 0,
      "publication_date": 20111227
    },
    {
      "title": "I think the size is perfect. However",
      "text": "my son loves this toy! I think the size is perfect. However, buyer beware...the first one I got sent had mold growing on it!! they sent me a new one and the replacement was fine but I did try to sanitize it to be safe.",
      "rating": 4.0,
      "verified": true,
      "author": "C9A",
      "helpful_votes": 2,
      "publication_date": 20160211
    },
    {
      "title": "Great Product!",
      "text": "2 year old rough little boy adores this! Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Allen",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Melissa and Doug’s product don’t disappoint!",
      "text": "Melissa and Doug’s product didn’t disappoint! Durable, easy to clean non-toxic. He plays with all the time. Son loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "This was a hit!!",
      "text": "Our granddaughter absolutely loves it!! It is very well made for the price. I am very pleased with this purchase! I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Slaughter",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Very well made.",
      "text": "Melissa and Doug toys always please and this one is not exception. It is relatively good size but my grandson 18 mos. Can carry it around. This is very well put together and the beads slide easily, the metal wire is sturdy and doesn't bend when pushed on. The beads are wood and slide easily. A nice addition to his toys. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzi Horowitz",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Fun toy!",
      "text": "My 1 year old loves this! The colors are bright & the beads are different shaped so it keeps her attention. Sturdy & handles okay very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha Buttice",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Good quality",
      "text": "I was a bit concerned about the size being to small, but is fine for my 10 month year old daughter. She doesn't really follow the path or pattern too much yet, but she likes the spin the beads for now. I'm sure this will be a toy she will like to grow into developmentally. It looks like it its made of good quality and will last many years.",
      "rating": 5.0,
      "verified": true,
      "author": "SYK",
      "helpful_votes": 0,
      "publication_date": 20120403
    },
    {
      "title": "Base splinters, presenting a choking hazard. See picture.",
      "text": "Looks like a great toy, my daughter likes it. But after just a week, one of the color circles on the wooden base splintered. I figured it was a fluke, so I had Amazon send a replacement. Two weeks later the second unit did the same thing. The problem is that the splinter could easily harm a small child and present a choking hazard. These units should be recalled. I sent my replacement back. I've also posted a picture for other parents to see. My advice, buy a different bead maze.",
      "rating": 1.0,
      "verified": true,
      "author": "chad",
      "helpful_votes": 47,
      "publication_date": 20140419
    },
    {
      "title": "I love this toy",
      "text": "I saw this toy at The Children's Museum while visiting my grand son and grand daughter. I was thrilled to find it and buy it for them. I'm a big fan of wooden toys, the kind I grew up with. The beads are fun for him to push all around the colorful wires. Melissa & Doug make great toys that enhance children's development.",
      "rating": 5.0,
      "verified": true,
      "author": "Meema",
      "helpful_votes": 0,
      "publication_date": 20130313
    },
    {
      "title": "Great toy !",
      "text": "This was bought as a gift for my one-year-old grandson, and he loves it. Very good for teaching dexterity and movement. Love Melissa and Doug toys !!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri R",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Almost good",
      "text": "It is good for the education toy of the child to 2 years old. However, it was sad that the soleplate of the toy was missing. When a product arrived, it only covered with a bag. I think that a safekeeping method of Amazon has a problem.",
      "rating": 2.0,
      "verified": true,
      "author": "SARA",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Very well made and highly recommend to give as an educational toy (unlike the other ...",
      "text": "Very well made and highly recommend to give as an educational toy (unlike the other junk the kids usually get for presents)",
      "rating": 5.0,
      "verified": true,
      "author": "Yael Manor",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "So far so good, package came quickly and in good condition",
      "text": "So far so good, package came quickly and in good condition. The colors are nice. The beads are nice. The wood seems good. Havnt actually played with it yet. Going to wait till Christmas to get a good look at it. Will update review if necessary.",
      "rating": 4.0,
      "verified": true,
      "author": "ToniD",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "2 year old loves it",
      "text": "My 2 year old loves this maze! Its also a perfect size!",
      "rating": 5.0,
      "verified": true,
      "author": "Only account",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "My child loves it",
      "text": "My son is about 15 months old now. We got this for him at 11 months. He wasn't quite sure what to do with it at first and it sat in the corner for quite a while. But now he is definitely intrigued with it and moves the \"balls\" all around on the wires. It keeps him out of trouble for a good while!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher B.",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Great for my 10-month-old",
      "text": "Love it! I'm watching my 10-month-old son play with it right now. One reviewer said it was heavy enough that their child couldn't pick it up and drop it, but I found that was not the case. I guess my son is pretty big so he can lift it up no problem. And it's a little smaller than I expected, which is why it isn't getting five stars. But other than that, it's well-made and it's a great learning tool. He loves to play with it!",
      "rating": 4.0,
      "verified": true,
      "author": "Mama Llama",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "She will love it. It's a nice size and seems very ...",
      "text": "Ordered this for my 18mo old daughter for Christmas. She will love it. It's a nice size and seems very sturdy. It would be nice if it had more blocks or beads on it but other than that it's the real deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal B.",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "I am very satisfied with the construction and the motor skill",
      "text": "This toy was purchased for my Godchild's daughter who was recently diagnosed with Autism. I am very satisfied with the construction and the motor skill. Wish I could say more about this product, other that it is very well made",
      "rating": 5.0,
      "verified": true,
      "author": "lacowgirl13",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Lots of fun",
      "text": "Our grandson loves playing with this. One of his favorite toys!",
      "rating": 5.0,
      "verified": true,
      "author": "s. clark",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Our 3 year old and 11 month old both love this toy",
      "text": "Our 3 year old and 11 month old both love this toy. Best of all, it is something they can play with together without playtime ending in screaming. Every adult guest stops to play with it as well. This one is definitely a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Grandkids loved it!",
      "text": "I bought this for my 2 year old granddaughter for her birthday and her eyes lighted up. She really like to play with it and her 8 month old sister also took to it right away, although she liked chewing on it rather than playing with it. This is a good sturdy product.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Nazworth",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Excellent toy!",
      "text": "My son loves this! We Love Melissa & Doug their toys are awesome! On time delivery and well packed i definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Francina D.",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Best ball maze ever",
      "text": "Best ball maze ever. We've used a few at our day care and this one is loved the most. Very sturdy. Ya the kids say and so do I.",
      "rating": 5.0,
      "verified": true,
      "author": "David Meyers",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Decent",
      "text": "This is a decent quality bead maze. I am a little disappointed by how lightweight it is because it moves around too much on hard surfaces while my son plays. That said, it is fine for the price-point, and I would probably buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Theatre Chick",
      "helpful_votes": 0,
      "publication_date": 20140326
    },
    {
      "title": "Five Stars",
      "text": "still play with the toy even that she is older",
      "rating": 5.0,
      "verified": true,
      "author": "AFwestPunk",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Wow!",
      "text": "Bigger than expected. My son said wow. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Darby B.",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Nice constructed toy",
      "text": "Really cute! My daughter didn't play with it as much as I hoped she would, but still a great toy. I sold it to a kids consignment shop recently and got a good payout for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaina A.",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "Perfect",
      "text": "My 1 year old love sit. And it’s light enough that she can drag it all over the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "My baby didn't play with it even once",
      "text": "I thought my baby would like to his toy but she hasn't played with it even once. She is one year old and I hope she starts playing with it when she gets a bit older. There was a crack on one of the beads.",
      "rating": 2.0,
      "verified": true,
      "author": "Sahar",
      "helpful_votes": 0,
      "publication_date": 20140405
    },
    {
      "title": "Love this toy - a good quiet toy",
      "text": "This bead maze is great - my 1 y/o loves it. I love that it is a quiet toy that doesn't require batteries :-) Melissa & Doug toys are such quality. I have never been disappointed by Melissa & Doug!",
      "rating": 5.0,
      "verified": true,
      "author": "Elo",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Maze Toy",
      "text": "Arrived in excellent condition, although because of the odd shape, the box bulged a little at the top. Maze seems very durable - please with the quality of this toy.",
      "rating": 5.0,
      "verified": true,
      "author": "mar",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "I recommend!",
      "text": "I knew my son would love this gift, but I didn't realize he would love it that much! I didn't think it would keep him entertained for so long. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "V. Robinson",
      "helpful_votes": 0,
      "publication_date": 20150131
    },
    {
      "title": "Bead maze",
      "text": "This is the best gift for my grandson. He enjoys playing with it keeps him entertained for awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Lou Garza",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "Well made",
      "text": "This is very nicely made. It should keep different aged children entertained.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Marple",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Bent on receipt so I returned",
      "text": "Was bent when I received this so I had to return it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim M.",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "My youngest grandson loves it",
      "text": "My youngest grandson who is four really enjoys moving all the beads and shapes around. It is portable enough for him to play with in the car on long trips. It keeps him in one place for awhile and occupied.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil-Tar51",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Four Stars",
      "text": "Always a favorite with the little ones! A little too large for 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "John...",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "GREAT!",
      "text": "Love this! For the price you can't beat this. Nice size. My 11 month old loves it. I was expecting the toy to be smaller...but it is a nice size.! Wood is smooth and nice bright colors. Cant say enough about this one! Great quality",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda/Emily L",
      "helpful_votes": 0,
      "publication_date": 20120307
    },
    {
      "title": "My son loves it",
      "text": "We bought this toy for my son's first birthday and he absolutely loves it. He plays with it constantly. It is the perfect size for him and is built very sturdy, which is good since he is quite a destructive baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Jones",
      "helpful_votes": 0,
      "publication_date": 20130329
    },
    {
      "title": "Great toy!!",
      "text": "I bought this for my son when he turned one, and now that he's almost 2, it's still one of his favorites!! He loves this toy, and we love it because it not only holds his attention for more than 15 minutes (at least), but like the product review says... \"it encourages color/shape recognition, fine motor development, basic learning skills such as visual tracking and eye-hand coordination\". We totally agree! It's also very well made, sturdy as hell we found out when my husband accidentally fell on it, without breaking or bending any of the wires! I think this is a must have for every baby!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Johnson",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "My daughter is mildly autistic and this is a GREAT toy for her",
      "text": "My daughter is mildly autistic and this is a GREAT toy for her. Spends hours playing with it. My other daughter loves it as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Demsick",
      "helpful_votes": 0,
      "publication_date": 20160113
    },
    {
      "title": "Durable",
      "text": "My granddaughter loves this toy. She has fun pushing the beads around.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Gragg",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Great quality, great price",
      "text": "Great quality, great price, came as advertised with no surprises, shipping was prompt. I have had this product for almost a year now and it still looks new. Surprisingly, I occasionally find the older kids fiddling with it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "i would get one with heavy base. if baby ...",
      "text": "i would get one with heavy base. if baby pulls on one of the wire part, it will tilt. i didn't think about that.",
      "rating": 3.0,
      "verified": true,
      "author": "G. Kim",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Great Christmas Gift",
      "text": "Just purchased this item for my 5-yr old son- he loved it! It's small and compact enough for him to carry around with him, and the criss-cross base design is really eye catching. It would be nice if the wooden beads were more polished/smooth. All in all, the beads are not bad, but you can feel the wood texture. Would definately reccommend this product to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Steel Stilletoes",
      "helpful_votes": 0,
      "publication_date": 20111225
    },
    {
      "title": "Granddaughter's first birthday",
      "text": "This was one of the gifts we purchased for our granddaughter's first birthday. The colors drew her attention immediately, because it is bright and eye catching for a baby. She has a lot of fun playing with this.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Lista",
      "helpful_votes": 0,
      "publication_date": 20121007
    },
    {
      "title": "Good gift!",
      "text": "I looks very durable and without sharp edges... Perfect for children! This was a gift, so I don't have more details. So far, no complains from the mother of the child! :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Peaches",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Colorful, fun for my 2-year-old",
      "text": "My daughter got this for Christmas (2012) and she plays with it a few times a week. Before I bought this, she'd always play with them in the doctor's office waiting room or at friends' house. Having her own, I think she's lost a little interest, but she still likes it. The wires seem a little close together and you have to physically move one of the wire tracks to get some of the beads by on a different track. Minor issue and perhaps good for developing problem-solving. It is a little smaller than I expected, but that's fine, given that we already have too many toys taking up too much space.",
      "rating": 4.0,
      "verified": true,
      "author": "Kimberly14043",
      "helpful_votes": 0,
      "publication_date": 20130211
    },
    {
      "title": "Great for little ones",
      "text": "We gave this to my nephew for Christmas. He was 7 months old at the time and loves playing with this. It is great to help little ones with the fine motor skill that they need to develop!",
      "rating": 4.0,
      "verified": true,
      "author": "Alsully",
      "helpful_votes": 0,
      "publication_date": 20130217
    },
    {
      "title": "really great",
      "text": "this is so much better than i expected - the colors on a line are complementary colors which is so much fun for learning. it is the perfect height to help my four month old practice his sitting - he loves to hold on it it while playing. he's still young to really get it, but i'm sure it is going to grow with him very well. my only complaint is that the third shape isn't easily described or named for \"teaching\" purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "ceb",
      "helpful_votes": 0,
      "publication_date": 20110810
    },
    {
      "title": "2 yr not too interested",
      "text": "Not sure why he's not interested, he seems to love the ones at the library and the doctor's office and they are smaller with less beads. The quality of the wood and the colors are good however.",
      "rating": 3.0,
      "verified": true,
      "author": "B. R.",
      "helpful_votes": 0,
      "publication_date": 20130603
    },
    {
      "title": "Great toy, and well constructed.",
      "text": "Simple toy, but provides lots of reusability. Well made, recommend to all.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Naples",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great toy, and very well made",
      "text": "Bought this for my 2 year old and he loves it. My one year old is fascinated by it as well. Great toy, and very well made!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter J Thibault",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Very Sturdy",
      "text": "My daughter LOVES this bead maze! It is constructed VERY nicely and has been holding up to her roughness so far! Bought it as a Christmas gift for her 2013...",
      "rating": 5.0,
      "verified": true,
      "author": "No More",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Made well",
      "text": "I’ve had this toy for my 2 toddlers for about a year and it’s still in great condition. My kids love playing with the bead maze at the drs, so they were excited to have one at home",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Higuera",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "High quality, came assembled.  'Nuf said.",
      "text": "I don't necessarily understand the fascination with these, but they're supposed to build motor skills and the kids like it enough. And, I didn't have to assemble it.",
      "rating": 5.0,
      "verified": true,
      "author": "nth66",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "He loves it!",
      "text": "My 1 year old boy loves this toy. It is well made, sturdy and nice. I am very happy with it. I find it to be a little pricy but compared with other bead mazes it is not that expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "Great toy",
      "text": "My grandson always gravitated to these when at the doctors office. Bought him this one for Christmas and he spends a lot of time working with it. Good quality and a nice size.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Nelson",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "Grandson likes this",
      "text": "He didn't start out knowing what to do, but when it was sitting there he could explore and decide what he wanted to touch and move any given day. Great.",
      "rating": 5.0,
      "verified": true,
      "author": "visitor JT",
      "helpful_votes": 0,
      "publication_date": 20131218
    },
    {
      "title": "Love It!!",
      "text": "As always, I love the Melissa and Doug toys. Purchased for my 8 month old grandson, he loves it and will be able to play with it for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Lowery",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Excellent and doesn't take up to much room",
      "text": "Overall toy is excellent. A little smaller than expected, but you can always by the classic version which is probably 3 times the size.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicholas Zulick",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "Great Gift.",
      "text": "Once more, I have to say that these toys are the best. My 1 year old granddaughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "nice bead maze",
      "text": "It was a christmas present for my 15 month old granddaugther and she loves to play with it. nice bead maze.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Therrien",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Great toy!",
      "text": "My nephew just loves all of his Melissa & Doug toys and this is no different. I would buy this again in a second. Their toys are well designed and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Tree",
      "helpful_votes": 0,
      "publication_date": 20130317
    }
  ],
  "product_meta": {
    "title": "Melissa & Doug Classic Bead Maze",
    "description": "Multi-shaped and brightly colored beads swoop and slide along roller-coaster wires to encourage color and shape recognition and fine motor development. With a sturdy wooden base, this eye-catching activity will keep a little one busy for a long while! For more than 30 years, Melissa & Doug has created beautifully-designed imagination- and creativity-sparking products that NBC News called “the gold standard in early childhood play.” We design every toy to the highest-quality standards, and to nurture minds and hearts. If your child is not inspired, give us a call and we'll make it right. Our phone number is on every product!\n\nBRAND STORY\nBy Melissa & Doug\n\nFROM THE MANUFACTURER\nFrom classic wooden toys to crafts, pretend play, and games, Melissa & Doug products provide a launch pad to ignite imagination and a sense of wonder in all children so they can discover themselves, their passions, and their purpose. \n\nSince the company’s founding more than 25 years ago, Melissa & Doug has consistently delivered innovative products that inspire open-ended thinking, encourage kids to see new possibilities, and offer Countless Ways to Play. It’s part of a bigger vision to Take Back Childhood. Because by giving children a true childhood with the space and freedom to explore their world, we give them a path to realizing their full potential!\n\nSee more",
    "rating": 4.8,
    "feature_bullets": [
      "Multi-shaped and brightly colored wooden beads swoop and slide along 3 roller-coaster wires",
      "18 wooden beads in a variety of shapes and sizes are easy to grip and feel great in little hands",
      "Sturdy wooden base",
      "Improves fine motor skills and color and shape recognition",
      "Makes a great gift for 1-year-olds and up",
      "11.75\" x 11.75\" x 12.5\""
    ],
    "specifications": {
      "Product Dimensions": "13 x 12 x 12 inches",
      "Item Weight": "2.49 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B004C7QNCQ",
      "Item model number": "2281",
      "Our Recommended age": "12 months - 2 years",
      "Manufacturer recommended age": "24 months - 2 years",
      "Best Sellers Rank": "#10,037 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars512 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "January 1, 2013",
      "Language:": "English",
      "Mfg Recommended age": "24 months - 2 years",
      "Department": "Unisex-child",
      "Manufacturer": "Melissa & Doug"
    },
    "categories": [
      "Toys & Games",
      "Baby & Toddler Toys",
      "Sorting & Stacking Toys"
    ],
    "price": 24.53
  }
}