{
  "website_summaries": [
    {
      "verdict": "Meguiar's is a top name in auto wax for good reasons – it's easy to use, produces excellent results, and lasts, making it easily one of the best waxes on the market today.",
      "pros": [
        "Liquid consistency is formulated to be easy to apply and buff out",
        "Synthetic polymer formula the brand is renowned for provides a mirror-like shine on most vehicles",
        "Offers protection that lasts, wash after wash"
      ],
      "cons": [
        "May \"separate\" if stored for a lengthy period of time",
        "Some cars, especially older ones with some finish wear, may initially require 2 coats"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easier to apply and longer lasting than carnauba!",
      "text": "I have always been a carnauba wax kind of guy, so I wasn't sure what to expect with this. I can tell you it has exceeded my expectations. With carnauba I typically have to wax every few months to keep the water beading up; this has lasted six months without need for a re-do. The shine looks just as good on my dark blue truck as well. Plus, it is a lot easier to remove than carnauba. This is definitely my new go-to!",
      "rating": 5.0,
      "verified": true,
      "author": "E. S. Blofeld",
      "helpful_votes": 55,
      "publication_date": 20170615
    },
    {
      "title": "Superb! Especially when combo'd with the Meguiar's Clay Kit",
      "text": "I had no idea that claying my car would be so easy and took hardly anytime. What a difference it makes! My car is smooth as butter and the shine...wow the shine. Looks better than how I drove it off the lot. I took the suggestion on the Meguiar's Clay kit box, and also bought the Meguiar's Ultimate Liquid Wax to complete the wow-ness. I would highly recommend this to a friend, and will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "L. O'Rourke",
      "helpful_votes": 52,
      "publication_date": 20171113
    },
    {
      "title": "Stop looking, buy this!!!",
      "text": "Absolutely fantastic product. The combination of this chamois  , and Mequiar's wax have my car's paint still looking incredibly good after 3 weeks of use. One layer of this had the black paint on my taurus, which had been abused by it's previous owner, looking near showroom in it's depth and shine. About a week after applying it, it rained, and to my amaze the water on my car beaded so thoroughly it was as if my Taurus was allergic to it. I've found my wax from here on out. Buy this stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Sotep",
      "helpful_votes": 13,
      "publication_date": 20180722
    },
    {
      "title": "Best wax ever used - follow directions a little goes a long way.",
      "text": "The product works as advertised. Complaints about the product are due to operator error. I called the company about my concerns they were very helpful. They stated the primary reason people have trouble is because people use to much of the product at a time. I followed their instructions and the product applied, removed excess, buffed by hand perfectly leaving a great shine. This is by far the best wax I have used on any of my cars. I am applying it about every 4 months though I am sure it can go longer between applications.",
      "rating": 5.0,
      "verified": true,
      "author": "Oldtech 45",
      "helpful_votes": 21,
      "publication_date": 20170520
    },
    {
      "title": "I won't use anything else.",
      "text": "I just reordered. I use a Dual Action Polisher with a \"Black\" Lake Country Finishing Pad. I'm so impressed with the longevity and mirror like, showroom quality of this wax that I wont use anything else. Easy on easy off. Set the polisher at 3,800 RPM. No swirls, no scratches, just perfect on new paint. My car has a tri coat, white platinum finish and it just pops, especially at night. You won't find this wax any cheaper than here on AMAZON. This wax is awesome for a metal flake paint. I have gotten so many compliments. This is a no brainer for a new car that your proud of.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark in Pa.",
      "helpful_votes": 16,
      "publication_date": 20170727
    },
    {
      "title": "This is \"the one\"",
      "text": "If you are serious about car detailing, like me you have probably tried every product available retail (excluding the pro grade stuff used at auto body shops of course). To me, this is \"the one.\" It is simply the best liquid wax in the market period. It is the easiest the apply, easiest to remove, it produces a \"wetter\" look than any other brand I've tried, it last longer than other liquid waxes (to be honest it almost lasts as long as paste wax), and it even smells good! Seriously, it smells like candy LOL. The kit comes with an applicator pad and microfiber. Excellent price for an amazing product. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "21days",
      "helpful_votes": 8,
      "publication_date": 20181114
    },
    {
      "title": "WAX INSIDE BOTTLE WAS BROWN AND SEPARATED",
      "text": "So I bought this the first time I ever waxed a car, and it was a flawless product. I loved it. I bought it more recently, and the liquid inside was brown, and had separated. I thought, well this must be a rare and random quality control issue. I sent it back and bought another one, both on Amazon, same thing. The wax inside the bottle was a brown color and had separated into 2 liquids. I hope they fix this issue as I am scared to buy it again, but was very impressed with the results the first time I used it. Fingers crossed.",
      "rating": 1.0,
      "verified": true,
      "author": "Marc P. Curry",
      "helpful_votes": 11,
      "publication_date": 20180609
    },
    {
      "title": "BEST Cheapest was money can get you",
      "text": "I have never really been a mequiar's fan until the tech2 wax came out. yes... about 15 years ago, but that wax changed my mind. just like tech 2 but better this wax will give you a legitimate year long coat, although I like my water to bead excessively and I use this was every 2-3 months, I used to use it every weekend on 4 of my cars but I'm older and lazier now. seriously you wont be disappointed with this product, it competes with a product my friend bought for $300, but he is a professional detailer so he can spend that money all he wants. this works for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Kingbird Fizzle",
      "helpful_votes": 9,
      "publication_date": 20180830
    },
    {
      "title": "Smooth liquid that goes on easily (don't use too much",
      "text": "Smooth liquid that goes on easily (don't use too much...you don't need it and it would be harder to get off). The finish lasts longer than my previous wax and it buffs to an awesome shine. Use a microfiber towel to remove the wax to make it easy to remove without any scratches. This is the only wax I use on my four cars.",
      "rating": 5.0,
      "verified": true,
      "author": "citadel1980",
      "helpful_votes": 16,
      "publication_date": 20170130
    },
    {
      "title": "Not a fan thus far.",
      "text": "I read the reviews, but not a fan of this wax. I’ve used Zymol and Nu Finish over the last 10 years. This wax went on easy enough, yet while removing, dark swirls remained requiring extra time to remove. There is little residue, which is a positive. The wax “feel” is nice, so I’ll just have to see what lasting power it has. UPDATE - not lasting - too much buffing without the long-term payoff - 1 star.",
      "rating": 1.0,
      "verified": true,
      "author": "Dino Bravo",
      "helpful_votes": 4,
      "publication_date": 20190602
    },
    {
      "title": "Love Meguiar's products!",
      "text": "I only use Meguiar's products because in my opinion they are the best. I just finished cleaning my truck using their compound, polisher and ultimate liquid wax and I love the way my truck looks. I only wish I had known a shower was going to come through tonight but at least I know it beats up great.",
      "rating": 5.0,
      "verified": true,
      "author": "TundraGuy",
      "helpful_votes": 12,
      "publication_date": 20170208
    },
    {
      "title": "This product can't store more than half year. Otherwise ...",
      "text": "This product can't store more than half year. Otherwise, water and polymers just separate and no matter how you shake the bottle, polymers are never mixed with water again. Switching to different car wax!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike and Michelle from AZ",
      "helpful_votes": 8,
      "publication_date": 20180204
    },
    {
      "title": "Meguiars is no longer primo.",
      "text": "Not sure what’s happened to Meguiars but as a car retailer for many years I can attest that their products are not what they used to be. Apparently they have thinned and reduced their product quality in order to keep the profits going. I would equate this wax to many of the other budget waxes on the auto parts store shelf. Just your average car wax. Average shine and average longevity. Cannot recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenneth Kirby",
      "helpful_votes": 3,
      "publication_date": 20190727
    },
    {
      "title": "Doesn’t dry",
      "text": "Hated this stuff. It doesn’t dry like the instructions and videos say it should (forums confirmed it won’t dry). So getting it off was a pain and it just left the car looking greasy. Attracted dust really fast and the car looked like crap after one drive. If you do use it, read the forums for tricks. Don’t trust the instructions.",
      "rating": 1.0,
      "verified": true,
      "author": "skittles",
      "helpful_votes": 3,
      "publication_date": 20190627
    },
    {
      "title": "Easy to Apply and Remove",
      "text": "First try for this wax. Super easy to apply and remove (probably its best feature). Does not create the white markings on black plastic trim, which is a big positive. Gives a nice shine, but I believe the little extra work that a carnauba-based wax provides is worth the extra effort. Carnauba is important here in FL against the unrelenting sun, but I am sure that this wax will protect your vehicle's finish in other climates where sun is less of a factor and where bad weather and road salt conditions are present. When I lived up north, this type of wax provided excellent protection.",
      "rating": 4.0,
      "verified": true,
      "author": "GWP125",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Decent car wax with no white residue",
      "text": "This wax seems to work pretty well so far. Tree sap tends to come off very easily, but bugs still require some attention with a bug remover spray. I would give it five stars, but I still get some water spots that require a water spot remover. For the most part, though, things wash right off. I think my favorite feature of this wax is that it doesn’t leave a crusty white residue. Some words of advice: Just do one part, like the hood, at a time and have a few good microfiber cloths on hand to buff away the remnants of the wax. While it won’t leave a white residue, you still have to wipe away the cloudy residue.",
      "rating": 4.0,
      "verified": true,
      "author": "AJDestin",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Fantastic Wax",
      "text": "This is by far the best wax I have used. I ran a search online before my purchase and this was rated #1. I'm amazed at how well it has held up. I removed the old wax via a hand wash using dish soap. I clay barred the car with mequiars clay bar. I washed/dried the car again and applied the wax. My car is black and it looks amazing. I haven't had to wash the car for weeks. It has rained but the water/dirt falls right off. I use my California duster to brush off the dust/pollen and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Blackcoog",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Lazy mans alternative to real wax.",
      "text": "I don’t get the feeling that this protects anything like real wax. Does not look like I did anything 2 weeks later. Wax you can still see feel on the paint for months this for sure isn’t.",
      "rating": 1.0,
      "verified": true,
      "author": "BAMBAM",
      "helpful_votes": 4,
      "publication_date": 20190207
    },
    {
      "title": "they are selling stale old products",
      "text": "Im a big fan of Meguiars and have always used their products. Ive used this wax many times without issue but when i receivbed this, it was either too old or has been sitting somewhere for a long time. I shook vigorously and still it came oozing out like water..... Very disappointed and i cant return as I didnt open it till recently as the weather got better",
      "rating": 1.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 3,
      "publication_date": 20180710
    },
    {
      "title": "Does the trick",
      "text": "Car looks great and seems protected, although, it is almost to easy to apply because it is watery, which means there is slightly less rubbing that does not help deep cleaning. I know it sounds weird because it is convenient but I have found slightly more paste consistency waxes help clean the car during application. It's my personal preference to use thinker waxes but for many who want a quick and convenient waxing, this is a great choice.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Nothing great",
      "text": "I have used many car wax products over the years and this falls flat. not worth the extra money does not do a great job no matter how you apply it. Original carnuba wax is still the best",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 5,
      "publication_date": 20190109
    },
    {
      "title": "I love this wax.  Best wax I have ever used in 30 years of car waxing",
      "text": "Have used Meguiar's waxes for years. All good wax. Then ran across this Ultimate Wax. Was skeptical at first, seemed too good to be true, but it is. This is my \"go-to\" wax now. Takes 1/10 the time and as long as you are not wanting to \"clean\" your paint (it is not a cleaner wax). It is just as good as the other Meguiar's for protection and better for shine. Been using this for about three years now (on fourth bottle). Let's you wax your entire car much faster and it lasts about as long as the standard Meguiar's in terms of paint protection and shine.",
      "rating": 5.0,
      "verified": true,
      "author": "Skeptical",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "DISAPPOINTING RESULTS",
      "text": "The product went on easily and removed easily as well. However, it does not seem to hold up very well. The painted surfaces of my car do not remain very \"slick\". Water beads up somewhat, but not as much as I would have expected. I tried a second application thinking that the results might improve, but again I was still disappointed. This product did not live up to its reputation.",
      "rating": 3.0,
      "verified": true,
      "author": "KC n JL",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "I thought I was getting good results",
      "text": "The initial product looks great. I have two black cars and after applying, the cars look good. As soon as it rains, it looks like I butchered the cars. It leaves a nasty oily residue. I have much better results with the paste wax. I like Meguiars, just have lost trust in the liquid version.",
      "rating": 1.0,
      "verified": true,
      "author": "Dylan Shuttlesworth",
      "helpful_votes": 6,
      "publication_date": 20190107
    },
    {
      "title": "My favorite Liquid Wax",
      "text": "If the finish on your car is like new just apply on a well washed surface without polishing. This coating will protect your cars paint for about six months. You can apply it to plastic trim and it will not dry or polish with a \"cream colored residue\". I have applied this to the glass of my cars and it helps keeps windows clean and makes bugs easier to remove. I recommend starting with Nu-Finish for oxidized or faded paint. Follow instructions and a few days later top it with Meguiar's for a long term shine.",
      "rating": 5.0,
      "verified": true,
      "author": "John Tanner",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great so far",
      "text": "Just applied it to my 2018 camry hybrid and it looks amazing now. It was easy to apply, had no issues with it..but it is just liquid wax so what do you expect? I did find a scratch while I was cleaning my car prior but to my surprise, after the application of the wax, the scratch disappeared. It wasn't deep or a big scratch but I did not expect the wax to help in that department. It has only been 12 hours and it is the summer, but there is supposed to be some rain in Seattle this coming week so I'll update if there are any negatives with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Meguiar's Ultimate Liquid Wax is the BEST",
      "text": "I have been using Brazilian wax for decades. It is now officially retired and I am now using Meguiar's Ultimate Liquid SYNTHETIC POLYMER wax. This synthetic wax goes on so easy. Wait 15 minutes or more and rub off with the provided high quality towel. It comes off with little labor. The resulting shine, smoothless and protection is AWESOME! This wax is absolutely the BEST.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence A Team",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "This is the one you want",
      "text": "I applied this on my new 2018 Hyundai santa fe sport, it had never had any paint treatment on it. Like other reviewers, i agree to use a thin coat, a little dab will do you. Also i let mine sit on and dry a good 20 minutes before taking it off. Don't rush it. I went in and watched a tv show then came back. almost couldn't even see where i had put it on. wiping off was super easy. this is a polymer protection not wax. drove car in the rain and beaded right up.",
      "rating": 5.0,
      "verified": true,
      "author": "Drlamo",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great shine and very easy to apply and remove",
      "text": "Great wax. Easy to apply, easy to remove, and shines great. Lasts as longer than some ceramic sio2 sprays. Less hydrophobic then some other modern spray waxes, but still a very good wax. I feel this gives better shine than the Ceramic SiO2 waxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny_SS",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Great, easy to use wax",
      "text": "This was almost too easy to apply and remove, not the typically wax film you have to remove with traditional waxes. Protection has been great so far, car sheds water really well, to clean it I don't even use soap so I am not cutting into the wax too much, rinse, wash with a microfiber mitt, rinse again then dry, looks just like after waxing it. I have a black car so it is really apparent when it is not clean. Not sure how long the wax will last once winter arrives but hoping for most of the season to protect from salt and other crap they pour on the roads.",
      "rating": 5.0,
      "verified": true,
      "author": "DGS4930Top Contributor: Diving",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "AWESOME PRODUCT AWESOME PRICE!",
      "text": "I have been an advocate of Meguiar Ultimate Liquid Wax for the past 2yrs. I used to buy it from Pep Boys at 24.99! Not anymore! The package came as a kit box, one bottle, applicator and buffing towel. As outlined in the description of the product at time of purchase. I use this at the beginning of each season or every 3 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Farley",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Not Your Father's Car Wax",
      "text": "OK, it's been a while since waxing the car. I bought this based on recommendations from friends and I'm telling you straight, there is no more reason to NOT have a shiny car. I remember waxing being such a major chore. Application was fussy and removal was a lot of work. They've made big improvements in wax apparently. This stuff goes on really easy and buffs off easily with a microfiber cloth. And the results are magnificent!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. McPenny",
      "helpful_votes": 3,
      "publication_date": 20170509
    },
    {
      "title": "Compared to ceramic",
      "text": "So I ran a little test, on the right this wax, on the left, one of the generic 9H ceramic coatings or sealants. It was applied on my daily driver at the end of May. The last picture was taken at the end of November, 4 months later. We are now in Feb and the results still look the same. 10 years ago this wax would have been top notch but there are just better technologies available now.",
      "rating": 2.0,
      "verified": true,
      "author": "Charles V. Saftner",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Wear gloves with this one",
      "text": "I have always used more putty type waxes, but decided to give this one a whirl because the harder putty waxes are hard to work with and hard to remove. I gave this one a try last night and I instantly loved it. I didn’t wear gloves and I regretted it immediately as it is extremely difficult to get off hands. It leaves a lasting film which I hope if foreshadowing for my car. All in all, Meguiar is a great company with great products and this is no exception. It smells good. It goes on easy. It comes off easy. And it really leaves a nice glossy shine on the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Best wax for long lasting finish",
      "text": "This is the best I ever used. Mother's Carnauba Wax was very good but did not last as long as Meguiar's Ultimate Liquid Wax. This is my fifth bottle and I use it for all four of my cars. In addition to being a long lasting wax, this wax is easy to put on and remove with a microfiber cloth. I have cars with clear coat finish or solid lacquer finish. The carnauba wax didn't work as well on solid lacquer finish. I understand that this is more of a chemical wax but it's been great on my cars. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Hank Sue",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Best wax I've used.",
      "text": "I clay barred and polished my paint before putting this on so there were no contaminants on the paint. It was extra work but well worth it. It applies super easy, doesn't stain any plastic trim or black rubber, and it buffs off easy. It's been about 6 months since I've put it on one of my cars and it still beads up well. I would say for northern states you could easily get away with applying it 2 times a year and maybe a spray touch up wax in between applications.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Great stuff!",
      "text": "I have been waxing vehicles for 45 years and this is by far the best wax I have ever used. The vehicle stays cleaner and the bugs come off easier. I drive 40 miles each way to work so I get a lot of bugs. I have waxed an Impala twice and a Buick Enclave once and have some left! It is simple easy to use. It is kind of a pain to wear gloves while waxing but I survived.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim H.",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Wax on",
      "text": "Note to self: Always buy this wax!! I seem to never quite remember which one I want to get, or I am at an automotive store or wholesale club and pick up whatever they have ... then I spend a day cleaning and polishing my car and two weeks later these other waxes have all but washed off. With this, it still beads up months after application. I will buy it again, and again.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 3,
      "publication_date": 20170517
    },
    {
      "title": "If you Love your Car, use Meguiar’s ! You can’t go wrong!",
      "text": "I have used Meguiar’s products for over 35 years! Learned how to detail VINTAGE VOLKSWAGENS and HOT RODS for car shows. These beauties made you drool, even before you started detailing. But Meguiar’s was the Icing on the Cake!! There’s nothing that equals their products! Sarah Wurm",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Wurm Rossi",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Fantastic Wax",
      "text": "This stuff is amazing. The one bottle I was able to wax all three of my cars. A 2010, 2009, and 2003 vehicles. The 10, and 09 stay in a garage but the 03 has pretty much always lived on the driveway exposed to the elements. Now I thoroughly cleaned my cars and for the 03 I used a clay kit to get rid of any imperfections. After apply this wax it is an absolute night and day difference. The car looks so much nicer now. It shines like it did when it was new! This product is fantastic, Meguiar just got a new customer!",
      "rating": 5.0,
      "verified": true,
      "author": "David E.",
      "helpful_votes": 4,
      "publication_date": 20151106
    },
    {
      "title": "Easy to apply and remove!",
      "text": "This stuff is great! it goes on super easy, and is removed easily too. It has an awesome shine, and if you happen to get some on the trim, it wipes right off. That doesn't happen with some other products. I have a white car with black trim, so that helps a lot. I'll be getting this again when I'm ready to wax my car again.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna H.",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "paste or liquid? this one for faster shine and less messy application",
      "text": "A really good quality product resulting amazing shine. One thing to keep in mind though; make sure you waited enough to wipe off and didn't wait too much before wiping off. I've used the paste version of the same product, purchased this one in order to use with DA system power polisher, and this one clearly remains less white residue while wiping off. Need to add that the paste version and hand application has a different kind of attraction though but it's tiring.",
      "rating": 5.0,
      "verified": true,
      "author": "Mehmet",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "I am super lazy when it comes to waxing my cars",
      "text": "I am super lazy when it comes to waxing my cars...it's so time-consuming with all the \"wax on, wax off\" you gotta do. This stuff is liquid...goes on VERY easy, and comes off just as easy. I also use this on my outdoor furniture (wrought iron)...it makes the furniture easier to clean throughout the year. Love this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Marc L.",
      "helpful_votes": 3,
      "publication_date": 20170818
    },
    {
      "title": "EASY !!!",
      "text": "I have owned several new cars over my 54 years. I really take good care of them. One problem regarding waxing a car, is when you get wax on black plastic trim. With this wax however, you want to use it on the trim! It protects it and goes on and off easy! The bottle lasted me a year and I just thought to review it when I re-ordered it. I would not recommend it as a cleaner wax, but rather a top coat or for waxing good clean paint. You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr David",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Great shine, easy on, easy off",
      "text": "I used this on my SRX today and it looks great. What I liked the best is how easy it was to buff off with the microfiber that came with it. It put a great shine on the old grocery getter.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Tucker",
      "helpful_votes": 2,
      "publication_date": 20190403
    },
    {
      "title": "Good for your paint, plastic, and smells good.",
      "text": "This is excellent wax, goes on easy and it removes even easier. I hate wax that sticks to everything and after hours of working on your car you are unable to get it all off. This wax can go on your plastics, rubber, etc. without worry. Does not leave any white residue on your plastics, smells great, and lasts long.",
      "rating": 5.0,
      "verified": true,
      "author": "P3",
      "helpful_votes": 9,
      "publication_date": 20150812
    },
    {
      "title": "Super impressive shine",
      "text": "Super shine. Not sure if I get a longer bead in the Florida sun but upon initial application it really beads. I think it outshines almost everything I have ever used (on newer paint at least). This is for newer paint or previously compounded bad paint or old paint. Not a cleaner wax at all but its not made to clean. Super high shine, very impressive",
      "rating": 5.0,
      "verified": true,
      "author": "Miquel",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Ultimate Is The Correct Word",
      "text": "When they say ultimate they mean it. I’ve been using this for six years now. I used to wax twice a year. Now I wax once a year and waxing has never been easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Dthunderchicken",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Meguiar's has created the ultimate combination of shine and durability!!",
      "text": "Meguiar's universally makes awesome products for car detailing with very few exceptions....This wax is no exception!! Superior deep gloss shine, with good durability and protection. There are other options that will give slightly better gloss at the expense of durability, and others that will give greater durability at the expense of shine.... This product is the ultimate combination of both!! Well worth the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "MDS Photos",
      "helpful_votes": 4,
      "publication_date": 20160613
    },
    {
      "title": "My new go to wax!",
      "text": "This stuff is great! I purchased a 2018 Durango RT three weeks ago and it felt like it had been some time since its had a nice coat of wax. I got the foam cannon out, cleaned her up, and then waxed er' up one section at a time. Not only is this wax easy to apply and remove but wow, it really leaves a nice durable shine! You can definitely tell that its protecting the paint. I will continue to use this product from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Be A Champion",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Does exactly what it's intended to do.",
      "text": "This is a synthetic paint sealer, not a wax. A wax by definition is a natural product, like Carnuba. The finish is very bright and reflective, and is very easy to wash, especially with a waterless car wash product which I use at least weekly. I prefer the deeper glow of Carnuba, so I overcoat the Ultimate Wax with Carnuba, knowing it won't last more than a couple of months, but with the UW underlayment it's very easy to apply.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Wallace",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "No white residue",
      "text": "Just waxed my new car. Haven't done that in years to previous vehicles. The car shines, is reflective and feels silky smooth. Went on very easy and buffed off easily too. I am not careful and got it on black trim and it comes right off. Now if they could come up with a wax that would last a whole year! Asking too much I think. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "books and cats",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good stuff",
      "text": "We finally used up the other wax and applied this to our 2 cars last weekend to try it out. I ordered it because it is not supposed to leave the white marks on the black rubber and stuff. Well this is a great wax, easy to use, and it as advertised, doesn't leave the white powder on the black rubber stuff and moldings! So I'm a please customer.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy Z",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "So Easy To Use and a Long Lasting Wax Job",
      "text": "This wax was so easy to use and put an excellent coat on my car. I bought a pack of microfiber cloths with the wax which made the job much easier. I appreciated how easy the job was; not much effort was needed, just wax on - wax off. Two months have gone by and plenty of water beads all over the car. I would recommend this product over every other car wax I used. Meguiar's you-tube is an excellent start before using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "T.G. Reiter",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Best, easiest car wax",
      "text": "My \"go to\" car wax. In the summer I wax my car every week. Excessive? Yes, but this wax does a great job. It smells good, goes on easily, and has a nice shine. Applying it, you can feel areas you haven't hit yet because the applicator drags slightly over those spots. It leaves no white wax marks on vinyl or rubber car parts. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "G.J.R.",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Easy application, no residue wax",
      "text": "Goes on and wipes off easily, leaves a very slick surface that beads water very well... Easy to wax a clean mid size car in about a half hour. Leaves no white wax residue in corners. My car is garaged, so cannot comment on how it withstands weather. This is my \"go to\" wax till something better comes along.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Schmidt",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Best wax I've ever used!",
      "text": "This is so easy to apply and remove on cars! I also use it in this formulation on our metal patio furniture, as per the Restoration Hardware manufacturers instructions. Without this synthetic wax application, the furniture finish had a tendency to flake off over the winter. The wax seals and protects against this beautifully. I apply twice a year. On cars, it makes waxing and polishing a breeze with nary a steak and the resultant shine is spectacular! I will continue to use this magical liquid wax forever!",
      "rating": 5.0,
      "verified": true,
      "author": "dianed",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "It's hard to attribute the shine my car now has to just one of the products but I'm very happy. I used this wax after washing",
      "text": "I spent a couple weekends detailing my car recently. Before starting out, I bough a bunch of Meguiar's products from Amazon. I got the Gold Class Shampoo, Clay Kit, Ultimate Compound, Ultimate Polish, and Ultimate Wax. It's hard to attribute the shine my car now has to just one of the products but I'm very happy. I used this wax after washing, claying, compounding, and polishing. I applied it with the included foam applicator pad and removed it with the included microfiber towel. Just go light on the product and make sure to buff it completely out and you'll get great results.",
      "rating": 5.0,
      "verified": true,
      "author": "T.H.",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Best wax I will ever use.",
      "text": "I have used this wax for years and the shine is amazing. The shine last for months. What great about this product is that you can wax you car in direct sunlight and the heat of day if you have to. It dries fast and its easily buffs off. Well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred A. C",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Not impressed",
      "text": "Only tried because of high ratings on various websites, boy was I disappointed. Went on easy and came off easy but left a weird ghosting haze that looks like clouds on vehicle. Was able to buff some out but most I couldn't. So now I have ghost clouds instead of ghost flames. I will be sticking to my old tried and true Turtle Wax paste from now on.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura C",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Meguiar's FTW",
      "text": "Man, I love Meguiar's products! This wax leaves a showroom shine and leaves the paint feeling as smooth as butter. This is my wax of choice that I use on all of my vehicles. It doesn't take much product to apply to a normal sized car. I can get about 4-5 uses per bottle for my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Blair",
      "helpful_votes": 3,
      "publication_date": 20171003
    },
    {
      "title": "Familiar product",
      "text": "I was using silicon glaze on clear coats 30 years ago to finish off and seal after compounding and polishing. Having used Meguiars products back then, I decided to give this highly rated silicon a try, glad I did. Easy on and off, this will be my choice for now. Highly recommend for clear coats.",
      "rating": 5.0,
      "verified": true,
      "author": "JLT",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Nope",
      "text": "Pro detailer, bought to try, won't buy again. The ultimate wax is pure carnauba, nothing compares. This ghosted like mad, had to just re do it with carnauba",
      "rating": 1.0,
      "verified": true,
      "author": "Brian C. Smith",
      "helpful_votes": 4,
      "publication_date": 20180513
    },
    {
      "title": "Without a doubt the best wax you can buy",
      "text": "It goes without saying that you must put the wax on a clean car but it you use a clay bar first you'll be very impressed with the finish this product will put on your car or truck, I've had several of my friends ask me where I got my car detailed, it will make your car look like the day you bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "C-4 Paul",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Would like replacement.",
      "text": "I liked the product the first time I used it. I purchased it in May. I just tried to use it for the second time and it came out of the bottle all chunky and a different color than it was the first time. I shook it up to see if that would help but it didn’t. I would like a refund or a replacement bottle as this one seems to be defective. I stored it the same as I have stored others in the past and nothing happened to the others.",
      "rating": 2.0,
      "verified": true,
      "author": "Steven R.",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Put in the effort then step back and admire.",
      "text": "Used in combination with Meguiar's M21 Mirror Glaze Synthetic Sealant 2.0, 16 oz, the result is astonishing. Washed/clay bar/wax/and seal. One thing though, put the wax away from kids or pets for it smells so edible ( like caramel coffee to me). I will definitely recommend the product(s). With the sealant on, after rainfall I just wipe it down and back to shine; no need of re-waxing.",
      "rating": 5.0,
      "verified": true,
      "author": "Bosun",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Awesome reflectivity and longest lasting protection",
      "text": "Very easy to apply / remove - strongly recommend getting Meguiar's G3500 Dual Action Power System Tool (fits your drill) for fast mirror like finish. Note- this product can be used in direct sun. For best results wash vehicle at dawn or dusk and def get an RV water filter such as Camco TastePURE Water Filter that connects to your garden hose to get the clorine and sediment out of the water which puts those fine spiderweb scratches into your paint.",
      "rating": 5.0,
      "verified": true,
      "author": "James Kane",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Best wax on the market",
      "text": "Hands down, the best option for do-it-yourself car care folks. Long time user of this great protectant for all my vehicles. Wouldn't trust any other product to last as long and leave such a true shine. Worth the money, easy to apply, and last longer than most competitors. I apply every 4-6 months even in the harsh Florida salty air. A must have for the car you plan on keeping around and looking good for a little while.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Register",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Three Stars",
      "text": "It has left stains on some parts of my car. They spot stain when it reflects the sun.",
      "rating": 3.0,
      "verified": true,
      "author": "Hathus",
      "helpful_votes": 4,
      "publication_date": 20180307
    },
    {
      "title": "Best wax ever",
      "text": "This is my new wax of choice, especially for black or dark colored vehicles. This was takes off the gray haze that develops on a black vehicle and it hides surface scratches and scuffs in a way that is just amazing. It goes on clear and leaves no white residue so chips and scratches don't stand out as with regular wax. This goes on easily and buffs off easily as well. I like that it doesn't leave white stuff all over your trim and moldings.",
      "rating": 5.0,
      "verified": true,
      "author": "tanyaj",
      "helpful_votes": 4,
      "publication_date": 20150624
    },
    {
      "title": "Honest reviews",
      "text": "Great product! Was easy to apply and remove. Longevity of it is a couple of weeks I see on my car. May be different with other car finishes. Value for the product is over well worth it in the end of the day. I think it’s a good way to keep your car looking lasting a long time .",
      "rating": 5.0,
      "verified": true,
      "author": "Kouki Chrisp",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Meguiars Ultimate Car Wax",
      "text": "This product is actually a polymer polish/sealant. It is easy to apply and it seems to be longer lasting than most waxes. I don't know if it creates a build-up over the years. In general, I trust Meguiar's products, and have used them for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "jde",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "best liquid wax kit for your money!",
      "text": "the kit the wax comes with is fantastic. the microfiber towel is a large size, and the applicator sponge is just the right size and shape to really help you apply the wax well. on top of that, the wax is so easy to apply, in so many different ways. I don't have fancy machines, but just by rubbing the wax on manually with the applicator and then just wiping clean, my car shines like no other. the biggest thing i notice is that, even at night, my car sparkles. would definitely buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "ne0phyte",
      "helpful_votes": 3,
      "publication_date": 20150528
    },
    {
      "title": "Does what I needed it to.",
      "text": "At first I didn't think it was doing a good job but as I kept rubbing with the included microfiber towel, the shine progressively got better and better. Haven't seen how it beads water yet but if imagine it'll do ok. Easy to apply and work in. Make sure the vehicle is clean and cool before you start. When removing, use a microfiber towel and give it a good polishing action. You'll see a good shine in no time.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott The Wolf Tamer",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Not worth the price",
      "text": "Goes on easy.Leaves streaks and film on black vehicle.Lots of labor to get out streaks.Zymol is much easier to use at half the price.Zymol works better on black than this product.",
      "rating": 2.0,
      "verified": true,
      "author": "Raildawg1",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "The best wax I have ever used and I have been waxing cars for 40+ years",
      "text": "This wax goes on very easily and comes off very easily. It is almost clear, meaning it does not make the mess that some waxes cause if you get them on rubber trim or flat black paint. This wax is nearly invisible regardless of what you put it on. I used 2 full containers to do a 38 foot Class A RV, and it shines like a new car; repels water ; and allows road dirt and grime to wash off very easily. I highly recommend this product and do follow their instructions regarding the use of a microfiber cloth to remove the wax. Microfibre cloths work MUCH better than cotton rags or any other materials I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Coates",
      "helpful_votes": 4,
      "publication_date": 20131231
    },
    {
      "title": "Easy to apply and remove, no residue left anywhere!",
      "text": "This was the EASIEST wax I have ever used. Carbanua just puts a wax layer for looks, this adds some better protection, and if your car is black and has a good clear coat on it, it will be mirror gloss. I don't think it's as good as a sealant, but using this with Meguair's Quik Wax in-between regular waxes - my car is looking like a wet mirror.",
      "rating": 5.0,
      "verified": true,
      "author": "CLTGUY",
      "helpful_votes": 2,
      "publication_date": 20170213
    },
    {
      "title": "great product",
      "text": "This is my first time to use Meguiar's product. So far so good. It makes my car shine. Easy to apply by hand and easy to wipe off compare with Turtle paste wax. I hope this will last longer.",
      "rating": 4.0,
      "verified": true,
      "author": "nel",
      "helpful_votes": 3,
      "publication_date": 20171031
    },
    {
      "title": "Good car wax",
      "text": "This is oh so easy to work with and has held up this winter very well. I used it on our vehicles just before winter hit and you can visibly see that it is still effective. Water slides off and the shine is real nice.",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Great wax for the money",
      "text": "This wax is by far the best wax that is offered by Meguiar's! Providing UVA and UVB protection, along with intense water beading and water spot protection! The main issue i have with this product is how it hazes. it is clear on my white car. I spent more time going over my car to make sure I removed all the wax, then it took my to apply the wax in the first place. However, I did use this wax on my girlfriends black car, and the wax was visible when it hazed. Nonetheless, it applies easily and smooth and removes in a similar fashion. I will definitely recommend this product to anyone who doesn't have a white car.",
      "rating": 4.0,
      "verified": true,
      "author": "spencer",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Deep long lasting shine and plastic/rubber friendly.",
      "text": "This is the first synthetic/polymer wax I have used and I am very happy with the results. It leaves a deep long lasting shine, which lasts much longer than other waxes I have used. In addition, I gave always had problems with other waxes leaving a white residue particularly around mud flaps, trim, etc. This wax leaves no white residue once wiped off, even on or around plastics and rubber. I will definitely buy this wax again. I could not be more satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCalJim",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "didn't use a whole bottle on a 40 ft motor home",
      "text": "This stuff is great. Takes a good full body paint and makes it sparkle. I did it by hand using a plastic handle w/pad . Don't use too much and have clean soft microfiber towels to remove it shortly after it dries (minutes). Didn't even use 16 oz on the whole coach. What a deal. Rain fears it, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mich Yooper",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "It works.",
      "text": "My car headlights looks new after the application. Definitely willl buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "rechevarria",
      "helpful_votes": 2,
      "publication_date": 20190427
    },
    {
      "title": "Good product",
      "text": "I am satisfied and happy with my purchase at the moment and see no issues with the quality and effectiveness of the product as it works perfectly as intended.",
      "rating": 5.0,
      "verified": true,
      "author": "Almighty Pain",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Best wax around?",
      "text": "This wax is phenomenal. Goes on easy, wipes off easier. I even use this wax for the black plastics on my car as I accidentally found it makes them look great. I usually put on 2 or 3 coats for good measure. It beads water and looks awesome for easily 4-6 months like it's a fresh coat! Buy this stuff! It's better than carnauba all day long, hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocksconsin",
      "helpful_votes": 5,
      "publication_date": 20161021
    },
    {
      "title": "Great Wax",
      "text": "I used this as a base coat for my new Chevrolet Equinox and appreciated that it did not discolor my auto trim. The finish looks amazing and it did not take that long to apply. I added a top coating of Ultimate Fast Finish to seal the base wax application. I strongly recommend this product and recommend the UFF as a top coat.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger J.Top Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "perfect wax for beautiful looking car",
      "text": "This is a great product from a great brand! I have switched over to using Meguiar's products exclusively on my cars. The product applies very easy and is removed just as easily to reveal a deep dark shine. I have yet to be disappointed with any products from this line and this liquid wax is no exception! This product is perfect for the in between waxing. I use this liquid wax 2 times in between using the paste wax. With this combo, my car always looks fantastic! I think everyone should try it out",
      "rating": 5.0,
      "verified": true,
      "author": "todd",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Just a wax. Need another product to do the work",
      "text": "I really like meguiars products, but not this one It will not blend out any marks, it will not remove any kind of smudge or grit. So you have to use another product first to get the paint clean and smooth. Then you can use this wax",
      "rating": 3.0,
      "verified": true,
      "author": "Heaven Can Wait.",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Meguiar's a Shining Star",
      "text": "It's been years since I've polished a car. Since I've recently retired, I have more time. And since I just bought a new car, I decided to polish and protect my new investment. Using Meguiar's ultimate liquid wax was easy and in no time at all I was able to polish my new 2015 Cruze. Now I feel as I used to as a young teenager cruising the boulevard with a shiney and clean car and a full tank of gas. Applying this polish was easy and in buffing it out took little or no effort. This is a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard C. Geschke",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "Easy to apply, lasting protection",
      "text": "I used this along with the ultimate polish on my Ram 1500. Product actually smells really good and goes on with ease using my handheld orbital buffer. After waxing I noticed much more depth and gloss in the paint. I drive on the highway often and hit a lot of bugs, much easier to remove with a layer of Meguiars Ultimate wax already protecting the paint. Make sure you shake the bottle well before you apply. I've used a few other equally priced brands and meguiars is the best so far. I have not tried some of the speciality/pro stuff but I'm overall very satisfied with the ultimate product line.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett Smith",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Not like the reviews on Amazon",
      "text": "rain fell the next day and no beading...difficult to apply and had to constantly wipe to polish..use as directed..would not buy again",
      "rating": 1.0,
      "verified": true,
      "author": "titern",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Fantastic shine...easy on...easy off",
      "text": "Best wax I've ever used. Meguiar's Ultimate Liquid wax goes on so easily and comes off so easily, yet it leaves a brilliant shine and a super slick coating on the paint. PROs: Easy on...easy off...Fantastic shine CONs: None. I think the pictures are worth a thousand words. This wax is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Very good wax that is easy to apply",
      "text": "Excellent wax that is easy to apply. Its hard to screw up wax, you put it on and take it off. This stuff did that within about 15 minutes and looks great now. Do not know how long it will last, but it was so easy to put on it wouldn't be too difficult to re do the polished scratches I was working on. I was spot waxing 2 parts and the wax blended very well with the rest of the 2 panels, restored the shine without making it stand out from the rest of the piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20150916
    },
    {
      "title": "Since I like to apply it with a DA polisher that means ...",
      "text": "I bought this because it claims not to whiten black trim, and in my testing, it really doesn't - it even cleaned up spots where I'd gotten other wax on the black parts previously. Since I like to apply it with a DA polisher that means I don't have to take the time to mask everything before I start, so I can fit a wax job into my busy weekends more often. Other than that, I'm not super picky about wax or brands - it seems fine, goes on quick, polishes easy, and makes the paint shine.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 2,
      "publication_date": 20150202
    },
    {
      "title": "Misleading Description",
      "text": "I like it so far. Applied water to paint after using wax and it beaded off nicely. The only thing is the description says \"Full application and wipe off in full sun\" but when I read directions it said apply in shade to cool surface. It also says let dry 3-5 minutes which is not nearly long enough. Hope they didnt mislead me on anything else.",
      "rating": 4.0,
      "verified": true,
      "author": "Crowbar",
      "helpful_votes": 2,
      "publication_date": 20160917
    },
    {
      "title": "Easy on, easy off.",
      "text": "Purchased to use on a new vehicle. Instructions were clear and easy to follow. The product when on easy and off just as easily. I used the two recommended coats and feel it gave great results. The shine is very nice and after two weeks, it appears as good as the day it was applied.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Everett",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Easy to apply and remove great shine and lasts !!",
      "text": "I was a NuFinish user until I tried this.....Im sold on it , so easy to put on and remove does not leave white residue on your plastic trim parts. The shine is also great and so far has held up as good or better than NuFinish",
      "rating": 5.0,
      "verified": true,
      "author": "Matt S",
      "helpful_votes": 2,
      "publication_date": 20180415
    },
    {
      "title": "Good brand but Not their best product.",
      "text": "Does not work well, and my car is kept in a garage not outside. Shine doesn’t last and the finish is not as smooth as it should be. It’s just like a temporary fix and I’m not ok with a 2 hour job being temporary",
      "rating": 3.0,
      "verified": true,
      "author": "michael mark sayegh",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "not prevent water stains",
      "text": "My car still takes water stain just like before using the wax. I wish I could return it, but returning window is closed :( total waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Easy to use and does the job",
      "text": "Honestly, this is the first wax I've ever bought an used. I used to get my car hand washed or run it through the gas station wash. I recently decided to start washing my car at home to save money, so waxing is new to me. It leaves my car shiny and the water beads really well. I wash my car every week. I wax every other month and use the Meguiar's Quik Wax in between waxes. I have no complaints honestly. Easy application and removal compared to the paste wax my mother used to use in the 90's.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda M.",
      "helpful_votes": 2,
      "publication_date": 20150411
    }
  ],
  "product_meta": {
    "title": "MEGUIAR'S G18216 Ultimate Liquid Wax, 16 Fluid Ounces",
    "description": "Size:16 Fluid OuncesMeguiar's Ultimate Liquid Wax uses Meguiar's ThinFilm technology to deliver our easiest application and removal, even if you have to wax in full sun! Meguiar's proprietary Hydrophobic Polymer Technology increases surface tension so water beads and rolls right off. We've re-set the bar with a pure synthetic polymer wax that provides extended protection with amplified reflectivity for incredible depth & mirror-like shine. It does all of this without leaving white residue on plastic and rubber.",
    "rating": 4.6,
    "feature_bullets": [
      "ONE EASY STEP: Formula delivers maximum synthetic protection, durability, depth of color, and reflectivity in this easy one step",
      "EFFORTLESS APPLICATION: Thin Film technology provides for easy application and wipe off even in full sun, and will not stain non-painted trim pieces white",
      "LONG-LASTING PROTECTION: Advanced synthetic polymers crosslink to form a long-lasting protective barrier while amplifying reflection for incredible depth and mirror-like shine",
      "WATER ROLLS RIGHT OFF PAINT: Hydrophobic Polymer technology increases surface tension to protect paint",
      "SAFE AND FLEXIBLE: Safe and effective on all glossy paints and clear coats, and can be applied by hand or dual action variable speed polisher like Meguiar's MT300 Dual Action Polisher"
    ],
    "specifications": {
      "Manufacturer": "Meguiar's",
      "Brand": "MEGUIAR'S",
      "Model": "G18216EU",
      "Item Weight": "1.54 pounds",
      "Product Dimensions": "5.51 x 5.51 x 3.54 inches",
      "Item model number": "G18216",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "G18216",
      "OEM Part Number": "G18216",
      "Folding": "No",
      "Cover Included": "Ultimate Liquid Wax",
      "ASIN": "B004HCM9H4",
      "Customer Reviews": "4.6 out of 5 stars4,146 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#355 in Automotive",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "Date First Available": "December 27, 2010"
    },
    "categories": [
      "Waxes",
      "Car Care",
      "Automotive Parts & Accessories",
      "Exterior Care",
      "Car Polishes & Waxes",
      "Automotive"
    ],
    "price": 18.74
  }
}