{
  "website_summaries": [
    {
      "verdict": "Don't want anyone to know you're just chilling? No problem. With these ultra realistic faux denim pajama pants, no one will be the wiser.",
      "pros": [
        "Realistic distressed denim detailing makes it difficult to distinguish these comfy lounge pants from jeans",
        "Has an adjustable drawstring waistband, 2 side pockets, and a fully functional fly",
        "Made of 100% cotton",
        "Comes in blue and black"
      ],
      "cons": [
        "Expect some shrinking after washing",
        "Legs run long"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Incerdible pantaloons!",
      "text": "These pants are outstanding! Bought them for my husband, who is an incredibly \"stylish\" man. They are super comfy, have a drawstring, and look hilarious. They run a little small, however. Glad I read previous reviews and ordered a size up. My hubs is 5'11\", 165 lbs and typically wears a medium, but the large fits him perfectly. I'll be buying more of these pants for my brothers, who are equally \"stylish.\"",
      "rating": 5.0,
      "verified": true,
      "author": "HannahO",
      "helpful_votes": 66,
      "publication_date": 20151219
    },
    {
      "title": "Full 80s",
      "text": "They fit very well, I feel like a male model strutting around the house. Because they were made to look like acid wash jeans I felt like I should go \"full 80s\" and work shirtless at a construction site and poor Crystal Pepsi all over my head and chiseled abs!",
      "rating": 4.0,
      "verified": true,
      "author": "manowar2000",
      "helpful_votes": 51,
      "publication_date": 20160210
    },
    {
      "title": "Everyone loved them, 38 waist is a large I would guess",
      "text": "Bought them as a kind of joke-ish. I came down xmas morning and my daughter was surprised and said something like OK, I guess you can make those work and then asked why I was wearing jeans. She was about 12-15 ft away I guess. I said they're pajamas so she came closer and was pretty surprised. She asked if the buttons were real (they aren't). I got the same reaction from my wife. was probably most surprised by just how comfy and soft they are. II got the large and \"m a 34 waist. they are a bit too wide and a bit too long. probably fit a 36 or 38 best.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary B",
      "helpful_votes": 5,
      "publication_date": 20200107
    },
    {
      "title": "\"Denim\" Pajama Pants",
      "text": "My husband and my dad both got a real kick out of these. They're fantastic! Comfortable, well-made, and look nice. I have to add a word of caution, though, about the sizing. They run small, so order the next size up from your normal, or you'll be stuck washing them in cold and letting them air dry...... if they're not already too tight to begin with.",
      "rating": 4.0,
      "verified": true,
      "author": "Michele",
      "helpful_votes": 120,
      "publication_date": 20121014
    },
    {
      "title": "Super Comfy",
      "text": "revised review, The first pair I ordered fit perfect and the length was great but it had a tear in the seam which could not be repaired so I returned it and they sent me a second pair. The second pair after I washed uthem the first time Shrank about 4 inches so now they are very short and look somewhat ridiculous. I cannot understand why the first pair didn’t shrink and this pair did the first time I washed them. Even though they are extremely soft and comfortable it does not outweigh the fact that they look very strange because they have shrunk so much.",
      "rating": 2.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Fun loungers",
      "text": "What fun. I love these pants. I use them for lounging. As other reviewers have noted they do shrink after washing and drying. I am a woman's size 8 and ordered the size large to get the length. I will have to shorten them, but will wait until they are washed and dried a couple of more times. Until then I turn down the waist when I am walking around and then enjoy the extra length and roomy fit when relaxing on the couch.",
      "rating": 4.0,
      "verified": true,
      "author": "Alice Steinmetz",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "well...",
      "text": "Ok, these are amazingly comfortable lounging pants and while I do love them for that, OMG, I so wish my legs were like 2 feet longer!! Seriously, they are soooooo long in the inseam, so now I have to find someone to hem them up :( oh well, still comfortable so I will keep them. Ohhh, one thing all should know, with all these style pants, the fly is open and not sewed, velcroed or buttoned closed, its very open, so I had to sew mine closed.",
      "rating": 5.0,
      "verified": true,
      "author": "John D.",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "So fun and comfortable...",
      "text": "These are so much fun and my hubby loves them! One night and they were instantly his favorite pajama bottoms. Best part is he doesn't need to change when he walks the dogs. They fit as suggested on the reviews. I bought one size up and at first they were too big, but now after washing them they fit slightly loose and comfortably. The material is super soft and good quality... We will be buying more if these, probably sooner than later, because he practice lives in them. Great gift for your guy!",
      "rating": 5.0,
      "verified": true,
      "author": "Gone Guano and Barking Mad",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "I love them! Will definitely purchase more!",
      "text": "I purchased a pair of these at Kmart several years ago and wore them out. Was glad to find these online at a even cheaper price. I'm five foot seven, and I bought the small size. They were about a half an inch to an inch too long. However, after washing them and drying them on the low cycle,they fit this 54 year old guy perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Ran Ran",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "Great, but if only they held up better",
      "text": "I have gone through two of these, lounging around the house. They are pretty comfy and thin material that doesn't get too warm. The only downside is that the knee wore out on each pair I got pretty quickly, which knocks it down a star on the comfort. If you don't mind the \"extra worn\" appearance having an actual hole in them, then grab one! Otherwise, I recommend a slightly higher quality.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "My husband's favorite",
      "text": "My retired husband has been looking for another pair of these. He wears them every day. Every. Day. He feels that if he gets seen in them they don't look like he's still in his pajamas. Evidently they're very comfortable. Tag is \"Under Disguise\". I have to order another pair because the first two pair he bought at a store years ago are seriously worn out. Only ordered one as I wanted to make sure they were the same kind. He's excited, I'm not really, lol, but am glad he's comfortable. Edit: Just went to order another pair and price went up $11, say what?",
      "rating": 5.0,
      "verified": true,
      "author": "Gail",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "I approve.",
      "text": "FYI: These shrink a solid 4 inches when you wash-warm and dry-warm. I’m 6’1” and the size Large fits me perfectly *after* shrinking them in the wash. I also want to say that while these appear like jeans, the fabric is incredibly ‘flowy’ so it’s quite apparent when you walk that they aren’t jeans. I bought these so I could be lazy and go to the grocery store and no one would be the wiser - didn’t work. But for the record, I liked them so much I bought another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Holden Caulfield",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Caution!  These shrink a lot!!",
      "text": "Purchased as a gift for my husband. The length of these were way to long for my husband but shrank A LOT when they were washed. The length is almost perfect now! Love the look of them. At first glance, they really look like jeans. My husband says they are comfortable to sleep in as well. The only thing I was unhappy about was the price. I don't like spending $30 for a pair of pajama bottoms. I think that is ridiculous but figured my hubby was worth it, at least at Christmas time! LOL I would not however buy from the seller again only because of the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzy Berens",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "The sizing is incorrect",
      "text": "gift, they are soft and very comfortable. The sizing is not correct, that is the main problem. They are like a size off. If you want a medium you would need to order a large. They will draw up, so you have to be careful when you wash. We liked the comfort of the items so much that about four pair. One for my husband, myself, my son-in-law, and my daughter. We all love them they are so comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "p.p.",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Yay! My husband loves them!",
      "text": "These are so cool. it's like a photograph of aged jeans. It easily fools the eye from accross the room. My husband LOVES wearing these after work or when relaxing because he can always answer the door, or talk to a neighbor without looking like he has pajama pants on. The Length is fantastic, and DOES NOT SHRINK in the wash. I have two other branded pairs and they shrunk near about to his knees! I bought only one pair of these. Now I will buy more. Please make these in a 'Black Jeans' version. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Williams",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "***ALERT**do not buy",
      "text": "I liked these so much when I got them that I ordered another pair. sadly every time I washed them the legs shrunk! inches at a time. now, many washes later they are so high water that I get angry every time I wear them. Will likely either cut one pair up to sew onto the legs of the other pair or just toss them. I would gladly pay more to get a similar pair that does NOT shrink!",
      "rating": 1.0,
      "verified": true,
      "author": "KenNQC",
      "helpful_votes": 8,
      "publication_date": 20151023
    },
    {
      "title": "Comfy but be careful in size choice",
      "text": "Super soft and comfortable!! Be aware there is a huge difference in size between medium and large. Medium is roughly a size 30/32\"waist X 30\" length and large is about 34/36\" waist X 34\" length. I'm 6'1\" with a 30\" waist. The medium fits great everywhere except the length which is about 1.5-2\" too short. The large is really big all over and at least 3 inches too long for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack S.",
      "helpful_votes": 3,
      "publication_date": 20170624
    },
    {
      "title": "Fits big and tall right on",
      "text": "They are so cool,look like jeans from a distance and close up. Very comfortable and the size is right on,I'm 6'2\" and 330lbs and the 2x I ordered fit perfectly. I highly recommend getting a pair for yourself.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl J T",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Crap quality but good for a costume",
      "text": "For a 2xl they shrunk quite a bit. Too short for me and I’m 5’10 so can imagine any man would find these too short. These worked great for a Halloween costume, but I brushed up against a wall decoration and it ripped a hole in the pants. They’re pretty thin. Wish these were better quality. Between the hole and being too short they were thrown out after I used for my costume.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie DaCorte",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Fall apart after about 10 washes",
      "text": "Like the pajama and the way it feels. bad part is you only get to enjoy it for few weeks. After about 10 washes or so, the pant started to rip and everything just started to fall apart.. very cheap and thin material. If you have money to throw away, this product is great for you.",
      "rating": 1.0,
      "verified": true,
      "author": "DinoB",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Three Stars",
      "text": "meh. Well, I thought I'd update my initial review which, admitedly, was somewhat cryptic and probably unhelpful. But my update will try to summarize the \"trail of tears\" of so many Amazon apparel items. I received the 5 PJ's that I ordered and wore all of them for approximately a month. After the first washing all but one shrunk so that, what once fitted me perfectly in length, now 4 of them had shrunk so that they now fitted between my knees and ankles! I'll cut to the chase and say that those four have made excellent (all be it) expensive automotive wash cloths. Yep, I can brag about my expensive wash cloths. Thanks!",
      "rating": 1.0,
      "verified": true,
      "author": "juandelpueblo",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "There are pros and cons to these pjs",
      "text": "First off, I fell in love as soon as I held ‘em up. Very long in the leg, expect some shrinkage. Very comfortable. Almost feels like wearing nothing at all. That is the Pro side. Now for the Down side. No button on the open fly. So wear underwear, unless you want your junk to keep popping out. Since the cotton density is so thin ( someone posted saying it was thick, so not true) , not expecting them to last more than a few washes. I’ll be surprised if they last 2 months. If they do, I’ll order another pair or two, if not... won’t buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Had high hopes, nice design & fabric but Large Shrank to less than Medium size after 2nd wash",
      "text": "After reading the reviews I was prepared that this will shrink after first wash.. so I ordered Large size with hope that it will fit to my size (medium) after washing and it did.. but after 2nd wash it shrank further... now I dont know what to do, return a 2 times washed pajama I really liked fabric feel n design.. really had high hopes..",
      "rating": 2.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 4,
      "publication_date": 20170313
    },
    {
      "title": "Stylish and fun",
      "text": "I got these for my boyfriend as a fun gift , he always wears jeans and I felt this was a cute way to get him out of jeans with the same jean look lol he loves them and so do I. He says they are comfortable. A little baggie but doable because they are Lounge pants. Very good buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Keller",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "HUBBY LOVES THESE...",
      "text": "BUGHT FOR MY HUSBAND'S 55TH BIRTHDAY 7 YEARS AGO...HAVE HAD TO MEND THEM A FEW TIME AND THEY GOT THIN AS TISSUE PAPER...HE STILL WORE THEM...I COULD NEVER THROW THEM AWAY TILL I GOT THE EXACT SAME ONES, SAME PRICE...HE LOVES THEM...BUT STILL HOLDS ON TO THE OLDIES...GO FIGURE...",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Excellent Faux Jeans",
      "text": "Fit was a bit large. After one washing, they fit perfectly due to shrinkage because 100% cotton. Very comfortable and lightweight. Great for summer lounging around the house or as PJs in winter. Very happy with them. Has a front fly, but no button to keep closed.",
      "rating": 5.0,
      "verified": true,
      "author": "PK1950",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "I purchased these men's pajamas as I like the design and pockets",
      "text": "I purchased these men's pajamas as I like the design and pockets. I'm a female so I purchase one size smaller than my size. They fit just right, not tight and not too loose. Plenty of room to wear around the house on days where you are not going out. However, these pants are great for wearing outside too; no one will know they are pajama bottoms. I pre-washed these prior to wearing and stitched the fly section closed with my sewing machine. They washed fantastic! I'm looking forward to having these for many years.",
      "rating": 5.0,
      "verified": true,
      "author": "SewBusy",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Fun Pants for the Forever Pajama Wearer",
      "text": "I bought these for my son who lives in pajama pants. They're surprisingly soft fabric that feels good to the touch. It's a light, thinner fabric so they're not hot to sleep in. The printing is good quality with the faux belt loops being clear on the waistband and the pockets and button fly are all detailed. They fit my 6'2\" son nicely. He's thin so there is a lot of comfort room for him. Overall, they're fun and more of a novelty item.",
      "rating": 4.0,
      "verified": true,
      "author": "Jami Lilo",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "coupled them with a dark blue T-Shirt and they are the softest most comfortable PJ's I own",
      "text": "When I ordered these I was preparing to have a full hysterectomy and was looking for comfy pants that I could sleep in as needed while recovering but still look presentable if people stopped by to see how I was doing. I know these are for men but I saw in reviews that they shrink so I bought the size I wear even though its men's PJ's......then washed them in hot water and dried them, coupled them with a dark blue T-Shirt and they are the softest most comfortable PJ's I own. My husband loves that they look like jeans.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Olsen",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "Great quality.  Great fun.  Easy to complement.",
      "text": "THESE ARE GREAT! They are fun. They get a laugh or complement. They are so well made. The art is as good or better than pictured. Give your loved one a laugh. Slip them on and get a second look. I am not a model but I am glad to model these. The quality is great. The real front pockets behind the fake pockets are perfect. The hidden fly behind the fake fly is so great, I wore them 3 times and did not even notice they had a fly. It stays closed because of a smart design Very comfortable. Great for coming down in the morning or wearing before bed. I will look for more products from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Software Dev",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Comfortable and convenient",
      "text": "I had surgery lately, and wore these to the hospital for the ease of on and off. The nurse did a double take saying she thought I had blue jeans on. They did their job. Very comfortable, and convenient with the pockets. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimbo210",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "WOW Great",
      "text": "I ordered a Lrg. I am 6 foot 218 and have a 38 inch waist. Theses fit perfect right out of the bag. Not tight but not lose. Very soft but not thick. Now I have not washed them yet but plan on doing that in cold and just hang drying. 100 cotton handle with care UPDATE washed several times in cold and just hung to air dry and the still fit the same way they did out of the package",
      "rating": 5.0,
      "verified": true,
      "author": "maz",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Comfortable for around the house",
      "text": "These are great for around the house lounging during the spring and summer months. Arrived before scheduled date.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra J. Sheldon",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great Lounging Pants",
      "text": "These are great lounging pants. This is about the fourth or fifth pair I have ordered. Have given them to my sons and nephews for Christmas and they all love them. Ordered a pair for my husband. He forgot I had given them to him and he never wore them so I confiscated his. When he saw me wearing them all the time he wanted them back, which I refused to do, so I ordered another pair for him and he loves them. They are well made, came when promised and have stood the test of me.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Langford",
      "helpful_votes": 2,
      "publication_date": 20160713
    },
    {
      "title": "Perfect Loungers",
      "text": "Ok let's face it.. you're buying basically sweatpant jeans.. not the most fashion forward purchase you're going to make... however, for what they are, they're awesome.. it's a MUCH lighter material than i was expecting- def more of a yoga pant, lightweight, could wear these in the summer thinness.. Do they look like jeans? umm, not so much... from a distance sure, close up no way.. but with the material you're not trying to wear these outside (maybe a quick walmart run, MAYBE) and shrinkage? I really didn't have any but i wouldn't have minded a little bit of a shrink since i ordered a size up just in case.. Lounge away in these!",
      "rating": 5.0,
      "verified": true,
      "author": "Cory",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Too fake looking- not like the picture",
      "text": "Very disappointed because they look NOTHING like the picture. The color is way too white and they look extremely fake. Obviously they aren't real jean material, but I don't think they could even pass as jeans from far away. I would like them more if the front pockets were actually real (instead of the side pockets), if they had real buttons, if the drawstring wasn't on the outside (less noticeable) and if all the detail didn't look as if a child drew it on with a crayon. Also, the material is very thin. My boyfriend literally wears jeans to bed, so I wanted to get him pajamas that looked like jeans. lol",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Buy again",
      "text": "Bought these for my son after he seen his grandfather in a pair. He thought they were just a pair of his old jeans that he lounged around the house in till he found out they were pj bottoms then he had to have a pair.. he loves them , they wash up nicely.. over all they are very nice product. My other son had to have a pair also, so yes would buy again..😊",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn ",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Great",
      "text": "My dad loves PJs that look like jeans (he has 2 other pairs). I could tell he was really excited about these. Fair warning though, these do think in length, just so happened, he need them a little shorter.",
      "rating": 5.0,
      "verified": true,
      "author": "Symone ",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Comfy and unusual",
      "text": "I LOVE THESE - my wife is growing more accustomed to them after her initial \"those are absolutely hideous\" reaction (she is not a big fan of the shabby jean look plus wearing what are basically pajama pants designed to pass as jeans seems does seem a bit \"bubba-esque\") but they are GREAT for lounging around the house or yard in those long, lazy late summer afternoons. They are fairly lightweight, so they are better for warmer climes so here in Northern California I tend to wear them on those warmer days and opt for a more heavy weight option on cooler evenings.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Lopez",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Great product, pee hole so be careful",
      "text": "Great product. Very light and thin pajama material with a pee hole that can't be closed. I bought these to wear to work because I can't wear a belt due to lower back pain. I wore sweat pants underneath and they were perfect for wearing to work. Has an elastic waist band and draw string. Worth the money for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Bronx",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Comfort & Cool",
      "text": "I am a mature female (70) and I've bought 4 in 2 different colors. They're super comfortable, large pockets and cool for summer wear. People don't realize they're not jeans. Super Cool!",
      "rating": 5.0,
      "verified": true,
      "author": "KRM",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Just what I wanted",
      "text": "I have a pare of black ones by a different manufacturer and I wanted a blue one also. That way when I go outside for the paper in the morning they will not look like I am wearing PJ's. Just what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Bought these as a joke",
      "text": "I just thought it would be humorous for the fam if I just casually walked out with these new party pants. I didn't expect them to be so freakishly comfortable so the joke's on me. I wear them all the time! Great pajama bottoms, perfect Saturday morning hangout pants. I love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick L. Chambers",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "My wife says I can't leave the house wearing these.....",
      "text": "so, my good wife says these are ugly...I think she doesn't understand modern art! Besides, they are for lounging in comfort, not for the fashion cat-walk. So very comfortable, I love em!",
      "rating": 5.0,
      "verified": true,
      "author": "James T. King Jr.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "SO, SO SOFT!",
      "text": "This was my third purchase of these Denim Pajama Jeans. Without a doubt, these are the most comfortable pajama jeans ever! These are designed for men, however, they are great for women, too! Wearing them on rainy weekend days, after a long day at work, sleeping, or relaxing ANYWHERE...feel so, so soft. I will be purchasing more very soon. Plus, this is a great price! I have seen these exact pajama jeans in numerous magazines costing much more!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra L.",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Nice, comfortable Lounge pants",
      "text": "These are nice, soft very comfortable lounge pants! As far as the fit, I am 6'1\", 260 #'s, and these pants are sufficiently baggy. They are rather long. Haven't washed them yet, but I'm hoping that they shrink some. The only thing I think could make them better.... I wish they had at least one button on the fly.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Rogers",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Excessive Shrinkage",
      "text": "Excessive shrinkage after first washing, went from full length and shrank to the mid calf.",
      "rating": 1.0,
      "verified": true,
      "author": "daniel.chapa",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "These resemble ripped jeans at a distance.  Nice for pajama bums that want to go out and get the mail.",
      "text": "I love these. I can put these on with a tee shirt and walk out to get my mail or turn my sprinklers on and off and not look like a pajama bum. The material is tee-shirt type, its kind of thick and stretchy. They seem warm for what they are, I'm thinking there might be some polyester mixed in although the tag says 100% cotton. The quality and stitching are fine. They do seem a little tight in the butt and \"dmz\" area but not uncomfortably so, compared to other similar size pajamas. At a distance or in dim lighting closer up, these do appear to be badly ripped jeans.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "These were pretty much what I expected",
      "text": "These were pretty much what I expected, having been warned by other reviewers that they would shrink considerably in the wash. They did, but I had guessed correctly -- one size larger than I usually get. They are definitely lightweight pajamas, but I enjoy wearing them as lounging pants, too, but just around the house. I do not think anyone seeing them would mistake them for real jeans, despite the photos. The actual product is much blurrier in appearance. I give it 3 stars because it was what I expected, certainly no more.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "THIS IS A GREAT ITEM!!",
      "text": "I ordered two pairs of these pants, one for me and one for my husband. These are to replace the pairs that we have had for about 10 years. They are even the same brand. We have worn our old pairs so much that they were finally wearing out. These new ones are just as wonderful and are a little bit longer. We are looking for many more years of comfort!! We ordered both pairs in size medium. My husband wears a 34\" waist and I wear a size 8, and the mediums fit us both perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita Bentley",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Men's Generic Faux Denim Pajama",
      "text": "I bought these to work in my art studio.. light loose and comfortable. However, these are VERY large... I used the size chart provided and let me see if I can clarify... I am about 5 foot 9 with a 40 waist (presently)... these were about 5-6 inches too long, with a huge waist and the thigh looks to be about 40 inches around.. so consider that when ordering.. other than that, these are loose, comfortable, nice thin material and look faded tore up jeans.. I will order a new pair that fit though.",
      "rating": 3.0,
      "verified": true,
      "author": "The Confederate Artist",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "you must get these!",
      "text": "these are really really fun! I had to get a 3rd pair(these), as I wore out 2 others. I cut the legs off at the knee, and not only sleep in them, but scrounge around in the yard wearing them. they are super soft, very comfortable, well made, and certainly start a conversation! I usually wear a large, but had to go up a size because the large was sold out! they are relaxed fit, with big legs, and lots of stretch in the waist. also are unisex!",
      "rating": 5.0,
      "verified": true,
      "author": "Claire Richardson",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Perfect lounge pants",
      "text": "Husband loves them! They replace an ancient pair I had bought him several years ago but which are falling apart. They fit just as expected (he's 5'9\" and they fall about an inch below his heel, which isn't terribly bad.. I told him to hike up the waist band, problem solved). They look exactly like the picture. Quite soft and unlined.",
      "rating": 5.0,
      "verified": true,
      "author": "Tekkiechikk",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "If HEF can do it, so can anyone in these.",
      "text": "A little large (baggy) and slightly long for my 29 1/2 inch inseam. They're comfortable, but the material is a bit like flannel and can get warm. I can wear them down to the mail box and to the car and the neighbors think I'm in my scrubby jeans. I wish there was a matching top. My wife said if they are that comfortable, I should wear them to the store when I need an item or two. I haven't gotten up that much nerve, yet - but I'm thinking about it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ivanhoe",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Great looking and great fitting",
      "text": "Great looking and great fitting, with one unpleasant surprise. When I purchased a similar product there was a button for the fly. Not so here. You will accidentally expose yourself multiple times unless you twist the fly sideways or wear underwear. They need to have something to close the wide open fly. For obvious reasons I won't include a photo.",
      "rating": 4.0,
      "verified": true,
      "author": "RickR",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Too baggy",
      "text": "The reviews that say they run small are totally wrong. I ALWAYS wear medium and the medium fits as normal in the waist. I like the look of the pjs. But, I don't like the cut of the legs. The legs are cut very large. In the morning, they are always pushed way up my leg -- like above my knee. I guess they are supposed to look like baggy jeans, but since the material is so much lighter than denim, it tends to ride up.",
      "rating": 3.0,
      "verified": true,
      "author": "S. C. Broshar",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "They almost look like you are wearing jeans",
      "text": "Fun and comfortable. They fit fine although a bit longer would be nice. We will see how many washes they endure before they get tossed on the car wash rag pile.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Kovarik",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Good Product....",
      "text": "I had a lil' concern from some of the reviews I had read about these. I got two pair...because of the price. I intentionally washed one pair and dried them just to see if the shrinkage was like some had said. Maybe some on the length but, nothing that bad and as far as the waist size.....there seems to be no difference. They are comfy to wear and light weight enough to feel like nothing. I even fixed the issue with the open fly with a little Velcro.....js",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne Butler",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Very good",
      "text": "My hubby an kitty love these soft pajama jeans. 100% cotton so I wash them in cold an hang dry. I might get them if they “accidentally” get put in the dryer and shrink",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda brown",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "These are comfortable and cute - but first",
      "text": "These are comfortable and cute - but first, they are nowhere near as cool-looking as they are in the picture. They are just cotton pj pants. Second, they fit me perfectly - they were even a bit long - until I washed them. Washed in cold, dried on medium heat. Now they are at least four inches too short! And the waist is so snug now, I can't wear them anymore. These don't run small, they shrink. A LOT. Incredible waste of $$ in my opinion. Stay away from Paul Frank stuff - I should have known better.",
      "rating": 2.0,
      "verified": true,
      "author": "SemiMental Fool",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "The most comfy pants you’ll ever own!",
      "text": "Super comfy drawstring pants. UltraSoft cotton ... you’ll never want to take them off. They really look like ripped jeans, so you’ll definitely fool your friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Hepburn ",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Comfy",
      "text": "Bought 2 pairs. Product fit is too long, but easily hemmed these. They're very comfortable and perfect for these isolating days and answering the door.",
      "rating": 4.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Love these baggy comfy jeanjamas",
      "text": "So comfy. So soft. Can go to the store in them and no one even knows you’re in pajama pants. They just assume you like 90s style jeans!",
      "rating": 5.0,
      "verified": true,
      "author": "MikeyArgie",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "So cute!",
      "text": "My son loves these! I’m about to order my husband some too. So cute. I haven’t washed these yet so I don’t know about the shrinkage that others have commented on. They’re a little too large so that might be ok",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Very comfortable, and they look like worn jeans",
      "text": "Very comfortable, and they look like worn jeans. Was surprised to see they came with a draw string at the waist. There was another faux jean pajama pant on Amazon and the only difference I noticed was the draw string description and the pattern of the jeans for an extra $2. The ones I got had the pattern I thought I was buying, but it too had a draw string. I am only 5'6\" so they are a little too long, but I expected that. I can never buy pajama pants in my length.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith E",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Unique and fun pair of lounge pants!",
      "text": "I bought these as a birthday gift for my husband. Wasn't expecting much--was really just looking for something fun for him to open. Not only were they super soft, but the fit was perfect! (I ordered a medium and he wears a 34 pant.). The smile I received when he opened them was well worth it. He put them on immediately and has been wearing them every evening since. He loves them! This was a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Bargainista",
      "helpful_votes": 40,
      "publication_date": 20120829
    },
    {
      "title": "It doesnt have a snap to keep you privates private",
      "text": "They fitted, but without a snap, anything goes or may show. People complained about shrinkage, don't we all? But now that I ordered a snap kit, maybe I'll order these again one day.",
      "rating": 3.0,
      "verified": true,
      "author": "F. Masters",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Cool looking but be looking elsewhere",
      "text": "These pajama pants are very thin. It was expected as the cost of this item is rather cheap. They run SUPER LARGE. I am not sure how others said that they run small? I will keep as I don't want to pay to return. They are cotton so they may shrink to fit, I am 6' and 160 lbs if that helps with the sizing.",
      "rating": 2.0,
      "verified": true,
      "author": "Styles",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Good value. Practical lounge pants WITH pockets!!",
      "text": "A little too long.... otherwise AWESOME! My brother loved them to lounge in and the big side pockets were an additional value. I would recommend these to others. Good practical value.",
      "rating": 5.0,
      "verified": true,
      "author": "NanceSki",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Consider buying a size larger than normal ...read my review before purchase for a perfect buy",
      "text": "Please take note before you purchase these pants! They are 100% cotton, meaning they are going to shrink if you put them in hot water and then put them in a dryer. Not a bad idea as this will make your cotton even more soft...but...know this when buying. So if you need a large you may want to consider getting an extra large. They fit me very well after washing as they were too big for me but once I washed them in hot water and put them in the dryer, they now fit perfectly. Know this before buying! And I love Amazon Prime!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly A. King",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "These are a hoot, buy them!",
      "text": "These were a gift and a big hit. The recipient put them on right away and loved them. Soft and lightweight and so freaking cute. I’d buy again and totally recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "REBECCA",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Fun PJ bottoms",
      "text": "These looked like fun so I grabbed a pair. They fit perfect on me every where except for the length. If I was six foot tall not 5'6\" the length may be okay. Needless to say I needed to hem them up. Other than that they are very comfy to lounge and sleep in.",
      "rating": 4.0,
      "verified": true,
      "author": "PWSWORLD",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Loved them, but it was short-lived, because they shrunk",
      "text": "These pants were a great option for casual, around the house wear. When they arrived they fit just right, and sport a really fun design. After a washing or two, though, they had shrunk in length considerably - - by at least 3 to 4 inches. Now they are far too short to wear for someone 5'11\", which is tall, yes, but not uncommonly tall. So disappointed at the loss of length. Loved these. Wish the fabric had been preshrunk by the maker; that would be an easy fix. Comes only in one size. Great for guys not as tall.",
      "rating": 3.0,
      "verified": true,
      "author": "Look up, Stay up :)",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "REALLY cool lounge pants that don't look like it!",
      "text": "My husband is retired and often wears flannel lounge pants around the house, and our neighbor teases him about being in pajamas. Last week my husband was walking out to the mailbox and these really fooled the neighbor—he thought they were jeans! Nice, lightweight cotton knit (t-shirt) material especially nice for warmer weather lounging. Good price. Probably will order another pair soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart Blonde",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Can live in it.",
      "text": "Bought for myself, very comfortable. I'm a woman and usually buy men's sleep wear because it is comfortable and wears a long time. Could get away with wearing outside on a hot day. Did buy another pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "These shrink several sizes!!!!",
      "text": "My husband is 6' tall and these were perfect for him before I washed and dried them! I'm 5'2 and these now fit me after putting them in the dryer. I realize they are 100% cotton, but did not expect this much shrinkage!",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Harbers",
      "helpful_votes": 35,
      "publication_date": 20130118
    },
    {
      "title": "Wide legs",
      "text": "Unfortunately these look nothing like the photo. The leg part was really huge. My adult son could fit his whole body in one leg of these pants and he is an average size male.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacar",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Walk outside in your PJs!",
      "text": "I bought this as a gift for my dad, who hates answering the door or walking to get the mail in his PJs. Now, at first glance, he can appear to be wearing jeans - a fact which he definitely appreciates. He wears them all the time! The material is soft and comfortable, though they run a little larger than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey M",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Are exactly as described",
      "text": "My husband wanted these, he thinks they are hilarious. He wishes these were made as sweatpants. The pants are pajama bottom type an thin but are exactly as described. No problems washing or drying. I'll probably have to buy him another pair as he really loves these.",
      "rating": 5.0,
      "verified": true,
      "author": "Puffers two",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "deceptive picture",
      "text": "ordered large but looks like XXL. Looks nothing like picture and is made out of VERY cheap thin material, like a cheap sheet. Picture shows like it's the thin cut that's so popular but is very wide leg and doesn't look like jeans at all.",
      "rating": 2.0,
      "verified": true,
      "author": "carol toth",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Love them",
      "text": "These were bought as a gift for a very ill friend who is 6'2'' and weighs 155 pounds. He wanted something that were confortable but didn't look like pajamas so he could go out to his mailbox without changing from his pjs. I bought a medium but they were too small. I kept them for myself (I'm female and wear a 16) and reordered a large for him. I've had two pair (med) for years and love them. Wish they would make them in a \"non destressed\" pattern or other colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Retwahine",
      "helpful_votes": 0,
      "publication_date": 20150404
    },
    {
      "title": "Shrinking makes these unwearable after washing",
      "text": "Fit as expected until you wash them. What a waste, my husband really liked these. Then I washed them and now they have shrunk to half the original size. Such a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "LauraG",
      "helpful_votes": 7,
      "publication_date": 20151202
    },
    {
      "title": "MY FAVORITES",
      "text": "I highly recommend these sleep/lounging pants. Good for indoors or outdoors. Thin and comfortable, non-binding and yet fashionable. Useful pockets and from a distance look just like jeans. Several compliments. Easy on, easy off, great fit, great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Darien Wells",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Very Cool Lounge Pants...........",
      "text": "These lounge pants are perrrrrfect! Love these, great for around the house, I bought two pair! Make sure to buy a size larger as the shrink. If you plan for the shrinkage you will love the pants.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "You got to buy a pair of these",
      "text": "These are extremely comfortable pants in fact off the scale the material is so soft and does not wrinkle or crease",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Nose All C's All and is All",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Material",
      "text": "I did not like these pants at all. I thought they would look more like jeans. I ended up returning them.",
      "rating": 1.0,
      "verified": true,
      "author": "Tan B.",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Great lounging jeans soft like PJ 's...",
      "text": "I absolutely love these they are cool looking and so soft that I sleep in them and can run out to the mailbox and everyone thinks I am wearing jeans. The size is like American not small like Asian.",
      "rating": 5.0,
      "verified": true,
      "author": "jeffjlake",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Very comfortable sleep pants.",
      "text": "Very comfortable. Fit as expected. They have \"stretch\" in all the right places. Also look very cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Omiatek,MD",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Don't even think of wearing to work, unless you work at home.",
      "text": "Comfy jammies that don't and will never pass as jeans. Need to secure the fly to keep the johnson inside.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave S.",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Comfortably Grunge",
      "text": "Great jammie pant to sneak to the convenience store. I added a Velcro closure in front, for modesty. The legs are long enough for some tall folks.",
      "rating": 5.0,
      "verified": true,
      "author": "Uncle Mickey",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Perfect",
      "text": "Perfect, just like advertised. Love the black color, had the blue before. The blue were worn out, decided on black. Black is the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Vik Gilbertson",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Perfect for the guy (or gal) who refuses to wear pants",
      "text": "This is actually a re-order for a pair I bought in 2014. These pants have been wore nearly daily and washed 4-5 times a week. For the man who loves the feel of loose breezy boxer shorts feel while still being presentable walking to the mailbox and not leaving the neighborhood in shock. They are soft, light weight and breathable. I would definitely recommend having a pair (or two) on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "The man loves these",
      "text": "He loves them, light and fluffy, His words not mine.He even wore them in public and got compliments. I would and have purchased these again for my husband as a gift. He said they feel like he's wearing nothing....",
      "rating": 5.0,
      "verified": true,
      "author": "lstephoney",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "I should have listened to the reviews",
      "text": "Shrunk after first wash. Now fits like clam diggers, or those long shorts from the 80's. I still wear them but I roll up the legs and use them as shorts now. None of my other PJs shrink like this. What's up with these ? I love the design and I want to have them, but they shrink way to much.",
      "rating": 2.0,
      "verified": true,
      "author": "Gary Marshall",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Return customer again in 2020.",
      "text": "These were the most fun pants we've ever seen. I bought a pair for my husband & one for my girlfriend's husband, for his birthday. They loved them! They can wear them in the yard and relaxing with a tasty beverage, by the firepit. They are 100% cotton & wash up nicely! 2020 update—LAST FOREEEEEVER! We finally had to replace these after all this time. They finally wore out. They even keep their color pretty, only lost about 50% of their color and turned a slight muddy red compared to the new ones we jus got in the mail. They fit true to size in the waist; they are long!",
      "rating": 5.0,
      "verified": true,
      "author": "rakoons",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "Be aware!!!!",
      "text": "I've purchased this exact brand from different sources and I've tried different sizes (medium and large). No matter what size, even oversized for my weight and height, after a single cold-water wash and air-dry, these shrunk to the point that they are not wearable. That is, unless you really like to wear high-high-waters. No matter what you do with these, they will shrink in length to the point they are not wearable at all in my opinion. Too bad too, because they are a great idea and very comfortable to wear otherwise.",
      "rating": 2.0,
      "verified": true,
      "author": "Dexter",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "These pants wash and dry without a lot of wrinkles.",
      "text": "Great pair of pajama pants, wash and dry wothout wrinkles, nice relaxed fit, and waist band does not roll over.",
      "rating": 5.0,
      "verified": true,
      "author": "coop983",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Returned without wearing.",
      "text": "I returns these lounging pants without ever wearing them. Just taking out of the packaging they were thin and cheap feeling and the look was not anything like a blue jean pants you could have worn out to a causal event. These are pajama pants and not even good ones.",
      "rating": 2.0,
      "verified": true,
      "author": "DAVID",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Funny, comfy, & cute",
      "text": "These things are awesome! I bought them for all four of my boys and they absolutely love them. They are funny, but comfy and soft. Good product, I was quite surprised, I bought them more as a joke, but they were a bit!",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Suitability",
      "text": "My husband really likes them as this is the 3rd pair I've purchased for him !!! Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200822
    }
  ],
  "product_meta": {
    "title": "Paul Frank Men's Faux Denim Pant",
    "description": "100% cotton Men's Sleep Pant. Features open fly, elastic waistband with drawsting cord. Fake pockets - designed to give a pocket like look.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Cotton",
      "Imported",
      "Machine Wash",
      "Hang out in Style: Our Denim printed pajama pants are super stylish. These pants are versatile and great for lounging around the house and watching movies in all day",
      "Fun Design: These pants are super cool and feature a denim printed design. These pants are very affordable and would make a great birthday or anniversary present",
      "The Material: Made from a super comfortable and soft 100% cotton knit. Not only are these pajamas lightweight, but they are also breathable, keeping you cool and dry all day long",
      "Incredibly Functional: These pants come with a functional drawstring tie for the perfect true to size fit. They also come with pockets, so you can keep your wallet, keys, and phone safe at all times",
      "Product Care: Caring for these pants is easy. Wash them in cold water and dry on low"
    ],
    "categories": [
      "Men",
      "Sleep & Lounge",
      "Clothing, Shoes & Jewelry",
      "Clothing",
      "Sleep Bottoms"
    ],
    "price": 19.98,
    "specifications": {}
  }
}