{
  "website_summaries": [
    {
      "verdict": "A top-value pick for consumers who want the best Shark has to offer in quality and features at an affordable price.",
      "pros": [
        "Versatile, lightweight, and affordable",
        "Can be used as an upright or a lift-away for portable cleaning",
        "Reasonable price"
      ],
      "cons": [
        "Some owners find it a bit top-heavy",
        "Suction is somewhat lacking on hardwood floors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Shark products and company are fraudulent",
      "text": "Purchased a Shark Navigator vacuum. Received on Nov.30 assembled it the next day. It did not work. Contacted the manufacturer and after their troubleshooting determined the motor was defective. They then told me the only remedy was for me to BUY ANOTHER MOTOR FOR $71.00. They said the warranty DID NOT cover the motor despite this being a brand new product. This is clearly a fraudulent company and buyers should BEWARE!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Urquiza",
      "helpful_votes": 423,
      "publication_date": 20181201
    },
    {
      "title": "Bummed about this product. We bought it less than ...",
      "text": "Bummed about this product. We bought it less than a year ago and the suction has stopped working. When I tried to return or get a replacement, they are making me pay $20 for shipping to ship it back. With a warranty of 5 years never losing suction, I'd expect more from this.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Sunday",
      "helpful_votes": 407,
      "publication_date": 20180206
    },
    {
      "title": "Where has this vacuum been all my life?!",
      "text": "We just vacuumed our bedroom about a week ago. I’m astonished by how much our old (useless!) vacuum missed! I was originally upset that my son broke our old one and we were forced to buy another but I’m glad now!!! One sweep through of ONE ROOM, just our bedroom and walk in closet produced enough filth to go well over the fill line. My carpet feels truly clean under my feet. We just purchased a new shampooer, too, so I’m anxious to really get our house looking new again!",
      "rating": 5.0,
      "verified": true,
      "author": "Elena W",
      "helpful_votes": 207,
      "publication_date": 20180816
    },
    {
      "title": "Do NOT buy for pet hair!",
      "text": "DO NOT buy this vacuum if you have a lot of pet hair. The suction is good but, even on hardwoods when you’re not using the roller, hair gets totally twisted around the roller brush. I constantly have to cut and pull handfuls of hair from the roller.",
      "rating": 1.0,
      "verified": true,
      "author": "anita",
      "helpful_votes": 58,
      "publication_date": 20190803
    },
    {
      "title": "Very difficult to clean after using it...poor engineering!",
      "text": "Suction is great, almost too great on floor rugs...but cleaning this vacuum is a nightmare...sharp edges, small cervices in the dirt/dust container, washing it out under the faucet with hot water and rags or small brushes for the dust that sticks is the only way...that's a half hour job, then leaving it outside to dry...ugh...I am giving it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Marvin J. Godner",
      "helpful_votes": 68,
      "publication_date": 20180602
    },
    {
      "title": "Love the vacuum",
      "text": "Love the vacuum. Works like a Shark should. However, don’t expect to get the pet power brush as advertised. It’s not in there. After getting 2 vacuums sent to me, I finally realized the listing is wrong. You aren’t getting a what you think you are. I have 3 dogs. I bought this specifically for that item. Now I can go buy it separately. Thanks Amazon. Also, it’s very hard to get under beds and furniture. You have to take it apart and put on a separate head and fight that corrugated hose that doesn’t want to extend. Kind of disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "motherduck",
      "helpful_votes": 68,
      "publication_date": 20171125
    },
    {
      "title": "Terriable",
      "text": "They say they have a 5 year warranty but they will not stand by there product and charge for every repair and part so what is the point of a warranty. Terriable customer service and product for long term.",
      "rating": 1.0,
      "verified": true,
      "author": "cyberchic",
      "helpful_votes": 43,
      "publication_date": 20181112
    },
    {
      "title": "I HAD A DYSON & LITTLE DID I KNOW, SHARK IS BETTER",
      "text": "I have TWO full size aussies. they are my world.. but are full of hair. i had a dyson vacuum & totally thought it was amazing.. after a couple years it began to break down & i deicded it was time to replace. i did my research & came across this shark & said “ill try it” I VACUUM EVERYDAY. EVERY. DAY. this is after doing my whole house. i am so impressed. i LOVE IT. great for pet hair & dirt. no fly away either. i will recommend to everyone now!",
      "rating": 5.0,
      "verified": true,
      "author": "stevannee",
      "helpful_votes": 28,
      "publication_date": 20190402
    },
    {
      "title": "I went over the low-pile rug that I'd cleaned with ...",
      "text": "I went over the low-pile rug that I'd cleaned with a crappier vacuumed two days ago. The amount of dirt it pulled out from that rug was unbelievable (picture below).",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous420",
      "helpful_votes": 27,
      "publication_date": 20180703
    },
    {
      "title": "B - when compared to other Shark models.",
      "text": "My daughter-in-law brought over her Shark Professional for me to try and I loved hers, so after reviewing the models and seeing that this one compares to hers, but with out all the extra attachments. I was was excited to order myself one. This vacuum performs at about a B- compared to the nicer Shark models. It did a good job of picking up dust and cat hair but it did not pick up larger debris (like a small strip of paper) and it was almost much louder than the Professional model. I will be returning this one to upgrade a nicer model.",
      "rating": 3.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 21,
      "publication_date": 20180723
    },
    {
      "title": "Not helpful",
      "text": "I got this in New Zealand it is faulty it has 2phase power not 3phase it popped and crackked and smelt of burning I am trying to return it but it will cost $382 US dollars to return from NZ which I don't have lying around Amazon said they would send me a pre paid label and the told me they couldn't. I am stuck with a vacuum that doesn't work and $260 nz dollars out of pocket. And they don't care shame on them.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy Burns",
      "helpful_votes": 20,
      "publication_date": 20181011
    },
    {
      "title": "Really 4 1/5 stars - Only one complaint",
      "text": "I like this vacuum just fine. It does everything advertised. The only annoying thing I can find about this vac is the suction connection from the roller section to the base comes loose easily. So I'm vacuuming along fat and happy and realize that the connection has come off and all I'm doing is blowing dust around. I have to reconnect and it start over and no matter how tight I try to make the connection eventually it will work loose. I'm thinking ??Superglue?? Otherwise, it's a great vac, light weight, easily to handle and has great suction. Cleans like a crazy. I recommend it especially for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "fox",
      "helpful_votes": 10,
      "publication_date": 20200217
    },
    {
      "title": "Disgusting to empty",
      "text": "This is my third (and last) Shark since buying the first in 2013. Something irreplaceable always breaks and each iteration of the design gets worse. This newest one is clunky with a capital C. Pulling the extension out is a major hassle but the very, very worse thing is emptying the (newly shrunken) canister that collects dust and hair. There is no way to do this without putting your hand in and yanking the wad of ick out - twice! - from the top and bottom. If you have severe allergies like mine, this is a nightmare and frankly just plain disgusting. As I said in the beginning: this is my last Shark.",
      "rating": 1.0,
      "verified": true,
      "author": "Avowed Bibliophile",
      "helpful_votes": 12,
      "publication_date": 20190126
    },
    {
      "title": "Great for carpet, horrible for hardwood",
      "text": "This is an amazing vacuum for carpets. You won't find a better one. BUT, it is horrible on hardwood floors. I have dark floors and every little thing shows. The vacuum struggles to pick up small pieces, for example, a sesame seed. It takes me forever because I need to go over and over the same area. Sometimes it appears to have picked up crumbs, but in reality it has spewed them out across the room. I wish I would have returned it when I could have",
      "rating": 2.0,
      "verified": true,
      "author": "wlc",
      "helpful_votes": 19,
      "publication_date": 20170530
    },
    {
      "title": "carefully check over vacuum upon receipt.",
      "text": "It does a good job vacuuming, but is a little tough to handle for this 75-year-old. I bought it thinking that it would be a lot easier to use compared to my old drag behind Kenmore. I was very unhappy to see that the outside of the cord had two places where there were slices, i.e. missing pieces, of the covering. I paid for a new vacuum, but I am beginning to think a returned one was sold to me as new. I am very disappointed. This was not a small purchase for me (retired, living on social security).",
      "rating": 3.0,
      "verified": true,
      "author": "R. taylor",
      "helpful_votes": 15,
      "publication_date": 20180202
    },
    {
      "title": "Great Product - needs better description",
      "text": "This is a light weight product that works on both hardwood and carpet.. the light weight removable container makes it easy to clean stairs, AND they don't mention it on the packaging but it come WITH A Crevice TOOL 24\" which is great for reaching high corners... I wish they has said it had the crevice tool in the description because I ordered one, than I had to PAY to Return it because it wasn't needed. - There was a also a suggestion to purchase the crevice tool, reassuring that it was not with the vacuum ... uuurrgh.",
      "rating": 4.0,
      "verified": true,
      "author": "ElizabethH",
      "helpful_votes": 7,
      "publication_date": 20181213
    },
    {
      "title": "Great while it lasted (about a month)",
      "text": "Had this vacuum for less than a month before it completely stopped working. While it did work, it was great!!! Pros: easy to use, easy to push (light weight), great for stairs. Cons: minus the fact that it started to smell like chemicals and then totally died within a month, hair gets wrapped around the rotating bristles and you have to cut it out with scissors. My mom has the same vacuum and has for years but hasn’t had a single issue with hers so I guess it’s hit and miss on if you will get a good product or not...",
      "rating": 2.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 5,
      "publication_date": 20191107
    },
    {
      "title": "Only worked for 4 months - No support from Seller to replace it.",
      "text": "It worked well for 4 months before the motor completely froze and no longer working. I asked for a replacement vacuum from the seller and the seller declined saying it was past the return time period. No further assistance was offered.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 12,
      "publication_date": 20181013
    },
    {
      "title": "Worst vacuum I've ever owned!",
      "text": "This vacuum not only fell over continually while I was using the wand, caught the dust up one side of the dust cup behind a connecting piece making it difficult to empty, but today, a little more than 5 mos. after I purchased it, the roller stopped turning. Very disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Kasey1328",
      "helpful_votes": 9,
      "publication_date": 20181209
    },
    {
      "title": "Terrible for hard wood",
      "text": "Question if it’s working. Had to physically pick up a piece of dog food. Doesn’t reach to baseboards. Still figuring out the lift away, it’s very heavy. No roller for attachments so forget getting dog hair off carpeted stairs",
      "rating": 1.0,
      "verified": true,
      "author": "devan sappanos",
      "helpful_votes": 9,
      "publication_date": 20190327
    },
    {
      "title": "Electric shock?!?!",
      "text": "I received my Shark vacuum today, I was so excited to use it. I decided to test it out on my master bedroom first. I was impressed with how good it was working .... for a little bit. The vacuum will not stop zapping me with electric shocks (over and over) they are so strong they actually hurt. I changed the plug in to three different outlets, I even tried another room thinking it was the carpet... I looked up the vacuum and saw many reviews on other pages with the same feedback. DO NOT BUY. This is terrible, I am so mad.",
      "rating": 1.0,
      "verified": true,
      "author": "melissa",
      "helpful_votes": 70,
      "publication_date": 20170302
    },
    {
      "title": "Unbelievable Shocks!!",
      "text": "I was so excited to get this vacuum. After the third time using it I started to get shocked. Badly!! My husband doubted the intensity of the shock and tried it himself. He couldn't believe it. I could actually see the electricity coming from the handle to his hand, looking like little lightning bolts. These are not small shocks like you get with a little static electricity. It causes real pain and there is nothing the company will do about but tell you to wear rubber soled shoes when vacuuming, which I was already doing. Dangerous - DO NOT BUY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "DHL",
      "helpful_votes": 22,
      "publication_date": 20170513
    },
    {
      "title": "Light weight and Strong Suction.",
      "text": "I am very happy with this vacuum cleaner. Very easy to work with because its light weight with a very strong suction with very little noise considering the strength of the suction of this motor. Very easy to use under beds or tables with very useful attachments. The only gripe about it is to make sure to have a big bag to empty out the canister because it can get messy if not careful. I find it easier to empty the canister from the top rather than the bottom. It's just a little gripe but over all I just love using it because it really keeps my floors clean ! Neat Freak Out !!! lol",
      "rating": 5.0,
      "verified": true,
      "author": "MikeP",
      "helpful_votes": 5,
      "publication_date": 20190218
    },
    {
      "title": "Great value.  Very nice machine",
      "text": "My six year old Dyson Animal is getting long in teeth so I thought I’d trythe Shark. I don’t know which has more suction, but the Shark has enough to do a great job. Both have similar design issues regarding tipping over when using tools. I find the Shark may be better regarding tipping, because you can lift off. The Shark is nicer for doing carpeted steps, because it is lighter. I love my Dyson, but the Shark is a very nice machine that is doing a great job replacing my Dyson.",
      "rating": 5.0,
      "verified": true,
      "author": "GH",
      "helpful_votes": 7,
      "publication_date": 20180727
    },
    {
      "title": "I would not recommend shark based on their customer service",
      "text": "This product worked twice the roller stopped working I called customer service with shark they offered to sell me a new part did not have great customer service",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20181008
    },
    {
      "title": "It's OK",
      "text": "I bought this for my upstairs bedroom so I didn't have to drag my expensive canister vac up the stairs anymore. After using this vacuum I remember why I bought the expensive canister vacuum in the first place. This does have very strong suction, but is floppy and difficult to work with overall. The end.",
      "rating": 3.0,
      "verified": true,
      "author": "ChrisTop Contributor: Mountain Biking",
      "helpful_votes": 7,
      "publication_date": 20181012
    },
    {
      "title": "One Shark is not like an other.",
      "text": "I was a little worried with the negative reviews this vacuum received. However, it was easy to assemble, easy to maneuver, and has great suction. I bought the Shark Advanced Rocket--It did great for three years, and being vigilant about its filters--it didn't have the performance or power it did in the beginning. Plus it wouldn't stand on it's own. I was reluctant to buy another Shark. I hoping this will give me more lasting power.",
      "rating": 5.0,
      "verified": true,
      "author": "shamaes mom",
      "helpful_votes": 3,
      "publication_date": 20191024
    },
    {
      "title": "Excellent Vacuum",
      "text": "I just received my new Shark Navigator Upright Vacuum and I really like it. This vacuum is light weight and easy to carry and push which is light years easier to use than my last vacuum. I love that it is bagless so no need to rebuy vacuum bags year after year. However, I was a little surprised at how often I needed to empty the dust cup. The only downsides to this vacuum is the electrical cord is a little shorter than I'd like, but this fact does not reduce my overall satisfaction with this product. I would highly recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Jo Weaver",
      "helpful_votes": 3,
      "publication_date": 20180804
    },
    {
      "title": "Best Vacuum I've Had!",
      "text": "This is working beautifully! It's easy to use, it's sturdy and very simple to clean. I don't know what the other comments are about how it doesn't stand on its own. It stands perfectly fine for me. It IS a little too loud for my dog, but its a vacuum so she'll hate it either way haha. So happy to finally have an amazing vacuum!",
      "rating": 5.0,
      "verified": true,
      "author": "Priscilla",
      "helpful_votes": 3,
      "publication_date": 20191118
    },
    {
      "title": "Make sure you’re reading the low star reviews too!",
      "text": "We have had this almost two years now, and it has been a headache. It’s very too heavy, and will fall if you accidentally brush while walking past, or if the suction is clogged on the hose. The bottom detaches making it easier for cleaning stairs. It does not do hardwood floors well at all. Iffy suction on our rug. I’m not sure what brand I will go with once this does die, but it will not be shark.",
      "rating": 2.0,
      "verified": true,
      "author": "Sean and Rebecca",
      "helpful_votes": 2,
      "publication_date": 20200703
    },
    {
      "title": "A few tweaks and the would be great",
      "text": "Pros: Great suction. I couldn't believe what this was pulling out of my carpet. Has nice attachments. Easily empties. My last sweeper I struggle aligning the tank after emptying. This is really easy. Cons: This is top heavy. Falls over a lot. Also, the cord is low to the floor so every time you need to pick up the cord while sweeping you have to reach to the floor to get it.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle Borman",
      "helpful_votes": 3,
      "publication_date": 20181019
    },
    {
      "title": "Awesome buy",
      "text": "I’ve only used this vacuum once so far but wow. The suction power is insane. It actually lifts some of my rugs off the floors lol. It DEFINITELY will clean anything. There is so many options on how to use this thing which is my favorite part about it. There is lots of different arms and heads and attachments to be able to get ceiling fans and crown modeling with ease, I really like that feature. The vacuum is really light weight and pretty small doesn’t take up much room at all. I love the bag less feature as well. Overall a really good purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob H.",
      "helpful_votes": 2,
      "publication_date": 20181111
    },
    {
      "title": "Unbelievable!",
      "text": "I received a big surprise when I used this vacuum cleaner. I wanted it to be upstairs while my other vacuum cleaner remained downstairs. When I vacuumed my bedroom which I thought was fairly clean, turned out to have volumes of unseen dog hair. I could have created a whole new coat for my Papillon. It has a brush that digs deep. I only wish that the brush could be removed for cleaning. You need to cut up what gets tangled, although that was not too difficult. The unit was a little heaver than I expected but because it can be detached, it can be transported or maneuvered around when just using the hose extension.",
      "rating": 5.0,
      "verified": true,
      "author": "Berta",
      "helpful_votes": 2,
      "publication_date": 20181025
    },
    {
      "title": "The best vacuum cleaner ever",
      "text": "We have 3 cats, a dog that sheds a lot and I'm a clean freak so I'm constantly vacuuming. I've had every brand of vacuum there is and I love love love my Shark. I'll never buy another brand of vacuum again.",
      "rating": 5.0,
      "verified": true,
      "author": "jennerator",
      "helpful_votes": 3,
      "publication_date": 20201008
    },
    {
      "title": "Makes you excited for cleaning like a 50's housewife",
      "text": "This is literally the best vacuum that I've ever owned. Amazing suction, it felt like I was in a commercial when I used it the first ttime-the difference was that profound. Mine was refurbished and came with no instructions or anything, but assembly was easg and everything works great Only thing I can think of for cons: it doesn't have a retractable cord, so you have to wind it back up by hand (minor inconvenience) and the attachments don't all hook onto the unit without one inevitably falling off or being clunky. It would be nice if each attachment had it's own slot on the vacuum, or if they came with a bar to snap onto.",
      "rating": 5.0,
      "verified": true,
      "author": "Corenaccio",
      "helpful_votes": 2,
      "publication_date": 20180423
    },
    {
      "title": "Lasted less than a year, was nice while it lasted.",
      "text": "I could not be more disappointed in this product performance at cleaning up hair. I bought it specifically for cleaning up hair. The brush roll is so clogged up that it won’t turn anymore, and I can’t get it cleaned with my hands and scissors. It needs to be taken apart, but there is a special screw which requires a tool that I do not have, so they make it so you cannot even fix this. First, it does not do what it was advertised to do which is clean up here. Second, once the brush roll is clogged, it’s impossible to repair at home. I owned this less than a year.",
      "rating": 3.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great vacuum for picking up fur!",
      "text": "Bought this Shark after a friend told me how great it was, and she was right. I have two cats (one long haired) and one dog. My old vacuum couldn't pick up the hair on the rugs. This vacuum has so much power and I had to clean out the basket twice after doing one room, I couldn't believe how much my old vacuum was missing. If you have pets, this is the Shark for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Mille's Mom",
      "helpful_votes": 6,
      "publication_date": 20170514
    },
    {
      "title": "Better than a Dyson.",
      "text": "I never write reviews. I've had a Dyson Animal for 8+ years, and just assumed I had the best vacuum for pet hair. It broke during quarantine, and was just looking for an easy solve. Enter the Shark. What have I been doing this whole time? This vacuum is unbelievable. It's scary how much it picked up. I'm actually concerned about the squalor I've been living in, based on just the first pass over area rugs. Only downside is that its suction is so much that it pulls up smaller/lighter area rugs. Had to give counter force to keep it from getting sucked in. HUGE fan. #sharkvacuumsforlife",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Koehler",
      "helpful_votes": 2,
      "publication_date": 20200407
    },
    {
      "title": "Totally sucks! Worth your money 😄",
      "text": "We this model at my office that has been used and abused for years so I had high expectations. It lived up to them! Picked up tons of dog hair that our other vacuum just missed. I’m pleased with how it transitions easily from carpet to hardwood floors - def not noticing issues with the brush flinging debris around like other customers have written. Lightweight, easy to empty, cleaning filter is simple process, great price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. K",
      "helpful_votes": 2,
      "publication_date": 20191018
    },
    {
      "title": "Worst vacuum ever.",
      "text": "I purchased to use on rugs and wood floors. Also because the canister is removable so you should be able to use on furniture or baseboards etc. It works on floors and nothing else. The hose is short and the handle is curved so the only way to use the canister is if you can lift it and hold it high with one hand and vacuum with the other hand. The attachments are limited and when you try to use the small brush it won’t stay the direction you attach it. You must realign it every few seconds. Horrible purchase!",
      "rating": 1.0,
      "verified": true,
      "author": "Suze",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "WOW",
      "text": "my first expensive vacuum and it works GREAT!! when i first got it which was a few weeks ago, i opened it, assembled it and started playing with it. 2 days prior to me receiving it i had vacuumed my house with my bissell ( which is really old). after i vacuumed one bedroom with the shark it picked up so much dust in the carpet. i was shocked about the fact that my floors were never actually getting cleaned all these years. definitely a new firm believer of this vacuum!!",
      "rating": 4.0,
      "verified": true,
      "author": "keiera",
      "helpful_votes": 4,
      "publication_date": 20171120
    },
    {
      "title": "The best!",
      "text": "This is the same model I had for 9 years. I bought a second one because it is one of the best. Great suction and easy to take apart and clean ceilings.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 3,
      "publication_date": 20201008
    },
    {
      "title": "Buyer beware",
      "text": "I purchased the vacuum in 6/2/2020. 9/1/2020 the vacuum roller stopped spinning. I called shark as my vacuum had a 1 yr warranty. They wanted me to spend 71 dollars for a new floor nozzle for a vacuum that I paid approx $100.00. Needless to say I was furious. I argued with them and they offered me a 50% discount which I refused! They spoke to the supervisor and came back and offered me the same part for only shipping. I do not recommend this product ! What a RIP off",
      "rating": 1.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 3,
      "publication_date": 20200904
    },
    {
      "title": "Great Vacuum",
      "text": "This is a amazing vacuum...or maybe I have always had crapy ones? This vacuum sucks up way more dirt than any other vacuum I have owned...I was flabbergasted with the amount of dirt it sucked up from my area rug...This vacuum is light weight...my kids can work it with ease, it is easy to maneuver, and works wonderfully...I absolutely love it.. We have a dog and a Roomba and this vacuum picks up so much more than the Roomba.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie",
      "helpful_votes": 2,
      "publication_date": 20181004
    },
    {
      "title": "Suction!!!!",
      "text": "Super strong suction. Picked up hair and a WHOLE lot of from that my Bissell left behind. However it is awkward using the handle that turns into a wand. Leaves you with nothing to grab onto for the canister. Also the attachments are an awkward length seeing that I’m 5’2”. One is too long the other is a bit short but still works. I’ll put up with it for the better suction. And I wish the carpet head was a bit wider. Still love it though.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Banana",
      "helpful_votes": 2,
      "publication_date": 20190702
    },
    {
      "title": "Top heavy--falls over all the time; awkward to use.",
      "text": "Vacuum is top heavy and falls over all the time when using and when not in use. Vacuum hose is too short. This is not a vacuum for me as a tall person: on/off switch in odd position; post of vacuum is short; the handle on post is awkward and for me should not even be there; placement of cord is awkward. There is no extension wand for the brush attachment so you have to kneel on the ground to use brush attachment on wall vents. The only positive for me was its suction which is stronger than my previous vacuum. I would not buy this product again and I would not recommend this awkward vacuum to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "MWR",
      "helpful_votes": 2,
      "publication_date": 20200824
    },
    {
      "title": "Versatile, light-weight and works for homes with bare floors and area rugs.",
      "text": "It’s good for smaller spaces where you have to get under and around furniture . Works really well on my area rugs. Light-weight and versatile. I only wish it picked up fine dust on my laminate floor better. It’s a dark wood color so every speck of dust shows (beautiful but not a practically color). The Sharks collects all the dust bunnies and crumbs and such but I need to “dust” under the dining-room table and living-room chairs.",
      "rating": 4.0,
      "verified": true,
      "author": "DLC",
      "helpful_votes": 2,
      "publication_date": 20190315
    },
    {
      "title": "Heavy as Hell",
      "text": "A heavy machine! I knew I shouldn't have bought American vacuum cleaner, but I was tempted with the HEPA filter and I'm still using it (I suffer from Asthma). But if I find any other lighter vacuum cleaner with HEPA filter, I'll definitely switch.",
      "rating": 2.0,
      "verified": true,
      "author": "May Yaz",
      "helpful_votes": 3,
      "publication_date": 20180918
    },
    {
      "title": "great suction does not make up for HORRIBLE DESIGN",
      "text": "very awkward, top heavy, falls over unless you disconnect the canister from the base when using the wands, wand tools are very cheap plastic, awkward to use because roller base is so small compared to other vacuums, also awkward to use the tools, suction is very good and adjustable, not sure why this is a top rated vacuum update: 8/31/19 - had the vacuum for a year now, awful model, will never buy again, tubing has started to tear so it is now held together with duct tape, still falls over all the time, worst vacuum we've ever owned, tool attachments are poor quality and bent at weird angles, very hard to use",
      "rating": 1.0,
      "verified": true,
      "author": "Deirdre M.",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Don’t recommend- difficult to use",
      "text": "While the suction on this was great, I’m giving it a 1*, after choosing to return it, because 1) it came a bit broken and was obviously previously used 2) the ease of use is absolutely terrible - it is very difficult to move around and the extension is not useful. It moved forward easier than backwards and has such a poor design for ease of use, which is rather disappointing seeing as the product has good suction. I’d rather have a product that I can easily go over the same area 2x versus a product that is so difficult to maneuver but can get the dirt the first time around. Highly would not recommend this vacuum",
      "rating": 1.0,
      "verified": true,
      "author": "Nilufer Ozcan",
      "helpful_votes": 2,
      "publication_date": 20200513
    },
    {
      "title": "Whoa",
      "text": "So I had a pretty inexpensive vacuum before and it was fine. But using this...its not even close. I went over a carpet I had just vacuumed and I pulled a TON of dog hair and dirt from it. It was satisfying and I immediately went around the house finding carpet / rugs to vacuum so I could feel like my house was clean. The canister is easy to empty, easy to clean, etc. The attachments and cords are all fine, no worries there. The sheer amount of junk this thing picks up is astonishing. Would recommend. Especially on sale. It IS a little top heavy, so just careful when whipping it around. But this",
      "rating": 4.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Really improved on what ws great",
      "text": "I have an earlier version that is still perfectly good, the best vacuum I've ever used and better than Dyson. It really doesn't lose suction. The new version I got today for upstairs is lighter but has the same powerful suction. The bin is about 2/3 the size of my older one. This one come with a much longer crevice tool, about 24 inches long, as well as the other tools including the short crevicer. Wow, was that long one helpful today for under furniture and across rooms. The cord is placed slightly differently too, so it's less likely that I'll roll over it. I don't think there's a better vac for any price.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth murphy",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Ss FCC uuu",
      "text": "Wow this vacuum cleaner is absolutely the best I have ever used I’m seventy years old small 4 foot 11 I needed reasonably priced making any good in the shark I found more than that sucked it was unbelievable I’ve never seen if you could do what it does very very powerful small and compact enough to get in many places otherwise I would be able to handle at the top of the vacuum It’s it’s so much easier removing it from place to place",
      "rating": 5.0,
      "verified": true,
      "author": "Janey davies",
      "helpful_votes": 2,
      "publication_date": 20200214
    },
    {
      "title": "I THOUGHT MY CENTRAL VAC WAS CLEANING - I WAS WRONG",
      "text": "Oh my gosh! What an eye opener! We have a German Shepherd (vet calls them German Shedders). My husband suffers from dog allergies, so keeping the house clean is extremely important. I vacuum twice a week and thought I was getting my carpets clean, but this opened my eyes! It filled up from the first room & hallway. I end up emptying it 3 times every time I vacuum. It picks up everything. The attachments are also very useful and easy to use. Love this machine! Easy to use, light and manageable. The only thing I would like is if it \"flattened\" to go further under furniture. It doesn't lay very flat.",
      "rating": 5.0,
      "verified": true,
      "author": "LifeIsGood in MN",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "The good and bad!",
      "text": "I just got this today it's got great Suction, it picks up on carpet good, when using the extender the vacuum falls down easy and just sitting on carpet it falls easy. I'm a house cleaner and it worries me it's going to fall and break something. It doesn't pick up on hard floor throws things out so that isn't good. I'm going to return it because it is a liability for my business.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200716
    },
    {
      "title": "Bought It Based on Reviews",
      "text": "I'm giving it 4 stars because it seems fine, but it hasn't stood the test of time. It seems very lightweight compared to my last one which means the interior parts are not metal, so I'm suspicious of it. I've also read complaints that the 5 year warranty isn't being honored. Put it this way--I wasn't willing to spend the extra money to get all the features I wanted because I'm not confident in its longevity. It appears to be the best rated manufacturer down from Dyson or Meile which cost a lot more, so it seemed like a good decision at the time.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy S",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Five years and still loving it. In fact, I've got two!",
      "text": "This vacuum has been a star. I've had it for 5yrs and I've had no problems with it. I bought one for my mom 4yrs ago and she still uses it all the time with no issues. The biggest thing is you do need to clean the filters regularly and occasionally change them. Other than that, this is a solid performer that is well built and has great suction. I have a Malamute and Dutch Shepherd and this pulls up dog hair very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Baja",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Dust bin in the ccx trash bin 2 months in.",
      "text": "So I bought this vaccum 7/10/2020. It was a replacement for my other Shark Navigator because the motor gave out after 4 years. No biggie, bought this on, and the dust bin started breaking 2 uses ago. All 3 clamps popped off and broke clean off. Not impressed, Shark. And I am left wondering why with only 2 months of use i am now going to have to buy a replacement dust bin. Is it a knock off of a Shark, or just a straight up quality issue?",
      "rating": 2.0,
      "verified": true,
      "author": "WamFortWorth",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Poor quality construction.",
      "text": "The cheap plastic material used to make it don't fit together. So failed to assemble it out of the box. The electrical connection from the top to the bottom did not join, so the brush in the bottom unit did not run. the suction was good though. Had to return it after struggling with it for an hour. Didn't have the nerve to order the same cheap brand again.",
      "rating": 2.0,
      "verified": true,
      "author": "Asif Akhter",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "Effective vacuum well worth the price",
      "text": "The only thing I didn't like was the poorly drawn assembly instructions. However I found a 76 second YouTube video that was extremely clear and made assembly very quick and easy",
      "rating": 5.0,
      "verified": true,
      "author": "H L",
      "helpful_votes": 3,
      "publication_date": 20201008
    },
    {
      "title": "Great vacuum, almost fantastic",
      "text": "There’s lots to love with this vacuum. It’s powerful, light, bag less, as well as easy to use and carry. How could it be better? We have hardwood floors with area rugs. It would be great if the switch for the carpet brushes was at your fingertips as you‘re vacuuming so you’re not always reaching down to turn it on and on as you transition back and forth between the two. Also the suction can be a bit much for some, causing them to lift up so being able to adjust the pile height would also be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Great Vacuum",
      "text": "This is the one we bought as a gift for some newlyweds. We loved our so much we decided to buy this again for them. Its great for vacuuming the stairs and picks up the small short fine dog hair in out house. It transitions well between the carpet and tile and is easy to empty out. I recommend staying on top of cleaning out the long har left behind your daughters, :-)",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Best vacuum I’ve ever owned",
      "text": "In the past I’d just buy whatever vacuum was on sale at Target or Walmart, then replace it once it inevitable broke down a couple of years later. This time I decided to visit The Wirecutter and just get the best reviewed vacuum, which turned out to be the Shark Navigator. Man, this thing is light, easy to maneuver, and is considerably more powerful than an vacuum I’ve owned. The only reason I didn’t give it that last star was that it is in fact a bit top heavy, and the head is a bit narrow so it requires more passes than previous vacuums I’ve owned. But those are minor quibbles, easily the best vacuum I’ve ever owned.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Zuber",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Excellent Vacuum",
      "text": "This vacuum is excellent. It fits in tight places and picks up everything without a problem. You can remove the collection container to empty it, and then wash it to ensure that it stays clean and looking like new. The filter is removable so you can wash it and keep it clean as well. The collection container comes off so you can climb up a ladder and clean areas that are high up. I have bought and returned a lot of terrible over-priced vacuums, but this one was one of the best I have ever owned. I hope it lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "A_Sir",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Best vacuum ever!",
      "text": "Best vacuum I’ve owned in my life and I’ve owned those expensive Hoover’s and Kirby’s. I’ve got 4 girls and long hair myself, this has no problem with any of the huge amount of hair dropped daily. I’m going to buy a second eventually so we have one upstairs and one downstairs. But it’s not necessary since it’s so light anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "chappymommy",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "This vacuum SUCKS!",
      "text": "My wife was away when the vacuum arrived, and when she asked how it was, I told her the truth: \"It sucks!\" \"What?!\" she said, \"We should return it!.\" \"Why would we do that? It sucks! It REALLY sucks!\" Seriously, this vacuum sucks. It sucks dust, dirt, hair; it sucks our carpets clean, it sucks our bare floors clean... it just all-around sucks. Exactly what I want in a vacuums cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20201011
    },
    {
      "title": "Buy something else",
      "text": "I have 2 of these Shark vacuums. After 14 months, one shorts out and shocks you. The other one is heating up and shutting off. I clean these our regularly and wash the filters. There is a warranty, but you have to pay for them to send parts to you (which isn’t cheap for larger parts). For what they cost, I will save my $20-$30 for what they charge to send it back, and buy a better brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Awesome",
      "text": "We used an ancient vacuum cleaner that weighed almost 13 lbs until it finally broke down. This was the replacement we picked. In comparison, this Shark is a category of its own. If I was still enrolled in an engineering curriculum that I didn't fail in, this would be best design of a vacuum cleaner to come up with. Detachable canister, handheld options, suction power at an easy-to-manage weight, and everything else that it comes packed with has made cleaning during the quarantine a breeze. I'm actually looking for more reasons to get cleaning around the house now thanks to this.",
      "rating": 5.0,
      "verified": true,
      "author": "Rad BB",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Not like my other Shark",
      "text": "This product is not as I expected, not even close. Very short cord, tips over constantly and is not the same quality I expect from Shark. I did have another model that ended up breaking and I liked it so much I thought I would replace it with this model as I was unable to find the same one I had previously. This is NOT a good vacuum, has a lot of negative issues that force me to give a ONE STAR",
      "rating": 1.0,
      "verified": true,
      "author": "LuLu",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Piece of junk!",
      "text": "Update: I contacted Shark and they sent a replacement piece for it. They were polite and quick. It’s not running hot anymore but this vacuum just does not work on hardwood floors well. Which is what we mainly have. Only had it since December and it’s running extremely hot, not sucking anything up and the switch sparks when I turn it off and on! Yes all the filters are clean, the hoses are empty and the main compartment is empty. Most shark vacuums I have used are great! This one is absolute junk!! Huge fire hazard! Not happy! This is the first bad review I have left also!",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany Ault",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Does exactly what was expected.",
      "text": "Lightweight, quiet and easy to use. When using the brush, it is fairly self-propelled. Cord is long enough, our house doesn't have a lot of outlets and it is adequate. Lays down almost completely flat for maneuvering under tables, benches etc. Steers and turns with ease. Easy to dump the canister. Overall very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Howe",
      "helpful_votes": 2,
      "publication_date": 20191030
    },
    {
      "title": "Good vaccume",
      "text": "Its not the BEST vaccume but your not paying the price for an amazing vaccume. For the price you are paying this is a very good vaccume. I actually would say that this vaccume is better then the bissel stick vaccume I just had before it which was double the price of this one. Overall it's a good vaccume. Happy with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey Bieber",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Not good for pet hair..",
      "text": "I have had this vacuum for quite a while and I really want to like and trust me I have tried. It seems to work well except for pet hair even though it says it is for pet hair clean up. The hair just gets stuck at the bottom of the vacuum and I need to keep stopping to clean it off the bottom just so I can keep going. If you are using this for pet hair I don't give it a good rating for that.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20180712
    },
    {
      "title": "Good purchase",
      "text": "Great vacuum. Not too heavy and compact. One problem is the hose that connects to the bottom. It is easily disconnected and sometimes gets in the way. This would not keep me from purchasing but could have saved me some time if I’d known about it also, I wish it had a light for dark corners.",
      "rating": 5.0,
      "verified": true,
      "author": "dvidal",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Great suction power, cleans up after my cats",
      "text": "I LOVE this vacuum.I have hardwood floors in my home with various area rugs throughout. I have 3 cats and their hair is on everything. I had a small stick vacuum that I thought was getting the job done until I washed the carpets and saw clumps of hair balling up and that pushed me to purchase the shark navigator on sale at $99. It works well on both hardwood and carpet and moves easily around the house. It gets most of the pet hair up but I did find a small clump of hair when washing my carpets after using the shark, but there was a huge difference. My rugs even feel softer. Overall, excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley B.",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Amazing results for hair",
      "text": "LOVE the power of cleaning up pet and human hair in this model. What is shown in my picture is what was done in literally 5 minutes. We have a cleaning service that came through 4 days prior. I can not believe we got this much out of our carpet this soon after they came. I didn’t go slow, went pretty fast. It’s disgusting and satisfying at the same time. Will recommend to all! Light weight and moves on a dime with amazing power. Did however leave a couple random debris pieces that were easily visible so not a whole 5 stars on suction review.",
      "rating": 5.0,
      "verified": true,
      "author": "PersnicketyNiketyPrice",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "best little vacuum",
      "text": "I bought this is November 2019 it wasn't working right so we called shark best customer service I have ever seen. Spoke to Zachary at shark was told had a 5 year warranty so he was going to ship us a new motor . He wanted to do some trouble shooting first and found out the vacuum was clogged in the straight part of the hose. He walked us through everything and the vacuum is working perfectly again. I will definitely buy shark products again they are amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Poorly designed vacuum!",
      "text": "Pros: I mostly have hardwood floors. It does have good suction and is good at edge cleaning. The vacuum head turns easy. Cons: IMO this is a POORLY designed vacuum. It is very top heavy and falls over constantly. An engineering disaster in that department. It makes it awkward to use! It comes with attachment that has absolutely NO home for storage. And the attachments that do have a home fall off easiky. Especially the extension wand. It falls off frequently if you breath near the machine. The lift away is heavy. All in all.... I say boo! Bottom Line: I would return this vacuum if I could. The suction and edge cleaning are it's only attributes. Shark...do better!",
      "rating": 2.0,
      "verified": true,
      "author": "Liz Pollitt",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "no complaints",
      "text": "Haven't had this too long about 3 months. so far it has been a surprisingly great machine. surprised how well it does for as light as it is. The ease of lifting it makes it easier to get hard out of the way places and stairs. Was easy for this older lady to put it together by myself. Has been tackling our country home with 4 indoor dogs (lots of hair and dirt) with no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "Rozalynne Banta",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Hugest waste of $150 you will ever spend",
      "text": "I purchased this vacuum 10 days ago. At first, it was ALRIGHT. Today was my 4th time using it, and for whatever reason, the only option that works is the ability brush-roll for carpet. The connector for hand-vacuuming completely does not work, and neither does the option for hard wood floors... which my whole house is. I tried to vacuum with the brush roll option (to make due) and it flung little pieces all over my home. I am so sad I wasted my time and money :(",
      "rating": 1.0,
      "verified": true,
      "author": "JESSICA PHILLIPS",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Excellent suction!",
      "text": "I haven't bought a new vacuum in over 10 years....so I was impressed with this machine! I recently moved into a house with stairs and carpet. It is very light and easy to use the canister and attachments for the stairs. The suction was incredible. I had to happily empty the canister 8 times because of all the filth it picked up! I was amazed. Hair does get wrapped around the bristles but that's the least of my problems in life! Lol. The price was reasonable. There is no retractable cord and it is not self-propelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth F.",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great while it worked. Then it stopped working.",
      "text": "This was a great vacuum for me, and I loved it. But it stopped working after eight months. The floor part still works, but the key element (where you can grab the arm and use it to reach a million hard places) stopped working. I changed the filters, made sure nothing was clogged... everything was clean, but the arm no longer works. I will purchase a different brand now, and I suggest you do the same. A vacuum is supposed to last longer than eight months.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel Vergara",
      "helpful_votes": 3,
      "publication_date": 20190911
    },
    {
      "title": "Shark Wins Again",
      "text": "This is my second shark. I bought a navigator about 4 years ago and our current home is 80% carpet that needs to be updated and renovated. Needless to say, I vacuum a lot. I got tired of deep cleaning my vacuum and it was time so I just bought a new one. Upon running it in my living room, it filled up the canister. My last shark was wonderful, but I forgot how powerful they are at first! So excited to use this one as it differs a little from the last!",
      "rating": 5.0,
      "verified": true,
      "author": "RANDALL A CREEL II",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Truly amazing",
      "text": "After vacuuming my living room with this machine, I was so glad that I purchased it. It collected an unbelievable amount of dirt that it was almost appalling. I cannot live without this vacuum cleaner now, and wish I bought it much sooner. It also glided very smoothly over my short pile carpet. Very pleased over all. Love the HEPA filter, too!",
      "rating": 5.0,
      "verified": true,
      "author": "I shop way too much here",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Quiet",
      "text": "Great product! The best vacuum cleaner I have tried so far. It cleans really well. I have cats and they shed a lot! This machine makes my life easy. The most Quiet among others I tried and seen, but powerful suction. Works very well in carpet.",
      "rating": 5.0,
      "verified": true,
      "author": "Mich",
      "helpful_votes": 2,
      "publication_date": 20200726
    },
    {
      "title": "An adequate vacuum, but look elsewhere for quality",
      "text": "After having this for about a month, I'm more disappointed in the purchase than I thought I would be. This vacuum works well for carpeted areas but is clunky and hard to maneuver for hardwood floors. One of the metal pieces holding the dirt containment tank in place has already started to loosen and falls out every 2nd or 3rd time I use the vacuum. I was hoping this would last a few years but I'm starting to think it may only make it to 6-12 months at most.",
      "rating": 2.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 2,
      "publication_date": 20190421
    },
    {
      "title": "Overall - excellent purchase",
      "text": "The Shark Navigator was an excellent purchase. Pros: I really like how light weight it is and how it twists around the floor. The attachments are well placed and easy to use. Top and bottom opening bid makes it easy to empty out. I've used it on carpet, tile, & wood floors as well as carpeted stairs and my door mats. It worked well on all surfaces. Cons: It does fall over - backwards. I have to be mindful of where I keep it. & I do missing a light on the front.",
      "rating": 5.0,
      "verified": true,
      "author": "Gretchen",
      "helpful_votes": 3,
      "publication_date": 20161121
    },
    {
      "title": "LOVE CLEANING WITH THIS!",
      "text": "So We have had our vacuum for about a month now and we usually vacuum about every other day, so far it suctions AMAZING. It picks up so much dust and hair that we didn't even think was there because of our old vacuum. The only thing I would say is a bit inconvenient is emptying the canister, and the cord does get in the way a bit. But for the sale price we bought it at and how it functions... so far.. It works effectively!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Amazing suction! Love the add ons!",
      "text": "Love the powerful suction, we have 2 dogs that shed horribly and I’m still having post part in hair loss so there’s just all kinds of hair everywhere It’s insane to see how much hair there is when using this vacuum.. really grabs everything! Such a difference!",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "This vacuum definitely works better than the Bissell that I thought I liked",
      "text": "This vacuum definitely works better than the Bissell that I thought I liked. I had just vacuumed with my Bissell the day before I got the Shark and the gunk in the tank of the shark made it look like I hadn't vacuumed in a month. I love the way it rotates easily and I like the color. The way the cord attaches at the top of the handle is handy but it keeps popping out. The one thing I definitely don't like is that it's a little heavier than I was hoping for.",
      "rating": 4.0,
      "verified": true,
      "author": "Believing",
      "helpful_votes": 0,
      "publication_date": 20180425
    },
    {
      "title": "Didnt last 6 months",
      "text": "Lasted 6 months with minimal use (only area rugs in house). The curved handle is part of the hose and kept getting clogged. I had to take it apart and stick things in there to unclog usually causing the dirt to poof out all over the place. Yesterday it just suddenly died while vacuuming. It is also not very stable.",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs. Michelle F. Thompson",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "JUNK",
      "text": "This didn't even last 2 years. Total piece of crap. I've replaced the filters 2-3 times. This is the second time I've had a shark and it didn't last long. This one specifically is total junk. Awkward to use and very short cord. Just pass on this.",
      "rating": 1.0,
      "verified": true,
      "author": "ProAV",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Worked great! For two months.",
      "text": "I was very happy when I got this. Lightweight, maneuverable, easy to use and did a great job. Even with pet hair. Then, the madness started. For no clear reason, the roller brush decided to only work sporadically. It was inspected, cleaned, pet hair removed, but to no use. Now the roller brush doesn't run at all. It's basically been reduced to a large, hard surface vacuum. Absolutely no help from Shark either. Don't buy this. Unless you're a fan of frustration.",
      "rating": 2.0,
      "verified": true,
      "author": "Log",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Powerful but lanky",
      "text": "I seem to be in the minority, but I'm not a fan of these models which are top-heavy and can't stand alone. If I stop vacuuming I don't want to have to walk over to a wall to lean it, or lay it down on its side. It is powerful, but I will search for a powerful vac without the awkward design. I don't think the swivel base is worth the loss of stability",
      "rating": 4.0,
      "verified": true,
      "author": "cheryl",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "Special tamper resistant screws are only going to result in you throwing your vacuum out",
      "text": "Initially liked the vacuum it had good suction and tackled the dog hair well. Exactly 1 year from the day of purchase The brush stopped turning. In order to take the base off I had to purchase a special tamper resistant torx screw set. Then I had YouTube help me find the 9 hidden screws and it turns out the belt was on and the motor must have just died. Screw you shark !!",
      "rating": 3.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 2,
      "publication_date": 20200725
    },
    {
      "title": "Not my best purchase",
      "text": "I love this vacuum for getting under tables, vacuuming our couches, on hardwood floors, and on low carpet. However, this vacuum is no good on high carpet. It is so close to the carpet that it doesn’t pick up any debris larger than a popcorn kernel. Even then it struggles. Other vacuums adjust the height of the roller. This vacuum adjusts the suction. If I could return it, I would. We’ve had it for nearly a year and every time I need to vacuum, I put it off.",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal Frizie",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Missing the pet tool",
      "text": "Opened the box and it's missing the spinning pet tool. Called Shark's 800 number, and the girl ordered it for me and said I should get it in 3-5 business day. Used the vacuum one time so far, and it works fine. I have another Shark which I love (different model), so I decided to order this one for my basement, which doesn't get used much. I only gave it 4 stars cause it's missing the spinning pet brush, but like very much the customer service as she immediately said she would have one sent to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Bonnie K Soliz",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Best vacuum ever!",
      "text": "I have 2 dogs, 2 cats and people coming and going. Live in a wooded area and lots of stuff gets inside my house, on the carpets and tile floors. This machine exceeded all of my expectations. I had vacuumed my floors and my old vac went kaput. Ordered next day delivery and got it. Actually had to empty the cup twice in each room and was amazed the amount of stuff my old vac didn't pick up. My cream carpet was finally as light as it was once all the stuff was sucked up. Best vac ever, and I have purchase quite a few over the decades.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary K.",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Complete lemon, $150 for a vacuum that last 6 weeks",
      "text": "Bought this 6 weeks ago and it’s already dead. Family of 2 with a cat, 1000 sq ft home. The tube connecting the base to the bag regularly would detach, meaning if I didn’t notice immediately I was vacuuming for no good reason. Last night I start vacuuming and all of a sudden it just stops, I tried about 10 things and it’s dead. Wasted $150 for a PIS, I have had sharks in the past that we’re great, but after this I’ll never buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Karlie Knoff",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Best Vacuum Cleaner Ever",
      "text": "I love this vacuum. I have never loved a vacuum before, but this one earned it. It has a lot of power, is easy to clean and has all the attachments you could ever need. I love the versatility of it as either an upright or a canister vacuum. It works on high carpets, low csrpets, and hard surfaces. It's so worth it. I've had Dyson vacuums and this Shark has convinced me that they are overpriced and overrated.",
      "rating": 5.0,
      "verified": true,
      "author": "gibsonfamily",
      "helpful_votes": 0,
      "publication_date": 20180626
    }
  ],
  "product_meta": {
    "title": "Shark Navigator Upright Vacuum for Carpet and Hard Floor with Lift-Away Handheld HEPA Filter, and Anti-Allergy Seal (NV352), Lavender",
    "description": "A lightweight 2-in-1 Lift-Away upright vacuum with a detachable canister for portable cleaning power. With the push of a button, Lift-Away technology allows you to lift the canister away and easily clean in hard-to-reach areas. This vacuum is also equipped with Swivel Steering for excellent control when maneuvering around furniture, and has a completely sealed system with a HEPA filter to trap dust and allergens. Additionally, it has a brush roll shutoff button so you can easily switch between carpet and bare floor cleaning.\n\nBRAND STORY\nBy Shark",
    "rating": 4.5,
    "feature_bullets": [
      "Lift-Away: Press a button to lift the canister away and easily clean hard-to-reach areas.",
      "Anti-allergen complete seal technology and a HEPA filter trap dust and allergens inside the vacuum.",
      "Powerful and lightweight upright vacuum. Portable and versatile at only 12.5 pounds",
      "Brushroll shutoff allows for both deep carpet and gentle bare floor cleaning",
      "Swivel steering for excellent control to maneuver around furniture",
      "What's included: Wide Upholstery tool, dusting brush, 24\" crevice tool, 5.5\" crevice tool"
    ],
    "specifications": {
      "Product Dimensions": "15 x 11.4 x 45.5 inches",
      "Item Weight": "8.7 pounds",
      "Department": "Floorcare",
      "Manufacturer": "SharkNinja",
      "ASIN": "B004Q4DRJW",
      "Item model number": "NV352",
      "Customer Reviews": "4.5 out of 5 stars7,266 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#284 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Stairs, Carpet, Bare floor",
      "Is Assembly Required?": "Yes",
      "Number of Pieces": "1",
      "Warranty Description": "Sharkninja five-year",
      "Batteries Required": "No",
      "Included Components": "Shark Navigator Lift-Away Vacuum, Dusting Brush, 5.5 Inch Crevice Tool, 24 Inch Crevice Tool",
      "Import Designation": "Made in USA or Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Upright Vacuums",
      "Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 170.24
  }
}