{
  "website_summaries": [
    {
      "verdict": "A modern frameless shower door that is easy to keep clean.",
      "pros": [
        "Water-repellent and stain-resistant coating",
        "Door opens smoothly and quietly",
        "Well constructed"
      ],
      "cons": [
        "Can be difficult to install"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Quality product, very classy look",
      "text": "I'm 100% pleased with this door, it's an integral part in a beautiful bathroom remodel. The door's sliding/roller motion is so smooth, it just feels like quality. The instructions were great. Other people have mentioned breakage, but the only issue I had was I chipped a small spot on the bottom corner of the sliding door when I was lifting it up onto the threshold. Should have padded the threshold... my fault. I installed it myself with help from my son, definitely a 2 person job. The 2 glass pieces are HEAVY, and the crate it came in was barely movable by one person.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Shepherd",
      "helpful_votes": 10,
      "publication_date": 20161201
    },
    {
      "title": "Great door for the money. Would recommend on flips & in own house.",
      "text": "For $750 it's hard to complain. This style in a customer door is $2,500+. The entry portion has a rail siliconed to the floor. This really should be considered an optional install item but I'm sure the manufacturer/ installers don't want water damage liability. If you know water will not leak out of the bottom of the sliding portion (when in closed position) you should instruct the installer to simply not install that piece. Best case scenario it takes away the \"threshold\" look. Worst case scenario you call the installer back for a $50 charge probably.",
      "rating": 5.0,
      "verified": true,
      "author": "Traci Janik",
      "helpful_votes": 2,
      "publication_date": 20180125
    },
    {
      "title": "Beautiful design, solid construction",
      "text": "Beautiful design, solid construction. After three months of use we are still very happy with these doors. They are very substantial with thick glass. The roller operation is smooth and silent. Looks fantastic in a contemporary bathroom. Two things to note: First, the panel next to the showerhead is fixed so you have to stand in the shower to turn on the water. Second, since there is not a full bottom track on the sliding portion, a small amount of water will seep under the door. It's not much if you keep the spray pointed a little away, but it's not something that happens on a full track door.",
      "rating": 5.0,
      "verified": true,
      "author": "piper pilot",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Watch out for exploding glass",
      "text": "Bought this door in April Installed it in may. Had been working great 2.5 months later, in the middle of a shower, the door randomly shattered and exploded. Needless to say I would like a refund and whatever else is appropriate. Also see pictures attached. Girlfriend had shards of glass all over her lower body and extremities resulting in a pretty gruesome scene. Oh and before the assumption that the door was slammed or anything else. It wasn't. This was in the middle of a shower and the door hadn't been touched since getting in 15 minutes earlier.",
      "rating": 1.0,
      "verified": true,
      "author": "Stevfast",
      "helpful_votes": 16,
      "publication_date": 20170802
    },
    {
      "title": "Don't let the poor reviews scare you!",
      "text": "I am a contractor and put these doors in a lot. Buying on Amazon was cheaper than Lowe's by about $150 and I received it in less than half the time Lowe's would typically get it to me. Don't be afraid of what people are writing about this door exploding, this has to be coming from inexperienced or unskilled individuals. I've put in at least 10 of these over the past 3 years, and I've never had one explode. They are a bit tricky to install. One thing is that the walls NEED TO BE PLUMB. You will have problems if they aren't.",
      "rating": 5.0,
      "verified": true,
      "author": "Abe wilcox",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "The instructions are extremely poor which made it very difficult to install",
      "text": "The instructions are extremely poor which made it very difficult to install. My contractor said 'sorry' I can't install this. My husband and three men spent six hours figuring how to install. Read instructions fully, apply common sense, before attempting to install. Doors are heavy...put the doors in the shower area before installing bar. The instructions were scrambled and out of order. Unless you enjoy puzzles stay away from this product or hire a professional. Be aware the professional may walk away because of difficulty understanding instructions. The doors looks nice (not perfect)",
      "rating": 3.0,
      "verified": true,
      "author": "Cathy Johnson",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "It works well",
      "text": "Received this as scheduled and all was intact. Good coordination with the delivery company. This unit is really heavy when packed together in a box. We took it apart to actually move it where needed. Instructions are pretty good and I did read all before installation. All the parts were there as shown. This went in pretty easily with two people doing the installation. Quality looking installation with heavy doors and good fitting hardware. Very pleased with this unit. I'd definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "ColoradoComments",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Great door, minus the bottom frame",
      "text": "Beautiful door, heavy glass- but my only complaint is there is this strange out of place bar across your will, wish it was under the sliding door and not sticking out like a sore thumb. Just seems tacky, like a curtain rod on the bottom you have to step over... super fast delivery. All parts on the first shot (can't say that about my other dreamline). The thicker glass does make a difference.",
      "rating": 3.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 3,
      "publication_date": 20170413
    },
    {
      "title": "Best looking door I've ever seen.",
      "text": "Awesome looking door than works like a dream. I got many comments as to how awesome of a door this was during our renovation. I did have a professional install the door as it seemed complicated and do not regret it. It took 5 hours to install. The only negative thing I have found is more water splashes under the bottom lip of the roller door than what I like. It really isn't that much but it doesn't seal like a normal door and is near to impossible to remedy this issue due to its function of the sliding glass.",
      "rating": 4.0,
      "verified": true,
      "author": "duke",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Great Shower Door - Love it!",
      "text": "Received this door as scheduled (Amazon/XPO) and all was good packaging, great coordination with the delivery company. This unit is really heavy when packed together in a box - about 200lbs. Instructions are pretty good and I did read all before installation, there are some youtube videos out there to help with the installation. Definitely need two people to do the installation and make sure all your wall are level, straight and secure. Fit nicely in our new remodel shower, great price and very pleased with this unit. I'd definitely buy this again and recommend this sliding door.",
      "rating": 5.0,
      "verified": true,
      "author": "Sepnotic",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Great shower door",
      "text": "This is the third time I have installed this door. Goes in relatively easily if you follow the instructions. The Instructions are pretty good and easy to follow. It would be nice to have some pre-installation instructions online here as to where to put support backing prior to drywall. The manufacturer does include anchors but suggests installation into studs if possible. Definitely a two man job.",
      "rating": 5.0,
      "verified": true,
      "author": "Leonard Kline",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Arrived in perfect condition. Too bad the shipping company left the ...",
      "text": "Arrived in perfect condition. Too bad the shipping company left the pallets though. This door is awesome functions perfectly gliding smoothly etc... and has a clean & modern look. My husband and I installed, it was not easy but doable for good DIYer's with proper tools i.e., suction handles, levels etc.... Each panel is about 130lbs so its work. Tip- make sure to place the sliding panel inside your shower (the proper direction) before you install the stationary panel to make it easier. Looking forward to many, many years of great function and looks.",
      "rating": 5.0,
      "verified": true,
      "author": "hasbarr",
      "helpful_votes": 2,
      "publication_date": 20151223
    },
    {
      "title": "Months later and it still looks like a dream",
      "text": "Very impressed with the build quality of these frameless doors. Install was a challenge - at least that's what our contractor told us. They had it mounted in half a day. We've been using it for a few months now and no issues. No leaking. No chips in the glass. Stainless steel hardware still looks gorgeous. Sliding door has a very solid feel. Invest in a good glass cleaner and I feel like this will last a lifetime. Update: It's been a little over a year now and still works flawlessly. Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "David Yonehara",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "I installed these shower doors in a \"high end\" bathroom remodel and they look great. The directions were clear and detailed enou",
      "text": "I have been a Licensed Home Improvement Contractor for 20 years and handle all sorts of remodeling projects. I installed these shower doors in a \"high end\" bathroom remodel and they look great. The directions were clear and detailed enough. The doors took about 3 hours to install. The mechanisms work smoothly and the design was a nice addition to the wow factor I was looking for. These are heavy and I would not recommend attempting to install with one person.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Thompson",
      "helpful_votes": 6,
      "publication_date": 20150521
    },
    {
      "title": "I really like the look of this glass door set",
      "text": "I really like the look of this glass door set, which is why I purchased the unit after seeing it on display at the store. Not a easy install, but managed to do it myself without mishap. Your opening needs to be perfectly square, which mine was not, but with a little tinkering I managed to get it to look nearly perfect. I like the height of the crossbar as I am tall and don't like ducking to get into the shower. I would recommend these doors only if your opening is square. If yours is not, then make it square first.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Landgraf",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "We like it!",
      "text": "Installed this shower door on our walk-in shower about a month ago and it has performed great! I installed it myself following the provided instructions. If you are deciding whether to 'do it yourself' or hire it, read through the instructions before you buy (can be downloaded). If your walls are not square with the floor, this door may not fit proper. My walls are each one-fourth inch different from square; more than that would have been a problem. Curb delivery of package went fine; inspect glass immediately to ensure no breakage; since it is safety glass it would shatter into small bits rather than just crack.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20150321
    },
    {
      "title": "Very satisfied with their customer service",
      "text": "Absolutely gorgeous and pleasantly functional. Hard to install compared to others, but the steps are well explained in the manual and the effort well worth it. My old house has slanted walls (up to 5%) and there were minor leaks from under the sliding door. I called Dreamline and they sent me a transparent skirt strip free of charge which completely eliminated the problem without affecting the appearance of the door. Very satisfied with their customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "mightwolf",
      "helpful_votes": 3,
      "publication_date": 20150709
    },
    {
      "title": "Extremely satisfied",
      "text": "It might not be easy to make a decision to buy such a big thing without seeing it. Thanks to my contractor's great suggestion. Have to admit, though, that I was a little nervous about it. It was the quote from local stores (over $2000) and the waiting time (4 weeks) that eventually pushed me to get it -- simply cannot be more satisfied. Item arrived in about two weeks. Well packed. The beautiful glass and high quality metal pieces together give a great modern look. Slides very smoothly. Almost no cleaning/maintenance work is required after shower. Cannot comment on the installation since my contractor did everything and obviously this was not the first time for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail",
      "helpful_votes": 11,
      "publication_date": 20160311
    },
    {
      "title": "This door is sweet. Very high quality and looks great",
      "text": "This door is sweet. Very high quality and looks great. Will probably order another for other bathroom. It's very heavy so takes 2 people to install. My daughter was able to assist me with no problems but I am a DYI guy. Would not recommend DYI unless your very confident in your DYI capabilities.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell Campbell",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "Might be a fine product, but not if you can't install it",
      "text": "Packaging was flimsy. When product was lifted for carrying to install (after sitting for 2 months during construction), one panel shattered; the other was chipped. Packaging: 3/8\" foam in the corners... and then the shipping carton. I opened on arrival to inspect... but the damage was hidden, subtle, but fatal. Might be a fine product, but not if you can't install it!",
      "rating": 1.0,
      "verified": true,
      "author": "Amos",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Mostly very nice.",
      "text": "The original rail and stationary glass bolts did not match, but were quickly and efficiently replaced with a phone call. Probably should have been checked before shipping, which was done before the replacements were shipped. Good. Very high quality components, other than that snafu. Use an experienced installer or be pretty experienced yourself and be prepared to follow the (fairly good) instructions carefully . At least 2 people. Very attractive once finished.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Excellent customer service",
      "text": "Love this product and the companies desire to please their customers. I had an issue with my installer and door shattered months later contacted company and they shipped new glass out a few days later at no charge one can't ask for better than that.",
      "rating": 5.0,
      "verified": true,
      "author": "George F.",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Looks great but take your time to install correctly",
      "text": "Looks great but was a little pain to install. Glass panels are extremely heavy so 2 person job. Walls and bottom need to be square especially on the fixed panel side. Hardware allows for some adjustment which can be time consuming if you want it absolutely perfect. Always scared to break the glass with these kinds of shower doors but seems sturdy enough. Make sure you have backing in the walls to mount the top rail. Door slides very smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Bartman",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Beautiful",
      "text": "Workmanship, design and materials are excellent. Installation requires reading and re-reading the instructions. You only have one chance to get it right. The glass panels are heavy. Two strong people are required. I am a DYI'er and was able to install it with the help of another man. The parts come in numbered plastic bags that are keyed to the instructions. Once installed, my wife loves it, and it looks and works great.",
      "rating": 4.0,
      "verified": true,
      "author": "pogoshopper",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "This sliding shower door goes PERFECT with my renovated bathroom",
      "text": "This sliding shower door goes PERFECT with my renovated bathroom. It took the home improvement guy a few hours because he usually installs the open door glass. He said the instructions was pretty simple. We didn't add all the rubber pieces that goes around glass sides. I like more of a LOW PROFILE look. The sliding door has an adjustable stop lock. So the door don't slam into the wall. Delivery was great. It comes on a crate bed that keeps glass very secure. I will definitely recommend this glass",
      "rating": 5.0,
      "verified": true,
      "author": "dee",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Worth the money!",
      "text": "Beautiful modern design. It took my husband and our contractor a few hours to install but in the end it all came together very nicely. Seven months after installing it, the door still functions and looks beautifully. The only small complaint (hence, the 4 stars) is that after about 4-5 months after installation, the sliding door does not stay open; when opening it all the way, it slides back into close position...not a huge deal but it would be nice if it stayed open.",
      "rating": 4.0,
      "verified": true,
      "author": "Dalemele",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Every part and piece was labeled beautifully! Moving the glass doors was perhaps the hardest ...",
      "text": "After reading reviews we were prepared mentally for a potentially difficult task. From the timely delivery to the last moment of installation...flawless! Every part and piece was labeled beautifully! Moving the glass doors was perhaps the hardest part along with handling them while measuring. Other than that just being prepared was the key. The door is beautiful, well manufactured, and functions amazingly!!! I had not anticipated this in my remodel budget but I do not regret it for one second...It is incredibly beautiful!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marshajayne",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Enigma Frameless Sliding Shower doors.",
      "text": "Beautiful and sleek frameless shower door. I get nothing buy compliments on how good it looks in the bathroom. Thick glass and smooth sliding rollers. I definitely recommend this door for any bathroom re-modeling. I also recommend having a professional install it due to the size and weight. Be sure your side walls are plumb or else you will have small gaps between the glass and wall when installed. Good luck and enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Armando",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "great value IMO",
      "text": "High quality product with very well machined steel parts (we got the brushed stainless steel version); great value IMO. Installs best if walls and shower are plumb; but there are options through third party vendors to deal with at least the stationary glass / wall interface if just a little off plumb. Instructions are straightforward and relatively easy to follow if even slightly 'home improvement able.' The weight of the glass sheets is the most difficult consideration when installing (you'll VERY likely need two people at a number of points in the installation) as others have said. Very pleased with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "MARTIN G WINKLER",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Beautiful door, recommend pro install or at least have help",
      "text": "I love this door! Everything was packaged beautifully. It looks great in my bathroom. The installation instructions is the only reason it didn’t get 5 Stars, could use some clarity in a few areas. Read the other reviews and suggestions and you will be fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Xtablue",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "great buy solid door",
      "text": "its a bit tricky to install, lots of measuring and no room for error as if you cut it to short then it will not fit. would recommend to have a professional install, especial if your shower has tile or porcelain walls.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward L.",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Five Stars",
      "text": "Love the door. Substantial feel, but slides smoothly, easy to clean. Really dresses up our bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "AudibleFan",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Five Stars",
      "text": "just make sure your walls are aligned and symmetric; otherwise use a version with frames.",
      "rating": 5.0,
      "verified": true,
      "author": "Aldrin",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "they nail this perfect and I am so happy the quality and the ...",
      "text": "As I hired a professional glass installation company,, they nail this perfect and I am so happy the quality and the look. Even the installation guys were amaze the look and thickness of the glass. Highly recommend this item. Please hire pro to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Chandi",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Beautiful shower",
      "text": "A bit more complicated to install, have to assemble and disassemble a few times in order to setup the fixed components precisely, but the final results made everything worth it. The glass is very thick and heavy, definitively a two-person install. Several friends have seem it installed and now want to get one as well. Very happy with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "F. LOPES",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "Perfect fit, great product",
      "text": "Used in new shower install, smooth roll and perfect fit",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan E.",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Good product, you need to know what you are ...",
      "text": "Good product, you need to know what you are doing to install this, but a great product rolls/slides beautifully and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Wade M. Butterfield",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "but the instructions are fair at best. Mostly",
      "text": "42 years in remodeling. Do not try to install this if you don't have someone that knows what they are doing. Walls and pan MUST be 100% dead-on plumb and level. Very high quality, but the instructions are fair at best. Mostly, the lack of telling you that all of the bolt-ons are eccentric. That's good for the adjustment factor after installing, but the main guide rail bolts that hold the stationary glass should not be adjustable. Double check your measurements off of the top of the glass when you put these on. It will cause problems if they are not even.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20150906
    },
    {
      "title": "Extremely good product",
      "text": "Arrived shattered and had a lot of trouble trying to replace it.",
      "rating": 5.0,
      "verified": true,
      "author": "dorothy s.",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "sweet door",
      "text": "Lve Love Love this door. Professional grade quality, contemporary and sleek minimal design. You will need 2 people to install it, this baby is heavy !",
      "rating": 5.0,
      "verified": true,
      "author": "steveocray",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "'Dream' come true. She wanted a tiled shower with glass doors. She got it.",
      "text": "'Dream' is right. Awesome product. Contractor was even impressed with it compared to local products he has used.",
      "rating": 5.0,
      "verified": true,
      "author": "{-_-}[-_-](-_-)",
      "helpful_votes": 0,
      "publication_date": 20170919
    },
    {
      "title": "Great door",
      "text": "Love this door! I get so many compliments. Someone who works building houses commented that this is the nicest door that he has ever seen. I recently bought another for my guest bath.",
      "rating": 5.0,
      "verified": true,
      "author": "candace l witherspoon",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Good shower door and great product support.",
      "text": "This is as advertised and does well for my shower.",
      "rating": 5.0,
      "verified": true,
      "author": "lzbn69",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "Great door. Excellent delivery service",
      "text": "Great door. Excellent delivery service! Quite heavy and difficult to work with but it's all worth it at the end.",
      "rating": 5.0,
      "verified": true,
      "author": "xeno",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Exquisite",
      "text": "Beautiful design and the price was excellent. This door works flawlessly and the weight of it makes if feel expensive. I will definitely look for this shower door next time I build a bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Zacharias",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Beautiful shower door",
      "text": "Shower door looks great installed. No issues so far, will update if anything changes.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Bullard",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Beautiful and well made",
      "text": "Beautiful and well made. We are so happy with these! My contractor said it was the best looking doors he has ever installed and was amazed at their quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "A Mom to 2",
      "helpful_votes": 0,
      "publication_date": 20150522
    },
    {
      "title": "Looks great.",
      "text": "This is a great shower door, but requires professional installation. Make sure your shower tile is smooth with no protusions.",
      "rating": 5.0,
      "verified": true,
      "author": "Linn F. Neilson",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "Very high quality. As a contractor I've paid well ...",
      "text": "Very high quality. As a contractor I've paid well over 2k for similar doors installed. Make sure your sill and walls are level and place your order, worth the 4 hours install time.",
      "rating": 5.0,
      "verified": true,
      "author": "Charkoll",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Five Stars",
      "text": "Very good delivery service, arrived in time. Very nice product, good looking, good quality, no problem with installation.",
      "rating": 5.0,
      "verified": true,
      "author": "Vyacheslav Guyshan",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Five Stars",
      "text": "Looks great! I wasn't sure what to expect, but it's perfect. Something I'd have a professional install though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Five Stars",
      "text": "It worked well until recently it doesn't slide smoothly - I can only slide it to half of the opening and it then stops sliding. Any idea how to fix?",
      "rating": 3.0,
      "verified": true,
      "author": "W. Li",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "beautiful doors",
      "text": "These slide so smoothly and are made of such a nice heavy weight glass that they they could be put in a 5 star spa they are so beautiful and for the price - unbeatable. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "James E Langworthy JR",
      "helpful_votes": 2,
      "publication_date": 20130912
    },
    {
      "title": "Buy it",
      "text": "This is awesome, I put this on a custom tub that has 10' ceilings. All of the hardware was great and instructions were good to use. Glass looks great, you will need a buddy to help hang the glass. It is very heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Erickson",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "Happy with shower doors",
      "text": "Beautiful, elegant, modern. Quality glass & trim material. Heavy, takes more than 1 person to install and you have to read the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "The Bliss",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "Five Stars",
      "text": "this is an awesome looking door!! easy to install too",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "Great Product",
      "text": "Did not think it was going to be this good of quality and look this great. The reviews are definitely accurate and am thinking about purchasing one for my other bathroom. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J.",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Great Shower Door",
      "text": "Door is beautiful and arrived early with no problems! Be aware that it is heavy and I would not recommend a DIY installation. We called Dreamline Customer support with installation questions and they were very helpful. It looks great in our remodeled bathroom and it really shows off our beautiful tile work!",
      "rating": 5.0,
      "verified": true,
      "author": "A Egli",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "High quality hardware and glass",
      "text": "I bought this sliding door after having read the positive reviews here on Amazon, and I must say that it didn't disappoint. Everything came neatly packaged and numbered, and the manual was detailed and explained everything step by step. It's definitely a two person job to install the doors - the glass is heavy and there is no way that a single person can move it around and at the same mark and measure everything for drilling. Read the installation instructions a couple of time before starting - it's just a bit more complicated than your standard Ikea cabinet :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Bo K.",
      "helpful_votes": 3,
      "publication_date": 20140214
    },
    {
      "title": "Looks great",
      "text": "Used professional installation. Looks great and feels solid and well made. And the sub-$1,000 price is great value. Definitely Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy84",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "... of product was top end and customer service was excellent. Had a problem with rollers not separating they ...",
      "text": "Quality of product was top end and customer service was excellent.Had a problem with rollers not separating they said they would have new rollers shipped to me the next day.I would suggest professional installation as unit is heavy and needs to be installed with exact tolerances.",
      "rating": 5.0,
      "verified": true,
      "author": "Gordon Forrester",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "Amazing",
      "text": "This is such beautiful quality and a fabulous price. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "Amazing",
      "text": "Amazing. Best looking shower door. Installation was long but we get it right from the first time. No water leak. I just love it especially everything went great.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Habib",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "Love it!",
      "text": "This door is well constructed. The glass is thick and it runs smooth. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Karla",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "Great product, installation looked more difficult than it really ...",
      "text": "Great product, installation looked more difficult than it really was! Instructions were good and all parts are clearly marked. People love the look. Works really smooth. I cannot see why you would not like this door. Installation is a 2 person job. Also bought a shower base from DreamLine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Five Stars",
      "text": "excellent door. The price is fair and the product went in well",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Great door for the price.",
      "text": "Great door at a reasonable price but have help on hand to unload- really heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "islanderhhi",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Worked for 2 days then shattered",
      "text": "The sliding door shattered 2 days after installation, lets see how good the customer service is. These doors have to be put into position several times during installation and I did not mishandle them. I am a contractor and this is the third set of Tempered glass doors I have installed. When they worked the looked and operated great. Received a new door and after a month the door still works great and looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "R G",
      "helpful_votes": 18,
      "publication_date": 20131028
    },
    {
      "title": "A real wow factor.",
      "text": "Beautiful, well built, and the perfect finish to a new bathroom.",
      "rating": 5.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Quality item",
      "text": "Just installed the Dream line Enigma-X shower sliding doors and they are awesome . The instructions could be better to make installation easier",
      "rating": 4.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Great shower door",
      "text": "The shower door is amazing! It was a bit difficult to install, but we'll exceeds our expectations. Looks amazing and glides smoothly.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Hutson IV",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Four Stars",
      "text": "Very happy with the appearance and function of this shower enclosure.",
      "rating": 4.0,
      "verified": true,
      "author": "Gloria Salkin",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "great shower sliding door",
      "text": "I am a retired General Contractor. I remodeled the master bathroom at our summer home and I installed this sliding system. The product will not disappoint you.",
      "rating": 5.0,
      "verified": true,
      "author": "PIERRE PAQUETTE",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "great customer service",
      "text": "Product and service are the best. Easy to install customer service reps very helpful. Would buy this product for future projects.",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 6,
      "publication_date": 20131002
    },
    {
      "title": "Five Stars",
      "text": "beautiful doors, very cool look, definitely need 2 people to install, but not hard to do, 2 hours",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Graff 3rd.",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Great shower doors",
      "text": "love my shower doors. Not the easiest to install but look great and work perfectly. going on 2 months. all the best JC",
      "rating": 5.0,
      "verified": true,
      "author": "john carrasco",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Great shower door",
      "text": "Beautiful looking shower door, very contemporary and classy. Delivered on time with no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorota J. Gal",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "Superb shower door",
      "text": "We looked for a contemporary shower doors locally and considered custom options. This one cost around $1,300 comparing to the custom solutions $2,000+. It's a very good quality and looks really nice and modern. It was in place for half a year and so far there was no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrei Baboulevitch",
      "helpful_votes": 4,
      "publication_date": 20140322
    },
    {
      "title": "Five Stars",
      "text": "workers installed today wow what a great product love it :)",
      "rating": 5.0,
      "verified": true,
      "author": "robert g boswell",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Does not stand the test of time",
      "text": "Had this door professionally installed the summer of 2015. It does not hold up well, and is no longer straight on the track which caused the glass on the bottom to crack. Buyer beware. Update: The finish on the stainless steel is also impossible to clean properly because of the design.",
      "rating": 1.0,
      "verified": true,
      "author": "2 flowers",
      "helpful_votes": 2,
      "publication_date": 20170711
    },
    {
      "title": "Awesome, gorgeous shower door",
      "text": "Awesome, gorgeous shower door. As previously stated by others, your walls/floor must be perfectly level in order to use this door, and it will probably take a solid hour and a half to install. Unfortunately our walls were not level, so we actually needed to have one of the pieces welded to make everything work. Now that it does, I'm very happy with the door. Walls MUST be level!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Carey",
      "helpful_votes": 7,
      "publication_date": 20150217
    },
    {
      "title": "Sturdy, elegant, and well designed",
      "text": "Finally have moved into our new home and we simply LOVE this shower door. It's got a great weight to it, and yet it's so smooth/soft to open. Looks super expensive and is very sturdy. Have gotten some compliments on it even. Great item.",
      "rating": 5.0,
      "verified": true,
      "author": "impossibilia",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Not easy to install",
      "text": "My contractor couldn’t install because the screws are too short to go through tile and drywall and/or wood. Called the consumer help desk and they couldn’t help. Stuck with glass door in my garage",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl a.",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "i totally recommend.",
      "text": "it looks really neat, but let me warn you that installation took quite longer, too many small parts. also, there was a slight gap on the bottom of the door that i had to shield. overall it added so much beauty to the bathroom. i totally recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Satya Alapati",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Beautiful door except the black market at eye level that ...",
      "text": "Beautiful door except the black market at eye level that seems to be in the glass. The contractor doesn't know what it is and since it took them this long to install I'm stuck with it! Make sure to inspect door even if not installing right away.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "The doors are heavy and feel solid and sturdy. Do not try to install this yourself",
      "text": "Had a contractor install the door along with a Dreamline shower base. The doors are heavy and feel solid and sturdy. Do not try to install this yourself, esp if you have little or no experience. This is NOT a DIY project.Hire a professional. Love the look, BUT the sliding door does leak a significant amount during showering. the metal threshold that they supply does very little to stop water from overflowing or splashing out. I contacted Dreamline customer support, and the have shipped out a plastic strip that is supposed to solve the problem. I'll try it out when I receive it in the mail. Otherwise I would give it 5 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "M.R.",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "I would recommend this product",
      "text": "The frameless slide shower door add a luxury feeling to the bathroom and it looks so much nicer. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Four Stars",
      "text": "I love this door, it looks beautiful once installed. I recommend getting a squeegee to keep the glass clear.",
      "rating": 4.0,
      "verified": true,
      "author": "wendy",
      "helpful_votes": 0,
      "publication_date": 20141117
    },
    {
      "title": "Do not buy this product!!!",
      "text": "Since my initial order the amazon installers have had 2 different doors break upon installation. It has now been a month of phone calls and appointment scheduling only to get a house full of broken glass - and no working shower door. I received a refund, but was left with half a shower door and a bunch of holes caused from the installation. Not too mention all of the shipping crates and boxes that were just left for me to dispose of. The installer told me they are going to stop doing installs on this product because he has had 4 others break during install in the last month alone. The support bar is apparently not sturdy enough.",
      "rating": 1.0,
      "verified": true,
      "author": "JLands",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Five Stars",
      "text": "easy install, beautiful shower door. I am happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kijeong Jeon",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Fittings don't FIT",
      "text": "Most of the fittings that came were not properly sized. We had to run to hardware store to find alternate ones. Took a long time to install, very frustrating!",
      "rating": 2.0,
      "verified": true,
      "author": "Vivian Kimmelman",
      "helpful_votes": 5,
      "publication_date": 20140223
    }
  ],
  "product_meta": {
    "title": "DreamLine Enigma-X 56-60 in. W x 76 in. H Fully Frameless Sliding Shower Door in Polished Stainless Steel, SHDR-61607610-08",
    "description": "Color:Polished Stainless SteelThe DreamLine Enigma-X shower door, tub door or enclosure brings an air of sophistication and luxury with its modern and fully frameless design. The striking stainless steel hardware delivers a perfect mix of exceptional quality and cool urban style. DreamLine exclusive ClearMax water and stain resistant glass coating adds superior protection from stains and is nearly maintenance-free. Model is reversible for a right or left door opening installation. Please note: 2 person team necessary for proper installation. Drilling into the tub/threshold is required for installation of this product.\n\nFROM THE MANUFACTURER\nThe DreamLine Enigma-X shower door, tub door or enclosure brings an air of sophistication and luxury with its modern and fully frameless design. The striking stainless steel hardware delivers a perfect mix of exceptional quality and cool urban style. Glass is treated with DreamLine exclusive ClearMax water repellant and stain resistant coating for superior protection and easy maintenance. Choose DreamLine for the ultimate solution for your shower project. Premium 3/8 in. (10mm) thick ANSI certified clear tempered glass. ATTENTION! This model has NO adjustment for width or out-of-plumb (uneven walls). Fully Frameless design for an open and spacious feeling. Stainless Steel top guide bar can be trimmed up to 4 in. for width adjustment. Anti-splash threshold to prevent water spills (requires minimum threshold depth of 2 3/4 in.). Large wheel assembly creates effortless sliding action. Reversible for a right or left door opening installation. Optional SlimLine shower base available (sold separately). NOTE: DreamLine shower bases will always be larger (approximately 2 in.) than the corresponding DreamLine shower enclosures/doors. Please, take this information under advisement when ordering your shower base and shower enclosure separately.",
    "rating": 4.2,
    "feature_bullets": [
      "Model Size: 56-60 in. W x 76 in. H; Walk-In Opening: 22-26 in.",
      "Configuration consists of: Stationary Panel and Sliding Door; Fully Frameless design for an open and spacious feeling",
      "Premium 3/8 in. (10mm) thick certified clear tempered glass; DreamLine exclusive ClearMax water and stain resistant glass coating",
      "Large wheel assembly creates effortless sliding action; Stainless Steel Top guide bar can be trimmed up to 4 in. for width adjustment",
      "ATTENTION! This model has NO adjustment for out-of-plumb (uneven) walls; Reversible for a right or left door opening installation",
      "Hardware Finish: Polished Stainless Steel",
      "Minimum threshold depth of 2 3/4 in. is required for proper installation; Pictured SlimLine shower base is not included with this product",
      "IMPORTANT! All measurements should be taken only AFTER walls are finished (tile, back walls, etc.); Limited Lifetime Manufacturer Warranty",
      "Installation requirements: Professional installer, drilling into the threshold, and 2 person team for proper installation"
    ],
    "specifications": {
      "Manufacturer": "Dreamline - Dropship",
      "Part Number": "SHDR-61607610-08",
      "Item Weight": "187.4 pounds",
      "Product Dimensions": "0.38 x 60 x 76 inches",
      "Item model number": "SHDR-61607610-08",
      "Is Discontinued By Manufacturer": "No",
      "Size": "56-60 in. W x 1 in. D x 76 in. H",
      "Color": "Polished Stainless Steel",
      "Style": "Enigma-X",
      "Finish": "Polished Stainless Steel",
      "Material": "Tempered Glass,Stainless Steel",
      "Pattern": "Clear Glass",
      "Installation Method": "Alcove",
      "Item Package Quantity": "1",
      "Certification": "ANSI Certified Tempered Glass",
      "Special Features": "ANSI certified tempered glass",
      "Usage": "Indoor use only",
      "Included Components": "Shower door",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Limited lifetime manufacturer warranty",
      "ASIN": "B004WSKGVY",
      "Customer Reviews": "4.2 out of 5 stars163 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#319,468 in Tools & Home Improvement",
      "Date First Available": "April 16, 2011"
    },
    "categories": [
      "Bathroom Fixtures",
      "Kitchen & Bath Fixtures",
      "Tools & Home Improvement",
      "Showers & Shower Parts",
      "Shower Doors"
    ],
    "price": 797.99
  }
}