{
  "website_summaries": [
    {
      "verdict": "The LG Rumor Touch is a touch-screen phone for Virgin Mobile that is geared especially for messaging fans.",
      "pros": [
        "The LG Rumor Touch has a very text-messaging-friendly interface",
        "Its slider QWERTY keyboard is easy to use, and we like that it has a 3.5mm headset jack for music, e-mail, social networking support, and great call quality"
      ],
      "cons": [
        "The LG Rumor Touch's photo quality is average, and the touch screen isn't quite as responsive as we would like"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 8.0
      },
      "publication_date": 20110128,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lg Rumor Touch is a very good phone, I'm using this phone with my Assurance ...",
      "text": "Lg Rumor Touch is a very good phone ,I'm using this phone with my Assurance Wireless.It's not a smartphone,I use it mainly as a calling ,talking ,voicemail,texting ,some games, and some not so great photos.I can't send photo texting ,not working for me on my phone plan. The Rumor touch is not as sensitive as a touch smartphone, it's a little hard to get use to the touch of the Lg Rumor Touch , but all altogether a great regular phone to have.",
      "rating": 5.0,
      "verified": true,
      "author": "MICKEY MAC",
      "helpful_votes": 5,
      "publication_date": 20140728
    },
    {
      "title": "Great option for assurance wirelees owner,",
      "text": "For those of us, that subscribe to Assurance Wireless, this phone is a Godsend! It is a fully digital phone that I found out about by calling Assurance. All but one other model Virgin Mobil style, use old fashioned non-digital technology for Assurance Wireless service. I was so happy to get this phone compared to the \"mickey mouse\" style phones Assurance offers! You save money with their service, but get penelysed with most of the phones assurance offers! I am one happy camper with this phone!",
      "rating": 5.0,
      "verified": true,
      "author": "papashey",
      "helpful_votes": 15,
      "publication_date": 20130325
    },
    {
      "title": "Good phone for what it is..",
      "text": "Overall great working phone for the price. This is NOT a smart phone but I think it would be a great introduction/first phone for a younger person as it does have a limited touchscreen capability to access the menus. Full side slide out QWERTY keyboard, helpful for texting and e-mailing. Limited internet access capability (no wi-fi). Camera is basic 2.0 camera again, good for a first phone. Have had this phone for 3 years now and it is still in great working order, no problems sending/receiving texts. Alarm clock still works great as does the keyboard. Have been a virgin mobile customer for 5 years, I would recommend this phone and virgin mobile service to a friend!",
      "rating": 5.0,
      "verified": true,
      "author": "The Kosers",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Good price for a non-android cell phone",
      "text": "I bought this for my daughter as a replacement for the Optimus phone she had stolen from school. Granted, it's NOT an android phone, she can still get on her Facebook, so she's happy. =) She says she loves the slider keyboard better than the old android keyboard. It's a simple phone to operate, and I am SO happy I found it on Amazon at a decent price!! She's had it for 2 months & has had NO issues whatsoever. All in all, a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "dkaewill",
      "helpful_votes": 12,
      "publication_date": 20120504
    },
    {
      "title": "Loved it. Miss having a sliding keyboard.",
      "text": "Worked great for a long time. Held up to a lot, including a cheap case. Unfortunately, the screen went black while sitting on the counter. Just died for no reason. The upside was that having the slide out keyboard let me make calls despite losing the screen. Miss it. It was a good phone. If you don't need a computer in your hand masquerading as a phone to entertain you with games and videos while you're out and about, this is a good phone.",
      "rating": 4.0,
      "verified": true,
      "author": "A Bias Opinion",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "LG Rumor",
      "text": "I do like this phone, but it is temporary until I buy the Samsung G4. The internet barely comes in though and with my security system, which does not work on this phone, I need the G4. If you have Comcast Advanced Security, do not buy this product. If you just need a phone and you do not care less about the internet, then this little product will be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Solael",
      "helpful_votes": 0,
      "publication_date": 20130910
    },
    {
      "title": "Upgraded from flip phone, nice qwerty.",
      "text": "my first touch screen, better than a flip phone, but you have to have a screen lock. Screen isn't sensitive enough to touch and misspells so qwerty is easier to spell with therefore, touch screen seems useless. A lot of useless apps. Slow internet. You have to have a memory card to save your pics and apps on. I ended up upgrading to a Galaxy S3.",
      "rating": 3.0,
      "verified": true,
      "author": "Charmain",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Nightmare!",
      "text": "We purchased for someone in the hospital and we tried to get it to work, took it to bestbuy, virgin mobile and could not unlock the pass code, so we could activate it. I will need to return it or eat the lost. Was very disappoint, this was not a good buy for me. I sort of urged my friend to buy the phone.....mud on my face.",
      "rating": 1.0,
      "verified": true,
      "author": "bu2fli202",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "great phone, good deal",
      "text": "I purchased the LG Rumor phone through amazon, for my brother who has virgin mobile. He's a very simple guy so this phone is perfect for him. If you are a high-tech kind of person, this probably isn't the phone for you, but if you mainly use your phone for txtn & talking, this phone is great! He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "maria v",
      "helpful_votes": 3,
      "publication_date": 20120521
    },
    {
      "title": "i like it but the signal goes away it cuts u ...",
      "text": "i like it but the signal goes away it cuts u off when u are talking.but i like cause i can send pic and recieve thanks amazon.have a merry xmas.",
      "rating": 4.0,
      "verified": true,
      "author": "vl",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Great phone, great price",
      "text": "Screen large enough to read the news, never drops a call, and you can't beat the price per month$25 for unlimited data. I will use it for a couple of years until the battery conks out, then get whatever Virgin is offering then",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth C. Potter",
      "helpful_votes": 0,
      "publication_date": 20121020
    },
    {
      "title": "Still got it",
      "text": "This is a very good phone. I like the touch screen ability. I was worried that I might \"Fat Finger\" some of the small buttons, but it isn't that hard actually; it's pretty good at not mistouching.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydon",
      "helpful_votes": 0,
      "publication_date": 20121123
    },
    {
      "title": "too much hassle",
      "text": "Thanks for the opportunity to express my thoughts on this product. The product that I purchased was considered in good working order when I bought it. When we got it, it did not function correctly. We are now in the process of sending it back. It should have reached the vendor by now. Hopefully we will have the replacement soon. I buy products frequently on Amazon. Thank you Dennis Powelson",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "didnt work properl",
      "text": "the phone was in perfect condition but the serial number did not exist and i was unable to transfer my number or activate this phone. and took forever to get a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Paola C.",
      "helpful_votes": 0,
      "publication_date": 20130212
    },
    {
      "title": "blah blah",
      "text": "says that this phone is internet enabled, good luck with that, its so slow its laughable by todays standards. keyboard does function well though",
      "rating": 1.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 0,
      "publication_date": 20121215
    },
    {
      "title": "Virgin Mobile CDSVMRUMORTO",
      "text": "This was my son's purchase and not mine. According to him it was a good phone for about a year. Other than that I have no data.",
      "rating": 3.0,
      "verified": true,
      "author": "Chala",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Phone is a pain.",
      "text": "Nothing against the person selling it but the phone was made to look like it was with app buttons but it isn't. You can't do anything if you're listening to the music player, go to the menu to get to anything and you can't put any of the buttons on the actual home screen so it's just a pain.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber Kellogg",
      "helpful_votes": 0,
      "publication_date": 20131027
    },
    {
      "title": "So far I really like this phone...",
      "text": "This phone is great for the simple wanting a touch of high class at a affordable price. Wud most definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Excellent for texting",
      "text": "Battery lasts up to 5-6 days on one charge. Web browsing is close to non functional, I think mostly due to Virgin Mobile cheap plan. But calls work well, camera is good, texting very easy with keyboard. BAttery occasionaly loosens just enough to turn off. overall very good phone for not internet use.",
      "rating": 4.0,
      "verified": true,
      "author": "Don G. Taylor",
      "helpful_votes": 0,
      "publication_date": 20130320
    },
    {
      "title": "great phone",
      "text": "This is a great phone all in all..the only problem is that you have to buy a smart card in order to down load music with the mp3 player. Other than that i would highly reccommend this phone. The service is great and the internet is fast. I love the way it vibrates everytime you touch a button on the touch screen to mke sure you dont make any mistakes.",
      "rating": 5.0,
      "verified": true,
      "author": "kristol zimmerman-gutierrez",
      "helpful_votes": 0,
      "publication_date": 20110923
    },
    {
      "title": "Good Improvement",
      "text": "Upgraded from the LG Rumor 2, much better. Only negative I have found is that it cancels messages accidentally when in your pocket.",
      "rating": 4.0,
      "verified": true,
      "author": "Fiorica310",
      "helpful_votes": 0,
      "publication_date": 20120107
    },
    {
      "title": "Virgin Mobile Rumor Touch",
      "text": "Lee's Electronics is a GREAT buyer. I would recommend him to anyone. I had some trouble ON MY PART by submitting a duplicate order. I got in contact with the buyer and the problem was fixed IMMEDIATELY. I appreciated the good business. The phone came early and is working GREAT. If the buyer is reading this..THANK-YOU:)",
      "rating": 5.0,
      "verified": true,
      "author": "Vonara",
      "helpful_votes": 0,
      "publication_date": 20110709
    },
    {
      "title": "Disappointed",
      "text": "There were a lot of defects that went unmentioned, like permanent damage to the picture on the screen and the fact that every time you close the slider keyboard the phone powers down and back on again. People listing an item should state its defects",
      "rating": 1.0,
      "verified": true,
      "author": "bhall30",
      "helpful_votes": 0,
      "publication_date": 20130112
    },
    {
      "title": "love this phone,...",
      "text": "I love this phone received very fast and am very happy with the phone.. The only downfall I have is the charger I think its pretty cheapie and broke the first week.",
      "rating": 5.0,
      "verified": true,
      "author": "edward hounsom",
      "helpful_votes": 0,
      "publication_date": 20130905
    },
    {
      "title": "my phone",
      "text": "I like having my phone back. i can text and get on facebook. my phone is my life line to the world. with out i would be so lost.i like looking on amazon to see what all i can get for alot cheaper than going to the store to buy it.",
      "rating": 4.0,
      "verified": true,
      "author": "sweetsum3000",
      "helpful_votes": 0,
      "publication_date": 20120823
    },
    {
      "title": "Gack!",
      "text": "It didn't download apps and the touch screen didn't really allow touch. I am very disappointed. I love LG products and I was let down with this phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "ok",
      "text": "It was ok.wasn't exactly what I expected.screens hard to work with. Makes calls on its own. It work as a pre paid phone",
      "rating": 1.0,
      "verified": true,
      "author": "hail",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Very nice and fast shipping",
      "text": "Item as described. Very nice and fast shipping. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "phil b",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Try it",
      "text": "I really really like this phone. I bought it for my daughter. It has a fair price and is a good product",
      "rating": 5.0,
      "verified": true,
      "author": "T. J.",
      "helpful_votes": 0,
      "publication_date": 20131030
    },
    {
      "title": "lg rumor touch used good condition",
      "text": "I bought a lg rumor touch used and in good condition over all its great but had more scratches then i exspected. the screen was really scratched up looked like someone had owned the phone for a couple yrs before i got it.",
      "rating": 4.0,
      "verified": true,
      "author": "kittyf",
      "helpful_votes": 0,
      "publication_date": 20121007
    },
    {
      "title": "get what you pay for",
      "text": "This is a very excellent phone for its price, I was actually surprise at the features that it came with. with this phone you get exactly what you pay for and I recommend it to anybody.",
      "rating": 5.0,
      "verified": true,
      "author": "Jhordan",
      "helpful_votes": 2,
      "publication_date": 20110401
    },
    {
      "title": "not right phone",
      "text": "just wasnt the right phone i wanted it worked great and everything but i wanted something a little different.. thanks",
      "rating": 3.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Seems fine!",
      "text": "I replaced an old touch that had gone through the laundry. Works fine. Don't wash your phone in the laundry.",
      "rating": 5.0,
      "verified": true,
      "author": "David Brown",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "Virgin Mobile Phone",
      "text": "This phone is so nice,it has an easy touch screen, its a nice color and im sure anyone who buys one will love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Hundley",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "LG Rumor Touch Prepaid Phone",
      "text": "Product looks like it is in a good condition, except you can not hear the person you are calling, but they can hear you.",
      "rating": 2.0,
      "verified": true,
      "author": "Toy",
      "helpful_votes": 0,
      "publication_date": 20120723
    },
    {
      "title": "The Rumor is....",
      "text": "This is my first smart phone and I am loving it. I am very happy with my purchase. It has all the features one could ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Big M",
      "helpful_votes": 0,
      "publication_date": 20121012
    },
    {
      "title": "DO NOT BUY",
      "text": "Do not buy this phone. in the 90s this would have been a great phone but now its like using a rock of the ground to do stuff with. I down graded because my motorola triumph got smashed so i wanted something cheap so i got this. yea that was a bad idea. just spend the extra 3o bucks and buy a good touch screen or something.",
      "rating": 1.0,
      "verified": true,
      "author": "me",
      "helpful_votes": 2,
      "publication_date": 20120805
    },
    {
      "title": "Just as described!",
      "text": "I ordered this for my son's birthday. It was the best price around including shipping. The phone arrived in time for his birthday and he loves the functionality.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Horan",
      "helpful_votes": 11,
      "publication_date": 20110501
    },
    {
      "title": "phone",
      "text": "The phone was and is excellent. Now, I have to learn how to use it to it's fullest capabilities! All in good time.",
      "rating": 5.0,
      "verified": true,
      "author": "mom",
      "helpful_votes": 0,
      "publication_date": 20101225
    },
    {
      "title": "what is every one talkin about???",
      "text": "look i got mine two days after i paid for it and. it works great looks great i am glad i got it!",
      "rating": 4.0,
      "verified": true,
      "author": "Cody McNeish",
      "helpful_votes": 3,
      "publication_date": 20120305
    },
    {
      "title": "I just love the phone",
      "text": "i want to thank you the computer said its not shipped but i got the phone today i have been in heaven thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "cdubmama",
      "helpful_votes": 0,
      "publication_date": 20111205
    },
    {
      "title": "Like but not in love there are many things that ...",
      "text": "Like but not in love there are many things that could be improve it serve the purpose most of the previous problem mention all in all serve the purpose",
      "rating": 2.0,
      "verified": true,
      "author": "Joyce K.",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "Nice solid phone",
      "text": "This phone is great to use with the assurance wireless plan, its solid, big enough screen to see everything, great volume, and I'm on the 30$ monthly unlimited plan and the web is pretty good! Grandson and I watch youtube pretty well. The only thing I don't like is I can't seem to figure out how to get apps, but don't let it stop you, its really a pretty good phone for the program compared to some of the others they offer, the price from Amazon was great too, free shipping!",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea K.",
      "helpful_votes": 10,
      "publication_date": 20120818
    },
    {
      "title": "Snowstorm delay but phone was great!",
      "text": "I had to wait a few extra days to receive the phone due to an April snowstorm. After opening the mailing package I noticed the phone package had been opened which made me nervous since it was advertised as a sealed package. I went on the Virgin Mobile website and changed my old phone info on my account to the new phone info and the phone was up and working in 20 minutes. My autistic son is using it everyday for the past 45 days and no problems with the phone so far, it's working perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "katt",
      "helpful_votes": 2,
      "publication_date": 20130530
    },
    {
      "title": "Great phone!",
      "text": "The phone is an awesome phone with tons of options and services available. It is easy to use, fun to use (my husband is having a blast with it) and is inexpensive when paired with some of the plans available. We use it with a month-to-month plan. The phone has everything on it that we need but came at half the price of other brands. We have used Virgin Mobile phones for more than 8 years and have always been happy. Looks like the Rumor Touch is another winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa M. Moisan",
      "helpful_votes": 2,
      "publication_date": 20110503
    },
    {
      "title": "Good Phone...Awful Service",
      "text": "The phone is durable: Keypad is good and the features are nice, but the touch screen is not accurate. It's too sensitive which makes it hard navigating when I don't feel like using the buttons on the keypad. Sprints service sucks, not good nationwide coverage. The touch screen technology could use some pointers from Apple (iPod Touch, mine is great).",
      "rating": 4.0,
      "verified": true,
      "author": "J. E. Hill",
      "helpful_votes": 2,
      "publication_date": 20110704
    },
    {
      "title": "new nokia",
      "text": "this phone is indestructable. i love it! it's been dropped several times, from a variety of heights. it's even been thrown from the roof of my car TWICE going 40mph. and NOTHING. it still works perfectly fine. internet can run a little slow and i had to download the opera mini app to get good internet service... but it's worth it not to worry about it going out all the time like i do with the other phones.",
      "rating": 4.0,
      "verified": true,
      "author": "caitlin",
      "helpful_votes": 2,
      "publication_date": 20130409
    },
    {
      "title": "LG rumor touch",
      "text": "It's better than the ol phone I had...somewhat concerned about quality due to the H button not working properly and the difficulty of sending pics via text, and not to many options with regards to ringtones, display nor ease of access to check email or fb etc. this is Not the Sellers Responsiblitie but rather the manufacturers. .",
      "rating": 5.0,
      "verified": true,
      "author": "susan stettmeier",
      "helpful_votes": 0,
      "publication_date": 20131005
    },
    {
      "title": "Dont get this type of phone",
      "text": "These phones are not so great they break very easily...when i got the first one it last a few months and it was decent...then dropped it and it broke...i bought another one and when i got it the audio didnt work...i sent it back and order another one because i thought it was just a bad one but the third one also came to me broken. even though they r cheap i would just recommend investing in a more expensive/reliable phone",
      "rating": 2.0,
      "verified": true,
      "author": "brock",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "I love the phone but for some reason cant get on ...",
      "text": "I love the phone but for some reason cant get on facebook or any social media..other than that im very pleased and had my assurance free minutes and number switched over to my LG Rumor..no problem!!!",
      "rating": 3.0,
      "verified": true,
      "author": "sandra c.",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "great phone for the price !",
      "text": "One of the things I love about this phone is that your messages come up on the screen as clouds and the little blinking light goes from green to red if you have messages !!!",
      "rating": 3.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20140205
    },
    {
      "title": "Great phone!",
      "text": "I've had this phone for going on a year now and love it. Even though it's not a smart phone it gets the job done and does it well. The battery lasts all day but I still suggest charging it up every night. Overall good phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruiser1",
      "helpful_votes": 0,
      "publication_date": 20130331
    },
    {
      "title": "great",
      "text": "is exactly what i ordered. worked perfectly as i hoped and was cheaper that chain or department stores here in town. thank you",
      "rating": 3.0,
      "verified": true,
      "author": "jmford",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "great",
      "text": "is exactly what i ordered. worked perfectly as i hoped and was cheaper that chain or department stores here in town. thank you",
      "rating": 3.0,
      "verified": true,
      "author": "jmford",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Rumor Touch",
      "text": "Great phone. Its size it ok and the web browsing is'nt bad either. Good all around phone but the only thing that I seem not to like is the sensitivity of the screen. You have to press it a little harder than most conventional touch screen phone, especially on the web. Besides that everything is great especially the headphone jack which works for any conventional headphone so you don't need to buy a certain type or model to fit specifically to that type of phone/brand.",
      "rating": 4.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20110715
    },
    {
      "title": "Ok",
      "text": "This phone is a little heavy and bulky, need a new version that still works with plan!! I will look forward to it!",
      "rating": 5.0,
      "verified": true,
      "author": "lisa hoefener",
      "helpful_votes": 0,
      "publication_date": 20140510
    },
    {
      "title": "It's okay.",
      "text": "It's an okay phone, nice and sturdy and not heavy at all. I don't like that there is not a way to disable the unlock feature. The resistive touchscreen is a bit of a challenge. The sounds for notifications are very low. The case I bought for the LG Rumor fits very well. There is no way to disable the flashing green that is always displaying. Overall it's an okay basic phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Brightstar05",
      "helpful_votes": 0,
      "publication_date": 20130701
    },
    {
      "title": "this clearly says virgin mobile. i get the phone ...",
      "text": "this clearly says virgin mobile. i get the phone and it is sprint and numbers and texts are still in phone. wth?",
      "rating": 1.0,
      "verified": true,
      "author": "starshine",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "Disappointed",
      "text": "I ordered this phone for my grandson. The phrase you get what you pay for rings true here! The phone arrived with a big crack across the face. It was basically unusable (my grandson was totally crushed over this). I've decided to keep it because it would cost more to ship it back. I Will be purchasing one from a local cell phone store near me soon.",
      "rating": 1.0,
      "verified": true,
      "author": "Edith T.",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "virgin mobile rumor touch phones",
      "text": "so far these phones are performing very well seems as tho the girls had no problems with learning the different programs and settings. i was pleased with how quick they arrived.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy E. Johnson",
      "helpful_votes": 0,
      "publication_date": 20110820
    },
    {
      "title": "lg rumor touch",
      "text": "No phone is perfect, but these guys had my phone to me 2 days after i ordered it. Not sure how it works yet I know I have never had problems with virgin mobile before and i am not expecting it to start now either",
      "rating": 4.0,
      "verified": true,
      "author": "Berri peterson",
      "helpful_votes": 2,
      "publication_date": 20111227
    },
    {
      "title": "Screen went black on me",
      "text": "The screen went black and died on me, had to buy a different phone. dont recommend this one at all. dont do it.",
      "rating": 1.0,
      "verified": true,
      "author": "Thebeffers",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "this clearly says virgin mobile. i get the phone ...",
      "text": "this clearly says virgin mobile. i get the phone and it is sprint and numbers and texts are still in phone. wth?",
      "rating": 1.0,
      "verified": true,
      "author": "starshine",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "Great gift",
      "text": "Got this as a gift for a friend. She loved it. Quick to ship and arrived on time. It was a great surprise. Brand new.",
      "rating": 5.0,
      "verified": true,
      "author": "watcher19",
      "helpful_votes": 0,
      "publication_date": 20120826
    },
    {
      "title": "AAAA",
      "text": "Shipped very well the unit works very good Unit as described on the money works very good thank you rfriedman",
      "rating": 5.0,
      "verified": true,
      "author": "Russell Friedman",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Won't activate",
      "text": "Couldn't get the phone activated. They couldn't connect to the phone. They don't know what the problem is.",
      "rating": 1.0,
      "verified": true,
      "author": "Paulk63",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Wonderful service, product, and rapid shipment!",
      "text": "I am extremely impressed with the LG Rumor Touch Cell Phone! Not only do I have a wonderful phone now, but the shipment was rapid! Thank You very much!! Sincerely Yours",
      "rating": 5.0,
      "verified": true,
      "author": "ladiana1950",
      "helpful_votes": 0,
      "publication_date": 20120626
    },
    {
      "title": "So far, so good!",
      "text": "I was skeptical to buy another phone made by LG because the last one I had didn't last me a year. But given some circumstances, I risked it and bought this one. I love it! Much better than a basic cell phone. If you want a smartphone with a touchscreen and/or keyboard, this phone has it! The only thing I do notice is I almost have to charge the battery every night, but other than that it works good!",
      "rating": 5.0,
      "verified": true,
      "author": "malwarehunter",
      "helpful_votes": 16,
      "publication_date": 20111029
    },
    {
      "title": "The phone is great",
      "text": "The phone is good I just wish the company would have gave me the correct info to have good service on it with what I wanted on it an not what the limits that I found when I bought the phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Janice M. Keen",
      "helpful_votes": 0,
      "publication_date": 20130306
    },
    {
      "title": "good product",
      "text": "Bought it about a month ago for my son. He loves it, the best phone he has ever had, and this is his third one.",
      "rating": 5.0,
      "verified": true,
      "author": "net10 customer",
      "helpful_votes": 0,
      "publication_date": 20110915
    },
    {
      "title": "Disappointed&Disgusted",
      "text": "Received phone& it wouldn't even charge...defeats purpose of purchase, didn't see any sort of notice of defect on sale post",
      "rating": 1.0,
      "verified": true,
      "author": "Takiyah",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "two stars",
      "text": "not as I thought not much signal nor can you download like you want everything loads pretty slow. plans are not worth the price",
      "rating": 2.0,
      "verified": true,
      "author": "Teresa bartig",
      "helpful_votes": 0,
      "publication_date": 20120506
    },
    {
      "title": "loved it!!!!!!!!",
      "text": "the phone arrived on time and it was in perfect condition my son absolutely loves his phone the Lg rumor phone is great for any teenager. especially for busy parents on the go who always need to remain in contact with their children",
      "rating": 4.0,
      "verified": true,
      "author": "zaenae anderson",
      "helpful_votes": 0,
      "publication_date": 20121024
    },
    {
      "title": "Gratitude 4 ALL",
      "text": "I needed more internet capability but I am happy with my first cell phone purchase! Thanx be to God in all cases.",
      "rating": 3.0,
      "verified": true,
      "author": "Dat Jonk",
      "helpful_votes": 0,
      "publication_date": 20121113
    },
    {
      "title": "Works GREAT!",
      "text": "We bought this phone for our daughter. It arrived quickly and works GREAT! It has parental controls for several features ~ accessing the internet was our main concern. It didn't come with an instruction manual so we had to download it (which was no problem); it is not as thorough as I'd like, but my daughter has figured out all she wants to know. :)",
      "rating": 5.0,
      "verified": true,
      "author": "sandydeck",
      "helpful_votes": 0,
      "publication_date": 20110307
    },
    {
      "title": "Good but laggy",
      "text": "This phone is amazing as a first phone for me. But, I've played around with sibling phones like Iphone4 and Droid phones and this is nothing compared to those. I LOVE the layout of the phone. It is very simple and easy to go around. It is laggy though. Sometimes it takes a a few second to open stuff. But, it is nothing that will get me irritated.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20101222
    },
    {
      "title": "This is as far from a smart phone as it gets! Avoid this phon!",
      "text": "This phone should not be in the android category. This phone is no more capable than my basic phone. Very difficult to download anything. No application center. If you are truly looking for an android phone.. SKIP THIS!",
      "rating": 1.0,
      "verified": true,
      "author": "Kathie o",
      "helpful_votes": 0,
      "publication_date": 20130904
    }
  ],
  "product_meta": {
    "title": "LG Rumor Touch Prepaid Phone (Virgin Mobile)",
    "description": "3\" Touch Screen, Full QWERTY Keyboard, 2 Megapixel Camera & Camcorder\nThe brand new LG Rumor Touch is the latest evolution of the hand held QWERTY device. Its Stylish QWERTY Keyboard with Dedicated Emoticon Key comes in three awesome colors that match any fashion sense. Pick up the new LG Rumor Touch and experience the vibrant 3\" inch touchscreen and record up to 2 hrs. of video that you can share with your friends.\n\n2.0 Megapixel Camera and Camcorder\nCapture high-quality, crisp images and videos with the push of a button Bluetooth Connectivity\nTalk hands-free with a wireless Bluetooth headset. You can hook up to a PC desktop or laptop to access music and games, print pictures, transfer contacts, and more Full QWERTY Keyboard with Dedicated Emoticon Key\nThe stylish slide out QWERTY keyboard lets you write emails, chat, and send text messages with the quickness and ease of a full keyboard. Plus with the dedicated Emoticon Key, you can add that per\n\nAMAZON.COM\n\n\nFeaturing a large, 3-inch touch screen and an easy-to-use QWERTY keypad, the stylish 3G-enabled LG Rumor Touch for the prepaid Virgin Mobile network puts your entire social network at your fingertips. Enjoy quick access to threaded texting, instant messaging, and e-mail and with none of the contract obligations. With Virgin Mobile, you can choose a monthly plan with unlimited data, text and voice or just purchase the minutes and text you need (learn more below).\n\nEnjoy affordable unlimited data, text and voice with Virgin Mobile. KEY FEATURES\nLarge, 3-Inch Touch Screen and QWERTY Keypad\nWith the LG Rumor Touch you can enjoy the convenience and style of a touch-screen phone along with a five-line QWERTY keypad. Quickly scroll through your selections on the big, 3-inch screen, where you can update appointments, search the web, make a call, or access your favorite music. With its familiar QWERTY layout, the slide-out keypad makes it easy to text, e-mail, or enter data.\n\n3-inch touchscreen complemented by slide-out full QWERTY keyboard (see larger image). Social Networking and e-mail at Your Fingertips\nWhether you use AOL/AIM, Yahoo, Hotmail, or Gmail, e-mail access is always at your fingertips with the Rumor Touch. Handy text messaging and picture sharing keeps you instantly in touch with family and friends.\n\nCamera, GPS, Memory Card Slot, and More\nThe Rumor Touch is loaded with tools including a 2.0-megapixel camera and camcorder, a microSD memory card slot for storing and transferring music and pictures, and a built-in GPS navigation system for getting directions.\n\nBluetooth Connection for Hands-Free Talk\n\n\nThe Rumor Touch is compatible with Bluetooth wireless devices, so you'll have the option to put down your phone and enjoy a hands-free conversation.\n\nVITAL STATISTICS\nThe LG Rumor Touch weighs 4.59 ounces and measures 4.24 x 2.16 x 0.63 inches. Its lithium-ion battery is rated at up to 7 hours of talk time, and up to 170 hours (6.7 days) of standby time. It runs on the 800/1900 CDMA/EV-DO Rev. A frequencies.\n\nWhat's in the Box\n\n\nLG Rumor Touch handset, rechargeable battery, charger, quick start guide\n\n\n\n\n\n\nVIRGIN MOBILE PREPAID PRICING\nWith Virgin Mobile, you can pay only for the calling time you use. You can choose a monthly Beyond Talk plan with unlimited data and messaging and just the right amount of talk minutes for your needs.\n\nBeyond Talk Unlimited Plans Virgin Mobile customers have access to the Sprint Nationwide Network, reaching more than 278 million people across the United States (see a map of Virgin Mobile's coverage area).\n\n\n\n\n\n\nSPECIFICATIONS\n * 3G data speeds (EVDO Rev A.) (peak download speeds of up to 3.1 Mbps; peak upload speeds of 1.8 Mbps; average download speeds of 600 kbps-1.4 Mbps) \n * 3-inch touch-enabled display (240 x 400 pixels; resistive display) \n * Side-sliding full QWERTY keyboard \n * Onboard GPS for navigation and location services \n * 2-megapixel camera with video capture (2x digital zoom) \n * 47 MB user-accessible internal memory \n * Memory expansion via microSD card slot with support for optional cards up to 16 GB. \n * Bluetooth connectivity (version 2.1) includes communication headset, hands-free car kits, and the A2DP audio streaming Bluetooth profiles. \n * Web browser with built-in online services including Facebook, Twitter, MySpace, Google Maps, and YouTube. \n * Full messaging capabilities including SMS text, MMS picture/video and IM instant messaging \n * Personal e-mail access \n * 3.5mm headphone jack",
    "rating": 3.4,
    "feature_bullets": [
      "3G-enabled messaging phone with 3-inch touchscreen display and side-sliding full QWERTY keyboard",
      "No monthly contracts with Virgin Mobile's Beyond Talk unlimited data, text and voice plan",
      "2-MP camera/camcorder; Bluetooth stereo music; access to personal e-mail; GPS navigation and services",
      "Up to 7 hours of talk time, up to 170 hours (6.7 days) of standby time",
      "What's in the Box: handset, rechargeable battery, charger, quick start guide"
    ],
    "specifications": {
      "Product Dimensions": "4.24 x 2.16 x 0.63 inches",
      "Item Weight": "4.6 ounces",
      "ASIN": "B0046CL0VQ",
      "Item model number": "Rumor Touch",
      "Customer Reviews": "3.4 out of 5 stars175 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "#334,161 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Android",
      "Wireless communication technologies": "Bluetooth",
      "Connectivity technologies": "Bluetooth",
      "Additional Features": "Touchscreen, Camera",
      "Other display features": "Wireless",
      "Device interface - primary": "Touchscreen, Keyboard, Buttons",
      "Other camera features": "2.0 Megapixel Camera and Camcorder",
      "Form Factor": "Smartphone",
      "Colour": "Black",
      "Manufacturer": "LGIC",
      "Date First Available": "June 1, 2010"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Carrier Cell Phones",
      "Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}