{
  "website_summaries": [
    {
      "verdict": "Your slinky carnivore wasn’t meant to consume grains, so this scientifically devised ferret food featuring a grain-free kibble made with quality meats and fruits is one of the healthiest options available.",
      "pros": [
        "Chicken meal and sweet potatoes are the first 2 ingredients",
        "Grain-free diet",
        "Easy to digest",
        "Ferret-formulated ratio of 40% protein and 20% fat",
        "Includes chicken, potato, and fish proteins",
        "Vitamin fortified"
      ],
      "cons": [
        "ZuPreem is a premium ferret food, so it isn’t surprising to note its fairly expensive price"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Causes bladder stones in ferrets (deadly)",
      "text": "Would give zero stars if I could. Started buying this food for my ferrets a year ago with the intentions of improving their diet from dry cat kibble. Come to find out, this causes bladder stones (which I've only now realized after losing two of our ferrets to bladder stones in the last year). DO YOUR RESEARCH - there are better foods out there that do not cause these issues, and they can be found on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Frederick",
      "helpful_votes": 6,
      "publication_date": 20180513
    },
    {
      "title": "Did not agree with my ferrets",
      "text": "Unfortunately this food did not agree with my ferrets. It turned their fecies dark brown and extremely thick,almost to the point of dehydration. We stopped giving it to them immediately and went back to the food we usually buy,we saw a change with a couple of days and they were back to normal.",
      "rating": 1.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 3,
      "publication_date": 20181208
    },
    {
      "title": "They love it",
      "text": "Per vet recommendation at Avian in Raleigh, I switched to this food for both of my ferrets (almost 2 years old) about a year ago. I eased them into this one from the food they were on and I have had no problems at all. They love it. Normal stools and they're both healthy. I have seen a lot of people say to mix it with Wysong and give them a variety but I haven't done that yet. Mine both drink plenty of water as well. If anything negative comes of this product, I will update it immediately. So far, so good. Update: they still love it and are healthy 3 year olds!",
      "rating": 5.0,
      "verified": true,
      "author": "karaheise",
      "helpful_votes": 5,
      "publication_date": 20150907
    },
    {
      "title": "Approved by my ferret",
      "text": "My ferret love's this food. It's crunchy and the perfect size. She loves the taste. To this day she won't eat anything else. I know. I tried. If I put any other food in her dish with the Zupreem No Grain, she will search out the Zupreem No Grain and ignore the rest. To her, this is the perfect food.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Good as part of a ferret diet, just not by itself",
      "text": "This is one of three foods I blend for my furries. Using this food exclusively can lead to bladder stones due to the peas used to make it grain free. It seems each food has its draw backs. I feed this, Wynsong Epigen-90 and Evo ferret combined. That way they don't get too much of a bad thing, get a variety of healthy foods, and if they discontinue one there are still two others my guys are accustomed to. (Ferret foods seemed to get discontinue all the time, it has already happened to us more than once). Overall I recommend this food as part of a ferret's diet, but not the only part.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy O'Brien",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Great for Rogue",
      "text": "My little Rogue lost almost all of her fur on her back and tail. After a great deal of research and advice from a vet, it was determined that her protein source was insufficient (not anything else more serious, as I feared, and can be the case.) Zupreem did the trick. All of her fur is back, and her coat looks fabulous. She is even more spunky than before (if that is possible !!!) She loves this food and doesn't waste any of it. Apparently my kitties love it, too....they are always sliding their paws into her house and stealing little bits for themselves !!!",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 2,
      "publication_date": 20160526
    },
    {
      "title": "Don’t buy",
      "text": "Don’t buy this, this is known to cause bladder stones. I bought this thinking it was a good quality food for my ferrets but I was very wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "Katie Rogers",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "My ferret likes it",
      "text": "I’ve had my babies for over six years and transitioned them off the Marshall food once I got them to this. This is all they’ve eaten and we’ve never had any issues",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Needs better packaging.",
      "text": "My daughter's ferrets like this food and it appears to be one of the healthier marketed ferret food. My only issue is how brittle the plastic bag is. It arrived with a tear in the bag and with loose kibble in the cardboard box it arrived in. Also my cats easily tore into it several times and I ended up covering almost the entire bag in clear mailing tape to keep it together.",
      "rating": 3.0,
      "verified": true,
      "author": "Mainer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Loved it",
      "text": "My daughter's ferrets love this food and it is a much better nutritional fit than most ferret food out today. I recommend this highly!",
      "rating": 5.0,
      "verified": true,
      "author": "jo collier",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Product not as listed",
      "text": "Did not receive correct product. Received “corn free” not “grain free”. These are not equivalent.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Wolff",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "... grain free diet Zupreem Ferret grain free is a great choice! I have been feeding this food to ...",
      "text": "For others concerned about feeding a grain free diet Zupreem Ferret grain free is a great choice! I have been feeding this food to mine for 3 years. For those who complain of the peas in the ingredients if you take a look at a new bag they no longer have that in them and have not for quite a while. Thank you for selling this product on Amazon :) Start them on this diet from the beginning and keep them on it and they are healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20150612
    },
    {
      "title": "I have a happy ferret.",
      "text": "My ferret is a finicky eater. He will eat this though. So its a win, win.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "I never leave feedback on Amazon but had to take ...",
      "text": "I never leave feedback on Amazon but had to take the time to do it this time. My ferrets have eaten Zupreem grain free for the past 3 yrs. One of my females turned up with a bladder stone taking up 1/3 of her bladder.. Never again will they eat this. We are switching to the new Wysong Digestive Support formula and I will be checking my other ferrets for bladder stones.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 5,
      "publication_date": 20150109
    },
    {
      "title": "Healthier for your Ferrets",
      "text": "My ferrets were on the original ZuPreem Ferret diet at first, but I noticed my boy Bellamy was gaining a lot of weight. I switched to this (adding a little in their regular food day by day at first to introduce it), and he immediately started losing weight. Now both my ferrets look healthy and enjoy their food. Sometimes I sprinkle a bit of \"Duk soup\" on top for flavor too.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "ZuPreem",
      "text": "I've been feeding my ferrets ZuPreem since 2007. I had a vet recommend it. My furbabes love it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Jeep Diva",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Good stuff",
      "text": "I really love this food for my ferret. When we bought him my husband (not knowing any better) bought a bag of kaytee ferret food which is basically all fillers, and the ferret had diarrhea for a week before this came in the mail. Finally he's eating the good stuff and poos arent so liquid. He should start feeling better soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Five Stars",
      "text": "My guys love this food. Consistent stools and happy ferrets ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Kajone",
      "helpful_votes": 2,
      "publication_date": 20170907
    },
    {
      "title": "Highly recommend for serious pet owners",
      "text": "I won't feed my ferret any other dry food other than this. I don't trust anything that's food from Marshall's, and this is a high quality diet. A little more on money goes a long way on their health with this food. Highly recommend for serious pet owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Lohr",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "My ferret is happy",
      "text": "My ferret love .and cut see the result in hair and they love Zu Preem",
      "rating": 5.0,
      "verified": true,
      "author": "carlos zetino",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Ferrets will eat it but that doesn’t mean it’s good for them",
      "text": "Ferrets will eat it but that doesn’t mean it’s good for them. Also makes their poop smell MUCH worse.",
      "rating": 1.0,
      "verified": true,
      "author": "amanda",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Seems to cover all the basic guidelines for ferret kibble type food",
      "text": "The fur snakes seem to like this food and are doing well eating it!",
      "rating": 5.0,
      "verified": true,
      "author": "Scritter",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Holes",
      "text": "Love this brand and will still order it on Amazon, but it came with a hole in the bag and food spilled in the box.",
      "rating": 3.0,
      "verified": true,
      "author": "Allysa Cottingham",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "This is my ferrets favorite food. I love that it has even less ...",
      "text": "This is my ferrets favorite food. I love that it has even less filler ingredients that the regular version with grain.",
      "rating": 5.0,
      "verified": true,
      "author": "ASideris11",
      "helpful_votes": 0,
      "publication_date": 20170720
    },
    {
      "title": "My little guys love this!",
      "text": "My ferrets love this.. and now that I found it grain free I feel my little guys get a healthy meal that easy for them to digest..",
      "rating": 4.0,
      "verified": true,
      "author": "M. L. Walker",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Good mix for ferret food",
      "text": "Not bad, not high on the ferret food chart but it's one of the few foods my ferrets will eat. Best used as a mix with another ferret food (or grain free cat food).",
      "rating": 4.0,
      "verified": true,
      "author": "Maureen K.",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "My ferrets love this food!",
      "text": "My vet made me switch them to this food and they gained weight, their hair grew, plus my ferrets seem to love it! I have the best vet he is awesome and zupreem is awesome too!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Ferrets should be grain free (per vet) and I'm glad this one delivers",
      "text": "Ferrets should be grain free (per vet) and I'm glad this one delivers. Mine also likes this one over any other grain free option.",
      "rating": 5.0,
      "verified": true,
      "author": "NerdyDragon",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "My vet advises against Grain free",
      "text": "I switched my ferret to this food some time ago, thinking it was healthier, and when he had finished one bag, he began to act lethargic and stumble when he walked. He was also losing his eyesight, The vet said the grain free food is not a good idea, and advised switching to Marshalls. After a shot (I think she gave him a vitamin, not sure) and switching to Marshall's for older ferrets, he's back to his usual jaunty self. I can't recommend this for ferrets, although he had eaten the Zupreem with grain for all of his six years.",
      "rating": 1.0,
      "verified": true,
      "author": "Juan Barbosa",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "Thank you",
      "text": "Love that this food is grain free and lower price in Amazon compared to my local pet store.",
      "rating": 5.0,
      "verified": true,
      "author": "JCHC",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Good.",
      "text": "Not the best quality out there but my ferrets like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Deb C",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Great food!",
      "text": "My ferrets love this! Been feeding them this food for a few months now and it's keeping them at a good weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Keri D.",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Five Stars",
      "text": "Perfect, my ferret has been on this diet since we got her 3 years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "vjkimmel",
      "helpful_votes": 0,
      "publication_date": 20150130
    },
    {
      "title": "Five Stars",
      "text": "My ferrets love it, however, it's only 4 pounds so they go through it very quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey Talbot",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Five Stars",
      "text": "Great ferret food, and much cheaper here than in most pet stores",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Four Stars",
      "text": "took them a little to get used to it but they're eating it now",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Harvey",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Zupreem has removed the pea protein that was the most ...",
      "text": "Zupreem has removed the pea protein that was the most likely cause of so many kidney stones, but the research isn't back yet on whether or not the problem is solved. Do your research and purchase with care. For myself, I'll be buying the original variety until the papers come in.",
      "rating": 3.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Great food.",
      "text": "I have not used it as yet, but my ferret loves Zupreem food.",
      "rating": 4.0,
      "verified": true,
      "author": "Jojo Trox",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "ferret",
      "text": "Very quick shipment This is good food for my ferrets. They really seem to like it over the food I have gotten at the big box store in my town and The price isn't much more then what I have paid either. I will continue to purchase from this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Tis I",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "my fuzzy buddies love this stuff",
      "text": "well my two ferrest seem to love this stuff been feeding it to them for over a year and they seem pretty healthy",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Wisnoski",
      "helpful_votes": 0,
      "publication_date": 20130726
    },
    {
      "title": "love it",
      "text": "all the ferrets talk about is how great they love the new food. The three of them fight over the feeding dish to get the first taste during feeding time.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelo",
      "helpful_votes": 0,
      "publication_date": 20130614
    },
    {
      "title": "Ferret food",
      "text": "I've been getting this food for my ferrets for about a year and a half now, and they still love it. I will continue feeding them this.",
      "rating": 5.0,
      "verified": true,
      "author": "Tatiana Kostereva",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "my ferret, Casey, didn't like it.",
      "text": "I'm pleased with the nutrition, but my ferret's a picky eater and didn't like it. Back to the drawing board.",
      "rating": 3.0,
      "verified": true,
      "author": "brigid macelis",
      "helpful_votes": 2,
      "publication_date": 20140204
    },
    {
      "title": "Five Stars",
      "text": "ferrets love it as a treat or as regular feeding",
      "rating": 5.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20140815
    }
  ],
  "product_meta": {
    "title": "ZuPreem Premium Daily Grain Free Ferret Diet Food | Nutrient Dense, Highly Digestible, High Protein Levels",
    "description": "Size:4 lb bagPromotes healthy digestion by providing 40% protein and beneficial natural probiotics to give your ferret what he needs for a lively, healthy and playful life.",
    "rating": 4.4,
    "feature_bullets": [
      "UNIQUE DIGESTIVE SYSTEM - Ferrets have a unique digestive system that requires the right amount of protein and animal fat to keep up with their active lifestyles.",
      "GRAIN-FREE. MADE WITH REAL CHICKEN AND EGG PROTEIN. Formulated to be your ferret’s primary food.",
      "EVERYDAY NUTRIENTS - Filled with the important nutrients your ferret needs every day for good health.",
      "MADE IN THE USA. Great-Tasting, Balanced Nutrition and Highly Digestible.",
      "Ensure your ferret gets the quality nutrition he/she needs for a long and healthy life."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.94 x 7.28 x 13.78 inches; 3.97 Pounds",
      "Item model number": "230012",
      "Department": "Food",
      "Date First Available": "June 7, 2010",
      "Manufacturer": "Premium Nutritional Products, Inc.",
      "ASIN": "B004UMKIEC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food",
      "Pet Supplies",
      "Small Animals"
    ],
    "price": ""
  }
}