{
  "website_summaries": [
    {
      "verdict": "This is a top pick for nano aquariums featuring tiny tropical fish with tinier mouths, because it is nutrient-packed, a fine balance of meat and plant material, and is a great value for the price.",
      "pros": [
        "Fish meal and krill meal are the first 2 ingredients",
        "Pellet softens quickly in water for superior digestion",
        "Perfect size for small tropical fish like tetras and tiger barbs",
        "Colored for maximum visibility to ensure food is eaten",
        "High calorie and protein food"
      ],
      "cons": [
        "Hikari’s line of scientifically formulated tropical fish foods are exceptional, but the food still contains wheat and artificial food coloring"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "My fish LOVE THIS, but my pocketbook doesn't.....",
      "text": "My fish immediately went gaga over these micro pellets. I was surprised. It was like yelling \"ice cream\" in a playground full of children. Amazing. I currently have only Swordtails and guppies in my rain catchment ponds. One big surprise is that the package is so small. I failed to realize that 0.77 oz is a tiny amount. I wish there were a larger quantity package available at a lower cost. I have been using TetraFin Goldfish Crisps which work well and costs $.159 / gram. This Hakari product costs $.274/ gram. So I think that my fish kids are gonna need to stick with the TetraFin. Except, of course, for birthdays, anniversaries, etc. Hehe. ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Food Loco",
      "helpful_votes": 2,
      "publication_date": 20200612
    },
    {
      "title": "Practical design",
      "text": "These are my favorite pellets for small fish. The \"semi floating\" nature is perfect. If you lightly sprinkle them. They will float for a few moments and then sink slowly. If you toss them down with some momentum they will sink immidiately. By mixing up these techniques I can easily ensure that my different fish get equally fed in my community tank because I can easily control where the food goes without much effort. Hikari tends to know how to design food in ways that makes feeding more efficient and this is no exception.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 3,
      "publication_date": 20191205
    },
    {
      "title": "Best of all worlds",
      "text": "This really is my favorite tropical fish food on the market. The size is great for smaller-mouthed tropical fish. Some pellets are way too big. I like that they are semi-sinking, which means they float at the surface long enough for the fish who prefer to skim the top to eat, then fall to the middle for my tetras and minnows, and some is then sunk to the rocks. The fish can then forage for the remaining bits, and my bottom feeders can find some leftovers too (in addition to their boiled veggies and algae wafers).",
      "rating": 5.0,
      "verified": true,
      "author": "Lambobble",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Our fish loves this stuff",
      "text": "Our gold fish hides like a scared little baby all day. I can see him peeing out of his shipwrecked steamboat on occasion. But he always darts back in when the giants show up. We never see him, unless you sprinkle some of this rancid smelling mummified shrimp flakes. Dude can't control himself, he comes out darting around like a crack head. Once its all gone he goes back to his old shipwreck to hide a tweek a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Hickok",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "My Tetras love it!",
      "text": "Perfect for my picky eating Neons. The pallets sink slowly so it helps for those mid to bottom feeders. They can be too big for nano fishes like Cherry Barbs but you can crush them easily with your fingers. Great quality and my fishes are happy, healthy and growing.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Incredible size great for fish digestion",
      "text": "Dry fish food expands when it gets wet and then inside your fish stomach etc. So the larger the piece of food the more it expands, the smaller the pieces the easier the total food will be digested. This is very good for fish who have swim bladder issues. Can not recommend more highly, can feed the fish more food and not worry as much about them digesting it properly without prescription soaking the food",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo",
      "helpful_votes": 6,
      "publication_date": 20160719
    },
    {
      "title": "My neons love this food",
      "text": "My tetras absolutely go crazy for these pellets and so does my Betta! They float until pushed down by pressure which I like because it doesn’t get lost in the substrate as much. Just make sure they don’t fall by the intake cuz they do go right in.",
      "rating": 5.0,
      "verified": true,
      "author": "Swt_n",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Not bad",
      "text": "I got this for a tropical tank that includes pygmy rasboras - they're teeny tiny, and they were pretty timid about feeding on flakes. They seem to go after this with gusto, and the other fish in the tank like it too. For those reasons, I'll definitely keep using it. However, these pellets don't behave the way I thought they would. I guess I don't know what \"semi-floating\" is supposed to mean, but I thought it meant that the pellets will hang out mid-tank before sinking. This stuff does one of two things: floats at the top or sinks. I was hoping it would at least sink pretty slowly, but that's not the case.",
      "rating": 4.0,
      "verified": true,
      "author": "SrhWTop Contributor: Pets",
      "helpful_votes": 10,
      "publication_date": 20130502
    },
    {
      "title": "Not working for my fish",
      "text": "I do not why but my Neo Tetra does not like this food at all. They do not eat it like the other Tetra brand. I like the small grains of the food but unfortunately it did not work. Update: the food contaminated my tank and now my fish has infections",
      "rating": 2.0,
      "verified": true,
      "author": "memsdragon",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Another quality Hikari product.",
      "text": "My community tank fish love these. Even the cory cats start feeding when I put these in the tank. I feed them in multiple small amounts because they sink fairly quickly. Of Hikari's product line, I use these, fancy guppy, and first bites. I have never been disappointed in a Hikari product.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim412",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "I received the items on time",
      "text": "The price is right and cheaper than petsmart and all the other pet locations and my fishes like the Hikari and I received the items before time but on time I would shop with this company from now on",
      "rating": 5.0,
      "verified": true,
      "author": "sexyblack",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Bleh",
      "text": "These are bleh...pretty my fish eat them but i have a few issues with them. They sink too fast (cant help that), the bag is .77 oz which is smaller than I thought it'd be, but biggest issue is it contains copper sulfate, and if you have shrimp in your tank it could be dangerous for them. Copper also isnt great for fish anyway. I'll probably finish this bag and try to find better food.",
      "rating": 3.0,
      "verified": true,
      "author": "Gwilluhkerz",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "fish likes it",
      "text": "fishes do eat them up quickly, but they do sink lot faster than i thought it would. good part of it just end up on the bottom of the tank.",
      "rating": 4.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Good food but stained fish tank",
      "text": "This food was all right, but I found that it stained my fish tank. The staining went away once I switched to a different food. It seemed to be fine for the fish though.",
      "rating": 3.0,
      "verified": true,
      "author": "Arya Boudaie",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Great for Small Fish",
      "text": "My teeny tiny Gold Ring Danios love this food. It sinks pretty quickly though so I recommend to lightly sprinkle it a few times so the fish will have time to eat. My fish have been very happy and healthy (coming up on 2 years old with no deaths in the school). I will now only buy Hikari for my fish food.",
      "rating": 5.0,
      "verified": true,
      "author": "RachelTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20161209
    },
    {
      "title": "Great buy",
      "text": "Love it !!! So far I really like it. ...it was the only food that was easy for my little buddies to eat and they took it to super fast, it was gone in seconds and no mess! They loved it :) great buy...just wish it was in a bigger pack !!! :( ..best size for their small mouths :)",
      "rating": 5.0,
      "verified": true,
      "author": "Vee",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "which is OK as my fish like to catch the pellets as they sink",
      "text": "They only float briefly in my tank (sponge filter with moderate surface agitation), which is OK as my fish like to catch the pellets as they sink. They are just a bit too big for fry or juvenile fish, but my tetras, dwarf gourami, and siamese algae eaters (unfortunately) like them. They sink to the bottom so the corys eat them as well. I've used this food for a while now and the fish seem healthy and continue to have a good appetite for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Miller",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "They're great!!!",
      "text": "My betta loves these tiny pellets. It's the only ones he'd eat. Yay! He also loves frozen blood worms.",
      "rating": 5.0,
      "verified": true,
      "author": "WeisaW",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Great for small fish! (But big fish will like it, too)",
      "text": "These are super small and great for fish with small mouths - I have ember tetras and celestial danios that both have no problem eating these.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Pulley",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Small fish love these!",
      "text": "My juvenile cardinals love these and can easily get them in their small mouths.",
      "rating": 5.0,
      "verified": true,
      "author": "mg-CarrolltonGeorgia",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Good fish food",
      "text": "Doesn’t cloud the water, great quality food, floats and sinks slowly. Great for small mouthed fishies.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "My fish like it",
      "text": "This works well for my threadfin rainbows. They have very small mouths & need something that doesn't sink too quickly",
      "rating": 5.0,
      "verified": true,
      "author": "D. W.",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Good size for small fish at the surface and midwater",
      "text": "So far, my blue danios and threadfin rainbows like them. Good size for small fish, they offer a good combination of floating and sinking behavior, and they don't make a mess of the water if they're not consumed immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Goldberg",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Made both aquariums water cloudy",
      "text": "I liked the size and the fish seemed to like these. Big problem: they made both of my aquariums cloudy.",
      "rating": 1.0,
      "verified": true,
      "author": "HonestOpinion",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Great for guppy fry",
      "text": "This is a perfect pellet foot that is small enough for my guppy fry. They eat it and so do the larger fry or teenagers and the adults I have. It is a good option if you don't want to stock frozen food or aren't able to get it. Definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri Newton Maxwell",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Fish love this stuff!",
      "text": "Bought these for some Zebra Danios I have and they love them. The pellets are tiny, like grains.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve K.",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "To floating",
      "text": "I have some very large fishes and a few small ones. For middle feeders it floats so it does not sink enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Toneya Schroder",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Awesome stuff, not exactly semi-floating...",
      "text": "Thought it would somewhat suspend because it's a \"semi-floating micro pillet\", guess I was wrong. It goes straight to the bottom. Not a problem though, my spotted Raphael catfish loves it. Be warned, this package is really small, smaller than palm size when laid flat. And by micro, they mean micro, tiny granules, not solely suitable for small goldfish. However, it put my main food ( Hakari mixture) and this after so it falls between the gravel. My goldfish love to mouth the gravel/sand so it's like a nice treat for them. This is mainly for tiny fish, tetras, barbs, dianos and such. Again, awesome stuff!",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Ramgoolam",
      "helpful_votes": 0,
      "publication_date": 20150320
    },
    {
      "title": "Ember tetras love them!",
      "text": "My fish love these. They are the perfect size for fish as small as ember tetras. My German blue ram enjoys them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great for our mid-level feeders",
      "text": "This has been most successful food in our community tank so far! Lingers just at mid tank just long enough to let the middle feeders get theirs before it sinks to the bottom for the catfish.",
      "rating": 5.0,
      "verified": true,
      "author": "LS Shopper",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Fish love it",
      "text": "My fish like this very much. Unfortunately my dog liked it more and forced her way into a drawer where it was stored. She ate all of it so I am reordering and will put it someplace where a Weimaraner can't get to easily",
      "rating": 5.0,
      "verified": true,
      "author": "Ken",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "All my tetras will eat!",
      "text": "All of the members of my community tank love this food. My skirt tetras won't eat flakes anymore! The filter blows the food all over the tank and the fish chase it like live food. Very happy with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Darla",
      "helpful_votes": 2,
      "publication_date": 20170115
    },
    {
      "title": "Good food for small fish at different tank levels.",
      "text": "Good product, some float, some sink (but slowly)...fish like it, and gives fish at different levels a chance to eat. Small enough for loaches, Cory, pygmy Cory, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Z",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Great fish food!",
      "text": "I don't know if it's because my fish are picky, but whenever I put this particular food in they go crazy for it. I feed this with shrimp pellets to get a good combo of top and bottom food.",
      "rating": 4.0,
      "verified": true,
      "author": "JARREN S.",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Yummy Yummy in my Fishes Tummies",
      "text": "Don't let the name fool you! \"Hikari Tropical Semi-Floating Micro Pellets for Pets\" is for fish and fish alone. My fish do love this stuff! Not so much my hamster.",
      "rating": 5.0,
      "verified": true,
      "author": "khadija",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Pretty good",
      "text": "My fish loves it, dont like the flakes only accepts the pellets",
      "rating": 5.0,
      "verified": true,
      "author": "May",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Hikari Micro Pellets",
      "text": "I bought this to feed to my dwarf emerald rasboras. It must be tasty because they LOVE it! I also feed them frozen bloodworms, but this is their staple food, and it seems to be working out very well.",
      "rating": 5.0,
      "verified": true,
      "author": "KDO",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Yummy fishy tummies",
      "text": "My fancy guppies, neon tetras & invertebrates eat this food like it's candy. I completely trust the quality of the Hikari brand! I've noticed my animals are brighter & happier at meal time compared to the messy flakes. I also like that Hikari's foods seem higher quality nutrition for them as well.",
      "rating": 5.0,
      "verified": true,
      "author": "ssraffertyfam",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "I love these pellets for my fish tank",
      "text": "I love these pellets for my fish tank. They stay at the top for a good 15-20 seconds before they start to fall to the bottom. They seem easy for my fish to eat and they like them.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve B",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Tiny ones go for Micro",
      "text": "Use this as a staple for guppies, it will feed everything from the newest newborns to Momma and Poppa. I've also seen Cardinals, Neons, Corydoras, and assorted fry go for this stuff. Probably too small for fishes 2\"+, but another great Hikari product for your itty-bitties.",
      "rating": 4.0,
      "verified": true,
      "author": "joemaamah",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "These pellets are great. My red eye tetra love them",
      "text": "These pellets are great. My red eye tetra love them. They are a nice small size and either float nicely on the top of the water, or slowly sink down, which my fish love. I have used these for a long time and it is a food I use consistently for my fish.",
      "rating": 5.0,
      "verified": true,
      "author": "Carly Brinkerhoff",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "I use this for my tetras and they love it.",
      "text": "Almost time for a reorder, I use this for my tetras and they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary D. Houser",
      "helpful_votes": 0,
      "publication_date": 20181012
    },
    {
      "title": "Fish like it!",
      "text": "Tiny size great for young neons and other small fish. Mine eat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Truly excellent",
      "text": "The best tropical fish food I have ever used; a truly excellent product! I would recommend this to any fish lover.",
      "rating": 5.0,
      "verified": true,
      "author": "MDS",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Fish love these. They float",
      "text": "Fish love these. They float, so it's easy for the kids to see how much they've fed the fish. The nice pellet size also works well in automatic fish feeders. I purchase these often.",
      "rating": 5.0,
      "verified": true,
      "author": "LisaH.",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "bottom and top feeders like this food",
      "text": "I like that the food is semi floating since I have a mix of bottom and top feeders. The food slowly sinks to the bottom so all types of fish can eat.",
      "rating": 5.0,
      "verified": true,
      "author": "VEK",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Good for both fish and shrimps. they love it!",
      "text": "Fishes and shrimps both like this. Until they float, they belong to the fishes. Once they sink, they belong to the shrimps! I use it as a variety for shrimp foods.",
      "rating": 5.0,
      "verified": true,
      "author": "Rolando B. Fauni",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Sample pack?",
      "text": ".77 oz is very small. Looks like a sample bag. Will not purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "68EagleTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Wish the pellets were just a little smaller",
      "text": "My tetras love them, but there are a few tetras that are too small to eat them.",
      "rating": 4.0,
      "verified": true,
      "author": "MH",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great for small schooling fish.",
      "text": "Everyone loves them!! I have various tetras, panda cories and a gourami. Soooooo much less of a mess than flake food.",
      "rating": 5.0,
      "verified": true,
      "author": "Gamermomstl",
      "helpful_votes": 0,
      "publication_date": 20170416
    },
    {
      "title": "Great for the little guys",
      "text": "Great food for young guppies and fry. Floats and then sinks slowly. Small package but a little goes a long way. Will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "M. E. BennettTop Contributor: Aquascaping",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Good brand to have for feeding fish in a small ...",
      "text": "Originally bought at a fish Co-op store. Its quite a drive to get there, so getting it via Amazon helps when we can't make time. Good brand to have for feeding fish in a small aquarium (have a 10 gallon).",
      "rating": 5.0,
      "verified": true,
      "author": "Mei Mangalindan",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Fish say \"yum yum\"!",
      "text": "My small mouth fish (white clouds/danios) LOVE these pellets. They don't float for long especially if there is any turbulence from filter. Not available at local pet stores so pleased to have a way to buy them here.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris J.",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Fantastic for tiny fish",
      "text": "Hikari is a trusted brand name for a reason...it is high quality. This product is no different. I can recommend it wholeheartedly. It is perfect for small fish or fish fry. I fed it to baby angelfish with great results.",
      "rating": 5.0,
      "verified": true,
      "author": "paprpushr",
      "helpful_votes": 0,
      "publication_date": 20130416
    },
    {
      "title": "Betta seems happy.",
      "text": "Pretty good. Fish seems to like them. A little hard to measure out, but otherwise okay.",
      "rating": 4.0,
      "verified": true,
      "author": "nuthin13357667",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "My fish love them",
      "text": "My fish was fussy until I got these. He loves them and he is 5 years and going strong. They last a long time and I never have any rotting food issues. I am not an expert on fish or their food but my guy loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Great For freshwater community tank",
      "text": "My fish LOVE this food. Freshwater tank: platys, mollys, tetras",
      "rating": 5.0,
      "verified": true,
      "author": "MClair",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Awesome sinking food.",
      "text": "My Green tetras love these. My Pygmy corys eat the pieces that fall to the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Great product",
      "text": "My X-Ray Tetras go crazy for this stuff and my snails gobble up the extra stuff left behind.",
      "rating": 5.0,
      "verified": true,
      "author": "Taylor Dwyer",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "great if you have shrimp and fish",
      "text": "If you have cherry shrimp, and fish in the same tank then use this food. Other food can cause your shrimp to die.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Woods",
      "helpful_votes": 0,
      "publication_date": 20160401
    },
    {
      "title": "My cardinals love them, I like that they slowly sink",
      "text": "My cardinals love them, I like that they slowly sink, allowing the fish to get to them. My cardinals seem to have grown good once fed those pellets.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine Jaques-Dalcroze",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Finally a food they love",
      "text": "My cardinal tetras were picky eaters until I found this food.",
      "rating": 5.0,
      "verified": true,
      "author": "SRC",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Five Stars",
      "text": "I like these. My fish seem to like these. Don't seem to be as messy as flakes.",
      "rating": 5.0,
      "verified": true,
      "author": "JessicaisaMessica",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Fish Are Happy",
      "text": "All my little freshwater foodies think this is delicious! Danios, platys, tetras, even the catfish enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "PeachPecan",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "The name is misleading",
      "text": "Pellets are not really floating, just sink in the water.",
      "rating": 3.0,
      "verified": true,
      "author": "SH",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Five Stars",
      "text": "Fairly decent pellet food. I feed this to all of my fish.",
      "rating": 5.0,
      "verified": true,
      "author": "Emmanuel Conde",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Five Stars",
      "text": "My fish seem to love it and it keeps them fit & healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Good fish food.",
      "text": "I wish it float more. The pellets still sink too fast. I looks little bit differ than the regular one but the fish still like it. Just get the cheap one of them.",
      "rating": 5.0,
      "verified": true,
      "author": "HENRI PHAM",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Yummy food for small fish",
      "text": "Wonderful food. My small fish (neon tetras & danios) seem to love it. Despite being labeled as \"semi-floating\" it sinks rather fast, but it is manageable.",
      "rating": 5.0,
      "verified": true,
      "author": "Hamid",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Guppies love it!",
      "text": "The pellets are pretty small but is the right size for my guppies and ghost shrimp. It stays a float on top for a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "tigger",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "but all the fish love it!",
      "text": "Bought it for the smaller fish, but all the fish love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn-Gail Miike",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "As small as the pellets are, they still must ...",
      "text": "As small as the pellets are, they still must be crumbled a bit for my guppies. Crumbled or not, floating is not happening. They're eating it so I guess that's all that really matters.",
      "rating": 2.0,
      "verified": true,
      "author": "sja",
      "helpful_votes": 0,
      "publication_date": 20170415
    }
  ],
  "product_meta": {
    "title": "Hikari Fish Food",
    "rating": 4.7,
    "feature_bullets": [
      "SUPERIOR NUTRITION has been scientifically proven by decades of research to meet the dietary needs of tetras, barbs and other small tropical fish.",
      "PREMIUM SELECTION of marine and vegetable proteins is ideally suited for small tropical fish, which require larger energy reserves.",
      "SEMI-FLOATING micro-pellets sink slowly to allow fish at all levels of the tank to receive the nutrition they need to thrive.",
      "UNIQUE MICRO-COATING virtually eliminates nutrition loss and water clouding; a balance of krill and spirulina help fish achieve vivid coloration.",
      "PRECISELY COLORED granules improve underwater visibility for maximum consumption with less wasted food."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.6 x 0.3 x 1.8 inches; 0.8 Ounces",
      "Item model number": "42055211024",
      "Date First Available": "March 24, 2009",
      "Manufacturer": "Phillips Feed & Pet Supply Natural Balance",
      "ASIN": "B004PBB5TK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Food",
      "Pet Supplies",
      "Fish & Aquatic Pets"
    ],
    "price": 5.25
  }
}