{
  "website_summaries": [
    {
      "verdict": "The Shure SRH550DJ headphones strike a solid balance of durability and respectable sound definition, worthy of hard-hitting DJs who play pop, rock, hip-hop, and electronic music.",
      "pros": [
        "The Shure SRH550DJ Professional Quality DJ Headphones achieve optimum comfort thanks to flexible, rotating earcups that conform to your head, and the rumbling bass is ideal for DJs and fans of music that emphasizes the low end"
      ],
      "cons": [
        "The plastic housing lining the joints on the headband is prone to creaks and could degrade after prolonged use"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20111212,
      "rating": 7.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good sound, poor comfort",
      "text": "These sound great but the earmuffs feel small and have a tight fit. Due to the discomfort, I cannot use these over long periods.",
      "rating": 3.0,
      "verified": true,
      "author": "cryptoman",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "too tight for me",
      "text": "I agree with the other reviewers that they put way too much pressure on the top of my head and my ears. I tried adjusting the legs but that just made them hang off my ears (i.e. less pressure, but now no contact with my ears). I thought they sounded great, and did an amazing job at blocking out external noises (probably because they were clamped so tight onto my head). I ended up buying thewhich sounds great and is substantially more comfortable to wear (and has larger cups, which I think will help with the ear pressure).",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew L. Daniel",
      "helpful_votes": 0,
      "publication_date": 20131012
    },
    {
      "title": "Stylish and works great",
      "text": "I’m no audiophile. I just wanted a decent pair of headphones since I kept losing wireless ones. I love these headphones. They work great and look great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Moran",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Terrible sound",
      "text": "These are pretty bad. Very thin sound. I wouldn't pay more than $10 for this kind of quality. I can't believe what they're selling for now.",
      "rating": 1.0,
      "verified": true,
      "author": "RadishTheHut",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Love this headset",
      "text": "Love this headset, fits snug but not too tight, music is very crisp and clear, adjustments are very simple with a nice cord that is thick and not cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "but the cord is really cheap and crappy, and feels like it's going to break or ...",
      "text": "I guess they are all right headphones, but the cord is really cheap and crappy, and feels like it's going to break or short out really soon. The clarity is not that wonderful kind of sounds like listening through a beanie. They are comfortable, and easy to clean after sweating it out in the DJ booth. That said, there are a lot better headphones for this price point. I would recommend anything by Pioneer or Sony at this price point.",
      "rating": 2.0,
      "verified": true,
      "author": "kevin winkle",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Must be heard to appreciate!",
      "text": "I had been searching Amazon for a sturdy pair of headphones that have quality sound at a reasonable price and found it with these bad boys. They fit snugly around your ears and don't move an inch regardless of what you're doing. Construction is solid and stands up to a lot of wear & tear. They look great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Ford",
      "helpful_votes": 0,
      "publication_date": 20130322
    },
    {
      "title": "Great Sound",
      "text": "I love my headphones. Great Quality and great sound for a great price. My shipment came on time as a matter a fact sooner than expected. Will purchase another pair of Shure headphones in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "Great sound but pin broke",
      "text": "Great headphones. Awesome sound. No words to describe it. Not a audio phile but audio quality is good. However what happened is the headphone pin broke. So in contact with Shure to see if they can replace it. Shure came back. Sent to shure and replaced the headphones. It worked for another 4 months. one side stopped working. Ie., I was able to hear audio only on one side. Tired of replacements and went and bought a Bose.",
      "rating": 4.0,
      "verified": true,
      "author": "GEEMAN",
      "helpful_votes": 2,
      "publication_date": 20120506
    },
    {
      "title": "I have Shure headphones which I love, not these",
      "text": "I have Shure headphones which I love, not these. When they arrived, I realized immediately they needed to be returned. Compared to other professional studio quality headphones these seem \"cheap\" and I'm not sure they would last long after daily use. I can't comment on the sound because after seeing them, I simply put them back in the box for the return. A major problem is that the wiring comes down from both ear pieces and then merges, in front, similar to the wiring on ear buds. This would make them uncomfortable for all day use in a studio. They were not that expensive, so I guess \"you get what you pay for\".",
      "rating": 1.0,
      "verified": true,
      "author": "Skip Orem",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Magic for the ears.",
      "text": "Comfortable for hours and hours on one's head, with nice crisp highs and solid bass you can feel if you want. Shure earns their name. If you're thinking: \"Yeah, but are they $100 good?\" The answer: Yes. Pull the trigger and buy these.",
      "rating": 5.0,
      "verified": true,
      "author": "Wiredzero",
      "helpful_votes": 0,
      "publication_date": 20130228
    },
    {
      "title": "Great head phones",
      "text": "For the money, the sound is great! The kids LOVE them. Might even buy more for the rest of us!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Simpson",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "Shure SRH550DJ Professional Quality DJ Headphones (Smokey Grey)",
      "text": "They have surprisingly good bass tone to them. The treble pops as well. The only problem I have with these headphones is the price (and that is because I am cheap..). They are defiantly worth the money, and the headphone tilt feature is an extra plus if you are a DJ that will be constantly moving and adjusting them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaylow",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "Four Stars",
      "text": "My only issue is that the plug in piece broke in half",
      "rating": 4.0,
      "verified": true,
      "author": "Tyzer Clark",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Nice sound, but cheap materials",
      "text": "Sure they sound great, but give it a few months and if you fold them up with any regularity they are going to fall apart. The plastic holding the earpieces to the adjustable headband is made of thin cheap plastic and snapped on both sides. I'm in the process of getting it replaced, but given enough time, they're just going to break again.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric D.",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Great gift!",
      "text": "This was purchased as a gift, so it took a while for feedback. The results were positive. This was a gift I was proud to give.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly  Stroud",
      "helpful_votes": 0,
      "publication_date": 20130124
    },
    {
      "title": "These sound up and live up to expectations",
      "text": "I didn't give these four stars because I wish they would come with an intermediate cord, I think it's stupid that I might have to toss a perfectly good pair of headphones all due to a broken cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel K",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "Good sounding and comfortable",
      "text": "When I bought these headphones I was nervous that they would not sound very good. These headphones have a mostly plastic body but it is solid sturdy plastic. The upper part is soft, has plenty of padding, and the padding for the ears are also soft. The cord is about a foot longer than I need it to be but other than the length of the cord, these headphones are great looking and great sounding.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 4,
      "publication_date": 20111126
    },
    {
      "title": "So Good Someone Stole Them",
      "text": "I DJ locally in Riverside, and they are great to isolate the bass and hear your next cue track. the chord is a little long, and the design kind off flimsy at times. if you got spiked hair, not a chance. overall the product is good, I got it for %50-$75 so look for it to drop down online. was deejaying and someone swooped them when I went to use the john. gg.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Fan",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "3 stars",
      "text": "As the 3 star says...it's OK. I was expecting a better sound out of it. I normally use a Tecnics. So, this sounded not as good. The bass is quite lower. You can use this for home...surely not the clubs.",
      "rating": 3.0,
      "verified": true,
      "author": "Shahab",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "Headphones already broken",
      "text": "Although the headphones sound great, the piece over the top broke yesterday. They need to create a better way of making sure the headphones last.",
      "rating": 2.0,
      "verified": true,
      "author": "Dawn L Shedden",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Should have returned them",
      "text": "Audio sounds great. The feel is good, not too bulky and lightweight. Unfortunately, on the left bracket, it will crack quickly due to the plastic they use in making it. Mine broke within 2 weeks of ordering them. Ordered another pair, and when the crack occurred in the same place, I returned them before they broke. If you don't plan on folding them up, and not using them on a daily basis, then they will do. If you are a DJ and plan on folding them up and using them 3-4 times a week, pass. I learned the hard way.",
      "rating": 2.0,
      "verified": true,
      "author": "i",
      "helpful_votes": 9,
      "publication_date": 20130509
    },
    {
      "title": "uncomfortable",
      "text": "was really looking forward to getting these headphones but was disappointed with both how they sound and with how uncomfortable they are.",
      "rating": 2.0,
      "verified": true,
      "author": "trying",
      "helpful_votes": 5,
      "publication_date": 20110708
    },
    {
      "title": "No detachable cable",
      "text": "Despite saying thia has a detachable cable and having a picture of the cable detached, these do in fact NOT have a detachable cable. The fit on them is not great. I was looking for a pair with which I could use Shure's in-line microphone or bluetooth cable, but it cant be done. So I returned them. Also, despite being \"new\" the box was pretty beat up.",
      "rating": 1.0,
      "verified": true,
      "author": "81pez",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Pretty good",
      "text": "For people whining about how comfortable they are, you should have bought more expensive headphones. These are a bit uncomfortable to wear after a few hours, but they sound GREAT! As for the build quality, a few months in mine are still in tip top shape, and I'm not crazy gentle with them. For people complaIning about build quality, again you probably should have ponied up some more greenbacks. These are probably the best sounding headphones for their price, but probably not the most comfortable! There are ways you could probably mod them to make them a bit more comfortable.",
      "rating": 4.0,
      "verified": false,
      "author": "Ben Rose",
      "helpful_votes": 3,
      "publication_date": 20140315
    },
    {
      "title": "They were great until they broke",
      "text": "Great sounding headphones and great for djing. Unfortunately, they didn't last very long because they broke apart. Also, the cable tangles easy. Not recommended.",
      "rating": 2.0,
      "verified": false,
      "author": "Warren",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Great Cans!",
      "text": "I got these after reviewing and looking over a lot of different headphones. For the price, I don't think you can get a better set of headphones. I am a DJ, so headphones must be full of bass and crisp clear highs and vocals are important for proper mixing. These headphones do all that and are more than I expected. I'm not \"Shure\" how durable they are because I only have had them for a week but they sound great and they don't fatigue my ears. I love 'em!",
      "rating": 5.0,
      "verified": false,
      "author": "DJ DeadRinger",
      "helpful_votes": 10,
      "publication_date": 20111123
    },
    {
      "title": "broken",
      "text": "Both of the plastic adjustable arms have broken, one has been somewhat repaired with tape, the other is still loosely connected. They aren't very comfortable. The sound is pretty good, very bright. Would value around $40 due to horrid construction but fair sound",
      "rating": 2.0,
      "verified": false,
      "author": "pouya",
      "helpful_votes": 3,
      "publication_date": 20140115
    },
    {
      "title": "The sound was good, but they disintegrated",
      "text": "The sound was good, but they disintegrated. Light, careful use...the band broke into small pieces and the right earpiece fell off!",
      "rating": 2.0,
      "verified": false,
      "author": "Aly Up",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "to much head pressure",
      "text": "They sound good but cause me pain from pressure. The only thing you can adjust is length. If you wear glasses its even worse from them pressing your ears into the frame. I have put them away.",
      "rating": 2.0,
      "verified": false,
      "author": "MichaelR",
      "helpful_votes": 9,
      "publication_date": 20130303
    },
    {
      "title": "One Star",
      "text": "Only one use and the headband broke! Severe durability issues...",
      "rating": 1.0,
      "verified": false,
      "author": "Teoh Kim Seng",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "Great Sound Awful Construction",
      "text": "Sounds great but the headphones are built by the most durable material known to the universe! Mine broke in a few months",
      "rating": 1.0,
      "verified": false,
      "author": "Lunate",
      "helpful_votes": 0,
      "publication_date": 20160205
    }
  ],
  "product_meta": {
    "title": "Shure SRH550DJ Professional Quality DJ Headphones (Smokey Grey)",
    "description": "Model: SRH550DJ Professional DJ Headphones \nCLICK IMAGES TO VIEW HIGHER RESOLUTION!\nThe SRH550DJ Headphones from Shure deliver full-range audio performance, comfort, and durability for DJ use and personal listening. 50 mm Dynamic drivers deliver enhanced bass, while padded ear cups with supra-aural design swivel 90 degrees for flexible wearing positions and full isolation. Includes a carrying bag and a threaded 1/4\" (6.3) mm gold-plated adapter.\n\nFEATURES\n * 50mm neodymium driver provides full range sound with enhanced bass\n * Closed-back, supra-aural design rests comfortably and securely on the ears with full isolation\n * Full-range frequency response with enhanced bass optimized for both DJ mixing and personal listening\n * Adjustable, collapsible headband with 90-degree swivel ear cups for comfort and flexible wearing positions\n * Ultra-lightweight design folds to very small size for maximum portability\n * Replaceable earcup pads ensure long product life\n * 6.9-foot (2.1 m) coiled detachable cable provides plenty of length and easy storage and replacement\n * Carrying Bag protects headphones when on the go or not in use\n * Legendary Shure durability to withstand the rigors of everyday use\n\n\nWHAT'S IN THE BOX?\nSRH550DJ Professional DJ Headphones\nHPACP1 Carrying Pouch\nHPAQA1 Threaded 1/4\" Gold-Plated Adapter\nHPAEC550 Replacement Velour Ear Cushions\n\n\nSHURE'S SRH HEADPHONES COMPARISON CHART\nModel \nSRH440 \nSRH550DJ \nSRH750DJ \nSRH840 \nSRH940 \nSRH1440 \nSRH1840 Design Closed-Back, Circumaural Closed-Back, Supra-aural Closed-Back, Circumaural Closed-Back, Circumaural Closed-Back, Circumaural Open-Back, Circumaural Open-Back, Circumaural Created for: Home & Studio Recording DJ Mixing & Personal Listening DJ Mixing & Monitoring Critical Listening & Studio Monitoring Critical Listening, Studio Monitoring & Mastering Mastering & Critical Listening Applications Mastering & Critical Listening Applications Driver 40 mm dynamic, neodymium magnet 50 mm dynamic, neodymium magnet 50 mm dynamic, neodymium magnet 40 mm dynamic, neodymium magnet 40 mm dynamic, neodymium magnet 40 mm dynamic, neodymium magnet 40 mm dynamic, neodymium magnet Sensitivity (1kHz) 105 dB/mW 109 dB/mW 106 dB/mW 102 dB/mW 100 dB/mW 101 dB/mW 96 dB/mW Impedence (Nominal, 1 kHz) 44 Ohm 32 Ohm 32 Ohm 44 Ohm 42 Ohm 37 Ohm 65 Ohm Max Input Power (1 kHz) 500 mW 3000 mW 3000 mW 1000 mW 1000 mW 1000 mW 1000 mW Frequency Range 10 Hz - 22 kHz 5 Hz - 22 kHz 5 Hz - 30 kHz 5 Hz - 25 kHz 5 Hz - 30 kHz 15 Hz - 27 kHz 10 Hz - 30 kHz Net Weight (w/o cable) 0.60 lb (272 g) 0.53 lb (235 g) 0.50 lb (227 g) 0.70 lb (318 g) 0.71 lb (322 g) 0.76 lb (343 g) 0.59 lb (268 g) Cable Type Coiled, detachable, non-PVC, oxygen-free copper (OFC) Straight, dual-exit, detachable, non-PVC, oxygen-free copper (OFC) Coiled, detachable, non-PVC, oxygen-free copper (OFC) Coiled, detachable, non-PVC, oxygen-free copper (OFC) Coiled & straight detachable, non-PVC, oxygen-free copper (OFC) Straight, dual-exit, detachable, non-PVC, oxygen-free copper (OFC) Straight, dual-exit, detachable, non-PVC, oxygen-free copper (OFC) Cable Length 3.0 m (9.8 ft) 2.1 m (6.9 ft) 3.0 m (9.8 ft) 3.0 m (9.8 ft) 3.0 m (9.8 ft) 2.1 m (6.9 ft) 2.1 m (6.9 ft) Connector Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Gold-plated 1/8\" (3.5mm) stereo mini jack plug with 1/4\" (6.35mm) threaded adapter Building on 87 years of audio experience, the SRH550DJ Headphones from Shure deliver audio performance, comfort, and durability for DJ mixing and personal listening. The full-range frequency response with enhanced bass is optimized for most consumer devices and professional devices such as DJ mixers and mixing consoles. Ear cups with replaceable ear pads swivel 90 degrees for versatility and comfort.",
    "rating": 4,
    "feature_bullets": [
      "Note this version of the product is from another country",
      "This international version does not include a warranty in the US",
      "This products is materially the same as the US version, but the packaging is different"
    ],
    "specifications": {
      "Item Weight": "1.5 pounds",
      "Product Dimensions": "4.5 x 8.5 x 9.5 inches",
      "ASIN": "B004MBQF84",
      "Item model number": "SRH550DJ",
      "Customer Reviews": "4.0 out of 5 stars78 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#47,338 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 27, 2011",
      "Color Name": "Gold",
      "Connector Type": "3.5mm stereo plug",
      "Color Screen": "No"
    },
    "categories": [
      "Musical Instruments",
      "DJ Headphones",
      "Electronic Music, DJ & Karaoke",
      "DJ Equipment"
    ],
    "price": 99.0
  }
}