{
  "website_summaries": [
    {
      "verdict": "Consistent quality seed that grows well overall but especially for difficult patches in shaded areas. Reputable brand with many enthusiastic fans.",
      "pros": [
        "May need some babying and extra watering at first, but grows up strong once established",
        "Handles deep shade like a champ yet doesn't wilt in the sun",
        "Versatile"
      ],
      "cons": [
        "Often needs tilling to truly flourish",
        "Some users say the mixture sports too much filler and too few seeds"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "So good it grows grass on asphalt",
      "text": "This came in lush and thick in 3 weeks. There was a dusting of dirt on our asphalt and it even took root there. Highly recommended. Wish they made a hair seed.",
      "rating": 5.0,
      "verified": true,
      "author": "InLibris",
      "helpful_votes": 45,
      "publication_date": 20181220
    },
    {
      "title": "great grass seed",
      "text": "I hesitated over this purchase because of the people who trashed this grass seed in the reviews. But my neighbor had recommended it, so.... I flung the seed over the backyard in all the bare patches last Saturday afternoon. It rained a couple of days and I watered with a hose a couple of days. Today is Wednesday, just four days later, and the seed is sprouting very well and some of the sprouts are an inch tall already. I just bought another bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah K Major",
      "helpful_votes": 24,
      "publication_date": 20190424
    },
    {
      "title": "Bag is a WHOPPING 50% FILLER - NOT REAL SEED - JUNK --- DID NOT GROW ANYTHING",
      "text": "This product is a flat-out scam. Open the bag up and it is NOT grass seed. It's green. Literally green. Have you ever seen green grass seed in your life? I haven't either. The reason it's that color is because it's coated with something and that coating takes up a whopping 50% of the contents. So when they it's a 7 pound bag they should really say it's 3.5 pounds. And the 3.5 pounds that's in there does NOT grow anything at all. Junk. Pennington, burned me once, but never, ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Hammond",
      "helpful_votes": 17,
      "publication_date": 20191214
    },
    {
      "title": "Pennington grass grows great!",
      "text": "I have had successful results with this grass! Pictures will show growth after first week and now about 10-12 days out. I started with no grass in back yard after very long winter so to see it fill in already is very exciting - I thought I would have to spend a lot of money and energy on sod - this is growing in mid-west in hot and very humid weather. The key to successfully growing the grass is you have to water every day!",
      "rating": 5.0,
      "verified": true,
      "author": "Tester51",
      "helpful_votes": 13,
      "publication_date": 20180528
    },
    {
      "title": "Followed the instructions to the letter, and got nothing",
      "text": "My second purchase of these seeds, I thought perhaps after the first time I tried and failed that I had made a mistake - but I followed instructions to the letter, spent an extra $30 that month on my water bill giving these seeds what they needed by way of watering and ended up with NOTHING for a second time. Don't waste your money on this garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. S. Porges",
      "helpful_votes": 10,
      "publication_date": 20181230
    },
    {
      "title": "It’s important to know that Pennington grass seeds truly grow.",
      "text": "I purchased Pennington grass seeds because the other brand that I bought didn’t grow except for different weeds. I am very satisfied with Pennington grass seeds as it really grew. The attached photo showed that my lawn has grass after two weeks. I’m still waiting for the rest of my lawn to be filled.",
      "rating": 5.0,
      "verified": true,
      "author": "ft cab",
      "helpful_votes": 10,
      "publication_date": 20181030
    },
    {
      "title": "price",
      "text": "Went to repurchase and they doubled the price. It's grass seed not a cure for corona virus.",
      "rating": 1.0,
      "verified": true,
      "author": "Vakmere",
      "helpful_votes": 4,
      "publication_date": 20200405
    },
    {
      "title": "Great grass I've ever had anywhere",
      "text": "I am amazed at the fine but thickness of this grass. Rich green color. Was told my front yard couldn't grow grass, nothing before ever worked since 1954 but this is coming in (my yard is sand, FL.) I'm getting ready to repeat my order for the next rainfall to have on hand. Find birds don't go for seeds when 🌧.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon K Hamilton",
      "helpful_votes": 3,
      "publication_date": 20200114
    },
    {
      "title": "Well done Pennington!",
      "text": "I wanted to take advantage of milder temps here in Northern California and over-seed my existing lawn. I cut the grass, raked in the seed and spread a thin layer of bedding mix. Unlucky for me, the Saturday I planted, the weather turned cool and I thought the low to mid 40 degree temps at night would make my work a wasted effort. Surprise! Two weeks later I have new grass! 10/10 would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Quiteno John",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "not happy with this seed",
      "text": "Planted it in the spring in the DC area in two spots which get full sun for the first half to 2/3rds of the day. It came up pretty fast within about two weeks and was lush and full for about a month or so. We had plenty of rain this year and it still browned terribly in one area which actually gets more sun. The other area was ok. But the weeds came up much more in the first area and not much grass remains. I'll need to redo that whole spot again next spring. The second area may be OK.",
      "rating": 2.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "It's a No Show!",
      "text": "Dobt waste yiyr money or time. I did EVERYTHiNG recommended and waited, and waited and...well, you get the point. Nothing grew, except where i didnt want it to, and ecmven that was extremely sparse. Sorry, but i give this 1 star and thats being generous.",
      "rating": 1.0,
      "verified": true,
      "author": "zengirl",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Grass seed that doesn’t grow grass, not ideal",
      "text": "It’s been one month to the day and I have no sign of germination. Followed directions but nothing has grown. I have bought cheap bags of grass in the past that germinated in a few days, this product is worthless and I wouldn’t recommend to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Skipworth Family",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Don’t waste your time !",
      "text": "There wasn’t anything I liked about this grass seed , I used a whole bag on a spot about 7 ft wide and 10 ft long Most of it didn’t even start to grow , what did start to grow was very thin grass blades and now has died , this spot gets about 3 hours of full sun , I bought two bags , the other bag I trashed , I’m not wasting my time on For sure would not buy any more ! Eddie",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie Skinner",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "it grows!",
      "text": "This is my second bag. Loved the first one so much, I decided to extend the yard. This grass grows when many others have not. I live in a very cool climate that is pretty dry, and the yard is mostly shaded with some early morning sun and late afternoon sun. the only downside to this grass is that I do get brown spots where my dog's pee, but not as bad as other grasses.",
      "rating": 5.0,
      "verified": true,
      "author": "Earl Dean",
      "helpful_votes": 2,
      "publication_date": 20190403
    },
    {
      "title": "Not what it says",
      "text": "the grass seed was \"guaranteed to grow\" and I followed all growing techniques ... it still never grew. ( some tried then almost immediately died.) I have used Pennington grass seed many times in the past but did not order on line. With the pandemic I decided not to go out to buy and this seed may have been old or not 1st quality but definitely disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "AKAT",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "The Verdict is Still Out But Happy Thus Far",
      "text": "We live in the city and just moved to a new home with two 15X10 slabs of ground and we decided to grow grass. As first timers we had no idea what we were doing but we spread two of these bags, watered religiously and while IO wish the bags had a little more value with the size and weight we're beginning to see the fruits of our labor!",
      "rating": 4.0,
      "verified": true,
      "author": "Noah M. Glassman",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Big disappointment",
      "text": "The seeds were very easy to spread; however, I planted the seeds almost a month ago and I see no sign of any sprouts. I purchased this for brand of seeds at the direction of my yard service and I paid a great deal of money for the seeds. I didn't mind that because I thought I would have a lush lawn in the long run. I planted the seeds about four days after receiving them as of todays date, May 3, 2019 I see no sprouts at all. I would like a refund, including the egift certificate that I used to pay for order. DH",
      "rating": 1.0,
      "verified": true,
      "author": "Dorothy M. Headd",
      "helpful_votes": 3,
      "publication_date": 20190504
    },
    {
      "title": "Quick and lush",
      "text": "I have been struggling all summer to get some spots in my yard to grow grass (Scott's Blue Grass & Scott's Sun & Shade), following all the recommendations - without great success. I switched to this and am DELIGHTED with the (quick) result.",
      "rating": 5.0,
      "verified": true,
      "author": "Alfa Geek",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Buy!",
      "text": "Great blend of grass that seems to take and grow faster then others!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick W. ",
      "helpful_votes": 14,
      "publication_date": 20160211
    },
    {
      "title": "Good grass seed for west coast yard",
      "text": "I have used this seed before for seeding our back yard after we tried sod a couple of times. The sod died off after a couple years this seed grew quickly and is doing good. I purchased again for a side yard area.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Good, but not the best on the market.",
      "text": "Although this seed works, I've had a better success rate with other brands that include the filler that retains water. Many spots I need to seed are in direct sun, so drying out is a major problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Danica",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Didn't grow",
      "text": "I spread it over and over on one side of the lawn going out and just didn't grow like its described . Wouldn't buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 2,
      "publication_date": 20200104
    },
    {
      "title": "Great coverage",
      "text": "This grass seed was just what we needed. I spread it over some shady areas, gently raked it in to the soil and watered for a few days. In no time it took off. Now we have wonderful ground coverage in places we did not have it before. I will be ordering more as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Katchil",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great Seed!",
      "text": "Great seed, I have used before with very good results. Definitely plant in early fall and u will be very satisfied, I am!",
      "rating": 5.0,
      "verified": true,
      "author": "Grumpy Old Man",
      "helpful_votes": 2,
      "publication_date": 20191123
    },
    {
      "title": "So far so good!",
      "text": "So far so good, I really did very little but throw it on the ground with a little top soil and it looked fantastic in a short amount of time - keep you posted! I've always used Scott's product in the past and they have failed so bad as did their customer service (made the mistake of not ordering through Amazon).",
      "rating": 5.0,
      "verified": true,
      "author": "Swaf",
      "helpful_votes": 5,
      "publication_date": 20160503
    },
    {
      "title": "Nothing grew",
      "text": "I planted this grass two weeks ago and have been watering twice per day, and nothing has grown. When I click the site to get support, or brings me to a closet maid site (like closer organization?). I don’t know, but it’s super frustrating. Any grass that you see in the photo is grass that was there before. I was trying to use this product to fill in patches.",
      "rating": 1.0,
      "verified": true,
      "author": "Irina",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "No Growth after 3 weeks",
      "text": "This is the third time I've ordered Pennington seed. It is the first time nothing has grown. I've ordered through Amazon for a while now as the seed seemed fresh and better than buying it at Lowes or Home Depot. Unfortunately nothing has grown. I live in the Northeast so it got plenty of rain and I have a sprinkler system if needed.",
      "rating": 1.0,
      "verified": true,
      "author": "Booboo18069",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great organic starter fertilizer.",
      "text": "This is really a terrific product. It’s all organic so safe around pets, and I’ve certainly noticed hoe effective it has been this spring season as I’ve been growing new grass.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles D. Schwartz",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Low maintenance 🤘",
      "text": "I’ve been using this grass seed on a dirt patch next to my house at the trailer park, the amount of care I’m dedicating to this dirt patch is minimal at best but the grass is coming in Regardless of general neglect",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie A.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "We have a great yard because of this stuff",
      "text": "All the seed, none of the fill. We have a great yard because of this stuff. On our second bag (decided to turn a little flower garden into grass as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Johnson",
      "helpful_votes": 4,
      "publication_date": 20180513
    },
    {
      "title": "Dies real fast",
      "text": "The grass is beautiful but it is real fine and it dies immediately when the son hits it... I am in the very hot East Texas",
      "rating": 3.0,
      "verified": true,
      "author": "Bunny",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "False advertising!!!",
      "text": "The bag stated centipede but when I spread it I noticed the seeds didn’t look right. I took some to Home Depot and they told me they were not centipede, it was cheap fescue!!! I’m so angry!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Not impressed with this Pennington product.",
      "text": "I’m not impressed with this Pennington product. We followed planting and nutrient directions carefully. In two months only about one third of the grass has come in.",
      "rating": 3.0,
      "verified": true,
      "author": "Nancy and Drew ",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Fast Delivery",
      "text": "Product arrived within 2 days. I've used this product in the past. Very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "David J. Irish Jr.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Very pleased with the growth of this grass seed",
      "text": "I have lots of shades areas. I planted the grass just before it rained, so it got well watered in, grew beautifully!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Dohanic",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "This product did not work water daily sun no sun partial sun it didn't matter.",
      "text": "This product did not work water daily sun no sun partial sun it didn't matter.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan K.",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Lawn care",
      "text": "Very disappointed in this product normally I love Pennington but the mulch turn to cement in the seed never spreader grew.",
      "rating": 2.0,
      "verified": true,
      "author": "jennifer",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Beautiful grass",
      "text": "This seed came up fast and is beautiful. Staying green with less water and hot dry days. I am filling in more bare spots.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Sparky",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Quick and Works",
      "text": "This product was somewhat pricing, but it works well for quick patching of holes in the lawn.",
      "rating": 5.0,
      "verified": true,
      "author": "Common Shopper",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Was not this impressed at all after reading so many ...",
      "text": "Was not this impressed at all after reading so many positive reviews. I will stick to the Scott's products that I have had success with!",
      "rating": 2.0,
      "verified": true,
      "author": "robynl",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "grows fast dies fast",
      "text": "You need to properly till the area you will be laying the seed on. The grass last about a week",
      "rating": 3.0,
      "verified": true,
      "author": "MaryKat",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Filled in the pet stained grass",
      "text": "Within two weeks the pet stained areas of the back yard were filled in",
      "rating": 5.0,
      "verified": true,
      "author": "B. Just",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "No grass come out",
      "text": "I received the product on April 17 and spread the seeds the same day. However, I have not seen grass come out yet. My father is very upset about this. We bought new organic topsoil and were waiting for the grass to grow. However, nothing comes out yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Lily Yin",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "great seed for shade!",
      "text": "planted this seed under a large maple tree with lots of shade. new grass grew great with this seed. would buy again and recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "J G",
      "helpful_votes": 2,
      "publication_date": 20180112
    },
    {
      "title": "Love it",
      "text": "Put this down over old parking place Popped up in 10 days in October Jan20t still green",
      "rating": 5.0,
      "verified": true,
      "author": "grassybranch",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Lawn Looks Great",
      "text": "Bought this seed to over-seed an existing lawn. Seed germinated quickly and now lawn looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "JimC",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Seeds never sprouted",
      "text": "This product did not sprout. I have used 2 different brands prior to trying this with excellent growth.",
      "rating": 1.0,
      "verified": true,
      "author": "BLGO346",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Seeds did not germinate",
      "text": "This product designed for full sun did not grow but many weeds did!!! Ground was cleared and peat moss spread over seeds Wstered twice a day gor a week and then once a dah as per instructions NO SEED GROWTH AT ALL.!!!! I would not advise purchase of this product Money wasted!",
      "rating": 1.0,
      "verified": true,
      "author": "janet herold",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Not Sue",
      "text": "Seeds didn't seem to work as well or quickly as previous seeds purchased. It is possible it is simply my inexperience.",
      "rating": 3.0,
      "verified": true,
      "author": "kellybook",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Good Product",
      "text": "Works every time I have used this brand. Within a few days, new grass.",
      "rating": 5.0,
      "verified": true,
      "author": "LOUIS NICOSIA",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Grass did not grow!",
      "text": "Grass did not grow. Very sparse after three weeks. Used a generous amount of seed and starter fertilizer and watered two to three times daily. I've used Pennington in the past with great results so I can't explain why this is so bad.",
      "rating": 1.0,
      "verified": true,
      "author": "mike salerno",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "You're more likely to get rocks to sprout.",
      "text": "Garbage seed. I tilled 60 bags of compost into a 1500 sqft area in the back yard, spread this seed and watered 2 times daily. 3 Weeks later I DON\"T HAVE ONE SINGLE BLADE of grass. I might as well have planted rocks.",
      "rating": 1.0,
      "verified": true,
      "author": "SMC",
      "helpful_votes": 2,
      "publication_date": 20180511
    },
    {
      "title": "Didn't Germinate as expected",
      "text": "Followed directions to the letter but less than half the seeds germinate.",
      "rating": 2.0,
      "verified": true,
      "author": "Benton Allen",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Never Grew",
      "text": "I used this product before purchased from other local retailers, with great results. This bag of seed seemed over dry and old when I spread it. Two weeks later, no sign of growth. I did everything correct.",
      "rating": 1.0,
      "verified": true,
      "author": "Freddy",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Does not germinate. Avoid.",
      "text": "Did not germinate at all. I thought I’d give this seed a try after using similar Scott’s seed for years After 2 months nothing has grown. I tried to get a refund from the mfg but didn’t keep the original bag. I’ll stick with Scotts seed",
      "rating": 1.0,
      "verified": true,
      "author": "David C.",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Pretty good growth",
      "text": "Used in early spring and now 2 months later pretty good growth. Will need another round next spring.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul F. Stevenson",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Grass seed grows as expected.",
      "text": "The 5% ryegrass really stands out (both in color and texture).",
      "rating": 4.0,
      "verified": true,
      "author": "LARRY C. BROWN",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "On time delivery no damage to the product. Product worked as described.",
      "text": "On time delivery no damage to the product. Product worked as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Jazz",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "No Grow Grass Seed",
      "text": "This seed has never sprouted...numerous areas with faithful watering....epic fail!!!",
      "rating": 1.0,
      "verified": true,
      "author": "GreenintheSwamp",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "... get thick on its own so far not so good. For the money it probably wasn't worth it",
      "text": "It germinated however I'm waiting to see if it will get thick on its own so far not so good. For the money it probably wasn't worth it. Do you have a better quality that will last.?",
      "rating": 3.0,
      "verified": true,
      "author": "Randy Kuhl",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Grass did NOT grow..",
      "text": "Well, waited for grass to grow but it didn't. Disappointed. Wasted time and money.",
      "rating": 3.0,
      "verified": true,
      "author": "indygirlinnc",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Goid",
      "text": "Works great if you put it really thick on the ground",
      "rating": 5.0,
      "verified": true,
      "author": "Rita snider",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Green lawn",
      "text": "Added this to base of top soil in a very sunny area and its growing great. Make sure you follow the directions and keep it very moist",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 3,
      "publication_date": 20160815
    },
    {
      "title": "Easiest, most reliable grass seed on the market!",
      "text": "Best grass seed you can buy! It comes up without fail time after time. You don’t need to fuss or have a green thumb, just sprinkle, water and watch it grow.",
      "rating": 5.0,
      "verified": true,
      "author": "l daniels",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "grew where others didn't",
      "text": "I started growing in a week or so, and has filled in nice",
      "rating": 5.0,
      "verified": true,
      "author": "Donald C.",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "but I am good about watering",
      "text": "Didn't work as well as the turf builder I got at Lowe's. Wouldn't buy again. I live in Utah. It is hot and dry, but I am good about watering.",
      "rating": 2.0,
      "verified": true,
      "author": "PHILIP L WORMDAHL",
      "helpful_votes": 3,
      "publication_date": 20160817
    },
    {
      "title": "Horrible",
      "text": "This stuff sucks. It grows alright at first, but is extremely thin grass and dies really easily.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Z. Thompson",
      "helpful_votes": 7,
      "publication_date": 20160830
    },
    {
      "title": "Excellent.",
      "text": "Always have good luck with rheir seeds. Only kind i buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene W Ahlfors",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Didn’t grow",
      "text": "Not one seed germinated. Bought some of the deep shade seeds the same time and they germinated great???",
      "rating": 1.0,
      "verified": true,
      "author": "KER",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Loved this product",
      "text": "Loved this product. Once it started to grow in it really grew. Took longer than I anticipated. First time around I didn't lay any soil and it didn't grow. Second go, I put some top soil over the seed and then added more on top. Watered 2-3 times a day for about 10 min and within 10 days I had sprouts and 10 after that a nice green lush.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Blanco",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "20 % sprouted",
      "text": "Only about 20 % sprouted after following directions as on bag",
      "rating": 2.0,
      "verified": true,
      "author": "J. Snow",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "grass seed",
      "text": "Expected much better results with following their directions. Much work little growth.",
      "rating": 2.0,
      "verified": true,
      "author": "Craig P Stephens",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Did not grow at all!",
      "text": "This seeds did not grow at all. Followed instructions and more. I should have checked my bag to see if it was expired. Terrible product!",
      "rating": 1.0,
      "verified": true,
      "author": "Sepideh Tarighati",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Totally Useless",
      "text": "Ordered this grass seed and followed the instructions to the letter. Planted in fertile soil. Not one single sprout. Complete waste of your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Simplicity",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "It won't disappoint.",
      "text": "Filled in spectacularly. Don't forget to lightly mulch with hay and water regularly. It won't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Ann",
      "helpful_votes": 2,
      "publication_date": 20161125
    },
    {
      "title": "Not recommend",
      "text": "After 3 bags its a no go for me. I love my lawn and care for it well. I bout this to filling some spots and reseed. i basically wasted allot of time, water & money",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Sorry no grass",
      "text": "I used a full bag 18 days ago and yet to see one single blade of grass. Requested a full refund. This does not grow.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura M.",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "This stuff took maybe A week or so then beautiful sharp blades of green grass poked through the cursed ...",
      "text": "Finally a grass seed that worked! All other types of seed were growing weeds and ugly crab grass. This stuff took maybe A week or so then beautiful sharp blades of green grass poked through the cursed patch in my front yard. Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris P",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "This grass is a beautiful green. It grows well in both sun and ...",
      "text": "This grass is a beautiful green. It grows well in both sun and shade. Make sure you water it a lot, especially when first planting it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer ",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Great seed",
      "text": "Great seed, started seeing blades of grass within a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise P",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Easy to grow",
      "text": "I live in N Florida and this worked! Even sprouted in sand areas.",
      "rating": 5.0,
      "verified": true,
      "author": "CCofMemphis",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "overseeded in Sept and watered 2x daily for 30 days ...",
      "text": "overseeded in Sept and watered 2x daily for 30 days - everything sprouted as expected - a new lawn for $30!",
      "rating": 5.0,
      "verified": true,
      "author": "Thurman Munson",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Misleading",
      "text": "The advertisement says it covers 3330 sq feet. when I got the package it only covers 2330 sq feet so I had to go to True Value and buy another bag.",
      "rating": 1.0,
      "verified": true,
      "author": "Ed Hardesty",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Five Stars",
      "text": "Best seed I have found yet. Always sprouts and grows.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Pfaff",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "BAD SEED !!!",
      "text": "Must have shipped me some old seed. Had about a ten percent germination rate. I had done half of the area with Scott's and it has done very well. I gave Pennington's the same care and watering. Unfortunately, it was a waste of money. Off to Home Depot to buy more Scott's. Don't be fooled by this one.",
      "rating": 1.0,
      "verified": true,
      "author": "John Bulger",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "do not need credit for  Pennington grass seed",
      "text": "we found the 3rd bag of grass seed so we do not a credit. thank you bob zane",
      "rating": 1.0,
      "verified": true,
      "author": "robert zane",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Junk",
      "text": "Not one grass seed grew n this isn’t my first time playing hours that’s for sure",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "How the seed worked",
      "text": "Great product t lee grass cane up quick and thick.",
      "rating": 5.0,
      "verified": true,
      "author": "dukes",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Horrible",
      "text": "It created a feather like substance in the bag. There were several of theses substances in the bag. Disgusting",
      "rating": 1.0,
      "verified": true,
      "author": "Elise",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Worked great",
      "text": "Most of the seeds sprouted in 8 days, good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Jensen",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Great seed!",
      "text": "Very good seed have had a lot of success with it, this is my 2nd time purchasing it.",
      "rating": 4.0,
      "verified": true,
      "author": "Gloomgirl",
      "helpful_votes": 2,
      "publication_date": 20160409
    },
    {
      "title": "Bare Spot",
      "text": "Worked well. I started it with soil in a bucket a week before I put in the bare spot. Then I watered twice a day. It has worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Ability to grow a good grass",
      "text": "This is an excellent product. Works just like they purport. Sun or shade",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Fenters",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Too early to tell.",
      "text": "Great seed, waiting for it to grow, but it was great price and easy to get straight to my door.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn E. Rudie",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Four Stars",
      "text": "easy to use. will have to wait for several months to see how effective it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard D. Hardy",
      "helpful_votes": 0,
      "publication_date": 20160723
    },
    {
      "title": "What seed?",
      "text": "Ordered two bags and both were punctured, with most of the seed spilled out in the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam E.",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Horrible grass seed",
      "text": "I got almost no grass out of this bag of seed.",
      "rating": 1.0,
      "verified": true,
      "author": "stallion",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Not a blade of grass.",
      "text": "This was the worst grass seed ever. Nothing but weeds and not a blade of grass, and my Gardner can back me up. Do not BUY unless you want to start all over again.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Michau",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great seed to start in fall weather",
      "text": "Great grass seed. Germinated & grew as expected and I watered only once a day rather than twice a day as I should have.",
      "rating": 5.0,
      "verified": true,
      "author": "BearKAH",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Looks great.",
      "text": "The grass grew and filled in where I needed it. That was why I bought the product, and it did what I wanted. Looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Sawblade",
      "helpful_votes": 0,
      "publication_date": 20160505
    }
  ],
  "product_meta": {
    "title": "Pennington Smart Sun and Shade Grass Seed, 7 Pounds",
    "description": "Size:7 PoundsWhen your lawn runs the gamut from full sun to moderate shade, you need grass that can produce a thick, beautiful lawn despite variable light levels. Pennington Smart Seed Sun & Shade contains a mix of superior cool-season grasses, selected especially for your growing region, that will thrive where lawn areas receive full sun or as little as four hours of sun per day. Backed by years of breeding and research, the premium grass varieties in this versatile mix have earned the Smart Seed label. Selected for outstanding drought, heat and disease tolerance, these water-conserving grasses require up to 30 percent less water than ordinary grasses once they're established in your lawn. With Pennington Smart Seed Sun & Shade, your seed also benefits from Penkoted seed technology, which protects seed and ensures healthier, better plant growth. You'll enjoy a thick, fine-bladed, rich green lawn in sunny areas and in shade.",
    "rating": 4,
    "feature_bullets": [
      "Uses up to 30% less water versus ordinary grass seed",
      "Grass establishes quickly",
      "Contains grass seed varieties that thrive in both sun and shade",
      "Produces a thick, fine bladed, dark blue-green lawn",
      "Very good drought tolerance",
      "Good disease and insect resistance",
      "Pennington’s exclusive Penkoted technology protects the seed from deadly fungus",
      "This 7 lb. package covers up to 3,330 square feet"
    ],
    "specifications": {
      "Product Dimensions": "18.5 x 7.5 x 5 inches",
      "Item Weight": "7 pounds",
      "Manufacturer": "Pennington",
      "ASIN": "B004QB0AHC",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "Item model number": "Smart Seed",
      "Customer Reviews": "4.0 out of 5 stars645 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#3,844 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Plants, Seeds & Bulbs",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Gardening & Lawn Care",
      "Grasses"
    ],
    "price": 28.48
  }
}