{
  "website_summaries": [
    {
      "verdict": "Budget friendly protection that provides great support.",
      "pros": [
        "Comfortable even when worn during exercise, and provides outstanding basic support"
      ],
      "cons": [
        "Runs small",
        "Difficult to take off because it fits so snugly onto your knee"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cost saving Product changes ruined the brace",
      "text": "So this is my second order of what I believed to be a perfect brace, and I got ripped off on the new model. They have added extra stitching around the hinges, but the reduced the amount of velcro on the top and bottom straps so you cannot get the same fit you had before, so if you wanted a tighter fit as I needed in my case, the brace doesn't stay secure and slides down my leg. So now I just lost time and money, because I can't return it. There should have been a notice that the model was changed this significantly that it affects the overall wear. Another cost saving measure gone wrong. Really disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 193,
      "publication_date": 20180217
    },
    {
      "title": "Sizing chart highly misleading - won't let me return - Prime Member but supposedly not able to return to Amazon",
      "text": "The sizing chart is quite misleading. As sizing is based on knee circumference; those with bigger/muscular thighs and calves will simply not be able to adhere to the chart and must move up one size (at least). I viewed Amazon's return policy and cannot understand why I cannot exchange this for a larger size. It's never been used other than to quickly try on. You are best off going to your local sports store where you can touch and feel the product. Beware.",
      "rating": 1.0,
      "verified": true,
      "author": "dean tassone",
      "helpful_votes": 93,
      "publication_date": 20170529
    },
    {
      "title": "Here is the size chart",
      "text": "The product works great, the biggest issue all of the reiews have is that it's missing a sizing chart. So here is the chart taken directly from the box: Measure 2 inches below your knee cap S = 12.25\" - 13.25\" M = 13\" - 14\" L = 13.75\" - 14.75\" XL = 14.5\" - 15.5\" XXL = 15.25\" - 16.25\" The reason you measure the top of your calf is because that's the narrowest part of the brace and you want to make sure the brace will fit over and comfortably of your calf.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 869,
      "publication_date": 20130508
    },
    {
      "title": "WASTE OF MONEY",
      "text": "DO NOT BUY NO REFUNDS AND THE MEASUREMENTS GIVE ARE TOO SMALL",
      "rating": 1.0,
      "verified": true,
      "author": "Blue Ox",
      "helpful_votes": 28,
      "publication_date": 20170408
    },
    {
      "title": "DO NOT BUY - IT STINKS LITERALLY",
      "text": "Do not buy this model. I had purchased an 872 and it was a little small so decided to purchase the 875 in the next larger size. I have worn the 872 for a couple of months. It had NO smell at all. When I received this one, it really really smells of a vinyl / rubber smell, enough to make you sick. I mean it REALLY SMELLS! I have had it in the sun - I've had it in front of a fan - I've even had it on the patio. The smell just won't go away. It's like it wasn't fully cured or something. TERRIBLE!! I have had it for a month and the smell is still there.",
      "rating": 1.0,
      "verified": true,
      "author": "Santa Fe Cowboy",
      "helpful_votes": 11,
      "publication_date": 20180910
    },
    {
      "title": "SHOCK DOCTOR 875 FAILS AFTER 10 WEEKS OF USE",
      "text": "This item was delivered on December 30, 2017. Initially the fit and performance was excellent thus my previous 5 star rating. However, after 10 weeks of use I cannot keep the brace on my knee. Often without any prior notice the brace slides down around my ankle. It makes no difference of how tight I adjust it, it just fails. I strongly feel that I should get more than 10 weeks service from a knee brace. I am very dissatisified.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Finnegan",
      "helpful_votes": 43,
      "publication_date": 20170311
    },
    {
      "title": "WAY TO SMALL and AMAZON will NOT let me RETURN it.",
      "text": "I measured my knee/leg as instructed in the description/size chart photos and the brace is WAY too SMALL. It will not even go over my calf, now amazon is saying I cannot return it -- 4 other items that came in the same box are eligible for return (yes I checked), so WHY NOT THIS ONE????",
      "rating": 1.0,
      "verified": true,
      "author": "APRIL",
      "helpful_votes": 14,
      "publication_date": 20171130
    },
    {
      "title": "This is the brace for you",
      "text": "I tore my ACL and meniscus about eight years ago. I am very active in sport that requires lots of quick bursts and lateral movement (pickleball). I have tried several braces for support and to alleviate the pain afterwards. This brace is the best! Being one piece it may be the hardest to get on and off, but is well worth the effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick M.",
      "helpful_votes": 10,
      "publication_date": 20170428
    },
    {
      "title": "Low Quality,",
      "text": "I bought this brace 5 days ago after a car accident. Doctor believes my meniscus is torn which didnt show up on the MRI, which isnt uncommon. After reading countless reviews about quality I was a little worried. The first day I noticed some stretching marks in the knee area. I finally decided to look at the entire brace, I noticed stitching coming undone, a hole in the knee, tearing of the padding. Theres no quality with this brace.",
      "rating": 2.0,
      "verified": true,
      "author": "Anthonyb97",
      "helpful_votes": 3,
      "publication_date": 20200329
    },
    {
      "title": "Not worth the price and fit way too small",
      "text": "I was looking for a knee brace for snowboarding. This looked like a good knee brace based on the description. When I received the knee brace, it was extremely small even after I used the sizing method described. You definitely want to order at LEAST a size larger if not more. Based on the price and fit of this knee brace, I returned it and went to Sports Authority and bought a really nice McDavid knee brace. Save yourself the headache and go to your local sporting good store and find a McDavid knee brace.",
      "rating": 1.0,
      "verified": true,
      "author": "WallaceWalcox",
      "helpful_votes": 20,
      "publication_date": 20150319
    },
    {
      "title": "Wanted to love it",
      "text": "I collect knee braces (or at least it seems I do). I had high hopes that this would be my go to. Sadly, this one was WAY too small. I bought a size up, but have large calves as I am pretty fit. The metal bit into my calves, PAINFUL! Based on reviews, I was hoping it would stretch, no such luck. Skip the sleeves, wrap around braces are much more versatile and comfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "Ella",
      "helpful_votes": 12,
      "publication_date": 20170614
    },
    {
      "title": "Money well spent - highly recommended",
      "text": "I have a ruptured mcl and thanks to this brace I can walk, it provides excellent support. I'm knocking a star due to sizing. I followed the manufacturer recommendation about ordering next size up and it turned out to b too big. My advise to anyone buying this brace is to make sure you measure as directed and then order the actual size recommended and do not go up to next size. I did and had to exchange for the correct size.",
      "rating": 4.0,
      "verified": true,
      "author": "John (Rusty)",
      "helpful_votes": 3,
      "publication_date": 20190530
    },
    {
      "title": "May have just been bad luck, but it definitely does not live up ...",
      "text": "My boyfriend is getting to that age where he's got achy knees and in an attempt to be proactive bought this brace to provide extra support while playing basketball. This previous weekend he tore his ACL while playing light basketball with friends while wearing this, despite having no previous history of serious knee issues. May have just been bad luck, but it definitely does not live up to the advertisement as \"specially\" for ACL and PCL issues. After his surgery we'll find another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenn L.",
      "helpful_votes": 8,
      "publication_date": 20180130
    },
    {
      "title": "Noticed an improvement right away. Never want to take them off.",
      "text": "This knee brace is perfect for my needs. It’s very comfortable and provides great support for my knees. I noticed a difference right away. I’m on my feet all day and walk about 12 miles a day. Before the brace, my knees would be in terrible pain by the end of the day. After using the brace, I had barely any noticeable pain at all. My knees felt so good with the braces on, I wanted to take off in a sprint, and jump over stuff. I didn’t, lol, but I felt like I could.",
      "rating": 5.0,
      "verified": true,
      "author": "RRG",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Helped me rehab a torn meniscus",
      "text": "This was a good product and helped me rehab a torn meniscus that happened while playing hockey. I'm 6'2\" and 185 lbs, I got the XL but wish I got the L. The XL was serviceable, but I had it on the farthest tightening setting it could go to. Despite that, it stabilized my knee very well and prevented twisting or over-extending while I let my knee rest. It is comfortable and didn't bother me after full work days wearing it.",
      "rating": 5.0,
      "verified": true,
      "author": "SirFrankoman",
      "helpful_votes": 3,
      "publication_date": 20181113
    },
    {
      "title": "Excellent product",
      "text": "A little pricy but it is well worth the money spent. Had meniscus surgery on my knee that, in my estimation was about 90% effective leaving me with lingering discomfort. Tried several lesser wrap expensive braces none really worked. This one eliminated all discomfort, stopped the buckling sound emitted from my knee experienced before the surgery and after it. Provided additional stability without any discomfort. So impressed I bought several so when this one ultimately fails, as all mechanical thing will do, I shall have a ready replacement. Money well spent though I have found the sizing ran a little smaller than the tag indicated.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan D. Montgomery",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "great",
      "text": "Had a nagging knee injury. Never went to the doctor. You know, the usual for stubborn people. Anyways, i started wearing this thing while driving longer distances, or sitting while i did work. Those were the times i had the worst knee pain, throbbing, stiffness, achyness, etc. All that went away with this. I wore it fairly consistent for over a month and now i don't feel pain or discomfort in my knee without the brace. I'm not going to say it healed me but that wouldn't be too far from the truth. Time will truly tell if the injury is gone gone, but for now i'd say it's really close.",
      "rating": 5.0,
      "verified": true,
      "author": "Do the things",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Excellent brace, worth the money and well made!",
      "text": "Great brace, I injured my knee in a training evolution. This brace is top-notch. I recommend going a size larger. The first brace I ordered was too tight on the bottom side of the brace. I returned it and reordered the next size up. I have worn this now for 4 months. 3 months before I had surgery and now 3 weeks after surgery. It can be quite difficult to get off after wearing all day. I am considering buying the next size up to reduce difficulty in removing. I found this brace offers substantial support and relief. My injury Posterior Medial horn meniscus tear with Medial and Lateral ligament strain. ACL and PCL stretching.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Good for around the house",
      "text": "I have been wearing it for a week now and it fits snug. I thought the straps at the top and bottom would hold the brace in place but it didn't. The brace kept slipping down and the only way to get it back up was to grab the two bottom metal stays and pull up. When pulled up that would roll the top material inward and cause discomfort. I still like the brace but it could use a couple of pull up loops on the top.",
      "rating": 3.0,
      "verified": true,
      "author": "TooSassy1",
      "helpful_votes": 6,
      "publication_date": 20170315
    },
    {
      "title": "A lifesaver",
      "text": "I don't know what I would have done without this brace. Good support & stability, with some modification. Where I needed to fasten the velcro is right where they place a loop, so I had to cut the loop off which means the strap has to be fastened in order to stay were it is supposed to be. It is a bit big and I did measure and select the recommended size. Also has rubbed a raw spot on side of my leg. Some fraying along edges and stitching coming loose, which kind of surprises me as I haven't had it long.",
      "rating": 3.0,
      "verified": true,
      "author": "Rochelle Wing",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Elastic on the back of the brace has stretched",
      "text": "I have been wearing this brace on and off for 5 weeks now. I was really impressed by how much support it gave my knee. But now the elastic on the back of the brace has stretched I can't keep it tight. The brace slips down my leg. I'm disappointed that it wore out so fast.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Pal",
      "helpful_votes": 2,
      "publication_date": 20191113
    },
    {
      "title": "It worked but I am glad I am out of it",
      "text": "This is a nice brace for an over the counter brand. Pros: good fit, adjustable straps and velcro work good, good support medially and laterally and patellofemoral. Cons: slips a little (but you just have to readjust and tighten), really does not allow much flexion. More for someone with medial/lateral instability than patellofemoral issues---it is too restrictive for that. I did not play sports in it, but with the amount of flexion it allows, I would imagine that it would be uncomfortable. But for work and walking and being on your feet, it was comfortable enough. Definitely did not fit under pants well! It's either shorts or over leggings.",
      "rating": 4.0,
      "verified": true,
      "author": "R. M.",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Knee Pain Relief",
      "text": "The knee braces are a perfect fix. Their size chart is accurate so long as the customer measures their knee per the chart's instructions. I have two very bad knee from being a paratrooper. The braces stabilize the knees, reduce the pain level and gives me the confidence to use my knees harder working, helps the weakness in the knees, from the side to side movement. Even the pain is greatly reduced coming from behind the knee cap. Very good option from surgery. I now can walk better with lessen back pain that results from controlling my shaky knees.",
      "rating": 5.0,
      "verified": true,
      "author": "Smartdog57",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Good fit and very confortable",
      "text": "I bought these to wear skiing and they worked great. I didn't even notice them. I had one on each leg. Under my ski pants you really couldn't tell I was wearing them by looking and I really forgot all about them. They're kinda hard to take off. That's the one knock I might give them. I might pay more for something that was easier to take off but I'm not sure they even make anything like that. Anyway, these are really nice and they worked well for me while I was skiing.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Great for MCL tear",
      "text": "I got the for my 15 yr old son who tore his MCL in baseball. He uses it for playing football , and anytime he is doing a sport, or even at home passing. He works out in it , and it has given him great support. I researched these braces a lot. I wanted to get him the best brace, but not have to pay $200. I would recommend this brace for anyone that needs one. I plan on getting him the other ones as he will rely on less support in the future. You will not be disappointed with the brace. I measured his knee like they said , and it fits perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great overall brace",
      "text": "I hyperextended my knee playing soccer. I had a different brace and it just wasn't cutting it. This brace has ten time the support then my other brace. The X system going across the back keeps the metal brackets from shifting away from the sides of the knee. It is comfortable and very supportive. I can wear it while I run, sprint, move side to side, ride a resistance bike at the gym, and it doesn't bother me. It does take a bit of an effort to get it off a sweaty leg, but that's all neoprene for you. Overall a well made brace that got me back playing the sport I love.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 3,
      "publication_date": 20170216
    },
    {
      "title": "Relieves pressure!",
      "text": "I’ve had a torn meniscus for over a decade now. Injured it multiple times over the years. Needless to say my knee gives me some problems (pops out of place, seizes up, etc.) and some days it just hurts. I use this on days when my knee isn’t cooperating and it helps tremendously. It’s nice to give my knee a break every now and then and still be able to walk/do stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Bair",
      "helpful_votes": 2,
      "publication_date": 20190314
    },
    {
      "title": "VERY GOOD KNEE BRACE,  USED POST SKI INJURY.  REASONABLE PRICE.",
      "text": "Purchased size small for my wife; could not find locally in Sacramento area sporting goods stores. Save time...buy on line. Device worked well for supporting knee after ski injury with strains of ACL, PCL, and meniscus. Worn during exercise classes and yoga to support knee and restrict excessive lateral moves while knee is healing. Works good for walks. MD suggested getting a brace without specifying a brand. We tried some on, and had to go on-line to get the right size. Delivery and f/u from vendor was excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "SeniorSkier@72",
      "helpful_votes": 3,
      "publication_date": 20170430
    },
    {
      "title": "Good for short periods",
      "text": "I got this for a brace after dislocating my knee (again) about a month ago. It was great for awhile, bit it gets really itchy after a few hours. I ordered the proper size and still had some major movement issues. The hinges also don't stop at straight, which is more what I was looking for as I hyper extend. Helped a lot with compression and stability for a couple weeks before i started using a compression sleeve. I can't rely on braces of my muscles get to weak. I like it better than all the other velcro braces, but wish it was more breathable and the hinges stopped at straight.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Egbert",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Awesome Knee Brace!",
      "text": "Probably the best knee brace I've ever worn. Does an excellent job of taking stress off the knee joint. Wore it for 24 hours after minor MCL tear and knee is already feeling better. Sizing guidelines were 100% spot on (make sure you measure 2 inches below the knee, as indicated). I didn't find it that difficult to take on and off as some customers indicated (but I'm not a serious bodybuilder either). Huge improvement over basic knee braces you get at the pharmacy.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Kashyap",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Good product",
      "text": "This is a well made knee brace, especially if your knee is unstable. It is on the bulky side and doesn't fit well under pants. I have read several complaints from other who have purchased the brace regarding sizing for this product. However, I followed the instructions the maker provided and the size was right on. The material is good and keeps the knee nice and warm. The only complaint I have is that it pinches the back of the knee when sitting, forcing you to keep your leg out straight. That aside, this is a good, stable brace for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary D.",
      "helpful_votes": 2,
      "publication_date": 20171006
    },
    {
      "title": "What a great product but sizing seems on the small size",
      "text": "This brace is tight. If you are between two sizes choose the larger. But wow does it work. took away my wife's pain. She takes it off during work it starts to hurt again immediately.. Can definitely tell it is working and well worth the money. the tightness does take some getting use to but if you you are having problems wearing it a whole day i recommend using it the last half of your day and going without the brace the first half of the day till you are comfortable enough to wear it longer",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Sherman",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "comfortable, effective and hard to get off",
      "text": "I'm using the brace while my knee is recovering. mainly I play racquetball with it where there is a lot of movement in flexing. I've had no issue with any rash or pinching. Does not feel like it inhibits any natural movement. It's hard to say it is highly effective in protecting against any undesired twists or movement. I don't really feel it while awareness which is a good thing. The only drawback, maybe not a real drawback because it seems to work, is that it is somewhat difficult to get off.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Lee",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Fits nicely under Hockey shin pads, 100% stability restored!",
      "text": "I bought this because the DonJ** equivalent was sold out everywhere. I have a previous MCL and medial meniscus injury which has left me with joint instability. I wear this under my shin pads while playing ice hockey in an adult league and couldn't be happier. It fits fine and is completely unnoticeable in both feel and appearance. I found the fit to be a bit snug, but comfortable. I followed the recommended measuring procedure and ordered what was recommended. I wouldn't think twice now in buying another brace from Shock Doctor. I feel 100% stable while playing now.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Shearman",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Not well made. Hurts and became unwearable after two weeks",
      "text": "Rubbed my inner thigh raw. I had to wear a protective sleeve inside to stop it from giving me blisters. After about two weeks the inner brace warped and now hurts too much to wear. It did help the short time I wore it but it warped and now is useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Happy snapper",
      "helpful_votes": 4,
      "publication_date": 20180120
    },
    {
      "title": "No more knee pain",
      "text": "This is an amazing knee brace and exactly what I wanted. I’ve had knee surgery before (over 15 years ago) and I just started running again and my knee was killing me, I ordered this and my knee no longer hurts when running. The stability of this is amazing, to me it’s not super hot which I was surprised about. Not hard to get on and once it’s on it’s on, never once slipped off. Doesn’t allow much movement but to me that’s a good thing bc it’s made for stability and support. It is a bit bulky but that is the only con for me",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Boudreaux",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Sizes Run Small",
      "text": "This is a very good brace. The sizes run small and you need to order one size larger than what the size chart tells you need. I have used the Meuller Hinged Patella Knee Brace for years. They cost about half the price of these and are just as good and much more convient to use (putting them on and off). They are a open brace verses a closed one piece of the Shock Docter. I've been using the Shock Doctor Brace for about 2 weeks now and find it as good as the Mueller but the costs are double the Mueller. I would order it again if needed.",
      "rating": 4.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "Great value and support",
      "text": "This is an excellent durable, inexpensive, highly supportive and well-fitting brace that permits adequate range of motion for sports. The size chart is accurate and the brace should slide on snugly. It felt tight and a little awkward for a few minutes and then became comfortable and secure while engaging in activities. Cheaper ones will not provide as much support and stability, but may be appropriate for some people. This brace matches the quality and function of much more expensive medical ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Meh...",
      "text": "I already had mcdavid knee braces but i was looking for a backup pair so i don't have to wash as frequently. I decided to try out a different brand. I suppose these are allright but doesn't feel as tight around the kneecap area which is what i want for more support. Another problem with these is that they squeeeeeeeeeek. The slightest movement sets them off to the point it was driving me nuts. Im going to order another pair of mcdavids and keep these as my tertiary.",
      "rating": 3.0,
      "verified": true,
      "author": "RobTheGamer",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Lacked what I needed",
      "text": "The brace seemed to be constructed well enough however, it just did not provide the support I was trying to find in this style of brace. It fit well, but just didn't seem to have the structural support. Once returned, I thought it took a little long (several weeks) to get notice of my refund. However, that was just the acknowlegment that they planned to give it to me, as I have yet to actually receive it (10/18/2020).",
      "rating": 3.0,
      "verified": true,
      "author": "GT500",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great support!",
      "text": "I order 2 different sizes because I was unsure which size for my daughter. She measured on the high end of the Xl but low end of XXl. She is very athletic. Xl seems a little to in calf area so it definitely takes work to pull on but the XXL goes on slightly easier just wish the velcro on the thigh strap was longer because then the xxl would have been perfect but I am also dealing with a picky teenager. But we are a week into basketball practice and have been wearing the xxl and it has definitely helped and kept her knee supported!",
      "rating": 5.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Knee Brace",
      "text": "I bought this knee brace May 22nd 2020. I really liked it due to it holds the knee in place & give support along with range of motion. The only down fall is around the thigh of the leg,once you stretch it out there is no more velcro for it to stick too. I wish there was extra velcro that way I could get it tighter around the thigh area. It was worth the money when I first bought it. I am still wearing it although I have run out of velcro , I have had to slip the end under the strap part to keep it in place.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Sturdy construction- but tight for an X/L",
      "text": "Price was great, rubber neoprene and plastic construction should last at least average. Lighter than expected, not as much support as expected from the look and design and features- enough for me. Excellent support for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "DCF",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Great quality just runs a bit small",
      "text": "I read the reviews and knew this ran small but my leg measured 13\" exactly so I purchased the medium. I'm exchanging for the large because it's so tight which would provide excellent support but I feel like I can barely move in it and it's pushing into my partially torn MCL. Maybe if I didn't have this pain the size would work but I'm really thinking it's just on the small side like others have mentioned. Excellent quality though so I'm excited to get the large size as an exchange.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawna Jaramillo",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Best hinged brace on Amazon!!!",
      "text": "Sizing was accurate and not an issue for me as stated in other reviews. I’m 5’5 and 145lbs and the small fit perfectly! You definitely want this to be tighter vs looser. I snapped my ACL in half and used this brace for 4 weeks leading up to my ACL reconstruction surgery. I bought 5 different hinged knee braces (orthopedic surgeon suggested I wear before surgery for stability) and this by far provided the most stability and allowed me to walk. I am post surgery now and once I’m out of my doc prescribed ROM brace I’ll go back to using this daily while I continue to strengthen my knee. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "C.Smith",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Good Quality, Durable, worth the price",
      "text": "Bought this for my dad sz. L, he’s about 6’2 and has pretty thick legs & fit him good &was able to adjust it no problem, has a tear in his knee, had it for 1 month so far, holding up well, no tears/rips/shredding, really good quality, said it feels like his knee is supported good. Got this for him because the one the doctor gave was garbage. Better of ordering this than being charged for a lower quality one by a doctor.",
      "rating": 5.0,
      "verified": true,
      "author": "tina",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Easy to put on and comfortable",
      "text": "I really like this brace it helps me walk more secure. It will probably squeak I have one for outside and one for going out. It is easy to put on but like any other ‘prostheses’ it’s intrusive they all are. Let’s face it it’s available to aid your walk",
      "rating": 5.0,
      "verified": true,
      "author": "grammasgr82day",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Extremely supportive and flexible while moving",
      "text": "Love this brace. I’ve used a few knee braces in the past and nothing compares to this. I have fluid in my knee and it’s also unstable and this works wonders. I’ve worn it every day, 12+ a day when I’m not icing it and it works so well. I walked up the stairs without it, almost forgetting it wasn’t on and felt the pain I don’t feel while wearing this. The pain isn’t gone 100%, but the stability and support helps so much, that the pain is lessened TREMENDOUSLY.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Vaughn",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "feel apart in a week",
      "text": "the stitching started coming apart within a week...contacted the seller and they gave me a phone number to call were I got no return call....goes on easy but sooooo hard to get off it's frustrating...I would never recommend this brace to anyone",
      "rating": 1.0,
      "verified": true,
      "author": "Wayne Schimpf",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "I beat this thing up and it kept my knee stable and usable.",
      "text": "I'm not a review writer, but I felt compelled to write one for this product. I was diagnosed with a meniscus tear and partial ACL tear 2 weeks before leaving for a high mountain Elk hunt in Montana. I was devastated. I ordered this brace and hoped for the best. After 10 days of 10-15mile treks in the highlands, I am beyond satisfied with this product. My only criticism would be that it left the back of my leg sore and rubbed open, but with the miles I put on, that is to be expected. My knee was never once in danger of slipping or giving out. Thank you for saving my once in a lifetime experience! Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Taryn M.",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Excellent replacement for the piece of trash I got from the Ortho Dr.",
      "text": "First thing I wanted to do was try it on for fit. Everyone measures differently so I took the advice of many and ordered one size larger and ended up with a perfect fit and it is not loose at all. Secondly I replaced a brace which cost four times as much and was not comfortable and didn't feel good while golfing during the swing therefore making tender areas above and below the knee. Tried this brace on and now have worn it for 6 hours using the clubs like one would on the course and this brace is a blessing to my leg. Couldn't have made a better choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Molsonice",
      "helpful_votes": 4,
      "publication_date": 20160220
    },
    {
      "title": "amazing product",
      "text": "This brace is amazing!!! would have paid double for it, allows me to work with an injured knee with no worries of doing more damage. I work construction have to climb scaffold and ladders all the time, with this brace its no problem. I suggest wearing something between your skin and brace to protect your skin, other than that its a life saver. I rarely write reviews but wanted to write one for this life saving product!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Smith",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Poorly made. The thread unravels, and the brace rips apart",
      "text": "The knee brace is great. It works great. It feels great. It was true to size. I ignored the reviews about the thread unraveling, but the exact same thing happened to me. On the 2nd day, the thread started unraveling. Before one week of wearing it, the whole right side had come unthreaded. I loved this knee brace. It worked great for me, as far as stability but it just doesn't hold up. I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Hausauer",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Could Have Been Better",
      "text": "Was really looking forward to getting the knee braces (2) in today, and get some support with my bad knees. Unfortunately the Velcro style (loop and hook) straps above the knees do not connect very well. When pulling the strap tight enough for support, the hook end goes beyond the loop part of the strap, and doesn't tighten down. If they would just add another 3-4 inches of hook to the strap it would fix it. Not a good design of the straps in my opinion. 2.5 stars out of 5 for me.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Holliday",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Lives up to the hype as best knee brace",
      "text": "Product lives up to the hype. Recovering from a meniscus tear, I got this in the mail and tried it on. Felt a little uncomfortable at first. Range of motion is excellent and product is durable. Upon doing some light activities i noticed that the added support from the brace gave me tremendous strength and stability in my leg. As crazy as it sounds, just by putting on this brace i am jumping much higher and making aggressive cuts on the field with no irritation to my knee. Money well spent",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Beninson",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "I don’t love it, for the price.",
      "text": "I am 4 weeks post op from an ACL/meniscus repair and looking for something smaller than the straight leg brace i was given post-op. I find this to be small, tight and heavy. Despite being tight around the knee cap, I feel like I’m pulling it up all day.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle Krueger",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "A good brace but not a great brace",
      "text": "This is a good brace but it's design keeps it from being a great brace. It is a sleeve design rather than a strap around design. So you can't get a good of a fit as the ones that split in the back and then wrap around. I like the Disuppo one better because of this fit/design issue. This one works but is harder to get on and not as adjustable. This one will work, but you can do better for your money.",
      "rating": 4.0,
      "verified": true,
      "author": "Bernard Hunt",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "A good upgrade from using a compression-only knee supporter",
      "text": "My measurement (2 inches below the center of the patella) was 15.25 inches circumference. The XL size fit that perfectly - the hinges are held tight against the side of my knee, and it provides good support for playing volleyball. I bought this to upgrade from just a compression supporter - with just a compression supporter, I would still be limping around for a couple of days after playing. But with this hinged supporter, I am moving around much better after playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl N.",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Unbelievable support",
      "text": "I got this to support my knee while I was recovering from what I thought was a moderate MCL sprain. Using it in conjunction with a basic slip-on compression sleeve, I walked 30+ miles over the course of a week or so before my ortho appointment (just to be sure). Turned out that I had a COMPLETE ACL rupture, an LCL tear, and a minor meniscal tear. Surgeon thought it was a miracle that I didn't completely ruin the meniscus. I credit this brace. I intend to use it, post recovery, to protect the other knee while using a medical functional brace on the surgical knee. Great brace.",
      "rating": 5.0,
      "verified": true,
      "author": "Owen J. McPhillips",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Does not prevent hyperextension",
      "text": "I'm coming off a fairly severe hyperextension knee injury and I'm looking for support in rehab and future intensive sports activities. Even on first inspection trying on this brace I can, with certainty, suggest that it will not prevent future hyperextensions. I have hyper mobile knee joints and can push this brace beyond what would be deemed a normal range of motion backwards despite the \"support hinges.\" Be advised if that's what you're needing in a brace—you won't find it here.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Arnold",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Uncomfortable and no refund permitted",
      "text": "I spent a lot of time attempting to adjust this brace to make it comfortable with not success. Unfortunately, I was not able to use it. I attempted to return the item with in a week of receiving it and discovered the company would not refund the unused product. Learn from my mistake -- buy another brace for comfort and ability to return it if it is not right for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob D.",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "This brace helped keep my knee from popping back out!",
      "text": "This brace has been a super great purchase! I fell early in August down steps, sprained both ankles and popped my left knee out. OMG! So much pain. This brace is so comfortable that I have not taken it off unless I’m taking a shower. It’s the reason I can walk around on my knee! Thank goodness for this thing. Without it on, it hurts still, so much without controlling how I use my knee. I had tried a different one that did nothing but make my knee hurt worse and helped me not at all to keep it from dislocating/popping back out and control the extension of my leg.",
      "rating": 5.0,
      "verified": true,
      "author": "S.H.",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Be careful ordering the size you need",
      "text": "It's very confusing to order the right size, but worth it if you get it right. First thing is the sizes are out of order in the drop down size menu (small, medium large, XX-large, X-large). Two inches below my kneecap I am 15.25 inches. I ordered the X-large but wonder if the large might have offered a better fit. It is of good quality and offers good support.",
      "rating": 4.0,
      "verified": true,
      "author": "MarcusG",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Rewriting my review",
      "text": "I originally rated these braces at 5 stars. But after wearing them for a month I have changed my mind, my initial was a bit premature. These braces will not stay in place. No matter how tight I sinch up the straps, the braces will not stay in place, they constantly slide down, thus rendering the braces worthless. Do yourself and your pocketbook a favor and do not buy these braces.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger Thompson",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Wrap your knee in a tank!",
      "text": "You could not ask more from this knee brace. It has the same features and protection as a $300 unit. I have no fear of activity while wearing this device. It is well made and comfortable to wear. Like all braces you will take a day to get used to it. If you measure correctly it should be tight when first put on. Your knee is swollen. If you buy one that is comfortable to wear when first injured it will be loose after the swelling goes down. So buy it tight and it will work well for you. Could not give this race a higher recommendation.",
      "rating": 5.0,
      "verified": true,
      "author": "Alxcla",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Item unreturnable???",
      "text": "Item fit very small for the sizing chart given. The item was intended to slip on from the foot, but the bottom of the item wouldn't fit over my calf muscle. I measured per the description instructions, and ordered accordingly; but it still wouldn't fit. When trying to return item I was told that the item was unreturnable. Despite the item not fitting as hoped, the product itself seemed to be a durable item. The fit, the application, and the return were the only issues that I had with the product. I still don't understand why the product is unreturnable?",
      "rating": 2.0,
      "verified": true,
      "author": "Spence McConnell",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "This is the best!",
      "text": "I feel very secure downhill skiing again! The brace supports my knee, and I don’t have any issues skiing, nor do I have pain afterwards. I have borrowed multiple different braces from friends to try on, and this one was the only one that felt like it would hold my knee together. I have also done my research that recommended this product for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Inka",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Pain free with this brace!",
      "text": "I have tried several other knee braces and they didnt give my knee the support it needed. I needed side to side support and this brace does it! I can go up and down small sets of steps with no pain and walk with almost a normal gate again. I was afraid it was going to feel really heavy and bulky but it doesnt. Im so happy to be walking pain free again!",
      "rating": 5.0,
      "verified": true,
      "author": "MaggieP",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Pefect fit and more.",
      "text": "16\" is my knee size, I order the XX-Large. Perfect fit and it works well! I hope it can last a while but you get what you pay for as they say. Sorry no pictures or video review because of this issue:",
      "rating": 5.0,
      "verified": true,
      "author": "RJC",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Great support",
      "text": "I have a meniscus tear and this gives me enough support when I go golfing. Only problem is it’s tough to put on and off because you wear it like a sleeve. I can’t bend all the way down because my knee won’t flex. I need help but otherwise without it, I wouldn’t be able to play golf since my tear hurts with every lateral movement.",
      "rating": 5.0,
      "verified": true,
      "author": "C. K. Cho",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Support was what I was looking to get.",
      "text": "I recently injured my knee and I needed something that could provide support and allow me to move around. This knee brace was easy to put on and once it was in place I felt relieved in my knee. This didn't remove the pain but provided support because I sprained my MCL. Great product and well constructed. I would recommend this to anyone that is looking to support the knee, MCL & ACL. Great Product",
      "rating": 5.0,
      "verified": true,
      "author": "Todd M Hunt",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Returned it",
      "text": "I measured my leg/knee and it did not fit accordingly. I have had 4 knee surgeries and a broken leg in my life so I have had and do have many knee braces. Been wearing them since I was 15. I did not like this one. It was to small on my calf and too big on my thigh. And not user friendly anyways. Do yourself a favor buy a zamst. The zamst ZK-X. Is comparable as far as support. But a much better product and fits as expected. It is my favorite knee brace and I have tried many.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Thornton",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "YOU CAN'T RETURN!!!!!!!!!",
      "text": "THE CHEMICAL SMELL OF THIS BRACES IS OVERWHELMING. MY SON SMELLED IT FROM ACROSS THE ROOM. AFTER HAVING IT ON FOR A COUPLE OF HOURS, MY FEET AND TOES STARTED TINGLING, LOSING CIRCULATION AND I ORDERED A COUPLE OF SIZES UP. I TRIED TO RETURN THIS, BUT IT WAS DENIED. I MESSAGED SHOCKDOCTOR AND THEY SAID THEY COULDN'T DO ANYTHING BECAUSE IT WAS SOLD THROUGH AMAZON. SO I WASTED $50 ON SOMETHING THAT WAS NOT STATED YOU COULDN'T RETURN. THIS IS MY FIRST EVER REVIEW ON ANYTHING AND I AM 36 YEARS OLD.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendell L",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "This is my second one of these. Lasted years.",
      "text": "I used my first one for jiu-jitsu training. I have had 7 surgeries on my right leg and this provides great support and stops lateral flexing of the knee. I was impressed with how long the first one held up. I washed it in the shower or sink mostly, but tossed it in the washer once in a while as well. It is a little bulky, but that's just the trade off when you go to a more aggressive and supportive brace. This second one has a slightly different look, but overall is the same and working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Smith",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Instant Relief",
      "text": "Appears to be very well made. As soon as I slid it on and adjusted Velcro straps and stood up the relief was awesome. The knee pain was gone. There is an initial odor, but it is from the brand new neoprene, just like when I put on a new wetsuit. The odor from the neoprene goes away. So far a really am enjoying this brace.",
      "rating": 5.0,
      "verified": true,
      "author": "HFL",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Shock Dr. Metal Knee Brace",
      "text": "This is truly a durable product. It is sturdy in all it constructive glory. I have a knee injury from a military fall & this product really is a great bargain for such a cost effective & quality metal knee brace. I ordered 2.",
      "rating": 5.0,
      "verified": true,
      "author": "“G-Eye Joe”",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Extended my time on the court",
      "text": "Been playing basketball forever. I came down on another players foot one day and twisted my knee. Weeks after lateral movements hurt after playing 30 minutes. I tried softer braces without side support but they weren't much help. With this brace I can stay on the court for hours. Nothing hurts and it is very comfortable. I've had the same brace for 3 years now. Been through several washes and still is holding strong with no deterioration. I have had to change one of the pieces of Velcro recently as it wasn't staying put while playing. My only very small gripe is you can hear it squeaking sometimes. Barely noticeable but it's there.",
      "rating": 5.0,
      "verified": true,
      "author": "Contrarian_runner",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "This relieved the pain of walking and climbing stairs",
      "text": "I've worn many different styles of knee braces over the past 40 years or so. Most stated a lot, but never seemed to work as advertised. This brace does work as advertised. It eased the pain associated with walking and climbing stairs and didn't sweat like so many other neoprene wraps do. The metal stays on the sides actually work, not like those flimsy wire ropes on some models",
      "rating": 5.0,
      "verified": true,
      "author": "Lab Rat",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "buy at an actual retailer, not online or Amazon",
      "text": "Nice and stable product but does not allow returns only exchanges. I bought the large but it was tight in the calf area, got the XL size but it was too big. There are no sizes in between. I will keep the tight one and return the large one instead. But do not buy these online or at Amazon. Get one at a retailer and fit it first before purchasing.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "Order one size larger than you think.",
      "text": "First one I ordered size wise was a LG. Had to send it back as I couldn’t get it up my leg, very small. I ordered the extralarge and it fit perfectly. I would order it again but I feel this will last me until I have knee surgery. Range of motion is great and has enough support I feel safe with. Chris",
      "rating": 5.0,
      "verified": true,
      "author": "Topguncg",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great Product",
      "text": "I wore it most of the day today out of the box. At expected, straight out of the box it's a bit stuff. However, after a few hours of wear, it had settled-in nicely. I am currently using the hinges because I need the extra support. The size guidance matched perfectly. Measure yourself as they say and all will be well. The only questions I have is how well this will last over time. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerald Cumbus",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "they are build for Chinese size legs, that are small people, take two sizes more",
      "text": "I took the measurement of my knee as the instruction said, and I took the advice to take the greatest measure if my measurement was in the top range of measures, however I almost did not enter, have very small measures, as if it were Chinese size, you should take 2 more measures of your measurement real size M, L, XL, if you look to be M, you better order XL, however it is very well built, it is good quality, only they are build for Chinese size legs, that are small people.",
      "rating": 4.0,
      "verified": true,
      "author": "Victor Santamaria Abrego",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Happy with purchase",
      "text": "I bought this after I injured my right knee. I sprained my MCL after a fall. This brace fit exactly as expected and provided a lot of support that was needed. My ortho even liked the product and had my continue using as needed for healing. Would highly recommend. Comfortable and easy to put on. Somewhat bulky, but that’s expected with the amount of support.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Perdue",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Knee much better now.",
      "text": "I had a knee replacement in 2015. The knee has been giving me trouble but I don't want to go thru the replacement again!! After several weeks of pain and misery and several other braces, my wife bought me this one. I love it! Highly recommend it to others. I wore it for long periods of time at first and now only a short while each day.",
      "rating": 5.0,
      "verified": true,
      "author": "caroline kurz",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Great fit and keeps your knee in place.",
      "text": "I messed up my knee playing indoor soccer 2 years ago. I have a loose ACL that gets tweaked and sometimes collapses when planting my foot to take a shot. This past fall I really wanted to play for my colleges soccer team. I decided to go with this brace after reading multiple reviews and I have to say I agree. This is a VERY tight fit, I wore a small and it really kept my knee in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca W.",
      "helpful_votes": 8,
      "publication_date": 20150209
    },
    {
      "title": "Freedom to Move",
      "text": "I have a drunken knee that goes which ever way the wind blows, and I had stopped doing much physical activity that requires bearing weight on that knee. Even the neoprene sleeve could not support an aggressive sudden move. My chiropractor recommended this brand to me, and it has given me back my active lifestyle. The lateral support gives me confidence, and the hinges allow me to sit in a complete crouch. Yay!",
      "rating": 5.0,
      "verified": true,
      "author": "silky",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Great soccer brace for my “knee with opportunity”",
      "text": "As a soccer addict with two ACL reconstructions on the same knee, and still playing, this brace is a dream come true. I’ve only used it once so far, but couldn’t be happier!! It was snug and felt like everything was secure. The only minor thing is the rubbing in new places my skin has to get used to. It will definitely get abused by me, so I will update if it doesn’t survive long.",
      "rating": 5.0,
      "verified": true,
      "author": "R.S.",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great product so far",
      "text": "I bought this for my son. He had suffered a knee injury during a football game. After a bit of recovery he was able to play again while wearing this brace. I’m going to order a second one . The plan is to have him wear them as a preventative measure. He plays center and DRT . Definitely trying to save those knees.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Barnes",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Knee brace",
      "text": "I reviewed a lot of different braces. This is the one I chose. It worked well. I did as suggested and got a size smaller that what my measurement said and I think that helped make it more accurate of a fit. After about 2 months is was becoming more loose and hard to keep up with too much movement.",
      "rating": 4.0,
      "verified": true,
      "author": "flash",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Fantastic!!",
      "text": "I have a torn ACL, MCL and miniscus. This brace works superbly to provide the stability I need. It also allows for enough range of motion that it is easy to work out with it on. One of the best braces out there. It seemed to run true to size also.",
      "rating": 5.0,
      "verified": true,
      "author": "violet",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Comfortable",
      "text": "I have had many knee supports and most of them were very uncomfortable. I bought the first one for my brother after he had an accident and he was very impressed with it. I have knee issues to which I already have a bracelet. After he told me about this one I decided to find out on my own. And guess what, is great. Is very comfortable while still providing support. I used to hate when the back of the knee kept pinching my skin, this one don't. I highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel A Sanabria",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Go Hard!!! You want to...",
      "text": "After having suffered an ACL graft long ago. I decided to give myself a little break, sorry about that joke 😜 Now I can enjoy board sports without being worried about another unexpected landing. I bought two, and I'm stoked with how much less knee work has to be done when I'm riding like I stole it 🤩",
      "rating": 5.0,
      "verified": true,
      "author": "You need one...",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "UPDATE: Stitching coming apart, Velcro bad, label irritates",
      "text": "I’d like to give it four or five stars but after just a few months the stitching around the knee has come undone. It’s comfortable and gives good support though. UPDATE: the Velcro no longer works properly after a couple of years. For this price I expect better. UPDATE 2: I (foolishly) bought a second one. They’ve added a rubber label to the inside, that won’t come off. It gives me a terrible rash and a large bump under my skin, that sticks around for more than a week.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Nandor",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "This Brace Works!",
      "text": "I injured my knee about 6 months and have had constant misalignment since. I won't go into the wordy details but my knee would slide out of joint with each step. I put this on about 24 hours ago and I'm truly amazed by how well this thing works! My knee feels supported and stabilized, but still has just enough movement to carefully function without pain. I should say that I am not someone who writes reviews, but this thing is a game changer. Money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Amazing !!!",
      "text": "This is the 4th knee brace I have ever bought in my lifetime and the first 3 were a waste of money. Cause a knee brace only works if you wear it! This knee brace company was the first 1 I have since that gave me instruction on how to measure to make sure I bought 1 that would fit. I met the mailman at the door and opened it and put it on ... and 6 hrs later it's still on, and still feels Great !!! Finally, money well spent !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Kreckman",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Helps with sprained knee",
      "text": "This work well for me as I am recovering from a knee sprain. It definitely helps align my knee when I am walking around the house. I’m 5’6 and 130 lbs and got a medium. I don’t think a small would have fit. Already, I can’t get the bottom Velcro to stick together.",
      "rating": 5.0,
      "verified": true,
      "author": "teasetarte",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Works Well. Stinks Dangerously.",
      "text": "This by far the best knee brace for controlling hyperextension I ever tried. However it is very stinky. The smell is not just offensive but caused me to have neck and head aches. I wrap a big tea towel around my knee, cover that in plastic, then the brace. It works very well but requires a looooong period of outgasing.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Hibbard",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "EXCELLENT PRODUCT WHEN MISFORTUNE STRIKES",
      "text": "If you have the misfortune of damaging your knee, this is an excellent brace at a reasonable price. With a home full of competitive athletes, we have been breaking bones and tearing ligaments and tendons for decades. We have purchased many types of wraps, support garments and braces from various name-brand manufacturers. The Shock Doctor appears to us to be: (1) the best manufacturing quality, (2) the best materials and (3) the most reasonably priced knee brace that we have ever purchased. We highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "norcalmkf",
      "helpful_votes": 0,
      "publication_date": 20170411
    },
    {
      "title": "Purchased new brace, received well worn brace",
      "text": "I paid full price for a new brace and received a brace with signs of significant use. Functionally it works, but I would not have paid new pricing for this item. Unfortunately this is needed due to an ACL injury and I can't waste another week waiting for a new replacement to arrive.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "UNCOMFORTABLE",
      "text": "I purchased this as well as a $229 Don Joy brace and ended up using the Don Joy instead. The hinge on this one drove straight into the side of my leg and no matter how I moved it I couldn't get it to be comfortable. I decided that my comfort and confidence in my brace to protect my leg was most important. Spring for the more expensive once and you'll never have to replace it.",
      "rating": 3.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 0,
      "publication_date": 20200127
    }
  ],
  "product_meta": {
    "title": "Hinged Knee Brace: Shock Doctor Maximum Support Compression Knee Brace - for ACL/PCL Injuries, Patella Support, Sprains, Hypertension and More for Men and Women",
    "description": "Shock Doctor, a leader in sports protection. Hardcore protection, fearless performance. Bilateral support hinges for stability and increased performance.",
    "rating": 4.3,
    "feature_bullets": [
      "PREVENTS AND PROTECTS - Helps prevent and heal medial and lateral instability, minor patella instability, meniscus injuries, minor ligament sprains, hypertension, arthritis, and more",
      "MOISTURE AND ODOR PREVENTION - Antimicrobial and airflow vented tech to reduce odor, bacteria, and moisture, so you can stay comfortable through the toughest days and workouts",
      "BOOST MOVEMENT AND COMFORT - Heavy duty bilateral dual hinges provide support while allowing you to move comfortably with four-way stretch Lycra mesh and pre-curved anatomical design, fits left and right knee.",
      "PREMIUM MATERIALS - Latex-free, premium stitching, and integrated flexible side stabilizers, stays in place and includes easy grip tabs for accurate fitting.",
      "LIFTS AND COMPRESSES - Compression supports soft tissue, joint alignment and relief, and boosts therapeutic heat for improved blood flow which aids in healing tendon and muscle",
      "Premium stitching assembly, patella support finishing and spandex [elastane] binding for long lasting comfort.Note: Kindly refer “how to measure” video included before purchase",
      "Kindly refer the sizing image before buying this product. This product is not a substitute for medical care. Always seek professional medical advice for the diagnosis and treatment of pain, injury or irritation.",
      "This product is intended to be close-fitting for the best protection so it may fit small. If your measurements are close to the maximum size range, we recommend sizing up for comfort. Sizing will vary."
    ],
    "specifications": {
      "Item model number": "875",
      "Department": "Mens",
      "Date First Available": "November 17, 2009",
      "Manufacturer": "Shock Doctor",
      "ASIN": "B0875TKRV1",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Braces, Splints & Supports",
      "Medical Supplies & Equipment",
      "Sports & Outdoors",
      "Knee Braces",
      "Health & Household",
      "Leg & Foot Supports"
    ],
    "price": 44.73
  }
}