{
  "website_summaries": [
    {
      "verdict": "A strong and high-quality option for shore or bank fishing.",
      "pros": [
        "Requires no assembly",
        "Sturdy  and durable steel construction",
        "Lightweight holder is easy to carry and store",
        "Holds two poles (three in a pinch)",
        "Inserts into soft banks or along shores easily"
      ],
      "cons": [
        "Rods just lean against the holder arms, which may be a problem when large fish take your bait",
        "May need to use bungee cords or straps to better secure the poles",
        "Holder is a little difficult to push into hard ground"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Value - Big Clumsy",
      "text": "These products arrived as Christmas presents to our three boys (bought 3). Incredible value and heavy gauge for the price. The only reason for 4 versus 5 stars is that they are large and a bit heavy to move around. While this would typically be a good thing, their size and weight make them a little less likely to drag along each time you go fishing. Don't let this deter you from these if not a concern, because the quality/value is excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Consumer",
      "helpful_votes": 8,
      "publication_date": 20170118
    },
    {
      "title": "The right holder for me!",
      "text": "I love this rod holder! It is strong, durable, and just the right height. I used a pipe wrench to slightly straighten the middle prongs to hold a 3rd rod securely.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Preston",
      "helpful_votes": 12,
      "publication_date": 20171023
    },
    {
      "title": "More than just a bank fishing double rod stand if you do as I do. Please read....",
      "text": "These are by far the best fishing rod stands I’ve ever used. With two as I’ve have for a few years before buying this new one, I set up two of these and am able to rest my poles of nearly any typical length parallel to the ground and water just like this much more expensive European carp style bank rod rack costing at least $60. Here’s a photo of two of these holders in use as I’ve described.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal",
      "helpful_votes": 2,
      "publication_date": 20181215
    },
    {
      "title": "Not that great",
      "text": "It’s ok. Broke on me after only a dozen uses or so. The welds broke on bottom. Plus nothing holds the bottom of your rod, so the minute u get a bite your whole pole flies up and over leaving u to chase it down to catch it and your fish.",
      "rating": 2.0,
      "verified": true,
      "author": "Brandon Vardeman",
      "helpful_votes": 2,
      "publication_date": 20181218
    },
    {
      "title": "Great holder, one flaw",
      "text": "I took this fishing today and hooked a large channel catfish. I didn’t have a bell on the rod, and wasn’t paying attention. When the fish grabbed the bait and swam off, it nearly took my rod and reel with it! The design of the holder is great, sturdy, and handy to use. But if you a bite on a large aggressive fish, this thing acts like the fulcrum on a teeter totter and your rod may go for a swim! I recommend figuring out a simple way to further secure your rod and reel when using this holder. Otherwise, it’s a great buy!",
      "rating": 4.0,
      "verified": true,
      "author": "J. T. Top Contributor: Woodworking",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "I absolutely love this rod holder",
      "text": "I absolutely love this rod holder! It's fantastic when going catfish or carp fishing where you often wait for some action. Very high quality and easy to put into the ground. Highly recommend for shore fishing.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 7,
      "publication_date": 20170716
    },
    {
      "title": "Sure beats using a V-shaped stick by a long shot!",
      "text": "I plan on getting a lot of use with my new holder. In fact, I just went out yesterday and bought a 2nd rod & reel!",
      "rating": 5.0,
      "verified": true,
      "author": "jim steele sr.",
      "helpful_votes": 4,
      "publication_date": 20180317
    },
    {
      "title": "Been using for 1 year now",
      "text": "I have been using it for a year or so now. Buying another one today. This second one will be used for baiting and setting up other poles while my older one holds the poles in the water. Kids coming of age so more poles to work with. PS. Not sure how someone said this broke on him in another comment. It's sturdy as can be. We fish for the big ones too! Biggest one got away though.",
      "rating": 5.0,
      "verified": true,
      "author": "Right Stuff",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Holds fishing pole very well.",
      "text": "Holds poles well, at the right height. Mig welded solid assembly. Hard to push/force bottom prongs into soil ( depends IF rocky, clay or sand ). I used a hammer & an 80 penny nail per spike hole. Worked nicely. Used lantern shield. 5-A product. Recommend !",
      "rating": 5.0,
      "verified": true,
      "author": "T.  P.  S.                ••••• 😁 ((  RetiredWelder  )) 😁 •••••",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Very sturdy!",
      "text": "I bought this for my husband and he loves it. It's very sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "The item name says it all!",
      "text": "I really like this pole stand. It is just the right height and I can actually say my pole isn't going to go anywhere if I'm not paying attention. Great item!",
      "rating": 5.0,
      "verified": true,
      "author": "kiml",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Greatest thing since sliced bread!!",
      "text": "Bought two of these years ago from Cabela. I left both laying at the river and lost them, they don't carry them anymore. Glad I found them on Amazon!! Greatest thing since sliced bread for bank fishing!! Pic was a few years ago with the original set.",
      "rating": 5.0,
      "verified": true,
      "author": "HiTech Redneck",
      "helpful_votes": 5,
      "publication_date": 20170414
    },
    {
      "title": "Great Quality",
      "text": "This rod holder is amazing. It is very strong and has a nice grippy feeling to it. Definitely recommend this product. Can hold up to 3 rods.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnV",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Five Stars",
      "text": "push them in the dirt and there you are, pole holders. works very well",
      "rating": 5.0,
      "verified": true,
      "author": "C.R.H.",
      "helpful_votes": 2,
      "publication_date": 20170919
    },
    {
      "title": "Great invention",
      "text": "This is a great product, it holds two poles and sets up easily. Any bank fisherman would be pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "John Steinbeck \"Lee\"",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Get before they are gone..",
      "text": "Very well build and sturdy. i am sure this will last a long time. will do an exceleent job for serious bank fishing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Exactly what I wanted",
      "text": "This is nicely made. It is advertised as a two pole holder, but is easily used with three.",
      "rating": 5.0,
      "verified": true,
      "author": "P. D. McGuire",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Pretty decent.",
      "text": "Received on time and well packaged. Appears strong and suitable enough for use on river and banks that aren't too rocky. Will put to the test soon and update.",
      "rating": 5.0,
      "verified": true,
      "author": "John C. Harvey",
      "helpful_votes": 2,
      "publication_date": 20170329
    },
    {
      "title": "Rod holder for 2 rods",
      "text": "Very sturdy. A little odd to carry but serves purpose fine",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph Clemmons",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Perfecto.",
      "text": "I drilled a couple holes in my pier and set it in there. It is awesome. Saves a lot of bending over.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Marquardt",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Great find!",
      "text": "Bought this as a Father's Day gift and my husband really loves it. I was on the fence about spending 20$ but even he said it was well worth the price. Very stable, holds rods even with aggressive bites, easy to set hooks. Well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Dalton",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Over priced, but does a good job",
      "text": "Does a good job at what it is designed to do, but only got 4 stars because it is over priced.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa R. Russell",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Sturdy and works great",
      "text": "This worked great. Was able to use 3 poles due to the top tabs location.",
      "rating": 5.0,
      "verified": true,
      "author": "GW COF",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Five Stars",
      "text": "great product, so much easier than finding a stick that will actually work, particularly with hard/rocky banks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Love it",
      "text": "Love it, i had a 30 pound gar on my pole and this rod holder took it like a champ",
      "rating": 5.0,
      "verified": true,
      "author": "jonathan",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Five Stars",
      "text": "Great product, well built, durable. Not very compact but well worth the bulk if you have room.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Machamer",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "easy to use",
      "text": "fast shipping but sorry I purchased so quick found the same thing for cheaper on another site.",
      "rating": 5.0,
      "verified": true,
      "author": "John Dobbins",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Helps see the action.",
      "text": "Really gets the rods off of the ground where you can better see the hitting action of the fish. Best I've seen and used.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Four Stars",
      "text": "Be near to get rods. Otherwise u might lose one to a big fish",
      "rating": 4.0,
      "verified": true,
      "author": "LollyGags",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Scratched everywhere",
      "text": "This was a gift for my boyfriends birthday. This quality doesn’t seem accurate for the price. All of the areas colored in yellow were scratched in some way. Not sure if that was due to transit issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber Edwards",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "It’s worth buying.",
      "text": "Overall I’m really happy with this rod holder; I wish it was about 6 inches wider but it’s great to use at pay lakes or over crowded fishing spots.",
      "rating": 5.0,
      "verified": true,
      "author": "Donnie Bulmer",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "They are great",
      "text": "This is my 3rd one but 1 got stolen on me I love them they have save a couple poles too! everyone I've come across has asked me where I bought it",
      "rating": 5.0,
      "verified": true,
      "author": "Smith",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Five Stars",
      "text": "Works great. Very well made. Would recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Greatest thing since sliced bread",
      "text": "I'm new to fishing and have lost a rod and reel to a fish dragging it into the water. This holds the rod in place and will prevent a repeat of my unfortunate accident.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Best fishing pole holder ever!",
      "text": "I have used several fishing pole holders over the years but this was the best one by far!",
      "rating": 5.0,
      "verified": true,
      "author": "Cutshall",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Five Stars",
      "text": "excellent been looking for a rod holder like this for years",
      "rating": 5.0,
      "verified": true,
      "author": "bruce jake perry",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Love the holder",
      "text": "Love the holder. Better than other rod holders that stick individually into the ground. Planning on re-ordering more for Father's Day.",
      "rating": 5.0,
      "verified": true,
      "author": "Gwen Mitchell",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "It's solid don't have to worry about being broken.",
      "text": "Good piece to have when you go fishing. Don't have to worry about laying it down anywhere. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janjeffjones9499",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Great product",
      "text": "Don't have to worry about my rods getting taken into the water. Any fisherman has seen or had that happen once in there lives.",
      "rating": 5.0,
      "verified": true,
      "author": "jose f.",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Had the basement a little wider so my foot could get through more easily and it was a little more substantial in that ...",
      "text": "*Christine's husband here* I used it on several fishing trips and it worked well. What's keeping it from five stars is it's a little difficult in hard ground to push it in. Had the basement a little wider so my foot could get through more easily and it was a little more substantial in that area so that I wasn't concerned about breaking the weld, which did not happen, I would have given it a five-star rating. Overall I am happy with the purchase",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Great",
      "text": "Works really well for me own two will be buying two more for friend",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Schultz",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Great for fishing from bank",
      "text": "Great for bank fishing. Seem sturdy. Easy to move if needed. You can easily put three rods on these the way they are made.",
      "rating": 5.0,
      "verified": true,
      "author": "kindlelover",
      "helpful_votes": 0,
      "publication_date": 20190515
    }
  ],
  "product_meta": {
    "title": "RITE-HITE Bank Fishing Dual-Rod Holder - Holds Two Fishing Rods and Reels at The Optimum Angle. Great for Bank Fishing on Lakes and Streams",
    "rating": 4.6,
    "feature_bullets": [
      "Great for Bank Fishing, Lakes, Ponds and Streams",
      "Secure 2 Rods & Reels and a Lantern for Night Fishing",
      "Sturdy Steel Construction and a Rust Proof Powder-Coated Finish Ensures You'll Be Using it for Many Season To Come",
      "Soft Cushioned Cradles to Protect your Rods Finish. Stores Flat for Easy Transport and Storage"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "35 x 20 x 0.7 inches; 2.4 Pounds",
      "Date First Available": "October 5, 2014",
      "Manufacturer": "R.M. Industries",
      "ASIN": "B005IUPJ1C",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Fishing",
      "Sports & Outdoors",
      "Rod & Reel Storage & Accessories",
      "Sports & Fitness",
      "Rod Holders",
      "Hunting & Fishing"
    ],
    "price": 31.88
  }
}