{
  "website_summaries": [
    {
      "verdict": "Pocket is the easiest, fastest Android tool for clipping Web content for offline consumption, on a variety of devices and platforms. Also handy for taking stock of items you come across online.",
      "pros": [
        "Gorgeous, minimalist interface",
        "Fast",
        "Light"
      ],
      "cons": [
        "No offline video consumption",
        "Not as ubiquitous as Instapaper",
        "Syncing can be slow"
      ],
      "aspects": {},
      "publication_date": 20120430,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "All works as it should",
      "text": "Excellent app, and it works! Once I figured where to click to save a webpage to Pocket (the ... icon in the top right of any Silk page, and then the \"Send to\" option), it's quick and easy to save pages. Gives a cleaner read than the Silk's Reading View which often saves ads as well and doesn't deal well with sites using frames and popups, as well as making stuff available to other devices. Works offline, too, though obviously the Kindle with the app open needs to be connected to the internet for long enough to download new pages, which took a few seconds to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Jones",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "A good idea that doesn't work offline.",
      "text": "I understood and want what this app promises, but alas it doesn't delivery. Before you read this offline you need to contact to the internet to get the c content you saved, which makes sense. But what doesn't make sense is connecting to the internet again for the same content you checked would be available offline before you disconnected the WiFi. Defeats the point of reading offline if you need to go online to reload it. Apart from that flaw it looks good, just what you might like to read offline material if it worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Thompson",
      "helpful_votes": 4,
      "publication_date": 20140131
    },
    {
      "title": "Pocket is simply perfect",
      "text": "You can save articles - anything in fact - for reading later. The content is saved in a format for easy reading but you can go back to the original at any time. It is quick and easy to use. Syncs straight away across devices. Very clear to read on the screen and you can organise what you've saved in a way that suits you. You can share what you've saved if you want to. I agree with all the other 5* reviews. I have only just started using this App but understand why millions of people use it. I LOVE it. It's brilliant and it's free.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverley",
      "helpful_votes": 2,
      "publication_date": 20140616
    },
    {
      "title": "Love this app!",
      "text": "What a very useful app! I use it constantly when I'm on Twitter to collect articles to read later, or that I want to keep to show someone. I also collect recipes to try out. It automatically shows the best view of a page, either a reading view or a copy of the web page, bur you can toggle between the two. Don't know how I ever managed without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Trillian",
      "helpful_votes": 3,
      "publication_date": 20130911
    },
    {
      "title": "BRILLIANT XXXXX",
      "text": "Who ever gives bad reviews on this Great app for Archiving searches are Crazy,Being Using this for Many many Years,When I loaded Get-Pocket on fire 7,I was so @mazed that it Worked Fantastically Well,I use on PC & Transfered Straight to fire is Brilliant ,Thx Pocket Team for inventing this App,x",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth Chapman",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "I cam across this after choosing a more inferior but ...",
      "text": "I cam across this after choosing a more inferior but similar product. I also have Evernote installed on my Kindle and computer, but I have found myself just using Pocket all the time. In fact I'm going to their website now to look up for paid features as I have just realisied how much I actually use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Flanagan",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Pocket in a snippet",
      "text": "Pocket is an awesome app, I personally have never had a problem with this app but I do know of someone who has pocket and lost all there saved articles when pocket uploaded a new update, Thankfully that wasn't me although he was gutted and I can understand why.",
      "rating": 4.0,
      "verified": true,
      "author": "Lexie",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Easy to use",
      "text": "This is a very good app. As I normally read my Kindle Fire on the train with no wifi connections, this app enables me to catch up on articles online which I saved for later. Articles are saved in the \"reading mode\" with no adverts etc in the way. I like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Pixies",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "Good app for storing webpages for future reference",
      "text": "Excellent app for storing webpages minus unnecessary clutter on them Syncs with the Pocket app on other devices and operating systems.",
      "rating": 5.0,
      "verified": true,
      "author": "M. F. Cayley",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Actually useful app",
      "text": "If you have a Kobo e reader then pocket is a dream. I save all the best online articles (plus the pocket article recommendation algorithms are spot on) for reading later. Now on my phone: I can devour a mass of interesting, and well written, literature on my commute. Much better than the metro / other add-supported papers! This is an app that I actually use.",
      "rating": 5.0,
      "verified": true,
      "author": "otto_von",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "Me and this app? We're old friends",
      "text": "It's great to see Pocket on the Kindle Fire. I've been using it for a long time on my phone and it works well. It's basically a dump for stuff you find online but don't have time to read. It's not fancy, but does the job. Looking forward to using it on the Kindle Fire.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave Bannerman",
      "helpful_votes": 2,
      "publication_date": 20130724
    },
    {
      "title": "Nothing to not like",
      "text": "This application does exactly what it's supposed to do. It makes it easy to keep web material to read offline, synchronised across all your devices. It can often provide a better reading experience than the original website.",
      "rating": 5.0,
      "verified": true,
      "author": "C. J. Tyler",
      "helpful_votes": 2,
      "publication_date": 20130416
    },
    {
      "title": "Very useful",
      "text": "I'm applying for University this year, and needed to make sure I had some maps and any info I might need to refer to for my interviews. Decided to download this. Very handy if you're travelling I must say. Saves it as it is, and even gives a break down version. Honestly you can save a lot of things with it and it helps a lot. Helps to be able to save stuff in advance for when youhave no internet. Travelling and no internet connection use, VERY GOOD!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Hargreaves",
      "helpful_votes": 2,
      "publication_date": 20130312
    },
    {
      "title": "... a Doubt - This is Far and Away My Favourite App! Will Take Something Unbelievably Special to Surpass ...",
      "text": "Without a Doubt - This is Far and Away My Favourite App! Will Take Something Unbelievably Special to Surpass it! I do Not Have A Clue where i would Be Without It!! Magnificent!!",
      "rating": 5.0,
      "verified": true,
      "author": "Agnes Di Pesto",
      "helpful_votes": 0,
      "publication_date": 20150512
    },
    {
      "title": "works well on kindle fire",
      "text": "Properly written instructions make it easy to set up. I have downloaded several articles and it seems to work well. An improvement on Readability, which does not have the same level of options and explanations.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 2,
      "publication_date": 20130722
    },
    {
      "title": "Very useful",
      "text": "Great for storing and organising articles for later reading. Have used this throughout uni and afterwards. Good for organising recipes and patterns for later use.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Needs updates",
      "text": "I love pocket, but unfortunately the developers don't seem to update the app so there are a number of bugs in the app. This is unlike the app on IOS.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Excellent on Kindle Fire HD",
      "text": "An excellent way to store articles for reading later. I especially like being able to save articles from web sites viewed on my laptop, retrieving them for a better reading experience on the Kindle. Lots of options to control the reading view make this app ideal for my purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Jones",
      "helpful_votes": 0,
      "publication_date": 20130302
    },
    {
      "title": "One of my favourites app!!",
      "text": "One of the best apps in my opinion. Very convenient for keeping reading material safe and organised. It works well in multiple platforms as I use iOS, Android and Kindle fire devices.",
      "rating": 5.0,
      "verified": true,
      "author": "MR",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Good if you want to read but run out of",
      "text": "One of my most used apps. Good if you want to read but run out of data",
      "rating": 5.0,
      "verified": true,
      "author": "D. Peters",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "unimpressed",
      "text": "Didn't work. Would not open files after several attempts so I deleted it from Kindle. Worked fine on PC but I can't take that with me when travelling.",
      "rating": 1.0,
      "verified": true,
      "author": "Gringo",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "Everyone should have Pocket.",
      "text": "Absolutely brilliant app. Any web article, just save to Pocket, and read later.",
      "rating": 5.0,
      "verified": true,
      "author": "david eaton",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Pocket app.",
      "text": "An excellent app for finding guides on how to tackle many things, such as cooking, DIY, computer references. A useful item to have at hand on your iPad or android tablet.",
      "rating": 5.0,
      "verified": true,
      "author": "M H Burges",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "Easy to Read later",
      "text": "I use this with Flipboard and Tweetcaster. A quick tap and websites are put into an easy to read offline app whilst also syncing with my phone. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Del Perrin",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Awesome",
      "text": "Can't fault the app or the service Pocket provides. The viewing experience of offline content is great and the functions within the application are all intuitive and well laid out.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Morrison",
      "helpful_votes": 0,
      "publication_date": 20130608
    },
    {
      "title": "Don't bother!",
      "text": "This is the biggest waste of time I have come across so far, it may be better if it worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Great app",
      "text": "This is a brilliant app as it helps me to save lots of useful information from the web that I can read later.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "It is simply a great app to put all articles you want to read",
      "text": "I simply cannot live without Pocket. It is simply a great app to put all articles you want to read, but have little time at the moment.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia G.",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "All Good",
      "text": "Pocket is a brilliant service and I love that it's a cross-platform solution that I can use at work, on my home PC, on my phone and on my Kindle. The app is a very good implementation of the web service.",
      "rating": 5.0,
      "verified": true,
      "author": "Opinion",
      "helpful_votes": 0,
      "publication_date": 20131215
    },
    {
      "title": "Pocket highly recommended",
      "text": "Saves everything I want instead of leaving a site to read an article save it & read later saves going back to the site for every article Pocket syncs well with my computers,mobile & tablet.Easy to search & tag.Do not hesitate to recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140117
    },
    {
      "title": "Ok",
      "text": "Easy to download and use, no problems with it at all and it does what it says, would recommend to all.",
      "rating": 4.0,
      "verified": true,
      "author": "Debz",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Two Stars",
      "text": "Not thought out right and does not give enough information",
      "rating": 2.0,
      "verified": true,
      "author": "Adele Dominy",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "awsome.",
      "text": "A good app if you use just wifi, I find it very useful when it comes to book reviews because my memory is terrible.",
      "rating": 4.0,
      "verified": true,
      "author": "stephen bryan jones",
      "helpful_votes": 0,
      "publication_date": 20130330
    },
    {
      "title": "Does what it says on the tin.",
      "text": "A bit small on the Kindle but if you link it to other devises its a great addition to your Kindle.",
      "rating": 3.0,
      "verified": true,
      "author": "Neil Braim",
      "helpful_votes": 0,
      "publication_date": 20130628
    },
    {
      "title": "excellent product",
      "text": "A brilliant idea and well worth having, does just what it says on the tin. Great for saving a web page to be able to go over later.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Smith",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Save and Read Later.",
      "text": "Easy save facility and easy to navigate, am impressed with it,",
      "rating": 5.0,
      "verified": true,
      "author": "Rob G",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "Doesn't sign into Firefox account",
      "text": "Tried to sign in using my Firefox account but it keeps coming up with a \"Bad request\" message so I can't access anything. I'll probably uninstall it.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "love it",
      "text": "Very useful, especially surfing on pinterest I can open the article and later I can easily use/read it without the internet connection",
      "rating": 5.0,
      "verified": true,
      "author": "Ccgh",
      "helpful_votes": 5,
      "publication_date": 20130211
    },
    {
      "title": "Excellent App!",
      "text": "*** Pocket is a superb 'Read it Later' App. I simply love its interface. Its very polished. Highly recommended ***",
      "rating": 5.0,
      "verified": true,
      "author": "Tarkin",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "Not Kindle friendly.",
      "text": "Could not sign in. Kept on rejecting my user name and password. In the end I deleted the app from my Kindle.",
      "rating": 1.0,
      "verified": true,
      "author": "johnj",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Fab!",
      "text": "This is the best thing ever. My computer is so much faster now that I don't have 100 tabs open!",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy Berry",
      "helpful_votes": 0,
      "publication_date": 20130624
    },
    {
      "title": "Pocket, Firefox & Kindle Fire HD",
      "text": "I use the Firefox plug-in on my laptop, save anything interesting to Pocket. The read it on the Kindle in the evening. Pocket will either display saved content in easy read or switch to actual original web format with images...etc. A must for all Kindle Fire users.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Daws",
      "helpful_votes": 6,
      "publication_date": 20130316
    },
    {
      "title": "This is definately a ` must have` app",
      "text": "This is one of the best app I have. If use it all the time as I love to collect recipes Tec and this is just perfect for this purpose. It keeps everything in one place a place and best of all it is a free app!! So what are you waiting for. Try it for yourself, you will not regret it. :)",
      "rating": 5.0,
      "verified": true,
      "author": "BREE",
      "helpful_votes": 0,
      "publication_date": 20130930
    },
    {
      "title": "so useful",
      "text": "I installed this on my kindle fire & use it all the time to 'capture' web pages. I can then view them on my home PC or on my phone: so much more useful than remembering web pages. Great little app that will prove its real worth when I am on holiday as I have pocketed loads of useful info for easy access.",
      "rating": 5.0,
      "verified": true,
      "author": "Home project manager",
      "helpful_votes": 0,
      "publication_date": 20130810
    },
    {
      "title": "Brilliant idea!",
      "text": "I was looking for a means of synchronising my Bookmarks between my devises. But then I came across Pocket and it is a better idea and works very well. If you find something you would like to look at later, because you are busy, then just pop it into Pocket and it will be there when ever you are ready on any devise you have set up Pocket. Brilliant! What more can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Disappointed",
      "text": "I have a Kindle Fire hd and was excited about this (sad but true) .... in theory it's just what I was looking for ... in practise I put three things in my pocket and it stopped working. No good if it's not reliable. Fab opportunity wasted ... app deleted.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 10,
      "publication_date": 20130212
    },
    {
      "title": "Frustrating",
      "text": "Reworked well for a day and just what I wanted. Then evermore when trying to open get message \"Pocket has stopped OK\". Tried uninstall and install several times to no effect. Changed password and that let me in but next time - yep stopped again. Now deleted. Just auto response of no help from the Pocket people.",
      "rating": 1.0,
      "verified": true,
      "author": "davew53",
      "helpful_votes": 9,
      "publication_date": 20130209
    },
    {
      "title": "Poclet - A useful app to have",
      "text": "Very useful for storing articles to read later. Well worth downloading. And you can also get a version for your desktop.",
      "rating": 4.0,
      "verified": true,
      "author": "despb",
      "helpful_votes": 9,
      "publication_date": 20121210
    },
    {
      "title": "Pocket",
      "text": "I like to use this app because it allows me to quickly go through my RSS feeds anything I want to read later or don't have the time to read it at that time I save to my Pocket account. And transfering to using Pocket on my Kindle Tablet rather than my smartphone gives me a larger screen to read from.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Atkinson",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Take your news and web with you",
      "text": "Downloads web pages, twitter feeds, facebook etc for reading later Anything that can be shared if you choose it to gets sent to pocket by one touch. it then get formatted for easy reading taking out adverts etc Very good at what it does with many Customisable feeds",
      "rating": 4.0,
      "verified": true,
      "author": "Dennyboy",
      "helpful_votes": 33,
      "publication_date": 20121212
    },
    {
      "title": "Good app",
      "text": "Good app to use if surfing web and you don't have the time to read all of your topic of interest. As this app was prevoiusly known save it for later.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 26,
      "publication_date": 20121106
    },
    {
      "title": "Doesn't do what it claims",
      "text": "It claims to allow reading off-line. I've tried and not so. All it does is store on it's own servers links to what I've \"pocketed\". So, if I save the front page from today's Daily Telegraph and tomorrow want to read it, it just gives me that day's new version, not the one I thought I was storing. Not really a problem on a computer, but very important on my Kindle. Equally, I've tried stopping my wi-fi for \"off-line\" use, and Pocket becomes unavailable. Not a lot of help, whatsoever.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "A necessary app.",
      "text": "My favourite website content storage app. Integrates brilliantly with most browsers and apps (if I get an email with a link, it can be added in a jiff) and the app itself is easy to navigate. A side bonus is that I like the recommendations it gives me.",
      "rating": 5.0,
      "verified": true,
      "author": "Smileyjon",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Great App to Read Offline or Save Favorites",
      "text": "I originally got this app when I did not have internet so I could download articles to read later. It also has a feature where it can read them aloud while I am cooking, washing dishes, etc. You can set the speed and pitch of voice even though it sounds a little robotic. Now I mainly use it to save my all time favorite articles that I keep coming back to. Also useful if you want to read an article at work and not have a screen open full of clickbait ads, just open it in pocket instead.",
      "rating": 5.0,
      "verified": true,
      "author": "mossgreen",
      "helpful_votes": 15,
      "publication_date": 20190208
    },
    {
      "title": "Pocket is so useful",
      "text": "I am truly impressed by this app. I thought it would be good, but I did not realize how good. Add on to any browser you use or any mobile app you use to read articles. Go find any and all articles you want to read, click 'save to Pocket', and now you have those articles on any device where you have the Pocket app. For me, that's my phone, my tablet, and my laptop. Even better is the articles are easier to consume, because ALL ads have been removed.",
      "rating": 5.0,
      "verified": true,
      "author": "CA1990",
      "helpful_votes": 15,
      "publication_date": 20181023
    },
    {
      "title": "I Love The Pocket App",
      "text": "I tend to bite off more than I can chew when we are talking about reading. 📗🗞 and Pocket makes it easy to save articles I find on the web, store them, and organize them easily. The UI is easy to navigate. You can set up categories to store them for easy retrieval to read or share on your personal blog or social media. I can't sing the praises of the Pocket app sweetly enough. Take my word for it. This app is definitely a keeper. I use the freebie but a premium upgrade is available to access more personalization options. namaste maryann, sadie, monkey plus the \"cove\" kitties, biggie smalls, and cupid.",
      "rating": 5.0,
      "verified": true,
      "author": "graceless",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great but need ability to download from Pocket",
      "text": "Love the fact you can save over multiple platforms and machines. Any place I am I can call it up and look for an article I saved. Like the fact they can be sorted into different categories which makes them easy to find and you don't have one gigantic list. The biggest drawback is you can't download a saved article or at least I can't find it. If I want to save something to a particular PC I have to copy and paste. Bummer. Also do not know how much cloud space I have - haven't been able to find that either. Always wonder if I am going to run out.",
      "rating": 5.0,
      "verified": true,
      "author": "FiberArtist",
      "helpful_votes": 6,
      "publication_date": 20160309
    },
    {
      "title": "Does not work with Kindle Fire",
      "text": "I had this app for a few years on my Kindle Fire but it suddenly stopped working. After deleting the app to reinstall it I see that it is no longer compatible.",
      "rating": 1.0,
      "verified": true,
      "author": "Randy Holbrook",
      "helpful_votes": 2,
      "publication_date": 20200123
    },
    {
      "title": "Easy to swap stories with your friends",
      "text": "My husband and I like to share articles we've found. I used to send articles to Kindle, but it was too complicated to access them. Pocket app allows us to share articles with two clicks. Reading display is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Terrific product!",
      "text": "This is exactly what I was looking for. Makes management of reading list a breeze and let's me catch up when I can. The ability to archive and tag is very useful. Folder creation feature would be very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "Arindam Gupta",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Pocket is a magical app for saving articles absolutely no downsides.",
      "text": "Pocket is the best app ever invented. There is no downside to pocket. Can be used online or off for saving, reading, and the app can even read saved articles to you. I can't believe it is free.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Easily my favorite app",
      "text": "I'm so glad I discovered Pocket. I love how you can save any article and tag it, makes things much easier. I've become something of a news and politics junkie lately and save dozens of articles. At work I've started listening to them at work. Some articles it has a little trouble, but I've found that to be rare cases. Definitely a required app.",
      "rating": 5.0,
      "verified": true,
      "author": "James Dewitt",
      "helpful_votes": 3,
      "publication_date": 20170719
    },
    {
      "title": "Not bad",
      "text": "I was looking for an app that will speak whatever text I touch, such as a Facebook comment or news article. From what I can find, this app doesn't do that. It has its own \"Discover\" list of articles to choose from. I need more.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele Briere",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Pocket app unavailable from App Store",
      "text": "Unable to install because App Store said the app was unavailable. I would really like to use Pocket on my Fire tablet.",
      "rating": 1.0,
      "verified": true,
      "author": "secdroid",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "Best way to save articles online",
      "text": "Additional features such as tagging, archiving, sorting, dark-reader mode, etc make this app second to none when it comes to saving interesting articles online that you want to revisit later. Most of the capabilities are also free! No brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Pocket, You Are My First Love.",
      "text": "I've tried using Evernote, but I'm kind of stuck on Pocket. I don't need all the fancy doo-dads that Evernote has. I just need to click a little button and save an article for later. Can I read it offline? For surely! Unless I change the settings so that these articles don't take up so much space on my device. The user interface is easy: swipe, swipe, swipe, done. They've added new features that make it easier to sort your favorite reads and whatnot, but in it's simplest format, Pocket is my own custom newspaper. Now if only I'd sit down and read those articles I saved a year ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Momo",
      "helpful_votes": 3,
      "publication_date": 20150725
    },
    {
      "title": "Save to the Pocket",
      "text": "Pocket is such an easy tool to use. As I am searching for stories or information on the Web or on Facebook, for instance, I easily can save the item to Pocket for me to read or study at a later time. Too often in the past, I would see something I liked but didn't have the time to fully read it. then when I would try to go back and find it later, I couldn't. Now I know just where the items are--in the pocket. When I am done with them, I have the option of deleting them.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M. Smith",
      "helpful_votes": 2,
      "publication_date": 20160523
    },
    {
      "title": "Could you make it easier to save articles from my phone?",
      "text": "I like this app in general. But I have a hard time figuring out how to use it on my phone so that it will store new articles. Like, when I come across a link to something of interest, I haven't been able to find a way to use the app to save it. I have only really been able to use it on my desktop. On the app, I can access teh \"recommended\" articles, but those tend to be repetitive and boring. I hope that they can make this app easier to use for saving new articles on my phone, because it really is a handy thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Chiara",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "Not thrilled",
      "text": "I've been using this program since the time when it was called Read It Later on Firefox, am a big fan. BUT I don't really like this app much. It doesn't integrate with the browser on the kindle at all. I have to open it seperately to use it, defeating the purpose of having it. Going to give it a few more tries to see if i missed something before i uninstall it",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Time saver",
      "text": "An astonishingly easy way to save articles for later reading and to access them across different devices. Hopefully, the app will continue to improve and to add features such as a way to have it load automatically with the browser. Meanwhile, a brilliant solution to a tedious process.",
      "rating": 4.0,
      "verified": true,
      "author": "The River Horus",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "I don't know what I'd do without pocket.",
      "text": "There are so many short articles on so many things I can't read them all every day! Pocket lets me grab an article anywhere, any time I have a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie Moore",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Excellent! Kudos to the creator!",
      "text": "Coolest app ever! This makes reading articles so much easier. I don't have to keep multiple windows open to remember to read it. It remembers where I left off and I can change the settings for the background and font size just like a Kindle or nook. Not to mention that I can send it to others! It's super easy to save the articles. I've even downloaded the extention for my computer and the app for my Kindle!",
      "rating": 5.0,
      "verified": true,
      "author": "Savannah",
      "helpful_votes": 3,
      "publication_date": 20141118
    },
    {
      "title": "A useful app",
      "text": "This is a good app to have if you find articles online that you would like to read later. You have to be careful though, once deleted, content is gone. Also if you send anything to Archive, it will require wi-fi to retrieve it. I figured out that I could not watch youtube videos unless I was connected to the Internet. One thing that I like & find really useful is that if you find an interesting article on Wikipedia & don't have time to read it then, it can be saved & read later offline. This is good if you are somewhere without an Internet connection.",
      "rating": 4.0,
      "verified": true,
      "author": "Game Wizard",
      "helpful_votes": 5,
      "publication_date": 20130613
    },
    {
      "title": "Love it. You will too.",
      "text": "This is a great little app. You can read articles or just news stories later, when you have time, offline, if you want. Plus they send excellent recommended reading to your email each day. I've enjoyed reading a lot of things I would never have come across except for their suggestions. I will never be stuck on a bus or in a line with nothing to do for 10 - 15 - 30 minute intervals of 'slow boiling'. Am already a much pleasanter person in a waiting situation!",
      "rating": 5.0,
      "verified": true,
      "author": "peninpaw",
      "helpful_votes": 6,
      "publication_date": 20170927
    },
    {
      "title": "About the only thing this is good for is being able to see some of my ...",
      "text": "The sites I tried to save would not work unless my device was online. About the only thing this is good for is being able to see some of my Firefox saved bookmarks on the Kindle Fire, since Fire only has the one browser and Amazon won't allow any other browser to be installed. I would really like to have my Firefox browser on my Fire!",
      "rating": 2.0,
      "verified": true,
      "author": "Bob D.",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Works great for kindle, Apple, and PC for me",
      "text": "I really like this app. I have an apple computer, a kindle fire and at work a PC. It is so simple to use this so that if you save an article on one device you can read it on another. I also really like the idea of saving the page, not just the url. All you have to do is click on the url at the top of your computer and drag it down to the pocket. I've used it to save information on finances, saved an english muffin recipe, saved a page that I wanted to read later and a few other things. If I were doing research this would be fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 2,
      "publication_date": 20140704
    },
    {
      "title": "Pocket program",
      "text": "Your program writers do not take under consideration that a senior citizen would like to download the app but has all kinds of problems when trying to do so. I have a strong feeling the app will do what it is intended to do but I have to be able to download it into my computer. Rich Koebert",
      "rating": 1.0,
      "verified": true,
      "author": "Joan Koebert",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Must have, easier than bookmarks",
      "text": "I'm happy with this app as you can add it to the pocket app to view it later on. I'm easily distracted when I go on the Internet so if something is interesting, I add it to pocket for viewing later rather than taking away from the reason of going on the Internet to begin with. I used to create folders in my favorites to view interests for later but this app takes the work out of it. You can also view what you have saved for viewing offline. So far I haven't found a limit on the amount you can save. A must have and time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "KFW ",
      "helpful_votes": 3,
      "publication_date": 20121221
    },
    {
      "title": "Bravissima, Pocket people",
      "text": "This service is just plain great. It does not get in your way and it actually saves time. If you are like me and are basically interested in everything, then you will love the way it helps you focus on the task at hand without missing anything. Bravissima, Pocket people.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "What happened to Pocket in latest Fire version ?",
      "text": "Great app. However , i upgraded my Fire to 8 hd , 8th generation , only to find out Pocket is no longer available . But still showing in my old Fire hd 6. I'm very upset .",
      "rating": 5.0,
      "verified": true,
      "author": "Lupito",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Perfect for saving anything!",
      "text": "This is such a handy little free tool. I have it on all my devices. Now when I'm browsing news sites, or any sites for that matter, I can easily put the article aside for later and read at my leisure. I've used it for all different kinds of things -- articles, websites, recipes, etc. And everything is synced on all devices. Perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "MrsMac",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "Pocket presents quality variety",
      "text": "Pocket presents a wide range of important news and insightful articles that complement my normal daily reading. Most every Pocket email list includes at least one article that I want to read.",
      "rating": 5.0,
      "verified": true,
      "author": "Leroy Barnhart",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Pockets",
      "text": "Pocket is fine,and easy to use.I just cant find a list of the items I saved.Folders seems to be a lot easier to navigate.What I get is a group of frameworks that I don't know how to open or find what I have saved",
      "rating": 3.0,
      "verified": true,
      "author": "TRAPMAC😅",
      "helpful_votes": 2,
      "publication_date": 20161004
    },
    {
      "title": "Very Easy to Use and Great Articles",
      "text": "First of all, pocket picks great articles. There are always 2-3 things I want to read. Then it is super easy to save them in a pocket and even to tag them with a short title that gives a category I recognize. I'm over 60, not tech savvy and I appreciate everything about Pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Harris",
      "helpful_votes": 3,
      "publication_date": 20161220
    },
    {
      "title": "I love this application and service",
      "text": "This app in combination with the different browser plugins, allows you to save articles and webpages for later reading. it reformats the articles for effective and comfortable reading format. this is also good for printing (cuting out ads and more, but saving text and images) you can read the articles on your PC or on the Android and mark them \"done\". if you hate reading news stories or longer texts from websites - this for you, with a little tweaking it will also sync with your Kindle for the best digital reading experience available today.",
      "rating": 5.0,
      "verified": true,
      "author": "Moshe Eshel",
      "helpful_votes": 3,
      "publication_date": 20111017
    },
    {
      "title": "No longer works on older Kindle Fire",
      "text": "As of late July 2018, no longer works on first generation Kindle Fire. I get a notice on the Kindle, and it is now listed under my devices that are no longer compatible.",
      "rating": 1.0,
      "verified": true,
      "author": "Nuthatch",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "hey very useful apps",
      "text": "I would have rated this app 5 stars because it's very useful for saving one line articles to read later on offline the only problem is is sometimes the things you save: don't show up on your pocket if they do show up they don't show up in all of their entirety perhaps part of it is the manner in which I use it maybe I just don't know all the tricks and raves to the amp yet leaving still it's an app that has a significant amount of usefulness yeah I highly recommend downloading it",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 3,
      "publication_date": 20140426
    },
    {
      "title": "Essential.",
      "text": "Unbelievably wonderful app allows you to send blogs and online reading to your kindle or other device for reading / absorbing at a later time. I also suggest looking into the Chrome extension \"Batch Save Pocket\" as I was able to save hundreds of my favorite blog's posts to my kindle with just a few clicks.",
      "rating": 5.0,
      "verified": true,
      "author": "CorriePritzell",
      "helpful_votes": 2,
      "publication_date": 20170502
    },
    {
      "title": "Worth the money",
      "text": "Even though I got this on FAOTD, I would still have paid the $2.99 for this. This app is great. I have the additional plug-ins installed in Firefox and Chrome so that I can tag something with RIL and read it on any of my computers or on my phone. This is a very convenient app to have installed on your Android phone especially if you like to start reading something on your PC then take it with you to finish up on your phone will commuting home or something. I have used the send to email feature and it worked without any issues as expected. I love this app.",
      "rating": 5.0,
      "verified": true,
      "author": "BigDish",
      "helpful_votes": 0,
      "publication_date": 20111221
    },
    {
      "title": "Love The Pocket App!",
      "text": "Love everything about the Pocket app. I am constantly storing web pages to read later when I have more time. Best thing is that you can use Pocket with other browsers as well. This app should become standard for all browsers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jody Rivers",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Pocket, it's great.",
      "text": "I have used Pocket for years. You can't get a better app to save files in. And, the articles they run are very interesting. I would highly recommend it for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Wild Bill",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "good for offline reading a webpage",
      "text": "I'm giving it 5 stars as a program because it does do what you want it to. It's great for saving a webpage to read offline.",
      "rating": 5.0,
      "verified": true,
      "author": "Loria",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "I love this app!",
      "text": "I find a great deal of interesting content when browsing the web, and this app is wonderful for saving the items to look at or read later. I also find it a good reference for showing someone an item that is interesting to both of us, and it's really been useful for saving recipes or instructions for making craft items. Some content, such as articles on Facebook for example, may not be saved in their entirety, but there is usually a link to help find it again. I use this app a lot, and have never had a problem with it. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Madeleine R. Myers",
      "helpful_votes": 0,
      "publication_date": 20121124
    },
    {
      "title": "Great for mobile reading",
      "text": "I have no idea why they changed the name from Read it Later to Pocket, since the function of this is to save articles online to read later, but I don't hate the name. The transition from computer to phone is amazing, and reading the articles on my phone that I save on my computer almost instantly, in a mobile-reading format, is a great way to be able to quote lines to friends, discuss news and have pages to reference for speeches and conversations.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Buchko Jr.",
      "helpful_votes": 0,
      "publication_date": 20130104
    },
    {
      "title": "Still Figuring This Out",
      "text": "My rating is between a four and a five. I like being able to save entire articles and travel information with Pocket. Evernote only lets you save the link. I am guessing that other apps work the same and save either the link or whole article. I just came across Pocket and it worked. I have not been able to organize in files what I save. The filter is by most recent. As I add articles, the list grows longer and more confusing. But for what it does, it works great. We are traveling to Europe and are not sure we will have WiFi all the time. I am using a Kindle Fire HD 8.9\".",
      "rating": 4.0,
      "verified": true,
      "author": "Gary McCall",
      "helpful_votes": 3,
      "publication_date": 20130821
    },
    {
      "title": "Becoming my go to Kindle App",
      "text": "I've tried Evernote, which will only capture URLs not screen shots from Kindles. One Note does not work with Kindles. Pocket allows screen capture and allows access to complete articles without web access. Easy to use, just hit share, and hit pocket. Done. Can use accoss platforms, Android, PC, Kindles. I'm really beginning to appreciate this app, after wasting a lot of time with Springpad, Evernote, and One Note.",
      "rating": 4.0,
      "verified": true,
      "author": "Odiewon",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "I love this app",
      "text": "I love this app! My only problem is the lack of highlighting ability. Many times I just want to highlight a portion of an article or information to store permanently as a reference and it doesn't allow that.",
      "rating": 4.0,
      "verified": true,
      "author": "Booklover",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "always like send you articles about how the job market is ...",
      "text": "You know how your in-laws, parents, etc. always like send you articles about how the job market is dismal when you are unemployed? Well, with Pocket, you can save those and read them later when you aren't buying top ramen with your unemployment check.",
      "rating": 4.0,
      "verified": true,
      "author": "Madeline",
      "helpful_votes": 2,
      "publication_date": 20141231
    },
    {
      "title": "More helpful than I thought",
      "text": "I had been avoiding these type of apps simply because I couldn't see why it's any better than a simple bookmark. Well, it is. Having a repository of locally stored pages is really cool. Having that repository sync to all your devices with Pocket is even cooler. There are currently a couple of information pages that I constantly need to refer to, and having the ability to instantly bring those up on my phone is very convenient. I find myself tagging pages all the time now, very cool!",
      "rating": 5.0,
      "verified": true,
      "author": "The King of Nothing",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Nice App",
      "text": "Great place to put things to read later. Allows me to make the most of down time.",
      "rating": 5.0,
      "verified": true,
      "author": "Yorktown T",
      "helpful_votes": 0,
      "publication_date": 20190513
    }
  ],
  "product_meta": {
    "price": "",
    "specifications": {}
  }
}