{
  "website_summaries": [
    {
      "verdict": "The D-Link DIR-827 is a very good true dual-band router that needs a firmware upgrade so it can live up to its potential.",
      "pros": [
        "The D-Link Amplifi HD Media Router 2000 DIR-827 is a true dual-band router that offers USB 3.0 and an HD Fuel feature that automatically prioritizes Internet traffic for HD media streaming, VoIP applications, and gaming",
        "The router also comes with a good set of other features that are available with other D-Link routers, such as SharePort Plus, guest networking, and OpenDNS parental controls"
      ],
      "cons": [
        "The D-Link DIR-827's firmware is a little buggy",
        "The router doesn't support the 450Mbps Wi-Fi standard, and its performance on the 2.4GHz band could use some improvement"
      ],
      "aspects": {
        "Setup": 8.0,
        "Features": 7.0,
        "Performance": 7.0,
        "Support": 7.0
      },
      "publication_date": 20120814,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not quite right",
      "text": "I purchased this product for the dual band, and for the USB 3 port. After months of changing settings, the 2.4GHz band is finally no longer kicking my older devices offline every 20 minutes. When they say \"Shareport technology\", what D-Link means is that you will have to download their Shareport software if you want to be able to access the USB drive from anything but a full PC. The iPod and tablets in the house absolutely require the software to view the material stored there. It was not easy to configure, even so, and did not make a good family storage media device as I had hoped.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan in Washington",
      "helpful_votes": 2,
      "publication_date": 20141230
    },
    {
      "title": "It's a good-ish router for the price",
      "text": "I have another dlink router that is the main and I use this one to expand my wireless coverage. The settings as far as i can tell have most of the basic settings and have all the same security features as my main one. Overall it works well and is easily setup without problems. Edit (June 30, 2016): changing this to 1 star. After having had this for a few months, the wireless seems to have stopped working. Edit (August 1, 2016): after much further investigation, it was all user error. This is a good router. I apologize for the incorrect star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "jlat",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Five Stars",
      "text": "A++++++ excellent easy setup great access and speed very good inexpensive router",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Has to be reset allot.",
      "text": "When it works it works great, but don't count on it being consistent. Tolerated it for about 9 months, will be calling in under warranty, but from what I see from other reviews it is par for the course. Loses connection and you either wait or have to reset it. Have the latest firmware, doesn't help.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff Wallin",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "Five Stars",
      "text": "I loved it. Quite stable and best value for the money",
      "rating": 5.0,
      "verified": true,
      "author": "Le C.",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Good customer service experience",
      "text": "I have Vonage as my home phone service and had difficulty setting up the router myself. However, I called D-Link and tech Henry was EXTREMELY patient and took me step by step on how to set up my modem, router, laptops, and Vonage phone. Everything is running smoothly now- very pleased with the customer support.",
      "rating": 4.0,
      "verified": true,
      "author": "LM",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Worth Every Penny",
      "text": "While I thought long and hard about going another route(r) from looking at websites like cnet and smallnetbuilder, I'm happy with my decision to stay with the one I trusted. I'm getting twice the speed of my previous router and two networks that talk to one another and seamlessly share information. No more switching between 2.4Ghz and 5Ghz to watch movies. A solid performer, well built, sleek and sexy. While it doesn't top the charts D-Link's experience in building a awesome router shows in it's simplicity.",
      "rating": 5.0,
      "verified": true,
      "author": "Animaleyez",
      "helpful_votes": 5,
      "publication_date": 20120220
    },
    {
      "title": "Five Stars",
      "text": "Purchased router for my Xfinity / Comcast internet and it works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "C.M.S.",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Very pleased",
      "text": "I am very pleased with this router. Setup was easy, and it works great! I used their website to support me during setup.",
      "rating": 5.0,
      "verified": true,
      "author": "luvs2tch",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "Very good product overall",
      "text": "The connection drops sometimes and i need to reset it. Apart from that, no issues at all. Very good product overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlie ",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Works great until it breaks",
      "text": "Seven months later, the wifi randomly just turns off every few days. Rebooting restarts it, but who wants a router this flaky?",
      "rating": 1.0,
      "verified": true,
      "author": "Spamvikktim",
      "helpful_votes": 2,
      "publication_date": 20140908
    },
    {
      "title": "working well",
      "text": "I got this for my mother, she isn't good with tech, so I expected this unit to be up for her after configuration and stay up. I am pleased that it has so far, she hasn't complained to me a single time about it going down or giving her trouble. Her demands are not high though, just a few wireless clients for internet and printing, likely no fancy file transfers or setups, so I can't give any opinion about those features of the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Vaz",
      "helpful_votes": 0,
      "publication_date": 20120721
    },
    {
      "title": "wireless",
      "text": "The product is great ! It has everything you will need and more. I would recomend that to anyone. The price is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "Not for the faint of heart",
      "text": "This D-link never worked properly over the months that I had it. I used tech support on two occasions; wasting hours on the phone. Also spent hours with my son who is a computer geek and has an IT Bachelors Degree and still it would not connect on most occasions. Poor product.",
      "rating": 1.0,
      "verified": true,
      "author": "Steven J. Burican",
      "helpful_votes": 2,
      "publication_date": 20130317
    },
    {
      "title": "Five Stars",
      "text": "No problem so far does the job as an access point",
      "rating": 5.0,
      "verified": true,
      "author": "gierbo",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Try another router",
      "text": "I'm really disappointed with this router. Is really easy to setup but 5 minutes later it began to shut down every 15 minutes. Searching throught the web the only help you got is to turn off all the add-ons to make the router configuration stable. Sorry but I already have a dlink router that works really great but this is not the same! I hope Dlink support could make another firmware upgrade because this model already have some serious trouble!",
      "rating": 2.0,
      "verified": true,
      "author": "Luis Miguel Ruiz",
      "helpful_votes": 0,
      "publication_date": 20120812
    },
    {
      "title": "Ok router",
      "text": "I was not horribly thrilled when it takes a full minute for it to update every time you make any change to the settings.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Barrett",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "D-Link DIR-827 review",
      "text": "As wireless Access point i can't complain yet. Signals is strong and everything works pretty fast. I didn't check max throughput though... Where it crashes and burns is in it's DLNA (uPnP) media streaming advertised capabilities. I connected external hard drive to the usb share-port and TV did find the server, but it fails to find any files on the hard drive. I ended up connecting the hard drive to my computer and streaming the media from the computer to the TV. So my idea of network drive to stream media to TV has failed... Later i found in DLINK forum people complaining about exactly the same problem... So be warned...",
      "rating": 2.0,
      "verified": true,
      "author": "Vladimir",
      "helpful_votes": 3,
      "publication_date": 20120425
    },
    {
      "title": "A no regrets purchase.",
      "text": "Works perfectly for my needs at a price that makes buying it immediately a no brainer.",
      "rating": 5.0,
      "verified": true,
      "author": "Weend",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Easy setup, poor range.",
      "text": "Setup was easy, the new QoS engine is fantastic. The only complaints I have is the wireless range and read and write speed to the USB hard drive through the network. For the price though it's still a very good router.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20121106
    },
    {
      "title": "Very happy with its performance.",
      "text": "I've had this router for serveral months now, and have nothing to complain about. I use a computer, kindle and a tablet, and never have had any problems with connections any where in my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Currie",
      "helpful_votes": 0,
      "publication_date": 20130131
    },
    {
      "title": "Item was great and fast",
      "text": "Item was great and fast! But after a month it was dropping connections left and right. Went to update the firmware and now it's bricked. What a waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "\"HD Fuel\" or QoS not ready for prime time",
      "text": "\"HD Fuel\" or QoS doesn't work with an internet upload connection speed above 2 Mbps. This has been confirmed by' D-Link engineers. Efforts are being made to get those responsible for writing new firmware to change this upload rate limit to 10-15 Mbps, or even to eliminate the speed limit altogether. I gave this router a 3 star rating that hinges on them coming through with new firmware that fixes this issue. It does everything else pretty well, so long as you follow some setup guidelines laid out at D-Links support forums.",
      "rating": 3.0,
      "verified": false,
      "author": "Ryan",
      "helpful_votes": 8,
      "publication_date": 20120411
    },
    {
      "title": "Five Stars",
      "text": "great tech. support through d-link helping me set it up thanks to Harold badge # AR004208...thanks again.",
      "rating": 5.0,
      "verified": false,
      "author": "Erik F.",
      "helpful_votes": 0,
      "publication_date": 20150825
    },
    {
      "title": "Not worth it.",
      "text": "I bought this router thinking it would provide good performance, well I was wrong. After two weeks of unreliable performance I returned it. It cannot handle many wireless devices, it would freeze up when more than 10 wireless devices connected. I ended up buying the Apple Airport Extreme, which was easier to setup, and handles 50 wireless devices without sweating.",
      "rating": 3.0,
      "verified": false,
      "author": "Lex Green",
      "helpful_votes": 0,
      "publication_date": 20130213
    },
    {
      "title": "Solid, Fast Router",
      "text": "I had this router for a while and it's pretty solid. It's fast and the wireless range is decent. The USB file sharing is pretty usefull and I have a Seagate 500GB attached shared for the whole household. I dont have any lan pcs, so the majority of my laptops and gamnig systems have been on wifi. After the initial setup, it seems to be able to take care of itself",
      "rating": 5.0,
      "verified": false,
      "author": "P. Kuo",
      "helpful_votes": 2,
      "publication_date": 20120119
    },
    {
      "title": "Nice Gift!",
      "text": "I bought this router for my brother as a birthday gift because he's such a tech guru. Apparently he has been having a good time with the router because it has so many of the features he would use. He explained to me that this router is also future proof because it has IPv6 which apparently everyone will be using. It is also one of the fastest routers he have seen. I would most defintely recommend this router as a gift if you have nerd friends.",
      "rating": 5.0,
      "verified": false,
      "author": "Ms Cake",
      "helpful_votes": 2,
      "publication_date": 20120120
    },
    {
      "title": "Do NOT purchase!",
      "text": "It did NOT meet my expectations. Could not install. Tech support was horrible. Was never able to get it to work. It is now sitting in a box - useless.",
      "rating": 1.0,
      "verified": false,
      "author": "Jana Jobe",
      "helpful_votes": 0,
      "publication_date": 20141007
    }
  ],
  "product_meta": {
    "title": "D-Link Systems HD Media Router 2000 (DIR-827)",
    "description": "Up to 600Mbps speed, HD Fuel bandwidth prioritization, dual-band wireless, and 4 Gigabit Ethernet Ports combine to power your connected lifestyle and deliver the uninterrupted connectivity you need to power multiple devices, simultaneously, and keep you in command of your digital universe. Go ahead: Stream HD movies, play your Xbox 360 online or make Skype calls - The HD Media Router 2000 with HD Fuel lets you do it all, all at once - free of annoying lags or glitches. SharePort Plus USB 3.0 lets you connect or stream from any USB device. There’s even an SD Card slot for accessing HD photos, videos and more.\n\nAMAZON.COM\n\n\n\n\nFROM THE MANUFACTURER\n\n\nUp to 600 Mbps speed, HD Fuel bandwidth prioritization, dual-band wireless, and 4 Gigabit Ethernet Ports combine to power your connected lifestyle and deliver the uninterrupted connectivity you need to power multiple devices, simultaneously, and keep you in command of your digital universe. Go ahead: Stream HD movies, play your Xbox 360 online, or make Skype calls. SharePort Plus USB 3.0 lets you connect or stream from any USB device. There's even an SD Card slot for accessing HD photos, videos, and more.\n\nThe sleek HD Media Router 2000 from D-Link. \n\nKEY FEATURES\nFreedom. Eliminate dead spots and enhance your wireless signal to build a complete home network capable of delivering uninterrupted connectivity to all your devices. Smart. SmartBeam technology locates and tracks individual devices in a wireless network, delivering a focused signal to all your devices, anywhere in the home. Speed. Up to 600 Mbps data transfer rates combine with four Gigabit Ethernet ports to deliver blazing fast connectivity to all of your favorite digital entertainment devices. Reliability. Advanced QoS technology prioritizes high-bandwidth traffic and optimizes your connection for uninterrupted HD video streams, online gaming, and VOIP calls without annoying glitches or lags. Simple. Plug and Play Installation. Backwards compatibility with Wireless G. Wi-PnP technology for easy setup for wireless connections using a USB thumb drive. Supports IPv6 for intelligent self-detect and router setup. Security. Create your own network name and password or put it at the tip of your fingers with \"Push Button Security\" for advanced WPA/WPS 128-bit data encryption. KEY SPECS\n * Powerful Wireless N600 technology provides superior wireless performance, clarity and coverage.\n * \n * Wi-Fi Protected Set-up (WPS) for secure, simple 1-button set-up\n * \n * 4 Gigabit ports for blazing fast wired connectivity\n * \n\nRear view of the HD Media Router 2000 with four Gigabit Ethernet ports. GIVE YOUR DIGITAL ENTERTAINMENT THE BANDWIDTH IT DESERVES. GIVE IT HD FUEL.\nWatch Netflix play your Xbox 360 online or make Skype calls. With HD Fuel technology you can do it all, all at once--free of annoying lags or glitches you might experience with standard routers. HD Fuel automatically manages traffic flow, and optimizes your broadband connection to give high-bandwidth applications like HD video streams and online gaming applications the highest priority.\n\nHD Fuel also lets you manually select bandwidth priority by either application or device, making it the ultimate traffic management system. Stream multiple media content to multiple devices all at the same time--HD video, online gaming, large media file downloads. The HD Media Router 2000 delivers uninterrupted access to all your connected devices and keeps you in control of your digital entertainment.\n\nDUAL 300 MBPS BANDS = ONE COMPLETE 600 MBPS HOME NETWORK\nBuild a wireless home network capable of delivering the bandwidth to handle HD video streams, large media file downloads, and online gaming to multiple devices, simultaneously. The HD Media Router is equipped with both 2.4 Ghz and 5 Ghz 300 Mbps frequency bands, letting you share more of your wireless bandwidth with more devices. Eliminate glitches and lags and unleash comprehensive whole-home coverage on all your devices, all at once. The HD Media Router 2000 provides uninterrupted connectivity to any device, anywhere in your home or small office.\n\nNOW PLAYING: EVERYTHING\nHDTVs, the Boxee Box by D-Link, Blu-Ray Players, Playstation 3... the HD Media Router 2000 has been engineered to not only deliver seamless connectivity to your favorite Ethernet-enabled devices, but ANY device. Connect printers, USB devices--even security cameras. SharePort Plus USB 3.0 lets you connect to and stream from any USB drive. With the free SharePort Mobile app, you can even access the USB device wirelessly from your tablet or smartphone. The HD Media Router 2000 also includes an SD card slot for uploading HD media files like video and photo. And with the DLNA standard, you can connect to any device, automatically.\n\nADVANCED HOME NETWORKING, SIMPLE SETUP\nHigh-performance entertainment devices, wireless signals anywhere in your home, multiple laptops, network storage systems, iPads, iPhones... It used to be that designing a home network capable of handling so many devices required some serious hardware and some seriously messy installation. Not with Amplifi. The HD Media Router 2000 is not only engineered with the power to handle all of your digital demands, but with the smarts to put it at the tip of your fingers.\n\nHD Media Routers offer Wireless G backwards compatibility and Wi-PnP technology for simple wireless connections through a USB drive. You can even set up your network from your iPhone or iPad with D-Link's free QRS Mobile application. And with IPv6 allowing for intelligent self-detection and router setup as well as with DLNA, the HD Media Router 2000 not only connects to any Ethernet-equipped device, but virtually any device--automatically.\n\n128-BIT SECURITY ENCRYPTION\nThe HD Media Router 2000 protects your network with 128-bit AES data security encryption--the same technology used in E-commerce or online banking. Create your own network name and password or put it at the tip of your fingers with \"Push Button Security\" standard on every Amplifi device. With hassle-free plug and play installation and advanced Wi-Fi protected setup, the HD Media Router 2000 is not only one of the fastest routers available, it's also one of the safest.\n\n\n\n\nGET READY FOR THE FUTURE: IPV6 EQUIPPED\nWith the growing number of Internet-enabled applications requiring IP addresses, the supply of IP addresses under the current Internet Protocol version 4 (IPv4) system has already been exhausted. The IPv6 protocol solves this network addressing exhaustion by creating more IP addresses, but migration from IPv4 to IPv6 is not necessarily automatic. No worries--this D-Link product is IPv6 Certified and ready for the future.\n\n\n\n\nFeatures include:  * Power saving by link status\n * Power saving by cable length\n * Power saving by wireless LAN scheduling\n * Complies with the EU RoHS directive that restricts the use of certain hazardous materials\n * Uses soy ink and recyclable packaging to reduce harmful environmental waste\n\nWHAT'S IN THE BOX\nRouter, Ethernet cable, power adapter, CD-ROM with software and documentation, quick start guide\n\n\n\nSee more",
    "rating": 4.1,
    "feature_bullets": [
      "Up to 600Mbps data transfer rates",
      "Dual-band 2.4 Ghz and 5GhzHD Fuel\u0099 QoS to prioritize high-bandwidth applications",
      "High bandwidth Gigabit ports for connecting Ethernet-enabled devices",
      "SharePort\u0099 Plus Technology for connecting USB 3.0 devices"
    ],
    "specifications": {
      "Wireless Type": "802.11n",
      "Brand": "D-Link",
      "Series": "DIR-827",
      "Item model number": "DIR-827",
      "Item Weight": "12 ounces",
      "Product Dimensions": "8.27 x 6.3 x 1.3 inches",
      "Item Dimensions  LxWxH": "8.27 x 6.3 x 1.3 inches",
      "Color": "Black",
      "Manufacturer": "D-Link Systems, Inc.",
      "Language:": "English",
      "ASIN": "B005PAIZNE",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 24, 2011",
      "Customer Reviews": "4.1 out of 5 stars63 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#37,771 in Computers & Accessories"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": 39.95
  }
}