{
  "website_summaries": [
    {
      "verdict": "Compact travel mug with an easy to open lid. Very durable tumbler that should last years.",
      "pros": [
        "Easy to carry and store thanks to its slim size",
        "Tumbler comes apart for cleaning and is virtually spill-proof thanks to the convenient lid-locking mechanism"
      ],
      "cons": [
        "Cleaning deep inside the mug can be difficult",
        "The tumbler has a tendency to retain odors if not cleaned properly, so make sure you give it a thorough scrubbing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "If you like having access to hot coffee or cold juice all day, this is the Zojirushi travel mug to consider. Leakproof, with a convenient locking mechanism for additional protection.",
      "pros": [
        "Excellent heat and cold retention",
        "Leak-proof design, can be stored at any angle",
        "Stainless steel interior, easy to dissemble for cleaning"
      ],
      "cons": [
        "Rubber replacement parts are prohibitively expensive",
        "Lid is not covered by warranty",
        "Lid design makes drinking beverages a challenge for some"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "FAKE! KNOCKOFF! 😡",
      "text": "I’m sure the REAL mug deserves a five star but right now I’m just mad cause I got a knockoff! Not just that I waited an entire month for it to ship to me thinking it was coming from Japan I would be happy to receive it. It actually arrived in this beat up box from China and my pink mug ended up in a blue box that’s totally beat up with no Zojirushi logo on either of the products and it was all made in China rather than Japan. The material is cheap. I will not drink out of it. I expect my money back!",
      "rating": 1.0,
      "verified": true,
      "author": "lilxpo",
      "helpful_votes": 156,
      "publication_date": 20190109
    },
    {
      "title": "Disappointed and Annoyed",
      "text": "It took me a while to finally buy this since it is expensive. I so wanted this to be right for a long time because it is exactly the size I need. Unfortunately, after maybe the 3rd use, the latch, which looks like metal, but which I discovered is really plastic, broke. The top no longer locks down properly, resulting in leaking liquid. What a shame and a waste of product and my money. I have come to trust only the two well-known names in thermoses.",
      "rating": 1.0,
      "verified": true,
      "author": "djaybx",
      "helpful_votes": 63,
      "publication_date": 20170531
    },
    {
      "title": "Defective product NOT covered by warranty??",
      "text": "Beware! I just called the manufacturer to report that my mug (brand new, not damaged in any way) was leaking excessively. They told me that the warranty does not cover anything besides an issue with heat retention! They told me that I must have \"lost a part\" myself and that I would need to purchase my own replacement?? The mug is literally brand new. How is it possible for a company to deny responsibility for a defective product straight out of the box? They just took my money and gave me a mug that doesn't work. Never buying from this brand again...",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 11,
      "publication_date": 20190415
    },
    {
      "title": "The thermos is great but I would expect this to last more than ...",
      "text": "I had this for about 65 days and the lid mechanism broke (on its own, didn’t drop it etc). The thermos is great but I would expect this to last more than 2 1/2 month. I reached out to the company asking to purchase a new lid but they never responded to me, which is the most disappointing part. I do like the thermos and bought another but this isn’t a great value when you have to buy it twice. I’ve now paid $60 for a thermos.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan M.",
      "helpful_votes": 11,
      "publication_date": 20180606
    },
    {
      "title": "BREAKS within weeks x 2!!",
      "text": "I bought this for keeping my morning coffee hot. Works great as far as the heat goes, but the plastic on the top broke within a couple of weeks. I contacted the company since they say the product has a warranty. No, they don't. Only if your coffee gets cold. NONE OF THE PARTS ARE UNDER WARRANTY! But I like the bottle so I thought I would buy it again. Here we are 5 weeks later and the same part broke on this one too. $25.00 for an insulated cup should last a lifetime, not weeks. THESE ARE TERRIBLE!",
      "rating": 1.0,
      "verified": true,
      "author": "Allison H",
      "helpful_votes": 7,
      "publication_date": 20190628
    },
    {
      "title": "Do not waste your money or your time on this garbage!",
      "text": "The first time I filled it with water, it leaked. Upon inspection, a gasket was broken, or never one piece. Duplicate brochures were included in foreign languages that might as well have been hieroglyphics. A complete waste of money and lost time that will never come back. Dont buy thus pos!",
      "rating": 1.0,
      "verified": true,
      "author": "David S.",
      "helpful_votes": 9,
      "publication_date": 20190130
    },
    {
      "title": "Latch broke after a few weeks!",
      "text": "I have LOVED my previous zojirushi mugs. Unfortunately for me, I have a tendency to lose them over time. I bought this one to replace yet another lost mug. But after one month of using it, the latch that opens and closes the lid snapped, making the lid completely useless. I don't know if this is a freak accident, or the quality of the mugs is getting worse. But anyway it goes, I'm now the owner of a useless mug.",
      "rating": 1.0,
      "verified": true,
      "author": "Ellen Andersen",
      "helpful_votes": 8,
      "publication_date": 20190203
    },
    {
      "title": "Totally worth the money!",
      "text": "This 12 oz fits under my Keurig. It is really tiny compared to other travel mugs I have bought in the past. I was worried that it would be too small for my coffee and creamer. All of that worrying was for nothing! This thing is perfect. I use the second setting on the right. There's enough room for coffee and plenty of creamer.",
      "rating": 5.0,
      "verified": true,
      "author": "EarthAngel",
      "helpful_votes": 21,
      "publication_date": 20150822
    },
    {
      "title": "Durability is suspect",
      "text": "I'm a water and coffee bottle geek. I have a couple of Yeti's, Contigo, Thermos etc. Based on the reviews I bought this bottle. I was happy for 6 months because it definitely has one of the best heat and cold insulations out of any bottle. However, it has the worst durability and customer service out of the the companies mentioned. My bottle was hand washed and never put in the dishwasher. The outside started peeling as shown in the picture. Contacted the company and without even a question of inquiry, I was told \"tough\". Our warranty doesn't cover it. So.... think twice if you want a bottle that lasts.",
      "rating": 1.0,
      "verified": true,
      "author": "Moe",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Never put this in the dishwasher!",
      "text": "The unit holds heat, but if you put it in the dishwasher, the latch will fail. Why? According to their customer service department, the plastic loses strength due to the heat (and moisture?) in the dishwasher. The plastic breaks around the hinge pin. A replacement cap costs $12. What is bothersome is they know the problem with the plastic, but have not replaced it. There should be a warning sticker on the unit not to place it in a dishwasher. I wonder if it is even safe to wash it in hot water?",
      "rating": 2.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 5,
      "publication_date": 20171121
    },
    {
      "title": "Bad Design",
      "text": "This is a bad design. If I had gotten in the car with a hot drink to use it, it would have spilled all over me. The problem is that the latch sticks up too much from the container and a normal sized or faced person will run into it with their chin or nose. It seems like this was designed on a computer and of nice materials but never tested by a human or for freeway use... Returned it... disappointing... never even heard an \"Oh Sorry\" from the vendor... a nameless... faceless... bad design experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 3,
      "publication_date": 20190129
    },
    {
      "title": "As a man with an average sized nose this is ...",
      "text": "As a man with an average sized nose this is uncomfortable to drink from. The lid does not fall back far enough to grant full clearance to the nose for a satisfying chug of coffee.",
      "rating": 3.0,
      "verified": true,
      "author": "kizhax",
      "helpful_votes": 11,
      "publication_date": 20161226
    },
    {
      "title": "Ordered 2",
      "text": "These are very nice and really do keep coffee HOT!! However, one of the two arrived seemingly used. It was scratched and the inside looked terrible--threw away rather than try to return. The one that I kept is absolutely wonderful--1st time i actually found something that actually keeps my coffee hot literally all day. Skeptical as to whether I would buy again as I hate the process of having to return, hope the one I kept holds up.",
      "rating": 1.0,
      "verified": true,
      "author": "Emmasgirl",
      "helpful_votes": 3,
      "publication_date": 20190420
    },
    {
      "title": "Junk",
      "text": "There is a lot to like about this coffee thermos, but all of that is completely ruined by the fact that the gaskets are made from cheap rubber that absolutely STINKS! I have tried every known remedy for removing the odor from the rubber, but nothing works. I contacted the manufacturer about replacement seals, asking if they had corrected the problem, but I was told no, but I could purchase a new set for more money than the thermos cost to begin with - and the new ones were made of the exact same rubber. This thermos is great if you like coffee that tastes like foul plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "KAM",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Design change ruined the Zojirushi",
      "text": "I've been using this thermos forever! I love it! After a couple of years, mine finally wasn't working very well, so I searched for a new one. I was delighted to find it on Amazon. I ordered a new one right away and couldn't wait for it to come. In the photo you can't see that they changed the design. The top is no longer flat. It is angled. When you try to drink from it the latch is up so high that you have to position your lower lip between it and the drinking spout itself. I am so disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathy A.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "watch it, its still hot hours later!",
      "text": "I just got my Zojurushi Champaign Gold, insulated 16oz with slicksteel interior and I love it! It actually stays a little too hot and i had to leave the lid open for a while. I needed a replacement for my 2012 thermos mug that i love but it is finally showing some cracks on the lid threads. The Zojurushi is so much smaller but holds the same amount, and stays hotter a whole lot longer too. This is hands down the best travel mug i have.",
      "rating": 5.0,
      "verified": true,
      "author": "Hi, its me again!",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "After spending the first year of graduate school smelling like coffee and spending too much time scrubbing the bottom ...",
      "text": "I will never buy another travel coffee mug ever again. After spending the first year of graduate school smelling like coffee and spending too much time scrubbing the bottom of my bag of stains, I finally splurged on this and I don't regret it. I regularly find it entirely upside down in my bag. It has never leaked once and it keeps beverages hot for literally hours. I filled it and accidentally left it at home one day at 6AM, and when I came home at 6PM, it was still nice and warm. I checked it the next morning at 6AM, and it was still lukewarm, though the milk smelled a bit odd at that point.",
      "rating": 5.0,
      "verified": true,
      "author": "Richhaus",
      "helpful_votes": 2,
      "publication_date": 20180115
    },
    {
      "title": "P65 warning on box",
      "text": "Just received it today. I'm excited to try it, then I take a closer look at the box. There is a P65 (cancer / reproductive harm) warning. There is no indication of which part it is referring to. The site states that it is BPA free, so what is the possibly harmful component? Going to be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tami",
      "helpful_votes": 3,
      "publication_date": 20191202
    },
    {
      "title": "These mugs leak all of the time.",
      "text": "I bought 2 of these travel mugs for my wife for her birthday. The 1st day she used it it leaked. I tried screwing the lid down tight but it still leaked. I looked at it and saw that the cap insert comes out for what I assume is cleaning and it may not have been seated tightly. She refused to use them. I used them for work and even after seating the insert it still leaked. The only positive on the mug is it kept my coffee hot most of the day. I want to return them. It was a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 4,
      "publication_date": 20190208
    },
    {
      "title": "Great bottle!",
      "text": "This water bottle is amazing. To test it out.. I filled it with boiling water before going to bed and when I got up the next morning the water was still pipping hot! I've left unfinished tea in there and 24 hours later it is still pretty warm. The only problem is that it keeps the water so hot it's difficult to drink so I brew my tea with half a bottle of hot water and then add room temp water to make it comfortable enough to drink. I love that the spout is very easy to clean. I'm going to buy one for my daughter as well because I'm sick of washing straw bottles.",
      "rating": 5.0,
      "verified": true,
      "author": "Yan G.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Complicated with many parts, but leak proof and keeps temperature well",
      "text": "For the most part, I like my travel mugs to be as simple as possible- slosh some coffee in them, toss them in the bag and head out on the subway, and then throw it in the dishwasher at the end of the day. However, when I'm on traveling for work, I want something that's compact, and more protected/sanitary. I love that this mug has a cover over the part that you drink from, so that it stays protected while you're dashing around an airport or whatever. It's small, but keeps things quite cold or hot for a long time. Cleaning is a bit more of a process since there's a bunch of parts, but overall, it's worth the effort!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "I like that all the parts can be dismantled for cleaning ...",
      "text": "For a bottle that's 16oz, it's a little smaller in the hand than I expected. I like that all the parts can be dismantled for cleaning and drying. There was a long page of instructions and care in English, French, Chinese traditional, Chinese simplified, Korean and Japanese. A lot of the instructions are common sense. One thing that was weird is the sticker on the bottom cannot be removed. Doing so may cause rust or holes according to the instructions. Now I'm really curious why a bottle that looks so well made could use a sticker, STICKER, at the base at all.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Lin",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "which is really nice. Be careful putting it back in though",
      "text": "The mouthpiece comes out for in-depth cleaning, which is really nice. Be careful putting it back in though, because if it isn't lined up right it won't stay snug. (Fortunately I learned this before trying to take a drink.) I love the locking feature cause then if it goes sideways when it's in my lunch bag or purse I don't have to panic and worry about coffee or tea everywhere. There is a metal top to the canister itself that makes it too tall for most Keurig machines but I just use a glass measuring cup and transfer from there, or use it for tea.",
      "rating": 5.0,
      "verified": true,
      "author": "Storm",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "This thing is AWESOME!",
      "text": "I bought this to carry hot chocolate in a backpack while snow skiing on a trip to Colorado. I was staying in a hotel, so I just went to Starbucks and got my hot cocoa and poured it in and drank whatever didn't fit. It held most of a Venti Starbucks hot cocoa and kept the cocoa hot for 6 hours. The next size down probably fits perfectly. I know Starbucks isn't cheap, but hot cocoa in the lodge is outrageously expensive, and there's the added bonus of portabilty. Overall, it's a sturdy, quality thermos and easy to clean. I haven't tried it with a cold beverage, but I'm sure it would be equally effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Tenacious-G",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "NOT THE ORIGINAL. LOOK ELSEWHERE.",
      "text": "This has a different style lid than the old tried-and-true cult favorite coffee mug. Its front clasp sticks way up and makes it literally awkward to drink from something you are meant to drink from. Try a different vendor and look carefully at the photos of the lid clasp. It should only have a very short rise above the bottom half of the lid. The clasp is the vertically oriented rectangular piece on the front of the lid; which you press to release the hinged and spring loaded top piece. They have changed the lid design to an inferior model. It gets coffee on your nose. Just trust me on this and look for the shorter lid.",
      "rating": 1.0,
      "verified": true,
      "author": "Glen",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Fantastic.",
      "text": "I got this when someone recommended it. They were right, kept coffee hot for hours. Simply excellent. Use it everyday for hot and cold drinks. I also have one of this company's rice makers. Also excellent. It would be nice if this mug also cooked great rice. I am sure there would be huge demand for a combo rice maker/stainless steal mug. Anyway, definite thumbs up on this one. Just note the size, some people prefer a larger mug. This was perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Lan Review Man",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Loved the functionality of this product until I noticed scratches ...",
      "text": "Loved the functionality of this product until I noticed scratches on the interior of this mug. I purchased the slicksteel version that was advertised as having no coating, just steel. Shortly after this observation, I began noticing a metal taste in my drinks, be it water, coffee or tea. I would like to note that I have been exceptionally careful with cleaning this product-- I have only ever used mild detergents and warm water. I can't attribute this poor experience to anything other than poor workmanship. I will sadly not be purchasing this item again.",
      "rating": 1.0,
      "verified": true,
      "author": "S.E.C.",
      "helpful_votes": 6,
      "publication_date": 20160511
    },
    {
      "title": "Works almost too good!",
      "text": "This thing is awesome! It keeps my coffee that I make at 7 am warm through my entire work day! But be warned, you need to let your coffee or beverage of choice cool off before closing the top, because whatever temperature your drink is at when you close it is what it will be the majority of the day. I usually make my coffee at 7 am or 7:30am and leave it open, top off for at least an hour so that it is ready to drink when I get to work. Other than that, which isn’t a bad thing, it’s great! No leaking, no staining, very easy to clean all parts. Definitely worth the price! Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Leaks",
      "text": "It leaks. I’ve used this mug for more than 6 months now and it definitely leaks no matter how little coffee you put in it. Maybe I am doing something wrong or have a defective product but it leaks from inferior aspect of the button. I hate it because coffee will stain my clothes by the time I get to work..",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa F",
      "helpful_votes": 5,
      "publication_date": 20171121
    },
    {
      "title": "Keeps coffee hot for 5 hours",
      "text": "Purchased this for my husband who drives for a living. He has gone through a dozen very expensive similar products and none of them have kept his coffee hot. I purchased the item 5 months ago and it has been used every day since then. Just yesterday my husband commented to me how impressed he was with it and that it is the only mug he has used that has kept his coffee hot for over 4 hours. The only down side is the small amount that it holds (2 cups) but that is because of the extensive insulation. He hates lukewarm coffee and would much rather deal with the size and enjoy a HOT cup of coffee. HIGHLY recommending!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle Ricky",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "The best at keeping things hot",
      "text": "This is almost too good to use for coffee or tea. If it was too hot to drink when you poured it on, it will be too hot to drink for the next 3-4 hours. What I use this most is to carry hot water so I can pack my daughter instant udon noodles. It stays hoot enough to use for that even after 4 hours. Her school cafeteria has a microwave but there's usually a long line for its use, and the kids being kids, it's pretty disgusting from what she tells me.",
      "rating": 5.0,
      "verified": true,
      "author": "Chae",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Fantastic for water at work",
      "text": "I only use this to drink water at work. It doesn't leak when upright, but does leak a little bit when shaken. The top isn't as tight as it should be when locked probably. It keeps water cool for a remarkably long time. It is very easy to take apart and clean. After 3 weeks the paint hasn't peeled or anything. It looks very premium. I recommend washing by hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Keeps liquid nice and cold for DAYS even on the hottest days",
      "text": "The absolute best water bottle you can buy. I live on a tropical island. It gets HOT here, well over 80F every day. Inside my car would probably kill you, when I open the door to get in on a day the heat coming out is like an oven, at least 100 degrees. I left this bottle inside my car for 2 DAYS. When I tested the water after the 2 days it was still nice and cold! I didn't even have to cool the bottle before hand, just poured cold water with NO ICE, into the bottle and done. Thats how good these bottles are.",
      "rating": 5.0,
      "verified": true,
      "author": "Nara L. Watson",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Amazing",
      "text": "Fits perfectly in my backpack. I love the size and it also looks amazing. Keeps my tea hot for very long, I sometimes let my tea cool down a bit before pouring it inside because it does it's job too well. I've dropped it once and it showed off how strong it was. Only con would be my nose touching the lid when I'm drinking out of it. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ahmad Omar",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Still Hot 10 Hours Later",
      "text": "I've got two of these mugs, one for my office and one for home. They are stellar for my hot tea. In fact, I'm writing this with a mugful of tea that I made 10 hours ago and completely forgot about and the water is still very hot. They are durable, generally easy to clean (still trying to figure out how to clean the small hole used to let air enter while you drink). The one warning to anyone buying one – don't lose the rubber ring that goes on the bottom of the spout. Lose it and be prepared to have it leak like crazy.",
      "rating": 5.0,
      "verified": true,
      "author": "Communications Pro",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Hours and hours and hours",
      "text": "I'm amazed at how long this keeps coffee hot. I have two of these now and both work great. We take a bi-monthly road trip from Northern California to SoCal and take some coffee. I usually brew the coffee at 5:30 and leave the house at 6am with this thermos pre-heated with boiling water. At 9am, the coffee is too hot to drink from the bottle, so I bring a paper cup. At 1pm, the coffee can be consumed from the convenient and safe-to-use spout, but it is still piping hot.",
      "rating": 5.0,
      "verified": true,
      "author": "Marty B",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "was hopeful on this travel tumbler but when I received ...",
      "text": "was hopeful on this travel tumbler but when I received it I realized the inside is coated with a \"non-stick\" grey chemical coating. I don't trust non stick coatings. Not sure why the company did not design it with pure stainless steel for interior of mug. Degradation of chemical coating from constant liquid heat exposure is inevitable. Sending it right back....and look for stainless steel. If you're okay with chemical coating then go for it.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 21,
      "publication_date": 20150929
    },
    {
      "title": "Slim, terrific heat retention, wish it were bigger, with a carrying loop, less expensive",
      "text": "I purchased the hot pink (Cherry) thermos because I only buy fuchsia: the color is perfect. I did waver a bit because it is ridiculously expensive for what it is. The Cherry only comes in the smaller size (16 ounces) which I find to be too small; not sure the larger size would've made that much of a difference as it's only four ounces bigger. I also wish there were a carrying loop so I could dangle it from a finger, not having to use a hand to carry it. Small nits considering it keeps drinks nice and warm and cleaning it is very easy. (I've only hand washed it.) Big nit is the price, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Dux",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Best Coffee Travel Mug Ever",
      "text": "This is by far the best travel coffee mug I have ever used. It keeps coffee hot all day long. The lid just flips up and you drink from it with ease. There is no separate coffee cup. I like that. You just seal it back up after you have a sip. No spillage and the coffee stays hot longer. The locking lid means you can throw this into a backpack without worrying about spillage or leaks. For me, this makes all others travel mugs and thermoses obsolete - it’s that well designed and conceived. It’s well worth the money. 16 ounces is about right for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel J. Sivertson",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Absolutely great!",
      "text": "I'm one of those people who loves sipping on a warm cup of tea all day and this mug is great for doing just that! I can sip for hours and it still keeps my tea warm, perfect for the cold New York winters. I usually make my tea around 7:45 and let it cool for about 15 minutes or so before pouring into the mug - reason being if you pour the freshly made tea into the mug it will keep hot for hours, sometimes too hot. I'm looking forward to using this mug in the summer and see how cool it will keep my drinks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Quality and Style at its best.",
      "text": "This is our second one because my son lost the first one we had for many many years. It is such a good quality water bottle. The color outside dont peel (only slightly over the years from fall and dishwasher but barely noticeable unlike other brands ive tried including contigo, kleen kanteen, swell) It has removeable parts so its easier to clean. Slim body design is perfect to grip with 1 hand. Spout is good for little children/toddler to drink from. If urs leak just make sure u install everything properly. Ours never did.",
      "rating": 5.0,
      "verified": true,
      "author": "rautatientori",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Stays hot, cleans easy, it’s worth the price.",
      "text": "This mug is amazing! My coffee stayed hot for HOURS! The mug/tumbler is totally leakproof and the lid also locks. It’s extremely easy to clean because the lid comes apart so you can get into the usually hard to reach inner workings. No gross mold to worry about because of the awesomely engineered lid design. I bought two on sale and they are a bit pricey, but worth it. I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Reader ACR",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Amazing thermos.  Keeps hot for a long time!",
      "text": "I did a lot of research on the best thermos and I'm glad I picked this one. It keeps hot beverages hot (not warm, hot) for many hours. Once I left the lid open in a freezing car for hours and it was still hot. No exaggeration! I suggest you put in hot beverages at the temperature you would drink at or slightly warmer. If it's too hot, you can't drink it for a long time. I have not yet tried with cold, but I assume it will keep just as well. I have used the Contigo for many years. The Zojirushi does not require pre-heating or pre-icing of the thermos like the Contigo.",
      "rating": 5.0,
      "verified": true,
      "author": "jodilane",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Perfect combination of coffee mug and thermos",
      "text": "This is the best coffee mug I've ever owned. It holds heat just a bit better than my previous thermos brand mug, but has a much more secure lid in my opinion. This mug came recommend by a few of my favorite coffee snobs and it really doesn't disappoint in anyway. In fact I'm still exceptionally impressed with the narrow shape design the chose. This mug exceptionally easy to disassemble and clean, but does require a bottle brush or really tiny hands to clean the inside of for those who are into that kind of thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sublimefly",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Good until I dropped it. Won't Buy it Again.",
      "text": "I had a similar Zojirushi water bottle bought in around 2013, used it daily till I lost it in 2019, great quality, easy to use, leak proof. It was so solid I dropped many times no scratch and broken plastic. After I lost it, I bought a lavender color one here in Oct 2019, dropped it once in February 2020, the plastic cap lid came off. So I bought another coral color one, it's was good until I accidentally dropped last week Oct 2020, the plastic totally broke by the push button. I won't buy this again, the quality of the plastic cap is just horrible...",
      "rating": 2.0,
      "verified": true,
      "author": "dudu",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Keeps drinks consistently hot and cold",
      "text": "Excellent product if you like your beverages a consistent temperature this is for you. I would encourage putting a beverage in this container at the absolute temperature that's perfect for you. It will stay that temp through out the day. \"Caution it will stay very hot if you put beverage in very hot.\" Last I would suggest cleaning it first with a mild fragrance free soap to avoid getting an aftertaste from first use. Try it out I'm sure you'll like it",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bell",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great mug... just make sure you buy the right one",
      "text": "I love my mug, it's a joy to use. Much lighter than expected, very clever closure that's easy to operate one-handed. I am pretty sure most of the problems people are having are from getting fakes from other sellers. You can see examples of the fakes vs. the real ones in the pictures. Before you buy, make SURE it says \"by Zojirushi\" right under the title. If it's coming from any other vendor, cancel your order, it's probably a fake.",
      "rating": 5.0,
      "verified": true,
      "author": "CMS",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "works well; i have not had to replace any parts to date",
      "text": "i'd used my container almost daily for 2 years now. it works well. when i separate the parts to clean thoroughly, it does leak quite a bit upon putting the parts together. it takes a bit of tweaking in order to get the perfect spill proof seal. this is quite a painful process but can be done. i'm giving it 5 stars despite this as this container helps keep my coffee warm throughout the day. i've bought 2 for myself as i wanted a different color and one as a gift which my daughter's teacher absolutely loves.",
      "rating": 5.0,
      "verified": true,
      "author": "icesociety",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Not all that",
      "text": "This is an ok product. It is well made and I really like that I was able to get it in a 12oz size which is easy to slip into my purse. It looks great. I got the champagne gold. However the main reason I bought it was to keep things hot. It’s just ok. It keeps things a little warmer than most similar hot cups. Nothing spectacular. Hot tea stays hot for several hours but not as hot as when it was put in. Still drinkable though. Bottom line, nothing keeps food or liquid as hot as a good old fashioned glass wall lined thermos.",
      "rating": 4.0,
      "verified": true,
      "author": "HABB",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great thermo",
      "text": "I got this thermo for the winter because it gets cold in my house. It works very well. It's been over half a year already and still keeps hot water warm for an entire day. It was easy to clean and big enough to satisfy my daily needs. I love the press to open and lock feature - never had and issue with leaks even when I'm tossing it in my bag. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "A.C.",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Metal clip obstructs drink spout on my 16 o mug bot ok on 20 oz",
      "text": "Either my 16 Oz mug is faulty or this particular model is a bad design. The opening metal clip is too tall and obstructs the drinking spout. I tired calling Zojirushi, but no one is available via phone nor email as they are closed due to COVID. Sadly, I need to return the bottle/mug, but would have been happy with a replacement lid which was not an option. Zojirushi should sell replacement lids.",
      "rating": 1.0,
      "verified": true,
      "author": "BB-Mpls",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "No leak at all; but temp keeping not as previous product",
      "text": "This is the third themo water bottle I bought - the three were the same brand and size. The first one, bought 4 or 5 years ago in Japan, was perfect, until I lost it during a trip. The second one, bought online from Amazon, was fine but one of the tiny silicon rings in side the cap got lost, after 2 months of use. The current one, also bought on Amazon, is the same as the previous one, but it doesn't keep water temp as long as the other two -- don't know if it's because the third one was made in Thailand, instead of in Japan as the first one.",
      "rating": 4.0,
      "verified": true,
      "author": "MZ",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Perfect size for commuting",
      "text": "My friend recommended this tumbler for me. I needed something that is easy to use for coffee on the bus. The slim shape is easy to hold. It does keep coffee warm for hours. I did leave it in my car once for 3-4 hours when it was about 30 degrees outside and it did turn the coffee luke warm- but overall its great. The lid is super secure- I dont mind just throwing it in my purse. Its easy to clean the lip part of tumbler also. Overall great product for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Saechao4427",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "yeehaw!!",
      "text": "Fantastic!! Only reason it's not getting 5 stars is due to the latch at the bottom of the lid being kind of awkward with my bottom lip when drinking, and the lid gets quite close to my nose but it's still wonderful. I left in the cold car for over 2 hours and almost burned my tongue on the coffee because it was still so hot - and it had creamer in it! I was amazed and pleased. Really a great product, made well, very sturdy, fits in BMW cup holders (which are smaller than American vehicles) and comes apart easily for cleaning.",
      "rating": 4.0,
      "verified": true,
      "author": "Oz",
      "helpful_votes": 2,
      "publication_date": 20170421
    },
    {
      "title": "Improved design and best quality. Keeps coffee warm for 6-8 hours",
      "text": "This is the 2nd one I got. It’s for my wife and she loves it. The 1st one I bought almost 2.5 years ago is still fully functional and hasn’t lost it ability to hold the heat. My wife loves hers and swears by it. She says it’s one of the best gifts I gave her. The best thing we like about this is: leakproof design and ability to keep the coffee warm for long period of times. She is a dental assistant so they work continuously for extended time. It’s impossible for her warm up her coffee frequently. With this, she doesn’t need to do it at all. With previous one, it would be very hour",
      "rating": 5.0,
      "verified": true,
      "author": "Goodsound",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Scratches easily",
      "text": "Mug definitely does it's job when it comes to heat retention. The lid is very well built and sealed and the spring lid pops open with no delay. Nice to have the locking option on the lid as well. However, the exterior has some sort of coating on it that scratches incredibly easily. Just putting in the dish rack scratched the whole side. For the premium paid over other comparable flasks I was a bit disappointed. All in all though an very good mug.",
      "rating": 4.0,
      "verified": true,
      "author": "Jonathan Q",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "You need this",
      "text": "This is our third Zojirushi mug like this and I couldn't be happier. My favorite things about them: So easy to clean They keep beverages hot or cold for a long, long time Flavors don't stick so I can have coffee all day long and lemonade for bed with no cross flavors The things I don't like: Things stay hot for so long! I've burned my tongue hours after pouring my coffee! But that's more my fault than a con for this mug. I recommend them to all the coffee drinkers in my life. I also recommend to anyone that enjoys a cold beverage without ice watering it down because it takes all day for the ice to melt.",
      "rating": 5.0,
      "verified": true,
      "author": "C Marie",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Premium price but low quality",
      "text": "I purchased this brand several years back and loved it (other than the peeling exterior finish which I lived with). As stated by other reviewers, my drink would stay hot for hours & I never had problems with it. I purchased another one less than 2 weeks ago & the lid is having problems with the various components. I literally spent about 10 minutes trying to reassemble the lid which I hadn't taken apart--it just came undone. Considering the premium price for the product, I don't feel like I have a quality product. I will look for another brand on my next purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Super insulated, no leaks",
      "text": "The only problem is that the liner is stained from the coffee despite wasting daily with a bottle brush. But keeps beverages warm even after 30 hours in freezing cold. Definitely leak proof. I’ve taken it everywhere and it’s amazing and very sturdy. I must have dropped it hundreds of times and still nothing broken, not the cover, but the base. Well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "selcuk",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "The size is just right",
      "text": "I like the small size (16 oz.) which means that if fits most regular-sized insulated lunch boxes. The insulation is very good. My old container was not a Zojirushi, and was a bit larger. It would not stay even warm in a lunch box or on my desk. This stays hot even in a lunch box with an ice block in it. Also, the external wall does not feel warm when it is filled with 208F tea. So the other items in the box that need to stay cold are not warmed by the temperature inside this container. The contents are still hot up to four hours–when I drink the last of the tea.",
      "rating": 5.0,
      "verified": true,
      "author": "royar",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Expectations",
      "text": "FAILS other cup had ice at 7 hours later with top open - this unit had no ice after 4 hours. HYPE just like yeti - look further I am searching for the an additional cup which was a gift. Unable to determine the maker",
      "rating": 1.0,
      "verified": true,
      "author": "John D",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Permanently has coffee taste",
      "text": "The thermos had hot coffee in it once and now I can’t get the smell and taste out. Used baking soda, vinegar and sudsy water but won’t leave. It’s ruined it for me to drink refreshing benign water.",
      "rating": 1.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Keeps My Tea Hot, But...",
      "text": "So after exhaustive research now I have the opposite problem, this mug keeps my tea TOO hot! Maybe I can work around that. What I can't find the answer to after a few searches among the customer questions here on the product's Amazon page, is how quickly the kind of silicone taste from the stopper will go away. I understand it's BPA-free which is great but I sure wish this taste would disappear. If it's still emitting that after a few more uses I'll consider returning it, unfortunately.",
      "rating": 3.0,
      "verified": true,
      "author": "Long Island, NY Resident",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Keeps coffee hot!",
      "text": "This coffee mug really does keep my coffee hot--for that and for \"looks\" I give it 5/5 stars. It's not super easy to clean. You have to take it apart (the top comes off in two pieces) and I have had to use a toothpick on a paper towel to get coffee out of the nooks and crannies. Not impossible, but not super easy either. (I wash it by hand.) For that, I give it 4/5 stars. The lip that you drink from is okay, but seems like it could have been placed differently to make it easier to sip from. All in all -- a great mug -- and I'd buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "DLT",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "great mug!",
      "text": "Were gifted these a couple of years ago and the hot drink is still warm; no really they keep your hot coffee almost to hot to drink for a long time, soloing that we have bought more as gifts. They come in great colors and actually fit in any cup holder,",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "A mug for life",
      "text": "II bought my first zojirushi over 30 years ago (left). It is indestructible. I use it for long hikes, skiing and other outdoor activities. It fell on rocks, survived extensive beach sand and keeps drinks hot for a long period of time. I have gone through many leaky supermarket quality coffee mugs before I decided to search for this brand online. I couldn’t be happier with my new mug (right) The other day it was 5 degrees Fahrenheit and I had left my half full mug in the cold car overnight. To my surprise the coffee was still warm when I tried it in the morning. Definitely a brand for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Markus R.",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Keeps coffee hot and yummy for hours :)",
      "text": "This is a pretty dope thermos. I got tired of wasting money at work on coffee, and the cups don't insulate very well. This thermos will keep your coffee hot for an extremely long time; I haven't timed it out to see how long before it reaches room temperature, but I have gotten to work at 7:30 AM and the leftover coffee is still \"acceptably hot\" when I return from lunch at 12:30 PM. Just remember to keep the lid closed or it will cool off faster.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "THIS IS THE ONE",
      "text": "This bottle is by far the very best of its kind. Completely tight not a single drop spilled and keeps coffee tongue-burning-hot for many hours. I have used yeti cups for a long time, they keep drinks hot /cold for a long time remarkably well BUT I got sick and tired of spilling my coffee everywhere. I tried yeti lids and off brand lids with no luck. Fantastic cup , love the size, slender and not bulky and still fits 16oz. Would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Gingermom",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "BEST thermos ever",
      "text": "This is the absolute best thermos I have ever had. It keeps thing REALLY hot for up to 8 hours...seriously. I travel with one all the time, save on tea and paper cups and have my own best brew. I recommend this product to anyone wanting a good thermos on the go. Our family has four all together...great colors, great product, great price. In one week long trip last fall I saved the price of the thermos by not buying my daily daffiness from Starbucks (who we like to avoid anyway).",
      "rating": 5.0,
      "verified": true,
      "author": "H. Arps",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Keeps drinks hot for a long time!!",
      "text": "The travel mug is great and prevents leaks from occurring. I like the lock function of the cover to prevent the lid from opening while carrying in my bag. The thermos also keeps my coffee hot/warm for hours throughout the day which is awesome. It is pretty easy to drink from but sometimes the upper portion of the flip top can get stuff on your face so watch out there lol. Thermos comes apart easily for cleaning but needs to be done often to ensure it is clean for every use.",
      "rating": 5.0,
      "verified": true,
      "author": "JCONN ",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "So good I bought two",
      "text": "My husband bought me this one for my birthday and I ended up getting him the same one in black for his! I love the slender design - it's easier to hold with my small hands. The spout does not let too much come out, which is good since I use this 5 days a week while driving to work. I'm not sure I see the benefit of the lock. It's been spill proof and keeps my coffee warm. I usually drink my coffee within 1-2 hrs so I can't really say that it'll keep it piping hot but I've left coffee in there all day and it's still warm ish 12 hrs later. I handwash only.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Lynn P Khang",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Valuable and Keep Worthy",
      "text": "This is a great mug. Keeps drinks hot for a long time and I have found it leak proof. I lost 3 of them in school and this is a very pricy investment. I prefer the stainless steel -again-even more pricy than the colors- The colors wear off and is not environmentally friendly. This is NOT dishwasher safe. If you have a color mug, the colors will not only wear off, but may get onto your other products in the dishwasher. Also, the top broke from the dishwasher's heat. This is very expensive and the quality is higher than most other hot/cold mugs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kazuko Ono",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Superior to Contigo Mugs",
      "text": "I purchased this after my third Contigo travel mug lid broke in under a year and I am very happy with this product. I use it daily for coffee and it is easy to clean and put back together and does not retain odors. It also is tough - I often drop it (when closed) while on the train and it has retained no dents.",
      "rating": 5.0,
      "verified": true,
      "author": "Dorie",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Not great",
      "text": "Returned this ! Does not keep coffee hot! This doesn't have the lining in it like pictured so it doesn't keep liquid s hot. I returned this and bought another one but in a different color that has the lining. I think this color is an per style",
      "rating": 1.0,
      "verified": true,
      "author": "Viki",
      "helpful_votes": 2,
      "publication_date": 20181223
    },
    {
      "title": "Best Ever!",
      "text": "Hands down, this is the best thermos for my coffee. It is still warm the next day. I don't know that it's possible, but it seems like my coffee gets even hotter when I pour it in the thermos. I drink from it all day. I wouldn't go with any other brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Leaks!",
      "text": "I purchased when I lost my 20oz bottle. Loved this one for all of 9 months, and then it started leaking one day - and at the worst possible time. Got drenched in steaming hot coffee while driving on the freeway and almost wrecked. I can't figure out what is causing the leak. Replacement parts cost half of a new thermos...",
      "rating": 3.0,
      "verified": true,
      "author": "Shara ChesTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Hot coffee all day",
      "text": "This thermos will keep your coffee hot until the end of time. Yes, fine, I'm exaggerating, but I'm bad about being a slow coffee drinker. This used to mean that some of my coffee either got wasted or consumed stone cold, but not anymore. I fill this thermos at 7:20 am, leave the lid open once I get to my desk to allow it to at least cool enough to not remove the surface of my tongue, and then finish my still-hotter-than-room-temperature coffee sometime after lunch. It shouldn't be possible, but it is. Also, I have zero worries about it leaking when I throw it into my bag with my lunch. It has a super tight seal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Stays hot all day!",
      "text": "I just ordered my 4th mug - I've lost a couple and given some as gifts. Today I must have dropped mine as I got in the car. I drove back home when I realized I didn't have it. There it was smashed on the garage floor! But the coffee didn't even spill. I poured it into an old spare and went on my way. Best mug ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Nana Beth",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Best Ever",
      "text": "I purchased the coffee thermos and it is by far the best one ever. Including those high priced y$#-. I have purchased lots this year and tested them myself. Don’t think because it is a brand name, that it is better, because it’s not. I have never heard of this company...but you seriously have to try.",
      "rating": 5.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "I love this product",
      "text": "I love this product, I preheat for three minutes with hot water and then enjoy my hot coffee for hours and hours, this product works so good I just bought two more, one more 16 ounce and one 12 ounce, it is easy to clean and maintain, the inside is all stainless not like the other zojirushi ones with some type of coating in them, flip top opens fast if you want to or slow to let any liquids drip off the seal first, if you buy one play with the button and you will see it has two ways on using the button, lock feature works great also, overall very good quality item to own.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Light and No Leak",
      "text": "And easy to wash (every parts). I used to use another brand's thermos which was heavier, and I couldn't wash every parts even I notice some rubber parts start getting black dots. But this thermo's rubber parts are all washable. Also, when I was using a different brand's thermos, I've often forgotten to screw the cap tightly, then, leaked in my bag. This thermos don't need to \"screw\" to close, but it need to be pushed until you hear the clicking sound. So, I don't need to worry about even tiny leaking. I'm thinking buying extra one for my family. Also, I'm thinking to buy another size for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Mizy",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "4 Keeps coffee hot!",
      "text": "Compared to my last two mugs (Contigo), this mug keeps my coffee hot for hours longer. And I mean hot, not lukewarm. I literally burned my tongue the first morning I drank from this, because I was used to lukewarm coffee by the time I got to the office. Not this mug. The first day, out of curiosity, I kept some coffee in the mug for 4 hours, and it was still hot. Kudos to the maker.",
      "rating": 5.0,
      "verified": true,
      "author": "John Lennerton",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Keeps drinks piping hot for hours and lasts for years",
      "text": "I've been through many coffee mugs over the years and they all pale in comparison to the Zojirushi. PROS: -Coffee stays piping hot for many hours -The 12oz mug fits under a standard Keurig coffee maker and fits a large (10oz.) coffee with room for milk or cream -Two years later, the mug is still going strong CONS: -These are not meant to go in the dishwasher. I ignored the instruction to hand wash and while the mug still works well, the coating began to wear off. -The 16oz mug does not fit under a Keurig machine",
      "rating": 5.0,
      "verified": true,
      "author": "Magathy",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Never leaks. Keeps drink hot.",
      "text": "I had a similar one for ~ 10 years, and the mouthpiece finally started not fitting right, so I bought this as a replacement. It does almost everything I want (keeps coffee or tea hot for hours and hours, doesn’t leak no matter how I treat it, does not affect taste of drink), but the whole thing can’t go in the dishwasher, hence the 4 stars for cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Give what you love",
      "text": "I already have one of these water/coffee/drinking bottles and I decided to get my aunt one for Christmas. I have light lime green and I got her the metallic lilac. They are very sturdily constructed, although after about one year you'll notice the paint wearing a little. It's not the easiest to clean but it keeps your drink at the tempurature you put it in the container for 6+ hours. I just remember putting hot coffee in it once and burning my tongue on it about 5 hours later. Ouch!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia Gaines",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Compact/ Sleek/ Leak Proof",
      "text": "I only write reviews if I think others should purchase. I went through dozens of articles trying to find the best thermos for regular use. Most of my point of contention were that the thermos was bulky, a leaker, or the drinking spout was weird. My husband and I have a few zojoroshi products (our favorite being the rice maker) and he decided to purchase a blue one. After a month of trying to share it, I went ahead and purchase my own. It doesn't leak, the mouth piece is designed for easy consumption of your beverage, it keeps heat and cold.. There is a locking future, and it fits well into my backpack and hand. BUY IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "EXCELLENT BUY! DON’T HESITATE!",
      "text": "The very first night I received it, I filled it up with some raspberry lemonade, checked it 18 hours later, I was AMAZED, and it was still cold! I’ve dumped out so many drinks over the years from it going warm after hours and it tasting no good, now that I have this...NO MORE WASTE! This mug is the REAL DEAL! The price compared to similars products/brands is pretty good too. WELL WORTH BUYING!💯",
      "rating": 5.0,
      "verified": true,
      "author": "Fly Gambino",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Love this mug!",
      "text": "My parents have these mugs and use them for when they travel and always raved about them. I bought this coffee mug for work, and used it for the first time today and wow! I got my Starbucks at 7:15 am, 2:00 pm the coffee was still hot, and by 6:00 pm when I got home, it was warm. I couldn't believe it! I also love the lock function; I am clumsy, and actually did knock it over and it didn't spill. My only issue is I should've bought the 12 oz, it is too tall to fit under the Tassimo.. but I usually get a Starbucks in the morning so it should be alright. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "eboehnlein_629",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "It holds coffee/tea hot for a very long time",
      "text": "I like the design...it is slender and fits easily in a car cup holder. It is easy to use and wash. But the most important thing is that it keeps hot drinks really hot for a very long time. It is also easy to sip them without spilling and so far, it has been leak free.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Hard to drink from, terrible design",
      "text": "The lock juts up and impedes being able to drink. It just into your lower lip/chin. I have another zohirushi in a different style and I love it so I’m massively disappointed with this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Pro: Holds temperature well. Con: Does not hold liquid well.",
      "text": "While I was happy with this mug for keeping my coffee hot and my cold water cold. I was incredibly disappointed to find that liquid will spill if the mug is turned on its' side or flipped over. Definitely cannot recommend if you plan on putting the mug inside of your bag for travel.",
      "rating": 2.0,
      "verified": true,
      "author": "Phillip Fernandez",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "I like this mug so much",
      "text": "I only write reviews when I’m blown-away by a product. I like this mug so much, I just bought 25 to give as gifts.I’ve used dozens of travel mugs over the years, including Yeti and Contigo, nothing comes close to keeping my coffee hot like this one. Plus, it’s impossible to lose the top. UPDATE: After using for a while, I still love how hot it keeps my coffee, but the other model I bought, SM-SC60HM, has much better ergonomics. The latch placement is better- it doesn’t stab you in the chin.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Dempsey",
      "helpful_votes": 2,
      "publication_date": 20171215
    },
    {
      "title": "Rust spot after return period over",
      "text": "The product itself was very good. I used it for my son’s formula water and it kept the water warm, but I had to stop using it immediately as it developed a small rust spot inside after the return period was over.",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 2,
      "publication_date": 20190926
    },
    {
      "title": "Best mug there is",
      "text": "I have used many brands of travel mugs over the years, but Zojirushi is the one I'm sticking with now. These mugs are the best insulating. The lid is definitely more cleanable than most. I really enjoy how even the hottest beverages can be drank immediately because of the way the lid lets you sip and aerate the liquid.",
      "rating": 5.0,
      "verified": true,
      "author": "RedStripedShirt",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "Love HOT coffee",
      "text": "not one to write reviews but this one deserves it. I had a great old travel mug (so I thought) that served me well for 15 years. Coffee went in preheated and stayed hot for about 1.5 hours and then dropped off to warm within 3 hours. I was going to reorder the old one but kept looking at this ones reviews. I had to try it! Preheat bottle with hot water, put in coffee and still HOT 3hours later and VERY WARM 5 hours later- could have been good for longer but I drink coffee with in 5 hours. Only been a month but use it every day, no issues and would buy again, nothing compares to it",
      "rating": 5.0,
      "verified": true,
      "author": "Mark K. Lilly",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Keeps coffee hot for many hours!",
      "text": "This is for sure the best coffee travel mug I had. I had ones that are easier to drink from or easier to clean, but none of them kept coffee or tea hot for so long. 6-7 hours at room temperature, and beverage still can literally burn your mouth! Other major brands mugs like Contigo aren't as hot after only 2-3 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "V.S.Top Contributor: Watches",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "BEST TRAVEL MUG EVER INVENTED !!!!!",
      "text": "First, I have to say, \"where has this cup been all my life\". Second, and probably should be first, this has to be the best mug/cup I have ever had. It keeps my coffee hot ALL day. I only use it for coffee. The Keurig mugs do not hold up and are junk ! This is the BEST CUP/MUG ever to be invented. THANK YOU. THANK YOU. And, oh and by the way did I say THANK YOU !!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Wheeler",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Flip broke so the lid won’t close.",
      "text": "The flip cover broke exactly on day 31. Hence the lid can’t be closed and it becomes useless. Since it broke on day 31, I just passed the return date and have to keep the broken thermostat which is 31 days old ! !! I paid dearly hoping to get a quality product so it is very disappointed to me. I definitely will not recommend to anybody for this product ! Please see the pictures attached.",
      "rating": 1.0,
      "verified": true,
      "author": "Sophia",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Best coffee mug around",
      "text": "This is the second Zojirushi I've bought (I lost the first one after 6 years). This is an amazing mug. Keeps your drink hot for hours (It kept my coffee hot for 24 hours once when I left it at home). The 12oz size is perfect for me (morning latte). This latest version is easier to keep clean than my last mug (there is no inner lining that got stained with my last one). It's complexly spill proof which is great when you want to throw the mug in your bag for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Imohed",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Keeps warm well",
      "text": "I had hot coffee in mug leave it inside my car for almost 6 hours. And my car parked outside in the cold. I’m impressed the mug keeps coffee warm well. I was worried about color peel off. So I purchased stainless mug and stainless looks nice. So far I liked it but I think the price is little pricey. The mug made in Thailand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200212
    }
  ],
  "product_meta": {
    "title": "Zojirushi Stainless Steel Mug, 16oz, Smoky Blue",
    "description": "Size:16 oz| Color:Smoky Blue\n\nZOJIRUSHI SLICKSTEEL FINISH STAINLESS STEEL MUG\nSM-KHE 36/48\nZojirushi's stainless steel vacuum insulation mug will keep your beverages hot or cold for 6 hours. The compact design takes minimal space and fits in all standard cup holders while maximizing capacity. The flip lid is designed to open with a single hand. The flip lid is tightly fitted for excellent heat retention and features a safety lock to prevent accidental opening. These mugs have a stainless steel interior with SlickSteel finish. Utilizing electro-polishing technology, these products are non-coated on the inside and instead use an electrically charged polishing process to treat and finish the interior. The result is a corrosion resistant surface that repels foreign substances and stains, creating a smooth and ultra-clean stainless steel environment for your drinks.\n\nSM-KHE TRAVEL MUG FEATURES\n * Beautiful Sleek design\n * Stainless steel vacuum insulation keeps beverages hot or cold for hours\n * Durable and sanitary 18/8 stainless steel interior with SlickSteel Finish\n * SlickSteel Finish interior resists corrosion and repels stains\n * Flip-Open lid with safetly lock prevents the lid from opening accidentally\n * Tight fitted lid keeps beverages hotter or colder than travel mugs\n * Compact design takes minimal space whilemaximizing capacity\n\nHOW DOES IT KEEP BEVERAGES HOT OR COLD? \nWith Zojirushi's renowned vacuum insulation technology, air between the two thin layers of stainless steel on the outer container is removed, creating a vacuum. Because there is no air, the temperature on the outside does not transfer into the container; keeping your beverage hot or cold for hours.\n\nABOUT ZOJIRUSHI SLICKSTEEL FINISH \nZojirushi SlickSteel Finish is an alternative to our fluorine nonstick coated products. With the ever changing trends of today, Zojirushi innovation continues to produce choices for any lifestyle. SlickSteel is a registered trademark of Zojirushi.\n\nDesigned to drink directly from the mug Stopper disassembles for thorough cleaning Wide mouth accommodates full size ice cubes Zojirushi America Corporation warrants only the thermal insulation of certain vacuum insulated products against defects for a period of five years from the date of original retail purchase",
    "rating": 4.7,
    "feature_bullets": [
      "Lush Decor Rosalie window panel set is the ideal curtain for your shabby chic, modern or farmhouse décor",
      "MODERN PHOTO FRAME: Prisma’s geometric shape picture frames are both decorative and functional",
      "FLOATING IMAGE DESIGN: Prisma’s innovative design floats your photo between two panes of glass, while allowing the geometric frame to show through",
      "Fabric curtain material: 50% Cotton/45% Polyester/5% Linen. Curtains are not lined and have a 3” rod pocket",
      "Due to the delicate nature of the design, these items are dry clean only",
      "This rug is made of polypropylene with a cotton backing"
    ],
    "specifications": {
      "Product Dimensions": "2.75 x 2.75 x 9.13 inches",
      "Item Weight": "9 ounces",
      "Manufacturer": "Zojirushi",
      "ASIN": "B005PO9T44",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "SM-KHE48AG",
      "Customer Reviews": "4.7 out of 5 stars11,896 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#3,041 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "September 7, 2011"
    },
    "categories": [
      "Travel & To-Go Drinkware",
      "Home & Kitchen",
      "Kitchen & Dining",
      "Thermoses"
    ],
    "price": 20.79
  }
}