{
  "website_summaries": [
    {
      "verdict": "Well made for the most part, with the exception of an occasional faulty locking mechanism. Still, many fans of IRWIN tools brag about its quality and affordability.",
      "pros": [
        "A basic combination square with a heavy build, thanks to the zinc cast and stainless steel construction",
        "Increments are easy to read"
      ],
      "cons": [
        "Blade lock mechanism tends to stick or malfunction",
        "A few reports of a couple degrees off square",
        "but many more rave reviews of its accuracy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Never square",
      "text": "I had no idea that squares aren't guaranteed to be square. When I started seeing several projects ruined, I decided to check the square against other squares. Not square! It's been a sad disappointing education for me, that only a couple of the squares I own are close to square. Close, not really square. I've been using this square for months and assumed that I just needed to be more careful. The worst feature of this square, is that it's unsquareness changes every time I adjust it.",
      "rating": 1.0,
      "verified": true,
      "author": "Gordon B. West",
      "helpful_votes": 43,
      "publication_date": 20181013
    },
    {
      "title": "OK for the money, but not accurate enough for fine work",
      "text": "It’s sturdy and well made but not accurate enough for fine work. It has eighth, sixteenth, and thirty-second inch scales, and a millimeter scale. I checked it against an engineering square I trust, and it’s off by perhaps 1/128” over the length of the scale. By comparison, my Starrett combination square is perfect relative to my reference square and has a 1/64” scale instead of the metric scale. For me this is OK for some rough carpentry, but more accuracy is needed, for example, to set a miter gauge square on a table saw.",
      "rating": 3.0,
      "verified": true,
      "author": "Leonard Lehew",
      "helpful_votes": 17,
      "publication_date": 20180712
    },
    {
      "title": "Not true square.",
      "text": "Slide function is terrible. Quality control failure in manufacture. Off by 1 full degree in 7 inches.",
      "rating": 1.0,
      "verified": true,
      "author": "Tested and evaluated",
      "helpful_votes": 20,
      "publication_date": 20180617
    },
    {
      "title": "It's great other than",
      "text": "The angle between the blade and the base was not square on mine. It was maybe 2 degrees off. I checked it against several try squares and a speed square, all of them showed the same lack of squareness in the IRWIN square. I was very surprised by this. The base itself is square, but the blade is not square in relation to the base. It's a square, it needs to be...square. So, one star because it isn't. If it were, it'd be 5 stars. It's great other than, you know, not being square.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 77,
      "publication_date": 20161005
    },
    {
      "title": "Hard to put blade back in if removed, otherwise nice",
      "text": "The blade on this has clear markings. The edges are so flat that the blade is nearly sharp. There's a small ding on one end of the blade (looks like it was bumped into a grinder). It's square (which is why I had to replace my old combination square!). My only real complaint about this in use is that if you remove the blade entirely, it's pretty fiddly to get the slot on the blade and the clamping screw aligned properly again to reassemble it. If you are someone who removes the blade a lot or flips it around to switch between metric/imperial units you will probably not like this square.",
      "rating": 4.0,
      "verified": true,
      "author": "Benedict J. Jackson",
      "helpful_votes": 8,
      "publication_date": 20180120
    },
    {
      "title": "Would have been great if I received a new product and not a used one.",
      "text": "I purchased this combination square because it has very good reviews and is at a great price point. I could easily see myself giving this 5 starts. However the issue is that I received a clearly used product. I should have realized when the cardboard packaging was ripped to pieces upon arrival. The square I received has scuff marks all over it and what appears to be glue along parts of the ruler. This causes the ruler to be extremely difficult to slide and move the measurement around. Very disappointed with quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Doucett",
      "helpful_votes": 2,
      "publication_date": 20200402
    },
    {
      "title": "Great combo square: does what a $100 does, and does it well.",
      "text": "Very well made, feels relatively heavy and sturdy when you grab it. The ruler has very good etched markings. Both sides are used: one side Imperial and the other side is Metric. I was looking for a combination square for quite some time. Sure, the \"expensive\" models do look nice to show off but what the heck ... I wanted something functional without breaking the bank. This combo square is great and can do what the elite can do, no problems! I can't stress enough its qualities, so do yourself a favor and buy this one.",
      "rating": 5.0,
      "verified": true,
      "author": "alexdelara",
      "helpful_votes": 3,
      "publication_date": 20180316
    },
    {
      "title": "OK for the money",
      "text": "I thought this item would be sturdy. Feels flimsier than my old steel Stanley. I dropped it yesterday. My old Stanley nicks the concreted surface. My new tool smashed the corner of the ruler. Don't seem that hard of a material to me. I wanted to get rid of the Stanley because my eyes are not what they used to be and this item claimed better readability. Yes, characters are more readable, but just barely more. I have seen them where the characters and lines are laser engraved or powder coated, I don't know, but are more visible than this one. Sorry. I had higher expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "JC Delgado",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Falls apart and inaccurate.",
      "text": "If the screw is at all loosened the ruler will not stay in the slot. It rocks out of the groove. The level is off. Very disappointed. I will be returning it. I purchased an empire combination square after this one. The empire combination square’s level was calibrated accurately, the slide works easier, it holds tighter, the numbers are easier to read and was cheaper. I suggest you buy a brand other than Irwin.",
      "rating": 1.0,
      "verified": true,
      "author": "Magurk",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Not bad, but a bit rough",
      "text": "My specimen of this Irwin combination square is just slightly out of square--regrettable, but not enough to cause a problem with the kind of work I use it for. The corners of the rule itself are square, but a couple of them are beveled on a surface that should be flat. This can be visually somewhat confusing. The edges are rather sharp in many places and some of the surfaces are rough with tool marks. No doubt the manufacturer could have done a better job. Nevertheless, I'd say the overall quality is acceptable for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "jimmy",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Easy to read very sharp edges, which for a combo square is a good thing.",
      "text": "Great combo square much nicer than my cheap harbor freight alternative. The only problem I had wasn't with the square but with Amazon shipping. They shipped the combination square which has sharp edges and points with another item without any form of protection from the square. So when I opened the packaged the square had cut through the coarboard box of the other item and it's contents spilled out. I did contact Amazon and they made it right.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "METRIC!  It has metric along one edge of one side!",
      "text": "Yep, I live in one of the last 3 countries that doesn't use the metric system (yet) and have trouble finding tools in metric for a reasonable price. I had nearly spent a bit more to get one that was metric on one side but figured this would work for now. I just got it today and will come back to finish this review once I've had a chance to use it and check for accuracy.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Loscheider",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Great combination square for this price. Do not compare it with a $100 combination square",
      "text": "Great combination square for the price. I did the classic test drawing a line using the square, then turning the square and drawing the line in the same exact spot to check if it matches and the results are really good for this price. With pencils the lines match perfectly. Only with thinner lines I can see a little difference(maybe 1/64). I added pictures of the results. Do not compare this with a Starret. A better one a little more expensive would be the iGaging squares. But this one does a great job. Also, I didn't know it has a little marking pointer to make thin lines. Apparently every combination square has it.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 16,
      "publication_date": 20170511
    },
    {
      "title": "Great square for the low cost",
      "text": "The Irwin combination square has a very rigid and solid feel and its weight is nice (my preference on weight). The square has inches/imperial depending on how you call it of (1/8\",1/16\",1/32\") and metric (cm). The bubble gauge is a transparent yellow/green, so you'll be able to see through to your working surface if need be. There is a scribe pin on the bottom of the handle,looks like a brass colored bulb nice addition for crisp lines/markings (the scribe is not carbide but still works). Overall great square, meets the basics and then some.",
      "rating": 5.0,
      "verified": true,
      "author": "Lourdes",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Well built, sturdy tool. Absolutely love it.",
      "text": "Ordered this to help with (mainly) tile cutting during a recent bathroom reno, so pleased I ordered this one. The sliding nature allows you to select and lock in any measurement that in turn helps with marking your work, this single feature has helped me hundreds of times and saved me a ton of time. Also having the ability to mark at 45' as well as 90 have been essential for me. All in all, an absolutly fabulous tool for a fantastic price.",
      "rating": 5.0,
      "verified": true,
      "author": "Gus Chops",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Read the other reviews first - Not square",
      "text": "I unfortunately used this square for some woodworking projects and even squared my table saw to this square. After several issues I just thought it was my setup or my measuring errors. I recently tried to use it for a metalworking project and realized it was not square. I have about 3/32\" gap at 12\" when doing the 'flip' method of measuring for squareness.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard Banks",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Total junk...",
      "text": "The head would not stay on the blade; even with the locking screw tightened up. All it takes is very slight pressure on the top of the head and it disengages from the blade. Put it back together several times, same result. Bought this 12\" and a 6\" ; ended up sending them both back- the 6\" had the first 1/16\" missing at the top of the blade (manufacturing defect) IRWIN, where is your QC???",
      "rating": 1.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Great tool after 5 minutes of work.",
      "text": "Bottom line: Great build quality for what you pay. SET THIS THING UP BEFORE YOU START MARKING AND CUTTING ALL WILLY-NILLY. It most likely will not be perfectly square when you get it, but you can set it up with a pencil or marking knife and some sandpaper. Draw a couple of straight lines at max length right on top of each other, flip the body between lines... you know what? YouTube can show you how in about 5 minutes. It is well worth the time and effort, and ABSOLUTELY ESSENTIAL if you want repeatable, accurate results.",
      "rating": 4.0,
      "verified": true,
      "author": "CPB",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "A bit rough in finish but perfect for wood work,",
      "text": "For the price this is very good combination square. It is no Starette, or Mitutoyo but they are considerably more expensive. For wood work, floor tile, etc it is plenty good enough. The reason for four stars is the steel rule had sharp un-radiused edges and the rule edge was rough. It took just a few minutes to stone them away. For the use it will be put to it is perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Signalshifter",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "A nice combo square for the money!",
      "text": "I needed a decent woodworking combination square for my shop at my vacation home and gave this a try. I am very impressed with the overall quality for the money. I own Starrett brand ones 'back home' and this Irwin brand while not being quite as capable as those, you have to look at the cost comparison. For the money and for non-machinist type projects you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Stellerman",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "NOT SQUARE!",
      "text": "When compared to three other squares that I have of different manufacturers, this one was out of square by about 25 thousandths of an inch at the end of the 12 in length. Unacceptable. Furthermore, the finish of this tool is very poor; lots of sharp edges for a hand tool.",
      "rating": 1.0,
      "verified": true,
      "author": "MaykR",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good quality for the price",
      "text": "Nice tool. All metal feels good in your hand. The only little thing I noticed was that the little scribe point is just held in by friction. Every other combination square I've ever owned, the piece was threaded and it screwed in. It's not like I ever use the scribe point, but I still wouldn't want to lose it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Jet",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Poor craftmanship",
      "text": "This is both inaccurate and poorly made as well even considering the price. Even after I worked the considerable amount of burrs out it was inaccurate in excess of 1/4 inch. Spend some more money and save yourself some frustration and ultimately money.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Goblin",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Don’t buy, spend a little more and get something that will last a lifetime",
      "text": "The adjustment screw tab that should ride along the groove doesn’t stay in its track. Horrible accuracy because of this. Everything else about this is decent but if it doesn’t stay in its track it becomes a paper weight. Spend the extra money and get a better one",
      "rating": 1.0,
      "verified": true,
      "author": "John K. Fullmer",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Nice product. Dead on square.",
      "text": "Great combo square for any wood-shop. Checked this against one of my machinist squares and it is dead on. the ruler part seems to be made out of thicker steel than most, which is nice to avoid warping and denting. Have not really used the level yet, but I don't do many things where i need to level in a corner. All in all, I would say this a great square.",
      "rating": 5.0,
      "verified": true,
      "author": "C n C Computers",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "A Square Deal",
      "text": "I picked up a few of these for my middle school woodshop class. They are easy to read and seem like they will last - even in the hands of middle schoolers. If I buy myself another one, I will get one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Ed",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Works for me!",
      "text": "I was concerned that several people indicated that over the length this item was 1l16\" out of square so I measured it as soon as it arrived. It was right on the money and well made. No problems, whatsoever and at a reasonable price. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "David Ussell",
      "helpful_votes": 2,
      "publication_date": 20181015
    },
    {
      "title": "Searched high and low for a quality Combo Square",
      "text": "Stout. Spot on square (at least for a combo square). I do wish it slid easier in the clamp but perhaps it will break in for smoother movement in time. I am a professional builder and my old one had me spoiled but I caught it in a miter saw and cut it. I recommend this if you are a combination square kind of carpenter rather than a speed square guy.",
      "rating": 4.0,
      "verified": true,
      "author": "Yonder",
      "helpful_votes": 7,
      "publication_date": 20150122
    },
    {
      "title": "Perfectly square",
      "text": "I was apprehensive about ordering this combination square after reading reviews. When it arrived i opened the box and immediately inspected it for quality and squareness. I can say mine is perfect. I would definitely buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "William Frank",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Wish wood glue were easier to remove from it. ...",
      "text": "Wish wood glue were easier to remove from it. This is the most used tool in my shop and this one is up to the abuse and workload. Its a solid well made piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 3,
      "publication_date": 20171113
    },
    {
      "title": "Missing parts",
      "text": "All I received was the ruler and literally nothing else. Shoudlve trusted the reviews. This caused me to have to drive an emergency trip to Dothan Lowes to buy another one.",
      "rating": 1.0,
      "verified": true,
      "author": "Norimokutakina",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Best $20 You'll ever Spend",
      "text": "One of the most versitile tools you'll ever get for an excellent price. You can get a straight edge, a 45 degree mitre, a solid ruler and a square. Oh and it comes with a level and a scribing tool. No reason not to get it. Irwin has made a solid piece of equipment. Easily worth $40-$50 on the construction alone.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Hill",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Excellent combination square",
      "text": "The Irwin combination squares are good quality and easy to use. They slide smooth and are accurate. I have several of these and use them on my projects frequently. I recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Roth",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Amazing value",
      "text": "For the money I seriously don't think this combo square can be beat. I have had it for a few months now and it is very versatile and does the job without getting in the way of what I'm doing. You get more than what you pay for, and unless you are going to be buying something like woodpecker brand this is perfect for what you'll need.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Superb fit & finish. Check tested and 100% square. I know you have one, but for $15 you need a new better one.",
      "text": "An absolutely stellar deal on a tool every DIY'er must have. Toss your old one that probably isn't square any more and get this Irwin for $15 bucks. Take care of it and it will likely last a lifetime. If your a pro cabinet maker, maybe you want one costing 3-4 times as much. For 95% of us, this is a great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "HutchyTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Extremely low quality",
      "text": "This thing is a crappy tool. Adjustment but won't engage properly. I got so frustrated that I threw it in the trash. Quality control for Irwin has definitely declined.",
      "rating": 1.0,
      "verified": true,
      "author": "Oliver Dunn",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Quality instrument at an affordable price",
      "text": "For years, I had a cheap combo square in my toolbox. Last time I tried to use it, I got so frustrated that I bought this new, high-quality square. I've used this one several times since and it's a pleasure to use. Easy to read, accurate, english and metric scales, a quality instrument at an affordable price. No regrets, wish I'd gotten this one years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "James Smith",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Great quality",
      "text": "Perfectly square to a machinist square. Measurement markings are accurate to my 123 block standard. For the price a great value for the quality. Has a good heft the head is made of sturdy metal. For hobbyist woodworking this is all I need. No need to spend 5-10 times more money for a igaging or starrett in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Amarillo by morning",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Sent a used tool",
      "text": "Product showed up on time. The tools packaging was torn along with scratches and what looked like a black construction adhesive on the ruler. I was debating with myself whether to purchase the Irwin or the Swanson combination square, obviously I made the wrong choice.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Nice",
      "text": "The combination square is fairly accurate for what I need it for (woodworking). I would hesitate using it for more precise metal work. A great value!",
      "rating": 4.0,
      "verified": true,
      "author": "hurley1229",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Gets the job done",
      "text": "Great for people to start out with. I am a beginner and it has been a good tool to have just starting out. I use my speed square a lot less. This is necessary for every beginner to have. Should be a purchase you make right away. Seems to stay square and easy to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph T Phillips Jr",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "One Star",
      "text": "This is not square. I heard Irwin made quality tools. I guess I heard wrong.",
      "rating": 1.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 3,
      "publication_date": 20180331
    },
    {
      "title": "Nice and always like Irwin",
      "text": "The quality of the square is nice and all steel and little sniff at first but after using it, it become more smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "David B.",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "I did and you should to",
      "text": "This should be in everyone's home / workshop toolbox. A level/square/ruler all in one very sturdy package. I find that the screw that holds down the sliding part of the square engages well and seems to be as durable as the rest of the rig. If it breaks, will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kotori",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Great tool!",
      "text": "The square I had belonged to my dad and unfortunately the sliding ruler broke and I replaced it with the same brand which I’ve used several times already!",
      "rating": 5.0,
      "verified": true,
      "author": "CBR Dude",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Well made",
      "text": "It appears to be well made, Easy to read the numbers on the ruler part Already threw my old one away",
      "rating": 5.0,
      "verified": true,
      "author": "JohnW",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Tight squares require tightening thumbscrew",
      "text": "Decent quality. I found that unless you really tighten down the thumb screw the square has about 1 degree of play that isn’t easily noticed when you first start using the tool.",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Powers",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Worth it",
      "text": "This is a great purchase for the money. Highly recommended for anyone like me who are getting started into woodworking",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Good value",
      "text": "Works as advertised for several different purposes. Good quality and durability. Would buy again. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocco",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Accurate combination square",
      "text": "Very handy and accurate. Feels heavy and sturdy. Much better than traditional squares. Must have for woodworking!",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Irwin tool",
      "text": "This is a good tool. I checked the 90 and 45 degree angel with a Incra square and a Starrett gauge and the Irwin held its own. This is despite the fact that the Irwin cost about 1/5 what the others did. Also the markings and numbers being etched rather than stamped is a nice thing. If you want a good combo square at a good price, get it. If I damage it or if it walks off, I will buy another one.",
      "rating": 5.0,
      "verified": true,
      "author": "Lewis",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "👍",
      "text": "A decent square I use on job sites. In the shop, I only reach for Starret.",
      "rating": 5.0,
      "verified": true,
      "author": "John h",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "I wasn't there now I'm square",
      "text": "A purchase every man should make once in his life. I find myself using it more for the ruler as I don't work in construction anymore but I will always keep a square in my toolbox. It's no starrett but I'm no machinist so who am I to judge.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "I assume it's square!",
      "text": "Easy to read My old one was tarnished. Finally I felt stupid for not having one I could read. Came as promised. Well wrapped.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Superior Quality",
      "text": "Better than anything I could find in hardware stores. Lowe's stopped carrying it for a far inferior product made by Swanson. I'm extremely happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Good Value",
      "text": "Good value for a very sturdy and usable combination square. Was able to add a much needed tool and not break the bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Junk",
      "text": "Complete junk. Square is off by 1/8\" on 10\" ruler length. Returned",
      "rating": 1.0,
      "verified": true,
      "author": "ButtZit",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Excellent tool",
      "text": "Excellent construction. Replaced my husband's old one he's had for over 25 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Asi",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Great tool for the price!",
      "text": "I couldn't believe the quality of this square! For the price I was a bit leery of the accuracy, but find it is as square as can be.",
      "rating": 5.0,
      "verified": true,
      "author": "James A Young",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Manufactured very well",
      "text": "A very sturdy piece of equipment that I'm glad to have in my toolkit",
      "rating": 5.0,
      "verified": true,
      "author": "Hun Gopher",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Ok, but....",
      "text": "The product is ok, but they skipped the final finishing. I spent a half hour carefully filing off the razor sharp burrs. It will cut if you’re not careful.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "One of my most valuable tools.",
      "text": "This one doesn't wiggle around like a lot of others do which makes it very true. I use it a lot and it has proven to be very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "VT Rex",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Very nice and great value for the money.",
      "text": "Love it. Nice and heavy cast iron body. The square is accurate. Better than the Stanley version.",
      "rating": 5.0,
      "verified": true,
      "author": "Ligia P",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "4 Right Angles makes a Square",
      "text": "I’ve had a number of these throughout my life but this one is the easiest, comfortable one to use yet.",
      "rating": 5.0,
      "verified": true,
      "author": "An Honest Review",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Great tool for the price",
      "text": "Great tool for the price. Accurate and easy to read.",
      "rating": 5.0,
      "verified": true,
      "author": "Lane Ketchersid",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Depends on what you're doing",
      "text": "I'm doing things like making a sandbox for my grandkids; who cares about a few degrees there. Works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary T Olson",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "A stout, accurate tool for a good price.",
      "text": "Good price for a stout, truly square, combination square. A quick honing of the edges of the ruler made this an excellent tool. The head casting is thick and strong and should last for years. The markings are well etched and easy to read. The bubble vile may be a bit exposed but I never use or trust these on my squares anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "David AndersonTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Good product and value.",
      "text": "I'm a hobbist craftsman. This device works good. Very accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Kent",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "does what its supposed to, seem to be accurate, straight, and quality",
      "text": "does what its supposed to, seem to be accurate, straight, and quality",
      "rating": 5.0,
      "verified": true,
      "author": "cruzer",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Straight and precise",
      "text": "Amazing for the money ... very easy to read , and precise with the screw stopping mechanism",
      "rating": 5.0,
      "verified": true,
      "author": "Immanuel",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Accurate",
      "text": "Easy to use and accurate combination square, my first tool of this kind. I just finished building a work bench, and have used this tool extensively.",
      "rating": 5.0,
      "verified": true,
      "author": "Sketchg4",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Solid",
      "text": "Great product, it’s solid and robust. I’d buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "The Dr.",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great for 99% of people",
      "text": "Excellent tool for money, no issues with accuracy. Great for newbie woodworker",
      "rating": 5.0,
      "verified": true,
      "author": "Dnindiod2",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Fundamentally flawed",
      "text": "The head is not at 90 degrees to the blade, so it fails its fundamental purpose. It is the only piece of junk I can recall having bought from Irwin.",
      "rating": 1.0,
      "verified": true,
      "author": "Gerald Pumphrey",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Very satisfied with quality and price",
      "text": "Very impressed with the quality. Very solid build and feel. Checked square and is dead on. Super buy at this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold H",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Combination square",
      "text": "It is a good combination square. The threads to loosen and move the ruler feel like it came from Harbor Freight compared to an Empire combination square. I bought it to take to work where multiple guys share tools and don't take care of anything Glad I bough a cheap one.",
      "rating": 3.0,
      "verified": true,
      "author": "Antony Illa",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Solid",
      "text": "Solid and great price ! I got it for my dad and he loved it",
      "rating": 5.0,
      "verified": true,
      "author": "magdalena",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Not good for precision projects",
      "text": "Disappointing when it comes to 90 degree angles. Not a good tool for precision projects.",
      "rating": 1.0,
      "verified": true,
      "author": "S&L",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "I’d buy again",
      "text": "Seems to work just fine. Haven’t had any problems with frequent use after a few months.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Material quality is good, but a square needs to be square",
      "text": "Heavy and feel quality made, however it's completely unusable to me other than a depth marking gauge, at least 1/16\" out of square over the 12\" length.",
      "rating": 1.0,
      "verified": true,
      "author": "Ara Yapejian",
      "helpful_votes": 2,
      "publication_date": 20180901
    },
    {
      "title": "Good square",
      "text": "The slide came oiled, very straight, checked it with another confirmed square. Good quality the slide slides easily level is accurate. Solid.",
      "rating": 5.0,
      "verified": true,
      "author": "nick_hawaii",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Great square.",
      "text": "This product came highly recommended and I already lover the addition of a combination square to my tool collection. I'm a novice woodworker. I'm more of a mechanic than anything. But a good square comes in handy on almost every project.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great price. These combination squares are not mean to ...",
      "text": "Great price. These combination squares are not mean to be a super accurate tool so please keep this in mind. Typically these will be off by a small margin and need to be adjusted.",
      "rating": 4.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 3,
      "publication_date": 20160114
    },
    {
      "title": "Great Combo Square",
      "text": "Very good construction. Note that the small gold knob at the bottom pulls out to reveal a marking \"nail\" that you can use to scribe something after you take your measurement.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenix599",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "High quality",
      "text": "This a nice high quality combination square. Most I looked at were plastic, this one is metal and seems very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Very good. It's accurate",
      "text": "Very good. It's accurate, and it's easy to get the straight edge back into the square after you've taken it off, which is not always the case with combo-squares.",
      "rating": 5.0,
      "verified": true,
      "author": "Bookman",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Solid buy",
      "text": "The combination square is very useful and this product is pretty solid. It is easy to adjust the length of the ruler and it is really accurate in terms of being at a 90 degree angle.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "GEART TOOL",
      "text": "Excellent product, design, cost and workmanship. I’m vested in IRWIN Tools for life...",
      "rating": 5.0,
      "verified": true,
      "author": "JUSTUS",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Irwin, always the best in tools",
      "text": "Very high quality Irwin Combo square,....won't be disappointed, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Naval Spook",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Handy square. Well made.",
      "text": "Seems to be well made with quality material. Should hold up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Buster Brown",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Excellent combination square, I love it, highly recommend",
      "text": "Very good quality, have already started using it, love the adjustable ruler part of this combination square, it is a very useful tool, used it while cutting some wood by hand. The square is solid, nice weight, great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "AnthonyT",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Cheap",
      "text": "The screw that tightens the blade wore out after a months use. Cannot find a replacement screw so looking at another manufacturer. There are a lot of $12 range and then it jumps to $100. Looking for something in between.",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Broke first time I used it",
      "text": "I was really excited to get working with this. It seems sturdy and just the right size. However, it broke the first time I used it. I improvised but was disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "ScubaDudesWife",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great square for the price",
      "text": "This is a good quality, inexpensive combination square that everybody needs at least one",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea David",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Solid Square",
      "text": "Good quality combination square. Every builder should have one of these within arms reach.",
      "rating": 5.0,
      "verified": true,
      "author": "greg williams",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "SOLID",
      "text": "Great combo square. Not expensive and works great. Built solid.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Norman",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "robust and precise",
      "text": "This square is not bulky, it is easy to use and transport, and is robust as a high quality tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Agnaldo",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Best quality square",
      "text": "I have the 6\" and the 12\" now. Love them both",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Jones",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Solid construction",
      "text": "Commercial grade tool that is built to last. Good value!",
      "rating": 5.0,
      "verified": true,
      "author": "zanahue",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "In addition to the 16th and 8th of an inch ...",
      "text": "In addition to the 16th and 8th of an inch scale, it has a metric (millimeters) and 32nd-inch scale. Well made.",
      "rating": 4.0,
      "verified": true,
      "author": "B0ttl3z",
      "helpful_votes": 3,
      "publication_date": 20160821
    }
  ],
  "product_meta": {
    "title": "Irwin Tools Combination Square, Metal-Body, 12\", 1794469",
    "description": "The IRWIN Combination Square is constructed with a durable cast zinc body and a rust-proof stainless steel blade. It's black, precision-etched scales are perfect for marking 90° and 45° marking and transferring measurements.",
    "rating": 4.7,
    "feature_bullets": [
      "Black precision-etched scales",
      "Durable cast zinc body",
      "Rust proof stainless steel blade",
      "Perfect for 90° and 45° marking",
      "Can be used as a gauge for transferring measurements"
    ],
    "specifications": {
      "Manufacturer": "IRWIN",
      "Part Number": "1794469",
      "Item Weight": "12 ounces",
      "Product Dimensions": "5.51 x 12.4 x 0.79 inches",
      "Item model number": "1794469",
      "Is Discontinued By Manufacturer": "No",
      "Size": "12-inch",
      "Color": "Blue",
      "Style": "Regular Combination Square",
      "Item Package Quantity": "1",
      "Measurement System": "Inch",
      "Certification": "",
      "Included Components": "IRWIN Combination Square, Metal-Body, 12\", 1794469",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B005XUHIBG",
      "Customer Reviews": "4.7 out of 5 stars1,658 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#3,006 in Tools & Home Improvement",
      "Date First Available": "November 4, 2011"
    },
    "categories": [
      "Measuring & Layout Tools",
      "Tools & Home Improvement",
      "Carpentry Squares"
    ],
    "price": 12.99
  }
}