{
  "website_summaries": [
    {
      "verdict": "The GoPro HD Hero2 is easily the best GoPro camera yet, with the ruggedness and quality that we've come to expect and a new user-friendly interface.",
      "pros": [
        "The GoPro HD Hero2 boasts improved optics, a few new video- and still-photo-shooting modes, and backward compatibility with current HD Hero accessories",
        "Most importantly, its interface has been overhauled and is now much easier to view and understand"
      ],
      "cons": [
        "As improved as it is, the Hero2's interface can still be a bit confusing for the first-time user"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 9.0,
        "Performance": 9.0
      },
      "publication_date": 20111114,
      "rating": 8.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Camera",
      "text": "This camera is a lot of fun, although recording with no display on the back took some getting used to for certain applications. I bought it for scuba diving and didn't realize at first you'll need the separate dive housing from gopro to get clean images. The included housing works fine underwater, but makes the image very blurry. No blur problems using the cam with the included housing in above water but wet environments though! I glued the included housing to the top of my car to take some fun videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Surf Camera is a Hit",
      "text": "We bought this camera for our son who lives in Hawaii as a Christmas gift. He loves to surf, so this seemed to be the perfect gift. He has already used it a few times and says that it is light-weight and takes great videos of his surfing skills. I recommend this product to anyone looking for a waterproof camera to use during surfing and or water sports.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry Napier",
      "helpful_votes": 2,
      "publication_date": 20130104
    },
    {
      "title": "Changed my world",
      "text": "I can't even begin to describe how much this camera has changed my world. What used to be just a bike down the beach boardwalk or a surf is now a moment in my history and a youtube video that I can share with my family back east. I love this this thing so much and highly recommend to anyone as it opens up the door to you trying and doing so many things you never thought you would!",
      "rating": 5.0,
      "verified": true,
      "author": "Manu Singh",
      "helpful_votes": 0,
      "publication_date": 20121208
    },
    {
      "title": "GoPro HD HERO2: Surf Edition (2011 Model)",
      "text": "This purchase was for one of our son's who is working in St John. He uses it for a lot of his photography and is very impressed with it's performance. It was also a winner in a comparo by Car and Driver in a recent issue. This is just one more example of the excellent products that Amazon continues to offer at fantastic prices!",
      "rating": 5.0,
      "verified": true,
      "author": "Howard L. Penn",
      "helpful_votes": 0,
      "publication_date": 20120418
    },
    {
      "title": "Very bad product. Very Bad Seller",
      "text": "Very bad product. Very Bad Seller. After I bought had a defect and found out it was a camera refurbished, it was not covered by the warranty. Also, there is no guarantee for the Gopro products. Broke? Throw in the trash! That's where he should be.",
      "rating": 1.0,
      "verified": true,
      "author": "Luis988",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Love it!",
      "text": "Had to have it. I was going to Hawaii and wanted to capture what I did, and BOY did I! This Little Jewel has many uses, I even captured a Sunrise in slow motion, which translates into a very fast sun rise, SO COOL! You gotta get one, you just gotta!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Donovan",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Surf's Up",
      "text": "I took this with me to the Dominican Republic to go surfing, and got some truly amazing videos. The sticker mounts will not attach very well to a surf board unless you sand off the wax, however.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane G.",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "Good Camera",
      "text": "Good Camera for taking action photo's and video's. Only bumber is I had mine for about ten month and lost it in the surf. I'm sure if I would buy another cause they cost to much!!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Widdy. Loo",
      "helpful_votes": 0,
      "publication_date": 20130216
    },
    {
      "title": "Everything but the sound!",
      "text": "Love the camera, the quality is great. The only thing is the sound is about useless. But that is expected as it is with most cameras. BUt with a external mic hook up it helps.",
      "rating": 5.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 0,
      "publication_date": 20120718
    },
    {
      "title": "Excellent camera to catch excellent moments",
      "text": "Excellent camera to catch excellent moments! The best camera to catch the most different moments in my life! Just awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "José gonçalves",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Having fun with this",
      "text": "Had it a couple of weeks and been testing it out on cycle journys around the city. Does a good job except when facing into the low morning sun (and really any camera is in trouble in those circumstances). With the head mount its a little hard to guess quite where it is looking but a bit of trial and error means its working for me all right. Hint: if your doing the same try mounting it so its pointing behind you which can be pretty interesting if your going through traffic",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20120430
    },
    {
      "title": "Surf Camera",
      "text": "This thing is so good that we find ourselves thinking of new situations to try it out. Glad that we didn't spend the extra $100 to buy the Hero3.",
      "rating": 5.0,
      "verified": true,
      "author": "VictoryTC",
      "helpful_votes": 0,
      "publication_date": 20130403
    },
    {
      "title": "Four Stars",
      "text": "great camera. took awesome videos and still photos. a little out dated at this point, just get newer model",
      "rating": 4.0,
      "verified": true,
      "author": "Brian Moore",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "looked used",
      "text": "All the packaging looked brand new but after i took the camera out of the clear housing the camera itself had a ding near the shutter button. It also had a little dirt on the back but that could just have been dust. I tested the camera and it worked fine but still debating if i should send it back. Not sure if it was refurbished, used, or just was a return but when you buy a product that is advertised as new that's exactly what you should get.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe M.",
      "helpful_votes": 3,
      "publication_date": 20120510
    },
    {
      "title": "Great product",
      "text": "The video quality is great, needs a little boost on picture quality. Works great while kite boarding but the waterproof case gets foggy when it is wet and gets direct sunlight. It didn't come with anti fog films nor lens.",
      "rating": 4.0,
      "verified": true,
      "author": "ablum81",
      "helpful_votes": 0,
      "publication_date": 20120105
    },
    {
      "title": "Five Stars",
      "text": "I have made many dive movies and this works perfect for it",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse M. Andrade",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Five Stars",
      "text": "Performed as well as my previous camera. Would buy this version again.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey K.",
      "helpful_votes": 0,
      "publication_date": 20140731
    },
    {
      "title": "Awesome",
      "text": "How did I make it with out having a go pro with me everyday. This thing just makes it easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Thomas",
      "helpful_votes": 0,
      "publication_date": 20130325
    },
    {
      "title": "THE PRODUCT IS GREAT, BUT THE ACCESORIES NO!",
      "text": "The second time I used the camera, put it in skiing when I was skiing and protective case was opened and the camera fell into the lake, where he lost. I'm sure the case came faulty, because tightly closed, but opened while skiing. A few friends the same thing has happened. The seller BIG VALUE does not accept the claim.",
      "rating": 2.0,
      "verified": true,
      "author": "GLORIA C GARCIA BRAVO",
      "helpful_votes": 0,
      "publication_date": 20130212
    },
    {
      "title": "third one",
      "text": "First two got lost in filming accidents while wakeboarding. Learned my lesson on how to secure the camera. Also, the floating door included with the surf kit is the real solution, if the camera gets detached, it just floats. Perfect. Quality of the image is second to none. Just awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Serge Perras",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Love it",
      "text": "In a sunny day, the camera works perfectly...its amazin, I love it, It looks like a toy, at first its a litle hard to use, because it only has two buttoms, but after that its a doll. Great definition, but isnt macro!!! And when you use the waterproof case, the sound isnt very good.",
      "rating": 4.0,
      "verified": true,
      "author": "RaqSoto",
      "helpful_votes": 0,
      "publication_date": 20121120
    },
    {
      "title": "Solid Action Camera",
      "text": "My husband uses it almost every time he surfs. Ever once in while it quits on him during a session, but I'm thinking that's because he doesn't charge it before he goes :)",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Five Stars",
      "text": "Does a good job and works well, both video and stills.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil H.",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "sucked- bought it for a vacation took it to Tahiti ...",
      "text": "sucked- bought it for a vacation took it to Tahiti and it stopped working got 1 day use out of it",
      "rating": 1.0,
      "verified": true,
      "author": "Erin Rodenbaugh",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "This camera is amazing!",
      "text": "I purchased this camera for my husband to use while fishing. Haven't tested it on the water yet, but did take it on our trip to Italy. This little camera is amazing! It is so small and light-weight yet takes excellent pictures and video. Works indoors and out and delivers clear, crisp images in any light.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz in Atlanta",
      "helpful_votes": 0,
      "publication_date": 20130512
    },
    {
      "title": "Camera won't even turn on!!",
      "text": "Opened the package and followed directions to turn on camera. Could not get it to work. Everytime I try to call GoPro for support there is no answer and I get the message that there call volume is too high and to call back later. Might return",
      "rating": 1.0,
      "verified": true,
      "author": "Brie M Roohana",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Three Stars",
      "text": "The lens constantly fogs up no matter what I do.....",
      "rating": 3.0,
      "verified": true,
      "author": "seadog",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Almost 5 stars",
      "text": "I would give 5 stars but i won't because when i went to the beach for a free surf session, the camera became fogged in less than 40 minutes of surfing. You must use some silica gel or the anti-fog stuff from GoPro inside the skeleton case for a good surf session. That's all folks!",
      "rating": 4.0,
      "verified": true,
      "author": "Yuri Castro Marinho",
      "helpful_votes": 0,
      "publication_date": 20120224
    },
    {
      "title": "LOVE it",
      "text": "Love IT! Perfect Camera. Very cost effective. Provides great video and images for me and my projects Congrats to GoPro.",
      "rating": 5.0,
      "verified": true,
      "author": "Thiago",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "go pro",
      "text": "Well worth the money and I'm going to look forward to using it in action on my kite while kitesurfing",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20111130
    },
    {
      "title": "Great little video camera!",
      "text": "This is a great little video camera. We took it to Hawaii. Got some great skim board footage. HD looks great on the big screen. Only problem...no way to watch the video on the device.",
      "rating": 5.0,
      "verified": true,
      "author": "Christa Gall McLoy",
      "helpful_votes": 0,
      "publication_date": 20120908
    },
    {
      "title": "Best out there",
      "text": "Great product! For never having an HD camera before, I think the picture quality is fantastic. It's definitely worth it though to get some video editing software.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzy",
      "helpful_votes": 0,
      "publication_date": 20111227
    },
    {
      "title": "It's alright",
      "text": "I was not blown away by this camera. I used it skiing with a chest harness. You can see your skies in the snow but it gives you no of feeling being there. You can't get a feel for how big a mountain you are going down. Everything looks flat and you get no perspective. I think $300 dollars is too expensive for this camera. It's worth $100 max",
      "rating": 2.0,
      "verified": true,
      "author": "Dan K. Krokosky",
      "helpful_votes": 0,
      "publication_date": 20120417
    },
    {
      "title": "It's all right",
      "text": "I'm still in Argentine, I will stay on October 8th. Now it's on my warehouse, but I know and love it! It's better mark, too much quality and practicity",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Maza",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "Poor Quality",
      "text": "Not the quality described. Images, videos and product are not as described in item description. I wasn't happy with what this product produced at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Thurston",
      "helpful_votes": 0,
      "publication_date": 20121219
    },
    {
      "title": "Great job everybody",
      "text": "This product arrived on time. I havnt used it yet but everything came in the package that was listed on the website",
      "rating": 5.0,
      "verified": true,
      "author": "Penname",
      "helpful_votes": 0,
      "publication_date": 20120902
    },
    {
      "title": "Package damaged",
      "text": "This item is a gift, disappointed with the packaging. Unsure if there are marks on the camera though can not open as a gift.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Ashby",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "NOT an effective underwater camera",
      "text": "Despite the nice footage that GoPro has on their website of this camera shooting gorgeous underwater scenes, the camera I received was unable to focus on anything underwater: case was clean, all was working, photos and videos just became blurry messes in even the shallowest, clearest water. This product is falsely advertised and marketed.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher Graefe",
      "helpful_votes": 52,
      "publication_date": 20120110
    }
  ],
  "product_meta": {
    "title": "HD Hero2 Surf Camera",
    "description": "GoPro HD HERO2 Surf Edition GoPro cameras are used by more pro surfers, surf filmmakers and stoked enthusiasts than any other camera in the world. The HD HERO2 Surf Edition is the most advanced GoPro camera yet. Wearable and surfboard mountable, waterproof to 197&prime (60m), capable of capturing professional full 170º wide angle 1080p video and 11 megapixel photos at a rate of 10 photos per second, the HD HERO2 is the world&rsquos most versatile camera. It is the smallest, lightest, most powerful HD camera in the world for capturing and sharing immersive videos and photos of you and your friends surfing and traveling the globe. Whether your goal is to capture footage of yourself getting pitted on a dream trip or you want to film your style to study how to improve (it works, big time), the HD HERO2 Surf Edition is designed with you in mind.Included are 2 adhesive surfboard mounts and an FCS® compatible mount that makes it easy to plug your GoPro into the deck of your board like an FCS® fin. Other accessories are available via links on the right hand side of this page.The HD HERO2 Surf Edition is compatible with all GoPro expansion accessories and BacPacs&trade, including the Wi-Fi BacPac and Wi-Fi Remote (coming soon). What&rsquos Included 1 11MP HD HERO2 Camera 1 Waterproof Housing (197&prime / 60m) 1 HD Skeleton Backdoor 1 Rechargeable Li-ion Battery 1 USB Cable 2 Surfboard Mounts 1 FCS Compatible Camera Mount 2 Curved Surface Adhesive Mounts 1 Floaty Backdoor Assorted Mounting Hardware",
    "rating": 4,
    "feature_bullets": [
      "2X Sharper Professional Glass Lens than the GoPro HD Hero Camera",
      "10 Photos Per Second Burst",
      "PHOTO RESOLUTIONS: 11MP, 8MP, 5 MP",
      "VIDEO: HD Resolutions: 1080P 30 FPS, 960P 30 and 48 FPS, 720P 30 and 60 FPS",
      "Wi-Fi BacPacTM + Wi-Fi RemoteTM Compatible: Long range remote control of multiple cameras, Wi-Fi Video Preview + Playback on Smartphone / and Medium 127o FOV VIDEO"
    ],
    "specifications": {
      "Product Dimensions": "3.94 x 3.94 x 9.65 inches",
      "Item Weight": "5.3 ounces",
      "ASIN": "B005WY3TD4",
      "Item model number": "CHDSH-002",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.0 out of 5 stars114 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#206,832 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 23, 2011",
      "Department": "Helmet Cameras",
      "Manufacturer": "GoPro"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Video",
      "Sports & Action Video Cameras"
    ],
    "price": 219.0
  }
}