{
  "website_summaries": [
    {
      "verdict": "Super-inexpensive cruelty-free, natural product that offers visible results.",
      "pros": [
        "Fruit stem cells plump up fine lines",
        "Smooths well into the skin as a cover-up, and also helps the appearance of wrinkles over time",
        "Can reduce the appearance of deep wrinkles",
        "Fragrance free"
      ],
      "cons": [
        "Didn’t work on everyone"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This product works well for me",
      "text": "I love this product. It's the only deep wrinkle cream that actually makes a difference for me. The deep wrinkles around my mouth are quite a bit less noticeable. I love all the Andalou products. They are excellent .",
      "rating": 5.0,
      "verified": true,
      "author": "Mary C.",
      "helpful_votes": 58,
      "publication_date": 20161229
    },
    {
      "title": "I Recommend",
      "text": "I like this filler a lot, it's a great alternative to injections. I'm pretty skeptical of these kinds of claims, but I like to put things to the test for myself. You can see other fillers cost mega $$$ and this performs way better. I use it on my smile lines, and this plumps that area out. It's not a permanent solution, of course, it's just very good at doing what it says.",
      "rating": 5.0,
      "verified": true,
      "author": "Scrump",
      "helpful_votes": 16,
      "publication_date": 20190911
    },
    {
      "title": "It really works!",
      "text": "This actually works. Very few products out there deliver their claim. This really does. Love this!",
      "rating": 5.0,
      "verified": true,
      "author": "Alan A",
      "helpful_votes": 27,
      "publication_date": 20180129
    },
    {
      "title": "Great Product",
      "text": "What a change. Eliminates the dark circles plus smooths out the wrinkles under the eyes. I can see the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Linny",
      "helpful_votes": 23,
      "publication_date": 20180712
    },
    {
      "title": "Will purchase again. I think this product works at ...",
      "text": "Will purchase again. I think this product works at softening and thus reducing wrinkles, but it is not a drastic change, of course.",
      "rating": 5.0,
      "verified": true,
      "author": "skyt",
      "helpful_votes": 18,
      "publication_date": 20180903
    },
    {
      "title": "Love it! I have allergies and this is so ...",
      "text": "Love it ! I have allergies and this is so gentle on the eye area",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 20,
      "publication_date": 20180321
    },
    {
      "title": "Four Stars",
      "text": "Works better than anything else I've tried for filling in wrinkles.",
      "rating": 4.0,
      "verified": true,
      "author": "j trout",
      "helpful_votes": 16,
      "publication_date": 20180713
    },
    {
      "title": "Didn't work for me :(",
      "text": "I have seen no real change in the appearance of wrinkles (the fine ones or the deeper one between my eyes). Only plus was it was not greasy and felt good on the skin. Probably would not purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "momofmen",
      "helpful_votes": 13,
      "publication_date": 20180717
    },
    {
      "title": "Great multitasker, but not a line filler",
      "text": "This product it best used as a primer or over makeup. It will not fill in lines, (only legit filler, Botox, and a facelift will help there,) but it does blur the look pores and lines a bit. It doesn’t irritate my very sensitive skin. Tips: 1. Wait until all skincare or makeup has dried downbefore applying. 2. Gently pat it into skin; don’t rub. 2. Use to smooth makeup creasing 3. DIY a BB cream dation by mixing 25% foundation 75% line filler. 4. Turn loose powder formulas into sheer cream like formulas for a fast natural look 5. smooths flyaway hair or brows Bottom line: Give it a try.",
      "rating": 5.0,
      "verified": true,
      "author": "RedheadwalkingTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "amazing",
      "text": "love this. i mainly got this to help out with my dark circles and it's working. i notice a difference from nights i don't wear it to nights i do. my eyes look fresher when i use it. it goes on smoothly, absorbs quickly, smells great, and feels amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn's Workshop",
      "helpful_votes": 6,
      "publication_date": 20180813
    },
    {
      "title": "Doesn’t work!",
      "text": "Did not do anything except maybe moisturize the areas a little. But saw no difference in the wrinkles. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 4,
      "publication_date": 20190210
    },
    {
      "title": "Actually pretty excellent",
      "text": "I have very sensitive skin, 30s, work outdoors and am beginning to get fine lines and wrinkles because I am human, but society has influenced my judgement and I felt the need to purchase a product to enhance my beauty and its honestly effective. It is just slightly plumping, not in a weird artificial way. It just made my lines less noticeable after a week of daily use.",
      "rating": 4.0,
      "verified": true,
      "author": "Ricky Gilbert",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Got a rash wherever applied on face",
      "text": "Could not use long enough to see results. A very itchy rash occurred on my brow furrow which thickened the skin as well. The crows feet areas had reactions that looked like a combo of burns & like I was struck by something. I must note that I do get reactions from MI. I thought I did my homework on the product. Oh well. My non allergen friend can probably use it —as there is no refund available.",
      "rating": 1.0,
      "verified": true,
      "author": "Aggie Villalobos",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "This is not a denial filler cream",
      "text": "More like a regular cream. It did not blur any fine lines and not even within time of using it. I would not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Ydalyn A.",
      "helpful_votes": 2,
      "publication_date": 20191102
    },
    {
      "title": "Lessons the look of wrinkles...they aren't as deep.",
      "text": "I definitely love this product and continue to purchase it regularly along with many other Andalou products. It is great for sensitive skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin M.",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Affordable and effective",
      "text": "My skin absorbs this quickly and is moisturized. Lines are a little less visible. I only use this in the morning but it might work better if I used it at night, as directed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "The product doesn’t work!",
      "text": "The product made Now improvement in my skin. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Harlean Zimmerman",
      "helpful_votes": 2,
      "publication_date": 20190626
    },
    {
      "title": "So far I do not see any change",
      "text": "It may be too soon to tell, so far I do not see anything different. If this product appears to diminish wrinkles, I will redo the review.",
      "rating": 2.0,
      "verified": true,
      "author": "Liza",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Don’t waste your money",
      "text": "I used this for fine line and wrinkles. No result",
      "rating": 1.0,
      "verified": true,
      "author": "Lois Rezvani",
      "helpful_votes": 2,
      "publication_date": 20190224
    },
    {
      "title": "No results",
      "text": "I have been using for awhile, and it does nothing for my wrinkles around my mouth or crows feet. I am 67 years old",
      "rating": 2.0,
      "verified": true,
      "author": "Elaine C.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "It’s ok",
      "text": "I love the Andalou products but this didn’t make a difference to me at all. I used until all of it was gone and around my eyes look the same. It does moisturize very well though.",
      "rating": 1.0,
      "verified": true,
      "author": "Paige",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Doesn't do what it says",
      "text": "I don't usually leave bad reviews but since I can't return this I thought I should let others know before buying that it really isn't worth it. I love andalou products and use many of them for a very long time but this one to me just doesn't do what it says it will. Wish I would of read other reviews and saved my money :(",
      "rating": 1.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "No change",
      "text": "Been using 2x daily for month haven’t seen any results yet Tried because of ingredients",
      "rating": 2.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great for wrinkles",
      "text": "It’s a great product! I think it did help avoid deep wrinkles. I have been using it for a year and it helps a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "C.R.U",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Two Stars",
      "text": "Did not see a change in the look of my skin",
      "rating": 2.0,
      "verified": true,
      "author": "Diana P.",
      "helpful_votes": 2,
      "publication_date": 20180319
    },
    {
      "title": "It does not help with any wrinkles, fine or deep. Not greasy.",
      "text": "It was very smooth & not greasy. It does nothing for any wrinkles.",
      "rating": 2.0,
      "verified": true,
      "author": "dbf",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Disappointed....",
      "text": "I was surprised when i saw no results after hearing good reviews. Oh well maybe it’s my skin I don’t know but did nothing for my skin. Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Denise Coughlin",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "This product works!",
      "text": "This has truly worked for me! It has visibly minimized my wrinkles 😊🙌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "Rhondakan",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "No change at all",
      "text": "I had high hopes because their shampoo for hair loss is amazing. Their wrinkle cream made no difference whatsoever for me. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Ozzie",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Great product",
      "text": "Very easy to apply. Not a huge change ... looks natural.",
      "rating": 5.0,
      "verified": true,
      "author": "gssusie1",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Product scam",
      "text": "Does not help with wrinkles at all. Good face moisturizer though, not too oily.",
      "rating": 1.0,
      "verified": true,
      "author": "kris garcia",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Doesn't Fill Anything But Seller's Coffer",
      "text": "I assumed, based on the product's name, that it filled in wrinkles. That would have been nice. I should have just set fire to $20. The effect would have been the same. (Basically the same review for all their products - snake oil that smells lovely.)",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie C.",
      "helpful_votes": 5,
      "publication_date": 20180507
    },
    {
      "title": "Awesome Product",
      "text": "I love all the Andalou products they are fantastic and I would totally recommend it to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Jones",
      "helpful_votes": 4,
      "publication_date": 20160223
    },
    {
      "title": "It doesn’t work that great",
      "text": "I needed it to fill in lines around my mouth",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Five Stars",
      "text": "Have purchased several times--wish it would come in a larger tube!",
      "rating": 5.0,
      "verified": true,
      "author": "Evangelina Pedraza",
      "helpful_votes": 7,
      "publication_date": 20170504
    },
    {
      "title": "The product from the tube was very liquid and runny much like water at the time I opened it",
      "text": "The box was not sealed. The product from the tube was very liquid and runny much like water at the time I opened it. After squeezing out a much amount of its, the rest of the product is not runny anymore. I requested a refund, but they did not approve it because of opened package; however, at the time I got it, it was not sealed and just like an old product which might be used before. I have been using it a few times, no differences about improving my wrinkles yet.",
      "rating": 1.0,
      "verified": true,
      "author": "T&T",
      "helpful_votes": 6,
      "publication_date": 20150813
    },
    {
      "title": "Three Stars",
      "text": "Used up and really didn't notice a great difference. Will not buy again",
      "rating": 3.0,
      "verified": true,
      "author": "Ania",
      "helpful_votes": 7,
      "publication_date": 20150818
    },
    {
      "title": "Deep wrinkle filler",
      "text": "Excellent product. This cream really smooths out wrinkles. I noticed an improvement within two weeks. It also improves skin radiance.",
      "rating": 5.0,
      "verified": true,
      "author": "linda p",
      "helpful_votes": 5,
      "publication_date": 20140618
    },
    {
      "title": "I love it, I could see a big difference around ...",
      "text": "I love it, I could see a big difference around my mouth and under my eyes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "AWESOME!",
      "text": "I read up on this product and company. If you like natural, this is really lovely and it works! I am a life time customer of this product line now!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Lynne",
      "helpful_votes": 13,
      "publication_date": 20130103
    },
    {
      "title": "andalou product",
      "text": "This product works well and is relatively inexpensive. This is the third time I've purchased it. Good service and great product.I would recommend this product to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 9,
      "publication_date": 20120625
    },
    {
      "title": "a little disappointed in the results",
      "text": "I thought it would do a better job \"filling\" than it does. I used Garnier and Loreal before and they work better. It is too fluidy for filling. Needs to be more like \"spackle\" for me!!!",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonCustomer",
      "helpful_votes": 5,
      "publication_date": 20130706
    },
    {
      "title": "andalou products",
      "text": "Not the best product but good. Obviously doesn't fill deep wrinkles so rather a misnomer. If you want truth, ask for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20131122
    },
    {
      "title": "It should be called \"Wrinkle\" not \"Deep Wrinkle\", it's not a miracle cream...",
      "text": "Botox need not worry about this cream encroaching on it's market. I do appreciate the fact that it softens my lines and isn't too heavy. I'll stick with it because botulism seems a bit extreme to me for vanity's sake, but to each their own.",
      "rating": 4.0,
      "verified": true,
      "author": "Alison Perkins",
      "helpful_votes": 20,
      "publication_date": 20130114
    },
    {
      "title": "Good everyday cream for the eyes and lips.",
      "text": "My daughter bought this cream for me the first time and I soon added it to my usual routine. It is not too hard to use.",
      "rating": 4.0,
      "verified": true,
      "author": "darlene hines",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Outstanding product",
      "text": "I generally look for this product at all makeup counters. I decided to take a look at its availability on the internet and lo I found a better deal.",
      "rating": 5.0,
      "verified": true,
      "author": "William R Brown",
      "helpful_votes": 5,
      "publication_date": 20130330
    },
    {
      "title": "I continue to buy and use this product.  Very affordable.",
      "text": "This product works relatively fast to reduce the appearance of wrinkles, I'd say, within an hour. I use it on the lines above my upper lip when applying morning moistureizer and it shrinks the lines. Very noticeable difference. I sometimes apply it in late afternoon when heading to an evening event.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 17,
      "publication_date": 20171014
    },
    {
      "title": "Love Andalou products!",
      "text": "I love love love all Andalou products. I have super sensitive skin and I found out about Amndalou at local Sprouts. They are always ranked super low on .e.w.g website. Their products don't make my skin itchy. This one has great non sticky texture, smells light, and feels good on the skin. Most importantly, it doesn't irritate.",
      "rating": 5.0,
      "verified": true,
      "author": "JMK_JMK",
      "helpful_votes": 14,
      "publication_date": 20171117
    },
    {
      "title": "ABSOLUTELY AMAZING !",
      "text": "I was very skeptical about buying this. I read some of the other reviews and decided to give it a try. I am VERY pleased with how well it works. I used it on my \"kissy wrinkles\" around my lips and I could hardly believe the results! It really does work! I would recommend using it under your make up, and then using either a light make up or an airbrush method. My results lasted all day. I like the way it seems to hydrate my skin, as well as filling in the lines around my mouth. I also used it on the furrows between my eyes with great results. I will absolutely purchase this product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah&Mike",
      "helpful_votes": 3,
      "publication_date": 20190319
    },
    {
      "title": "If you need actual hydration SKIP THIS PRODUCT",
      "text": "I expected this to be a richly hydrating cream. It is not. It absorbs too quickly and quite frankly left me very disappointed. Hydration didnt last at all!!! There is hardly any oil/emollient properties and appears to be loaded with silicone due to its matte/cloudy texture. More like a quick drying gel-cream.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 4,
      "publication_date": 20190123
    },
    {
      "title": "Not what I thought it was.  It's not a filler.",
      "text": "I was confused by the reviews, tried to figure out if this product is actually a filler or something purporting to erase wrinkles. I used the Honey app to follow the price and bought it when a alert came up with a low price. So, mystery solved. It's not a filler (something that is essentially Spackle for the face). I had checked EWG.org to see if it had unhealthy chemicals. It does not, it's basically benign. I'll use it and if it actually improves wrinkles (not holding my breath), I will update this review. I still need a Spackle compound to go under make up but don't want to use something that pours carcinogens through my skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Rose Glass",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Perfect for 40 year old skin",
      "text": "I was a little hesitant to buy this, as it seems like it wouldn't do anything. I'm so glad I listened to the rave reviews here. I just recieved this yesterday and put it on before bed, and before my new andalou night cream. Just as others have said, it is non-greasy, creamy, and absorbs quickly. My skin feels so nice to the touch. I have very sensitive skin and am always worried when trying a new product, but no issues with this one. It pats on nicely and makes my skin feel silky. It almost feels like a very light balm.",
      "rating": 5.0,
      "verified": true,
      "author": "IthacaRed",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Actually works!",
      "text": "Every night before bed, I put this cream on my forehead and around my eyes. Before I started using this product, I had a very faint line on my forehead. Within a short time of using this product, I noticed that line disappearing. I'm now on my second tube. This is a mainstay in my nightly skincare routine! (I'm 30 by the way)",
      "rating": 5.0,
      "verified": true,
      "author": "Nichole LouiseTop Contributor: Star Wars",
      "helpful_votes": 3,
      "publication_date": 20180629
    },
    {
      "title": "Fabulous and Affordable",
      "text": "I've been using this product daily for about a year now and keep re-purchasing because it works very well, contains ingredients I trust, and is affordable. I tend to have dry skin and sometimes need a little something extra BUT as a daily facial moisturizer, this is my go-to! I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keli",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Works better than other similar deep wrinkle fillers",
      "text": "This product works better to fill deep wrinkles than others I have tried. I will definitely reorder when the tube is empty.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 6,
      "publication_date": 20180410
    },
    {
      "title": "Not as good as the reviews say it is",
      "text": "Hi, I purchased to help smooth out wrinkles, and it does not work. some of the wrinkles I have are a little better, but this is a product for someone in their 20's who thinks they have wrinkles but does not really have any. I am in my 40's and the wrinkles are just beginning to show up and this product does nothing for them.",
      "rating": 2.0,
      "verified": true,
      "author": "Alexa",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Not sure what this is actually supposed to do....",
      "text": "It says it's a filler....but it doesn't actually fill much. I've tried it under lotion (as recommended), over lotion, and both under and over, and...maybe a bit of a filler if you do both, but it doesn't last long. I wouldn't waste your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "I'm very pleased with this product!",
      "text": "I'm very pleased with this eye serum! I have VERY sensitive eyes and have to be extremely careful of what eye creams I use. To my astonishment with this cream I didn't even shed one tear or have any irritation what so ever after using it. I couldn't be happier. I also bought the Luminous Vit C eye serum to compare, and it's great as well. This one is a little thicker, which I like. but both have their advantages and I'll use both of them. I'm sold on this company and will gladly try any other eye creams they offer. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170902
    },
    {
      "title": "Makes you feel younger.",
      "text": "I love this stuff! I know i still have wrinkles but this stuff helps minimize them and just makes my skin feel good.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilith Huff-Munoz",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Did nothing!",
      "text": "I have been using Wunderlift for about two years and it reliably hides the bags and wrinkles around my eyes. This product did nothing. Would not waste your money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "LabMom",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "It works.",
      "text": "I only used it on the parts of my face that my hair did not cover. Within a week there was a marked difference in the deep creases on either side of my eyes. I'm thrilled. Re-ordering now.",
      "rating": 5.0,
      "verified": true,
      "author": "TPruitt",
      "helpful_votes": 3,
      "publication_date": 20180717
    },
    {
      "title": "Just ok",
      "text": "I got brave and ventured away from my usual cream, for me that was a mistake. Its creamy and goes on easily, but I just didn't see the results I was hoping for, so it's back to my usual stuff.",
      "rating": 3.0,
      "verified": true,
      "author": "Leah J. McAllister",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "I just wasn't impressed with this like I was other products in this line",
      "text": "I don't know, I just wasn't impressed with this like I was other products in this line. Will I order it again? Maybe. Will I recommend it? Probably not.",
      "rating": 3.0,
      "verified": true,
      "author": "MariEV",
      "helpful_votes": 4,
      "publication_date": 20161229
    },
    {
      "title": "Great cream!",
      "text": "Andalou Naturals really do work! My face & wrinkles looked better on my forehead & crows feet shortly after I applied it!",
      "rating": 5.0,
      "verified": true,
      "author": "Gary S. Rotella",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Ok",
      "text": "I see no difference using or not. It does feel good in my face.",
      "rating": 4.0,
      "verified": true,
      "author": "T bird",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "My face did not like it",
      "text": "Something in this made my skin itchy and flaky. I love most of their products so I'm not sure what happened with this one.",
      "rating": 2.0,
      "verified": true,
      "author": "ToddlerMom",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "30 something",
      "text": "in my late 30s worked really well on my purple bags under my eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Rotondo",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Not sure about this",
      "text": "Honestly don’t see a difference. How long does it take to work ?!",
      "rating": 2.0,
      "verified": true,
      "author": "Bridget",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Don't buy Andalou Naturals Deep Wrinkle Dermal Filler",
      "text": "I've used two tubes and no results. Waste of $30.00",
      "rating": 1.0,
      "verified": true,
      "author": "Jude",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "I love it.",
      "text": "I love this products. It works just as well as a brand that costs 5 times more.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hanson",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Four Stars",
      "text": "Just started using it and so far I like it",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa brooks",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Five Stars",
      "text": "I really love this product. It performed far better than I anticipated.",
      "rating": 5.0,
      "verified": true,
      "author": "LuAnn Rogers",
      "helpful_votes": 2,
      "publication_date": 20180126
    },
    {
      "title": "Smells awful.",
      "text": "I returned this immediately because of the smell. Most products from this company smell great. This has an old lady perfume smell.",
      "rating": 1.0,
      "verified": true,
      "author": "EJ P.",
      "helpful_votes": 5,
      "publication_date": 20161217
    },
    {
      "title": "andalou deep wrinkle cermal filler",
      "text": "I had high hopes for this product but it did not work for me. I used it for three weeks and did not notice a difference.",
      "rating": 1.0,
      "verified": true,
      "author": "Carol A. Stohon",
      "helpful_votes": 12,
      "publication_date": 20130217
    },
    {
      "title": "So far I like this product",
      "text": "So far I like this product, not greasy, non pore clogging, no fragrance. Still need a few weeks to see if my wrinkles disappear",
      "rating": 4.0,
      "verified": true,
      "author": "Tina Mcgonigle",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "not worth the money",
      "text": "even after 4 weeks there was no improvement visible. Waste of money/",
      "rating": 2.0,
      "verified": true,
      "author": "Ruth R.",
      "helpful_votes": 5,
      "publication_date": 20160425
    },
    {
      "title": "Wonderful",
      "text": "I can't live without this product. It feels great, smells great and yes it does work.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Baker",
      "helpful_votes": 3,
      "publication_date": 20161230
    },
    {
      "title": "Don't see much difference after using.",
      "text": "I really don't see much difference in my wrinkles after using this product. I am disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "MERI",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "this works better than nothing",
      "text": "For the price, this works better than nothing, and is definitely different than a moisturizer. It truly is more if a \"filler\". It's obviously not going to erase your lines and wrinkles (why do you think the skincare industry is so competitive), but it certainly hydrates and is made of all natural ingredients, unlike most department store stuff with chemicals (silicones and phalates, etc).",
      "rating": 4.0,
      "verified": true,
      "author": "My Two Cents",
      "helpful_votes": 7,
      "publication_date": 20150104
    },
    {
      "title": "I definitely notice a difference",
      "text": "I've been using this product for over a month and notice a difference in my 11 o'clock lines between the eyes on forehead. The prices on amazon can't be beat either.",
      "rating": 5.0,
      "verified": true,
      "author": "bwirks",
      "helpful_votes": 9,
      "publication_date": 20130514
    },
    {
      "title": "Three Stars",
      "text": "only used once didn't see much difference we will see after a few times",
      "rating": 3.0,
      "verified": true,
      "author": "connie Stambaugh",
      "helpful_votes": 0,
      "publication_date": 20160408
    }
  ],
  "product_meta": {
    "title": "Andalou Naturals Deep Wrinkle Dermal Filler, 0.6 Ounces",
    "description": "Deep Wrinkle Dermal FillerProduct DescriptionFruit stem cell complex, resveratrol CoQ10 and goji glycopeptides boost cell energy for dermal vitality, supporting essential building blocks, collagen and elastin, as capuacu butter reduces skin tension to visibly plump and smooth fine lines and wrinklesProduct DescriptionAge Defying Skin CareSolutions for Dry/Very Dry SkinDull & FlakyPremature AgingFine Lines & Wrinkles\nDirections AM & PM. Apply to clean skin directly on fine lines and wrinkles around eyes, mouth, cheeks, and forehead. Follow with moisturizer.\nOther Ingredients: Aloe Barbadensis Leaf Juice*, Purified Water (Aqua), Vegetable Glycerin, Dicaprylyl Carbonate, Cetyl Alcohol, Stearyl Alcohol, Theobroma Cacao (Cocoa) Seed Butter*, Glyceryl Stearate, Allantoin, Fruit Stem Cells (Malus Domestica, Solar Vitis) and BioActive 8 Berry Complex*, Firming Complex Hydrolyzed Myrtus Communis (Myrtle) Leaf Extract, Resveratrol, Ubiquinone (CoQ10), Lycium Barbarum (Goji) Fruit Extract, Tocopherol, Theobroma Grandiflorum (Cupuacu) Seed Butter, Sodium Hyaluronate, Magnesium Ascorbyl Phosphate (Vitamin C), Aspalathus Linearis (Rooibos) Extract*, Hibiscus Sabdariffa Flower Extract*, Camellia Sinensis (White Tea) Leaf Extract*, Phenethyl Alcohol, Ethylhexylglycerin, Vanilla Isolates *Certified Organic Ingredients Fair Trade Ingredients\nWarnings: Keep out of reach of children. As with all dietary supplements, consult your healthcare professional before use. See product label for more information.",
    "rating": 3.8,
    "feature_bullets": [
      "RESTORE VITALITY: Formulated with fruit stem cell complex, resveratrol CoQ10 & goji glycopeptides, this moisturizer helps support the skin's building blocks while also plumping & smoothing fine lines & wrinkles.",
      "AGE DEFYING, NATURE INSPIRED: Andalou Naturals Age Defying skincare products help hydrate dry skin & fight fine lines & wrinkles with restorative antioxidants. Use as directed to support a youthful look.",
      "INGREDIENTS FROM NATURE: We support Superior Source Ingredient Standards & only use ingredients that are organic, non-GMO, gluten free, sustainable, fair trade, cruelty free, & nature-derived.",
      "FRUIT STEM CELL SCIENCE: Every Andalou Natural's product—including masks, creams, serums, moisturizers, cleansers, & toners—use nature's antioxidant defense solution to protect & support healthy skin & hair.",
      "ANDALOU NATURALS: We are the first Non-GMO Project Verified beauty brand & our commitment to uplifting people & the planet is reflected in our hair products, cleansers, lotions, serums, face masks & more!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.07 x 0.77 x 0.55 inches; 1.33 Ounces",
      "Item model number": "43757",
      "UPC": "794628215716 000068543914 885391798541 707004074364 885278744449 129500855061 859975002355 882314153128 799457663806 885893191901 701428041247 701268260242 885187349759 885369511530 731646286960 794866365495 002766049064",
      "Manufacturer": "Aroma Naturals",
      "ASIN": "B0052P11PG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Creams & Moisturizers",
      "Face",
      "Beauty & Personal Care",
      "Face Moisturizers"
    ],
    "price": 13.24
  }
}