{
  "website_summaries": [
    {
      "verdict": "The 12V combo kit of choice for people wanting a small set of power tools without unnecessary extra costs.",
      "pros": [
        "Two small power tools for the price of one",
        "The included drill is quite capable in its own right"
      ],
      "cons": [
        "Both 12V tools may leave some power to be desired"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "What happened to the quality!",
      "text": "When the trigger on impact gun is depressed the gun hesitates for a second and only the light comes on. I have this same impact gun manufactured 3 years ago and does not do this. This becomes a huge problem when working in tight areas. This model lacks the power also, I find myself using the drill to drive screws more than the impact gun!",
      "rating": 1.0,
      "verified": true,
      "author": "justin kolb",
      "helpful_votes": 19,
      "publication_date": 20190210
    },
    {
      "title": "Good for the price i guess",
      "text": "I was very excited and right out The gecko my Box had holes and look a little beat up. When I opened up the package everything inside was very good and very organized which I liked. One of the batteries was sorta ripped but not in a bad way for it to leak it was very disappointing. The only reason I'm giving it 3 stars it's because of the price. Bosch is a great company i am surprised my delivery came this way. Still a great deal if you ask me. I just sort of received used stuff im guessing.",
      "rating": 3.0,
      "verified": true,
      "author": "El Chuyito",
      "helpful_votes": 18,
      "publication_date": 20180627
    },
    {
      "title": "Cheap quality",
      "text": "This is the worst product I ever purchased in Amazon, the quality is not made in Germany at all! I always use to love Bosh, I even lived 10 years in Germany that’s why I only choice Made in Gemenay because they always use to have the best product! This one is ( Schrot ) garbage!! I use this drill for 2 weeks and it’s already broken! The Return bottom is Brooken! Never again! Don’t buy it if you are looking for a good drill!",
      "rating": 1.0,
      "verified": true,
      "author": "Besim Beka",
      "helpful_votes": 13,
      "publication_date": 20181124
    },
    {
      "title": "12 VOLT as in it has 12 volts",
      "text": "I didn't pay close enough attention when I bought this due to the fact it was on sale for $99 and I thought that was a darn good deal. Well the 12 volt batteries were tiny. I have no other tools with a little 12 volt battery so it wasn't interchangable with any of my tools and the battery life has to be awful. Returned and purchased 20 volt Black and Decker.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 4,
      "publication_date": 20190712
    },
    {
      "title": "Beware!! Chances you will get used/returned units!!",
      "text": "I was very excited as this is my first ever purchase of power drill. I did lots of research and decided to go with this..When received box was not in great shape!! There was no seal and one of the battery was scratched!! By looking at paper work you can say that some one has already gone through it!! It's a great set but don't buy it from amazon!!",
      "rating": 1.0,
      "verified": true,
      "author": "KJ",
      "helpful_votes": 3,
      "publication_date": 20191120
    },
    {
      "title": "Consider Another Power Drill",
      "text": "Functionally, this power drill performs beautifully. However, getting the re-chargeable battery out of the drill base to recharge it is nearly impossible. To remove it one needs to have enough strength to squeeze two plastic tabs at the base of the drill and then pull to allow the battery to come free. Even some of the young jocks in the neighborhood have had difficulty helping me to do this.",
      "rating": 1.0,
      "verified": true,
      "author": "My Opinion",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Perfect for home use",
      "text": "As a homeowner, I frequently need a drill/driver. But I don't have enough use to justify the high cost of professional tools. These, however, are perfect. They are compact and pretty light, making it easy to work in tight spaces. Yet they have the power and batter life to do some pretty heavy duty work. The set I got in particular was a great price for two very functional tools that came with two batteries. I've used them a surprising amount and love the size and weight of them. Really happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "MarkM",
      "helpful_votes": 2,
      "publication_date": 20181223
    },
    {
      "title": "Awesome",
      "text": "If you are looking for a set that will do what needs to get done around the house and garage, look no further. Small enough to get into tough spaces, not too heavy. Battery life is great, especially with having an extra one included. My wife has really been using it frequently once she realized the size was perfect for her smaller hands. When on sale, the deal is even better!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick E",
      "helpful_votes": 3,
      "publication_date": 20181206
    },
    {
      "title": "Best 12v tools period.",
      "text": "I do lots of hobby woodworking, cabinetry and furniture, renovation outside of my day job. These two tools are the no frills, high quality function and fantastic ergonomics I've come to expect from Bosch. Brushless motors are quiet and more powerful and efficient than their predecessors making for a surprisingly capable and compact tool. I find myself reaching for these for tons of tasks that were previously reserved for their larger and more powerful 18/20/24v counterparts. Wish they came with the 3ah batteries like they do in Europe but oh well, not a biggie. I wouldn't hesitate to recommend these to anyone and glad they are part of my kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "just a drill",
      "text": "been buying bosch tools for a long time the quality just seems to go down hill this set has an OK impact driver but the drill is not all that great has a really out of round chuck that runs eccentric and causes the bits to wobble i sent another set back purchased else were that was even worse i have two older sets that are very good but the battery's are starting to show age i would sent this back but the battery's are the same as my older set allowing me to use the older ones as my main go to tool",
      "rating": 3.0,
      "verified": true,
      "author": "Dawson",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "love this bosch kit!",
      "text": "wow! what a bargain! i have been using two dewalt drills but the batteries have been slowly dying on me.....i have had these drills for over 20 years so just bought some replaceable batteries and they were good. having said that i bought this kit because the drills are much smaller for the same power! i have already used them and really like how they feel. absolutely love the power indicator on the drills to tell you how much i see left in the tank. i also like the led light that brighten up the surface you are working on. nice job bosch!",
      "rating": 5.0,
      "verified": true,
      "author": "Ironman&Ultrarunner",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Works great",
      "text": "Only complaint is that the carrying case doesn't make any sense. Can't for the life of me figure out how it is supposed to fit in there. No pictures anywhere; it didn't even come strapped into the carrying case so not even the company has it figured out.",
      "rating": 4.0,
      "verified": true,
      "author": "74910374619",
      "helpful_votes": 2,
      "publication_date": 20200311
    },
    {
      "title": "Perfect Gift",
      "text": "I was helping my dad change out some old CO/Smoke detectors and saw how difficult it was to use his old large electric drill with huge battery - the thing was heavy and awkward to use overhead. I've used these Bosch drills in the past so we got this for my father for a Christmas present. Much smaller - much lighter - very powerful! And I'm pretty sure we'll have converted him to using the Impact Driver for 99% of his needs.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Gates",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Slight runout (wobble) in the PS31 drill driver",
      "text": "There is approximately 1mm of play in the chuck (i.e. the part that grips the bit, not the outer sleeve) in all directions of the PS31 drill/driver. Compared it to one in a local store which does not have the issue. One of the batteries came with a dingy label but appears to be holding a proper charge. The combo's packaging had a red line marked across it's front which makes me wonder if I was sent a defective product. Apart from that both units are light (approx. 2lbs 3oz with battery installed) and very powerful. Got the kit on special for $ 79.00 at Amazon so generally it's a good value...deducting 1 star for the chuck issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Speed Daemon",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Great tools for the money and size",
      "text": "Great little tools that can do 95%+ of what I need to do. Lightweight and ergonomic with lots of power for the size. My only complaint might be that I'm use to tools that you can stand up on a flat surface because the battery pack acts as a standing base, but you can't do that with these and you have to lay these tools down. I think there is a big & beefy battery pack you can get that may allow for this though, but I don't have it and it's not worth the money for my needs. There is also no belt-clip but I wouldn't use that anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Lantana Al",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "love these",
      "text": "I have all 18v DeWalt cordless tools. My buddy who does alarms and lighter work recommended these for most household jobs that don't require a heavy 18-20V tool. These are definitely solid and have weight. These are not cheap, crappy tools. They do the same thing my big 18V tools do but they are not as bulky and heavy. I find myself using these a lot more than I use my big tools. I recommend the drill/driver set. You can't go wrong with Bosch",
      "rating": 5.0,
      "verified": true,
      "author": "BMAC",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Bosch power!",
      "text": "I have to say I was sceptical about buying these 12 volt tools. I figured 12 volts that will be good for small jobs around the house. Boy was I surprised these have become my go too drivers. Light weight and plenty of power to do most tasks that you throw at them. Battery life is great too I used them to hang fence pickets all weekend with out having to charge them. I'm totally shocked and surprised. Great tools!",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Leabow",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Fantastic set of compact tools",
      "text": "The perfect tool set for a guy with a small house. I needed a drill and driver because homeowning, and I don't have a lot of space to store things. This drill and driver set fits the bill. They're small, light, easy to use and have plenty of power for around the house tasks. The handles are a little big around because of how the battery works, but I find it fairly comfortable with my medium sized hands. The charger is also needlessly bulky, and the straps in the case don't seem to be laid out to actually hold the tools, but overall I am quite happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Allstar",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Very nice, but not perfect",
      "text": "I would have expected a slot on the side to store a spare bit when it's not being used (My larger & heavier DeWalt has that feature and it's surprisingly useful.) These are much more convenient, though, as small and light alternatives. They pack plenty of power (for me). The only problem is that Amazon took about a month and a half to deliver it—without warning me that before I bought it. (But that fact doesn't belong in a *product* review, so it is not affecting the rating.)",
      "rating": 5.0,
      "verified": true,
      "author": "iconoclast",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Awesome Set",
      "text": "I use the impact daily at my work as an automotive tech. I purchased this pair/set because I also needed a compact drill for various tasks at work too. These both have been my daily go to tool for most light to medium duty tasks. The batteries last all week, they both hold up well to my daily abuse, oil, coolant, water, various automotive fluids etc and keep on working.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete & Lilly",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "best tool buy I have ever made",
      "text": "My favorite tool. indispensable for almost all of my home projects. I inadvertently went to my daughters house without it, and immediately ordered a second set from Amazon because I had several chores to do for her and couldn't imagine doing them without it. Get a set of screw driver bits, nut driver bits, and drill bits to go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob E.",
      "helpful_votes": 3,
      "publication_date": 20180307
    },
    {
      "title": "Great tools for the homeowner/hobbyist",
      "text": "I really like this line of cordless tools. I had the Flexiclick and when I wanted an drill/impact driver combo, this was an easy decision. This 12 volt system has all the power that I believe I need. I just finished another home project and this combo set worked flawlessly. I was driving 4 inch long screws with no problems at all. The batteries seem to charge quickly. Go Bosch!",
      "rating": 5.0,
      "verified": true,
      "author": "LTR",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great tools, batteries, OK case.",
      "text": "This is a great little set suitable for most homeowner and many professional applications. Both fit in small and large hands comfortably and the batteries recharge quickly while offering good run time. The compact size fits into many places larger 18V & 20V tools can't. The case is OK, I prefer hard cases, but these same cases are sold with many other Bosch tools and there isn't a great way to fit everything in there, especially if you wanted to store bits or an extra battery with all that is included with the kit.",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "Excellent",
      "text": "The Wirecutter recommends this cordless drill as the best home cordless. I have to agree. It isn't too heavy for my aging wrist and the charge lasts about the same time as my old DeWalt 18v drill. Add in the impact drive for just a bit more and I'm happy. The impact drill has worked when I drilled concrete and it also will drive a six inch deck screw through a 4x4 with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael McKeeTop Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20171013
    },
    {
      "title": "Good if you wear a man bun",
      "text": "These things are weak. If you need something because you have a man bun, wear skinny jeans and you’re to weak to use a manual screwdriver, this is the set for you. If your a man an need something that actually has some power, look elsewhere. These are perfect for a single woman or a Millennial with no mechanical skills to put ikea furniture together.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Busciglio III",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "These are great! Highly Recommend.",
      "text": "Highly recommend this kit. I know its brushed (no brushless option available for this at my time of purchase), but it doesn't matter. This kit is light, ergonomic, and the impact....just love that thing. I am a woodworker and on a recent bed I made, this thing was invaluable. Just for the fact of being able to get it into tight spaces, the great light, and the torque is plenty for household/woodshop/DIY adventures. Great Job Bosch!",
      "rating": 5.0,
      "verified": true,
      "author": "Doug F.",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Nice drill combo",
      "text": "Very happy with this combo. Bought if for my dad for christmas. The 18 and 20v combo drills on the market are really to heavy for him to operate due to his shaking hands. But these are a good bit lighter in weight and he can control them better. They dont have the torque like the 18 and 20v do but they do pack a punch for 12v. Nicely made and the grips are very comfortable. Great job Bosch",
      "rating": 5.0,
      "verified": true,
      "author": "macky b.",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "One of the best Bosch ever built.",
      "text": "I haven't had long but I will say this product is amazing. The build quality is supurb, a lot of power in a small package. If your a mechanic this is a must. Also the variable speed trigger is top notch. Bosh really done it this time! Update: This is the most reliable Handy kit I ever owned very compact. I would give this product six stars.",
      "rating": 5.0,
      "verified": true,
      "author": "spencer ammons",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Excellent Tools",
      "text": "Yessir! This is a tool combo I love. I've just used them once to install a garage shelf and boy, they work great and I still have three battery lights showing. Very light weight, plenty of power, long battery life. Bit changes are easy and fast. Some may say the handle is a little too thick, but it seems okay to me at least for occasional use which is what I bought it for. I give the combo 5 stars all the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve N. Cunningham",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Needs Improvement",
      "text": "These are well balanced, lightweight and solid with long battery life. But, the attachment head for the impact driver stinks - attachments slip out if you point it down. Why it doesnt have some mechanism to secure attachments mystifies me. Similarly, the drill chuck is difficult to get tight. You crank it and think it is, then frequently after a little use the bit gets loose or comes out. Again, doesn’t seem to be a good design. Disappointed by Bosch, whose products I generally love for their thoughtful design.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeanne and Chris",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Electrical problem FYI. Great product still",
      "text": "Drill had issues with electricity coming out of the back of the drill in what looks like the motor, first use. This caused a burning smell with use. Impact is wonderful and working properly. Amazon is very helpful and replacement just arrived. Hopefully the new drill doesn’t have the same problem. I will change to 5 stars if it works as well as the awesome impact.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Janssen",
      "helpful_votes": 2,
      "publication_date": 20180825
    },
    {
      "title": "Great for women, too!",
      "text": "I like this set, much easier, lightweight than the older tools I have. I have a heavy duty hammer drill if I need it, but this gets the job done for me, drilling in concrete for pictures & toilet paper holders. Easy to use & hold. My handyman had this, & uses this set all the time. I saw him using them, & I wanted this! Think I am retiring the old Black & Decker with the big battery on the bottom....these are all I need!",
      "rating": 5.0,
      "verified": true,
      "author": "Charl8",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Bosch Makes good tool",
      "text": "This tool is very compact and useful. I have a full size 18v tool but ti's hard to use it in small spaces. THis set of tool helps me finish jobs in small areas or hang something on the wall with screws. this is easy to use and quick. Battery last a long time. THe gear is very smooth. The charger that came with the set is very nice and charges the battery very fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Flying Sriracha",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Super convenient",
      "text": "Overall happy with my purchase. I wanted something smaller and easier to carry around than my Makita 18v. The Bosch minis are perfect for me as an apartment maintenance tech making them fit into my tool bag better and lighter. Only down side I've found so far is the drill isn't as strong as my Makita so drilling out locks means going back to the old ones.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Smith",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "So far so good.",
      "text": "I'm a weekend woodworker. I bought this set when Bosch has a discount promotion. Small size and lightweight make me comfortable. Actually, my old Ryobi drill is big and heavy. I feel my hand gets tired easily. If you are a weekend woodworker, go with this compact size set.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Good reliable tool",
      "text": "Normal tools, fresh batteries. In my country I use a charger with Voltage Converter up to 230 volts. I use it only for domestic needs, I am a DIY lover, and occasionally repair or build something. The 12-volt Bosch line is very satisfied, it is very extensive, covers more needs, the batteries are interchangeable, and you do not need to keep many different batteries and chargers at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Client Amazon",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "What a great tool set and priced so affordable",
      "text": "What a great tool set and priced so affordable. It also includes 2 batteries and a fast charger. Charging time is super quick and each battery takes a ton of work thrown at it. Both tools are very professionally built and packs a hefty power in it. You won't get caught short on power or duration of usage. I was just so amazed by the quality and power of this set of tools. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Francis S Heng",
      "helpful_votes": 3,
      "publication_date": 20170417
    },
    {
      "title": "Charger exploded",
      "text": "Battery charger exploded after second use. I was lucky it was in my garage and nobody was around.",
      "rating": 1.0,
      "verified": true,
      "author": "Karpol",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Packs a punch, and has really great battery life",
      "text": "Excellent set, battery last very long, and both tools feel balanced in the hand, are compact yet powerful. The driver packs some serious punch. I wish the charger was a lot smaller, as it makes storing the complete set inside the included pouch difficult. Overall, for the price, a really great set.",
      "rating": 5.0,
      "verified": true,
      "author": "Wolf",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Glad I bought this set",
      "text": "Both of these tools are awesome. I've had cordless tools since 7.2 volt makita drill back in the 90's. This is the first time I've really gotten a smile from a tool purchase in 30 years ! Power to weight is great and they're so small they fit anywhere. The impact driver has a nice spring holder that keeps the bits firmly held in place. Don't have to drag out a work for little repairs because it has adequate led lights built in. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "wesailit",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "really powerful",
      "text": "I'm really surprised how powerful these are. Before them, I was using a 4V Milwaukee driver that would ran out of juice and stuck while drilling or driving into hardwood. On the other hand, these can take any jobs at low settings. It's like day and night. I'm really glad at the upgrade purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Status Kuo",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Charger is slow, good otherwise.",
      "text": "The BC330 charger is advertised as 30 minutes on Amazon, while Bosch advertises it as 60 minutes. The actual time it took for me to charge batteries from about empty to when the light stops blinking was ~80 minutes for each battery. Difference in time may be because the batteries are 2Ah while the old 12v Bosch batteries used to be 1.5Ah. Aside from the slow charging, the drill and impact both perform well. The drill chuck is pretty straight with very little wobble. Impact has a little bit of play, but never seemed like an issue in actual use. Side note: there are also no bit holders on the drill or impact.",
      "rating": 4.0,
      "verified": true,
      "author": "Hypersonixz",
      "helpful_votes": 10,
      "publication_date": 20170501
    },
    {
      "title": "Great!",
      "text": "I had this drill/driver already but my son kept borrowing it so I wanted to order another one so we don’t have to share. I’ve had the other one for years and it’s always been great... easy to use, comfortable, reliable. I use it for everything.... I expect this one will be the same! It’s a trusted brand and just makes everyday things easier...",
      "rating": 5.0,
      "verified": true,
      "author": "pepperTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "I would say that it would be nice if there was a hook/latch for belt but that ...",
      "text": "I wish there was a con that i could give this piece of equipment. If I had to dig DEEP, I would say that it would be nice if there was a hook/latch for belt but that is the request for all my drills and hand held tools. Lights are a great touch and they feel and quality is surprisingly heavier then expected but not like an anvil compared to some of the 18v and 20v drills. A nice addition for small compact jobs like cabinets, household, and travel jobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Maverick",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Awesome setup",
      "text": "My cousin had two sets when visited him last year. Love using as second setup when working on a project. It’s light and small to fit in tight areas my Milwaukee 18v just can’t fit into some areas. Strong drill great buy. I’m shocked how price keeps rising when last year me Xmas gift lol was just &99.00. Just bought 2 12v 2.5amp found for $39.99.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Rogers",
      "helpful_votes": 2,
      "publication_date": 20180113
    },
    {
      "title": "DO NOT BUY, UNRELIABLE, OBSCENE WOBBLE, INCOMPETENT",
      "text": "Impact driver is great however Z drill is not do it well and not designed to see used more than on rare occasions the locking mechanism for the Chuck is subpar and it routinely loses the grip of whatever bit it may be holding. Additionally it has more wobble than any I've ever saying this can be a really big problem when you are using it to tap hose or drill Precision hole for a living when your job depends on your ability to work at a Precision level",
      "rating": 3.0,
      "verified": true,
      "author": "bennihanna",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Powerful yet light",
      "text": "Absolutely love this set! We have so many drills and drivers but i bought this for portability. Oh I am so impressed! I am used to using my Dewalt but these guys weigh about 1/2 and pack a good punch. Now my husband has started using the Bosch as they are just so much lighter but get the job done. Really love them",
      "rating": 5.0,
      "verified": true,
      "author": "The Texan",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "With great power....",
      "text": "These little guys get the job done! You can use the drill or the impact driver, depending on the project. If 2 people are working on the same project, each has an effective, fast working and accurate tool. The battery lasts a good while in between charges. These inspired me to take on several repair/creation jobs around the house. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben Macias",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Good tool, powerful , long battery life.",
      "text": "After purchased it , i am afraid it is not powerful because it is a 12v tool. But after I received , I tested them. Drill is strong. It has 2 power selection. The other one is ok. Both are light and very easy to carry when doing some minor job, such as putting screw into wood and making hole. They are very economical and useful for light user like me. I only use them once in a while. No need to spend extra $50-$100 if you don’t use it very often. 12v is ok so far",
      "rating": 5.0,
      "verified": true,
      "author": "cwang0306",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Fantastic Value!",
      "text": "This combo set is a fantastic value! Big box stores have the impact drill alone for $129.00. This set with the 2 drills is a much better value. These drills are beasts! Lots of power in a small package. Battery life is great. Build quality of these drills is exceptional. Definitely will recommend this set to my friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "CptProton",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Love the Dual set!!!",
      "text": "Extremely efficient. Didnt know what took me so long to buy a cordless drill. It works better than my corded drill. Didn't think I would need the power drill but I did on the first day using it. Had to hang a tv on a wall and the stud was difficult to penetrate with the regular drill however, the power drill did the job like i was drilling through butter. Love this set!",
      "rating": 5.0,
      "verified": true,
      "author": "Carl R. Washington",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Great Tool",
      "text": "This is a great tool for anyone's tool box. It's compact, packs plenty of punch and the battery life is exceptional. I've used this product for years at a repair shop in Indianapolis and now that I'm retired I purchased one for my own. It's rugged and easy to use. High marks for this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sterling Law",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great tools, even better warranty!",
      "text": "Perfect size for carrying around on the job in my tool bag. I've drilled hundreds of holes and driven hundreds of screws with these little powerhouses. I've even used the impact driver to drive 3/8\" lag screws without a pilot hole and this little tool doesn't miss a beat. After a few months, I did have some trouble with the variable speed trigger on the drill, but a single call to Bosch and they sent me or a replacement immediately (two day shipping, even!). So be sure to send in your ProVantage warranty information, it is absolutely legit!",
      "rating": 5.0,
      "verified": true,
      "author": "P. L. Steele",
      "helpful_votes": 5,
      "publication_date": 20140831
    },
    {
      "title": "You got to have some of these if you have a small spaces or overhead work to do I Luv them",
      "text": "I love these little Bosch drills and screwdrivers because they are so lightweight and easy to use. This is the second order the first one that I received was used actually so I called Amazon and they promptly replaced it with a new set so thank you I am a happy customer and I would do business with you again",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Great products and value",
      "text": "The Bosch 12-Volt 2-Tool Combo Kit (Drill/Driver and Impact Driver) CLPK22-120 with two 12-Volt Lithium-Ion Batteries far exceeded my expectations. The drill and impact driver are slightly smaller in size and weight but still give more than adequate power needed for all but the very heavy duty/commercial use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim E",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "I am a Convert to Cordless Impact Drivers",
      "text": "I had never used an Impact Driver. I am not going back to my electric screwdriver! First: No torque inertian when it reaches the end suddenly. I was using it to assemble some furniture. That was fun! Totally recommend this combo!",
      "rating": 5.0,
      "verified": true,
      "author": "Pepebuho",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Perfect for most things you need a drill for",
      "text": "Most cordless systems have moved on to 18V. It's ironic that a well-engineered 12V drill is what I grab almost every time over the 18V that I have. Lighter and more comfortable. Plenty strong enough for 90%+. Fits in more places too.",
      "rating": 5.0,
      "verified": true,
      "author": "davidjmcclelland",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Great little kit.",
      "text": "You're not going to go out and build a deck with these, but they are super handy to have around for those times when you need to drive a hand full of screws, fix one board, hang some pictures, etc. Love them. Hope the batteries last.",
      "rating": 5.0,
      "verified": true,
      "author": "mdisher",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "The Perfect Driver and Drill for DIYers!",
      "text": "I'll try to keep this very short. If you want a well-built, comfortable, light weight, and powerful driver/drill combo to get your DIY projects started and completed, then click 'Check Out' and thank me later! I have zero regrets with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "H.S.",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "I love this tools",
      "text": "I was needing an electric drill to replace one I have own for over 10 years, and these are amazingly small yet really powerful. I was very close to get the brushless ones, but I don't regret getting these instead (for less than half the money). For the use I'm going to give them they are perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "emiliano",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Compact and capable",
      "text": "These are great. I have a few tools from another brand 18v. They are much bigger and heavier. These tools allow more portability and can get into tighter spots, also I've realized I don't always need something that powerful when doing smaller jobs around the house",
      "rating": 5.0,
      "verified": true,
      "author": "nWo122383",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "less compact then i think it will be otherwise it will be prefect",
      "text": "the size if almost same as the impact driver of my porter cable impact but the battery is the smaller .but i don't see much in weight. depend on what u really need 12V should be a lot of juice for most of the job. but I'm working on a lot of rusted screw. so the 20V proter cable is still my main tool. will keep it for the housework DIY.",
      "rating": 4.0,
      "verified": true,
      "author": "saiying wu",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Solid deal!",
      "text": "I got them with a very good deal. They are very solid tools. Powerful, compact, and handy. They use brush motors, so there will be sparkles now and then. But it's never a problem. The two batteries are interchangeable. For most time, you only need one tool, so basically you have two battery for any job.",
      "rating": 5.0,
      "verified": true,
      "author": "Hao",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Perfect size for household projects",
      "text": "They might not be contractor grade, but have been great for any odd jobs around the house (mostly hanging stuff and assembling furniture). I really like the neat and compact form factor, the small pouch even slides into my tool bag. Most other drills I looked at had these enormous standardized battery packs attached which seems overkill unless you drill holes all day. Quality feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Bosch Tool Set",
      "text": "This are great tools to have around the house was at a good price for the set with two batteries with case, what a deal really like how they are small and powerful for its class 12v they feel nice in the hand and light ready for work.",
      "rating": 5.0,
      "verified": true,
      "author": "lupillo818",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Just as described",
      "text": "I was a bit hesitant to order power tools from Amazon and expected to receive some used or refurbished unit but they came brand new. Good power and compact design. I've used it around the house and it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "ezklipze",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Fat grips. Perfect for light duty jobs.",
      "text": "I assume the drills I purchased are refurbished and the hammer drill is weaker than I expected. Very different ergonomics from traditional Li Ion drills. Grip is fatter than I’m used to. Variable speed trigger pulls works excellent. LED light is bright and very useful. Batteries hold charge for a very long time. Strong enough to drive 3” deckscrews into hardwood. Small handy drills, works great for small jobs or lighter work.",
      "rating": 4.0,
      "verified": true,
      "author": "Devin Walker",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great Driver and Drill set. Can't go wrong.",
      "text": "Great set and Bosch is great company. Be aware one is power screw driver, the other the drill. Requires both to be prepared. Pick up Bosch driver bit and drill sets, and you're ready to go. I've used the driver perhaps 4 - 5 times and battery is still strong w/o charge. Lithium batteries sre simoly excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "Very slow",
      "text": "Not recommended for commercial electrical work simple tasks. Its slow.",
      "rating": 1.0,
      "verified": true,
      "author": "ktm",
      "helpful_votes": 5,
      "publication_date": 20190112
    },
    {
      "title": "These are the ones to buy!",
      "text": "This is a great tool kit. I never knew that an impact driver is actually a good thing to have. These are smaller than most others and quite powerful. Interchangeable batteries are a plus if you need more juice. So far not an issue after several uses.",
      "rating": 5.0,
      "verified": true,
      "author": "yellowpixels",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "These are good if space for storage in your tool bag is ...",
      "text": "These are good if space for storage in your tool bag is limited. One thing I found annoying is the chuck, compared to dewalt or milwauke, you need to pull out the chuck to load in the bit on this set. Just used to pushing the bit in and it auto locking with dewalt, small thing but find it annoying after using my dewalt impact a lot. Otherwise a nice set. Have not used it much but it's small and light with decent power for smaller jobs.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam W",
      "helpful_votes": 4,
      "publication_date": 20150524
    },
    {
      "title": "Compact but powerful",
      "text": "I found an older model of the impact driver in a parking lot puddle at work and was impressed at how good it worked after it dried out so decided to order the set for home. I've only used it to install some blinds and take apart some interior pieces on my car so far but it works great. The small size makes it much easier to use over your head or in the confined area of a car than an 18V+ kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe A.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Weak and Battery does not last long",
      "text": "Like the fact there are 2 batteries, one for each drill. Swap out the battery from the other drill and it was weak since purchased Nov 25, 2018 and lasted no longer than 15m when used to buff headlights.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Cheap but missing a few features",
      "text": "I like these tools, always been a fan of Bosch equipment and products. I gave it 4 stars because the impact gun head is not magnetic, so if you're using the supplied heads, they will easily fall out. You can use the drill to secure them, but that means the impact gun is somewhat useless.",
      "rating": 4.0,
      "verified": true,
      "author": "Tudor",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Compact drill dye after a month of use",
      "text": "Love the drill set but the compact drill stop working after a month of use the impact drill still work",
      "rating": 1.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 5,
      "publication_date": 20181118
    },
    {
      "title": "Dissatisfied",
      "text": "My old yellow drill was lighter and better balanced. I bought new but one battery was used and damaged. I tried to return. My last review was not allowed because I told the truth so I’m trying to not be censored.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenny Bond",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Big punch in little packages.",
      "text": "Bought your rc car work, have the 18 volt version and wanted to keep them in the garage, these little guys are perfect for the bench. Very strong for a 12 volt, was driving 3 inch screws putting the bench together no problems... very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great compact combo",
      "text": "Have an eight volt Bosch drill that I have used for years. Ordered this combo set to keep in our travel trailer for the unexpected things that happen on a camping trip. The 12 volt batteries can be used in testing circuits.",
      "rating": 5.0,
      "verified": true,
      "author": "mdp",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great handy impact + drill.  Small form factor = very portable.",
      "text": "Keep these in a bookbag that is made for tools. Keep them on my boat most of the time. Very handy to have a small powerful drill that can fit in tight spaces and easy to carry around.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Williamson",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Great product, easy purchase, great price.",
      "text": "Purchased this quality product from Amazon after seeing a \"Black Friday\" sales ad from Lowes. Amazon price was the same a Lowes and I did not have to fight the crowd. I have several Bosch power tools and all work great.",
      "rating": 5.0,
      "verified": true,
      "author": "OLD MAN REVIEWS",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Great impact driver. Okay drill.",
      "text": "The impact driver is great. Very powerful for its size. The drill was not as powerful as I had hoped but still pretty good. Used them to build raised garden beds driving screws into 4x4 s easily.",
      "rating": 4.0,
      "verified": true,
      "author": "ronald C.",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great combo for furniture assembly",
      "text": "Got it on promo at $115. Used it multiple times since I just moved into a new house and needed to put together a lot of furniture Pros: - compact and light - weight distribution feels very ergonomic - feels well built and each battery charge lasts a long term - lithium battery has great shelf life - price is reasonable at $115 - love the two-speed and torque setting dial Cons: - The bag that comes with it is useless, not big enough to hold drill bits case, and no compartment at all - not really a con of this product, but I think the 18V combo sometimes can be bought at lower prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Robcar07",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "Working great, i've had zero issues.",
      "text": "Wish I got them sooner. Does everything I need around the house to install furniture etc. I installed a whole mobile home roof with this thing (I used screws instead of nails to put down the plywood).",
      "rating": 5.0,
      "verified": true,
      "author": "HuyT",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "High Quality—Packs a punch for its size !",
      "text": "I have enjoyed using this set so far. Especially the impact driver. It has exceeded my expectations. Lightweight, portable, and the 12v battery lasts quite a long time even under heavy usage conditions. Used both tools to disassemble an old piano. The drill had no problems drilling out/extracting a few stripped screws, and the impact driver passed with flying colors and only reached max torque a few times on larger 1’ sized bolts (at which point I had to switch to my socket set). Great product from Bosch — 5/5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Satisfied Customer!! ",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Perfect for what I need it for",
      "text": "Rarely do I need anything more powerful and I'm happy I picked these. Super light and long battery life. Compact and perfect for working in tight spaces",
      "rating": 4.0,
      "verified": true,
      "author": "Tynan",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Long lasting battery, easy to use in tight spaces/awkward angles",
      "text": "Really impressed with the power offered by these tools, and the price bargain. Battery is impressive and the compact style allows me to drill upside down and in tight nooks and crannies where other drills made me sweat and cringe and shake to apply enough pressure. For a DIY furniture maker/fixer upper and all sorts of around-the-house tasks, this is a must have drill kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Absolutely solid",
      "text": "This may not be the most heavy duty drill/driver but I can tell you that it is the most handy and reliable. A friend of mine had these who was a professional fabricator so I took his advice and have not looked back. Easy to hold, with the light for additional visibility, and compact for taking to go. Battery life is pretty good for random tasks around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Sia Mozaffari",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Good size and power",
      "text": "Works great. Surprisingly compact. Nice to get the drill and driver in one package. I’ve used the drill with the bits from the separate Bosch kit and it worked well even drilling into masonry. This is my first impact driver and I am impressed. So much better than using a regular electric screwdriver.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "great little unit",
      "text": "so far so good i like it i replaced my makita set due to the locking coller on the impact failed on the MAKITA so i bought the Bosch, i like the so far pretty solid units",
      "rating": 5.0,
      "verified": true,
      "author": "Bh",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Light but powerful",
      "text": "Rebuilt a deck with these. The driver is able to drive a 3\" deck screw into treated lumber, so plenty of power. Drill does a good job too. Very happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "TomDavis",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "These things really are great.",
      "text": "These are very comfortable to use and have much more power than I expected. I have used the drill to make a few hole in 5/8\" mild steel.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Amazing combo kit!!!",
      "text": "Great quality product. Impact and drill are used everyday without any problems at all.. I got a great deal so would have gladly paid more for a combo set of this quality. Do not shy away from Bosch products. They rock!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Madisonguy1111",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Powerful drill for my money",
      "text": "I am so excited to get my toy. Great power, light weight, and long battery. I cannot say enough good things about it. Works great for household use. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jskent",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Nice combo kit",
      "text": "I have owned a Bosch 12v drill for 8 years now. It still works, but after repeated hard use, it is starting to smell like \"electrical burn\". And one of the batteries has finally died. So I figured I'd try this combo kit that was on sale. It's a great set. Batteries have more capacity (2.0 vs 1.3mah) than my old one. AND I got the impact driver for the same price as I originally paid for the 12V drill and 2 batteries. It's a great set. Hope it lasts me another 8 years. Maybe I'll give the old one to my 14 year old son and let him play with it! ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Eric A Williams",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "LOVE IT",
      "text": "As a tradesman I use and abuse this daily. Many coworkers have purchased after seeing mine. Very durable and better than the others. Buy it. You wont regret it",
      "rating": 5.0,
      "verified": true,
      "author": "William B.",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Amazing Tools With A lot of power",
      "text": "Hi, I very happy by this items. I was not sure if 12v tools will be powerful enough but they are. They make all of the home repairs very ease, because they are small they you can fix small places and they are very powerful so you can make even the hardest jobs. The battery life is amazing, and you actually getting 2 batteries so you can change from one tool to other.",
      "rating": 5.0,
      "verified": true,
      "author": "Yosi",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Perfect for most applications and for work in tight places.",
      "text": "Bosch built well made tools and this set is no different. For 12v this combo set has plent of power. I can safely say it will perform just about all the jobs I do and performs them effortlessly.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynda Alberico",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Bosch Name Holds Up",
      "text": "Awesome tool set. Well built and solid. Comes with a nice case and two batteries. Got it for $80 on sale and thought it was a steal.",
      "rating": 5.0,
      "verified": true,
      "author": "VuuDuu",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Perfect 12 volt tolls for household use",
      "text": "What a value. These small 12 volt tools have lots of power and long battery life. You really do not need more than 12 volts for most common household tasks. This was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "DMR",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Very good product",
      "text": "The price and quality of the product are really nice. However, the power is not that strong if using for cleaning the tile.",
      "rating": 4.0,
      "verified": true,
      "author": "Feng",
      "helpful_votes": 0,
      "publication_date": 20201013
    }
  ],
  "product_meta": {
    "title": "Bosch Power Tools Combo Kit CLPK22-120 - 12-Volt Cordless Tool Set (Drill/Driver and Impact Driver) with 2 Batteries, Charger and Case",
    "description": "Style:12V KitBosch introduces another essential and practical piece for your power tools collection with our 12 Volt 3/8 Inch, Two Tool Drill Kit featuring a Power Drill and Impact Driver. Experience our Premium performance to size ratio or power to weight ratio (PS31), which allows for accuracy and precision and PS41 impact driver, which has the shortest head length in its class for compact applications. Keep the power for drilling and fastening needs. Perfect for a mechanical technician, plumber, electrician, DIY projects, and overall professional use. Our cordless drill set, CLPK22 120 (PS31 and PS41), have professional grade power at an incredibly light weight around two pounds. These performance to weight ratio drills make a great tool solution for electricians, plumbers or contractors for ideal over the head drilling or driving. The PS41 has a short head length and powerful torque, meaning this small but mighty unit can be the primary go to tool for the most professional screw driving, removal or drilling applications. The drill kit includes one (1) 12V 3/8\" Power Drill Driver (PS31), one (1) Impact Driver (PS41), two (2) 12V lithium ion batteries, one (1) 12V charger (BC330), and one (1) contractor or carrying bag. Perfect for screw driving, screw removal, drilling applications, overhead drilling, and contractors. This drill driver and impact driver drill set combo has two Speeds: 0 350 RPM and 0 1, 300 RPM and 20+1 clutch settings for the PS31 and 0 2, 600 RPM for the PS41. This permits users to make precise torque adjustments for accurate screw driving and drilling. The streamlined drills fit into tight workspaces, with a seven (7) inch head length (PS31). The short length combined with manageable two (2) pound body makes easy packing and jobs in tight spaces with the advanced LED lights for improved visibility especially overhead.",
    "rating": 4.8,
    "feature_bullets": [
      "Power: This Bosch drill kit includes a Powerful 12 volt drill driver with up to 1,300 RPM and a 12 volt driver with up to 2,600 RPM",
      "Compact: The lightweight design of the PS31-2A drill driver is ideal for easy handling in overhead operations and tight spaces and the PS41-2A impact driver offers the precision of variable speed, a light-body, and a short-head length",
      "Control and Visibility: The Bosch cordless drill is easy to handle in tight, narrow spaces, and three integrated LED lights mounted around the head of the driver enable high performance in low-light settings",
      "Durability: Robust and compact with lightweight design, the drill impact driver combo kit is built to last and backed by a three year protection plan",
      "Convenient: Drill kit includes: 12V Max 3/8 Inch Drill Driver (PS31-2A); 12V Max Impact Driver (PS41-2A); 2 batteries, 30 minute charger and soft carrying case"
    ],
    "specifications": {
      "Manufacturer": "Bosch",
      "Part Number": "CLPK22-120",
      "Item Weight": "6.6 pounds",
      "Product Dimensions": "12.75 x 9.75 x 4.25 inches",
      "Item model number": "CLPK22-120",
      "Batteries": "1 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Blue",
      "Style": "12V Kit",
      "Material": "ABS",
      "Power Source": "Battery-powered",
      "Voltage": "12 Volts",
      "Item Package Quantity": "1",
      "Number Of Pieces": "4",
      "Number of Handles": "1",
      "Special Features": "Compact",
      "Included Components": "",
      "Batteries Included?": "Yes",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Lithium Ion",
      "Warranty Description": "One year",
      "ASIN": "B005GT0IWK",
      "Customer Reviews": "4.8 out of 5 stars1,887 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#8,021 in Tools & Home Improvement",
      "Date First Available": "August 25, 2011"
    },
    "categories": [
      "Combo Kits",
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Power Tools"
    ],
    "price": 129.0
  }
}