{
  "website_summaries": [
    {
      "verdict": "Worth considering if your top priority in reusable produce bags is transparency; however, some others we considered are more durable.",
      "pros": [
        "Mesh material is very transparent and lightweight, and easy for grocery store checkout staff to scan produce",
        "Bags air dry quickly when washed by hand"
      ],
      "cons": [
        "Some longevity concerns, as the material is prone to ripping and the drawstrings seem flimsy",
        "A few customers received fewer than 9 bags"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Made of plastic",
      "text": "I returned these. Was disappointed that they were made out of plastic...kind of counter to the purpose of buying them in the first place.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 112,
      "publication_date": 20180605
    },
    {
      "title": "Perfect for weekiky grocery trips, saves plastic!",
      "text": "Extremely happy with this purchase! Simple and effective. I love that they're not waterproof because I like to store small veggies, like snap peas and mushrooms, within the bags in the fridge; it keeps them fresh and avoids condensation. The drawstring doesn't have anytype of locking mechanism, but they stay closed just fine from cart to checkout to home. I chose these specifically because they're super easy to see through, and the cashier doesn't have to open the bags to read the barcodes or see what's inside. Overall would purchase again, and hopefully convince my family members to make the switch too. Saves plastic, keeps food fresher, way stronger. You won't regret this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Juliann",
      "helpful_votes": 121,
      "publication_date": 20170720
    },
    {
      "title": "Sending them back",
      "text": "I have two friends that love these bags but they're not for me. I thought they were on the small side for some of my produce. I didn't like that there was no pull tab to easily lock the bag tight. I was knotting the string so my produce wouldn't fall out. This took some extra time at the store and string so long wasn't easy to do quick knots. My fruit seemed to last in the bags but my veggies did not. Broccoli got soft fast and zucchini rotted. Update: When I was folding these to send them back one bag had large amount of the stitching coming out at the top. I only used the bags once.",
      "rating": 1.0,
      "verified": true,
      "author": "Deenie",
      "helpful_votes": 88,
      "publication_date": 20170714
    },
    {
      "title": "These bags do the job and I’m glad I bought them",
      "text": "I was looking for reusable bags that: 1) are light enough to where I didn’t have to consider the added weight (my local store doesn’t deduct the weight of the bag) 2) are clear enough for the cashier to visibly see what’s inside, without having to remove anything. These bags do the job and I’m glad I bought them. The bags are fairly durable; I’ve been able to carry a large amount of potatoes in a bag and it held up just fine. My ONLY complaint is there are no draw string tabs to keep them closed. For now, I’ve been tying the string around the bag. I might add my own tabs to the bags later.",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 43,
      "publication_date": 20180519
    },
    {
      "title": "The best light-weight, more transparent bags",
      "text": "There's a reason these are the bags my local stores sell too (though slightly higher price). These are far lighter-weight and far more see-through (enough to scan through or see items clearly) compared to other bags I see listed on Amazon. Still, they are totally sturdy and still have a draw-string, just no ball to hold the string closed (and you can tie a simple knot easily enough if needed). I regret also buying some other ones. These are all I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Wolf",
      "helpful_votes": 39,
      "publication_date": 20180513
    },
    {
      "title": "Environmental Plus",
      "text": "Been using these for a few years now and very happy with the product. People in the grocery store often ask where I got them from! Plastic is forever, people. Every little bit we don't use adds up. These mesh bags will give you many, many years of plastic-free veg/fruit shopping. I also use them for taking my grandkids swimming! The mesh bags are perfect size for a wet bathing suit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 39,
      "publication_date": 20180108
    },
    {
      "title": "Should have purchased years ago!!",
      "text": "I have been using reusable shopping bags for years and me wish I would have been using these reusable produce bags as well. They're awesome!! Easy to use, weight nothing, and will seriously cut back on the plastic bags I recycle because reducing is a step above recycling. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann P",
      "helpful_votes": 20,
      "publication_date": 20170811
    },
    {
      "title": "Flimsy bags, rip easily. AVOID.",
      "text": "I’m disappointed in these bags. I’ve used another brand for a while and thought these would hold up as well. They don’t. I just unwrapped my set and two have holes in them from the packaging (they are attached to a cardboard placard with a plastic tag that left holes in the product). The seams pull apart and appear stressed when the bag is full. I do like that the mesh is thin enough for even small beans and grains, but I regret my purchase and would not buy again based on quality alone. I’m afraid to put these in the wash. They look like they’ll last as long (short!) as the single use plastics I’m trying to avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara V",
      "helpful_votes": 12,
      "publication_date": 20180724
    },
    {
      "title": "Not packaged like it is shown",
      "text": "I bought a couple of these thinking they would be packaged like they are shown in the images (3 units of 3 bags), but when I received them it was a single plastic bag stuffed with the 9 items. I bought a couple of these to give to different people as gifts and now I don't think I will. The product that arrived looks nothing like the packaged product displayed. I believe the product should match what is shown for accuracy and transparency.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20190515
    },
    {
      "title": "Material is strong enough to handle a shopping trip, ...",
      "text": "Material is strong enough to handle a shopping trip, but it did not survive a first washing. We still use the remaining ones, but we will not rebuy once all of them are gone.",
      "rating": 3.0,
      "verified": true,
      "author": "Orion Supergan",
      "helpful_votes": 13,
      "publication_date": 20180310
    },
    {
      "title": "Perfect!",
      "text": "Normally I just skipped the plastic in the store and put fruit and vegetables right into my cart. It presented a bit of a challenge when buying multiple apples or more than one or two of anything. These have solved the problem. Durable and reusable...plus I was fruits and veggies right in the bags! If yourr looking for reusable bags for the store, these will work perfectly. They are about the same size as the bags at the supermarkets but include a drawstring built in to prevent anything from falling out.",
      "rating": 5.0,
      "verified": true,
      "author": "Gino",
      "helpful_votes": 8,
      "publication_date": 20171120
    },
    {
      "title": "Help save the earth please! You won't regret!",
      "text": "The BEST option for the environment! It was a great price (lightning deal) and the bags are awesome quality! I want to purchase for all my family members so they can stop using plastic. It's one of my favorite eco-friendly items I use day to day. I have filled bags with up to 7 pounds each(I purchase a lot of fruits/veggies) and they have not shown any sign of stretching! I will purchase more. I wish more people would use. In a matter of a year: 9 bagsx52 weeks (grocery shopping once a week) will save at least 468 bags.",
      "rating": 5.0,
      "verified": true,
      "author": "I_will_stop_at_muffin",
      "helpful_votes": 4,
      "publication_date": 20190218
    },
    {
      "title": "Not packaged as presented.",
      "text": "This item is marketed as a set of 9 bags and from the picture I expected to get three sets of three and I would have been satisfied if they came packaged as a set of nine in packaging like that shown. Instead I received 9 bags in a clear plastic package with no labeling, use, country of origin or care instructions. It concerns me as this is an item to hold food my family will consume and I'm not sure that I've not received a set that was originally purchased by someone else and returned.",
      "rating": 1.0,
      "verified": true,
      "author": "CentralCoastLadies",
      "helpful_votes": 3,
      "publication_date": 20190720
    },
    {
      "title": "Fine, but not as good as the ones they are replacing",
      "text": "I use these bags to store my fresh produce from my CSA farm box. The ones I had before were starting to wear out. These are fine, but not as good as the ones I had been using, because they don’t keep the food fresh for as long. The others were not clear mesh, so maybe the fabric was more conducive to keeping things fresh than these. I like that I can see my food better with these, but not at the expense of maintaining freshness. Also, the other had an easier clipping system to close them; these have a tie and do not close well.",
      "rating": 4.0,
      "verified": true,
      "author": "blackberry",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "excellent purchase",
      "text": "I am not a fan of plastic, and was delighted to see these available in my supermarket about 5 years ago. I tried them out and was thrilled. I LOVE them. They are easier to use than the store plastic ones, which because I have dry skin, I can hardly open anyway. The closing drawstring keeps things soundly inside, but is easy to open when needed. The bags are durable, and a cinch to wash and dry. They are easy to see through, so there is no problem seeing what's in them, or even reading the produce numbers through them. I think these are such a winner, I have started to give them away as presents! Awesome product!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "So much better than disposable bags!",
      "text": "Really like that these bags are 'scannable' at the checkout counter, and it's much handier to take my own produce bags - no need to elbow through other shoppers to get to the plastic bags, or track down the twist ties. I bought these out of guilt for wasting so much plastic, but find they're more convenient anyway. Drawstring works great to close the bags without being a hassle to get into later - I liked these so much I bought a second set after the first batch.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Horn",
      "helpful_votes": 3,
      "publication_date": 20180513
    },
    {
      "title": "Great product",
      "text": "This is my first time using any type of reusable bag for produce and I’m really pleased. These bags are great. Other options that I came across were woven and would clearly add to the weight of the produce and I’m not the type to tell the person at the register to reduce the cost by the weight of the bag so these are perfect. I’ve only used a couple of them so far so haven’t had to wash them but I’m optimistic that they wash fine",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190330
    },
    {
      "title": "Plastic, plastic, plastic!",
      "text": "Bought these to curb my plastic consumption and because the photo makes the packaging look recyclable... They came in a non-recyclable plastic pouch, in a plastic Amazon shipping envelope. =/ Thay are slightly bigger than a sheet of paper, about the same size as regular bags at the grocery stores... They have the tare weight listed. Although they are so light I don't think it even matters.. Over all they seem like a good buy.",
      "rating": 3.0,
      "verified": true,
      "author": "Mike Dez",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Great produce bags!",
      "text": "I bought these bags and have used them several times. Initially, I was concerned they would be heavy and add to the weight of my produce, but they are extremely lightweight. This doesn't mean they're flimsy. They handled my produce well. I'm glad I found these bags since I wanted to reduce my use of plastic and having my lemons freely rolling around the cart while I was shopping just wasn't working. I recommend buying these bags. They're great.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise McDaniels",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "Best option available",
      "text": "I went on a reusable produce bag purchasing rampage recently and of the four different companies from whom I purchased, these are my favourite. I have been using them at my local Bulk Barn without any trouble (they weigh nothing and the cashiers have complimented me on them) for things like nuts, candy and beans. Also very useful at the grocery store for things I pick up loose and don't want touching the basket or conveyor - zucchini, spinach, bulk bagels, herbs and coffee beans. I keep several tucked inside my reusable Baggu, which I always keep by the door. Really great!",
      "rating": 5.0,
      "verified": true,
      "author": "velouria",
      "helpful_votes": 2,
      "publication_date": 20180920
    },
    {
      "title": "Smart Choice",
      "text": "These bags are an excellent idea for bagging produce at the grocery, rather than using the ubiquitous plastic on offer everywhere you turn. Not so great for storing produce in the fridge, as they are fairly light duty. My husband was fond of deploying them as handy veggie keeper bags in the crisper drawer, but they began to develop holes. I think a heavier bag would be better for that purpose, and I'm sure that someone sells them. That said, these work a treat for carrying produce home from the store, you simply need to treat them as what they are? Part of the No More Plastic answer, but not heavy duty.",
      "rating": 4.0,
      "verified": true,
      "author": "Tattercat",
      "helpful_votes": 35,
      "publication_date": 20140309
    },
    {
      "title": "Love!",
      "text": "I love these bags! I bought one pack to try and share with a friend because we were both intrigued but skeptical. I have since bought many more to keep and share with family because I like them so much. I toss them in the washing machine to clean and they seem to hold up very well. They are extremely light so I don't feel they add much of anything when weighing items at the checkout. Have had no issues with cashiers having to open them to scan. And I can feel good about using fewer plastic bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer S.",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "KEEPS VEGETABLES/FRUIT FRESH LONGER",
      "text": "This is a very convenient eco friendly alternative to the plastic bags markets provide and you don't have to take out of the bag once you put in at the store. Place your fresh fruits/veggies in have the cashier scan and store in fridge. The bag allows the produce to breathe unlike the plastic that makes lettuce soggy green after awhile. You don't end up with a bunch of plastic bags you won't use just to throw away and you keep your produce fresh longer and it's easy to clean. Going to buy more have in each car for convenience to grocery shopping anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "pago",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "It's about time...",
      "text": "These bags are great. They're plenty big enough to fit most produce purchases. I tossed them in the washer with some other items but did NOT put them in the dryer as they were almost dry when I took them out of the washer. This bag is a part of the solution to reducing the amount of single use plastic bags. I should have done this a long time ago to compliment my great number of reusable grocery bags. No plastic bags from anywhere in 3 years!!!! I plan to also use them to keep some items organized in my back pack for an upcoming trip to Scotland and Ireland. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda24/7",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Not really scannable",
      "text": "I chose these bags because they claimed that they were sheer enough that a scanner can read a produce label through the mesh, but it's just not true, at least not with Kroger technology. If I were buying bags where the checker would have to peer through and manually enter the scan code, I would have gone ahead and selected another brand where the drawstring is fitted with a toggle or clasp to close the bag (although the cord on these is long enough that I can usually make a loose knot with it).",
      "rating": 1.0,
      "verified": true,
      "author": "Brian in Lexington KY",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Reusable, sturdy produce bags.",
      "text": "I'm so glad I bought these to use when buying produce at grocery stores. The net bags allow moisture to escape and the bags do not add weight to the purchase. You can rinse fruits and vegetables in the bags too. The bags dry fast and clean easily. I keep them with my reusable grocery bags. I hate using the plastic bags provided by grocery stores for produce. I can't get them open or rip and tear the plastic in the attempt. Then you throw them away or recycle. You get 9 bags with purchase. That's more than I usually need but I can share them or find other uses for them, I'm sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Dumser",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "My produce drawer is thankful",
      "text": "Perfect for my produce organization. I bought these to keep my drawer cleaner in the fridge. They tie together well and see everything that you need to. I have yet to take them to the store for grocery shopping but I can’t think of any issues that would prevent me from doing so. You can scan through them (I tried at home!) and washing is simple. Highly recommend over plastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Bargain Shopper",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Only got one pack",
      "text": "As others stated, I only received one pack with 3 bags, when the description clearly states \"SUPER VALUE - You will receive 3 3 packs for a TOTAL OF 9 BAGS!\".",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20160407
    },
    {
      "title": "Great Earth-Friendlier Option",
      "text": "The worst part about eating healthy was all of the produce bags from the grocery store. These bags are awesome in that they reduce the plastic bag waste (when I remember to bring them) and they are easily cleanable. The only problem I have found is some vegetables get spongy quickly in these bags when stored in the refrigerator. I'm guessing this is because they breathe more than the plastic bags.",
      "rating": 5.0,
      "verified": true,
      "author": "A.luebsTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20170820
    },
    {
      "title": "Good purchase",
      "text": "I like using these mesh produce bags for holding produce, instead of using the flimsy grocery store plastic that's always so difficult to open! I like knowing that I'm making a positive impact of not introducing more garbage. The bags are sturdy and durable. Onions leave those dastardly chards of onion skins and make the bags a little challenging to clean. All in all, I'm happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Wagner",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Lightweight but strong",
      "text": "I already had some of these bags but wanted more so we can keep some in each car. We always use them when shopping at our local organic farm stand where we get most of our produce. I highly recommend them. When they need washing, I put them inside a laundry bag that I use for sweaters, etc. and hang to dry.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Murray",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Go plastic free with these bags :)",
      "text": "It has always bothered me to keep using plastic produce bags even though I'm not using plastic shopping bags! What I like is that they are roomy and very strong. I can put large & heavy produce in them, such as sweet potatoes, or a large bunch of kale. They work well in the fridge or pantry too. The only downfall I can note is that I thought a reviewer said that the upc label can be read through the bag while checking out, and I don't find that to work. That's okay though- I love the bags!",
      "rating": 5.0,
      "verified": true,
      "author": "aneal2Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great low waste product",
      "text": "I’ve been consciously going low waste where possible. I have been using these bags for about 6 months. At first I was very careful with them because they felt delicate. But there isn’t a need to be delicate at all - they are durable and lightweight. I use them for produce and some bulk bin items (like dried beans and rice). I’ve used it for bulk bin steel cut oats and the fine oat dust sifts through and makes a powdery mess. It’s super easy to clean and dries fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Strass",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Great alternative to plastic.",
      "text": "Great alternative to plastic bags for most of our produce. We still put cilantro in a plastic bag because it wilts too quickly in these and when it gets old makes a mess in the drawer. Transparent enough to scan barcodes through the bag. Also good for some bulk items. Many folks ask where I get them. However, it does not come packaged like this. Ours came in one unmarked wrap.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Mc. P.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Love 'em!",
      "text": "I love these! I tried making some of my own and I wish I would have just gotten these first and made my life easier. They are awesome! Large and strong and easy to wash. They don't hold flour or sugar just FYI (if you're like me and looking at cutting out all plastic while still shopping at a reasonable grocery store) but they sure as heck hold just about anything else!",
      "rating": 5.0,
      "verified": true,
      "author": "Riah",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Easy to use and would buy again",
      "text": "Love it that the bags are all the same size. I really like using these instead of the plastic bags supplied by the grocery store. My only problem is that I wish they came in a carry pouch. I’m still working on a good solution because I put them inside a shopping bag in my car and then forget which bag I put them in. Not a product fault, it’s me.",
      "rating": 5.0,
      "verified": true,
      "author": "Michel GrotsteinTop Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Do your part, Help the planet, use reusable bag!",
      "text": "Loooooooove these. These bags are fantastic, I always get compliments at the store from grocery clerks about these. I just feel so much better knowing how many plastic produce bags I avoided using because of these ones. So worth it! I wish America would ban plastic grocery and produce bags completely!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Love these bags!",
      "text": "They arrived yesterday, used them this morning at HEB and they are great!. Easy to use (no trying for minutes to get the plastic bag open), completely see through, holds plenty, stayed pretty clean after emptying out the produce (broccoli bits had to be removed by hand) and are ready for the next trip. One more step in ridding plastic from the environment. I love these bags. May try storing my potatoes and onions in the pantry so the onion skins don't get everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "JETH",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Greatly reduced plastic bags in my home",
      "text": "Thank goodness for these. Now I don't have a bunch of plastic produce bags with not much use in my home. These are a fine and soft mesh material so some sharper fruits/veggies may poke through. Haven't had any damage yet. They can get dirty but these bags can be washed. I believe you can throw them in the washer since there's a suggestion for washing small laundry items. The bags are very lightweight, convenient when buying produce by the pound.",
      "rating": 5.0,
      "verified": true,
      "author": "Z",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "So much better than using the plastic produce bags!",
      "text": "I love these. You can fit your produce in them without any problem, the drawstring is great and the produce codes can be read right though them. The only challenge is that herbs dry out pretty quickly in my produce drawer with these so I think I need a different storage solution but the grocery store aspect is awesome. I feel so good that I'm not adding bags to the landfill.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "So much better than plastic bags!",
      "text": "I got tired of red onions rotting after a couple days in plastic bags, in my refrigerator. Now I store them, and most of the rest of my produce, in these bags and they last for weeks as I gradually use them. I have a mesh bag for washing delicates in the washer and I simply turn the bags inside out, drop them into the mesh bag and put them in with the wash. Sometimes I just wash them in the kitchen sink and put them in the drainer to dry. They dry quite quickly. So far they are holding up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Elon",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "The very best for beach shell collecting",
      "text": "We use them for shell collecting and they are excellent. I haven’t seen anything better. We stick one in our pockets of our shorts or swimsuits and they’re so light weight you forget they’re there until coming across an awesone shell worth keeping. Then is when I reach down in my pocket and hope I remembered to stick one in there when I started out. They are always going to be among the things we pack when we head to the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "SNBow",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Where have these been all my life?!?",
      "text": "Just started using these as my one thing a month goal to be more responsible with what I’m wasting and using as well. They’re now my favorite produce and veggie bags and I’ve even used them for holding the sealed bags/ containers of meat ( obviously I mark them for this use and wash them). I wish I had actually started using these sooner in my life!",
      "rating": 5.0,
      "verified": true,
      "author": "Erinn",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great replacement for plastic bags.",
      "text": "I love these! They’ve replaced plastic bags for me and the bulk food and produce departments. I can even stick the price label right on the bag. I typically rinse them out by hand unless they’re really sticky or messy and then just to be on the safe side I put them in a lingerie bag to wash them but I’m not sure that that’s necessary. I bought two sets to make sure that I always have some with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Rcolaci2",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Death by plastic",
      "text": "I’m very happy with these bags and the size and quantity. I decided to write this review because of the packaging. I purchased this product based off of my desire to no longer use plastic. I monthly use money to purchase alternatives to do my part to save the planet. 9/10 the makers of these products go the extra mile to consider the packaging. This is the 1/10 time that packing was not considered. When my package arrived it was in side a plastic bag. WTF? So dumb. Come on Besos get it together.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr and Mrs Fart Face",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Not using plastic bags anymore",
      "text": "I take it to the grocery store with me. Have not used a plastic bag since I got them. I wish EVERYONE would do this! I also stopped using one-use plastic containers, like the ones you get at the butcher counter for chicken salad and the like. I just have him wrap it in butcher paper and then I put it in my own container when I get home.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Gray",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Help reduce plastic waste!",
      "text": "Just about every time we shop for fruits & veggies with these reusable, durable, inexpensive mesh bags, we are mobbed with questions: Where did you get them? How much were they? Do they last? Can you clean them? Answers: Amazon. $9.99 for 18 bags (2 9-packs). Yes, they last and last. Yes, they can be washed in the sink or washing machine. PLUS, they have many other uses. Do your part to reduce plastic waste in our landfills and our oceans -- get these bags and never use plastic again! Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Margaret",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Best produce bags",
      "text": "These bags work great! I’ve taken them to the grocery store to purchase produce and have also used some at home in my fridge (to store washed produce) since 9 bags came in my order! They are super easy to clean and have greatly reduced the number of plastic produce bags coming home with me. These are affordable and have held up better than some I’ve spent more money on in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Plastic veggies bags no longer needed",
      "text": "These are great. I hated coming home with 10 plastic bags every week filled with veggies. These things are great, they are good for the environment, but they are just great for me personally. I can put heavy items in them and they are just fine. 4 or 5 sweet potatoes don't even stress the bags, where as they would tear thru the plastic ones easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Great for environment; better for vegetables",
      "text": "These bags are just what I was looking for when purchasing fresh vegetables. I already carry grocery bags and was very bothered using clear plastic bags for all the fresh vegetable I purchase. I am so glad I found these. They are very sturdy and well made and wash up easily. I feel good about doing my little bit to help eliminate all those plastic bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Paulette N",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Nice for grocery produce",
      "text": "I will be using them for my grocery produce. Although they won’t hold very many apples. Would be nice to have a variety of size to match various quantities of produce. I’m using a couple of them for laundry bags to hold my nylons and socks in the laundry. Wish there were a clasp to hold the draw string closed. I have to knot it and sometimes difficult to undo for arthritic fingers",
      "rating": 5.0,
      "verified": true,
      "author": "amazonfan",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "They are made out of the perfect material. I will be buying more!",
      "text": "These bags exceeded my expectations! They are made of a great material that is clear and light weight so you can see your veggies, but do not get charged for more weight at the store. They are easy to clean. Such a good way to make a small impact in reducing plastic waste! I also keep my veggies and fruit in these bags because they are breathable and the plastic would always spoil the food faster. Great buy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20190911
    },
    {
      "title": "Less hassle for the checkout person",
      "text": "I like these produce bags the best because you can see through them and they are lightweight. I have some heavier ones which aren't see through and that makes it hard on the checkout person. Also, if the bag is so hefty that they have to enter a tare weight, it seems like a hassle. These bags avoid all hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "JEE",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Reduce plastic while grocery shopping!",
      "text": "Hands down one of the best purchases I made recently. It is super lightweight and easy to fold and carry around in a small purse. I feel like the vegetables and fruits stay fresh longer in this compared to the plastic bags you'll find at grocery stores. Looks easy to clean - however I haven't had to clean them yet (I have been using them on and off for about a couple of months now). The drawstring knot came loose on a couple of them but no biggie, I just tied them back and seems fine now. And the satisfaction of not using plastic bags is just priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "Durga",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Less Waste!",
      "text": "I love making the switch to less plastic! These bags are the perfect size for my produce and there’s also enough to where I can use them in the fridge. Heck, there’s enough that I may give my sisters some too. Haven’t washed yet but seems like it will clean easily on a delicate setting. I bet these will last me a long time. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel H",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Wish I would have found these sooner!",
      "text": "My boyfriend and I are trying to limit our usage of single-use plastics and materials, and these mesh produce bags are just what we needed! Each bag holds a lot of produce (up to two large heads of romaine), are very sturdy, and are easy to clean. I wash wish water and a mild soap after use and let them air dry (which honestly takes like ten minutes). I'm going to recommend these bags to friends and family, as well as to a high-end grocery store that is in my city.",
      "rating": 5.0,
      "verified": true,
      "author": "mia",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Not Biodegradable",
      "text": "I love that these bags allow you to stop using plastic bags at the grocery store. Unfortunately, I realized after I bought these that they weren't biodegradable or recyclable at the end of their life which was a huge turn-off for me. Ended up returning them.",
      "rating": 3.0,
      "verified": true,
      "author": "Kerstin J.",
      "helpful_votes": 6,
      "publication_date": 20180212
    },
    {
      "title": "Useful for storage as well as at the store",
      "text": "I bought these to replace single-use bags at the grocery store, but have found that they are wonderful for storing produce in the refrigerator as well. A cut melon, cucumber, apple, mango, etc. will stay crisp and fresh in these bags for at last a week.(Haven't tried it for longer than that.) No mold, slime, discoloration - these bags are wonderful, and they go through the washing machine cycle with ease. Can't recommend them too highly!",
      "rating": 5.0,
      "verified": true,
      "author": "NC Grandma",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Love the transparency and sturdiness",
      "text": "I have other types of re-usable produce bags but I reach for these first every time. They are transparent enough for the checkers to see what they contain, all the same size so I can grab and stuff easily. There is no closure 'button' but I seem to not mind that. This is my second set and I am delighted to receive them so quickly. Thanks Earthwise",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Perfect so far",
      "text": "I have been using these bags for several months already. They are still in perfect conditions. I have washed them and they are still in the same conditions. But I washed them inside of laundry bags and in cold temperature. As I am trying to reduce my consumption of plastic this is a perfect solution for produce.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela S.",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "These bags are fabulous!",
      "text": "These mesh produce bags are truly terrific. I never use the plastic bags provided at the store anymore. They keep the produce fresher way longer than if they are put in the fridge in a plastic bag. I wash my produce while it is in the bag. No need to remove it. The mesh allows me to do this, and yet...keeps the veggies fresh for a very long time. When dirty, I just throw them in the washer. Easy-peasy.",
      "rating": 5.0,
      "verified": true,
      "author": "Goody2Shz",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Transparent!",
      "text": "If you're looking for transparent, resuseable produce bags, these are it! I'd bought other bags, but could never see what was in them and had to open them to see the contents. But these are totally transparent. I can't speak to durability as I just got them, but they look like they'll hold up fine.",
      "rating": 5.0,
      "verified": true,
      "author": "eyesa",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Be Environmentally Conscious.",
      "text": "I saw these bags advertised somewhere and decided that I would try to cut down on plastic waste. I bought these through Amazon. They turned out to be very nice, easy to use, when you remember to take them, and you can even store fresh produce in them. A dunking in clean water is an easy clean. I feel good taking the extra time to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan from Elma",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great.",
      "text": "These bags are large enough for pretty much everything I want to put in them. The fact that they are transparent enough to keep store clerks from grousing at me is great and means I use them. And they are still sturdy enough to carry all the potatoes I can fit in them. Update: I bought another set because they work well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "See-through",
      "text": "I have another set of reusable produce bags that I love, but the main problem with them is that the mesh is so thick the clerk at the store can’t see what’s inside, so I have to remember what’s in which bag. These bags don’t have that problem. So, while they don’t stretch to fit the produce you put inside, there’s no confusion about what’s in there. They are sturdy, easy to clean, and get the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "ShesCrafty",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Everyone Should Use These!!",
      "text": "O.M.G. everyone should be using these. I have been using reusable grocery bags for years and hadn't found a good solution for produce...until now. These are perfect. Very light weight, easy to clean. I tuck them in with my shopping bags. Even my son is using them now. I need to send some to my other son. Ack! Easy conversation away from plastic produce bags. So happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Culp-Hook",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Works well for grocery shopping",
      "text": "I liked them. Seemed good quality and the see through helps the checkout counters. Use them on every trip to the grocery store. I tried keeping greens in them in the refrigerator but they wilted with no fault of the bags though, I think it was the lack of moisture. Hence dont think I will use it in the fridge.. but great for shopping.",
      "rating": 5.0,
      "verified": true,
      "author": "Dhanashri",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Beats those plastic bags in the store",
      "text": "Great product clear see all products with sticker prices for the scanners in the store I also do not have to message with those plastic bags in the produce aisle which I can never get open without getting my finger wet which I do not want to do during the COVID19 issues they clean well",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great alternative to plastic",
      "text": "I got these because I buy a lot of produce and felt like I could find a better alternative. These are great bags. They are extremely lightweight, easy to clean and hold everything I need them too. I have had a lot of success with these on grocery trips and they are very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Bags ok but wash first in case not in mfg package",
      "text": "Product is 9 full size mesh bags which work great for produce purchases. I love them for grocery shopping. We haven’t owned them long enough to rate for durability though they seem a little thinner than some we had purchased at our grocery store. The only reason for the downgrade is the packaging we received the bags in was not what is shown in the picks - 8 of our bags were folded and place into 1 and then in plastic with a sticker that said new but gave me the idea these are returns resold. Not a huge deal, but was expecting them in the mfg packaging so we definitely washed them all before using.",
      "rating": 4.0,
      "verified": true,
      "author": "Fid Mom",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "I’m breaking my plastics habit!",
      "text": "I’ve only had these for a few days, so I can’t attest to their durability. But so far these bags just as described and exactly what I was looking for. I take them with me shopping and put my produce in the mesh bags rather than the plastic bags provided by the grocery store. I’m storing most of my produce in these at home and they keep it just fine. I’m so glad to have an alternative to plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "sierra",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Great bags",
      "text": "I like these bags and use them every time I go shopping. One got strawberry juices on them, so I simply sent it through the wash with my kitchen towels and it doesn't seem to have done any harm. They're transparent enough so that the checker doesn't have to open them to check the number on the produce.",
      "rating": 5.0,
      "verified": true,
      "author": "ADK",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "GREAT to Avoid Plastic Bags",
      "text": "I purchased these when a friend made me aware of them. I absolutely LOVE them !! They are easy to carry with you to the market, and for storage of produce at home. I keep them inside my reusable bags after just rinsing them at home once I've used them. I will probably purchase more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sadie",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "Great replacement for the single use produce plastic bags",
      "text": "Great alternative to the single use plastic bags in the produce aisles. Had switched over to reusable shopping bags, but still had guilt about those produce bags, and these are the answer. Large enough for any produce I would get, durable, and breathable. Great price. Enough bags to split between my and my husband's car so we always have them for shopping.",
      "rating": 5.0,
      "verified": true,
      "author": "VT Pet Doc",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "but it is nice not have to use plastic bags from the store ...",
      "text": "It was a little bit difficult to unattach these bags from the cardboard backing and it ripped a few small holes into the bags doing so, but it is nice not have to use plastic bags from the store each time I buy produce.",
      "rating": 4.0,
      "verified": true,
      "author": "M.D.",
      "helpful_votes": 3,
      "publication_date": 20171209
    },
    {
      "title": "Sturdy, easy to clean bags",
      "text": "I am trying to reduce my plastic use and these bags are great for produce shopping. Sturdy and so easy to wash -- I just squirt on some dish detergent, put the bag under hot water, or mix them with my hand wash dishes and they clean right up. They dry quickly. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Reluctant traveler",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Ditch the produce bags and get with the durable mesh bags!",
      "text": "Used these bags for the first time this weekend grocery shopping. I was looking for something easy to carry around, durable enough to hold produce, and easy to clean. These bags are amazing! The mesh is very durable and is easy to wash in the sink. These are perfect if you’re looking to reduce your dependence on produce bags like I was. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "codeMonkeyK",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Good see-through & light weight produce bags",
      "text": "Definitely the best eco-friendly produce bags i have found. Though i always use reusable super market bags, i hate thst the supetmarkets still use plastic produce bags. I had purchased a couple other brands produce bags online which looked to be see-through but on arrival they were quite opaque and hence very annoying as the checkout operator had to open to check contents. These were great though, you can easily see the fruit in the bag, and their stickers. Light weight and flexible material too. A good buy, happy with purchase though were a bit expensive, which was the only downside.",
      "rating": 4.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 2,
      "publication_date": 20180212
    },
    {
      "title": "Stop wasting plastic bags",
      "text": "We've had reusable grocery bags for years, but never thought twice about using plastic for produce. Then it dawned on me: I'm wasting bags here as well. So I searched for reusable. This are light, a good size, and see through at the checkout. I don't know why we waited so long to figure this out.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Alder",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Packaging is not like in photos",
      "text": "I ordered these as a gift, on a repeat order, as I had purchased these last year to give as gifts and they came packaged as shown, in three sets of three bags on cardboard backing which makes them nice to give as gifts. Not this time. This time, they came as just a pile of bags in one large plastic bag, which makes them not so nice to give as gifts. I don't have a problem with this kind of packaging if I had purchased them for myself, but I bought these to give as a gift and a wad of bags looks a little too cheap to be a nice gift. False advertising.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Very useful for produce storage and preservation",
      "text": "The produce bin in my refrigerator is no longer an unseemly mess. Everything is tucked into its own bag so that I can find it easily. For whatever reason, produce seems to last longer in these bags than when I just chucked everything into the produce bin. The bags are easy to wash and dry quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Freddy",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Perfect for getting produce at the store without having to ...",
      "text": "Perfect for getting produce at the store without having to use all those weak plastic bags. These are strong, durable, and you get a TON! I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 7,
      "publication_date": 20170427
    },
    {
      "title": "love these bags",
      "text": "These have all the features I wanted - negligible weight, see-through, washable, durable. I plan to buy more for family members - this is an important step for Americans to make in re-using and reducing and these are such an easy change. Our town has just implemented a ban of plastic bags but ironically not on the use of produce bags!?!",
      "rating": 5.0,
      "verified": true,
      "author": "D. L. Morris",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Perfect for Produce",
      "text": "These bags are working great for buying produce at the grocery store. They are large enough to fit 8-10 apples but also work just as well for smaller items. The draw string tops do not stay closed unless you tie them. This doesn't bother me and I usually don't tie them but it's worth noting. Overall, these are a great alternative to wasting all those plastic bags every time you go to the grocery store.",
      "rating": 5.0,
      "verified": true,
      "author": "Novagirl",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Great bags",
      "text": "Love these bags! They are larger than I expected, yet do not add any weight to my produce when I weigh them for payment. My arthritic hands always struggle so much to open the cheap disposable store produce bags, so these are a million times better - not only for my hands, but also for the environment.",
      "rating": 5.0,
      "verified": true,
      "author": "Nali16",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Perfect size and material",
      "text": "I like these bags because they’re lightweight and the perfect size for apples or potatoes. I asked the checkout person at my grocery store if she liked when customers use these bags and she totally approved. They even have the tare weight noted on the tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane R.",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "These are nice, and I like that I don't have to ...",
      "text": "These are nice, and I like that I don't have to use more plastic when I buy my produce. The only thing I don't like is that the barcodes won't scan through the mesh. It's a small thing, though. Overall, they are great. They go right into the washing machine, too.",
      "rating": 4.0,
      "verified": true,
      "author": "Blossom",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "These are great, highly recommend!",
      "text": "I am so in love with these bags! Not only are they obviously better for the environment than a gazillion plastic produce bags, but they’re easier to use than the plastic bags too. At first I kept apologizing to the grocery store cashiers for the hassle, but almost all of them have said these bags are actually easier to see through and handle than the plastic! They’re very lightweight, washable, and I haven’t had any issues with durability either. I even got my less-eco-conscious husband on board after he saw how much easier than plastic these bags are. Win!",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Boston",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Best reusable bags",
      "text": "I was so excited to finally have these reusable bags for my grocery shopping. I’m excited to use them for sand toys this summer and packing the beach bag. They’re super easy to use, clean, and so much better for the environment than single use plastic bags. Glad some cities locally are choosing to ban the plastic and push for reusable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaeleigh K",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Convenient and a great price",
      "text": "These produce bags are a great value. I have had one rip through the bottom, and one of the green strings ripped the top of one more. But all the others are been very sturdy and are still working great. Best for smaller/lighter produce. Super easy to clean, quick to dry, and it does feel awesome not adding all those little plastic bags to the trash after grocery shopping.",
      "rating": 4.0,
      "verified": true,
      "author": "ShaneM",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Please recycle!",
      "text": "These bags are awesome, please everyone either get these or another brand, too many plastic bags are going into our oceans, it needs to stop, these bags will help in the fight of plastics dumped into oceans, and please recycle plastic bottles and anything else instead of going into the trash. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Raven Shadowz",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Strong, lightweight, great value",
      "text": "I seriously love these bags. After purchasing them for myself, I have since purchased them twice more to give as gifts to others. They’re strong but very lightweight so as not to add excess weight to the scale at the register. I love that I can rinse/store my produce in them and then throw them in the washer to clean them. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "kathryngrapes",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "So far so good, the size it's about right for most of ...",
      "text": "I just use for the first time my bags. So far so good, the size it's about right for most of the produces. I didn't buy lettuce or big leafs items but maybe it wouldn't fit. The string is very convenient. The bar code couldn't be read through the mesh so I input my self each one as I was in the self check out cashier. I like it and so happy don't have to keep using the nasty plastic bags. I feel I'm doing a little bit better for the planet.",
      "rating": 5.0,
      "verified": true,
      "author": "M ESPINOSA",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great bags!",
      "text": "These bags are just what I was looking for to replace the grocery store plastic produce bags. It makes it easy to wash produce right in the bag if you choose and the bags can be washed as well. The only issue I found was that the drawstring does not stay closed without being tied off. A minor issue compared to all of those plastic bags I used to dispose of. Great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "The mesh produce rock",
      "text": "These bags are awesome! Well made, easy to use and they prevent me from having to bring home home another plastic bag that takes many years to decompose. Love them and I think you will as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Love these Earthwise Reusable Mesh Produce Bags - Washable Set of 9 Premium Bags,",
      "text": "I love these Produce bags. I've been asked about them while checking out groceries. Been complimented on them and asked \"where can I get them?\" I haven't seen them anywhere except here on Amazon. They are strong, effective, pretty and good for the Earth. Easy to wash and hang dry.",
      "rating": 5.0,
      "verified": true,
      "author": "Business Professional",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Great for farmers market!",
      "text": "My household buys produce quite often from the farmers market and supermarket. We end up with tons of plastic produce bags and the farmers market only uses plastic bags to put your fruits and veggies in. I carry these and my reusable totes now that my household is slowly adapting to a plastic free life.",
      "rating": 5.0,
      "verified": true,
      "author": "uruwashii",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Wish everyone would buy! Say no to plastic bags",
      "text": "I love this product and wish everyone would buy these along with reusable bags when shopping! I use them for veggies and fruits when food shopping but you ca literally store anything you like, I even put cookies in there for road trip and no mess! They're washable as well and pretty big easily fits carrots and celery.",
      "rating": 5.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Handy Bags",
      "text": "I bought these bags to use for fresh produce in the supermarket, but have used them for so many other things. When picking fresh veggies from the garden, I bring one or two with me. I keep a few in the car and around the house to gather little thing together and keep them visible. They are so light, I can pack them in by purse wherever I go. Although I haven't put them in the washing machine, I rinse after each use without any problem. They air dry quickly and are ready to go again.",
      "rating": 5.0,
      "verified": true,
      "author": "Badger",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Substitute for plastic bags",
      "text": "These bags have stood up well for me over numerous trips to the market and hand washing. Checkers have no problems with them and I don't use plastic bags any more. Great product. I have ordered multiple packages and keep some items in the fridge in them as well, like tangerines and cucumbers etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan V.",
      "helpful_votes": 0,
      "publication_date": 20190505
    }
  ],
  "product_meta": {
    "title": "Earthwise Reusable Mesh Produce Bags - Washable Set of 9 Premium Bags, TRANSPARENT Lightweight, Strong SEE-THROUGH Mesh for shopping, transporting and storing fruits and veggies.",
    "rating": 4.8,
    "feature_bullets": [
      "SUPER VALUE - You will receive a total of 9 Mesh Produce Bags! SIZE: Each Bag Measures 11\" X 13.5\"",
      "SAVE THE ENVIRONMENT AND MONEY - Eliminate Hundreds of Plastic bags. Each mesh produce bag has the potential to eliminate up to 1000 plastic bags over its lifetime.",
      "MULTI-USE - These bags arent just for fruits and veggies, you can use them as toy storage bags, snack bags, small item laundry bags and much more!",
      "EASY TO SEE WHATS INSIDE- Our mesh produce bags are LIGHTWEIGHT which makes it easy to see whats inside the bags without having to open it. BAR-CODES will EASILY SCAN THROUGH our mesh. Each bag WEIGHS LESS THAN 1/3 OF AN OUNCE so YOU WONT PAY MUCH EXTRA WEIGHT when checking out."
    ],
    "specifications": {
      "Package Dimensions": "7.6 x 7 x 1.5 inches",
      "Item Weight": "2.39 ounces",
      "Manufacturer": "Earthwise",
      "ASIN": "B005E2QRPG",
      "Item model number": "FBA_EW105",
      "Customer Reviews": "4.8 out of 5 stars3,421 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#7,499 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "July 22, 2011"
    },
    "categories": [
      "Travel & To-Go Food Containers",
      "Home & Kitchen",
      "Reusable Grocery Bags",
      "Storage & Organization",
      "Kitchen & Dining"
    ],
    "price": 12.97
  }
}