{
  "website_summaries": [
    {
      "verdict": "An attractive model that has lots of user-friendly features but falls a bit short when it comes to durability.",
      "pros": [
        "Features attractive silver-plated handrail and serving shelf",
        "Has similar features to other models – three switch options, warmer, and storage bin"
      ],
      "cons": [
        "It's challenging to assemble and doesn't feel as sturdy as some other popcorn machines"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great machine. Very easy to assembly and to clean",
      "text": "Great machine. Very easy to assembly and to clean. Has a nice storage compartment behind door to store oil and popcorn. The popcorn popper pot is very easy to remove to clean and the bottom tray that slides out is convenient for picking up loose kernels that don't pop. The bottom tray is easy to remove for cleaning you just need to take off the little front flipper door on the front. The popcorn popper works great and can be removed from cart to be a counter top model if needed. Construction is built good and the wheels are durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Woodcrafter0621",
      "helpful_votes": 23,
      "publication_date": 20150722
    },
    {
      "title": "Love the machine but worried about cleaning",
      "text": "This popcorn machine is very pretty and relatively easy to assemble. I have used it twice and am not sure if I have to take the popcorn receptacle with spinner out every time I need to clean it. It is awkward to try to do this while it is still attached inside the machine. This is definitely NOT a deal breaker because the machine is so cool looking and makes great popcorn fast! I would recommend this machine.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Sausville",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great popcorn maker, good looking, solid design",
      "text": "This was a fantastic addition to my \"man cave\" I literally use it every time I have the guys over. Assembly was relatively easy, arrived with one minor dent. Very easy to use, I recommend putting more oil than you think. The first couple of batches I went light on the oil and the popcorn came out stale. Now I use one cup popcorn, half cup oil, half a teaspoon popcorn salt. Now the popcorn is excellent!! (probably not healthy though)",
      "rating": 5.0,
      "verified": true,
      "author": "kickassbrit",
      "helpful_votes": 8,
      "publication_date": 20131108
    },
    {
      "title": "Fantastic!!",
      "text": "While I had issues on my first order (never arrived), a replacement was shipped out immediately. We love this machine and so do our friends. It’s becoming a must to make popcorn when friends come over. No matter what we may serve for dinner, everyone makes room for popcorn.",
      "rating": 5.0,
      "verified": true,
      "author": "DHL",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Assembly instructions were very easy to follow and unit was up and ready to ...",
      "text": "Received our Popcorn Machine today. It was very well packed and all items were included as advertised. Assembly instructions were very easy to follow and unit was up and ready to go in about 30 minutes. Unit looks great and works well. Very happy and would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark McFadden",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "I love it so far",
      "text": "I love it so far. pop popcorn great easy to clean especially if you clean it as instructed when finished popping. haven't put the cart together yet to rate on it. kids enjoy each time I pop popcorn for them. great for parties and get togethers. pops more popcorn than I expected at a time. I used jolly time popcorn brand in the bag ( the cheap way to go) from the grocery store and it popped great so I guess the brand doesn't matter that much. I only used it about 3 times since I had it . so a month isn't really that long so hoping it keeps performing as it has been. seem like it will.",
      "rating": 5.0,
      "verified": true,
      "author": "lbellamy",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "I bought this cause I like popping popcorn at all times of the night and ...",
      "text": "I bought this cause I like popping popcorn at all times of the night and don't want to disturb my neighbors with my noisy popper. Overall I'd say this is a pretty good popper, it's quiet with only one problem, it doesn't pop about 10% of the kernels, and I don't even use the maximum. As it's popping you see unpopped kernels flying out with the popped corn. Deducting 2 stars for only one problem seems like a big drop but 10% is a lot of waste.",
      "rating": 3.0,
      "verified": true,
      "author": "Dale Perry",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "Door is not stable and cannot re-order just the door.",
      "text": "Not Happy with this machine what so ever only because the door fell off and broke... I have been trying to order just the door itself and its been on back order for 4mos. now and they don't know when it will be available... sounds like i will need to but a new machine...",
      "rating": 1.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "we do love having our own popcorn machine in the house",
      "text": "The 4oz size is just right for our theater room. The top edge of lettering painted on one side of the base unit was a little smudged. But since you would not see it we decided to keep it. The first time we popped popcorn the oil burned a little and there were many unpopped kernel in the tray. We wish the booklet table on how much to pop included an estimate on cups popped. However, we do love having our own popcorn machine in the house.",
      "rating": 4.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Not a horrible machine. Does the job well",
      "text": "I've had this popcorn maker for a while not. Not a horrible machine. Does the job well, but very difficult to clean! Spent an hour trying to just put it all back together after cleaning it. Otherwise, makes popcorn good.",
      "rating": 3.0,
      "verified": true,
      "author": "Mandy",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "We love it. Bought for my husband's Man Cave last ...",
      "text": "We love it. Bought for my husband's Man Cave last Christmas. The guys had a blast putting it together. It is so unique and cooks the best popcorn We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Solid, sturdy",
      "text": "Sturdy, easy to assemble, easy to use. Bought this for my office we use it for client events.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Mantia",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "went together easily, some components seem to be cheaply made for ...",
      "text": "went together easily, some components seem to be cheaply made for a professional grade product but so far have not had any problems with it.",
      "rating": 4.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Works great!",
      "text": "We live this popcorn machine. Makes better popcorn than tre movie theatre. Easy assembly, sturdy and great product!",
      "rating": 5.0,
      "verified": true,
      "author": "VMS984",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Four Stars",
      "text": "Best popcorn ever. Makes enough for those family movie nighs.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn Stanton.",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Unhappy",
      "text": "My item was damaged!! Very dissatisfied!! As i cant rerurn it..waste of $200",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Smaller than expected, thought was a full size. ...",
      "text": "Smaller than expected, thought was a full size. Also had pieces missing, scratches right out of the box if wasn't for charity I would send it back unhappy overall with item",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy Watkins",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Better than the movies",
      "text": "Better then moviehouse popcorn if you get the right popcorn kit, We've gotten lots of compliments on the look of the popcorn machine as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick Jewsome",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Had a missing part. Purchased as a gift had ...",
      "text": "Had a missing part. Purchased as a gift had to send gift recipients a copy of order so company would send them the part.",
      "rating": 3.0,
      "verified": true,
      "author": "Gina Tweed",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "I like it, just a little faul...",
      "text": "I'm really enjoying the popcorn machine, there is only one problem. The door on it is very easy to pop off as well as the door doesn't go all the way to the top, therefore it allows the popcorn to pop all over the floor.",
      "rating": 4.0,
      "verified": true,
      "author": "angela",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "Did someone say popcorn",
      "text": "Bought for our PTA to use at school events. Love it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica lee Bournonville",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "This seems like a great deal of work",
      "text": "I received the popcorn maker but when putting it together, it was missing the metal axle rod that goes between the wheels. Without this, I am unable to use the wheel feature. My concern is that when I submitted this information to Amazon, the only option I had [after selecting \"missing parts\" was to return the entire item. I would prefer not going through the hassle of having to repack this large item simply for a metal axle rod. Why can't I have the option of just having the replacement rod shipped to me? This seems like a great deal of work.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Young",
      "helpful_votes": 2,
      "publication_date": 20161214
    },
    {
      "title": "Five Stars",
      "text": "Great addition to the Media Room. No complaints; and the popcorn was tasty as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Alexander Jr",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "One Star",
      "text": "Wheel axis missing from box.Still have not used it. 3week back order on parts as of 1-3-16.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Operates just like a movie theater machine and pops great popcorn",
      "text": "Operates just like a movie theater machine and pops great popcorn. The only complaint I have is that the lid is screwed onto the kettle which makes it a little difficult to clean. Otherwise, great machine and well worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Beach Bum",
      "helpful_votes": 0,
      "publication_date": 20140724
    },
    {
      "title": "Delicious!!",
      "text": "Arrived right on time. The setting it up wasn't hard at all with the directions. I bought it for my dad for his birthday, and it works great! I'm at his place all the time now making a new batch. I would definitely say it was worth it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "A-WAX",
      "helpful_votes": 3,
      "publication_date": 20131203
    },
    {
      "title": "GREAT MACHINE!",
      "text": "Wonderful machine! No complaints no flaws no shipping issues. Plan on ordering cotton candy and sno cone machine from the same company. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Five Stars",
      "text": "Just what I expected. Did well for what I had intended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce L. Moore",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "I cannot find an email or phone # to contact ...",
      "text": "I cannot find an email or phone # to contact someone about this item. There is a piece missing from this package and I don't want to send back the whole package we just need the axle bar which is labeled as item H in the directions. Please let me know if there is another # or email for me to contact someone or if you can get this sent to us as soon as possible as we need it for an event coming up. Thanks: *Name on this however is not coming Jessica Burch but Laura Edick as Jessica is no longer with our institution.",
      "rating": 2.0,
      "verified": true,
      "author": "CORE FCU",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "Five Stars",
      "text": "I have my maxi matic and i`m happy with it. It`s so easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "LYGIA DANIELA ROTONDA AYALA",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "It is very easy to use and I have had no problems with ...",
      "text": "Arrived exactly when they said. Setting it up was not hard at all as long as you use the directions. It is very easy to use and I have had no problems with it. I am making popcorn 3 times a week sometimes more. This was a gift to myself for Christmas and I absolutely love it! I would recommend it to anyone who loves popcorn.",
      "rating": 5.0,
      "verified": true,
      "author": "lilbark",
      "helpful_votes": 0,
      "publication_date": 20150203
    },
    {
      "title": "A lot of pieces to put together but fairly easy. Popcorn tastes just like theatre",
      "text": "We have used this so many times!!!! A lot of pieces to put together but fairly easy. Popcorn tastes just like theatre!",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Love it",
      "text": "The kids love making popcorn more than ever now since Santa brought this!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Ann",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "A bit challenging to assemble, but worth it. Great customer service.",
      "text": "Though we had an issue with a missing part,customer service more than made up for it. Make sure you look CAREFULLY in all packing material for parts, especially the axle to connect the wheel. Not all the holes are lined up perfectly, making assembly a little tricky. I recommend 2 people to assemble it. The finished product looks and works very well. Popcorn takes very little oil to make. Clean up is easy. Great addition to our home theater room.",
      "rating": 4.0,
      "verified": true,
      "author": "HelpMeRonda",
      "helpful_votes": 3,
      "publication_date": 20160711
    },
    {
      "title": "Movie theater popcorn in minutes! Beautiful design!",
      "text": "I love this machine! Makes fresh delicious movie theater popcorn! Have it in our living room for movie nights in minutes you have fresh delicious tasting movie style popcorn! Its unique design goes great in our living room the trolley look is noticed by all who come in our house! I have wanted one since i was a child and i think i made a great decision can't wait to hand popcorn out to the kids on halloween!😁",
      "rating": 5.0,
      "verified": true,
      "author": "alex",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Machine works I guess...",
      "text": "The box was barely all together when it was delivered. The side of the machine is dented and scratched in multiple places. I had to bend the pieces to put it together because t was damaged. I can’t send it back because the box was all taped together as it was. We did use it and it popped the kernels fine, and actually pretty quick. But I wouldn’t buy it again.",
      "rating": 2.0,
      "verified": true,
      "author": "Marissa Matthews",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Great Pop Corn machine",
      "text": "Great Pop Corn machine. This Machine is used in my daughter's store (Chocolate Works of Commack) on a daily basis and hasn't let us down. It fills the store with the aroma of freshly popped corn, easy to clean, easy access to scoop, and makes a decent amount of pop corn per batch. I would definitely recommend this machine for all....",
      "rating": 5.0,
      "verified": true,
      "author": "MONGO",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "We've used it many times already and it's so easy to use and fairly easy to clean",
      "text": "I purchased this as a gift for my husband/family. This thing is so neat! We've used it many times already and it's so easy to use and fairly easy to clean. Makes perfect popcorn and the thing is so darn cute, we keep in in our livingroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Dragonfly",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Great Machine",
      "text": "Awesome! Well constructed, easy to assemble, works like a charm! Couldn't be more pleased!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Lukash",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Love it!!!",
      "text": "Best gift ever!!! Love it. Easy to use. Easy to clean. Storage area is awesome for supplies to keep them hidden. Shelf is great for prep. Salt shaker and scooper are great additions!! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "shopper0115",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "Satisfied buyer!",
      "text": "This machine looks good, pops great and is just what we wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna K. Jones",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Looks fantastic in my wet bar",
      "text": "Looks fantastic in my wet bar. I need to use it more to get that fresh popcorn taste going. I feel when I find the right combination, this will be the hit of the party",
      "rating": 5.0,
      "verified": true,
      "author": "Gie Brown",
      "helpful_votes": 0,
      "publication_date": 20140719
    },
    {
      "title": "Love this! easy to set up and easy to ...",
      "text": "Love this!easy to set up and easy to use. Perfect addition to our house!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Great Deal!",
      "text": "Arrived double packed and safe. Was easy to assemble. Operations was simple, worked well and cleanup was a breeze. All good as long as you follow the instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Joyner",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "I really enjoy this popcorn machine",
      "text": "I really enjoy this popcorn machine, it's just like the movie popcorn. The key is to use coconut oil with butter flavor. Tabitha Lee",
      "rating": 5.0,
      "verified": true,
      "author": "Tabitha lee",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Great popcorn maker",
      "text": "I like this. It was easy to put together. Only complaint in cleaning. It's a pain. Butit looks great in the man cave and makes great popcorn.",
      "rating": 4.0,
      "verified": true,
      "author": "Drneedle",
      "helpful_votes": 2,
      "publication_date": 20160127
    },
    {
      "title": "Love it! Got it for Christmas",
      "text": "Love it! Got it for Christmas. My husband found it easy to put together. No dents or marks. It pops great popcorn! I use a white vinegar and water solution to clean it and that works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbie Yots",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Company popcorn maker",
      "text": "We bought this popcorn maker for our place of employment and we love it! It's easy to use and looks great also. It can be a pain to clean but overall it was a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20141208
    }
  ],
  "product_meta": {
    "title": "Maxi-Matic EPM-200 Popcorn Popper Machine, Red",
    "description": "Color:RedFamily and friends can enjoy traditional hot oil kettle popcorn with Elite's classic style tabletop popcorn popper. Features include a 8-ounce stainless steel kettle with built in stirring system, plexiglass windows and door, bottom warmer, and warming light to keep popcorn hot. Popcorn Popper has electroplated stainless steel handles and wheels. Easy to clean detachable stainless steel 8-ounce popping kettle. Makes up to 3-1/2-gallon of popcorn per batch. Includes all stainless steel accessories: detachable 8-ounce kettle, salt shaker, popcorn scoop, measuring cup and spoon.",
    "rating": 3.6,
    "feature_bullets": [
      "Makes freshly popped buttered popcorn - Up to 3 gallons of popcorn per batch with 3 switches-Light-Heat-Motor",
      "Easy to clean detachable stainless steel 8-ounce popping kettle",
      "Silver electroplated handrail and serving platform, 18-inch silver anodized wheels, and stands at 5-feet tall",
      "Features a bottom warmer to keep popcorn fresh and warm",
      "Tempered glass windows and plexiglass door, kernel crumb tray, and popcorn supply storage cabinet"
    ],
    "specifications": {
      "Product Dimensions": "26.75 x 59.75 x 17.5 inches",
      "Item Weight": "46 pounds",
      "Manufacturer": "Maximatic",
      "ASIN": "B0051O92TK",
      "Item model number": "EPM-200",
      "Customer Reviews": "3.6 out of 5 stars51 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#293,375 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 28, 2011"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Specialty Appliances",
      "Popcorn Poppers",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}