{
  "website_summaries": [
    {
      "verdict": "Large sports Nike backpack with a lot of space and a variety of pockets and easy access storage.",
      "pros": [
        "Large, dual-zip main compartment with rain flap for secure storage"
      ],
      "cons": [
        "Water bottle mesh pocket is not very sturdy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great quality and space!",
      "text": "Very happy with this backpack. The quality is great the storage space is perfect! My son has room for all his soccer gear with LOTS of space left over. Really happy with this purchase 👍🏼",
      "rating": 5.0,
      "verified": true,
      "author": "Braeden",
      "helpful_votes": 5,
      "publication_date": 20190722
    },
    {
      "title": "Great purchase. Highly recommend",
      "text": "Bought for my son for college classes and to use or football. My son loves this backpack. I was concerned that the nylon wouldn't be able to withstand the heavy books/clothes that my son stuffs in his bookbags, but this bag certainly withstands the abuse from the heavy loads. Great purchase. Highly recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Karolyn D. BoBo",
      "helpful_votes": 5,
      "publication_date": 20180223
    },
    {
      "title": "Great Gym Backpack",
      "text": "This bag is great for those who walk a distance to get to the gym and need to drag a lot of items with them. It fits in a standard locker, you can easily hang it on a hook from within the locker and access everything from the front of the bag. I found it's much easy to carry things using this bag than using a conventional gym bag with the standard shoulder strap that always seem to slip off your shoulder. It has a lot of hidden zipper pockets making it easy to access those things you need the most.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170801
    },
    {
      "title": "Great soccer bag",
      "text": "My daughter plays club and we both love this bag. She likes it because it has many compartments for accessories and I like it because you can keep the wet and dirty stuff like the ball or cleats outside of the bag in a separate compartment. I was tired of grass and mud constantly in her old gym bag. It’s held up great for a season and we plan to keep it for many more.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex K.",
      "helpful_votes": 2,
      "publication_date": 20181128
    },
    {
      "title": "Durable, practical and great looking backpack.",
      "text": "My teenage son loves this backpack. He has been using it for a few months now, and I expect this backpack to continue to get a lot of use. It is quite durable and I feel it is worth every penny I spent on it. I would certainly recommend this backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilmour",
      "helpful_votes": 5,
      "publication_date": 20161021
    },
    {
      "title": "Five Stars",
      "text": "My son loves it and it has a lot of room. It is not large enough for 2 basketballs but 2 Soccer balls could fit. My son carries it for his school bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Audrey Johnson",
      "helpful_votes": 4,
      "publication_date": 20171228
    },
    {
      "title": "Great bag!",
      "text": "Great bag for any sport. My girls use it for cross country, basketball, soccer, and track.",
      "rating": 5.0,
      "verified": true,
      "author": "AtHome",
      "helpful_votes": 4,
      "publication_date": 20171201
    },
    {
      "title": "Five Stars",
      "text": "Bought this for my daughter who plays volleyball, basketball and soccer and she loves it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180213
    },
    {
      "title": "Doesn't feel like the highest quality",
      "text": "Just started school, so we'll see. Doesn't feel like the highest quality, hopefully it holds up for the year, with lots of heavy high school text books being hauled. Way overpriced for what you get. It's basically a $20 backpack with a Nike logo on it.",
      "rating": 3.0,
      "verified": true,
      "author": "S. R.",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Happy Grandson",
      "text": "Purchased this item for our Grandson for Xmas. He uses it religiously to carry his basketball and other equipment. He is very happy with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Bongay",
      "helpful_votes": 2,
      "publication_date": 20190121
    },
    {
      "title": "Quality & price",
      "text": "This bag arrived early and I was very impressed. I shopped around and this is great deal. The quality of the bag is really nice, and it is big enough to put 2 soccer balls in it, which sometimes my son does for soccer practice. My 15 yr. old son is on a select team and this bag is as good as some of the team bags, but for a lot less money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180323
    },
    {
      "title": "Really good gym bag",
      "text": "I had this bag for a little over a year and I used it for a gym bag and a basketball bag, and it was great. It didn't rip or tear at all. the only downside is it's not waterproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Talia",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great product",
      "text": "I have been using this for over a year and have no problems with it yet. Great functioning bag. I even use it for daily school books.",
      "rating": 5.0,
      "verified": true,
      "author": "Ale",
      "helpful_votes": 3,
      "publication_date": 20180214
    },
    {
      "title": "Durable",
      "text": "We are about halfway through the school year and there is no visible wear and tear on this bag yet. It has held up excellent. Has different compartments for things like pens and pencils and my son stores his rain jacket in one of the compartments. Plenty of room for his books and the rain jacket.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Nicely made",
      "text": "I bought this backpack as a gift for my son. He has been using it for a while now and loves it. It is a good size bag for his athletic uniform and shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn ",
      "helpful_votes": 3,
      "publication_date": 20180125
    },
    {
      "title": "Very nice quality. The backpack will hold plenty of school ...",
      "text": "Very nice quality. The backpack will hold plenty of school supplies but also has space for all my son's soccer gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Living_Lime_Green",
      "helpful_votes": 4,
      "publication_date": 20170825
    },
    {
      "title": "Great backpack",
      "text": "Great backpack I do wish it had more compartments but seeing that this is a sports backpack, it's understandable. Theres lots of room in the bag as well",
      "rating": 5.0,
      "verified": true,
      "author": "EuriPovsky",
      "helpful_votes": 3,
      "publication_date": 20170819
    },
    {
      "title": "Five Stars",
      "text": "Good back pavk. Hardly any side pockets, or pockets on the inside.",
      "rating": 5.0,
      "verified": true,
      "author": "Kassandra Thomas",
      "helpful_votes": 4,
      "publication_date": 20170412
    },
    {
      "title": "Good product",
      "text": "Purchased this for my son to take to and from basketball games and practices and things. It’s a bit smaller than we thought but at the same time still fits everything. He likes it , so I’m happy",
      "rating": 4.0,
      "verified": true,
      "author": "Audrey Fletcher",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Nice product",
      "text": "It does it's job. It can hold at least 2 basketballs and that's what I bought it for so I'm satisfied. It also has a nice array of pockets for other storage like drinks, phones, pumps, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "D. T.",
      "helpful_votes": 4,
      "publication_date": 20170211
    },
    {
      "title": "Holds everything!",
      "text": "Just what my daughter wanted to hold all her soccer gear in for high school soccer. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "robbin",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Made to last!",
      "text": "My son's had the same under armour backpack since kindergarten. It's still in great shape, however he's outgrown it. He is loving this nike backpack. It's large enough to carry his cleats, men's size ten, books, and extra clothes. Fits basketball with plenty of extra room. He's been using it everyday this month. I will update this review if I run into any issues. Hopefully this one lasts as long as his under armour backpack did.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Sturdy for Soccer Gear",
      "text": "Needed a replacement soccer bag for my high school son. Lots of room and sturdy. Perfect for going to practice, games, and road trips for soccer.",
      "rating": 5.0,
      "verified": true,
      "author": "Tessie Boudreau",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Great for practices and tournaments",
      "text": "My 14 year old son can fit his size 11.5 cleats and full size ball in the bag. He's also managed to shove enough food for an all day tournament and a change of clothes as well. Seems durable. He's gotten a few compliments on the bag already.",
      "rating": 4.0,
      "verified": true,
      "author": "Mother of three",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "Great bag!",
      "text": "The description made it sound like my daughter volleyball would fit into the front part of this bag, which is not the case. This is a great bag and she can at least fit the ball in the main part!",
      "rating": 4.0,
      "verified": true,
      "author": "Tyger M.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Very spacious.",
      "text": "The bag is great. But I don't like the material that was used on the outside underneath the bag.. My nut neg spray spilled inside the bad and it started to melt the material. Also wish there was 2 bottle holders",
      "rating": 4.0,
      "verified": true,
      "author": "Akeem Chumney",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Very nice bag!",
      "text": "I use this bag for basketball and it fits everything you need with room to spare. The secret phone pouch is nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "😁",
      "text": "This bookbag was worth every penny. My oldest is in high school and she wanted something stylish and good space. I love this bookbag it holds everything!",
      "rating": 5.0,
      "verified": true,
      "author": "kira a bryant",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Awesome!",
      "text": "Great bag! My husband is super picky! And this bag was perfect for him to take to gym! His basketball fit in perfect and has extra space for water and phone! He even uses it for travel to put his clothes in for a quick weekend get away! Fits so much!",
      "rating": 5.0,
      "verified": true,
      "author": "candy",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Buy it",
      "text": "This backpack brought whoops and screams of joy from my grandson. Highly recommend this to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara R.",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Excellent product.",
      "text": "Lots of room in this backpack. My son uses the side compartments for his cleats and inner space for clothes and shoes for football. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of Boys",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Great one to get",
      "text": "I got my son this backpack for his first year in high school. It is holding up great and my son loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Diona Hinkle",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "The ball, net carrier portion is a little on ...",
      "text": "The ball, net carrier portion is a little on the small side, okay for volleyball, but I'd look for something a little different form basketball",
      "rating": 4.0,
      "verified": true,
      "author": "skyedemye7",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "excellent bag",
      "text": "Love this soccer bag. Great for holding everything while keeping stinky cleats separate. Don’t use ball sleeve often just put ball in bag too. Purchased another for my second soccer player.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "I got this amazing backpack for my son who is a high school ...",
      "text": "I got this amazing backpack for my son who is a high school student and he loved it. It's wide enough to fit his 3 binders and a book and the straps are wider than regular backpacks giving him comfort and great balance.",
      "rating": 5.0,
      "verified": true,
      "author": "maria vazquez",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "For the price it is definitely a good product when I was in high school I kept ...",
      "text": "For the price it is definitely a good product when I was in high school I kept buying nike elite backpacks for 100 plus dollars and they always kept breaking apart over time like the zipper kept falling apart and the straps also broke apart but this bag right here cost half that and it works way better",
      "rating": 5.0,
      "verified": true,
      "author": "Micah",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "So far so good. Bought this bag for my teenage daughter",
      "text": "So far so good. Bought this bag for my teenage daughter. At this point she loves it. Check back in a couple months.",
      "rating": 5.0,
      "verified": true,
      "author": "Weldman3",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Durable Backpack",
      "text": "Very durable, holds a lot of books. Half way through school and still good.",
      "rating": 5.0,
      "verified": true,
      "author": "pearline johnson",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "JerMy Loves It",
      "text": "I purchased the bag for my great nephew. JerMy loves it because its spacious and fits all of his practice things in it. He's a football fanatic.",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Frasier",
      "helpful_votes": 2,
      "publication_date": 20170424
    },
    {
      "title": "Nice but a little on the small side",
      "text": "Got this for my 10th grade son for school. It is good quality, but only hold 2 small binders and a notebook. No extra room for his books.",
      "rating": 4.0,
      "verified": true,
      "author": "Evan Oliver",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Five Stars",
      "text": "my son loves his new bag, it was cost efficient and arrived very quickly. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Mullins",
      "helpful_votes": 2,
      "publication_date": 20170131
    },
    {
      "title": "Love it",
      "text": "My son loves his new bag for all of his soccer gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Hicken Clan",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Perfect",
      "text": "Bought this for my daughter to use for high school this year. She loves it and all her stuff fits perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Well made, roomy backpack.",
      "text": "Great backpack, my daughter uses it for volleyball and it has lots of room for everything she needs to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Nelson",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Roomy!",
      "text": "My daughter wanted a 'cool' basketball bag. This does the trick! It holds her shoes and bag with plenty of room for extra storage.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Eschmann",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "She is happy with it",
      "text": "I bought this for my daughter for sports. She is happy with it. It fits everything she needs. Plenty of compartments to keep everything separate.",
      "rating": 5.0,
      "verified": true,
      "author": "AleahGentry",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Great",
      "text": "My son uses this as a regular book bag. Very spacious and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Sun flower",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Big bag",
      "text": "Love it! Very spacious and durable. It is a big bag so if you’re looking for something smaller it’s not this.",
      "rating": 5.0,
      "verified": true,
      "author": "amazonjunkie",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "great product description and product is exactly what I needed",
      "text": "Fast shipping,great product description and product is exactly what I needed",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime Leszczynski",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Nice quality",
      "text": "Nice quality ended up returning because my boyfriend didn’t need it",
      "rating": 5.0,
      "verified": true,
      "author": "Cammie",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "will be great as my son starts Junior High and has more ...",
      "text": "Very big, expands...will be great as my son starts Junior High and has more books to carry. I'm thinking this will be perfect for him.",
      "rating": 5.0,
      "verified": true,
      "author": "SDSLP",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "It’s a nice looking backpack and",
      "text": "The ball compartment wasn’t as expected still a very good backpack . Very roomy",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew sanchez",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Roomy and fashionable backpack",
      "text": "I love this backpack, as well as my son. It has a lot of room inside, just the right amount of pockets and it's very fashionable!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikkia Pressley",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "My daughter can fit all of her soccer gear and ...",
      "text": "My daughter can fit all of her soccer gear and school supplies in it. So she no longer has to carry two bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie Clark",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Three Stars",
      "text": "Not as nice as the Nike Elite. This one's quality is not great.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Franklin",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "So much space",
      "text": "I got this as a Christmas present for my boyfriend because he carries takes every textbook possible back and forth everyday and this will definitely work! There's multiple compartments for other items as well :)",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria Smith",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "Not bad",
      "text": "Hey, my kid needed a bag, so he got a bag",
      "rating": 4.0,
      "verified": true,
      "author": "Rob Hardison",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Great quality and a great price",
      "text": "Bought this a gift for my son who plays basketball. He loves it and I wish i had bought it sooner for him. It's a good weight and appears to be solid construction and material. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Do I recommend. Yes, yes I do 😌",
      "text": "Came as described. Works good and is pretty durable :) awesome quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amada",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "My daughter seems to love this. Her friends are always asking her where ...",
      "text": "My daughter seems to love this. Her friends are always asking her where she got it.",
      "rating": 5.0,
      "verified": true,
      "author": "sfarmer",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "Authentic and good quality",
      "text": "Awesome bag just as expected, used as a soccer bag and it’s perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Luca Artese",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Soccer bag not basketball as advertised.",
      "text": "Advertised as basketball bag but actually a soccer bag. The zipper in the ball section catches but won't return due to hassle and 20% restock charge. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Huge backpack",
      "text": "It's big and roomy! Can fit an oversized shoe box and has more room leftover.",
      "rating": 5.0,
      "verified": true,
      "author": "RMH",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "My son said this bag holds all of his soccer ...",
      "text": "My son said this bag holds all of his soccer equipment and his books for school! Now he only uses this high quality bag!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Track Bag",
      "text": "I ordered this bag for my son. He uses it for track. He loves it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Harris",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Love the backpack",
      "text": "Love the backpack... The size 4 ball doesnt fit in the pouch but its okay... my son still loves it!!",
      "rating": 4.0,
      "verified": true,
      "author": "Sylvia K.",
      "helpful_votes": 3,
      "publication_date": 20170127
    },
    {
      "title": "Soccer ball size",
      "text": "Works great! Fits all my soccer gear including my size 5 soccer ball",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Perfect",
      "text": "This backpack is huge! Definitely plenty of space for a high schooler. Very comfortable on.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Dray",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Very roomy",
      "text": "My son loves this bag and the fact that it holds so much stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "agrick",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Son loves it.",
      "text": "Son loves it has a lot of pockets and room for a ball cleats and everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Shontae'",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Great backpack! Zippers don’t have a strong hold.",
      "text": "My 9 year old loves this back pack! The only complaint I have is the zippers aren’t super strong so when he hung a keychain from a few zippers, the weight of keychains unzipped the zipper. Other than that, it’s been awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose2492",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Very nice!",
      "text": "A little pricey but it’s a good quality soccer backpack.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Spacious",
      "text": "Nice clean backpack!! Just enough space to take there soccer gear and a extra set if closing!",
      "rating": 5.0,
      "verified": true,
      "author": "Miguel Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Fits all of the extras in!",
      "text": "This is great quality and fits in all my sons goalie gear!",
      "rating": 5.0,
      "verified": true,
      "author": "ab1",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Satisfied",
      "text": "Bigger than expected but great quality! My son is currently using it for school but could be used for sports too. Will be able to use it for a couple years to come",
      "rating": 4.0,
      "verified": true,
      "author": "Donte",
      "helpful_votes": 2,
      "publication_date": 20170911
    },
    {
      "title": "Great deal and holds up well",
      "text": "Had it for over a year and I still like it a lot. Multiple uses for it. Great product",
      "rating": 5.0,
      "verified": true,
      "author": "Jonny",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Five Stars",
      "text": "Large bag, we use it for a wrestling bag. We had it embroider",
      "rating": 5.0,
      "verified": true,
      "author": "melissa bregant",
      "helpful_votes": 0,
      "publication_date": 20180326
    }
  ],
  "product_meta": {
    "title": "Nike Club Team Swoosh Backpack",
    "description": "Carry all of your gear in the Nike Club Team Swoosh Backpack",
    "rating": 4.8,
    "feature_bullets": [
      "Zipper closure",
      "Large, dual-zip main compartment with rain flap for secure storage.",
      "Zippered cleat and ball compartments store gear separately.",
      "Top and interior zippered pockets for small-item organization.",
      "Mesh side pockets for easy-access storage.",
      "Adjustable curved shoulder straps for comfortable carrying."
    ],
    "categories": [
      "Backpacks",
      "Luggage & Travel Gear",
      "Casual Daypacks",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 48.99,
    "specifications": {}
  }
}