{
  "website_summaries": [
    {
      "verdict": "Despite a few quirks, the RIM BlackBerry Style's practical design and advanced feature set make it a great smartphone for BlackBerry newbies and veterans alike.",
      "pros": [
        "The RIM BlackBerry Style combines a clamshell form factor and a full QWERTY keyboard",
        "It ships with BlackBerry OS 6, which has an improved user interface, a new WebKit browser, and a better multimedia experience",
        "Call quality was impressive"
      ],
      "cons": [
        "The Style's square design may be a bit bulky for some users, and the keyboard is a touch too flat for our tastes"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 7.0,
        "Performance": 8.0
      },
      "publication_date": 20101028,
      "rating": 7.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sweet Blackberry Style",
      "text": "Beautiful and compact, this sweet blackberry is my young sisters best friend, I bought it for her and I have been her favorite brother ever since. Its absolutely one you wanna try out. Its user friendly and easy to store. Just a reminder, the one I have is sim card free, so it can work better within the US and maybe Canada or Europe. Its a great phone...",
      "rating": 5.0,
      "verified": true,
      "author": "Wana",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Blackberry Flip Phone",
      "text": "I love it! I had the Lotus before could not find one at a reasonable price so I purchased this one. It is a little more difficult to use if you are not familiar with Blackberry but it has a large screen which makes it easier to see. The trackball takes some getting used to. I love it mainly because it is a flip! Thank you so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Bkelly5000",
      "helpful_votes": 0,
      "publication_date": 20140505
    },
    {
      "title": "Best seller",
      "text": "I'm very happy with this phone. I just use it for talk and text, it's very good",
      "rating": 5.0,
      "verified": true,
      "author": "Yitzy",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "Wish I had another one",
      "text": "Best ohone ever, why are the phasing out flip phones, everyone that see mine wishes for one",
      "rating": 5.0,
      "verified": true,
      "author": "frank broidy",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "can not be used",
      "text": "I bought this phone, but guess what, it can't be activated! So okay, default, bought another. Same problem! Screw this, waste of time. Waiting for my refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 5,
      "publication_date": 20140408
    },
    {
      "title": "Old School Blackberry Treasure",
      "text": "Finding this vendor was what makes Amazon shopping so great. Purchased for a friend who is a faithful and true Blackberry fan, and the Style flip phone is a classic. It also takes great pix.",
      "rating": 5.0,
      "verified": true,
      "author": "CamilaG",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "To: trustedtarri",
      "text": "Purchased a Sprint Blackberry Style cell phone from you in late February thru Amazon.com. Today (June 3, 2014), tried to activate the phone. After hours of effort, Sprint informed me that they could not activate the phone because it had been originally sold to foreign sources and could not be activated in the United States. I wish to return this phone and receive a reimbursement for my purchase. Please advise as to how this can be accomplished. Thank you.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr. Smith",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "beautiful in design",
      "text": "beautiful in design. Not as many ring tones as I wooulld have liked, but a beauty. It does take asome extra time to get used to the Blackberry OS, but nothing beyond reasonble.",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Thumbs up",
      "text": "Nothing less nothing more just what I need and expected. Phone was in great condition even though it was used.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan Escamilla",
      "helpful_votes": 0,
      "publication_date": 20150512
    },
    {
      "title": "wrong item shipped",
      "text": "I ordered this item 3 times, and received the wrong item all 3 times. None of the items were \"SPRINT\" phones, all had been assigned to different carriers than Sprint. Two items were purchased from \"trustedtarri\" and one from \"tablet distributors\". Refunds were given without fuss on all three items, but I never got the phone I wanted.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 4,
      "publication_date": 20140409
    },
    {
      "title": "Not what it seems",
      "text": "well this is a really great phone, but if your trying to get this phone to another company other than sprint, its useless!! :/ this phone you can't unlock from sprint!! Don't recommend it unless you activate it w/sprint which is really expensive!! :/",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20120719
    },
    {
      "title": "Blackberry 9670",
      "text": "Very pleased with the product. It was in quality shape..I was not expecting the phone to look so new. I will definitely purchase from you again",
      "rating": 4.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20130215
    },
    {
      "title": "Couldn't be activated by Sprint",
      "text": "I like this phone, had it for few years, Phone itself is great, but what it is good for If it doesn't work with any cell phone service company?!",
      "rating": 1.0,
      "verified": true,
      "author": "Yeah",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "SPC PASSWORD",
      "text": "This is a very good phone, does alot of helpfull stuff when you are on the go. but it not unlocked, please tell me the password, thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "jack zhang",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Sprint Blackberry 9670",
      "text": "I purchased two of these phone and both myself and my husband like the product....easy to use and work with.",
      "rating": 4.0,
      "verified": true,
      "author": "DONNA ENSLEY",
      "helpful_votes": 0,
      "publication_date": 20130116
    },
    {
      "title": "Very disappointing as I was unable to use this phone ...",
      "text": "Very disappointing as I was unable to use this phone in my area. I couldn't get the phone turned on at my local Sprint and other sites refused to unlock the phone!!! : (",
      "rating": 2.0,
      "verified": true,
      "author": "Marina",
      "helpful_votes": 0,
      "publication_date": 20141027
    },
    {
      "title": "Great phone",
      "text": "My mom loved it. It was as described by the seller -- very good condition. Amazing camera, smooth QWERTY keyboard, HD and bright screen although not touchscreen, and very easy & comfortable to hold/handle.",
      "rating": 5.0,
      "verified": true,
      "author": "James Norvil",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "rar",
      "text": "This phone has an invalid id number and does not woooooooooooork dont buy this prodect buy it somewhere else",
      "rating": 1.0,
      "verified": true,
      "author": "Israel",
      "helpful_votes": 2,
      "publication_date": 20141121
    },
    {
      "title": "H O R R I B L E!!!!!!!!!",
      "text": "\"I WILL NEVER ORDER ANOTHER PHONE FROM AMAZON AGAIN!!! IT'S SOLD AS A SPRINT PHONE, THE PHONE IS BRAND NEW AND SPRINT CAN NOT ACTIVATED THE PHONE!!! HOW DO YOU SELL A PHONE WITH AN INVALID EN NUMBER?? REALLY!?!?\"",
      "rating": 1.0,
      "verified": true,
      "author": "Lorie A. Lingard",
      "helpful_votes": 4,
      "publication_date": 20140307
    },
    {
      "title": "very good product",
      "text": "This is a very good phone, does alot of helpfull stuff when you are on the go. Would recomend it to any one who is in school and is using their phone constanly. Very small compact",
      "rating": 5.0,
      "verified": true,
      "author": "syble",
      "helpful_votes": 7,
      "publication_date": 20120430
    },
    {
      "title": "cant even connected....ripped off",
      "text": "All I was looking for was a replacement phone because I dont have the money to purchase a 700 dollar phone ....and well all I can say is DONT BUY THIS PHONE!! I couldn't connected with sprint they told me it was an unlocked phone...the phone is cute and all but whats the purpose if I cant even connected",
      "rating": 1.0,
      "verified": true,
      "author": "ana viera",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "bad juju",
      "text": "Had to return phone was previously flash to another phone company sprint could not activate it. Phone was in new condition head phones boxed up in proper box I did not want to accept the phone was previously owned",
      "rating": 1.0,
      "verified": true,
      "author": "trip",
      "helpful_votes": 3,
      "publication_date": 20131019
    },
    {
      "title": "Brother birthday present.",
      "text": "My brother and I are kind of old fashion. We find a phone and cars and stick with them till they no longer make them. He saw mine and wanted one because it is a flip phone no cases. He and I both love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Horseplay",
      "helpful_votes": 0,
      "publication_date": 20140516
    },
    {
      "title": "it's a fraud",
      "text": "i'm from venezuela, I bought this phone thinking it would work in my country as it is under the category of unlocked, the Notice does not specify which is cdma and now I can not return it and I feel cheated",
      "rating": 1.0,
      "verified": true,
      "author": "EMILIA SANABRIA",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "specifically for purchase from ross cellular",
      "text": "i ordered this phone and it came promptly. sprint says this phone cannot be activated. serial number does not exist in their system.",
      "rating": 1.0,
      "verified": true,
      "author": "occasionalbuyer",
      "helpful_votes": 0,
      "publication_date": 20140523
    },
    {
      "title": "CDMA. Really? Bad.",
      "text": "Hello. I want to know where in this publication you tell us that the cellphone is CDMA. Yes, i know you say is \"locked for sprint\" but, \"locked\" isn't the same to \"CDMA\" I'm from Venezuela, and this phone just arrive to my home, and guess what? I can't use this here 'cause is CDMA, and my no one telephony here accept a cellphone CDMA of another country, even if i unlocked the cellphone for whichever telephony. So, what i do now? I lost my money because of you? I want to know that. Thanks you. I feel really cheated.",
      "rating": 1.0,
      "verified": true,
      "author": "Yeny",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "One Star",
      "text": "Didnt work just like the other one I bought from Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Casi Barbera",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "NO MENTION THE TYPE OF TECHNOLOGY",
      "text": "I sent the phone is CDMA technology which I can use in my country, we buy 2 phones and I feel esatfado, because the publication does not mention that CDMA technology is. is a hoax. need to send your phone to reimburse me my money or send me two phones with GSM technology. please I got the cd accessories, headphones",
      "rating": 1.0,
      "verified": true,
      "author": "Daniela VENEZUELA",
      "helpful_votes": 3,
      "publication_date": 20130425
    },
    {
      "title": "One Star",
      "text": "Yes love it but husband has big finger lol but not phones fault",
      "rating": 1.0,
      "verified": true,
      "author": "Rita Schwartz",
      "helpful_votes": 0,
      "publication_date": 20141002
    },
    {
      "title": "CDMA description required",
      "text": "Please let me know if I can get my money back or change the phone by one of GSM technology, in my country and non technology is used and it would be very bad to lose my money because I can not do anything with this phone, I like it for their characteristics are very good but does not work in my country, please i need a solution. thanks",
      "rating": 2.0,
      "verified": true,
      "author": "N. Suarez",
      "helpful_votes": 0,
      "publication_date": 20130808
    },
    {
      "title": "BAD",
      "text": "It was stolen and I couldnt use it. They tricked me so bad that I couldnt use the phone and I had to send it back",
      "rating": 1.0,
      "verified": true,
      "author": "freda",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Better than I thought it'd be!",
      "text": "Being my first blackberry, I wasn't sure what to expect. But it was easy enough to activate, and in better shape than I had originally anticipated. I definitely recommend this Product!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Cochrane",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Totally loved it.",
      "text": "This phone just suits the name STYLE. Sleek and sophisticated. Totally loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Mom",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Decent",
      "text": "It's a more banged up than we thought, but it seems to work fine. All in all satisfied with the purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Dmitry",
      "helpful_votes": 3,
      "publication_date": 20131018
    },
    {
      "title": "good",
      "text": "phone came on time and was what i wanted would order again thank you ity worked good for what i needed it for",
      "rating": 4.0,
      "verified": true,
      "author": "dan trost",
      "helpful_votes": 4,
      "publication_date": 20140226
    },
    {
      "title": "Amazing product.",
      "text": "This product was what I expect to have. I do really recommend it, because it have everything anyone need to have.",
      "rating": 5.0,
      "verified": true,
      "author": "josehp",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "nice phone,false ad",
      "text": "nice phone love it. problem is itss not whats described , it only has the phone and a charger , no mem card or other stuff,false advertising",
      "rating": 3.0,
      "verified": true,
      "author": "ramiro",
      "helpful_votes": 0,
      "publication_date": 20120908
    },
    {
      "title": "great",
      "text": "excellent product, I commend you for your service. will recommend to my friends and family. next purchase will be provided to your store.",
      "rating": 5.0,
      "verified": true,
      "author": "Enrique Weddle",
      "helpful_votes": 0,
      "publication_date": 20130112
    },
    {
      "title": "Great phone",
      "text": "A great blackberry phone. Good operating system. Love the design. Lots of apps available. Easy to customize to make it your own.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Irving",
      "helpful_votes": 0,
      "publication_date": 20140626
    },
    {
      "title": "I TOOK THIS TO HAVE IT DOWNLOADED AND IT COULDN'T ...",
      "text": "I TOOK THIS TO HAVE IT DOWNLOADED AND IT COULDN'T BE DONE BECAUSE IT WASN'T A REGISTERED SERIAL NUMBER ON IT .I TOOK IT TO SPRINT AND THEY TRIED BUT EVEN THOUGH IT SAYS IT WAS A SPRINT PHONE IT DIDN'T HAVE THE RIGHT SERIAL NUMBER .SO I HAVE A NEW PHONE I CAN'T USE",
      "rating": 1.0,
      "verified": true,
      "author": "sally",
      "helpful_votes": 0,
      "publication_date": 20141022
    },
    {
      "title": "terrible",
      "text": "this phone would not work was previously a prepaid phone, sprint couldn't get it to work. terrible phone. and to sell something that you won't work is not fair to the public.",
      "rating": 1.0,
      "verified": true,
      "author": "MZ DIVA",
      "helpful_votes": 2,
      "publication_date": 20140303
    },
    {
      "title": "Sprint Blackberry Style 9670",
      "text": "Clam shell design helps keep the screen safe. Updates to current OS and works great. Wish I could have bought more.",
      "rating": 5.0,
      "verified": true,
      "author": "Forever at sea",
      "helpful_votes": 3,
      "publication_date": 20120428
    },
    {
      "title": "Did not work with Sprint",
      "text": "When I called Sprint to activate service I was told that the phone could not be activated on their network. I had read similar reviews but thought I would try my luck... Fail. (Purchased from BAERPAWZ). No problem with the return/refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Elledb",
      "helpful_votes": 0,
      "publication_date": 20140614
    },
    {
      "title": "Everthing was fine but camrea does not work only reason i gave ...",
      "text": "Everthing was fine but camrea does not work only reason i gave it a three the service was great but product was not sorry guys",
      "rating": 3.0,
      "verified": true,
      "author": "charris",
      "helpful_votes": 0,
      "publication_date": 20150425
    },
    {
      "title": "The product is not what I expected, I thought ...",
      "text": "The product is not what I expected, I thought it was GSM and CDMA turns out that is, the information poublicada not say that type of technology or Connect using the apparatus, reasoned that it was late to me by problems at customs, I could not contact the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Rilex241",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Disappointed. It did not work en Venezuela",
      "text": "Disappointed . It did not work en Venezuela, not chip , I could not sell then . :/ I lost my dollars that cost enough to get them here :(",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Extremely please!",
      "text": "I am happy with my purchase. I'm one of those people trying to hold on to the Blackberry as long as I can. I received it much sooner than expected. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "JONEZIE",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "One Star",
      "text": "Product could not be used numbers inside was not the numbers for the phone",
      "rating": 1.0,
      "verified": true,
      "author": "naikia remy",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "Five Stars",
      "text": "Activated it with no problems at all. Received in very timely fashion also",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Mancini",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "One Star",
      "text": "it stopped working about the second week that we got it",
      "rating": 1.0,
      "verified": true,
      "author": "aurora nunez",
      "helpful_votes": 0,
      "publication_date": 20140725
    }
  ],
  "product_meta": {
    "title": "Blackberry Style 9670 Smartphone - Sprint",
    "description": "Blackberry Style 9670 Smartphone - Sprint",
    "rating": 3.6,
    "feature_bullets": [
      "3G-enabled BlackBerry flip phone in purple with dual displays and full QWERTY keyboard; runs BlackBerry 6 OS",
      "3G speeds via Sprint Mobile Broadband Network; Sprint TV enabled; GPS turn-by-turn directions via Sprint Navigation",
      "Wireless-N Wi-Fi; 5-megapixel camera/camcorder; Bluetooth stereo music; microSD memory expansion; HTML web browser",
      "Up to 4.5 hours of talk time, up to 250 hours (10.5 days) of standby time; released in November, 2010"
    ],
    "specifications": {
      "Package Dimensions": "5.6 x 3.9 x 2.6 inches",
      "Item Weight": "3.2 ounces",
      "ASIN": "B0057GL15K",
      "Item model number": "9670",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.6 out of 5 stars88 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#320,978 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Blackberry",
      "Wireless communication technologies": "Bluetooth, Wi-Fi",
      "Connectivity technologies": "Bluetooth, Wi-Fi",
      "Other display features": "Wireless",
      "Device interface - primary": "Keyboard",
      "Form Factor": "Flip",
      "Colour": "Black",
      "Department": "Cellular Phones",
      "Manufacturer": "BlackBerry",
      "Date First Available": "June 22, 2011"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": 499.99
  }
}