{
  "website_summaries": [
    {
      "verdict": "This is a high-end headset that gives users the freedom to travel about their office as they talk on the phone via the impressive range.",
      "pros": [
        "Easy to install software and begin using this device",
        "Lightweight design makes it comfortable to wear, even for long periods of time",
        "Has impressive range, making it easy to talk on the phone even if one is away from their desk",
        "Has long battery life"
      ],
      "cons": [
        "Add-on is required to be able to pick up call directly from headset"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "ONLY works with a corded handset!!",
      "text": "I don't know how this has so many positive reviews. You can't use it with a cordless phone. I haven't had a corded phone in so many years I don't even know what size the handset plug jack is - but apparently it's about 2/3rds the size of a standard phone jack - note the size difference in the plug on the left in my hand (came with this phone), versus the right (standard phone plug). The only way to attach this phone to your existing phone is using the little cord pictured and then through the handset (see diagram). Be forewarned.",
      "rating": 1.0,
      "verified": true,
      "author": "Gail H.",
      "helpful_votes": 15,
      "publication_date": 20190713
    },
    {
      "title": "Excellent headset with one annoying exception....",
      "text": "Everything works great, fine headset and I've worked with many over the years...but one strange annoying quality about this one is that I keep this mounted on the base when I'm not using, and it's particularly difficult to seat this in the base, takes about 30 seconds or more to return the headset to the base. The fit of the earpiece on the headset strangely doesn't conform with the shape of the base charging rest unless it's angled just right. With future designs, the manufacturer should adjust the design so the headset quickly reseats in the base for charging. Otherwise, it's a great unit!",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Goldman",
      "helpful_votes": 2,
      "publication_date": 20200609
    },
    {
      "title": "Amazing head set",
      "text": "I love this head set!. The only problem is that you can't pick up the call with a head set but other than that the voice is very clear and the range this thing has is beautiful. You can use it all over the house with out losing quality, even outside of the house. Gentle on the ear.",
      "rating": 5.0,
      "verified": true,
      "author": "julio Caisaguano",
      "helpful_votes": 11,
      "publication_date": 20170928
    },
    {
      "title": "very powerful",
      "text": "This headset is amazing! I can walk all over my house and outside to take out the trash and you still have strong connection. My home office is in my basement and I can go all the way up to my 2nd floor. Definitely gives me the freedom I want from working at home. The headset lasts longer than 9 hrs",
      "rating": 5.0,
      "verified": true,
      "author": "channa brown",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Exceeded  my expectations.",
      "text": "Best investment I have ever made. I must admit I thought it was a little pricey at first, but I caved a bought it, and I'm glad I did. Having my hands free at work has allowed me to almost triple my productivity. The bottoms are easy to use and manipulate. The sound quality is better than the actual phone and I have even gone to different floors with the ear peace on and continued the conversions while working on different tasks without the call dropping. The only thing that would make this better is if I could dial from it as well, but otherwise this is a great set for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan C. Cardona",
      "helpful_votes": 3,
      "publication_date": 20150605
    },
    {
      "title": "Good quality but heavy difficult to mute",
      "text": "The product wins with crystal clear audio and great battery life. It is heavy (battery in back) but still comfortable to wear. My biggest complaint is the mute button which doesn't exist. Instead, you must press one of the volume buttons for 1/5 seconds. I don't remember which because it is such a pain to mute I gave up on it. Thankfully, I can mute from my app.",
      "rating": 3.0,
      "verified": true,
      "author": "Andria E. DeVoe",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Really nice headset but was unable to get to work with ...",
      "text": "Really nice headset but was unable to get to work with my verizon fios phone line. No matter what I tried, I could hear the other individual, but they could not hear me when I was testing out the product. No matter what settings, what lines,, tried differnt phone jacks etc. I eventually had to send it back. I would have loved it to work, as it is a very nicely designed headset, and if it would work for your system, this would be a fabulous piece to have to your office!!",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 5,
      "publication_date": 20160226
    },
    {
      "title": "Great replacement for 9 year old heaset",
      "text": "I needed to replace a 9 year old Plantronics headset that was only lasting about 20-30 minutes call time - probably an aging battery. I chose this model because the reviews looked great and it was the closest to my old unit. I love it! It is clear, fits well on my head and ear (better than the old version), and call quality seems good. Don't forget to adjust the speaker volume - I did a test with my husband before using it for work so I'd get the best outside sound volume. It was very easy to set up. I hope it lasts as long as my last one - it seems like a quality unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Works greats!",
      "text": "This product works great. I am on the phone 8 hours a day. The sound canceling feature works so well that people think the call ended because it works so well. They are comfortable. The battery last 8 hours talk time without needing to be recharged.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa M",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "another quality headset",
      "text": "This replaces my Plantronics CS351N which I had used so much that I wore the earpiece to shreds and would walk around all day with black flecks on my ear. The new unit is certainly as good as my old one -- I like the new LED's at the base of the charge stand, and it no longer beeps in your ear when you're on mute. Range seems better than my old unit and I like the mic, speaker, and channel adjustments on the underside of the charger. No complaints here.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Total Junk but Great Customer Service by Plantronics",
      "text": "Total junk. After a year the microphone no longer works and there is a 'hum' in the line when using that can't be resolved. Part of the problem is that it's impossible to change the frequency used -- the knobs to do that on the bottom of the base station broke off in the first week. Again, very disappointing especially at this price point. However, spoke with Plantronics directly and they are arranging a replacement under warranty. Pretty pleased with their customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Pete Larsen",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "NEED TO BUY THE LIFTER IN ADDITION!",
      "text": "This product is a game-changer for busy office staff! I am so much more efficient. Note that it does not have the capability of answering the phone with the push of the button, you have to lift the receiver and push the button on your headset, which is a pain in the butt! You have to purchase the HL10 Handset lifter, it is around $20, but so worth it to get the full functionality of the headset!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel L",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "What a great product. Not sure how I ever survived picking ...",
      "text": "What a great product. Not sure how I ever survived picking up the phone and using one hand. 100% more efficient and now mobile. Walking/standing and talking feels amazing. I have a yealink phone and need to buy an adapter to make it work (so I don't have to pick up the phone to answer each call) once I get that it will be amazing. Seriously this product changed my office life and less fatigued. Not sure how I went all these years 10+ without it. Just looks a tad funny but who cares.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Owl",
      "helpful_votes": 2,
      "publication_date": 20170425
    },
    {
      "title": "expensive yes, but always reliable quality",
      "text": "We have tried out cheaper alternatives to the Plantronics headsets, but they never hold up. Our office uses a variety of Plantronics headsets for staff across various departments, and all have proven in the long run to be worth the price premium.",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Needs lifter to get rid of background noise",
      "text": "Used alone, there was a very distracting background him and click. When I added the handpiece lifter to the lot, that went away and sounds very clear. I no longer have a permanent crick in my left shoulder and neck.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Really works well for our workplace which is  very fast-paced",
      "text": "Works great, only thing is sometimes a little difficulty quickly putting back on charger stand making good contact. But not a big deal, we have a VERY fast pace at my work, over 12 hours nearly non-stop back and forth, so we really give it a workout! I have to move mike close to my mouth or people say I'm talking too softly, but easily fixed by moving it closer. Sound quality is very good otherwise. Works very well in our super fastpaced work place!",
      "rating": 4.0,
      "verified": true,
      "author": "Pythagorus",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Absolutely LOVE this product!",
      "text": "I bought this for my sister who runs an office out of her home. I looked into it as I work in a call center and our supervisors use these to walk around and monitor our calls. This product provides great background noise removal and great audio quality. My sister is very happy with this product and I am highly considering purchasing one for myself at the call center in which I work. Truly love and recommend this product! Be advised that you will need either an EHS cable or a handset lifter to be able to answer calls away from your desk. I purchased this with the Plantronics HL10 lifter. Great combination of products.",
      "rating": 5.0,
      "verified": true,
      "author": "Mahikol Torres",
      "helpful_votes": 2,
      "publication_date": 20150120
    },
    {
      "title": "Works good but wish I could make the pitch higher.",
      "text": "My AT&T crapped out so I thought I'd try Plantronics. They are very well made, my only complaint is that the tone tends to be on the low side and I prefer a higher pitch like the AT&T ones have. It's just the way I hear things. Most of our callers are male so their voice tone is low already and with the added tone sometimes it can be a bit difficult for me to understand. Nothing wrong with the unit, it's just my ears but I thought I would mention.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Nicholas",
      "helpful_votes": 0,
      "publication_date": 20170225
    },
    {
      "title": "Simply The Best.",
      "text": "Love love love PLANTRONICS!!!!! I tried Java, and the Polycom recommended brand for my Polycom phone. Plantronics simply the best. I have used their headsets for 20 years. Honestly I cannot find anything better My husband works in tech support industry and also uses Plantronics.",
      "rating": 5.0,
      "verified": true,
      "author": "App1emom",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "It works, Its comfortable and it is easy",
      "text": "I have purchased at least 5 Platonics headsets but I purchased them from a dealer. They were uncomfortable and stopped working after about 3 to 6 months of use. So I purchased this one from Amazon. I had a problem getting the headset, but Amazon fixed the problem and shipped it overnight for free. The headset was easy to set up, I have Polycom phones, and it words really well. I purchased a headset with a cushion for my ear this time and I am really glad I did. I can wear this headset up to 10 hours a day and this one has been comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith L. Knapp",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Doesn’t Hold A Charge!!",
      "text": "Doesn’t hold a charge! I can’t get through a one hour phone call without the charge running out. I wouldn’t recommend!",
      "rating": 1.0,
      "verified": true,
      "author": "Patty",
      "helpful_votes": 2,
      "publication_date": 20191229
    },
    {
      "title": "Works great!!",
      "text": "Using for my home office. Works great, sound quality is excellent. Easy to install",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Eaton",
      "helpful_votes": 2,
      "publication_date": 20190110
    },
    {
      "title": "Charge base no longer connect to headset-- no charge = no use!",
      "text": "I almost wrote a very nice review of this product as soon as I bought it. It was fantastic and I loved the quality and sound. This was all UNTIL the charger no longer works. I would consider myself to be pretty gentle with products and I've had the headset less than one year. When I put the headset on the charger base it does not connect so it hasn't charged in a few weeks. I've tried everything. So for a little under $200.00 I got a headset that no longer works in less than one year. Pretty disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "C. Hall",
      "helpful_votes": 3,
      "publication_date": 20160829
    },
    {
      "title": "I'm on the phone from 8am until 5pm daily and it lasts all day and is much better than the old wired headset",
      "text": "I got this for work as the wired headset was driving me nuts. I'm on the phone from 8am until 5pm daily and it lasts all day and is much better than the old wired headset. I prefer the single ear headset and it does a great job. I can walk pretty far from the base and still have reception as well. Pretty fun to be able to go to the break room and get water while on the phone with a client.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Top quality sturdy headset.",
      "text": "We had some broken headsets around our office, mostly Avaya brand. They sounded crackly on our conference calls, and were wearing out quickly. They get heavily used here. I wanted something that will last long and sound clear. I bought a couple of these 6 months ago. They sound very clear, and cannot tell if you are on a headset. Come with the great charging dock. Yep, would buy again and recommend if you need something strong and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "M. White",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Plantronics is the best!",
      "text": "This is the standard headset that we buy all of our employees. They always work right out of the box and we've never had one die. Great product and HIGHLY recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad J",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Would fight for mine!",
      "text": "Fit well arrived in a timely manner. No echo, or feed back. I can hear the other perfectly. Frees my hands to type notes while talking. \"Hand set scrunch\" pain has almost cleared up in my neck and shoulder. Worth every penny, cheaper than a chronic pain specialist!!! Every person who is on a phone all day long needs one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160905
    },
    {
      "title": "Nice Headset",
      "text": "This is a pretty good headset. It is super easy to set up and use. I almost love it, just that sometimes the sound is not as clear as I would like compared to corded but that is the trade off for cordless. I also own the Sennheiser Office Runner and I like this headset better.",
      "rating": 4.0,
      "verified": true,
      "author": "LindaWyatt",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "comfortable, range accurate",
      "text": "Per my CSR - he loves it - Light, comfortable, range accurate... nothing but a good device for its intended purpose. Highly recommend - for Product performance and sound quality. You get for what you pay ... it does have a reasonable price point for those serious about the wireless headsets Jose S - Tampa Fl",
      "rating": 5.0,
      "verified": true,
      "author": "Jose S.",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "poor quality",
      "text": "I have purchased 3 of these units for my office. Incoming callers state they cannot hear us so we have to hold the mouth piece close which defeats the purpose of being hands free.",
      "rating": 2.0,
      "verified": true,
      "author": "Aneta Schuenemeyer",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "European power connector for the US?",
      "text": "Product came with a European power connector even tho I shipped it to the US. I'm not seeing anything on the site about how to select which option. Also I've purchased a couple of these in the past and this is the first one that came that way. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Gov IT Guy",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great to be able to answer and talk on phone ...",
      "text": "Tech. was very helpful over the phone with my questions. Great to be able to answer and talk on phone while attending to something else at same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce",
      "helpful_votes": 2,
      "publication_date": 20170304
    },
    {
      "title": "Will not work with standard laptop",
      "text": "Maybe I misread, but only support Ethernet connection. Can not connect with USB. I had to return the set I ordered.",
      "rating": 3.0,
      "verified": true,
      "author": "John L. Rigg",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Best Headset! Thinking about buying this? DONT HIT ADD TO CART. Best Choice!",
      "text": "Great Great Great Product. Decided to buy a less expensive name before those it came not working returned it for this Plantronic. Why did I even bother buying anything other than this brand name. They were the first in the vertical and still definitely the best. Love this headset, crisp, never dies and on it for 8 hours without charging only at night. Can even walk out of my office and half way across the street before it loses its signal. Great Product and $$$",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Luchen",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Worth paying the extra money for a good quality headset",
      "text": "I have bought over 15 of these for my work over the last 16 months and we just love them. They have great sound quality and the charger is easy to slip it into. Highly recommend it over any other headset. Worth paying the extra money.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Wilson-Rivera",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "these are the best I have found",
      "text": "A bit pricey, but if you need a phone-interface headset, these are the best I have found. I cannot be used to pick up a call, and it needs to interface with a convention (as opposed to wireless) phone - so it has limitations which is why I gave it the 4. But it is comfortable, and clear as can be on the auditory.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 2,
      "publication_date": 20160316
    },
    {
      "title": "its still working great. i remember the shipping was on time and ...",
      "text": "i bought this headset over a year ago. its still working great. i remember the shipping was on time and so far i have no complaints with this product",
      "rating": 5.0,
      "verified": true,
      "author": "Aren Brown",
      "helpful_votes": 2,
      "publication_date": 20170227
    },
    {
      "title": "I ordered three of these for our office and two ...",
      "text": "I ordered three of these for our office and two have been working well. With the other one we were having difficulty with the sound cutting out and the person on the other end could hear us, but we could not hear them. We determined that there is a switch on the bottom of the holder which seemed to have moved with use which was muting the sound from the person on the other end. Since we discovered that this was the problem with that headset and have kept an eye out for the switch moving, everything has been going well.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Horrible feedback when answering calls",
      "text": "When the headset worked properly, the sound quality was great and people on the other end of the phone said it was easy to understand me. Almost every time I spoke, there was horrible feedback in the ear piece. I \"paired\" the headset multiple times hoping to fix the problem, but it was still awful. Luckily, my customers on the other end didn't hear the noise.",
      "rating": 2.0,
      "verified": true,
      "author": "smile9817",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "After consult with Plantronics Support I purchase a new recommended telephone. The product still didn't work correctly",
      "text": "The product did not work correctly on my home telephone. After consult with Plantronics Support I purchase a new recommended telephone. The product still didn't work correctly. Plantronics then said that it was not designed for home telephones. I returned the product to Amazon who very quickly credited my account. I am very pleased with Amazon's support.",
      "rating": 2.0,
      "verified": true,
      "author": "Gregory Nealand",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Fits comfortable",
      "text": "It fits comfortably on my head and easy to wear. I love that now I'm hands free so that I can multi-task during phone call.",
      "rating": 4.0,
      "verified": true,
      "author": "Genie",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Very happy",
      "text": "I bought these for my assistant and she loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "docfeelgood",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "the quality of the sound.",
      "text": "Great product, has clear sound. Used at our order desk.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Aquino",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "It must have been love, but its over now.",
      "text": "This was a great headset until it no longer connected to my ShorTel IP480G. I almost had my company convinced wireless headsets were the way to go, and we almost placed an order for our customer service department. Thankfully we did not proceed once mine began to fail. We found a Jabra model that we will be going with.",
      "rating": 2.0,
      "verified": true,
      "author": "Sean ",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Works as I hoped to give me room to move away from my speakers at my desk.",
      "text": "Really like that I can get up and move around my cubicle without having to take it off since it is wireless. Comes with multiple tips to connect with. Have had it several months and have had no problems.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Creech",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Freedom!!!",
      "text": "Sweet wireless freedom! I use this for work, and it is so great to be able to walk around to get the blood circulating and not have to worry about missing calls. The wireless feature also really cleans up my workspace. Easy to set up and easy to use. I have no regrets, and I doubt you will either",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Great value!",
      "text": "Extremely high quality headset and looks sharp on the desk. Audio quality is outstanding. A bit expensive, but it gives you the flexibility and freedom to move around while on the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Deedub",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "battery life slightly short, however the capacity for sound is high",
      "text": "would have wanted slightly strong batter life, but the ability to generate and isolate sound is strong with this model!",
      "rating": 4.0,
      "verified": true,
      "author": "Deconstructivism Architecture",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Should have bought this years ago",
      "text": "Works great -- allows me to walk around while I am talking. I can even answer the phone if I am not sitting at my desk. I highly recommend for anyone on the phone alot. If I am on a long call, it will make my ear hot. The headset feels ok when you are wearing it, but after you take it off from a long call, you can feel it was pressing on your head a little too hard. These are both small things to me and I would not trade this in at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Cory C",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Poor quality.",
      "text": "I'm always receiving complaints that I can not be heard and have to practically scream.",
      "rating": 3.0,
      "verified": true,
      "author": "Angielys",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Wasted a lot of time trying to figure it out ...",
      "text": "This is Not compatible with Panasonic home phones. Wasted a lot of time trying to figure it out before calling Plantronics and being told. By that time it was too late to return it and this company would not help.me.",
      "rating": 1.0,
      "verified": true,
      "author": "hyplaurie",
      "helpful_votes": 3,
      "publication_date": 20170612
    },
    {
      "title": "Great sound, mic works and it's saving alot of ...",
      "text": "This allows me to move freely around the office while talking. Great sound, mic works and it's saving alot of stress in my neck and shoulders. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Really like mine. Occasionally people mention they have trouble hearing ...",
      "text": "Really like mine. Occasionally people mention they have trouble hearing me, but not often. I have a polycom voip desk phone - I have to lift the receiver manually to allow it to answer. Make sure you pick up the auto receiver lifter at the same time if you really want a hands free experience!",
      "rating": 4.0,
      "verified": true,
      "author": "Tirzah Vaughn",
      "helpful_votes": 0,
      "publication_date": 20160528
    },
    {
      "title": "Very Poor Quality",
      "text": "The Ear cushion was hard and loose. Headband super cheap. The box was full of micro sawdust. all over the components. You can not answer and end calls from the headset without an additional purchase. It was a very disappointing purchase, I do not suggest it.",
      "rating": 1.0,
      "verified": true,
      "author": "Bay A.",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Great range! Comfortable",
      "text": "Great range! Comfortable. Looks good on my desk and was easy to install. Battery life has not been a problem",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Sanchez",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "This may be the greatest wireless office headset EVER",
      "text": "This may be the greatest wireless office headset EVER! The distance that it goes from the base is incredible. Plantronics is a household name and they live up to the expectations. We are very pleased with this purchase and will be buying more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Dusty DeVaughn",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "The employees love it",
      "text": "This was easy to hook up and use. The employees in the service department love it. This is the 2nd one we purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "I hate it the fact that people could not hear me",
      "text": "I almost sent it back since I did not bother to read the instructions. I hate it the fact that people could not hear me, but a simple twist of the the buttons adjust it just about perfect. Heavy duty construction. Update! 2-22-17 this thing is a beast. I'm super rough with it and its working perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Works great but wish it was advertised with the adapter",
      "text": "Just got the headset today. Works great but wish it was advertised with the adapter. Now I have to make another purchase and wait for it before I can start using the products. Please advertise that the headset might need to have an adapter if you have a certain phone. Maybe have a list of phones that require the cable.",
      "rating": 3.0,
      "verified": true,
      "author": "Gorman Tax",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "... work from home and the sound quality is the best out of 5 different sets I have tried",
      "text": "I do customer service work from home and the sound quality is the best out of 5 different sets I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen d",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great product. Easy to hook up and does exactly ...",
      "text": "Great product. Easy to hook up and does exactly what the posting indicates.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Kissell",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "a great purchase!",
      "text": "I purchased these for my husband's office and personnel. It frees everyone up to move around while still carrying on the necessary conversations. The only negative I'd report is that some callers have a little trouble hearing with the volume at maximum. All in all, though, a great purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy in TN",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Great sound quality and fantastic wireless range.",
      "text": "Have used this headset for months now. It has great sound quality and fantastic wireless range. I am a pacer and will talk walks during long calls and the distance of the wireless connectivity has been a blessing to me. Using this on a Polycom VXX VOIP device.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Buckles",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "they use it every day and they love it. It makes their job easier when answering ...",
      "text": "This product is in use in my husband's office by his secretaries, they use it every day and they love it. It makes their job easier when answering the phones. They are really easy to use and the reception is really good!",
      "rating": 5.0,
      "verified": true,
      "author": "cora",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Ordered 11 of these for my office 3 months ago ...",
      "text": "Ordered 11 of these for my office 3 months ago. Almost half are experiencing connectivity issues forcing staff to quickly pick up the phone in hopes the customer doesn't hang up. Attempting to return all 11 now...",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew P.",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "excellent battery life",
      "text": "Use it everyday at work, excellent battery life, excellent range. If you have to be on the phone for substantial lengths of time, get this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Homer Jay",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Works well as advertised",
      "text": "This along with the Plantronics 38439-11 EHS Cable APP-51 works as advertised and I would buy it again. This is being used in an office atmosphere and stays on the head all the time. It is being used to communicate over the phone and also being able to speak with workers and pay attention to what is going on in the office.",
      "rating": 5.0,
      "verified": true,
      "author": "baraant",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "I bought this to be used at work. It ...",
      "text": "I bought this to be used at work. It works as described. However, I find that the volume tends to be a little soft and the battery fades quickly. Perhaps I'm being picky, but this is one of the more expensive products out there.",
      "rating": 4.0,
      "verified": true,
      "author": "Mirandandy",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Well, it works most of the time...",
      "text": "So, it was great when it works. Sometimes, it will have really choppy signal and we had to pick up the landline's handset and then hang up the wireless headset; and then the conversation was no problem. But when it works, as most of the time, it's fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Chi Ho",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Our staff love these. They work wonderfully with the Nortel Networks ...",
      "text": "Our staff love these. They work wonderfully with the Nortel Networks phones that we have. We use them with the Plantronics headset lift.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina G.",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Works Great",
      "text": "We have owned several of these and they work well.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Clack",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "sometimes it gets a really annoying echo.",
      "text": "One of the less expensive headsets... sometimes it gets a really annoying echo..... no clue why but most of the time it works great",
      "rating": 4.0,
      "verified": true,
      "author": "Kathleen E Tyler",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Two Stars",
      "text": "Uncomfortable, and not user friendly instructions/setup, so I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Worth the money! Works great!",
      "text": "Had to get the settings correct on the phone but we can walk anywhere around the office and talk. No wires makes calls much nicer.",
      "rating": 5.0,
      "verified": true,
      "author": "Fast & Sexy",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Great customer service support",
      "text": "Great customer service support. I had a little trouble getting it going so I called the 1 800 number and the representative walked me through everything. My student who had to listen to me for 8 hours appreciated the clarity of the presentation over using the web x over the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette K. Johnson",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "Saving my neck and the sound is clear on both ...",
      "text": "Saving my neck and the sound is clear on both ends. My only regret is not purchasing the phone lifter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Got this for the office when we're very busy to ...",
      "text": "Got this for the office when we're very busy to answer the phone hands free. Works extremely well and I can answer it wherever I'm at in the office",
      "rating": 5.0,
      "verified": true,
      "author": "Stef Zearing",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "nice",
      "text": "It came quick and its more comfortable on my ear then my $400 ear piece I bought 5 years ago and it has really good distance",
      "rating": 5.0,
      "verified": true,
      "author": "Dianna Frazier",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Plantronics makes great equipment.",
      "text": "This is just what I was looking for. A cordless headset with a bigger range and a long battery life. Plantronics makes great equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne's World",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Love this headset",
      "text": "Love this headset. The range is awesome, the clarity and the noise reduction has beet everything I've used so far. I have a 10 person call center and the client on the other end can't hear anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "I really like this headset",
      "text": "I really like this headset, it is super comfortable all day. A few people have complained that they cant hear me so I worry about the microphone. I was disappointed to find out I had to buy an additional handset lifter after I bought this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Hillary H.",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "only problem is the you have to ensure that head ...",
      "text": "only problem is the you have to ensure that head set sit carefully into the slot. if not sitting correctly, the headset does not get charged",
      "rating": 3.0,
      "verified": true,
      "author": "cantcu",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "... 2 of these for my office staff they absolutely love it. I would recommend getting the receiver",
      "text": "I bought 2 of these for my office staff they absolutely love it. I would recommend getting the receiver lifter",
      "rating": 5.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "These have been such a blessing to our office! ...",
      "text": "These have been such a blessing to our office!! They allow the receptionist to get up and move a little instead of being right next to the phone!",
      "rating": 5.0,
      "verified": true,
      "author": "Hilary Nicholson",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Cord to Wireless",
      "text": "Been using a corded headset for years and was a little leery of wireless sound quality, but this did not disappoint. It did very clear and I have asked everyone how I sound and all state loud and clear. There is an adjustment on the bottom for voice and speaker volume. When you get it set up they have a number to call to do sound and voice level check, so you can adjust to your liking. Still waiting on my hook switch (APP-51), because I think the headset lifter looks clunky. I have the Polycom 335 and had to experiment with the set up (used headset instead of through handset). All in all, great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie Ehrlich",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Works great. You can hear the caller and also what ...",
      "text": "Works great. You can hear the caller and also what is going on around you since you have one ear free.",
      "rating": 5.0,
      "verified": true,
      "author": "Ladyhawk",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Seems to work well. I have had a few ...",
      "text": "Seems to work well. I have had a few situations where the signal cut out. Not sure if it was on my end or on the other end of the line.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Folger",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "I spend a lot time on the phone and I ...",
      "text": "I spend a lot time on the phone and I should have bought these a long time ago. They seem to have endless range and the sound quality is exceptional.",
      "rating": 5.0,
      "verified": true,
      "author": "DIYer",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Not what was pictures",
      "text": "When I ordered these the picture showed over the ear, the one I got in the box was the one that goest in the ear. Not happy at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Sky Sunner",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Five Stars",
      "text": "Works just as expected and has made my life so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Ortiz",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Great product",
      "text": "Excelent product. The battery’s life is up to par. The reception distance is very good and the audio is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Pagan",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Not happy with this product",
      "text": "Bought this product and after only 2 months the cord between the phone and headset broke. Can't find any replacements for it either. Not happy with this product. It shouldn't break like that and there should be replacements that are offered.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie F.",
      "helpful_votes": 2,
      "publication_date": 20170702
    },
    {
      "title": "It's comfortable to wear",
      "text": "I was using a wired Plantronics headset, and decided that since I spent so much time on the phone, this would allow me to move around some to grab stuff on the printer. Battery last all day. It's comfortable to wear. Range is what I expected (compared to other Dect phones I've used in the past). Would buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "ADAM FATHAUER",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Great for Office Setting",
      "text": "We purchased 5 for our office and these are the best quality and easy to set up. Quick shipping. Will buy from again.",
      "rating": 5.0,
      "verified": true,
      "author": "DNR M.",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Four Stars",
      "text": "I use this headset at work. Bought on for my phone at home",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Shaw",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Great work headset!",
      "text": "Bought this for my home office and love the sound quality. I am often told that it sounds better than the IP phone!",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis Pastre",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "This product works perfect and it is at a great cost",
      "text": "Sorry for the late review. This product works perfect and it is at a great cost. Plantronics makes a great product in fact I was forced to buy a new one because the one that I had finally gave out after about 10 years of use. I would not hesitate to recommend this product to anyone. Five stars for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161223
    },
    {
      "title": "Came broken",
      "text": "Headset was fully charged and all connections were properly made but the headset would not turn on. Packaging was also absolutely awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170510
    },
    {
      "title": "Is very good, but sometimes I get a weird feedback while ...",
      "text": "Is very good, but sometimes I get a weird feedback while in a call, but I think that has something to do with my phone and not the headset. Battery lasts a long time and because is cordless is great for office use.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "I would not buy this again. I've had the ...",
      "text": "I would not buy this again. I've had the headset for several months now and have been using it daily at work now. I constantly get feedback when talking. I've followed the instructions and changed the settings, nothing really seems to work to get rid of it.",
      "rating": 2.0,
      "verified": true,
      "author": "Julia W",
      "helpful_votes": 0,
      "publication_date": 20171010
    }
  ],
  "product_meta": {
    "title": "Plantronics CS510 - Over-the-Head monaural Wireless Headset System – DECT 6.0",
    "description": "Wireless headset system with an over-the-head, single speaker wearing style to manage desk phone communications, DECT 6.0\n\nFROM THE MANUFACTURER\n\n\n\nCommunicate clearly up to 350 feet away from your desk with the CS510 Monaural Wireless Headset from Plantronics. Designed to connect to your desk phone, the CS510 sports a sleek, lightweight design and has been comfort-tested. One-touch controls on the headset allow you to answer or end calls and adjust or mute the volume. The system also enables you to conference in up to three additional headsets for easier collaboration. The headset offers up to nine hours of talk time and is designed to be worn over-the-head.\n\n\n\n\n\n\n\nCS510 MONAURAL WIRELESS HEADSET\nAT A GLANCE:\n\n * Manage desk phone calls up to 350 feet\n * Wideband audio and noise-canceling microphone provide clearer conversations\n * Over-the-head wearing style\n * One-touch call answer/end, mute, and volume adjust for simple call management\n * Up to nine hours of battery life on one charge; adaptive power system helps conserve battery life\n * Use with Electronic Hookswitch Cable or Handset Lifter (both sold separately) to remotely answer/end desk phone calls\n\n\n\n\n\n\nComfortable, monaural design and one-touch controls on the headset allow you to answer or end calls and adjust or mute the volume. View larger.\n\n\n\n\n\nConnects to your desk phone and conferences in up to three additional headsets for easier collaboration.\nView larger.\n\n\n\nWIRELESS MULTITASKING MADE EASY\nOne-touch controls on the CS510 Wireless Headset allow you to answer or end calls and adjust or mute the volume. The system also enables you to conference in up to three additional headsets for easier collaboration. The headset comes equipped with DECT 6.0 technology that allows you to talk hands free up to 350 feet away from the base.\n\nENGINEERED FOR OUTSTANDING SOUND QUALITY\nIn addition to DECT technology, the CS510 offers wideband audio for clearer phone conversations. The headset's noise-canceling microphone filters out background noise and enhanced Digital Signal Processing (DSP) makes voices sound more clear and natural.\n\nCHARGING BASE AND ADAPTIVE POWER SYSTEM\nA sleek magnetic charging base is included with the CS510. An adaptive power system optimizes for range and talk time by automatically downshifting to low power when the headset is close to the base to save battery life.\n\nPlantronics also offers the HL10 Handset Lifter (sold separately) which can be attached to your desk/office phone to complete your cordless headset system. The HL10 lifts up and replaces the handset so you don't have to be at your desk to answer the phone or to hang up.\n\nPRODUCT AND WARRANTY INFORMATION\nThe headset weighs 72 grams and offers up to nine hours of talk time on one battery charge.\n\nThe CS510 Wireless Headset is backed by a one-year limited warranty.\n\nWHAT'S IN THE BOX\nMonaural headset, over-the-head headband, charging base, base power supply, telephone interface cable, and quick start guide.",
    "rating": 4.3,
    "feature_bullets": [
      "Gain mobility–multitask hands-free up to 350 ft",
      "One-touch call answer/end, vol +/–, and mute",
      "Noise-canceling microphone reduces background noise",
      "Advanced DECT wireless security",
      "Up to 13 hours of wireless talk time",
      "Headset system connects to office desk phones"
    ],
    "specifications": {
      "Product Dimensions": "7.1 x 6.5 x 6.5 inches",
      "Item Weight": "1 pounds",
      "ASIN": "B005HRZPY2",
      "Item model number": "PL-CS510",
      "Batteries": "1 CR123A batteries required.",
      "Customer Reviews": "4.3 out of 5 stars750 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#4,030 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "Additional Features": "Headsets",
      "Other display features": "Wireless",
      "Colour": "Black/Silver",
      "Phone Standy Time (with data)": "95 Hours",
      "Included Components": "Headset",
      "Department": "Office",
      "Manufacturer": "Plantronics",
      "Language:": "English",
      "Date First Available": "May 2, 2011"
    },
    "categories": [
      "Accessories & Supplies",
      "Headsets",
      "Electronics",
      "Telephone Accessories",
      "All Departments"
    ],
    "price": 169.97
  }
}