{
  "website_summaries": [
    {
      "verdict": "The ViewSonic PJD5533w provides a good balance between price, portability, connectivity, and image quality in a WXGA data projector.",
      "pros": [
        "Low price",
        "Decent data image quality",
        "Compact and lightweight",
        "Good lamp life",
        "3D ready",
        "3-year warranty"
      ],
      "cons": [
        "Soft audio",
        "No carrying case",
        "Rainbow effect in video"
      ],
      "aspects": {},
      "publication_date": 20130227,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent value and longevity!",
      "text": "We have owned this projector for 3 years now, and we've found it to be an outstanding value! We use it pretty much every night and still have not had to replace the bulb! We use it on our wall at about 3 feet tall and 5 feet wide, and the picture quality is good. I have also used this to blow up images for large-scale art projects where I pulled the projector way back and made the image 7-8 feet tall, and it was very helpful for that, as well. Overall, this has been a great buy for our family that I'm glad we made!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.StoneP",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Perfect!!!!!  Order and enjoy for years to come.",
      "text": "After 2 1/2 straight years of using this as an outside movie projector, I couldn't be happier. Picture and resolution is outstanding. Consistently get compliments about the quality and asked where to buy it. Use an HDMI to run from a laptop and plug 2 desktop speakers through the standard audio jack. Broadcast the movie on a 15 foot, yeah 15 foot, white blackout screen. The massive picture is practically identical to my 55\" 1080p HDTV in sharpness and quality. Going on 3 years and it still works like it's brand new!",
      "rating": 5.0,
      "verified": true,
      "author": "Folmer",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Possibly Best Purchase I've Ever Made on Amazon",
      "text": "This projector is a winner. It's incredibly clear and beautiful in very dark light, but you can still watch programming during the daytime with minimal wear on the image. I don't think I've ever given a 5 star rating to anything on Amazon before and this is getting 5 stars. I know the cheaper lower resolution ones are more alluring, but let me put your mind at ease: spend the extra hundred on this one, you will never regret it. Plays movies and games flawlessly. Just do yourself a favor and ensure you have some kind of audio kit available because the built in speakers on this suck. I'll update my posting when I get to test the 3d viewing.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaykron",
      "helpful_votes": 2,
      "publication_date": 20140201
    },
    {
      "title": "Great so far!",
      "text": "Only had this running for about an hour on a wall without a screen and it was working great. Pros: -Based off of the above setup, it was definitely a nice clear screen -Not a loud fan, when the volume is off you can hear it running -Not heavy, appears durable -Slick design -Played great at around 6pm on a summer day, I didn't even have to turn off the lights to see clearly. Not sure about clarity with a video game though. Cons: -Speaker suckkkkkkksssss, but if your getting a project it should be assumed that you have an audio setup -Less Lumens than cheaper models, but I'm just trying to think of another con",
      "rating": 4.0,
      "verified": true,
      "author": "Late To The Table (Youtube)Top Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "Unbeatable for the Price",
      "text": "I was a bit wary when I first purchased this projector, but was amazed at the quality of picture and ease of use. It is extremely quiet, and the heat discharge is minimal compared to some other projectors. I have not tried the 3D functions yet, but the HDMI is crisp and brilliant even in a room that isn't totally dark. My only complaint is the height adjustment. There is a single leg at the front of the projector which is fine, but if you have a slightly un level surface there is no way to adjust the projector without stacking carboard etc under the back corners to level the image.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric K Sigler",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "It's like my own movie theatre",
      "text": "I bought this for my room and it's currently connected to my computer. I don't really watch TV so I use this to watch Netflix, Hulu, Amazon Prime, and etc. The image quality was better than I expected and for the price, it is a really good deal. The sound very lacking so I had to purchased a sound bar but that's to be expected. My room does tend to get warm after a few hours of watching but that's also with my computer running, in a small room. In a bigger area such as a living room, the heat won't be as bad with all the open space.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "Get it.",
      "text": "Excellent purchase. I use it as the primary monitor for my desktop computer, where I play video games and watch TV. Image quality is as clear as any large screen I have ever seen, although I am not an HDTV expert. Works fine for FPS games and every other application I have come up with in the past several weeks. It is not ideal for reading things on, but it works. It does not generate as much heat or noise as I had feared it might; there is a quiet whirring (it sits directly above my head), but I do not find it distracting or bothersome.",
      "rating": 5.0,
      "verified": true,
      "author": "Ethan",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Great projector at a great price!",
      "text": "I decided to buy the ViewSonic video-projector, because it had great reviews and I saw some demo-videos on YouTube which showed it's capabilities. When I got the projector, I did a few test with it during the day and also at night. I was blown away by the quality of the image. At a throw distance of (roughly 20-25 feet) the picture was probably close to a 300-inch screen. NOTE: I don't have proper measuring tools, so I apologize in advance if my measurements aren't precisely accurate. The image was also clear and bright. I will be using this projector for movies and gaming, and family events. Hope this review helps a little. That is all.",
      "rating": 5.0,
      "verified": true,
      "author": "MattDavis76",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "After a lot of research, I bought this one and am glad of it.",
      "text": "I love it. Makes movie night so much more fun. I've got this piped into my wireless speaker system via a dedicated desktop computer that I use to play the discs or youtube vids or whatever I want to send to the projector. Good colors, good brightness. Be careful to select the right unit for your room size, or you may end up having to buy a projector screen to watch properly. My wall is too small, so I have to move the projector closer to the wall to fit the image to the space. It was my fault, I bought this unit to hang from the ceiling and project from a different location but changed my mind. Great unit.",
      "rating": 5.0,
      "verified": true,
      "author": "jack n.",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "Bright, great color, easy to set up.  Love it so far!",
      "text": "We've been using this projector in our new basement \"kids' room\" for about a month now. It works great. Plenty of brightness, great color, easy setup. We have it ceiling mounted. Only issue there was the ceiling mount we bought had the mounting holes too far apart. The ones on this projector are pretty close together. The mount really was universal; it just had a little more adjusting required. The fan is not silent, but we tune that out in a few minutes. Go to projectorcentral dot com to read about screens. We painted our wall with some good Sherwin Williams flat paint instead of buying a screen, and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Mackin",
      "helpful_votes": 0,
      "publication_date": 20131210
    },
    {
      "title": "Its the right choice",
      "text": "The ViewSonic Pjd5533w Wxga is an awesome projector, best bang for your buck. Dealing with a namebrand projector is the way to go. Images are clear and crisp from 19\" to 200\"(highest i tested). Works in dark and medium light rooms. Pros: Great color, high resolution, great price, visible in lit room, small in size, clear images... Cons: Fan is noticeable if your within a few feet. sound is not great(suggest buying external sound.) , All in all would suggest buying this projector, worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremiah S.",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "Seriously Good and affordable too.",
      "text": "This is seriously a good Projector. I had a Favi Rio HD LED projector in the past which was just a ok projector. I never thought watching a movie from a projector is gonna come close to watching it on a plasma/lcd tv. But this viewsonic is. 720 p is extremely good enough. I compared it with my friend's 1080p optoma and didn't see a difference. i have this projected on a 10 to 11 feet wall and am having the best movie experience. i have tried it in a dark room and in a room which is dimly lit and it works well in both conditions. haven't tried the 3D option. not something I was after. very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Jag",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Great projector!",
      "text": "Having bought this a while ago I believe it's time to write a review. I was in the market for a projector that would yield a good picture and would not break the bank. Can definitely say this projector did both of those. So far put in ~1150 lamp hours in and still works like a charm. The built in speakers are not the greatest, so I would recommend having some sort of external audio device to fully enjoy the projector to its fullest! Otherwise a great projector that can easily upscale to 1080 to enjoy your entertainment needs.",
      "rating": 4.0,
      "verified": true,
      "author": "A.N.",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Very good projector",
      "text": "This model has a 3 year warranty which is awesome The color is great. It is plenty bright enough I can watch it in a room under normal lighting, even sunlight. But it is still best in a darker \"theater setting\" it is like an LCD TV. Great for movies! I am using it on a 110 inch screen and the picture is fantastic. 3D works with pc and blu ray very good. Watched Men in Black III and it is cinema like 3D Very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Elwis A.",
      "helpful_votes": 0,
      "publication_date": 20130601
    },
    {
      "title": "Sooooooooooo Coooooooooool",
      "text": "I researched more than I would care to admit in searching for a projector. I finally decided on this one as the best buy for a good low end projector. Was inexpensive as projectors go, has an hdmi hookup (an absolute must for high quality image), is 3d capable, and has good resolution. We have watched blu ray movies, hdtv, regular tv, wii u games nonstop since Christmas morning and everything looks great - even on our new 120\" screen! This one is a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Platt",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Honestly way better than I thought it would be.",
      "text": "I wouldn't consider myself a quality snob, but I also wouldn't put myself in the average consumer realm. I upgraded to this projector from a 10 year old Panasonic and was extremely surprised by the quality. I saw lots of rainbows when I first got it, but after watching 20-30 hours of content on it, they no longer bother me. Would have happily paid WAY more than $400 for this projector and still been very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan K. Creates",
      "helpful_votes": 0,
      "publication_date": 20140623
    },
    {
      "title": "Nice design, functionality, although refurbished meant that i got a dead pixel in 6 mo.",
      "text": "I like this projector. the audio is crap and there'a already a dead pixel after just over a year but it's got lots of features, performs well, has good throw and keystoning, brightness, and frame rate. good projector minus the dead pixel and internal speakers (not that anyone buying a compact projector expects dolby 5.1-like sound integrated in it...)",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick Romeo",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "A carrying case would make it 5 stars.",
      "text": "This projector is great. I purchased it to use for backyard movies. It works good for this. The only downside in using it for this purpose is its brightness. If you are wanting to start your movies right as the sun is starting to set, it might not be entirely bright enough. I drop it one star due to the fact that it doesn't include a carrying case. I have saved the box that it came in and I always put it back in the box for transportation and storage.",
      "rating": 4.0,
      "verified": true,
      "author": "Thaddeusq",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "Good while it lasted",
      "text": "Used sparingly in the summer at our cottage. Two summers and about 100 hours of use, the hdmi port just stops working. General consensus appears to be, when it works it's great, but due to cheap parts and assembly, it won't be working for long.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Ashton",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Fun Times!",
      "text": "This projector really is great for the price. The picture quality is very good - better than most TVs I look at. The one downside I have realized is the limited zoom, so you have to move it back and forth to get the size right. I won't dock any stars because this is clearly documented in the specifications and, as compared to competition, is as good or better. The 720p resolution is great and the brightness is adequate. Amazon prime always delivers quickly. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "rmc",
      "helpful_votes": 0,
      "publication_date": 20140504
    },
    {
      "title": "Plugging in a decent sound bar with sub is all that is needed to have a great backyard experience starting at dusk",
      "text": "Have only used it a couple times but the picture quality is very impressive! We project on a 25x12 canvas so our picture is probably 24x11.5 and I have to look hard to tell the difference between our image and that of a theater. Of course the built in speaker is junk (to be expected). Plugging in a decent sound bar with sub is all that is needed to have a great backyard experience starting at dusk, as the picture is very difficult to see any earlier (once again, to be expected).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140920
    },
    {
      "title": "Really nice projector for the money.",
      "text": "Pretty good buy for the money. We use this in the conference room at the office, and the picture is nice and bright, even with some lights on. Zoom adjustment leaves room for improvement, as it's really hard to adjust the scale of the projected image once the projector is mounted. If the Zoom feature was better, I could give this 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "coryalex",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Best Projector for the Price",
      "text": "What are you waiting for? Why pay more ...this is the best deal for the money. My only regret is that I didn't buy this a long time ago and wasted time comparing other projectors. Can you buy better projector, yes...but not at this price. I use the my ViewSonic PJD5533W WXGA every weekend for movie night for the last 6 months and could not be happier. The picture quality is great and it is very easy to set -up...I highly recommend the this projector over the cheaper models. The ViewSonic PJD5533W projector will probably meet all of your projector requirements for many years.without breaking the bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Grier",
      "helpful_votes": 0,
      "publication_date": 20140911
    },
    {
      "title": "Not the best for the price",
      "text": "In trying to find a good projector for ~$400 for our work area, we did a lot of research. In the end, we couldn't decide between this and the Optoma DW326e ($418 at writing -  , so we purchased both. While both were pleasantly usable for the price (even though we'd been spoiled by a much more expensive home theater projector), we found the Optoma to be noticeably sharper when focused and compared side-by-side to this ViewSonic. Brightness and colors were comparable, so we went with the sharper Optoma. The Optoma also came with a free carrying case, this did not. Hope you found this helpful!",
      "rating": 3.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 7,
      "publication_date": 20140505
    },
    {
      "title": "It was great for the few years I've had it but it ...",
      "text": "It was great for the few years I've had it but it just stopped working all of a sudden and I don't know what the problem is. Like other reviewers have said, it just shuts down after a couple of minutes working fine. There is a red light saying it's over heating but the fan is still working. It'd be great to have some feedback or customer support.",
      "rating": 1.0,
      "verified": true,
      "author": "vVvvVv",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "PJD5533w first test",
      "text": "Today I tested PJD5533w hocked it to ps3 and watched Avatar in 3d side by side(sbs) mode . the setting was very easy. the quality /cost performance are really nice and the 3d was cool. for 3d I used SainSonic&reg Zodiac 904 Series 144Hz the sound not that much, but still I can live with that. Will update this review when ever I have chance.",
      "rating": 5.0,
      "verified": true,
      "author": "Urichimaru",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "I use this exclusively for my outdoor screen. I ...",
      "text": "I use this exclusively for my outdoor screen. I have had this projector for 2 years. Works well. Instructions leave a bit to be desired. Not very clear. Images are bright and clear. Has traveled well to the beach and back. I'm not very tech savvy, but meets my needs well.",
      "rating": 4.0,
      "verified": true,
      "author": "JTSievering",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Price, picture and simplicity all-in-one",
      "text": "If you are looking for an excellent, economical projector that is simple to use and has a great picture, this Viewsonic is the one. I am using it while my more advanced 3D/1080P JVC movie room projector is being fixed. I can barely tell a difference in picture quality even though the Viewsonic was one sixth the price. I use the HDMI connection for the sound and picture. The speaker in the Viewsonic is obviously not intended to supplant an external sound system. So... If you're looking for a versatile, small, reasonably priced 760P TV projector, the Viewsonic is a very good choice IMHO.",
      "rating": 5.0,
      "verified": true,
      "author": "CEW",
      "helpful_votes": 0,
      "publication_date": 20141101
    },
    {
      "title": "Great HDMI/VGA projector.",
      "text": "Great projector for using hdmi from laptop and it works well with VGA too. Play a video from laptop using hdmi, used the 1/8 output on project to use external speakers and everything worked the first time. Sound quality was as expected. Like the brighter image than other (cheaper) projectors since this will be used in a larger room (gym).",
      "rating": 5.0,
      "verified": true,
      "author": "Joe J",
      "helpful_votes": 0,
      "publication_date": 20150722
    },
    {
      "title": "Good the 4 months it lasted .. Now I'm stuck with a broken projector!",
      "text": "I ordered it March 2015 and it broke in July 2015 with no option of getting a replacement or money back. It was good while it lasted. I have it attached to my ceiling and have been well taken care of. I have watched in average 2-3 movies per week on it. Now it shows black vertical lines all over the screen. It now show those lines all the time, no matter if I have my Blu Ray, PS3 or nothing hooked up to it. I liked it while it worked .. I just wished it would have lasted longer than 4 months .. or had an option to get it replaced or fixed.",
      "rating": 1.0,
      "verified": true,
      "author": "larane",
      "helpful_votes": 0,
      "publication_date": 20150726
    },
    {
      "title": "GREAT DEAL, EXCELLENT QUALITY!!!",
      "text": "This projector is underrated. Not only does it have excellent high resolution support...but hdmi audio is actually decent through the built-in speakers...AND THIS PROJECTOR is quiet... Liked it so much, I bought 2 (TWO)!!! Excellent product, Viewsonic never fails me, been buying their product for over 10 years.",
      "rating": 5.0,
      "verified": true,
      "author": "J. NU-Clear",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Great quality, great price!",
      "text": "Roommate and I went 50/50 on this for our apartment. We have it setup for a 110\" screen. Even without a screen (we just have it on a blank wall) the picture quality is fantastic. Great for sports and entertaining guests. The only downside is weak speakers (but I can't take a star for that, I wasn't expecting it to have good stock speakers).",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Stoeckley",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "Overall amazing projector.",
      "text": "I opted for this over a TV and I don't regret that decision. It provides a HUGE crisp, bright image. Bright enough to watch even during the day with mild ambient sunlight. Occasionally gets fickle if you turn it off and back on too fast, but nothing a restart won't fix. Overall amazing projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Too early to tell",
      "text": "It's too early to tell. I've used it once besides setting it up in my computer room. The projector was plenty bright. I used it on a table and the adjustable foot barely raised the picture above the heads of the audience. The users manual on the DVD is adequate but I found it difficult to locate information without scrolling back and forth. The quick start booklet was of little help and I had to access the DVD to understand how to get the projector connected to the computer and projecting the computer input. The input auto detect function worked very well.It has a lot of features but i have only used it to project a power point presentation.",
      "rating": 3.0,
      "verified": true,
      "author": "Dennis Greer",
      "helpful_votes": 0,
      "publication_date": 20140921
    },
    {
      "title": "Great picture!",
      "text": "After a year of use the bulb is only 38% used. I love the picture quality. We have had several outdoor movie nights and started before the sun goes all the way down. Picture is really nice. We also us it inside the house and enjoy the quality of the picture. Several friends have commented on the clarity. We enjoy it!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cooper",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "It lasted 17 hours.",
      "text": "I had this 5 years but ran it 17 hours. Stored it in a nice case made for this model. After contacting ViewSonic they told me it would cost $180 for them to look at it and then they would give me an Estimate for the repair. They also said that my money might be better off spent on a new one with a three-year warranty. I am taking their advice but I will not be buying a ViewSonic product.",
      "rating": 2.0,
      "verified": true,
      "author": "Big dog",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "This projector replaces my TV",
      "text": "Even though this product is meant for the office, its features make it perfect to be used for home entertainment. I never used a projector instead of a TV before, so I may be biased, but: * Boot time is fast. * HD is really HD, no awful enlargement. * Color and brightness are decent for the price. * It has an HDMI port, if you want more, get a hub/switch. * It has integrated speakers, which helped me until I got the speakers I wanted. If you never used a projector instead of a TV, this one will be a great first experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Rolando Murillo",
      "helpful_votes": 0,
      "publication_date": 20130612
    },
    {
      "title": "love it",
      "text": "I bought this for two reasons it has an HDMI input and its 720p native. Worked right out of the box and I love it..the built in speaker is a joke. But I have it hooked up to a Bose Sounklink mini. I'm using it with my ps3 and movies with no problems. Ceiling mounted about 10ft from the wall and its making about 7ft screen. Great buy..",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Barco",
      "helpful_votes": 0,
      "publication_date": 20140223
    },
    {
      "title": "Finally, I found it!!",
      "text": "These are my requirements: 1. Big picture size 2. picture should be good when throw it on textured wall 3. need excellent color and brightness 4.HDMI,AUDIO and Vertical key stone adjustment 5. Decent life on the bulb 6. Less weight 7. 3D 8. Less than <$500 what else you need?? it exceeded my expectations. I really love it.I stopped watching movies on TV.",
      "rating": 5.0,
      "verified": true,
      "author": "somasundaram kumarasamy",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "What I expected",
      "text": "Movie nights and outdoor gaming are great on this thing. Have purchased 3D glasses, which also work great. I will occasionally project this on my wall to game in lit room, being able to see the screen fine, but the darker the better of course.",
      "rating": 5.0,
      "verified": true,
      "author": "austin",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "for the price it is a great projector, good quality even tho I have it ...",
      "text": "for the price it is a great projector, good quality even tho I have it at 90\" the image looks great very clear, the only down side I would give it is the fan noise, its not super loud but you can definitely notice it",
      "rating": 5.0,
      "verified": true,
      "author": "mrome49",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Very good quality for price.",
      "text": "I have been using this projector for 6 months now and am impressed with its quality. I have it ceiling mounted in the living room with a 110 inch projected image. With the display size, the color does not fade unless there is intense light in the room. Normal room lighting still shows good picture brightness. Under low lighting, the colors are crisp and strong. This is used with a cable box, blue-ray player, and game console. Audio is routed through home stereo. Would recommend to anyone who wants theater quality video at home.",
      "rating": 5.0,
      "verified": true,
      "author": "David Paxton",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "This is a great office projector",
      "text": "This is a great office projector. It has good brightness, but still the room needs to be fairly dark to get crisp colors. It still works in full light, but you will lose a lot of the contrast. Haven't had any issues with it so far in the year of ownership. Simple to use. Simple to setup. Solid picture quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Gallagher",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "Very nice, projects 2d and 3d movies on indoor and ...",
      "text": "Very nice, projects 2d and 3d movies on indoor and outdoor screens very nicely. Wish it had two front adjusters, that would compensate if the table isn't perfectly level (outdoor projection scenario) but a bag of squares cut from various cardboard thicknesses suffices.",
      "rating": 4.0,
      "verified": true,
      "author": "lyle weiman",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "Great little projector",
      "text": "For the price I think you'd be hard pressed to find a better value. I am impressed with the brightness and crispness of the picture. Even in a partially lit room there is no problem viewing. In fact it provides a better picture than some projectors costing 2x or 3x more.",
      "rating": 5.0,
      "verified": true,
      "author": "The Fat Man",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Works great, no complaints at all",
      "text": "Works great, no complaints at all. We bought this for our upstairs media room and love it. I would recommend this to anyone! One bonus was that we didn't even realize it had 3D till after we installed it (active 3d glasses required).",
      "rating": 5.0,
      "verified": true,
      "author": "C. Bose",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Perfect for Backyard",
      "text": "Used it for the 1st time this weekend. It worked great for our movie in the pool night. It was easy to setup == pretty much plug and play. I hooked it up to a wireless bluray player and we streamed a movie from Amazon. The sound that comes from the unit is not loud enough but -- I just hooked it up to a wireless Bose speaker via an AUX line and it sounded great.",
      "rating": 5.0,
      "verified": true,
      "author": "jeffrey c stewart",
      "helpful_votes": 0,
      "publication_date": 20140505
    },
    {
      "title": "Sweet home theater system",
      "text": "I love this thing. Looks amazing and was cheap! very portable, was mounted simply. Occasionally will overheat and show a red flashing light but if i give it a second (the fan stays on) then try again it works. I really do just use it that often that it heats up!",
      "rating": 5.0,
      "verified": true,
      "author": "Scoobert Doo",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "absolutely love it!!!",
      "text": "I had always wanted a projector and finally found one that was within my budget and with decent enough quality to be worth it I replaced my 60\" LED with this projector and I'm absolutely pleased with my decision, the quality is great, 3D is amazing, setup was a breeze! 10/10 would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "AnthonyG",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Good buy",
      "text": "Good projector. No issues really. Plenty bright enough, makes the image vivid, but not as bright as I expected (but more than enough).",
      "rating": 4.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "It's a great product, I used mine for over a year ...",
      "text": "It's a great product, I used mine for over a year without having to replace a bulb. Unfortunately, mine was eventually stolen. I've rated it four stars out of five because I later found a better quality projector for cheaper at a local retailer.",
      "rating": 4.0,
      "verified": true,
      "author": "Jb's Reviews",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "A great little projector",
      "text": "This projector looks great. It's so bright! My only complaint is that there is no horizontal keystone correction, so it does have to be directly in front of where you want to project. But this projector is light, compact, 3D ready and the colors look great. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Trina V. Goldstacks",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "Shhh",
      "text": "Great Picture, Loud Fan. I've used this for 4 years and the picture is great but the fan is loud. It started loud and is now unbearable after 4 years. I'm looking to replace it. The bulb has done great.",
      "rating": 4.0,
      "verified": true,
      "author": "brent touchstone",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Great projector.",
      "text": "I bought this in 2014 and love it. People comment all the time they can't believe the picture for a projector. It still works great!!! Will definitely buy this and recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda T.",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Well worth the money",
      "text": "Literally no flaws with this thing. 120' screen for $400 compared to a 40' tv. Ummm hello! Pretty obvious choice. Can't really tell difference between 720p and 1080p, practically the same. **update Ive used this Projector now for the last almost two years and it hasn't failed me once. The bulb is still going strong after 6200 hours! I use this for college and my roommates use it all the time. I see the price has gone up quite a bit but if you wait I'm sure the price fluctuates a lot. $400 no brainer, $600 is still worth it but for some people its out of their budget.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Rawls",
      "helpful_votes": 0,
      "publication_date": 20140612
    },
    {
      "title": "Good Budget Projector",
      "text": "I had bought another projector AAXA P4 P4X Pico Projector before for $300 and the image was so light and unclear. Returned it and bought. VERY Happy. Although a bit bulky and hard to carry around if you are looking to carry around, the image quality is excellent which to me is what matters. We are a small business and we use this a lot to discuss screens and white board sessions. Good buy if you are on budget.",
      "rating": 4.0,
      "verified": true,
      "author": "Mallesh",
      "helpful_votes": 0,
      "publication_date": 20131221
    },
    {
      "title": "Bright, clear pic.",
      "text": "Wow. what a great little projector for 450. Very bright. Very clear. Does everything it's supposed to. I would highly recommend and have. and i would purchase another viewsonic projector. I love to watch movies on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "The Raven",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Very happy!",
      "text": "Wow! Bought this for doing presentations and outdoor movie nights with the family. I did not expect such a great picture! Have been projecting on the back of the house and the picture is huge, bright, and clear. Picked up the sainsonic 3d glasses and watched iron man 3 in 3d and was surprised by the 3d as well. Also purchased the Bose sound link mini recommend in another review and it has great bass and sounds great too. We are very happy with our purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "M. M",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "Great buy",
      "text": "The township uses this for giving presentation along with a 100 Inch 16:9 HD Manual Pull Down Projector Screen Foldable Tripod Stand 87x49\" Matte White It puts everyone on the same page, pun intended",
      "rating": 5.0,
      "verified": true,
      "author": "Watch Trudeau",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Perfect!",
      "text": "I was a little skeptical, like most people, when I was thinking of getting a projector. I didn't know if it would hold up to the quality of our tv and if I would even like it, but I love it now! I almost went with a 1080p projector instead of this one but there is no need to in reality, I can't tell the differnce most of the time. I use this product for my ps4 and its awesome for gaming just looks great, sound isn't the best but I already had a couple sound bars laying around. Definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "Amazing!!!",
      "text": "Excellent video even during daylight. I have my garage setup as the Man Room and we can watch Football from the driveway @ 3 in the afternoon (my garage door faces east). There sure are better projectors out there, but for the price you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "rgalan",
      "helpful_votes": 0,
      "publication_date": 20130818
    },
    {
      "title": "Makes an outstanding outside movie theater!!!",
      "text": "Just had an awesome night with my family watching movies under the stars. Through out the air mattress and enjoyed the evening. I would recommend this projector. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "RICK CROWDER",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "GREAT Product Images are perfect",
      "text": "This product is great, the image that is displayed is awesomely crisp clear. I have connected the same to my PC and HDMI DVD player and the output is perfect. I would definitely recommend this to anyone whether for office or home use.",
      "rating": 5.0,
      "verified": true,
      "author": "rodnelso",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Nice projector, but the zoom barely moved/changed the size ...",
      "text": "Nice projector, but the zoom barely moved/changed the size of the image and that was important for me. Had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 2,
      "publication_date": 20141012
    },
    {
      "title": "This projector is great! It turns on so much quicker than my ...",
      "text": "This projector is great! It turns on so much quicker than my previous projectors, the colors are crisp and the bulb very bright even during the day! The resolution is fantastic. I love this thing. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Set up was very easy (better than I expected)",
      "text": "Bought for office for meeting room. Set up was very easy (better than I expected). Image projected is very nicely bright and does not require especially dim ambient lighting. A solid product so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Samuel VW",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "works great. love it using it for outdoor movies and ...",
      "text": "works great. love it using it for outdoor movies and so far no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Great projector for the price",
      "text": "Though only 720p is amazing for the price. Has odd Mount holes and the free screen offer is bs. The projector had amazing picture. Great contrast and can be used in a lit room. At this price it can't be beat. Great for gaming and fine for 3d as well",
      "rating": 5.0,
      "verified": true,
      "author": "dayna watson",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "ViewSonic PJD5533W WXGA Portable WXGA Projector",
      "text": "This projector works great plugged into my computers HDMI port. The image is crystal clear and resolution is great. The projected image is bright enough to watch with house lights turned on.",
      "rating": 5.0,
      "verified": true,
      "author": "Reece Hasson",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Very pleased with the purchase!",
      "text": "Image is AMAZINGLY clear, very easy to use and very bright. The remote is small but comfortable to the hand. I've tried 3D movies with dlp-link glasses and works very well. You just have to set the projector to 3d and sync the glasses. The only drawback to this great great product is the rainbow effect. If you are too sensitive to it, you will find it a little annoying. Overall, a great projector. Very pleased with the purchase and I still have 6000 hours to enjoy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Federico Grijalba",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Great for outdoor theater!",
      "text": "I bought this to use as an outdoor theater and it works great matched up to a 120\" screen. Great colors and bright right before dark. It makes it nice to sit out under the stars and watch movies and sporting events!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "A very good project. It works fine and has good light",
      "text": "A very good project. It works fine and has good light. As in most self-contained systems, the speaker is not great. Plan to use an exterior speaker which is a must!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Myers",
      "helpful_votes": 0,
      "publication_date": 20140920
    },
    {
      "title": "Indistructible",
      "text": "Clear Bright picture on a big screen. You can even view things during the day, but of course it's better at night. A 220lb. man fell on top of it and it started right up. I highly recommend this projector!",
      "rating": 5.0,
      "verified": true,
      "author": "C.P.",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Great quality, solid projector",
      "text": "Great quality, solid projector. Not a 1080p but this cost a fraction of the price. The only issue I have found is that the projector gets very very hot. Still I have not seen any bad sign of overheating,",
      "rating": 3.0,
      "verified": true,
      "author": "Raúl Feraud Ramírez",
      "helpful_votes": 0,
      "publication_date": 20140728
    },
    {
      "title": "This is an okay projector. I had trouble with ...",
      "text": "This is an okay projector. I had trouble with the menu options. The \"Keystone\" choice, which adjusts the projected image up & down, locked so that I could not select other options in the menu. It also locked the next choice of menu options.",
      "rating": 2.0,
      "verified": true,
      "author": "average joe",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Great projector for the price",
      "text": "The item was exactly as advertised, it works as very well, the fit and finish are good, image is bright in daytime and very clear. It runs quite, worked perfect for movies and the conference room.",
      "rating": 5.0,
      "verified": true,
      "author": "TShuell",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Great Projector for our worship service.",
      "text": "Our church bought a ViewSonic projector 10 years ago and it was a great projector. When it was time to get a new one, we bought two of these and they are great also. It is a wonderful projector for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "jedean",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "Good picture but don't trust it for watching movies outdoors",
      "text": "Good picture but don't trust it for watching movies outdoors. The sound won't go loud enough. Even my Boze speakers can't generate much volume. Otherwise it's great.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill Eubank",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Easy to purchase",
      "text": "Shipped quickly! Easy to purchase. An projector works amazing outside. I purchased this projector for Summer movie nights in backyard, and entertaining with music videos. The graphics are excellent for the price! I am a first time projector buyer, and this was affordable, and easy to install!",
      "rating": 5.0,
      "verified": true,
      "author": "paulina reed",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "Great for movies.",
      "text": "We got this specifically to watch movies outside. So far it's been great, the picture is fantastic, everyone who views it comments on how great the picture is. You do need a sound system though, the internal speakers are pretty much useless.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Carr",
      "helpful_votes": 2,
      "publication_date": 20140817
    },
    {
      "title": "Best you'll find at $450",
      "text": "This is my third viewsonic projector. I've had a lower model break on me twice. this one has much better picture. I hope it lasts. Best you're gonna get for this price",
      "rating": 4.0,
      "verified": true,
      "author": "Katelyn Hilles",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Nice resolution on outdoors stucco wall",
      "text": "Surprisingly good resolution. We used it to project movies onto the side of our stucco house, so that we could watch movies while floating around in the pool, and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "yanstep",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Love the quality but have only had it about a ...",
      "text": "Love the quality but have only had it about a month and there appears to be dust collected on the inside and I can't figure out how to get rid of it and the DVD instruction manual isn't loading right on my computer. Argh! Otherwise it's a great quality picture.",
      "rating": 4.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "Clear Picture",
      "text": "Its really easy to put up. I installed it in my man cave and got a 100 inch screen to match. The picture quality is great, I have watched a couple of movies on it and played a little PS3. Gamers this is awesome for games not the best but for the price its way worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130516
    },
    {
      "title": "Wonderful!",
      "text": "Absolutely fantastic! It has been used daily for over a year and no issues whatsoever. Such a great product that my father has purchase one and a buddy of mine who was so impressed purchased the 1080P model.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace L",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "Great projector for the price",
      "text": "Great projector for the price, very bright and crisp images. Easy to adjust settings to mount upside-down from the ceiling and have the picture turn out right.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Wozniak",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "Replaced a cannon projector. the throw distance is not ...",
      "text": "Replaced a cannon projector. the throw distance is not what I wanted as I am using it in a room approx 10x12. the screen is around 90 inches and the image is excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Al Tafur",
      "helpful_votes": 2,
      "publication_date": 20140717
    },
    {
      "title": "Great Picture - Not So Great Sound",
      "text": "Not the best or brightest projector out there, but certainly enough for home usage. Movies look great. Sound is a big drawback. The speakers on this thing are terrible, but it's not an issue if you use headphones or connect to a speaker system. Edit - October 2014 Purchased this product in May of 2014. As of September 2014, this projector has quit working. After a few months of very light use, the bulb in the projector no longer lights, and the projector shuts off after about 2 minutes of power up. I am currently dealing with the RMA team a viewsonic to have the projector repaired. Will update when it is returned.",
      "rating": 1.0,
      "verified": true,
      "author": "David Butler",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "Awesome, we have on our wall in the family ...",
      "text": "Awesome, we have on our wall in the family room. Lots of light, but very easy to watch day. The quality if awesome and very quite, would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "friscovike",
      "helpful_votes": 0,
      "publication_date": 20141022
    },
    {
      "title": "Great value in a budget projector",
      "text": "Great value in a budget projector. I'm using this with a camp chef outdoor screen (11') for outdoor movie nights. It looks fantastic and I'm impressed with the features of it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris M",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Nice",
      "text": "Excellent for the intended purpose. Wish it had wider remote control detection area though.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "Out side Usage.",
      "text": "I bought this projector because my old one was fuzzy and dim. This one worked great from the first day! It is clear and works great on my outdoor screen in the back yard. By time the sun stars going down, it is visible in the evening. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Chad Brazier",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Excellent product, no problems",
      "text": "Excellent quality product, works without any issues right out of the box. Simple to use, lots of nice features and projects a large, bright, image.",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Elwell",
      "helpful_votes": 0,
      "publication_date": 20130802
    },
    {
      "title": "Love it. very happy with purchase",
      "text": "Lumsing Universal Rechargeable active shutter glass work great for this projector. You will need a cable box for the tv to work. I used a Fosmon Intelligent HDMI Switch to hook all my hdmi cables to. I think it best to have a receiver with several hdmi inputs on it for better sound quality. I use my ps3 for 3d movies. I purchased lumi",
      "rating": 4.0,
      "verified": true,
      "author": "Speed Demon",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Absolutely beautiful",
      "text": "This is my new primary home theater projector and I couldn't be happier. Picture is clear and brilliant even in a well lit room. Highly recommended, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "red13dotnet",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Works great for business presentations",
      "text": "Works great so far. I've used it in two business presentations. It fires up quickly and doesn't make that much noise.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin, TX",
      "helpful_votes": 0,
      "publication_date": 20140714
    },
    {
      "title": "Great for the price",
      "text": "Great price, nice picture and I love the keystone correction, I would recommend it. Downside is that I get the rainbow effect, which is kind of annoying and there is no surround sound hookup, which is disappointing.",
      "rating": 4.0,
      "verified": true,
      "author": "shane",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Excellent for the price",
      "text": "This projector is very good. I use it to view movies and the quality of the picture is excellent. At less than $500, you can't ask for better projector. It is much better than my 10 year old BenQ for which I paid over $3500. I also liked the 3 year warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "carmen31",
      "helpful_votes": 2,
      "publication_date": 20130530
    },
    {
      "title": "Works great with our screen",
      "text": "We have canceled our cable subscription and use this for our Netflix \"movie night\", Works great with our screen!",
      "rating": 5.0,
      "verified": true,
      "author": "L. C. McClure",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Great image for the price, and multiple inputs",
      "text": "This projects a nice, bright image, clearly visible with ordinary room lighting and pretty spectacular with the room darkened. An LCD or Plasma TV with an image this big would cost about six times the price of this thing -- and you couldn't put that huge LCD away in a closet when not in use! This unit has connections for just about every video format in common home or office use today; so far I've used both HDMI (from my Android tablet) and VGA (from a laptop) connections. If you're familiar with standard computer and A/V gear, you should find setup pretty simple. I use similar projectors at work all the time so I knew where to connect it up.",
      "rating": 5.0,
      "verified": true,
      "author": "M. D. HEALY",
      "helpful_votes": 0,
      "publication_date": 20140617
    }
  ],
  "product_meta": {
    "title": "ViewSonic PJD5533W WXGA 3D DLP Home Theater Projector",
    "description": "Style:Projector Only\n\nThe ViewSonic PJD5533w is the ideal projector for the office or on campus. It delivers amazingly clear images with 2800 ANSI lumens, 15000:1 contrast ratio and XGA 1024x768 native resolution. The PJD5533w is packed with features including multiple PC and video input options, 1.1x optical zoom, keystone correction, PC 3D-ready/120Hz, support for HD signal, integrated speakers, and DynamicEco. With DynamicEco technology, presenters can place the projector in \"standby\" when they need to shift the audience’s focus, or when the projector is not in use, by simply reducing the brightness down to 30%—all without having to restart the projector. A filter-less design and energy-saving Eco-mode provide for virtually zero maintenance and product reliability and virtually zero maintenance. Measuring only 3.7\" high with and weighing only 4.7 lbs, the slim design of the PJD5533w makes it the perfect projector for tabletop or ceiling mounted use.\n\nKEY FEATURES:\n * 2,800 ANSI lumens for clear and bright images\n * 1280x800 native resolution for 720p HD content and widescreen brillance\n * BrilliantColor technology provides exceptional display quality\n * Virtually maintenance free with filter-less design\n * Long-lasting reliable picture quality & superior color performance\n * 3D Blu-ray ready with HDMI\n * 6-segment color wheel design, auto source detection, support HD signals & integrated speaker\n * DynamicEco technology for total control of audience’s focus\n * PC 3D ready & up to 120Hz refresh rate powered by DLP Link Technology\n * Long lamp life up to 6,000 hours*\n * Environmentally friendly Eco-mode saves money and power \n * Small & light for easy portability\n * Industry leading warranty: 3 years limited warranty on parts and labor, 1 year on lamp, and free 1st year Express Exchange service* \n\n\n\n2800 LUMENS SHINES IN VIRTUALLY ANY SETTING\nUses fewer watts per lumen than other comparable projectors. And with 15000:1 contrast (with DynamicEco), the PJD5533w is the bright choice for business and education.\n\nSETTINGS WHERE THE PJD5533W IS THE PERFECT SOLUTION\n * Business - conference rooms, meeting rooms, boardrooms.\n * Classrooms - lectures, videos, lesson plans, project presentations and even auditorium presentations. \n\n1280X800 NATIVE RESOLUTION FOR 720P HD CONTENT AND WIDESCREEN BRILLIANCE\nA wide format projector supporting a native 1280x800 (WXGA) resolution offers a tremendous degree of flexibility and compatibility. Whether you are connecting your widescreen notebook in a conference room, or showing the latest HD 720p / 1080p content in a classroom, you are guaranteed a distortion-free image with a matching aspect ratio. \nWith WXGA resolution, the ViewSonic PJD5533w delivers exceptional pixel-by-pixel image performance for a total of 1,024,000 pixels. That is 2.1x more pixels than SVGA or 1.3x more than XGA. A higher pixel count enhances image details and picture quality\n\nDLP TECHNOLOGY\nAdvanced DLP (Digital Light Processing) technology allows you to experience crystal clear, razor-sharp and lifelike images with the same DLP technology used in Hollywood. For fast action, the response time is 1,000 times faster than similar LCD based projectors. And with no air filters to clean or change, the latest generation of DLP based projectors from ViewSonic is among the lowest TCO (Total Cost of Ownership) in the industry.\n\n\n\nViewSonic’s PJD5533w projector with BrilliantColor technology features multi-color processing to produce stunning, vibrant colors. Unlike other technologies that use just 3 primary colors to produce the image (such as LCD), the PJD5533w uses up to 6 separate colors. The sophisticated 6-segment color wheel enhances the yellow color performance that is key to accurate and vivid color reproduction. With multi-color processing, colors are richer and more vibrant with exquisite and precise detail.\n\n\n\nVIRTUALLY MAINTENANCE-FREE WITH FILTER-LESS DESIGN\nViewSonic’s PJD5533w projector features a filter-less design. Unlike LCD projectors that require the user to clean, sometimes to replace, filters after every 100 to 300 hours of operation, ViewSonic’s PJD5533w projector is filter-less, eliminating the need for filter cleaning or filter replacement. This saves you significant maintenance dollars and labor over the projector’s lifespan, and lowers your total cost of ownership (TCO).\n\n\n\nLONG-LASTING RELIABLE PICTURE QUALITY & SUPERIOR COLOR PERFORMANCE\nViewSonic DLP projectors provide reliable picture quality you can trust and superior color performance you can count on after thousands of hours of usage. Built on DLP technology, the ViewSonic PJD5533w projector virtually eliminates image degradation known as color decay – a yellow/faded tint that LCD projectors may develop after extended use. Even after years of use, the PJD5533w is will continue to produce a stunning, sharp image that lasts.\n\n\n\n3D BLU-RAY READY WITH HDMI\nWith the latest HDMI, the ViewSonic PJD5533w projector can now display 3D images directly from 3D Blu-ray players. The PJD5533w is designed to provide an amazing 3D visual experience for classroom, office, and even home environments.\n\n\n\nPACKED WITH FEATURES\n * 6-segment color wheel design improves color performance and accuracy to provide natural, vivid colors\n * Auto source detection senses the source input and syncs with your computer automatically\n * Supports wide range of digital signals from SD (480i/480p) to HD (720p/1080i/1080p)\n * Integrated speaker ideal for multimedia applications, videos, and audio-enabled presentations \n\n\n\nDYNAMICECO TECHNOLOGY FOR TOTAL CONTROL OF AUDIENCE’S FOCUS\nWith the DynamicEco button on the remote, take command of presentations by dimming the sceen brightness by 70%. This feature allows presenters to easily shift the audience's focus when the projector is not in use. When idle, the projector will auto-activate DynamicEco as well. When DynamicEco is activated, the lamp's power consumption is significantly reduced- a great energy-saving design for low total cost of ownership (TCO).\n\n\n\nPC 3D-READY / 120HZ REFRESH RATE POWERED DLP LINKTECHNOLOGY\nWith support for DLP Link technology, you´ll have amazing 3D capabilities at your disposal. All that's required to unlock 3D capabilities on ViewSonic PJD5533w 3D ready projector are ViewSonic PGD-series 3D active shutter glasses, 3D content and 3D-enabled video card. Unleash a vivid 3D experience with the ViewSonic PJD5533w today.\n\n\n\nLONG LAMP LIFE UP TO 6,000 HOURS*\nThe new advanced lamp technology from ViewSonic extends the lamp life up to 6,000 hours and saves you on replacement lamp costs.\n\nENVIRONMENTALLY FRIENDLY ECO-MODE SAVES MONEY AND POWER\nWith only a slight 20% decrease in brightness, the Eco-mode function can extend the life of your lamp by almost 50%* and up to 6,000 hours* in some cases. Other benefits of Eco-mode operation include reduced power consumption, as well as less heat and audible noise output. It´s good for the environment and great for your budget. The Eco-mode function will definitely help lower your total cost of ownership (TCO).\n\n\n\nSMALL & LIGHT FOR EASY PORTABILITY\nMeasuring only 3.3 inches high and weighing only 4.6 pounds, ViewSonic’s PJD5533w is light and compact, making it the perfect portable projector for mobile sales and business travelers.\n\nPEACE OF MIND WITH INDUSTRY LEADING WARRANTY\nBacked by our 25 year reputation for quality and reliability, ViewSonic offers one of the industry´s best overall projector warranties with 3-year limited parts and labor, 1-year lamp and first year free Express Exchange service*. Don´t be fooled by the seemingly longer warranties in the market that exclude the more vulnerable systems and moving parts of a projector.\n\nVIEWSONIC PJD5 SERIES FEATURE COMPARISON\nWHAT IS IN THE BOX:\n * ViewSonic PJD5533w projector\n * Power cord\n * VGA cable\n * Remote control with batteries\n * Quick start guide\n * ViewSonic Wizard CD (with User Guide)\n\nOTHER FEATURES:\n\n\n*One year Express Exchange Service requires product registration. Program specifications and availability are subject to change without notice.\n**Lamp life and energy savings may vary based on actual usage and other factors.",
    "rating": 4.1,
    "feature_bullets": [
      "Screen Size Range: 76-inches from 8 feet; 113-inches from 12 feet",
      "Brightness: 3000 Lumens",
      "Contrast Ratio: 15,000:1, Keystone Correction: Vertical +/- 40º",
      "Warranty: 3 Years parts & labor, 1 year lamp and 1 year free express exchange*; Lamp Life: up to 10,000 hrs",
      "HDMI, S-Video, VGA x2, Composite Video, 3.5mm Audio, RS-232, Mini USB",
      "0.65\" Digital Micromirror Device (DLP)",
      "WXGA 1200x800 native",
      "1.1X manual optical zoom / manual optical focus",
      "15,000:1 (w/ DynamicEco) contrast ratio"
    ],
    "specifications": {
      "Brand Name": "ViewSonic",
      "Item Weight": "4.6 pounds",
      "Product Dimensions": "8.7 x 10.5 x 3.3 inches",
      "Item model number": "PJD5533W",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "Black",
      "Specification Met": "ANSI",
      "Special Features": "3D-ready, Speakers",
      "Item display height": "8.2 centimeters",
      "ASIN": "B00511ITEM",
      "Customer Reviews": "4.1 out of 5 stars309 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#1,514 in Video Projectors",
      "Date First Available": "December 22, 2012"
    },
    "categories": [
      "Electronics",
      "Video Projectors"
    ],
    "price": 699.0
  }
}