{
  "website_summaries": [
    {
      "verdict": "A steel platform truck that is intended for use during non-industrial and industrial applications alike.",
      "pros": [
        "Steel deck is expertly welded for maximum strength and durability",
        "Features a steel handle that can be removed for easy storage",
        "Includes a floor lock to help keep your items in place while you are using the platform truck",
        "Equipped with four rubber casters that provide exceptional maneuverability"
      ],
      "cons": [
        "Can be difficult to lock the platform truck's handle into place"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Made in China (without) pride",
      "text": "Arrived with 1 bad caster that leaked the ball bearings all over the place because it wasnt pressed properly. Called Vestil directly and got a replacement mailed out. cool - except the replacement was a different style, looks like they must have worked out the problem with a different manufacturing process. New caster was 3/4\" shorter than the others so i had to level it with stacked washers. Now the front caster bearing is failing. China at its finest",
      "rating": 2.0,
      "verified": true,
      "author": "jcrevs",
      "helpful_votes": 15,
      "publication_date": 20160310
    },
    {
      "title": "A Solid Platform Unlike Most Politicians",
      "text": "The Vestil ECSPT-2448 Steel Platform Truck with 6\" x 2\" Rubber Caster & 2000 lbs Capacity arrived with a good fit and finish. Assembly was straight forward and the removable cotter pin on the handle was a nice touch allowing for easy install and removal of the handle when required. Like so many others stated the packaging was almost non-existent when it arrived. How all the parts got here is beyond me but they did and remarkably with no damage. Had it suffered damage like another reviewer said \"It's a Platform Truck it's going to look like that after a few days of use anyway\".",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter Millworks, Inc.",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Heavy duty.. but ooof, the STENCH",
      "text": "As everyone noted, the box comes completely obliterated. Literally slipped right off. Heavy duty cart and the typical you-install-the-wheels setup. Easy enough. Yes the handlebar slips out but I’ve seen that on the $500+ Rubbermaid carts too. But my god, the chemical smell coming off this thing, what the heck! Scary. Unnecessary. Unclear what or why. Kept it out on the porch to air it out but the smell remains. Nothing leaking or anything... just beware. I’m honestly scared of what this thing is made of or where it’s been for it to smell like this.",
      "rating": 3.0,
      "verified": true,
      "author": "mnelshen",
      "helpful_votes": 3,
      "publication_date": 20190603
    },
    {
      "title": "Product was damaged - Need a replacement",
      "text": "Hello, When product was received box was torn apart and flat bed where handle goes into was bent. I am not able to get the handle into the hole. Please advise on how we can have a new flat bed sent to us. Thank you",
      "rating": 1.0,
      "verified": true,
      "author": "Alison B.",
      "helpful_votes": 6,
      "publication_date": 20191214
    },
    {
      "title": "Zero star",
      "text": "arrived late, without wheels, scratches, and cracking from all the sides I don’t recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Issa",
      "helpful_votes": 4,
      "publication_date": 20200601
    },
    {
      "title": "Decent for such a low cost, the handle could be an issue",
      "text": "I am amazed that the handle just sits in the openings with no way to secure it, if you lift up at all it's coming right out. We've drilled and transplanted a pin from another old cart to fix it, but not real smart to leave that off. The packaging is very thin cardboard that does not hold up well, luckily the unit arrived with all parts intact. Overall is fine for our use.",
      "rating": 4.0,
      "verified": true,
      "author": "WD",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "Missing Parts-Crazy",
      "text": "It came incomplete. The platform cart did not come with wheels. I am having a very hard time getting any response. I bought two platform carts- one new and one used-neither one came with wheels.",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Duncan",
      "helpful_votes": 3,
      "publication_date": 20200730
    },
    {
      "title": "DOLLY FOR CONCRETE AND SAND",
      "text": "Cleaning out the workshop and I got this to put my concrete and sand on so I could move it around if I wanted to clean under it. This is going to be very handy. I did think it was a little over priced but it is the only one I found for the size I wanted. Easy assembly. Handle comes off so I can stow it under a table.",
      "rating": 5.0,
      "verified": true,
      "author": "Cookie",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Good cart but handle not affixed.",
      "text": "Good cart. Wish the handle bar would lock or latch in some way to the flat cart. It just sits in two holders and is held there by gravity. I drilled holes, tapped and bolted the handle bar ends in place.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin",
      "helpful_votes": 3,
      "publication_date": 20180625
    },
    {
      "title": "Handle comes out easily. Wish it would lock in place",
      "text": "Handle comes out easily. Wish it would lock in place.",
      "rating": 4.0,
      "verified": true,
      "author": "cdm",
      "helpful_votes": 6,
      "publication_date": 20180103
    },
    {
      "title": "Damage",
      "text": "Hello, Box came damage. The product came scratched and damaged. Brand new. Box looks like it was beat up ans smacked around.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheetahs",
      "helpful_votes": 2,
      "publication_date": 20190910
    },
    {
      "title": "Shipping disaster",
      "text": "The item might as well been shipped with out a box. The entire item was scratched ( handle , base, handle and base connector). To utilize the handle bar I will need to hammer the base connect closer to the shape it needs to be to accept the handle bar. I would return the unit, but I would need to go purchase a box big enough to fit it, so I will make due with a damaged product that need to be remolded to be put to it intended use.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Castro",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Missing Hardware",
      "text": "Upon receipt of this order, \"Vestil ECSPT-2448 Steel Platform Truck, 6\"x 2\" Rubber Caster\" 2000 lbs Capacity, 48\" Length x 24\" Width x 11.8\" Height Deck\", I realized when unpacked that not all hardware was present. Missing was five (5) bolts, and the associated hardware. I would appreciate a follow-up in the replacement of that hardware.",
      "rating": 1.0,
      "verified": true,
      "author": "Rufus L. Palmer",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Missing Wheel",
      "text": "So when I got the box it had a hole in one corner, which was fine until after opening I realised that one of the wheels must have gotten out the hole and I only had 3.",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin Outerbridge",
      "helpful_votes": 2,
      "publication_date": 20190830
    },
    {
      "title": "Versatile!",
      "text": "I love this item. I can carry one cord and charge different electronics.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven W Carter",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Great cart for the price but it was missing parts",
      "text": "great cart for what I need to put my camp. The box it came in was all beat up and it's got a couple dents in it and was missing bolts. I sent my son down to Lowes and he got the missing bolts that I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "JAYFAV",
      "helpful_votes": 5,
      "publication_date": 20160107
    },
    {
      "title": "Great for the money",
      "text": "This cart pretty well made and comes with heavy casters with grease fittings. The packaging is inadequate to prevent shipping scuffs and scratches.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Nice & Heavy",
      "text": "Easy to steer. Knocked off a star because one wheel is shorter then the other 3 which causes a wobble when empty.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda Murray",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "As expected and very well made for the cost.",
      "text": "Performs as expected. Packaging was trashed and contents were spilling out when it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Weaver",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Good product",
      "text": "Good product, missing user manual/ installation guide. Otherwise its a good product.",
      "rating": 4.0,
      "verified": true,
      "author": "jay patel",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Definitely a great buy!",
      "text": "Exactly what I needed and ordered. Easy to assemble and is perfect! I use it to transport colorguard floor tarp and props and it’s made our show time much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny M.",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Works perfect",
      "text": "We have used this numerous times and it is holding up great. Can carry a heavy load with ease. Great size and durability.",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Damaged Product",
      "text": "I ordered this item twice and I received both items damaged.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Missing parts",
      "text": "Product came with only two wheels. I need the other two wheels to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael k.",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "As advertised!",
      "text": "Perfect for pulling orders for will-call customers. Handles the weight, quality wheels and nice finish. Small size is great for narrow aisles.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Garin",
      "helpful_votes": 2,
      "publication_date": 20140922
    },
    {
      "title": "ABSOLUTELY LOVE THIS CART",
      "text": "ABSOLUTELY LOVE THIS CART. IT IS PERFECT FOR OUR USE AND WE WOULD LIKE TO ORDER MORE IF IT WAS AVAILABLE.",
      "rating": 5.0,
      "verified": true,
      "author": "Shooters World",
      "helpful_votes": 0,
      "publication_date": 20180514
    }
  ],
  "product_meta": {
    "title": "Vestil ECSPT-2448 Steel Platform Truck, 6\" x 2\" Rubber Caster, 2000 lbs Capacity, 48\" Length x 24\" Width x 11.8\" Height Deck",
    "description": "Vestil platform truck with 6-inches diameter by 2-inches width rubber caster. Solid, smooth steel deck is all welded and features structural reinforcement underneath for extra strength. Includes one removable high-polished steel handle and rolls smoothly on two rigid and two swivel casters. 2000-pounds capacity. Measures 48-inches length by 24-inches width by 11.8-inches height.",
    "rating": 4.1,
    "feature_bullets": [
      "Platform Truck with solid, smooth steel deck is all welded for maximum strength",
      "Features structural reinforcement underneath for extra strength",
      "Includes one (1) removable high-polished steel handle for easy storage",
      "Comes with a floor lock on four (4) rubber casters for smooth manuverability",
      "Deck height-11-7/8 inch"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "48 x 24 x 11.8 inches; 90 Pounds",
      "Item model number": "ECSPT-2448",
      "Date First Available": "December 30, 2010",
      "Manufacturer": "Vestil Manufacturing",
      "ASIN": "B0052PKHO2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Platform Trucks",
      "Industrial & Scientific",
      "Material Handling Products",
      "Material Transport Equipment"
    ],
    "price": 187.0
  }
}