{
  "website_summaries": [
    {
      "verdict": "A low price for a catnip plush toy that is the perfect size for the cat to bat, hold, or throw in the air.",
      "pros": [
        "Red color and shape of a hot pepper gives your cat a unique looking toy",
        "Filled with catnip, so it will keep your fur-baby entertained",
        "Excellent price point for a plush cat toy, especially considering its high-quality construction"
      ],
      "cons": [
        "No option to refill the catnip",
        "Might be too small for larger cats to enjoy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Loved it so much I bought a 2nd one",
      "text": "I wasn't sure if my cat would play with this carrot you but as soon as I put it down, she attacked it and started kicking, biting and licking it. I knew I had to buy her a second one. Now she only plays with these two carrots. She also loves to sit and lie on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Avasmum",
      "helpful_votes": 26,
      "publication_date": 20160414
    },
    {
      "title": "Cat loves it!",
      "text": "Just got this took it out the package and my cat smelled it he was running around looking for it lol so I finally gave it to him and he is going wonkers over it he absolutely loves it. It's a nice size and thickness full of catnip and very durable he was drooling all over it so it got wet and then he was biting it also and it held up. He doesn't usually react to catnip but this stuff here he likes!! 😻 so know I know where I'll be ordering his catnip toys from now on! It's a win win... good price free shipping and next day delivery and the fur baby is happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelz",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Best Toys Ever",
      "text": "I have the fish, the pepper, and am here ordering the carrot... my Maine Coon and Domestic Shorthair CANNOT get enough of the these toys... they spend a good 20 minutes running around the house with them, to somersault into my kitchen and go wild with kicks for another 10 minutes, then they blast off out through the other side of the kitchen and take off up the stairs toting these toys around like their proudest kill, only to wreck havoc upstairs, haul booty back down the stairs and repeat... they've held up so far, and it keeps the fur babies active and happy. For the price, I'll gladly buy many more.",
      "rating": 5.0,
      "verified": true,
      "author": "Toxic Fox Designs",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Don't waste your money.",
      "text": "All three of my cats LOVE catnip & catnip filled toys. Not one of them wants anything to do with this toy. After they ignored this for a day I gave them a catnip banana made by a different company and they were all three all over it, leaving this toy entirely alone just a couple feet away. This has good past reviews, so either something has changed or there's a worthless batch of these out there. Either way, don't waste your money on this toy - spend a couple extra bucks & get the catnip banana, fish, or rainbow from the other company.",
      "rating": 1.0,
      "verified": true,
      "author": "SarahQ",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Caution, this product works as described",
      "text": "If you have more than one cat do not buy one. Buy one, for each cat, otherwise it could cost someone an eyeball. Any other toy we have, one is enough, they can share, not this toy! When it is out, it needs to be had, and it needs to be had by everyone. Save the packaging for proper storage! Out of eight cats really only four respond to catnip, with this carrot 8 out of 8 respond. We bring the carrots and nanners out for special times and put them away in double sealed plastic bags otherwise we would never get any sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie williamson",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Great Toy- discard Tags n Packaging ASAP",
      "text": "Joey loved it immediately! Bit it, chewed it, scraped it with his back feet. Smells a lot like catnip! Feather fluff came out a bit ... no problem. Problem and Suggestion... I always cut the paper rage off the side; there were 2. As u see in my photo, there is now only 1. NOTE to manufactuer - The 2 paper tags attached must smell like catnip and my cat ate one! He went For the plastic wrap. Shoppers, Please discard your tags and plastic ASAP.",
      "rating": 4.0,
      "verified": true,
      "author": "M. OlsonTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Have you told your cat about Catnip?",
      "text": "I spent a few years showing Scottish Fold cats, so I know good Catnip. At cat shows there are vendors that sell the greatest catnip on the planet. This Catnip closely resembles the great stuff I used to but at the shows. I can’t say that about most Catnip toys. I was surprised when .i opened the plastic packaging. My cat was surprised too and went into a Catnip meltdown. Be aware that not all cats go nuts for Catnip, and kittens are too young to have the receptors for Catnip.",
      "rating": 5.0,
      "verified": true,
      "author": "Nanci SquierTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Great toy!",
      "text": "My cats love these catnip toys. They carry them around the house (I have to buy them in multiples) and sleep with them as pillows and offer them to me as presents. I thought that the cats would rip them apart in days, but they haven't. I have some that are about a year old as well as new ones. Yes, the scent of the catnip wears off, but I spray catnip spray on them to keep them interesting....a great deal and a great toy for a great price. Recommended highly if your cat is insane about catnip. The preferred shape for my cats is the jalapeno, but they also like the carrot, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Mashehu",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Fun",
      "text": "My cats didn't take to the fish or carrot, but they love the chili pepper one. Lots of fun for them. I tusually use a lint roller to get the lint and hair off of it and then smoosh it around to spread the catnip every now and again. Kinda like a refresher for it. They love to lick it and tumble around with it (chili one) - the only issue is that it punctures very easily. Within the first play with it, there were tons of clat claw punctures. If the material was thicker, I think it would hold up better....",
      "rating": 4.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Waiting for Snake #2 to be in stock!!!",
      "text": "My cats LOVE these toys. I would give it full 5 stars but they ripped out one of the feathers after playing with it for less than 30 minutes. We had the snake and they loved that so much. They partied too hard one day and snake went in the water dish. Needless to say, he was a goner and had to be thrown out. Waiting for these to be back in stock as my cats clearly can’t handle feathers. Otherwise they are obsessed with these specific toys must be a good strand of catnip 😂😉 hahahah",
      "rating": 4.0,
      "verified": true,
      "author": "Holly",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "My cats thinks these  are the greatest thing since sliced bread.",
      "text": "My wo cats will play with these for hours. Just totally happy and kicking and biting the pepper filled with catnip and I think it’s really good kid now! And it’s not just one day, they keep going back to it for a few weeks. These arrived today, one for each cat, and I have not seen them since. I highly highly recommend this product. I have also purchased them two bananas. two cats will play with these for hours. Just totally happy and kicking and biting the pepper. I highly highly recommend this product. 🙀😽😺",
      "rating": 5.0,
      "verified": true,
      "author": "skac",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Complete Dud",
      "text": "I have 6 cats. They love catnip and have had many catnip toys over the years. The banana catnip toy looked like fun so I purchased 6 of them so each cat could have their own. What a waste of money! Not one of the cats tried to play with the toys. Even after I rubbed catnip all over the toys, the cats would show a little bit of interest for a brief moment, then walk away. Now I have 6 yellow bananas just taking up space. I really wonder if this batch of bananas ever got any catnip sewn into them. That's the only conclusion I can make. I really regret this purchase. Don't make my mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Adorable shapes, durable, the cat adores them",
      "text": "These are the best catnip toys ever. I bought this one as a replacement for the old one my girlfriend's cat had. (Her roommate's dog tore it up.) He adores these and carries them around the apartment and plays with them and licks them until they get super gross. The toy itself is extremely durable. I love all the cute little shapes they come in! So far Captain (the cat) has had a carrot, a fish, and this chili pepper from this brand and each time something happened to one, we have replaced them with a toy from the same brand. and they've all been his absolute favorite toys in the world.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "this is made in China with catnip from North America",
      "text": "I specifically want only toys made in the USA and believed that to be the case with this toy, it turns out to be made in China with North American catnip which really doesn't make sense, it was cheap, but I don't want anything near my pets made in China, not because I am prejudiced, but because there have been issues with pet food made in China and even baby food in the past so I decline to purchase anything made in China just for safety reasons and why not make it in the USA anyway?",
      "rating": 3.0,
      "verified": true,
      "author": "hermione",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Cat instantly loved it but it fell apart :(",
      "text": "Updated 8/21 This has been demolished in less than a month. But my car loved it so much I’ve ordered another. What’s $6 a month for my fur babies happiness. Hope next one Holds up... Updated 7/24 Sadly this didn’t hold up at all as my cat loved it :( see picture. Can’t comment on durability as we’ve only had it 15 minutes, but my kitty smelled this before I got the package open. It’s very strong. He’s been going at it since I gave it to him. This is the best $5 I’ve spent in a long time. We got the banana. Side note it’s hilarious to watch your cat lick a banana.",
      "rating": 2.0,
      "verified": true,
      "author": "EM",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "A carrot?  Why do they like carrots?",
      "text": "My wife and I have bought no less than five of these over the last year or two for our cats and other people's cats. I would never have expected a fake carrot to be the favorite toy of so many cats, but here we are. I think maybe they particularly like the size, shape, and color by comparison to other toys. I suppose it's bright in color, about the size of a plump rat, and it's easy to toss around between the paws.",
      "rating": 5.0,
      "verified": true,
      "author": "scradam",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Cats went berserk!",
      "text": "I bought one chili peppers and one carrot for my four kitties, not knowing how'd they react. Instant interest, insanity and fighting over whose turn it was next so I bought two more! One chili pepper was destroyed during the melee last week but it was easy to vacuum up the filling. I am left with a vision burned in my mind of four cats, paws up in the air, snoring underneath the piano...A wild time was had by all and it started up again the next day!",
      "rating": 5.0,
      "verified": true,
      "author": "I. McClain",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Order more then one!",
      "text": "We have two farrow cats that we adopted after ours passed. We have been purchasing the bananas for years. I figured I would give a shot on the two new cats. It was a hit. We ordered a few and put two on the floor. The cats checked them out and play with them all the time. With two there is no fighting over who gets to play first. The find the shape easy to hold and bite and kick. The catnip in side must be some good stuff. They like it more then the stuff I purchased at the pet store. We have farrow cats that live outside and they also enjoy the bananas! i",
      "rating": 1.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Best Cat Toy Ever (If It Arrives In A Bag)",
      "text": "I buy these every single Christmas for my now senior cats, and they love them. They are, by far, their favorite toys, and they continue to play with them throughout the year. They toss them around, lay on them, drool on them, etc. They end up very well loved by the end of the year. However, each year, one arrives in a protective bag, and one does not. The one that doesn't is always filthy and looks like it’s been dragged across a warehouse floor. So I always have to request a replacement for the dirty one. Aside from that, if you can get a clean item, these are amazing. I don’t buy any other toys for my cats.",
      "rating": 4.0,
      "verified": true,
      "author": "NHL",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Cats love this toy!",
      "text": "This toy is my cats favorite by far. I’ve gotten others and even when they’re brand new, my cats go back to their chili pepper. They drag the peppers all over, and try to kick them into submission constantly. None of the peppers has lost the fight to the cats teeth and claws, unlike other stuffed toys. I buy “replacements” but ... I haven’t had to actually replace one yet, so there are peppers all over.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelcat",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "My cats are obsessed !!",
      "text": "So my cat must have smelled this toy she tore it out of the box and I found her playing with this with the packaging still intact so cute and funny. All of my cats are obsessed with this one of my cats grooms the feathers . It has been so fun watching them play with this for hours. The only thing I hope to be improved is that the toy is in packaging then also has three white tags on it they can be hard to get off so I accidentally tore the toy but otherwise 5 stars",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "cat nip carrot",
      "text": "My cat Grace loves these, just ordered her another one plus another snuggle toy, she's just a little over two and sadly her brother didn't make it till two, some weird disease (heartbreaking) at night she snuggles with me, but durning our cat naps I'll often find her snuggling with this, so sweet, she loves to roll around with it too, def worth it, melts my heart. Just ordered her a small kitty catnip toy, to see if she'll enjoy that as well. This carrot for under 4 bucks, so worth it to see the joy it'll bring to your cat :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lanelane",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "cat loved it",
      "text": "My 7 y/o black cat immediately drooled on this chili and rubbed his face all over it. I'm worried about cleaning it because he's clearly rubbing his pheromones all over it. After a week or so, the initial excitement wore off, but he still loves it. It was so fun to watch him enjoy it that i bought one for my friend's black cat and he went nuts over it as well. Will definitely buy more.",
      "rating": 5.0,
      "verified": true,
      "author": "Rugbygirl4",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "OMG, they loved it!!",
      "text": "I originally purchased one of these to send in a “crazy cat lady” swap box, and my cats went absolutely nuts trying to get it out of everywhere I tried to hide it to keep them out of it, so I ordered another one for them! They promptly both attacked it! Throwing it around, pouncing on it, scratching it with their back legs while they held it, and ultimately rubbing themselves all over it! There is no stuffing, it is completely FILLED WITH CATNIP!! It’s an amazing toy if your kitties like the nip! Quick tip: buy more than one!!",
      "rating": 5.0,
      "verified": true,
      "author": "schmoozal",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Cats Love Them and They Hold Up Well",
      "text": "I bought the chili one for my cat and my newly adopted 7 year old cat loved it so much. They like to bite them while they hold and kick them, so I bought the banana one and another chili. The banana one was hit with both of them right out of the package. The toys hold up well and haven't come apart yet. When one cat stops playing with the banana, he lays down on it for a while. so the other cat can't play with it. Another banana one is on the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindy R",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Great product for people and cats",
      "text": "Oh man, the cats love this thing. I have 2 rambunctious cats and also bought the cactus (as well as the pepper). The toys look super cute in the apartment, aren't objects which hurt when you step on them (a manor plus for cat toys), dont easily get stuck under the couch, and seem to really engage my kibbies. I can grab a toy and use it as a way to train a cat to go somewhere, by either tapping the destination with it, or tossing it into another room. Great product for people and cats.",
      "rating": 5.0,
      "verified": true,
      "author": "TheCourteousGenevievez",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Favorite toy of two separate cat families.",
      "text": "I gave this chili and banana cat toys as a gift to a friend's cat family. Those cats loved it! I purchased the chili and the banana for my cat family and my cats likewise just love them and play with them daily for extended periods of time. I was surprised at just how much my cats enjoyed these toys. More than any other catnip stuffed toys I have purchased for my cats. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Marianjm",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "This is not good because my cat will not use something that has ...",
      "text": "I was under the impression that I was ordering a brand new product and instead I get a product that comes in a plastic bag that already has puncture marks in it. This is not good because my cat will not use something that has another cat scent on it that is why he has his own special toys. Pictures attached. I did check my order and it is for a new product so I do not know why I have gotten one that is obviously used",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda S.",
      "helpful_votes": 2,
      "publication_date": 20180501
    },
    {
      "title": "My cats....LOVE cat nip toys especially this one!",
      "text": "I had one of these banana cat nip toys before and one of my cats (who has claws like a TIGER) finally destroyed it after playing with it for a good two years. I got this new one out of the package? Three of my house panthers immediately pounced and played and wrestled with it. So, three of my house panthers give it a \"PAWS UP!\" for catnip and for being a great playtoy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brandt",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "plastic tag fastener/tie - good luck",
      "text": "two tags connect the toy to the cardboard and both are attached to the toy from the inside of the fabric - so there's no way to totally remove it. horrible way to pkg a toy that cats chew on - i had to do my best to wiggle the remaining sharp piece of the tag down into the catnip so that it will not scratch them. what stupid people. won't buy again - will go back to the Yeowww! catnip toys.",
      "rating": 1.0,
      "verified": true,
      "author": "from maine",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "My old man cat loves it!",
      "text": "My cat goes crazy over his catnip carrot toy! He is 10 years old and when he gets his paws on the carrot he acts like a kitten again! I love it! You can’t beat the price that for sure. It’s good quality but mostly importantly the cat approves.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsTiffanyV",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "quickly developed a hole in the same place on two identical items",
      "text": "I had one of these gifted to me and my cat was obsessed with it, but it developed a hole and catnip started spilling out, so I decided to purchase another. I was disappointed to find out that this new one I purchased also quickly developed a hole in the same place the old one had. I think maybe the seam is weak on these, as my cat didn't really play rough, just liked to lick it and chew on it a bit. I hate to give a low rating, but I wouldn't buy this again because it only lasted a few days.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria Pierobello",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "A toy your cat will actually like, maybe even more than the box it arrives in",
      "text": "Our cat LOVES this toy. She goes at it with her back paws and rolls around with it. Sometimes she grooms it, licking at the feathers, which is honestly adorable. Only complaint is some of the feathers fall out almost right away. We try to stick some of them back in lol Since she bats it around on the floor the fabric gets dirty; will need to replace after about a year",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Renee",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "It must smell really nice",
      "text": "So...I had this in a box with something on top of the box because I was going to give it as a gift. My cat(s) found it and managed to get it out of the box. When I got home it was in the middle of the floor, covered in slobber. It’s big enough that they can wrestle with it a bit. The material seems durable enough. My only compliant would be that my cats either sick or drool on it enough that it is a soggy, ugly, dirty mess. But, they definitely enjoy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Bought 2 and Cats Ignored Both",
      "text": "I’ve got 2 very playful cats who are catnip fiends, so I always get them catnip-filled toys. I thought these would make great kickers. I bought each cat one pepper (so they wouldn’t fight over it), and neither cat cares for them. They walked away from them after checking them out. Thinking the catnip wasn’t strong enough, I dipped them in extra catnip and while that got their attention, once the nip was gone, they were over it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah B",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Seams are weak",
      "text": "We are the slaves of an eighteen months old Orange Tabby. This handsome lad is destructive when he gets bored which is often. We decided to get one of these bananas to divert his attention when bored. He loved it for about 15 minutes, biting and rabbit kicking it. Then on to other things. Hours later he came back to it. About 10 more minutes of rough play and cat nip was spilling out at a seam. If your cat is docile this toy might work for you but it is not sturdy enough for us.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob83+",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Wrong color, too thick, too little catnip, or wrong type of catnip but ZERO interest!",
      "text": "I’ve purchased numerous catnip toys for my cats so thought this would be just another winner for at least one. So wrong! I don’t know if the material is too thick, too little catnip, stale catnip, or wrong type of catnip but all of my cats (I have 3) had zero interest in the toy. Originally, when it came out of the box they were interested as it was something new, but after a few sniffs they pretty much walked off. If truth be told, the box it came in was more interesting! What can I say, it's a cat thing! Major disappointment for cats, well constructed cat toy.",
      "rating": 2.0,
      "verified": true,
      "author": "Lokiamus",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "This toy is a winner. Completely filled with catnip!",
      "text": "This catnip filled carrot has been my kitty's number one favorite for years. She has a basket filled with toys (including other catnip toys) and this is the chosen one. She even likes to sleep near it or rests her head on it like it was a pillow; it is ridiculously cute! I buy a new one every several months just to refresh it and she knows what's in the box before I even open it when the new one arrives.",
      "rating": 5.0,
      "verified": true,
      "author": "seacoast gal",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "My cat is in love with this toy.",
      "text": "My cat just loves this toy so much that I purchased this several times now. The only issue with this is the feathers come out easy so after she first plays with it for 10 minutes, you are just left with the orange part. But overall, she can't get enough of it even though she is a picky cat. (she won't play with most of her toys.)",
      "rating": 4.0,
      "verified": true,
      "author": "Sabina P.",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "My cat is crazy over this chili pepper!",
      "text": "This is a great cat toy! My little girl is allllll over this thing, and she wasnt really big on toys before! She tosses this thing across the room and pounces on it and rolls with it! Its wonderful to see her so playful! The chili is about 4 inches long, and maybe 1 inch diameter.. sturdily made cause it is holding up to her tearing into it! Smells like catnip (yum) and is bright red so it is quite visable in low light.. Nope, that is NOT something she dragged in the house! Thank goodness!",
      "rating": 5.0,
      "verified": true,
      "author": "911Trisha",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "OurPets 100 Percent North American Catnip Filled Cat Toys",
      "text": "My cats absolutely _love_ this chili-pepper \"Hot Stuff\" catnip toy. It fascinates me to watch them grab it and clutch it between their paws--and hold it there for a minute or two. Their interest in _this_ toy is much more than is typical, and it's fun for me to see how much fun they have with it.",
      "rating": 5.0,
      "verified": true,
      "author": "bardahl",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "My Old Boy's FAVORITE toy",
      "text": "my 13 year old furball boy has been loving this Chilli Pepper toy for years!!! Every year for Christmas he gets a new one in his stocking-- he will not share this toy with any other of his siblings (3 other cats in the hosuehold)-- he will legit curl up with the pepper in his arms and fall asleep!!",
      "rating": 5.0,
      "verified": true,
      "author": "lisa m.",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Overall a great toy for cats; not as good for cats hard on toys.",
      "text": "I have a Balinese cat who LOVES catnip toys but is also aggressive with them. He has another carrot toy I bought on Amazon (furry and you can put catnip in) so I thought he'd love this. As soon as he got it, he went off the charts crazy with it. Unfortunately within 30 minutes he had torn holes in the seams and catnip was starting to come out. Now my cat is unusual and has some issues coming out of a hoarding rescue situation, but he is a testament that this is a fantastic toy. Just not a great one for a cat who is hard on toys.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Citro",
      "helpful_votes": 2,
      "publication_date": 20161103
    },
    {
      "title": "Excellent quality for price!",
      "text": "My cat went nuts for this! Absolutely worth the price to see him rolling around and bunny-kicking it. The canvas material holds up pretty well to chewing and the feathers (surprisingly) have stayed intact and just need to be re-fluffed now and then. Unfortunately, after a couple days of play, one of the side seams torn open a tiny bit, but nothing that couldn't be repaired with a couple stitches. Overall, my cat highly recommends.",
      "rating": 4.0,
      "verified": true,
      "author": "Schvice",
      "helpful_votes": 3,
      "publication_date": 20170805
    },
    {
      "title": "Weak Stitching Doesn't Last",
      "text": "I've ordered two of the chili peppers now. The first split on the seam within 48 hours of my cats playing with it, spilling the catnip everywhere. Given all the positive reviews, I thought that must have been a fluke. Nope. The second one just split less than 24 hours after giving it to my cats. They would otherwise love this toy, but the stitching is not strong enough to hold up.",
      "rating": 1.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "My cats love these",
      "text": "Seriously. Way more than any other toys. I'm not sure what makes them so special, but they're amazing. The fabric is thick and lasts a while. I buy a new one or two every six months or so. So far, a few have been destroyed, but mostly the catnip wears out or they get dirty beyond toleration.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Very catni-y my cat loves it",
      "text": "Oh my God catnip Heaven my cat won't play with anything else that I buy except this then she goes crazy for awhile runs all over the place with her eyes real wide and chases things I can't say. I called this banana man and she loves it. She's an old cat too and she doesn't even play but you'll play with this. :)👌😎👌😎👌😎",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Consumer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "BEST cat toy ever!",
      "text": "Murphy LOVES his carrot!! He has had 2-3 since I bought the first... but still loves the dirty, battered, much loved original! Sometimes I sprinkle them with catnip and he really goes crazy - but the plain carrot is far and away his favorite toy! If he’s lucky (and fast!) his brother Mystic is occasionally able to steal one away to play with himself! A BIG BUY!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia in Marin",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "My cat's favorite toy",
      "text": "I have had a hard time finding this item at my local pet stores. They got out of stock. I guess they locally were not popular but my two cats adore these catnip bananas. When I brought them home from the post office, they went crazy playing with them, one for each of them. My Siamese and our orange and white cat both get their own and they adore them! I will probably buy these again when they wear these out! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Coco",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Best purchase ever!",
      "text": "My cats are very picky about the toys they like to play with. These toys were a hit right out of the package! My sister bought one of our cats the carrot and I bough our other cat the pepper. They’re both well made, and can stand up to the most vicious of cat bites and kicks. They go nuts for these toys! I would highly recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Cerna",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "4 Paw Approval",
      "text": "My cats are OBSESSED with these carrots. The catnip is potent and they can take a beating. They even play with them after they have ripped the seams open and lost the catnip, yup that happened. My cats go ALL OUT when they kick these things so it's definitely not a quality issue, I think one of their nails acted like a seam ripper. It was a mess, but it was only 1 of 4. If they are happy, I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie S.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "She LOVES it!",
      "text": "Who thought a carrot could bring so much joy? This is our second one. The first one is still holding up fine, but she loves it so much we thought we’d get her a new fresh one. Even though she ignores other toys, she’s regularly rolling around with this carrot, kicking it, and having a great time.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Olson",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Kitties love them!",
      "text": "Getting these on a Subscribe & Save because I have two young cats who absolutely love them. They play with them constantly - often taking it away from each other. They bat them and bunny kick them and I have yet have one come apart. They seem to lose their effectiveness though - the catnip inside loses potency? They seem to ignore it after a couple of months - the reason for the Subscribe & Save.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "cats love these",
      "text": "cats love these, granted they dont play with them all the time, but when they get frisky, they like to play with these. its funny how they hold it with their front paws and kick/scratch with their rear paws. build quality is solid. ive tried different shapes, the chili is the winner",
      "rating": 5.0,
      "verified": true,
      "author": "natataka",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Durable, Good Catnip",
      "text": "My Maine Coon Kitty (aka large fluffy cat) loves to hold this in her front paws and kick it with her back paws. Thank goodness it is make of a thick durable material! She also really likes to rub her face on it because of the catnip. 10/10 would recommend for your catnip loving kitty.",
      "rating": 5.0,
      "verified": true,
      "author": "Hugh",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Strong durable material!",
      "text": "One of the toughest catnip toys I found and they love this brand of catnip! Wish they were refillable. Note this catnip is super strong and will make your cats go crazy! Sometimes these toys will last days and other times hours. I suggest if you have cats like mine to only allow them to play with it when you are around. I have had a few break open and it can get messy.",
      "rating": 5.0,
      "verified": true,
      "author": "NYY_fan23",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Spoiled cats approve!",
      "text": "My cats love the Our Pets catnip toys and this one is no exception. All 5 of my cats love rubbing their face on it and using it as a kicker. The catnip is nice and potent and lasts a long time. I will squeeze the fish now and then to release the catnip smell and entice my cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa M.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "The cats are obsessed",
      "text": "I have 3 cats - 2 older and 1 younger. The younger will play with anything; he just loves to run around. The older tend to give toys absolutely no mind. But when this arrived in the mail, they were suddenly very present - even sniffing around the bag! I opened it up and they immediately took to rubbing against it, tossing it around, carrying it through the house. It became an instant favorite and I've already purchased the other designs!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "All my cats love this!",
      "text": "I bought this when my kittens were at that grab on with all paws and roll around stage, it was the only thing about the right size. This is the only toy never lost. Just when I think it's gone for good it reappears. All my cats love this carrot but my kittens are now big enough to carry it around. I don't know what it is about this thing but a bought more because they love it. Kittens are grown but I still come home to a cat or two carrying one around. Survived 8 months with 3 kittens and still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "NikkiOK",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Sturdy pepper, flimsy leaves",
      "text": "Both of my cats LOVE this toy. I don’t know what it is about this particular cat nip toy compared to others but this chili pepper has got it going on🌶 💃🏻 1 cat is super gentle with it where the other is a complete monster. The pepper itself holds up pretty well but the green felt at the top (the stem/leaves) are no match for a rough feline.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel ",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Cat nip chili peppers",
      "text": "Our kitties love these peppers! We have 4 cats so we bought 4 peppers so they wouldn't have a \"kitty-smack-down\" session with each other. As soon as I open the cabinet they come running from across the house. I store them in a zip lock bag after they're done attacking them. This is a very well made product and is lasting longer than I thought it would. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 5,
      "publication_date": 20160226
    },
    {
      "title": "Cat Loves It",
      "text": "My cat has a thing for catnip. He will go crazy for it no matter what. We bought him a similar product for Christmas, and months later he had torn the thing apart but was still laying with it. I wanted to get him another one, but one that would last and that wouldn't get torn up. When I pulled it out of the packaging, he went insane. His old toy was forgotten. For the price, and the product quality, plus the reaction of my cat, this is a must-buy for any cat that loves catnip.",
      "rating": 5.0,
      "verified": true,
      "author": "Jude Vanne",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Cats approved",
      "text": "Never thought I’ll see my cat so happy with a toy so bought for them. Both cats I own love this. Ironically, unlike some reviews here, it has been very sturdy for my feline companions. Over a month now and the toy is still intact. It’s covered in slobber and pet hair but no wholes. And teeth whole are easily stretched away. Wipe with a damp cloth to clean and return to cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian Lioness",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Kitty approved",
      "text": "My cat can smell this a mile away. I have a bin for a few toys and treats in my kitchen, he will climb into it and pull this thing out and go nuts with it for a good while until he tires out. It’s adorable to watch. He’s not usually one to play with toys but he’s loving this one!",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great price- no fluff",
      "text": "I saw the the catnip banana in a store and though it would be a great teething toy for my new kitten. When I was looking on Amazon I found other shapes. This is a little smaller than the banana from a different manufacturer but still the same great quality. It is only filled with cat nip, no fluffy filling, so it has a dense texture and has a thick fabric in the outside. Seems durable and effective as a teething toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Just Get It",
      "text": "My cat typically does not like catnip, he seems unbothered by it and just walks away from most catnip infused toys or sprays. However, he is going absolutely nuts over this toy. Rolling around, gnawing at the end as though it’s a real carrot and he’s a hungry bunny. As I write this he is flopping around with it contently. At the same time I presented him with this toy I gave him two of his known favorites (a little raccoon & those fake birds with feathers that make chirping sounds) and he’s blatantly ignoring them in favor of this (slightly comically large, for a cat toy) carrot.",
      "rating": 5.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Cats are drawn to it!!",
      "text": "When I bought my first pepper toy, I had no idea how popular this toy would be with all of my cats. They would physically fight over it, so I bought 3 more. The original ones that are now 4 years old are very well used and look like they are well passed being played with, but NOPE! My cats STILL love to play with them. I have 9 cats and more cat toys than one household should ever have. This is THE most played with toy. I am now buying 3 more. Love this cat toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra K. Blanchette",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Favorite Toy",
      "text": "My cat drags this around with her. She loves it. If the chili pepper is in the room , she is somewhere close by. It smells very cat nippy, and this is why she loves it. It makes her \"happy\" We all like a nip now and then, she just likes hers all the time. Best and most used toy I ever gave her.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Cats love it!",
      "text": "I have bought four of these over time. The cat loves it--it is her go-to toy. It will last pretty well, but she is rough with it so I replace when I see holes. I read somewhere that cats love the color blue. That, along with it's perfect size for a kitty, and the pure catnip it is stuffed with makes it her favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Faucett",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Cat loved it, but the seams need re-enforcing",
      "text": "Cat absolutely loved this toy, was constantly chewing on it to the point I had to take it away so it could dry out from all the kitty drool. My complaint is that the seams didn’t hold up very well through all his playing/chewing . Started to leak cat nip out the seam after a few weeks. A simple fix for me to stitch back up, but expected a little more durability",
      "rating": 4.0,
      "verified": true,
      "author": "Sam A",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Cat Insanity follows purchase",
      "text": "I bought this for one of my three cats. Since purchase I find that the other two cats love the bloody thing and it mysteriously shows up all over the house. I'm a day sleeper so I watch them run around the house with it play some insane kitty version of keep a way. One runs through with it and a few minutes later one of the other two will have it. Makes for fun late night TV.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramsey Henderson",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Best cat nip toy hands down",
      "text": "My cat really goes nuts for cat nip but also would make a mess rolling around in loose cat nip, so I was really looking for a neater but still fun solution. This toy neatly encases the cat nip in an elongated carrot form which really is the ideal shape for cats to be able to cuddle and really revel in the cat nip. I love the details like the feather end which adds to the playful, sensory experience. The tweed fabric is sturdy and also a nice, luxe touch that feels quality and like it will last. A great price for endless, blissful entertainment for my cat!",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Kong",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Hooked on the C",
      "text": "Our cats LOVE the carrot, this is not our first carrot. In fact, we've had two others that got so much love that they just got too gross and needed to be replaced. (Not the product's fault -- there is only so much you can do against cat slobber!)",
      "rating": 5.0,
      "verified": true,
      "author": "S.R.",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "still going after 10 years, guess they earned a new pile o' bananas",
      "text": "We call this the stinky banana. It has been in my home for at least 10 years and still gets regularly hauled around to the point of us buying 4 more just to blow their kitty minds that life could be so good. It is filled with only catnip, no fillers and it is OBVIOUS. Lol what cat toy on the planet would hold 4 different cats attention for 10 years?! Buy this stinky banana. U will be happy you did.",
      "rating": 5.0,
      "verified": true,
      "author": "Mischief",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "LOVE!",
      "text": "I just tossed it on the floor and randomly both cats find it and rub themselves all over it and toss it around. No, they do not obsess over it, but it's funny to see each of them (age 13 and 3) come over to it and roll around on it. lol.",
      "rating": 5.0,
      "verified": true,
      "author": "avidreader",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "My cat loves this!",
      "text": "My cat loves catnip & this product does not disappoint. It's one of her favorite toys, along with the pepper & carrot filled with catnip. Only problem is she plays so much and so tough they don't last as long as I'd like (hence buying all three). She bites & puts her claws into the fabric so there are many holes and it gets extremely dirty from where the catnip comes through those holes. So, my only complaint is that I wish it was a little tougher.",
      "rating": 5.0,
      "verified": true,
      "author": "V Hall",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Lifetime purchaser of this catnip toy!",
      "text": "This is my third one. My cats maul this pepper like crazy andy larger cat carries it all over my house. High quality catnip drives them in sane. When it gets a little ratty looking I just order another one, but they still play with the old ones too. The catnip seems to never lose it's potency.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna M",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "My cats love these!",
      "text": "Both my cats love these and one of my two rarely even plays with toys but she loves these, as does my regular player who has several favorites, including all my hair ties. They chewed their original two bananas and two chilis to death. The carrots are barely hanging on. I am getting 6 more, 2 bananas, 2 red chili peppers and 2 carrots.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia Louis",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Price More Than Tripled...",
      "text": "I bought one of these as an order add-on for $3.59. My cats loved it, slobbered all over it, and eventually worked their way through the material -- catnip everywhere! I didn't mind though, anything to keep the kids happy. I logged in to buy another only to find that it now cost $14, huge price increase and it definitely isn't worth that price with how fast my cats got into it.",
      "rating": 3.0,
      "verified": true,
      "author": "ChristinaUSMC",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "My two kitties like them!",
      "text": "I purchased the orange carrot and the red pepper(?!?). Both my kitties like them! When I hear a cat licking something, I usually find one of them holding it between her front paws and licking it or otherwise playing with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Thin outer material stuffed with catnip!",
      "text": "Material is thin but holds ok considering the toy is totally stuffed with catnip. I've bought 6 of these the past 4 years and two of them had loose stitching so that the catnip started to come out a bit. No worries, the cats love these. Grab it and squish it to rejuvenate the catnip!",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Cats loved it!!!",
      "text": "My cats are very picky creatures And rarely like toys so I didn’t have high hopes for this one. When it arrived my male cat grabbed it as soon as it hit the floor and carried it around with him for days so the other cats wouldn’t take it. The other 2 liked it also so overall great find!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Power of the Nip",
      "text": "Put nip in anything and my cats will love it. They were playing with this toy right out of the box. It's the perfect size for them to cling on to and rub their faces on at the same time... even get a good kick or two in. It actually got kinda gross after they had rubbed and slobbered their faces on it hard enough that it was soaked with saliva. Even despite that the toy has held up extremely well with no breaking down. A++",
      "rating": 5.0,
      "verified": true,
      "author": "BoJam",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Cat Approved!",
      "text": "Must have some strong catnip in it, because my cats tore through the box and got to it before I did. They shredded it up, tore out the stuffing, chewed the ends and it made them go nuts! They'd give it 5 stars judging from their reactions. As sturdy as the average catnip pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle and Jessie",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "This weird little toy is a winner!",
      "text": "I have no idea what kind of catnip is in this thing, but my cat freaked out for it. He's obsessed! After licking it and playing with it to death, he's finally less into his banana. He still plays with it sometimes, though. This weird little toy is a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "FireBringer",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Strong catnip odor",
      "text": "Cat went nuts for this. As soon as it got close to him he started reacting to the catnip. I'm ordering him another one. These are cute designs.",
      "rating": 5.0,
      "verified": true,
      "author": "AngelaR",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Best catnip toy ever",
      "text": "All the family cats love this thing i have bought so many carrots over the years super durable and the catnip is like magic just smack it around a little to reactivate over and over and over and over..... i once recieved a damages one the stitches were skipped at the bottom and the catnip was leaking out. Amazon shipped me a new one immediately and said keep the old one. Mom sewed it up its still in comission to this day.",
      "rating": 5.0,
      "verified": true,
      "author": "Momo",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Absolutely Worth It",
      "text": "I have 2 cats, one who had no interest in catnip and the other one loves it. The catnip in these toys are so strong that it not only got both cats enthralled with the toys, the will leave it soaking wet with slobber and have chewed it apart to get to the strong catnip. The quality is better in the $3 Hot Stuff pepper than the $20 toys I've bought them from the box store. Will be purchasing another 2 toys to replace the heavily worn out toy from 2 years ago. I've had to restitch the toy occasionally but its worth it with how much enjoyment my cats get out of them.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristyn Recknagel",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Good chew toy for cats",
      "text": "This is my cats favorite toy! Had been looking for something to get his chewing energy out on. Whenever he’s playing w me and starts to bite on my hand I grab this pepper and it totally distracts him and he will naw on it for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Delvescio",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "One of my cats fav.",
      "text": "Both of my cats are obsessed with the pepper! I had to buy a second one. They also love the cactus as seen in the photo! They both kick it, bite it, roll around on it, and sit/lay on it. Despite the constant use and biting from my cats there have no no holes, leaking of catnip or anything. Had held up well. Fully recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Awesome catnip toy",
      "text": "My old girl Poppy LOVES this brand of catnip toy. This carrot is wonderful. It is chock full of catnip. She loves the shape. The green feathers didn't last long, but she had fun pulling them off. She loves to viciously play with her carrot, and then lay on it for awhile, and then cuddle it while she's sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "jftw",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Lasts for a few weeks",
      "text": "My cat loves it. When new, it's extremely firm and packed to the seams with what I presume is catnip. After chewing it up for a few weeks, the toy becomes considerably flaccid, almost as if the quantity inside has decreased somehow. Not sure how that's possible, but the volume definitely decreased and my cat isn't as interested in it anymore. I guess the catnip got crushed and lost its scent, so there's a lifespan for this toy of a few weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Noonoh",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Cats Love THIS - Never Last Long",
      "text": "My cats adore these types of toys. They typically do not last long because they want to tear it up ASAP. However, I will continue to purchase them because they clearly enjoy them very much. The feathers are still in the carrot as well, which is amazing, considering my cats usually tear feathers off of toys first thing. Of course some have fallen out, but there's quite a few left! :)",
      "rating": 5.0,
      "verified": true,
      "author": "The Cat Mom",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "My cat opened the package without my knowledge . There’s your proof of quality!",
      "text": "My little guy literally chewed holes in the shipping package to get to his reward! I didn’t know why he was going crazy but as soon as i opened it, i understood. What more can i say about a catnip toy. My cat proved that these toys make him happy! What more could a cat owner desire? Happy cat, happy owner.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "My cat is obsessed!",
      "text": "Got this for my cat as a Christmas gift and she is totally obsessed with it! She has weak teeth so I was a little worried about her biting it and her teeth getting stuck in the material but that has yet to happen. It is a good size and I would definitely buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisha",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Great toy!!",
      "text": "Great toy . My cat won’t leave it alone! Immediately started hugging and licking it. These toys last a couple of months to a year,before needing a new one. This is just because how much use it will get !",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Kazel",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Already split a seam",
      "text": "I had expected the cat toy to last more than a few days. Threw it out yesterday (Thursday) After receiving last Friday. So less than a week. It was cute and seemed durable at first glance, but a few days with a rowdy kitten and the Chile pepper was toast.",
      "rating": 1.0,
      "verified": true,
      "author": "ReaderCustomerHonestReviewer",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "All my pets seemed to love it!",
      "text": "The adult cats were rolling on it, nuzzling it, trying to get to it in their stockings before Christmas. The dog loved it too though, and chewed it up. The catnip must be powerful though because even after vacuuming it up, the cats still roll on the rug.",
      "rating": 5.0,
      "verified": true,
      "author": "Prime member",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Cats love it",
      "text": "I seriously don’t know what it is about this carrot but my cats love it. They don’t usually take to toys like this one and my friends cat had the same reaction - they run their face on it and lick it! I’ve tried other catnip toys but they like this the best. It’s a good size and doesn’t get lost under the couch. It does pick up dirt but I think that’s a sign I need to clean more!",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Adorable but some cats may not respond.",
      "text": "It’s adorable extremely durable because my CAT has NOTHING TO DO WITH this TOY! Are y’all sure it contains “catnip” maybe this has “dog” nip or bird nip ....never the less she has NOTHING to do with the poor toy . But it’s adorable 24 Karat lol and definitely durable... I’ll donate it to somewhere like ALAQUA",
      "rating": 1.0,
      "verified": true,
      "author": "C Shaffer",
      "helpful_votes": 0,
      "publication_date": 20190504
    }
  ],
  "product_meta": {
    "title": "OurPets 100 Percent North American Catnip Filled Cat Toys (Interactive Cat Toys for Indoor Cats, Kitten Toy,Cat Chew Toy & Catnip Toys for Cats) Great for Cats who Enjoy Catnip & Interactive Cat Toys",
    "description": "Color:Hot Stuff| Style:OurPets 100-Percent Premium North- American Grown Cosmic Catnip Cat ToyOurPets Cosmic Catnip has been grown to achieve the strongest, most aromatic catnip ever produced! When catnip is pinched, the aroma stored in the dried leaves is released, driving cats wild! Catnip is a 100% natural herb that stimulates a harmless, playful reaction in most cats. The action of a cat playing with this catnip-stuffed toy will release an energizing aroma for long-lasting play.",
    "rating": 4.6,
    "feature_bullets": [
      "TRY THEM ALL: The OurPets 100% Filled Catnip Cat Toy collection comes in 7 different styles of cat toys. The Carrot, Banana, Fish, Snake, Cigar, Cactus & Chili are 100% filled with North-American-grown Cosmic Catnip to satisfy your kitty's need to play!",
      "CATNIP FILLED: OurPets North-American-grown Cosmic Catnip has been grown to achieve the strongest, most aromatic catnip ever produced! When catnip is pinched, the aroma stored in the dried leaves is released, driving cats wild!",
      "INTERACTIVE CAT TOY: The OurPets Cosmic Catnip Cat Toys encourage physical play & mental stimulation by appealing to your cat’s natural instincts. Your cat is ensured a fulfilling play experience by providing a cat toy that has an enticing catnip scent",
      "MENTAL & PHYSICAL STIMULATION: Cats need mental stimulation from play to keep from being bored and to fulfill their hunting instincts. Physical activity from play acts as a workout, keeping cats physically fit and enriches the pet’s quality of life",
      "RELIEVES STRESS, ANXIETY & BOREDOM: Play provides more than just exercise it also relieves anxiety, stress, and boredom. When indoor cats do not have cat toys to play with, that is when they supplement their playful instincts with destructive behavior"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.5 x 1.25 x 6.5 inches; 1.6 Ounces",
      "Item model number": "1050011545",
      "Date First Available": "July 8, 2011",
      "Manufacturer": "OurPets",
      "ASIN": "B005BP8NB2",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Catnip Toys",
      "Toys",
      "Pet Supplies",
      "Cats"
    ],
    "price": 3.95
  }
}