{
  "website_summaries": [
    {
      "verdict": "The perfect choice for L'Occitane lovers who want the brand's impressive moisturizing benefits without spending a lot of money on a small portion.",
      "pros": [
        "The super-rich formula and generous 10-oz",
        "pump bottle goes a long way when it comes to moisturizing dry hands",
        "Fans rave about the lavender scent"
      ],
      "cons": [
        "Not quite as thick as other hand creams by the brand, but this characteristic doesn't seem to having any bearing on its effectiveness at moisturizing dry skin"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Product, Horrible Packaging!",
      "text": "I can't say enough about how my wife loves this product - one of the best skin products going. But when she gets about halfway down, the product refuses to come out through the pump. It's either a problem with the pump or a problem with the lotion, but it ends up costing twice as much since it's all but impossible to use the second half! Not buying this again. Readers will note that this is my first one-star rating....",
      "rating": 1.0,
      "verified": true,
      "author": "SabreSailor",
      "helpful_votes": 47,
      "publication_date": 20180325
    },
    {
      "title": "Good stuff, clean and fresh sent",
      "text": "They only issues I have with this is when the product gets low, around the bottom 1/4 of container, the pump no longer picks up and pumps out the lotion. Not good for such a premium and expensive product. I have purchased these many times as the product inside is great, just unfortunately hard to get your full money's worth. you have to work at it and tap and bang on the counter to get all of it out. Pump needs to be better and or solved to work more fully. You will like this lotion, feels great on your skin, smells clean and fresh",
      "rating": 4.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 55,
      "publication_date": 20150324
    },
    {
      "title": "Ideal viscosity",
      "text": "The viscosity is ideal. Not an overpowering scent but it smells good when I get a whiff of it. Absorbs well into my skin and lasts for a good 4-6 hours depending on how many times I wash my hands. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Renn",
      "helpful_votes": 12,
      "publication_date": 20190207
    },
    {
      "title": "LOVE this",
      "text": "Second purchase, the texture is perfect, moisturizing but not greasy. If you like the sent of lavender, as in the plant, this is the closest I've found. The sent starts strong, which is great right before bed, but fades quickly so that not everyone around you can smell it. LOVE THIS LOTION",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne",
      "helpful_votes": 9,
      "publication_date": 20190621
    },
    {
      "title": "Luxurious",
      "text": "I got hooked on L'Occitane products traveling around Europe a lot and love being able to purchase on Amazon when I'm in the US. Their products are not cheap but are quality and you use a lot less. This has a silky feel and a mild but lovely scent. Prices are comparable to duty free shopping if you have Prime. I buy for me but purchasing a few prodcuts would be a great gift. When you can go to the store they have select promotions, but until then, buy them here!",
      "rating": 5.0,
      "verified": true,
      "author": "OutAndAbout",
      "helpful_votes": 4,
      "publication_date": 20200408
    },
    {
      "title": "Love!",
      "text": "Absolutely love this lotion. Way over and above drug store lotions, and although it’s more expensive you are definitely getting a much better product. It soaks in to your hands leaving them super soft, not greasy at all. The scent is a lovely, soft lavender that lightly lingers. Highly recommend! Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "BSG",
      "helpful_votes": 3,
      "publication_date": 20200208
    },
    {
      "title": "pump doesn't work well when half is gone.",
      "text": "I love the bottle, it's a square shape...I like that. It's smells wonderful. It is a good product. On the negative side, when half gone I have to take off the screw on pump because it won't come out of the pump at this point, so the convenience of the pump is gone. It is quite expensive too. Because of this I won't order again.",
      "rating": 3.0,
      "verified": true,
      "author": "Arlene Chase",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Wonderful product!",
      "text": "This is the most LUXURIOUS and divine lotion. I bought it as a gift and kept it (nice friend, eh?). The lavender essence is just marvelous--not sickeningly perfumey. It's one of those products that you love so much, you keep smelling yourself, it's so nice. This product, like ALL of L'Occitane products, are rich and makes your skin feel sumptuous.",
      "rating": 5.0,
      "verified": true,
      "author": "Walden",
      "helpful_votes": 16,
      "publication_date": 20150523
    },
    {
      "title": "Great scent, nice feel",
      "text": "Probably overpriced for what it is -- I've made my own hand cream when I've had the time, no less good than this -- but I wanted a squat pump bottle for my bedside table (nothing tall and tippy), with a good-quality cream, and I knew that L'Occitane would not disappoint. The lotion has a lovely scent, which to my mind suggests tangerine essence (I grow tangerines in my garden), but the label says 'Verbena': fine. Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "transponder",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Lavender smell is a little intense",
      "text": "My boyfriend always says I smell like an old lady when I use lavender... and this is the same. I was hoping it would be subtle, but it's more intense than I thought. Feels good, just smell is over powering. I prefer the regular one, will go back to that next time.",
      "rating": 4.0,
      "verified": true,
      "author": "A student",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Good product",
      "text": "Didn't think it was possible to have too heavy a lavender fragrance but this product hs one powerful scent. Like others from this company the quality is high. It's light, creamy and works. Will probably buy same product, different scent.",
      "rating": 3.0,
      "verified": true,
      "author": "Samorana",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Unpleasant. Not a Lavender fragrance at all, more pungent, for men.",
      "text": "Although the lotion is moisturizing, the smell is awful. At best it smells like a men's fragrance, but more like diluted Off insect repellent. It has very little lavender fragrance. My wife found it hard to remove the smell from her hands after washing several times.",
      "rating": 2.0,
      "verified": true,
      "author": "Gail C.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Addictive!",
      "text": "I love their hand lotions. This one I didn't even try before buying on Amazon, but I knew it would be great. It has such a nice scent. It's a nice Lavender smell, but then easily settles into a sweeter vanilla or Shea scent too. Love the size. The shape is cute, IMO, a chunky rectangle/ square. I leave this by my chair in the living room. Friends love using it when they see it. Will buy more! Oh, and shipping is amazing, as usual.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Villarreal",
      "helpful_votes": 12,
      "publication_date": 20131030
    },
    {
      "title": "Good product; good price at $20; nice fragrance",
      "text": "I've used many O'Occitane products. They never disappoint, but they can be pricey. This one, at $20, is a great deal. 10 oz doesn't sound like a lot, but it lasts a long time. The fragrance is light and pleasant. If you need something for ultra dry skin, this isn't what you're looking for, but if you want a lightweight, greaseless hand lotion with a pleasing scent, you'll like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "T.R.",
      "helpful_votes": 15,
      "publication_date": 20130620
    },
    {
      "title": "Love using this at bedtime.",
      "text": "I love the L'Occitaine brand and use many of their products. I like to use this one at bedtime. I find the lavender very relaxing and the lotion is very moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Light airy aroma",
      "text": "I love to go to the ritz Carlton bathroom soaps and this is my favorite lotion to pamper myself. It isn’t thick and has a light clean aroma that’s very calming.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Clark",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Five star",
      "text": "Absolutely excellent product! Lovely light lavender scent with no chemical smell, moisturizes well.",
      "rating": 5.0,
      "verified": true,
      "author": "s",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Wonderful hand cream, not greasy and absorbs quickly",
      "text": "The lavender scent isn't overpowering and the cream is perfect for replenishing the moisture in dry hands and feet.",
      "rating": 5.0,
      "verified": true,
      "author": "tallahasseelass",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Damaged!",
      "text": "I purchased this for a gift and unfortunately the bottle came damaged and “Un-giftable”. So unfortunate when you spend this money and then it arrives damaged 👎🏽",
      "rating": 5.0,
      "verified": true,
      "author": "Paula Hollingsworth",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Wonderful fragrance",
      "text": "I have bought repeatedly for myself and for gifts. If you like the fragrance, this will be very special as a gift or for oneself. It is a bit on the pricey side but lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Syringa",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Mmmmmm....",
      "text": "Nothing smells better. I love the fresh, bright, clean, citrus of this lotion. Nobody does verbena like l'Occitane!",
      "rating": 5.0,
      "verified": true,
      "author": "rh",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "Fabulous lavender moisturizer",
      "text": "Great fragrance of lavender and cream contains rich emollients. Quite moisturizing. Great anytime.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Freitag",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Best hand cream",
      "text": "I’ve tried a lot of hand creams and this is the best I’ve found. It’s great on my body too",
      "rating": 5.0,
      "verified": true,
      "author": "Shergie",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Package was damaged, not caused by shipping",
      "text": "I bought this as a gift for someone and the package was damaged. It wasn't caused by the shipping either.",
      "rating": 3.0,
      "verified": true,
      "author": "K. M. Humphrey",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Perfect in Every Way",
      "text": "I always love their products but now that I'm in the high desert I wondered how this would work and it does!! And of course the lavender scent never disappoints!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M.",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Very Convenient",
      "text": "Very convenient and very similar to the same product sold in a tube.",
      "rating": 5.0,
      "verified": true,
      "author": "R.H.N.",
      "helpful_votes": 3,
      "publication_date": 20170308
    },
    {
      "title": "I ❤️This",
      "text": "I adore this. The scent is fabulous and the cream is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Williams",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "'She who must be obeyed' loves this item.",
      "text": "Use at night. The lavender relaxes you and brings sleep to you easier.",
      "rating": 5.0,
      "verified": true,
      "author": "David Timme",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Five Stars",
      "text": "Best hand cream I have used in a long time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Absorbs quickly, not greasy and smells like fresh lemony fruit.",
      "text": "Product was early and is all i hoped it would be. It smells so awesome and absorbs quickly. You don’t have to use a lot and it’s not greasy but makes your skin so soft. I love this lotion!",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Hart",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Did not seem to be an authentic L'Occitane Product",
      "text": "I don't believe this is an authentic L'Occitane product. I usually buy L'Occitane products at one of their stores or from their website, but I was in a rush and wanted the quick shipping. But this lotion, from the container to its contents, was fishy to me -- the cream is cheap and the smell is not the same as the other lavender products from L'Occitane I have used in the past. Buyer beware -- I think this is a fake! I returned this and will not purchase this kind of product through Amazon again -- I am a big Amazon fan, but there should be more careful quality control, esp. when it comes to brands like this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Isabel",
      "helpful_votes": 5,
      "publication_date": 20170403
    },
    {
      "title": "Excellent products",
      "text": "I love everything from L’occitane. Products from France 🇫🇷, excellent. My father’s half of French mixed. When I visited Paris few years ago, I bought a lot of l’occitane products, took home . My skin is smooth, healthy and moist since I used it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bach L. Anong",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "It is a very good lotion and has a good scent",
      "text": "I use this stuff as an aftershave. It is a very good lotion and has a good scent. I may have to take out the pump to get the last bit out of the jar.",
      "rating": 5.0,
      "verified": true,
      "author": "Vi  Power",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Great lotion",
      "text": "My sister-in-law loves lotion. It smells great as well as moisturizers your hands.",
      "rating": 5.0,
      "verified": true,
      "author": "DMD",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "hand lotion",
      "text": "A little touch of luxury goes a long way to feeling better.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann M Polosky",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Five Stars",
      "text": "Lives up to the usual L'Occitane reputation -- wonderful scent and very moisturizing.",
      "rating": 5.0,
      "verified": true,
      "author": "humpty dumpty",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "I buy it for the clean lavender frangrance",
      "text": "L'Occitane has the best lavender scent of any product I've ever purchased. This lotion is not as rich as the L'Occitane hand cream I usually buy but it is less expensive as well. Glad I bought it..",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley Bain",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great Gift",
      "text": "Gave it as Christmas Gift. I love the Brand and this is inexpensive to give away. Works good and my friend order a few thing for herself afterward.",
      "rating": 5.0,
      "verified": true,
      "author": "Emma P.",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "One Star",
      "text": "The lavender fragrance doesn't last the way the lotion I had bought from the L'Occitane website.",
      "rating": 1.0,
      "verified": true,
      "author": "Ginny B",
      "helpful_votes": 3,
      "publication_date": 20170620
    },
    {
      "title": "Yummy smell",
      "text": "This stuff smells heavenly and I can't imagine anyone who says they don't like it. It's creamy and smooth and I want to use it all the time. Someone told me that \"men don't like lavender\". I beg to differ....men love the way my hands smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "L’occitane lotions are my favorite. The scent is always perfect and not overpowering",
      "text": "L’occitane lotions are my favorite. The scent is always perfect and not overpowering. I use that hand and feet ones and love them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "My second bottle",
      "text": "I received my first bottle of this lotion as a gift and loved its lemony scent, perfect texture (neither too slippery nor too thick), and easy-to-use pump so much that when I used it all up, I purchased one myself. The only negative is that the price is high, but I bit the bullet and ordered it anyway because it was my favorite lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob and Tracy",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "98-year-old woman approves",
      "text": "My sister and I purchased this for our 98-year-old mother who is in a nursing home. We try to make sure she has little niceties This did indeed fill the bill. Mother uses it every day and loves the delicate lavender scent. A definite recommend for one's self or a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 2,
      "publication_date": 20160205
    },
    {
      "title": "Love this lotion.",
      "text": "This is such a nice lavedar lotion. I use it every night before going to bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill of all trades",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Lasting softness",
      "text": "Great hand lotion for a great price. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn S.",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Smells like plastic",
      "text": "This doesn't smell anything like the same lotion I've tried in the store. It left my hands smelling like plastic.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Soft handcream",
      "text": "One of the best hand creams - goes with the soap I have ain our guest bathroom",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "If you love real lavender, this is the perfect hand lotion",
      "text": "I love L'Occitane lavender products, and this lotion is perfect. Not slimy, absorbs well and quickly, and my dry hands feel great after I use it. The lotion smells just like real lavender - it's fresh, not cloying and too sweet as so many other lavender products from other companies are. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "LindyLouTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Love Lemon Verbena",
      "text": "Lovely hand lotion with the perfume of Lemon Verbena. I wish it wasn’t so expensive, but it’s L’Occitane brand ...",
      "rating": 5.0,
      "verified": true,
      "author": "Donna T",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Smells great",
      "text": "Just love the smell, so fresh. Quick absorbing hand lotion too.",
      "rating": 5.0,
      "verified": true,
      "author": "Smrtyoz",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Only pros are it smells good and pump type",
      "text": "this is a hand lotion. Not a cream. Wont work as half of original shear butter hand cream. Only pros are it smells good and pump type.",
      "rating": 2.0,
      "verified": true,
      "author": "Sky",
      "helpful_votes": 2,
      "publication_date": 20171212
    },
    {
      "title": "Gift",
      "text": "This was purchased for my mother as a gift . She absolutely loves this stuff",
      "rating": 5.0,
      "verified": true,
      "author": "stephhhhhhhhie",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Worth a try",
      "text": "I'm glad I found this lotion. It's just right for my hands, and has a bit of a citrus smell.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Perfect level of scent and it the perfect level are moisturizer",
      "text": "This product is excellent. It moisturizes but it’s not This product is excellent. It moisturizes but it’s not greasy. The smell is on a level fiveIt is not too overbearing to wear in an elevator.",
      "rating": 5.0,
      "verified": true,
      "author": "Torts",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Smells great!",
      "text": "I love L'Occitane products, especially anything they make in Lavender scent. I keep this by my bed and apply to my hands and feet before bedtime. The smell is soothing and I wake up 8 hours later with still moisturized hands and feet. Will buy again and again.",
      "rating": 5.0,
      "verified": true,
      "author": "LS",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "Authentic lavendar aroma",
      "text": "I have reordered this product numerous times. I use it as a hand lotion every night before I go to bed. The lavender aroma is very soothing; not perfume-y at all. It is a little pricey but I regard this as my special treat!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Stern",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Great none greasy, pleasantly smellIng",
      "text": "Great none greasy, pleasantly smellIng, hand lotion! Perfect for my powder room.",
      "rating": 5.0,
      "verified": true,
      "author": "Vika",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "The delicate fragrance pulled me in, but the smoothing ...",
      "text": "The delicate fragrance pulled me in, but the smoothing job L'Occitane did on my hands keeps me coming back.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Llewellyn",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Luxury for my hands",
      "text": "My hands feel better, and I really like the scent of Verbena, have for years. It is rich and absorbs well, no greasy feeling. L'Occitane products are excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "CeciLafayette",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "My Favorite",
      "text": "My favorite along with shower gel and perfume. Lasting fragrance.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Wyrick",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Smells great",
      "text": "The smell of this lotion is just fantastic, I do feel like I have to put it on frequently because it is not the best in the moisturizing department.",
      "rating": 4.0,
      "verified": true,
      "author": "amendi09",
      "helpful_votes": 2,
      "publication_date": 20140107
    },
    {
      "title": "Perfect lotion!",
      "text": "This is my favorite!! Smells wonderful and feels so silky.",
      "rating": 5.0,
      "verified": true,
      "author": "A.  Jost",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "awesome prodact",
      "text": "smell nice and moisturizing just perfect ..... have that lotion in every bathroom and at work as well",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "I found my Dream Cream!!",
      "text": "I have literally looked for 20 years for the perfect hand cream, only to purchase the cheapest to the most expensive finding fault with all of them. I felt like the bears in Goldilocks, \"too oily, too heavy, too smelly...too watery!\" I received a sample of this cream in a package one time and I tried it, and squeezed it dry, got online with Amazon, and placed my first of many orders! I found my Dream Cream!! Wonderful product, light pleasant fragrant, with just the right feel! A little expensive, but it's worth it, to the final drop!",
      "rating": 5.0,
      "verified": true,
      "author": "Sue V.",
      "helpful_votes": 5,
      "publication_date": 20140730
    },
    {
      "title": "Just the right amount of fragrance.",
      "text": "Delighted by how great this lotion is! Silky. Absorbs nicely. And smells heavenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Stephanie Jourdan",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Divine experience.",
      "text": "It may be an expense, but it is a divine experience as well.",
      "rating": 5.0,
      "verified": true,
      "author": "S.",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Delicious fragrance!",
      "text": "Delicious fragrance! Not excellent on moisturizing, but certainly leaves a very clean, fresh smell. Love this lotion.",
      "rating": 4.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "Great Hand Lotion",
      "text": "I love this hand lotion. It makes your hands feel really nice and smooth and the lavender smell is just wonderful and very soothing.",
      "rating": 4.0,
      "verified": true,
      "author": "Omaelli",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Wonderful!",
      "text": "This is a wonderful hand lotion with the distinctive verbena fragrance. As well as smelling divine, the lotion moisturizes without leaving a greasy feeling on your hands. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Hester V",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "Four Seasons",
      "text": "I was introduced to this lotion while staying at the Four Seasons. Love the crisp scent and it isn't greasy. Reminds me of my trip when I use it! Best lotion ever!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Edmondson",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Favorite lotion",
      "text": "Light sent and doesn't feel oil. Part of my nightly routine. Will be buying again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Not so great",
      "text": "I bought this because I love L'Occitane soap. The lotion smells nice but is not very moisturizing. 30 minutes after use my hands are dry.",
      "rating": 2.0,
      "verified": true,
      "author": "Brenda P.",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Good buy",
      "text": "Smells amazing. Cheaper than retail. Would like for it to keep moisturizing longer.",
      "rating": 4.0,
      "verified": true,
      "author": "tvaughn",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "It moisturizes dry hands",
      "text": "I like the smell and the fact that it’s not greasy and moisturizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark B.",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Five Stars",
      "text": "Love these products - must be the shea butter that makes it so soothing.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith W. Springer",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "This moisturizer smells amazing, lightly lavender scented",
      "text": "This moisturizer smells amazing, lightly lavender scented, not overwhelming. also it leaves the skin soft and lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "KC_Review ",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Great!!",
      "text": "I adore this product form L'Occitane. I wears every night before go to bed, it's great for relax.",
      "rating": 5.0,
      "verified": true,
      "author": "JAA",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "there paint size ones were super expensive and one could be used up in a ...",
      "text": "I only use L 'Occitane hand cream, however, there paint size ones were super expensive and one could be used up in a week. This size is perfect and I have been used it for almost half year!",
      "rating": 5.0,
      "verified": true,
      "author": "sunflower",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Best smell but better hand creams out there",
      "text": "My favorite. Probably most natural intense smelling lavender lotion unsurpassed for aromatherapy (very relaxing) however it loses a star because it is a bit thin and wish it were more creamy maybe add shea butter or something. Love this pump version! Makes great gift. A bit expensive but worth it as I haven't found a nicer smelling one. UPDATE --The pump tube doesn't reach nearly close to the bottom of the jar and for that it loses another star for the inconvenience. Now how am I supposed to get the rest of the lotion out? For the price it is really irritating. The pump just seems gimmicky now and I would rather buy the tube moving forward.",
      "rating": 3.0,
      "verified": true,
      "author": "L.Krupa",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "Nothing beats this scent!",
      "text": "There is no Lavender product around that smells as true as L'Occitane Lavande! I surely hope they never discontinue it. Even my husband enjoys the scent and you know how men are! I always have a Lavande Hand Lotion next to the sinks in my home. There is always a tube of lotion in my purse. Besides smelling amazing, the lotion itself is fabulous! It is super moisturizing and leaves no greasiness behind. I prefer to buy this lotion from Amazon, as with Prime i save monty on shipping and gas in my car to drive to the L'Occitane store in the mall. Saving money equals more $$$ to spend on more L'Occitane!",
      "rating": 5.0,
      "verified": true,
      "author": "TAMMY L NORRBOM",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "???",
      "text": "Not sure if this is real or expired but it smell different now",
      "rating": 1.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Five Stars",
      "text": "A lovely product. The cream is smooth, and absorbs without being greasy. It leaves my hands soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth1100",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "It is perfect in every way",
      "text": "I will continue to buy this as long as it is available. It is perfect in every way.",
      "rating": 5.0,
      "verified": true,
      "author": "Niki Lonski",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Nice but not as good as the other body lotions from this company",
      "text": "The smell of the lotion is good but somehow not as good as the Yardley's English Lavender soap smell, which I love. Consistency and the moisturizing ability are good.",
      "rating": 4.0,
      "verified": true,
      "author": "Darwin",
      "helpful_votes": 0,
      "publication_date": 20121016
    },
    {
      "title": "Good",
      "text": "Compare to the Shea Butter, this is a thin layer hand lotion. I do like the Verbena smell.",
      "rating": 5.0,
      "verified": true,
      "author": "mooserelli",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Creamy smooth and with a very beautiful fragrance.",
      "text": "Creamy smooth and with a very beautiful fragrance. Worth the price. Will definitely buy more when this bottle runs low.",
      "rating": 5.0,
      "verified": true,
      "author": "R. J. Lazzarini",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "hand lotion",
      "text": "this is sure good stuff--I gave it for Christmas present",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "LIGHT WEIGHT LOTION",
      "text": "Not as thick a cream as I would have preferred but does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "D Jones",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Happy with Purchase",
      "text": "I bought this as a Christmas gift for my daughter....she used it right after opening it, and she loved it...especially the Lavender!!",
      "rating": 5.0,
      "verified": true,
      "author": "Renee from Midwest",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "this is all we use now",
      "text": "I've used many lotions over the years, but this one has ended up replacing all the others. The scent is heavenly -- not too strong, but still noticeable. And it really works to replace dry skin with softer healthier skin, even only after a few days of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Athena R. Adkisson",
      "helpful_votes": 12,
      "publication_date": 20130430
    },
    {
      "title": "Good scent, thin consistency.",
      "text": "I love the scent but the lotion is thinner than I desired.",
      "rating": 3.0,
      "verified": true,
      "author": "J Weaver",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Five Stars",
      "text": "Love this - works better than any other hand lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "pg",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Five Stars",
      "text": "Totally in love with this lotion. Smells lovely, isn't greasy, and does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "LLB17350",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "It is not as rich as the hand cream, ...",
      "text": "It is not as rich as the hand cream, but I prefer the lighter texture. one star off for the smell.",
      "rating": 4.0,
      "verified": true,
      "author": "Su",
      "helpful_votes": 0,
      "publication_date": 20151014
    },
    {
      "title": "Five Stars",
      "text": "great consistency & smells great! Feel like I'm living at the Four Seasons. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Here&There",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Five Stars",
      "text": "I'm on my 3rd bottle! Yes, it's a bit pricey but worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "*Rock Star*Top Contributor: Painting",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Love it!",
      "text": "I love this product, texture and scent. I give it as gifts often.",
      "rating": 5.0,
      "verified": true,
      "author": "E. P. Sery",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Five Stars",
      "text": "Love this stuff. Smooth and creamy not greasy and smells like heaven",
      "rating": 5.0,
      "verified": true,
      "author": "Palm Springs Shopper",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Love it!",
      "text": "Love the smell of this lotion! Got it at a great price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "Fantastic",
      "text": "Almost the same price as the retail outlets but If you don't have a L'Occitane near just try it. The soap is expensive but it last much longer than regular soap and it gets me feeling clean. Clinical Deodorant it a pain to get off but this brand soap (sensitive or regular) does it very well with no residue. I am not a salesman or compensated in anyway but when I find a product that does what it should and then some I like to share. This scent is a blend of lavender and something that softens the lavender, it is wonderful. It goes great with my shaving kit scent.",
      "rating": 4.0,
      "verified": true,
      "author": "robish0",
      "helpful_votes": 0,
      "publication_date": 20130324
    }
  ],
  "product_meta": {
    "title": "L'Occitane Moisturizing Hand Lotion,10.1 Fl Oz",
    "description": "Scent:LavenderEnriched with the finest lavender from Haute-Provence and Shea Butter to nourish, moisturize and lightly scent the skin. TIPS:Apply a knob of product on clean and dry hands and massage softly to make it penetrate.",
    "rating": 4.7,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.95 x 2.32 x 4.92 inches; 10.58 Ounces",
      "Item model number": "15LM300L11",
      "Manufacturer": "L'Occitane",
      "ASIN": "B0055EPHLS",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Amazon Best Sellers Rank": "#12,786 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Moisturizers",
      "Skin Care",
      "Body",
      "Beauty & Personal Care",
      "Lotions"
    ],
    "price": 24.0
  }
}