{
  "website_summaries": [
    {
      "verdict": "Though it comes at a budget-friendly price, its competitors have more to offer on almost all fronts.",
      "pros": [
        "Foldable and inexpensive",
        "Adjustable 32 to 48 inches",
        "Easy to install and rated up to 300 pounds",
        "Limited lifetime warranty"
      ],
      "cons": [
        "Subpar hardware includes bolts that have been known to break"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Makes a great work bench",
      "text": "Works excellent as a floating work bench in the garage. Just attach a piece of plywood and viola. (note: be sure to lag bolt to studs)",
      "rating": 5.0,
      "verified": true,
      "author": "2 There and back 2",
      "helpful_votes": 163,
      "publication_date": 20150607
    },
    {
      "title": "It works but is not perfect",
      "text": "I selected this rack primarily because of the price and availability. Installation is straightforward, but you definitely need to read the directions. Some of the low reviews are likely a result of not reading them. The fasteners could be higher quality, but I'm subtracting one star because for the square tubing material used in construction there is no excuse not to include washers. Do be aware that this is a 300lb rack, and after weighing the winter wheels and tires for my small SUV, I found they total up to 220lbs. There is not much excess capacity available.",
      "rating": 4.0,
      "verified": true,
      "author": "The Ritchies",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Very sturdy once installed",
      "text": "In general I really like the tire/wheel rack. I followed the guidance of others and went to Lowes to get quality lag bolts rather than the supplied ones. When installing it, make sure the pivoting threaded fasteners are at least partially threaded, just not fully tightened. When installing it on the wall, several of the nuts fell off from the vibration of using my Bosch impact driver when driving the bolts into the studs. Once everything is installed, its very solid. Just a few minutes of some additional tightening that should have been done at the factory, will make things easier.",
      "rating": 4.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Excellent product, does what it's supposed to",
      "text": "I've purchased and installed 3 of these now, and would have to say they are doing what they were designed to do, storing tires and wheels overhead along a wall. After the 1st one, I have the install firgued out. When purchased, everything is extremely loose, therefore, I encourage everyone to tighten things down to a point where the parts move under slight friction before securing the sides to the wall. They are all installed at the max range of 48\", and are holding car tires and wheels at the moment. Overall, very satisfied with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Dante E.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "It's ok",
      "text": "For the money it isn't a bad product after you install it and go through it. You'll want to make sure you have extra sockets than what they call for so you can tighten up everything else. You need some play if you want to fold it, but the nuts were so barely threaded on I wouldn't have trusted that long. You'll also want a socket to tighten the bolts into the cross bars. Also, I'm pretty sure mine was sold to me as a used return from someone else. It came taped up in red tape around the box, scratches on the bars like it had been installed and used.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Anderson",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Pretty good and 30 garage organizer",
      "text": "The rack seems pretty sturdy I actually managed to hang on it myself before I put the tires on and it held perfectly fine. I followed the advice of some of the other reviewer‘s with using a bigger bit. I did add eyelet bolts and used a ratchet strap as a secondary security measure but overall I am 100% happy with it definitely a must have in the garage if you have spare tires sitting around on the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Best value on amazon. If installing in concrete wall READ for materials needed",
      "text": "Very sturdy. Installed into concrete block. Materials listed below. Fits my R21 tires no problem. Best bang for your buck on amazon! If installing in brick or concrete block you will need the following materials listed and pictured in review. 3/8 inch x 3 inch lag bolts 3/8 lag shields (4) or 6 depending if you want to use every mounting hole 5/8 masonry drill bit Hammer drill",
      "rating": 5.0,
      "verified": true,
      "author": "RB68",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Great buy highly recommended",
      "text": "Incredibly low price made me skeptical but this thing has been good so far! Build quality was decent not the best so you have to triple check every bolt/nut and do a few pull ups on it to check support before you throw tires on it, dont over tighten bolts cause it will crush the metal as its hollow and not solid....install was easy, beats spending over $100+ for almost the same thing from other companies, overall happy with this tire storage setup I ended up buying a 2nd one. Hopefully it lasts long I will update again in a year or two.",
      "rating": 4.0,
      "verified": true,
      "author": "ESPEC",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Great product...but concerned with no bolts/supports holding center together",
      "text": "Great product, easy to install. The horizontal poles the tires sit on don't have anything to connect to each other. One fits inside the other. Due to this there is a \"bend\" in the middle section of the tire rack, however it still seems to work. I find it odd and wish it didn't do that, but it otherwise works fine. I have purchased two of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Robstar",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "As advertised but very poor construction",
      "text": "Now that it is assembled and installed is perfect, sturdy, and nice. The side brackets are not built right, I had to re-drill the mounting holes of the bracket and support arm in order for it to lineup the left and the right sides. Don't drill the wall holes by measuring either, after you fix the brackets you must mark the wall hole locations so it will mount horizontally leveled. Again, after you fix the brackets and install it the HyLoft works and looks great.",
      "rating": 2.0,
      "verified": true,
      "author": "Oakhill",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Great value!",
      "text": "I really wish I had picked this up sooner. For a reasonable price I can store my off-season wheel and tire set out of my way and free up much needed garage space. I am pushing the rated capacity for the rack with my SUV tires close to 300 lbs total and I see no issues as of a few months. The assembly was really easy to complete and install. It also appears to tuck away nicely if need be, though I doubt I will use that feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew A. Garlough",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Fit my 20” snow tires",
      "text": "I placed my snow tires from a 2016 F150 Lariat on this rack. I did have to adjust the bottom bars for them to fit well, but it worked out. I have 20” tires so you can see from the photo it does work. So far so good. The product felt very sturdy and the bolts are adequate. I’m happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "J.S.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Missing hardware / looks used",
      "text": "Seems sturdy, but it was missing a couple of lock nuts on delivery. Will update after I make a trip to the hardware store to buy things that were supposed to come with it. (One of the bracket ends was complete and loosely assembled, the other was in pieces and missing the nuts) Says it was “new”, but questionable.",
      "rating": 2.0,
      "verified": true,
      "author": "sojourner75",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Very strong, easy install",
      "text": "Before I put my tires up there I decided to test it with my weight. I'm over 200 lbs and did a pull up and the the rack didn't even creak. It's very strong. I have some 15\" tires and wheels up top and then some winter tires and wheels (18\") below. I even put some extra stuff in the space. Yes, the tires don't \"sit\" in between the two poles 100% but they are in there solid regardless. I don't understand what I'd get with a rack costing 2-3x as much.",
      "rating": 5.0,
      "verified": true,
      "author": "A customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Perfect tire storage solution.",
      "text": "Perfect wheel and tire storage solution! I got some different hardware to fit better in my application, but other wise it’s great! These wheels and tires weight 68# each and holds them no problem. The adjustability made it a perfect fit between my garage doors. Ordering a second one right now.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin M. Hebert",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Nice wheel rack",
      "text": "Product was easy to install and looks good. I even purchased another based on the price and the fact I needed a little more space due to the width of my wheels. My wall studs distance did not allow me to extend further and I didn't want to mount them to a piece of wood mounted to the wall so I put the pair side by side (2nd rack was not installed when photo was taken). I'm sure I can use the extra space for something else I want of the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "Walt",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "No Hardware",
      "text": "Installing months after purchase... I am very disappointed to find that the hardware is missing, including specialty threadded bolts, requiring multiple runs to hardware store to install. Otherwise it would have been a good product.",
      "rating": 2.0,
      "verified": true,
      "author": "jetravel",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "really works great excellent value for the money - cheap and cheerful",
      "text": "This is pretty slick... mounted easily to the wall studs in the garage (after drilling) Holds seasonal set of wheels no problem, summers set in the winter, and winter set in the summer. Mine are 16 inch 235 width tires on aluminum alloys... I could probably get a 5th up there if I needed. Folds up pretty nicely. ONLY COMPLAINT; would have been helpful to me if the drill size to prep the bolt holes was provided in the instructions... took me several tries stepping up the drill size to get it right... I think I settled on 7/16 (?). I've seen systems advertised at 2, 3, 5X the cost... this is a very economical solution",
      "rating": 5.0,
      "verified": true,
      "author": "FoxHillSpeedShop",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "OK design, poor quality control",
      "text": "The basic design and steel construction is good, but there is a real lack of quality control for the shipped product, not an uncommon occurrence for Chinese made goods. My rack arrived with a defective bolt: it was bent and could not be threaded into the round crossbar. Fortunately I was able to buy a workable substitute at the local hardware store. In addition to the misshapen bolt, virtually all of the factory assembled (smaller) fasteners had to be checked and tightened, as a nut fell off of one of the hinge pieces during mounting. This required tools not listed in the instructions (hex wrench and an additional socket size). Satisfactory outcome after dealing with those problems.",
      "rating": 3.0,
      "verified": true,
      "author": "r l harris",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Very sturdy, so nice I bought it twice",
      "text": "I have two of these which I use to hold my spare wheels and tires. One set holding 205/50/15 on 6\" wheels, and one set holding 205/40/17 on 7\" wheels. They really help clean up my garage floor, they're very sturdy and look great. My only regret is that I didn't buy these sooner! After installing mine, just about everyone whose seen it in my garage has ordered one for themselves! Save your money over the one advertised on TireRa...",
      "rating": 5.0,
      "verified": true,
      "author": "Scott A.",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Just what I needed",
      "text": "I installed this rack in less than a hour holds all four tires and rims with ease.....2 19inch and 2 18inch prefect",
      "rating": 5.0,
      "verified": true,
      "author": "Just B",
      "helpful_votes": 17,
      "publication_date": 20141102
    },
    {
      "title": "Will not work for standard Pickup Truck Tires/Rims",
      "text": "This will not work for standard pickup truck tires. i have full size truck with P265/R18 tires/rims and they will not work. seller should note what size tires it works with. I contacted MFR and the said i needed to get their model # 01000 for the truck tires. the description of the product for both products is the exact same. only difference is the weight limit.",
      "rating": 3.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Dollar short.",
      "text": "Pretty good. Minus one star for not including washers with the hardware. I initially installed it without, but after having to remove a bolt to make an adjustment, I didn't like how little of the bolt head overlapped the hole, nor the wear on the metal. Cost me a little more than a dollar to get the 10 washers, so its a silly cost cutting move. I'm not worried about it holding to the wall as I did a few pull ups on it after install. Nary a quiver in it. I'll still install an extra line through the wheels as cheap insurance given some of the other reviews.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Easy to install",
      "text": "I used the screws that came with product and haven't had a problem (have had tires on it for 3 months so far). Easy to install. I used a cargo net (link below) over the tires and attached to anchors in the ceiling joists for added security. If you mount it up high, you might look into a winch/block & tackle (link below) to hoist your wheels/tires.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy D",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "Works great",
      "text": "Just put it up - goes into 2 studs on 36 to 48 inch centers with three fairly large lag bolts on each side. Easy enough installation - Have four SUV tires on it - they hit the wall - but are secure enough. A little bit of droop in the center - but nothing to be worried about. (mostly where the two poles that form the cross bars meet). Wife is extremely happy that the tires are not on the floor of the garage and up out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Owen",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Exactly what was needed",
      "text": "Needed a shelf for targets for our dojo. This is perfect. Side brackets keep them from falling over. If the unit will hold multiple tires, a few targets are a piece of cake. Looks professional, and cost is nearly nothing compared to other options. Well made, easy to assemble. Perfect for our use!",
      "rating": 5.0,
      "verified": true,
      "author": "Howard L.",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "great product for the money, but DO  buy the stronger bolts.",
      "text": "My husband followed the review suggestions and bought stronger bolts etc, and they work great. All our ties are off the floor and we can store som much more in our shed. Since similar products are 3 times as much, the investment in the larger bolts still turned out to be a lot cheaper than buying another product. The bars of the shelves are very sturdy metal, not cheap feeling at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "... it came in was busted open but it looked like all the parts were in it",
      "text": "When I received this several weeks back the box it came in was busted open but it looked like all the parts were in it. Turns out all the mounting hardware was gone and I had to spend about $15 on screws and lags. Having said all that, it went up well, is well made and works great. I might buy it again if I could get them to wrap the box a little better.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Rivington",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "Surprisingly nice",
      "text": "After reading all the reviews, I made sure to purchase and mount with all new hardware from he local big box lumber yard. Install was quick and easy- and I was super impressed that it holds al four of my alternate wheel/tire set (each weighing 40lbs) without any concerns. I was skeptical- but this turned out exceed my expectations. Ensure that you tighten up all the factory hardware (at the pivot points) as they arrive very loose. Common sense, yet I wonder if this could have contributed to failures others have mentioned.",
      "rating": 5.0,
      "verified": true,
      "author": "San Diego Car Guy",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Quality",
      "text": "Excellent product easy install for the technical guy/gal or for the DIY’er...just make sure you hit a stud",
      "rating": 5.0,
      "verified": true,
      "author": "Dez Blackmon",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Good quality",
      "text": "Bought 2 of these to get extra wheels and tires off my garage floor. Was pleasantly surprised at the quality. No noticeable bowing even with my heavy wheels/tires at max width. Make sure you to mount them in studs and you shouldn’t have any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Hobs",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "Straightforward installation.",
      "text": "I installed this thing today, and installation was pretty straightforward. The important things were locating the studs and assuring the side supports are vertical. A magnetic spirit level was quite handy in this regard. Heading the warnings of other reviewers, I replaced the kit hardware with Grade 8 bolts and strong lag-screws. It took me about 3 hours, but that includes trips to the lowe-depot.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher J. Ridle",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "It’s a tire rack!",
      "text": "It’s a tire rack! It’s currently holding a set (2) 18x8 and a set (2) 18x9 wheels and tires in my garage. Bolt this to studs and pre-drill your holes per instructions and it will be fine. Folds up nice and neat when not in use as well. Easy peasy.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Blair",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "GREAT PRODUCT",
      "text": "What else is there to say? The pic shows 20 in tires (no rims). Sturdy and I bought another one bc it was easy to install! Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "D-Ybuy",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Bang for your buck!",
      "text": "Installation was pretty easy, but boy was I nervous hoisting my 17\" snow tires with rims up there. The construction of this product is not entirely confidence-inspiring given the weight it has to hold, and that if it were to ever give way my new car would be crushed by it's own four wheels bouncing all over the garage. But alas, it's been holding steady for about four months now. The tolerances between the telescoping tubes are not very tight, leading to some sag in the middle. I lifted them up and stuck a couple pieces of nylon zip-ties cut to length into the gaps. Just the right McGyver solution to level the bars out.",
      "rating": 5.0,
      "verified": true,
      "author": "Brett M.",
      "helpful_votes": 0,
      "publication_date": 20130618
    },
    {
      "title": "otherwise its perfect! Great rack",
      "text": "Purchased Amazon used, was missing 1 screw and 3 locknuts, otherwise its perfect! Great rack. very sturdy, surely enough for my 18\" wheels and tires with the 300lbs capacity. If i wanted to do truck tires i would go with their 400 lb non folding model, though it seems that this rack would fit larger tires, just not sure about weight.",
      "rating": 5.0,
      "verified": true,
      "author": "TGI",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Pefect Tire Rack",
      "text": "This tire rack works perfect for storing 4 tires for my car. I like that it can be folded up and out of the way if I am not using it to store the tires. Straight forward installation. The hardest part was drilling holes into concrete block so I could install the screws. Other then that, it was simple to install. Good price and works well for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "CGH",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Buy This!",
      "text": "Wow. I mean, you can spend hundreds more on something like this. What a great product for the price. Easy to install. Adjustable. Strong. Very happy with this. On a side note, experts recommend sealing your tires in an airtight bag after cleaning them. I just hosed them off, stuck them in some 50 gallon trash bags, tied them, and tossed them up on this rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Grant Davis",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Added bolts",
      "text": "Functions as designed. I did purchase better bolts as this holds a lot of weight. Came with zinc lag bolts and I replaced with galvanized. Also added washers",
      "rating": 4.0,
      "verified": true,
      "author": "Errol A.",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Would buy again!",
      "text": "I wish I would've bought this tire rack years ago. It gets my spare set of wheels/tires off the ground and out of the way. The mounting to the wall is very sturdy. No worries of it coming off the wall with the weight of the tires. Only gave it 4 stars because the cross bars that actually holds the tires seemed weak once I got my set of 265/35/r18's on. I ended up putting a dowel rod inside the cross bars and that stiffened it up very nicely. I will buy a second one for the second set of wheels/tires for my wife's car.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20170126
    },
    {
      "title": "Excellent! Well Made Sturdy Construction",
      "text": "Excellent product. Well made, nicely finished steel construction allows the width of the unit to be adjusted before bolting it to the wall. Very sturdy; I have 4 Audi alloy wheels with tires mounted sitting on the rack with no visible sag whatsoever. The lag bolts (3 on each side) are beefy so there is not fear this will fall off the wall. My greatest concern was being certain I found the center of the stud with my electronic stud finder. Put the whole thing together in under an hour.",
      "rating": 5.0,
      "verified": true,
      "author": "ACAT",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Easy to install",
      "text": "We have two sets of snow tires that we store in our garage and wanted to get them off the floor and out of the way. The units were easy to install and hold our tires with ease. They are very sturdy and I love that I can fold the unit up against the wall because one of the tire sets belongs to my brother and I won't always need to store them.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Dean",
      "helpful_votes": 2,
      "publication_date": 20160824
    },
    {
      "title": "So far so good. Actually more surprised with quality than I thought",
      "text": "So far so good. Actually more surprised with quality than I thought. I took the advice from other reviews and quickly went to Lowes to buy new Lag bolts. I also suggest you tighten up all the nuts on this thing, because they all came in hand tight. Other than that, super easy to install, and very sturdy when all together. I bought two of them and probably get a couple more.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Schaub",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Does the job",
      "text": "Used these to store my paddle tires for side-by-side. Items were well packaged and arrived in timely manner. Easy to install and once installed, had tires up on rack. Tires been up on the rack for over a month now with zero issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Sturdy--works great!",
      "text": "Quite substantial. I am using it to store snow tires up and out of the way. They don't have rims on them, but I have no doubt this thing could hold plenty of weight. The length is adjustable which is nice to get the perfect fit. Just make sure when you mount it to account for some extra length if you need to swap out for your summer tires. I didn't realize my summer tires were just a touch wider, so now I have to re-mount.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg H",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Great product.",
      "text": "What a bargain! I was about to order the one from Griots Garage for $180. Glad I found this. AND it collapses flat against the wall when not in use!",
      "rating": 5.0,
      "verified": true,
      "author": "J.H.",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great design",
      "text": "Holds my four 18” aluminum wheels with no problem. Box arrived in poor condition. Nothing was missing.",
      "rating": 5.0,
      "verified": true,
      "author": "BobbyP",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Clean looking works as designed",
      "text": "I used these to put my spare set of tires (Winter or summer) on the wall to get out of the middle of my garage. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "I smell of elderberry",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Okay Tire Loft Storage.",
      "text": "It does the job but the rods bend in the center to a point I'm a little uncomfortable. I only have 20 inch wheels and 245 tires and its a tight fit. If I went any wider to make more room I felt like the rods would hold weight.",
      "rating": 3.0,
      "verified": true,
      "author": "HB",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "PARTS MISSING",
      "text": "ITEM ARRIVED WITH MISSING PARTS. CALLED NBR LISTED ON INSTRUCTION SHEET FOR \"PARTS MISSING\" WAS DIRECTED TO ENTER SERVERAL NBRS THT WE DID NOT HAVE. NEVER COULD GET TO A HUMAN BEING.. PRODUCT IS TOTALLY USELESS AS SENT. UNLESS SOMEONE ANSWERS THIS COMPLAINT I MUST RETURN RACK..",
      "rating": 1.0,
      "verified": true,
      "author": "AMB",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Sturdy and well designed product",
      "text": "Sturdy and well designed product. I put some smaller wheels on my Veloster and wanted to keep my 18\" factory wheels for use later on. Opening the box was a little intimidating at first. But once I took a moment to read the directions from start to finish and plan out where I was going to install it, everything went together very easily. I mounted this in my garage, where the walls studs are easily visible, and this unit works nicely. I now have my pristine 18\" Veloster wheels stored up on the wall and out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "zacware",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "It Holds Tires",
      "text": "Pretty easy to install, if your holes aren't drilled perfectly level, it'll still go together, but your tires might try to tip over. I put some decently large car tires on one of them, it seems pretty sturdy, I don't think there will be any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Shaw",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Not too bad, very decent for the price.",
      "text": "Took an hour or so to look for all the tools and mount it. Have a 1/2\" socket and a 11mm handy, you'll also need an allen wrench, can't remember the size though. A level was helpful for my install. You'll need to tighten all the nuts n bolts on this thing, otherwise, it's flimsy and rocks around. I Put 4 19\" rims n tires on it, no issues so far. I will get another unit for some more rims I have sitting around. All in all, you can't go wrong buying this. Don't expect top shelf quality on this and you'll be happy.",
      "rating": 4.0,
      "verified": true,
      "author": "R&amp;D",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Easy to install, holds 18\" rims easily",
      "text": "I bought these (purchased 2 of them) to keep from having to store my summer rims and tires off the garage floor. We both have a set of winter tires on our vehicles, and these are great for keeping the summer tires out of the way and organized (and winter tires out of the way in the sumer obviously). I was a little worried about the capacity of these with my rims from a Fusion Sport. Being large 18\" rims, i was worred about these racks holding up and they are awesome. As long as you get them into the studs and secured properly, i dont think you'll have a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20130214
    },
    {
      "title": "great rack for my winter wheels",
      "text": "some people complained about this rack not being able to hold their wheels, but this is pretty sturdy. Not sure if people are drilling the pilot holes into the studs ahead of time or drilling them into the center of the studs, but either of those two things could cause this thing to fail (which would be caused by user/installation error). The hardware was strong, existing bolts that were part of the preassembled parts needed to be tightened, and if you have heavy wheels you could add a chain support in the center for reassurance.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Swanson",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "Super easy to install and super sturdy",
      "text": "I use this for smaller ATV tires but would work equally well for car or truck tires. Nice to get them of the ground and save some garage space.",
      "rating": 5.0,
      "verified": true,
      "author": "KPM",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Terrific product, easy to install with included lag bolts",
      "text": "Terrific product, easy to install with included lag bolts, but I used WoodPro Fasteners ST516X318-25PC 5/16-Inch by 3-1/8-Inch Length Round Washer Head Exterior Wood Screws, also from Amazon. It is hard to tell by the photos, but this rack is very solid and strong, well made steel components. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "JC_Dexter",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "fastener Parts missing upon delivery",
      "text": "I received delivery with a large tear in package and it appears a fastening part for item fell off and out of tear in package. I think I can still it and put a fastener on it. But I am not satisfied with this so far.",
      "rating": 1.0,
      "verified": true,
      "author": "Ramon",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "So cool! Convenient",
      "text": "Nice rack! Easy to install. Not inly does it feel great making floor space in the garage, it looks way cooler too!",
      "rating": 5.0,
      "verified": true,
      "author": "kenny dow",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Robust and practical",
      "text": "I was a little worried, from the pictures, that these would not be sturdy enough. But, Amazon makes returns so easy that I went ahead and took a chance. I bought four of these for my home workshop, and I am very happy indeed. They are sturdy, a cinch to assemble, and include all the mounting hardware. I am even thinking about buying another one. Why not, even if I am not using it right now, it folds up flush with the wall, so it is not in the way. This is a great product. I almost spent 4 times as much for a similar system.",
      "rating": 5.0,
      "verified": true,
      "author": "Raposka",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "Cheap and effective",
      "text": "The package arrived slightly roughed-up, but all the parts were intact and there was no damage to anything. The instructions were very clearly worded, and I had the unit mounted to the wall in about 20 minutes. The folding mechanism is a little clunky, but I don't anticipate folding it up or down very often. The wheel/tire set I have is about 250 lbs. so it's under the 300 lb. weigh rating for the rack, but still a good deal of weight. The rack doesn't appear to be bending or flexing at all, so I'm very happy so far with the sturdiness of this rack, especially given the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "GrahamB",
      "helpful_votes": 28,
      "publication_date": 20111120
    },
    {
      "title": "Love!",
      "text": "Its perfect! Adjustable to how wide you want it. I have it stretched out to the max so I have 4 tires and a spare rim on there.",
      "rating": 5.0,
      "verified": true,
      "author": "Dodgelover2016",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "The nice part is that the system comes already assembled i ...",
      "text": "I use this in my enclosed trailer for supporting atv paddle sand tires, obviously not a lot of weight compared to a actual set of car tires. The nice part is that the system comes already assembled i only had to put 4 screws in for the cross supports then bolt it to the wall. Like others have said the mounting lag bolts were pretty cheep and not heavy at all (not a dense metal) i used them because of the little weight id be holding. so far everything works great. Perfect for this application!",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa McCole",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Replace the included hardware!",
      "text": "Initial thoughts on the unit are positive, with exception to the provided lag bolts. If you are mounting on a wall that has drywall, ditch the included lag bolts. They would only go into the stud about an inch or less pending on the thickness of your drywall. I opted for a 3/8\" x 5\" fastener with a shoulder. Will post a picture of the finished results when I have the unit mounted.",
      "rating": 4.0,
      "verified": true,
      "author": "ZeroDrift",
      "helpful_votes": 2,
      "publication_date": 20150704
    },
    {
      "title": "Very nice",
      "text": "So far so good. I have four wheels I placed on there. Hopefully it holds up",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Easy to install and looks great.",
      "text": "I installed to only store tires (without rims). I used the lag bolts that came with the rack, but added washers. I have 275/30-20 tires and there is less than 1/2 inch of width left. If your tires are wider, they probably won't fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "As advertised - I bought 2",
      "text": "I like it and it hold my winter tires with no problem. I will say that the design necessarily requires some bowing in the middle. The picture you see is perfectly flat. This will NOT be the case when you put tires with rims on it. It does easily fold out of the way. Make sure you find studs to install this into as the weight/leverage is strong with 4 tires/rims on them. I can easily foresee a failed installation if you just put it into drywall even with drywall anchors.",
      "rating": 4.0,
      "verified": true,
      "author": "Kingofbytes",
      "helpful_votes": 0,
      "publication_date": 20140618
    },
    {
      "title": "Great space saver",
      "text": "Was shocked how sturdy it is once it gets installed. The bars bend a little if you extend the length all the way to 42”",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan P.",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Good value, easy to install",
      "text": "This was a great buy! We fit all four of our cars winter tires on it and our spare tire - so it held five tires (4 more standard and 1 smaller (Mini Cooper). Was perfect for our needs. It's lightweight to handle and install, however we are confident it's going to hold up well - very stable!",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Great rack!",
      "text": "I bought two racks and put 5 tires on each. One rack had summer pickup tires, and the other had spare tires and wheels off my hotrod. They worked great de-clutterimg the floor of my gararge.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Excellent rack.",
      "text": "Solid construction. Clear assembly instructions. Very happy with the end result. May order a second one for my wife's tires.",
      "rating": 5.0,
      "verified": true,
      "author": "mrnuxi",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Works as intended",
      "text": "This product works great. Even with the large 20\" wheels and snow tires. Would def recommend this product, especially for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "SoaringEagle11",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Still fits the bill for second set of 4 tires",
      "text": "Second identical item that I've bought. I bought a set of winter tires for my wife and couldn't extend the original tire rack any farther. I found that I could attach this to the other set so that it uses the same stud point in the middle and I don't have to add the other arm. Perfect set up for my needs. 8 tires up and no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Exactly as described. Easy to install.",
      "text": "Was super easy to install and the directions were easy to follow. Felt pretty sturdy and all 4 of my tires fit.",
      "rating": 5.0,
      "verified": true,
      "author": "S.Kim",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Just Hanging Around",
      "text": "This tire rack is a great addition to an garage. It’s sturdy enough to hold 4 wheels at about 75 lbs each. Wow.",
      "rating": 5.0,
      "verified": true,
      "author": "Winston Newton",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Simple, straightforward installation.",
      "text": "Ability to set the width to accommodate tire/wheel width and mounting points is great. Once mounted, very sturdy and bears the weight of 4 tires/wheels easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Mildly Miffed",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "I like how simple they install and how they're adjustable",
      "text": "I like how simple they install and how they're adjustable. I was confused as to what would be a prerequisite for their adjustability (distance between your house/garage's studs) before purchasing. In the end, I bought and hung up 3 sets so that should speak volumes as to my overall satisfaction and belief in their value for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Shopper",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "An excellent solution at a good price",
      "text": "An excellent solution at a good price. It is easy to install; all necessary fasteners were supplied. Some previous reviews complained about under sized lag bolts; they must have corrected it. For years I was going to build my own out of lumber but when I finally designed and priced the materials I realized that the Hyloft was only a few dollars more and is certainly more attractive than what I would have made.",
      "rating": 5.0,
      "verified": true,
      "author": "TCJ2",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Solid rack",
      "text": "Nice rack. Had to reinstall after realizing that bars had to be adjusted (was not clear from installation instructions how to install).",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Very sturdy",
      "text": "Did a lot of research before I bought one of these. They exceeded my expectations and no worries of my 4 tires falling down. Easy install",
      "rating": 5.0,
      "verified": true,
      "author": "Drew Rose",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Quick easy to install with right tools and stud finder",
      "text": "Amazing set up! Really holding up my wheel/tires pretty well. 44.00lb with tires and wheels for the fronts, and 48.25lbs with tires and wheels for the rears. So about 185.00lbs on the rack.",
      "rating": 5.0,
      "verified": true,
      "author": "Timmy",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Five Stars",
      "text": "Excellent Rack, i was skeptical because of the cheap price but it is super sturdy! it is expandable!",
      "rating": 5.0,
      "verified": true,
      "author": "illestcrooks",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "Amazing. I used it to store my Sand Tires ...",
      "text": "Amazing. I used it to store my Sand Tires for a Rzr and it works perfect. In addition, if you have a creative mind and a hankering to optimize your living space, as soon as you take this out of the box you start to get other ideas for its use. Like, a pull up bar, or a fold down work table, or overhead garage storage if you add a top to it. Great price, great product. I plan on buying more.",
      "rating": 5.0,
      "verified": true,
      "author": "Vail Ave.",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Medium-duty, better than the pictures.",
      "text": "I couldn't see paying over $100 or more to hang my tires and wheels on the wall. I was a bit skeptical of this one because some of the pictures I saw made it look like the pipes were bent with wheels loaded, and I thought that looked cheesy. I'm happy to report that with four wide tires and wheels on the rack, it's not bent at all and it looks quite nice. Thankfully if I sell the spare wheels, I can also fold it up out of the way.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen Look",
      "helpful_votes": 0,
      "publication_date": 20130215
    },
    {
      "title": "Highly recommend!!  Great product!!",
      "text": "Love it! Read all the reviews and decided to buy! Very easy to install and is very sturdy! I have room for a fifth tire on there!",
      "rating": 5.0,
      "verified": true,
      "author": "Jayson Cintron",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "So Far, So Good!",
      "text": "Bought 2 of these to help get some stuff off the garage floor. Fairly easy to put together, had more trouble trying to find a long enough portion of the wall to mount them too. They seem to be very well built and they come with some massive screws to mount to studs. These things aren't coming down any time soon (knock on wood). Good space saver for people with smaller garages. Recommend 100% thus far.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Joe",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Sturdy and meets the need",
      "text": "This is a sturdy rack that meets the need for storage in my garage. It assembled and installed easily. Good product!",
      "rating": 5.0,
      "verified": true,
      "author": "McElligot's Pool",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great bang for the buck",
      "text": "No issues like others have complained about. Hardware is fine as long as the holes are pre-drilled. Holds (4) 225/50/17 wheels & rims no problem. Installed in 15 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "Rfojr",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Perfect for Seasonal Storage",
      "text": "For many years I have tripped over my seasonal wheels & tires in my garage. I balked at the high cost ($100+) of most wheel & tire storage racks. In early 2013 I noticed that HyLoft now offers an affordable wheel-tire rack which folds flat when not in use. I decided to try two of them: once of my winter wheels and another for my extra (track) wheels. I am impressed with the quality of the HyLoft rack and ease of installation. I am very happy with them and have recommended them to my other car-friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith W. Gilbert",
      "helpful_votes": 0,
      "publication_date": 20130527
    },
    {
      "title": "FANTASTIC",
      "text": "I AM VERY HAPPY WITH THIS STORAGE LOFT. I RECEIVED IT ON TIME AND WAS WRAPPED GOOD AND EASY TO UNWRAP. I HUNG IT IN MY GARAGE AS SOON AS IT ARRIVED. IT WAS EASY TO ASSEMBLE AND AM VERY HAPPY TO GET 4-TIRES OFF THE FLOOR. IADD A STORAGE SHELF RIGHT BELOW IT BECAUSE I HAVE THE ROOM. I AM VERY HAPPY WITH THIS PRODUCT AND I WOULD BUY FROM THIS VENDOR AGAIN.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles K. Gorga",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Easy install works great",
      "text": "Easy to install, I set up two of these in about 3 hours. I saw some comments about people complaining about the hardware but it seemed fine to me. The screws are pretty long and they got a really good bite on the stud. It didn't even creak or shift one bit while I was putting my tires on it. Really sturdy, easy to put together just make sure to tighten all the bolts on it. I noticed a few of mine were very loose. The instructions tell you to go around and snug everything up as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Chester",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Great product and very reasonable price",
      "text": "I now have 7 of these in my garage. They are very sturdy if mounted into studs, easy to install, and look great. Can't beat the price. I also put a board over some of them to turn them into a sturdy shelf, or table, and then if I need the space they fold up flush with the wall. I see no reason for buying a more expensive tire rack unless you have very very heavy wheels/ tires. I also like the flexibility in mounted width- once mounted the width is fixed, but you have a lot of flexibility with how wide they can be.",
      "rating": 5.0,
      "verified": true,
      "author": "David Lee",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Works pefectly",
      "text": "Lightweight, easy to install, and holds up well. I can do pull-ups on this rack even with it loaded down with tires. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Bennet",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Perfecf",
      "text": "Pretty awesome shelf especially for just 40 bucks. Depends on tire size can fit 5 if smaller tires. I have 5 18s on of. Assembly was super easy",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher J. Ramos",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "No Need to Spend More!",
      "text": "We bought two of these for our track/street tires. They were very easy to install and very sturdy, just make sure you mount them to studs! One of the racks came with holes that were drilled incorrectly, but customer service was super helpful and sent me a new part at no cost and no hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Reyes",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great product!",
      "text": "These are just as they are stated. Work great for storing our seasonal tires!",
      "rating": 5.0,
      "verified": true,
      "author": "Art & Beth Manansala",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Sturdy and does the job",
      "text": "Sturdy enough and does the job. Like another review states some washers would of made the install perfect. So ran out and bought some washers prior to install. Othere then that good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather and fam",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Good sturdy rack for the price, one minor annoyance.",
      "text": "This rack arrived mostly assembled. I took most of the other reviewers' advice and purchased new hardware just in case and put it against a concrete wall with Tapco concrete anchors (1/4\"). Installation was very straightforward BUT one of the round rods had powdercoating INSIDE the threads, so I had to chase the threads out before putting the bolt through. Also, all of the joints were very loose and all had to be tightened in order to function and be sturdy. Current holding up 4 tires in my garage, hope it holds up.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Chau",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Works",
      "text": "It feels and looks a little flimsy. But it works. I installed and have 5 rims and tires on them for a Mini Cooper s",
      "rating": 4.0,
      "verified": true,
      "author": "DoesItSuck",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Best to store your winter/summer/race tires",
      "text": "Follow the directions for proper solid mounting. Holds my 4 BMW winter tires 205/55 16\" works as advertised and will fold away when not needed. Fits the need it was built for. Clean chrome. I have it spread to 35\". Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Joe M (U.S.A.)",
      "helpful_votes": 0,
      "publication_date": 20160830
    }
  ],
  "product_meta": {
    "title": "HyLoft 01031 Folding Storage TireLoft, 32 to 48 Inches Wide, Supports 300 Pounds, Silver",
    "description": "Size:1The HyLoft 48 in. W Folding TireLoft is the ultimate tire storage solution, combining durability with flexibility. Its unique design allows it to fold up flat against the wall when not in use, and it can be adjusted from widths of 32 in. up to 48 in. Made entirely of strong, lightweight durable steel tubing with a scratch-resistant silver powder coat finish, the Folding TireLoft will hold up to 300 lbs. Perfect for storing seasonal tires, RV tires, and ATV tires, the TireLoft will easily accommodate up to 4 standard vehicle tires.\n\nAMAZON.COM\nThe Model 1031 HyLoft Folding Storage System is a great multi solution product - it stores seasonal tires, recreational tires or track tires and wheels... or it is a folding wall loft that stores totes, boxes, bulk products.... or it stores a bike... or it is a folding workbench. The installation is simple. It attaches to the wall studs on finished or unfinished walls. The loft is adjustable from 32 to 48 inches in width. The loft is made entirely of strong durable steel. The load capacity is 300 pounds when screwed into studs. HyLoft is recognized as an industry leader in garage storage offering unique, easy to use and versatile products to make the garage another fully accessible and organized space in your house. Add more room with little investment.\n\nFROM THE MANUFACTURER\nThe Model 1031 HyLoft Folding Storage System is a great multi solution product - it stores seasonal tires, recreational tires or track tires and wheels... or it is a folding wall loft that stores totes, boxes, bulk products.... or it stores a bike... or it is a folding workbench. The installation is simple. It attaches to the wall studs on finished or unfinished walls. The loft is adjustable from 32 to 48 inches in width. The loft is made entirely of strong durable steel. The load capacity is 300 pounds when screwed into studs. HyLoft is recognized as an industry leader in garage storage offering unique, easy to use and versatile products to make the garage another fully accessible and organized space in your house. Add more room with little investment.\n\nSee more",
    "rating": 4.6,
    "feature_bullets": [
      "TireLoft can be adjusted from widths of 32 in. up to 48 in.",
      "All steel construction with scratch-resistant silver powder coat finish",
      "Ideal for storing seasonal tires, RV tires, ATV tires, and more",
      "Holds up to 300 lbs.",
      "Hardware included"
    ],
    "specifications": {
      "Product Dimensions": "22 x 48 x 24 inches",
      "Item Weight": "14.97 pounds",
      "Department": "Home",
      "Manufacturer": "Knape & Vogt",
      "ASIN": "B0058BMNVU",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "01031",
      "Customer Reviews": "4.6 out of 5 stars802 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#16,069 in Tools & Home Improvement",
      "Is Discontinued By Manufacturer": "No",
      "Finish Types": "Powder Coated",
      "Is Assembly Required?": "No",
      "Warranty Description": "Limited Lifetime",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Storage & Home Organization",
      "Tools & Home Improvement",
      "Garage Storage",
      "Storage Racks"
    ],
    "price": 53.18
  }
}