{
  "website_summaries": [
    {
      "verdict": "Provided you don't have trouble with the lift arm or heavy weight of the jack, it has some nice qualities, especially for lifting high-set vehicles.",
      "pros": [
        "Solid steel with a weight capacity of 3.5 tons",
        "Provides a 20.5-inch lift that's ideal for trucks and SUVs",
        "Backed by a 1-year warranty"
      ],
      "cons": [
        "Heavy",
        "Occasional issues with the lift arm malfunctioning or breaking",
        "Takes more effort than expected to lift heavier vehicles"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This service jack may not be the one to carry in a trunk for emergencies, but it is ideal for repair shops, tire shops, and heavy-duty weekend warrior work.",
      "pros": [
        "Requires minimal pumping for most lifts",
        "3.5 ton capacity",
        "22\"  maximum lift height",
        "Built-in safety valve and pump bypass",
        "Swivel saddle design for precise jack location"
      ],
      "cons": [
        "Very heavy",
        "Works better on cement floors than roadside",
        "Challenging to maintain"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Only one problem after one half day if use",
      "text": "Excellent heavy duty jack I own a tire shop and the guys love it after half of day went to.pull handle.to move jack and the handle.broke riggt where it was welded . I immediately called Amazon for a return label.to make this good.i ordered new one if this one breaks as well I won't reorder again but it's exceptionally overall made well.andnworks well for.lifting cars and trucks. My husband said it can be rewelded but I don't feel i shoildnhave to \"fix\" a brand new jack. Will repost after new one comes in !",
      "rating": 4.0,
      "verified": true,
      "author": "Teresa Lupo Carrigan",
      "helpful_votes": 119,
      "publication_date": 20170817
    },
    {
      "title": "Solid jack for us \"driveway mechanics\" and you can't beat ...",
      "text": "Solid jack for us \"driveway mechanics\" and you can't beat it for the price. However mine was shipped with this nasty white gunk on the handle that will not come off not matter what cleaner I try (see attached picture). My guess is the coating chemical ate away at the styrofoam it was packaged in and became adhered to the handle. If the manufacturer wants to send me another handle I'll edit my review.",
      "rating": 3.0,
      "verified": true,
      "author": "B&C",
      "helpful_votes": 51,
      "publication_date": 20180721
    },
    {
      "title": "Other than the shoddy weld the jack works perfectly fine.",
      "text": "I took it out of the box to lift my 07 Toyota Tundra. After 3 pumps the weld at the bottom of the handle snapped off. I did not want to have to return it due to how heavy the item is. I had to get it welded. Item should not be defective right out of the box. Other than the shoddy weld the jack works perfectly fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 46,
      "publication_date": 20180805
    },
    {
      "title": "NOT A BLACKHAWK JACK",
      "text": "THE JACK IS EXTREMELY HARD TO RAISE AS TURNING THE HANDLE CLOCKWISE IS VERY, VERY HARD TO CLOSE THE VALVE. ALSO, THE JACK LEAKS DOWN SLOWLY. CASTER WHEELS ARE OUT OF ROUND AND SQUEALED WHEN MOVING THE JACK. IT WORKED WELL FOR A COUPLE OF LIGHT USES, THEN....BAM! SO SORRY I MISSED THE RETURN DATE BY 13 DAYS. DON'T SPEND YOUR MONEY ON THIS ITEM. ONLY THE SECOND ITEM I WANTED TO HAVE RETURNED TO AMAZON IN RECENT TIMES. ....I SHOULD HAVE PAID MORE ATTENTION TO POOR RATINGS.....AMAZON SHOULD HAVE PAID MORE ATTENTION TO NEGATIVE FEEDBACK AND NOT PROVIDE MARKET!!! ONE SHOULDN'T PURCHASE ITEMS WITH SUCH A LOW RATING FOR SHODDY PRODUCTS!!!",
      "rating": 1.0,
      "verified": true,
      "author": "James E. Northey",
      "helpful_votes": 6,
      "publication_date": 20200415
    },
    {
      "title": "do not buy",
      "text": "We have used this several times on some small cars. We don't do a lot of repair. We noticed the handle would release well to lower jack. Used it last night and it wouldn't release at all. Something broke inside. I know this was on cheaper side but thought I would get more then 2-3 uses out of it. Just missed the return time and now I'm stuck with some scrap metal.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren T.",
      "helpful_votes": 15,
      "publication_date": 20180509
    },
    {
      "title": "Received defective product",
      "text": "I opened the box, read the instructions and assembled this jack. I tested it without load. First time it worked well and I was happy. Second time it stuck in the UP position. It will not lower. Glad my car isn't stuck up on it- I would have been very unhappy! I scoured the internet for tips but was not able to resolve the issue. I returned this product for refund (good thing I had a really big box on hand- the way that this jack was stuck in the up position it would never fit back into the original packaging).",
      "rating": 1.0,
      "verified": true,
      "author": "JMO",
      "helpful_votes": 5,
      "publication_date": 20190112
    },
    {
      "title": "I don’t think so!",
      "text": "Arrived with original box ripped up inside another box, which was ripped and had holes in it. Missing part of handle, which is necessary to let jack down. Besides all that, the quality is horrible. Poor welds, low-grade materials. Bottom line: it’s Chinese junk. UPS took it back the next day.",
      "rating": 1.0,
      "verified": true,
      "author": "Kite III",
      "helpful_votes": 6,
      "publication_date": 20190711
    },
    {
      "title": "CAUTION!!! LEAD PAINT!!!",
      "text": "Well my original review got deleted when I hit the wrong link in the mobile app, so I’ll keep it short: First off, who uses lead paint anymore?! All the red is lead paint. The rubber pad on the head is wearing out already after being used a few times. The jack lifts slower than I’d expect a jack at this price point to lift, but works well enough when there isn’t a load on it. Other than that it does a good job and I’m hoping it will last a long time with minor maintenance.",
      "rating": 2.0,
      "verified": true,
      "author": "Gabriel Chavez",
      "helpful_votes": 3,
      "publication_date": 20190307
    },
    {
      "title": "Simple Jack",
      "text": "The quality is ok and I have used it several times to lift my suv without any issues. I am starting to notice oil stains on the floor where I store it. It looks to be coming from the gasket around the piston. I don’t see any oil collecting on the assembly but it’s definitely from the jack. Also why the hell is it so heavy? Ohhhh the look I got from the delivery guy. The look of disgust. Like I was the one who made it.",
      "rating": 2.0,
      "verified": true,
      "author": "Revnyce",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "This is one mean ol jack!",
      "text": "This baby mean buiness. I got tired of fumbling around this this mini jack I had having to work on this car every few weeks or so. I grabbed this beast and jumped back into the repairs like a pro! Worked amazing with all the up and down I had to do with the engine to get the timing belt job done. This jack came to do two things chew bubble gum and lift stuff, and it’s all outta gum!",
      "rating": 5.0,
      "verified": true,
      "author": "Cyrus Blades",
      "helpful_votes": 2,
      "publication_date": 20181216
    },
    {
      "title": "Great Product! Great Value!",
      "text": "This jack is sturdy and priced too good not to buy! It has an awesome reach so it will lift the roll-bar on the back of a zero turn, a pickup truck, an ATV, etc. This jack lifted my crew-can full-sized pickup with ease. If you have never owned a hydraulic jack before, read the instructions. You do need to purge the hydraulic fluid before your first use! The instructions do tell you how to do this.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris ",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Don’t Buy this jack it is junk",
      "text": "This is not a Blackhawk jack it’s Misrepresented use in a home garage setting this jack is garbage save your money. Wheels are junk and hydraulics starting to fail after minimal use",
      "rating": 1.0,
      "verified": true,
      "author": "Yo",
      "helpful_votes": 8,
      "publication_date": 20180702
    },
    {
      "title": "Bought 2 with same issue",
      "text": "I bought 2 of these jacks to make repairs in the garage easy. Both of these jacks have the same issue. It is not possible to tighten or loosen the handle for the hydraulics without a wrench. In order to get it to lift without slowly bleeding you have to use a wrench. I didn't have to use them right away when I bought them and missed my return window or else I would have returned them without question. I am going to attempt to correct the issue myself and will update if successful but this shouldn't be necessary.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Low quality!!",
      "text": "I brought this floor jack on October 16, 2019. I used it the second time on December 29, 2019 to perform tire rotation on my 2018 Camry (gross weight: 3472 lbs) and noticed oil leaking when the unit was under pressure. Very disappointed at the poor quality! I know there are a lot of happy customers out there so my experience could be just the outlier. Luckily, Amazon was nice enough to accept the return despite it's past their return window.",
      "rating": 2.0,
      "verified": true,
      "author": "Rottvan",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Can I give it 6-stars on sturdiness?!",
      "text": "I was a little concerned when buying this that it would be sturdy enough. I put a lot of faith in the gross weight of the lift before buying and its reviews. It's main job is to lift my Jeep JLU and Toyota Highlander - two pretty hefty trucks/SUVs. Well, I'm pretty sure it could life them through the ceiling. This is a very high quality lift, utterly silent when in use, and easy to move around given its weight. I'm a happy camper and have many an oil change and brake job ahead of me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernie C.",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Bleeding issues and no customer support even though you're forced to do part of thier job.",
      "text": "I'm honestly shocked this came and I have to bleed the system so much. I searched the internet to get the instructions and followed them 3 times. The jack is still weak in my opinion and takes a long time to get my F150 in the air. If I had to do it over again, I would not order this. I reached out to the company but never received a reply. Next time I will buy local.",
      "rating": 2.0,
      "verified": true,
      "author": "August West",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Broken!! Dont buy!",
      "text": "Terrible! Got it in and was broken in thr box!! Def want a refund asap. Shldnt have broken product at my door step and the box was completely torn apart when it got to my house. Extremely disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Shyanne ",
      "helpful_votes": 6,
      "publication_date": 20190123
    },
    {
      "title": "Does the job, good jack",
      "text": "I have a Michelin 3.5 ton and this 3.5 ton jack and I used them to pick up our 5th wheel camper to replace the suspension. this did a good job and didn't squeal in the slightest. my only complaint is that one or the rear casters seems to be slightly bent upon receiving and the wheel will not turn at all. no matter what I try when I roll the jack around that wheel won't turn. I know I will have to deal with this in the future. I took away 1 star because of the caster issue.",
      "rating": 4.0,
      "verified": true,
      "author": "James S.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Decent jack while it lasts",
      "text": "Just short of 2 years the jack quit lifting. I am not a professional or even part time mechanic, so it was not used heavily. I would say at most maybe once every 4 to 8 weeks. I am seriously disappointed in this jack, as I fully expected as little as I would be using this it would last me a lifetime, just was not meant to be I guess. I no longer have the paperwork to contact the company but they do say 1 year warranty. Hopefully others aren't having the same luck as I did as Amazon lists it as the #1 selling jack",
      "rating": 3.0,
      "verified": true,
      "author": "Robert W. Breeden Jr",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Needs Grease?",
      "text": "Maybe I am a newb. But I followed the directions and could not figure out how to get the jack to raise. The handle was very difficult to turn, but was able to rotate it left and right half a turn. Still couldn’t get the jack to raise. I took the handle out, and noticed it was all torn up from rubbing against the opening of the jack while I was trying to turn it. I grabbed my grease gun and greased the living daylights out of the part of the handle that goes in the jack, and re installed. Worked perfectly after that. So, my advice for the newbs out there is use some grease.",
      "rating": 3.0,
      "verified": true,
      "author": "Timmothy Boyd",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Poor construction",
      "text": "Just got the jack and unpacked it. Looks decent, but went to put the two piece handle together and it won't fit. The female end of the two pieces has an elevated seam that goes down the length of the handle and it appears to keep the male end from fitting properly, no amount of pushing or hammering will get it to mate together. Too much trouble to return the heavy item (the shipping box and foam fell apart once I opened the box). Going to have to grind down the pieces to get them to fit. Disappointed since i thought it would be better quality. Looks like a quality assurance issue in manufacturing in my opinion.",
      "rating": 2.0,
      "verified": true,
      "author": "Brad70",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Terrific Service Jack - Wonderful!!!",
      "text": "Like everyone else commenting here, the box this came in was damaged .. but the unit was fine. This jack is a BEAST!!! Heavy as sin and pumps cars up quickly and to terrific heights. Very well made. I am an occasional car tinkerer, changing oil and rotating tires. Doing that myself costs about $40 for filter and full synthetic and tire rotation .. as opposed to $145 at my local store .. this jack really saves time and trouble .. it's terrific.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike from New Hampshire",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "I came out to my garage lifte my 3900lbs vehicle and I heard a groaning",
      "text": "The lift is not very durable for a 7000lbs lift. While working on my car I heard noises and the next thing I knew there was a hydraulic leak, I swiftly lowered the car and came into to request a refund. Apparently you can return this item. Great, then I will at least protect from buying this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "daniel",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "great value, poorly made",
      "text": "The value for this item is great, having said that; it broke on the first use. The part that broke was the thumb depressed button that allows you to lock the lever in place and take apart the lever for easy storage. This does not severely impact the usability of this floor jack but having only used it twice and the first of which lead to a broken part, I cannot say with certainty that this is a well made product. That part is certainly not.",
      "rating": 3.0,
      "verified": true,
      "author": "Brent Smith",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Don’t buy one! Not made in the US!",
      "text": "Value for the money is not worth it! Jack handle comes into pieces and when you put it together it’s not stable. No directions with the jacked that makes sense about the adjustments or where the aisle is added in the Jack. Jack has not been used yet and leaking oil in the garage floor.Too heavy and big to send back I don’t know what I’m gonna do with it yet. Not happy!!",
      "rating": 2.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Leaks like a sieve",
      "text": "Purchased a Blackhawk B6350 Black/Red Fast Lift Service Jack on Oct 1, 2020 to use on a trailer. Followed directions and set up with little effort. Now product leaks oil everywhere I leave it. Tried to contact Amazon for support or to replace but it was after the thirty day warranty/replacement period. Thanks Amazon for your product pick! Very frustrating!!!",
      "rating": 1.0,
      "verified": true,
      "author": "CIOGraves",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Great jack for the money!",
      "text": "Am not an expert on floor jacks, by any means. I can say, however, that I'm favorably impressed by this unit, right down to the little magnetic screw/bolt catcher. Clearly, this jack will do the task for me -- lifting my old Javelin from time-to-time. In reading over the Reviews prior to making my selection, I did see where a couple of guys only gripes was that the handle didn't stand straight up for easier storage. Well, Blackhawk must have been reading the mail, because they fixed that oversight. Good product. Am quite pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Lamb",
      "helpful_votes": 5,
      "publication_date": 20160405
    },
    {
      "title": "Great mid-sized lift",
      "text": "Great lift when the little ones won't do and the big professional models are too expensive. This is a solid unit with an accurate not exaggerated lift capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "mcgrand",
      "helpful_votes": 4,
      "publication_date": 20180103
    },
    {
      "title": "To bad",
      "text": "Could not insert handle into jack. Even with the lock screw completely removed. I don’t know if paint is to thick or not machined properly. Looks like it would of been a good jack if not for that. Too late to return it for a different one. How it was able to pass final inspection is beyond me",
      "rating": 1.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "good value for the money!",
      "text": "Love this jack. it is perfect for my home garage. I have used this for my pickup, my car, my UTV'S and now I have it under an ATV. Very sturdy, it pumps up very quick until it starts to lift, then is normal lift speed. Nice addition, replaced an old cheap jack that was a gift that finally gave up the ghost. Expect this one to be around for a long time, probably longer than me!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Great looking jack, the packaging however.. not so much",
      "text": "Great sturdy jack, nice and big, finally something that fits under my lifted jeep, I recieved a destroyed box however. I didnt have any issues taking it out of the box because the box was completely opened up. Only reason it gets 3 stars is the cheap packaging, other than that this is a sturdy jack",
      "rating": 3.0,
      "verified": true,
      "author": "Zach Lee",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Great jack, works well, reliable and durable",
      "text": "This is a big and heavy jack. It’s very sturdy and strong. Lifts everything i throw at it with ease and relative speed. Haven’t had any durability issues with mine so far. Came with all parts, nothing missing during shipment . I performed the bleeding myself and it was easy. Just be carefull while removing the pin securing the handle for shipment, it has a lot of force in it",
      "rating": 5.0,
      "verified": true,
      "author": "Gael Duvivier",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "EXCELLENT FLOOR JACK",
      "text": "After having my wife's car fall off of a bottle jack & nearly kill me I decided to never get under a vehicle without it being on jack stands, which isn't easy with a bottle jack. This rolls under and allows me to lift the vehicle while safely being to the front or side. I bought this model particularly for the ability to also lift my 2015 GMC Sierra 2500HD. It's able to lift the whole front half of the truck with little effort on my part.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Byrd",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Jack was not square from the supplier",
      "text": "The jack came with a twist somewhere in it as the wheels do not all touch flat concrete at the same time. I am going to attempt to loosen all the bolts and see if it will straighten out. The fast lift system works well and then then heavy lift mechanism does the job effectively. The out of square nature has me worried, but I never use a jack for securing lifted items, always use jack stands.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191004
    },
    {
      "title": "Not recommended",
      "text": "Last 1 year and 20 days from purchased date here on Amazon. Its got stuck up and cause a big problem. The nuckle type system to release the pressure is all held together by a tiny set pin that snapped.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "3-ton floor jack",
      "text": "the jack is just as advertised and arrived in the time frame expected. The unit is shipped in the original display box (like you'd find in a store) and unfortunately at 87 pounds, the box is completely destroyed by the time the floor jack is delivered. The handle comes in two pieces with fasteners and fortunately were still with the jack upon arrival. The jack works smoothly and overall quality is what I expected and will hold up well in my shop.",
      "rating": 4.0,
      "verified": true,
      "author": "captain moore",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Average quality.",
      "text": "It lifts stuff up. Average quality but that's the trade off for being cheap like myself. Have to really screw down the valve to get it to stop bypassing when lifting. Might just be a quirk of mine. Rapid lift though which is a plus but you have to put more power into it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Pretty good",
      "text": "I use this mostly when doing an oil change on my BMW E90.If you have a sedan BMW you have to make a clearance first in the front of the car or else it'll not gonna go thru to the jacking point because of the height of this jack.This is pretty heavy so don't try lifting it.Overall the build quality is good,so far no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruh",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "From a bang to a fizzle",
      "text": "Well after owning my jack for 16 months now it is now going to the trash. Now I have a long jack handle to serve as a cheater bar out of the deal. The release valve broke and I barely got my car down when it happened. This jack should have given me many more years of service",
      "rating": 3.0,
      "verified": true,
      "author": "GLENN A. TAYLOR",
      "helpful_votes": 2,
      "publication_date": 20180605
    },
    {
      "title": "lower lift than stated",
      "text": "the online specs say 22\" lift the box says 21+\" the actual lift is only 20\" the main reason I bought it was for the lift height haven't lifted a car with it yet don't know if I will keep it yes I know how to read a rule I was a carpenter and had trade school training the jack is made in china!",
      "rating": 3.0,
      "verified": true,
      "author": "favesauto",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Too bad we can't buy American made, most would gladly pay more for quality.",
      "text": "This purchase replaced a 50 year old jack and I am hoping this one lasts for 5 years. What a shame the greedy %&$# in this country farm out all manufacturing to dirt poor labor. We have settled for marginal products as we have no choice any longer. This is the new reality, what an insult.",
      "rating": 3.0,
      "verified": true,
      "author": "DTour",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "High Capacity = Hefty Jack",
      "text": "It’s a beast of a jack. But if you need the extra lift capacity, it’ll handle it easily. I thought it had a quick lift mode, but it only works when not under load so you can fixture the jack quickly. Under load it’s conventional requiring reasonable exertion. Probably equivalents around for a few dollars less, but no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Bkjet",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Superb Product",
      "text": "The quick and high lift jacking surpasses expectations and if used a lot will greatly increase bicep size! Tough and built to last. The metal castors are also built tough to withstand the demand. It's great to see a product built to meet and exceed industry standards. It can also be used as a work out weight lifting tool though a bit clumsy. Remove handle before using it as a free weight and watch the fingers in tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott E Stringer",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "It's a jack and does what its supposed to. ...",
      "text": "It's a jack and does what its supposed to. But I do have one gripe...the handle doesn't go straight up for storage so it takes up more floor space than necessary imo",
      "rating": 4.0,
      "verified": true,
      "author": "mike g",
      "helpful_votes": 15,
      "publication_date": 20140704
    },
    {
      "title": "I like it!",
      "text": "Very sturdy jack, works very well and rolls very easily, as most have said, the only draw back is the weight, this is not a jack you want to have to carry around and lift constantly, at a whopping 89lbs, it will give you a pretty good work out but it works great and is built tough.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Wofford",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Lifts a heavy truck. But it’s heavy!",
      "text": "Jack works reasonably well even on a 3 1/2 ton truck. My only concern is that the thing is really heavy. I’m in my 60s and found it a challenge to lift, particularly given that there is no obvious handle. But I suspect there’s no way to make it any lighter without use of far more expensive materials",
      "rating": 4.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Great purchase",
      "text": "Omg, late with this review lol. Bought for my dad for his birthday. He is a semi-retired auto mechanic and his old one finally broke. My dad used this on my 2003 Corolla and 2013 Malibu. Plus he used it on his 2004 Camry Solara. He loves this but doesn't use it as much as he'd like to.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "This is one bad A__ lift",
      "text": "Has a low starting point and all it takes is a few pumps to lift high. Very sturdy and rolls good on hard surfaces",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis Kelly",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Unsafe",
      "text": "After lifting my tiny Pontiac Sunfire once the jack started to fail and could not lift the car back up. While locked I would lift the arm and instead of staying where it should it would fall half the distance that it lifted. Getting the car off Jack stands was impossible due to the car repeatedly getting slightly listen and then falling directly back onto the jack stands. Please avoid this and get a better quality jack.",
      "rating": 1.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Jack that lifts",
      "text": "You want the best bang for your buck? You looking at it, this jack lefts my Chevy Silverado classic and trailblazer like it nothing. And than gentle twist it lowers it no problem. I just grease it up but man it’s beast. It’s got weight but I take that",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Jashinski",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Defective.",
      "text": "The first one was defective. I returned it but was still charged. Replacement is defective. It won't rise evenly. Window for return closed 11 days ago. Now I have none that works and payed for 2.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Should be good jack for the money",
      "text": "Bold for handle hinge is stripped out and comes out as you jack up vehicle. Didn't want to mess with returning item due to weight and fact box was destroyed in shipping so just put tack weld on head to keep in place.",
      "rating": 3.0,
      "verified": true,
      "author": "scott nace",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Great jack for the money.",
      "text": "Great jack. Lifts very quickly with few pumps of handle. Extremely heavy but I like heavier tools because they seem a little stronger. Completely blows away the Craftsman heavy floor jack I had that gave up on me. I read alot of reviews about this jack before purchasing. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "TLA",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Great buy",
      "text": "Works great. I bought this to change the brakes, rotars, and calipers on my expedition and it worked perfectly. Only dislike is if the handle is all the way up it pulls out of Jack. Can be a pain to maneuver sometimes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Buy it if you work on your own car.",
      "text": "I was against getting an expensive jack, but my lord what a difference! Easy to assemble and use. The only caution is that it’s heavy, about 90lbs. If you dont have muscles you wont be lifting it a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Sturdiness lacking.",
      "text": "Handle becomes loose, doesnt fit well. Jack sometimes gets locked up and is hard to let the car down gently, everything comes crashing down.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Buy it",
      "text": "Worth every penny. You can feel the power when jacking and then it lowers so gently. It’s amazing. Handle my 2017 Dodge Challenger SRT 392 like it was a toy. Instills tons of confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "TBosia",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Hubby Loves it",
      "text": "Purchased this for the Hubby to work on the car. He Loves it and says its built very well and the company really though out all the details on this jack. It's quite heavy and perfectly made. Great price for what it can accomplish. 1 Happy Customer He is. Thank you :)",
      "rating": 5.0,
      "verified": true,
      "author": "AF",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "I was very disappointed and inconvenienced.",
      "text": "I used it for the first time today to lift my truck and it somehow bent.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180912
    },
    {
      "title": "Cheap quality",
      "text": "Noticed the jack was very stiff right out of the box the crank handle would lift the front of the jack off the ground unless you held it with your foot while cranking til you got it to touch what you were trying to lift and the twist to release took the grip and might of Thor himself then whatever you had lifted came crashing down there was no gentle release ever and never lifted more than 1,000 lbs but after 5 months it leaked so bad I just threw it away cause apparently returning was no longer an option",
      "rating": 2.0,
      "verified": true,
      "author": "Taylor feris",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great Jack",
      "text": "This is a great jack, after using it a few times I know I can trust it. The jack is very, very sturdy and has no issues lifting anything I have thrown at it. Reading a lot of comments, people said shipping was a nightmare so I was a little hesitant, but after buying it I did not have any shipping issues, except for it being a day late due to weather, but no other issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Cavustius",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great jack! Worth the money!",
      "text": "First jack purchase after many hours of research. This guy hasn't let me down yet. Lifting my 97 4Runner with 3in lift, lowered 87 mr2 and average 06 tundra. Paint is lasting and wheels still roll great!",
      "rating": 5.0,
      "verified": true,
      "author": "Seb",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Heavy duty jack for shade tree mechanic",
      "text": "Needed to replace shocks and struts on a Jeep Grand Cherokee and my 30 yo jack finally gave out. This jack made the job so much easier and safer. It is large, heavy and stable. The screw holding the two piece handle together had to be replaced, so took off 1 star for sturdiness. A great addition to my tool kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Mattski",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Wonderful",
      "text": "Love it. Just what I needed to lift my Jeep Liberty. I centered it on the Passenger side and raised the vehicle high enough to place the jack stands. Love the quick raise on the jack. Am amazes and happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph pala",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "The Beast is Back",
      "text": "Works great and lifts quickly with only a few pumps. Wish it had a quick release for the handle instead of the bolt.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter ",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Fits under my 05' GTO",
      "text": "I needed a floor jack that didn't cost a ton, or 3.5, and this fit the bill. Worked great for my 05' GTO for changing the brakes and rotors and also on the wife's Honda Odyssey.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad S.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "What a MONSTER",
      "text": "This is not your kiddy floor jack. This thing is a MONSTER, heavy, very sturdy, well put together I bet if it had a bigger ram you could use it on a semi truck. I might need to add more concrete floor to use this thing. I will wear out before it does I bet.",
      "rating": 5.0,
      "verified": true,
      "author": "ranger",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great product - very heavy and heavy duty!  Worth it!",
      "text": "This thing is super heavy! Love it!!! The handle is a bit hard to turn which I am sure will loosen as it gets used! Has worked like a charm everytime we use it!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Shackles",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Quality",
      "text": "very heavy duty, lifted up my truck with ease. Only downside (unless i missed it) the handle doesnt lock in place, so wheeling it around the handle falls off.",
      "rating": 5.0,
      "verified": true,
      "author": "larold",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "love this jack",
      "text": "i was always holding out getting a low profile jack but i finally gave in so i got this one. i just hate myself because i hurt my back couple of times with the other jacks but this one is actually pretty good for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby P.",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Works great!",
      "text": "Works like a champ! I was reluctant to pay so much for a jack, but this thing is head and shoulders above my little 2-ton jack I had been using.",
      "rating": 5.0,
      "verified": true,
      "author": "PghNeuro",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "If you're wanting a jack for your garage this is fine, but if you're wanting to move around with ...",
      "text": "The only reason I'm not giving this 5 stars is because its EXTREMELY heavy. If you're wanting a jack for your garage this is fine, but if you're wanting to move around with it, this is NOT the jack for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Yeisha Lee Sarceno",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Was not new.",
      "text": "Came in a box that looked like it was dropped from a 100 feet and then taped together. The jack was not new and did not work. Will be returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "A Man and His Toys",
      "text": "My husband LOVES this jack - especially for his truck. It's his favorite toy! He was in need of a new one and this fit the bill!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Hudson",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Awesome heavy duty jack. Great quality",
      "text": "Perfect for working on my Jeep JK in the garage. Even with the 3 in lift on my jeep the jack still raises the it high enough to lift off the ground and insert stands fully extended below the axle. Would buy again. Also its heavy. Very heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Great floor jack for SUV's and pick-up trucks.",
      "text": "This floor jack is well-built and heavy. I bought it to be able to rotate the tires on my SUV and my half-ton pickup. It does work great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Don’t buy it",
      "text": "I bought it Jan 5 2018. Today is feb 19,2018 it’s broken.",
      "rating": 1.0,
      "verified": true,
      "author": "joseph cruz",
      "helpful_votes": 5,
      "publication_date": 20180219
    },
    {
      "title": "Ehh",
      "text": "Worked for awhile. Need to hold the bar to keep it elevated after a couple of uses. Probably not meant for regular use on a farm",
      "rating": 3.0,
      "verified": true,
      "author": "Beans",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Works perfect for lifting a vehicle",
      "text": "This is a perfect jack for lifting a vehicle for oil changes or maintenance. Don't forget to get chock blocks and jack stands.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary S. Banks",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "A little expensive, but makes lifting car really easy",
      "text": "I've used heavier jacks, so this is not too bad. The rubber bump on the lift helps not wear out the frame or jack point you're using.",
      "rating": 5.0,
      "verified": true,
      "author": "Daegun Bong",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "It's heavy, therefore sturdy, concrete only",
      "text": "Have had good luck with this so far. It is heavy but no big deal when on concrete. Can lift whole front end of a car with one arm while laying down and lifts pretty quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry R.",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Only thing I didn't like was the handle didn't stand totally vertical for storage ...",
      "text": "Jack seems to work well. Very fast to load then seems strong. Only thing I didn't like was the handle didn't stand totally vertical for storage but a couple minutes with a grinder and cut off wheel I modified the frame to clear the handle and fixed the problem. That's the reason for four stars",
      "rating": 4.0,
      "verified": true,
      "author": "poco",
      "helpful_votes": 6,
      "publication_date": 20151128
    },
    {
      "title": "Worked like a champ.",
      "text": "I think it should come with a heavy duty mounting bracket so you can hang tbis heavy sucker on the wall out of the way. But.. maybe if you have a mechanic shop thing happening it'll fit right in.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Joshua",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Great Jack",
      "text": "Easy to use lifts the amount it says with ease doesn't raise fast though when weight is on it but beyond gets the job done lifts my lifted truck high enough without having to add blocks",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Campbell",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Great jack",
      "text": "Had a smaller harbour freight jack blow a seal while changing a tire on my boat trailer on the way to a week long vacation. A man stopped on the side of the road to help me and he had this jack about 3 pumps and the trailer was off the ground enough to change the tire. When I got to our beach house I Immediately got on Amazon and ordered so far so good",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Concerned about safely lifting 1 ton with 3.5 ton jack.",
      "text": "Lifted one side of 2 ton car twice and it started to bleed down. Lost confidence that I would be able to get my jack stands out from under car.",
      "rating": 1.0,
      "verified": true,
      "author": "derek francis",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Bigger is better.",
      "text": "This thing is massive and heavy! Just arrived today and I like it. Have seen a few reviews about the weld on the head that spins this monster up and down falling off so I'll update this later if it happens.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Amber",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "bad caster",
      "text": "wondering where i can get a caster for my new jack, maybe should return the whole jack for replacement",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 2,
      "publication_date": 20180906
    },
    {
      "title": "Good Floor Jack for the price",
      "text": "This is a great Jack My go to Jack every time good lift height fits under most vehicles without adjustment and has a good pump to lift ratio",
      "rating": 5.0,
      "verified": true,
      "author": "Trath",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Heavy Duty",
      "text": "It's a damn good thing this jack has a good set of wheels. It is a well built, heavy jack! More time is needed but we are off to a great start.",
      "rating": 5.0,
      "verified": true,
      "author": "Presley",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "CANCER & REPRODUCTIVE HARM P65 WARNING!!",
      "text": "Website silent of CANCER & REPRODUCTIVE HARM P65 WARNING!! I wan't to lift my vehicle.. not endanger the lives of my unborn children or myself. Shameful and without excuse. Complete waste of my time. Will not open a product that will cause me CANCER and REPRODUCTIVE HARM!!",
      "rating": 1.0,
      "verified": true,
      "author": "Incentive Buyer 48$",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "incredible jack",
      "text": "this jack is superb. it is a fast lift jack. it easily and smoothly jacks up my vehicle including a kia sedona minivan. i would highly recommend this jack.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff G",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Great so far",
      "text": "Great product. Need it for oil changes and it does the trick. Held up my 2015 Challenger without a problem. No complaints thus far",
      "rating": 5.0,
      "verified": true,
      "author": "LakersRavensFan",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Heavy Duty",
      "text": "By Far the Best Jack I've ever owned! Also, all my friends love to use it",
      "rating": 5.0,
      "verified": true,
      "author": "johnnyreb 2010",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Heavy",
      "text": "Good jack but very heavy.If you don't care about the weight you cannot go wrong",
      "rating": 4.0,
      "verified": true,
      "author": "Eric Beaver",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Cheap build quality",
      "text": "Pretty disappointed in the quality. some of the parts don't fit at all. Very poor build. Wish I could post my video here 😂",
      "rating": 1.0,
      "verified": true,
      "author": "arthu",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Very good value but.....",
      "text": "Two things: 1- The lift makes a disturbing creaking noise when I lifting my minivan 2- The product video makes it look like lifting 4,500 lbs is easy -- it takes a real effort One very good thing: The lift lowers in a very controlled manner unlike the cheaper lifts that I have owned in the past. Concl: Best lift you can get for under $100.",
      "rating": 4.0,
      "verified": true,
      "author": "JONG YOL LEE",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Great product",
      "text": "Best lift purchase do far It is heavy AF thou If you can lift heavy objects it's ok If your not used to lifting heavy stay away",
      "rating": 5.0,
      "verified": true,
      "author": "Sef",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Leaking oil and stopped working 1 hour into use.",
      "text": "Felt heavy duty and great until it started leaking oil/fluid from the pump an hour in. Would not pump, not safe at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Toby",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Amazing Jack",
      "text": "Perfect for the job. Very easy to use, and I like the wheels, but also that there is a place I can but the lugs while working the tire, so I don't lose them.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel",
      "helpful_votes": 0,
      "publication_date": 20181207
    }
  ],
  "product_meta": {
    "title": "Blackhawk B6350 Black/Red Fast Lift Service Jack - 3.5 Ton Capacity",
    "description": "Fast Lift to the Jacking Point\n\nBlackhawk B6350 Service Jack is a 3-1/2 ton (7,000 lbs) capacity service jack that features the unique design of fast list technology to fast lift to the jacking point with no load.\n\nIt features the swivel saddle that provides you with the easy jack positioning and user safety. Its heavy duty steel construction also provides you the safe use and long term durability.\n\nBlackhawk B6350 Service Jack also features the bypass device that preventing the damage from over pumping.\n\nBlackhawk B6350 Service Jack also features the built-in internal safety valve and vent plug to ensures the safe operation.\n\n- 3½Ton (7,000 Lbs.) Lift Capacity \n- Fast Lifting Technology \n- Heavy Duty Steel Construction & Swivel Saddle \n- Built-In Safty Valve and Bypass Device Blackhawk B6350 Service Jack is backed by the full one year warranty from the date of the purchase.\n\nClick the buy button now to get your long lasting professional sevice jack",
    "rating": 4.4,
    "feature_bullets": [
      "Built-in internal safety valve and vent plug ensures safe operation",
      "Swivel saddle provides easy jack positioning and user safety.Saddle Diameter: 4 inch",
      "3.5-ton/7,000 lb. lift capacity",
      "Jack Size: 28 1/2\" L x 13 3/4\" W x 6 1/2\" H",
      "Rugged universal joint for precise load control",
      "Great for working in the garage and other outdoor activities such as picnics or ball games",
      "Note: The hydraulic jack is designed to lift, not to support the object. Immediately after lifting, loads must be supported by a pair of appropriately rated jack stands"
    ],
    "specifications": {
      "Manufacturer": "Blackhawk",
      "Brand": "BLACKHAWK",
      "Model": "B6350",
      "Item Weight": "85 pounds",
      "Product Dimensions": "28.5 x 13.75 x 6.5 inches",
      "Item model number": "B6350",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "B6350",
      "Folding": "No",
      "ASIN": "B0054WGRBA",
      "Customer Reviews": "4.4 out of 5 stars1,025 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#2,978 in Automotive",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "June 7, 2011"
    },
    "categories": [
      "Vehicle Lifts, Hoists & Jacks",
      "Floor Jacks",
      "Automotive Parts & Accessories",
      "Jacks",
      "Tools & Equipment",
      "Garage & Shop",
      "Automotive"
    ],
    "price": 199.99
  }
}