{
  "website_summaries": [
    {
      "verdict": "While they're no bargain, the Bose QuietComfort 15s currently offer the best sound and silencing capabilities in a pair of noise-canceling headphones.",
      "pros": [
        "Extracomfortable design",
        "improved sound",
        "highly effective noise-canceling circuitry",
        "device folds for compact storage in included carrying case",
        "30-day home trial"
      ],
      "cons": [
        "Expensive",
        "when the battery dies, so does the music"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 7.0,
        "Sound": 9.0,
        "Value": 7.0
      },
      "publication_date": 20130312,
      "rating": 8.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not up to the standard I expect from the costly Bose brand",
      "text": "I was very frustrated with this purchase. I had owned this same model for several years before it stopped working for me (I believe there is a problem with the on/off switch connection). Before it stopped working these headphones were perfect, so I ordered the same model in May 2017. By September 2017 they stopped working (same problem, I think). It's too late for a refund from Amazon, and I haven't yet tried to contact Bose because they're an older model. I'm sick over this purchase because I loved my first pair and don't know how to replace them/find another brand that I like as much as these when they work.",
      "rating": 1.0,
      "verified": true,
      "author": "jed",
      "helpful_votes": 3,
      "publication_date": 20171017
    },
    {
      "title": "Over priced and over rated",
      "text": "I’m writing this review after traveling 30 hours each way without my headphones working. They just stopped working after 5 trips back and forth between USA and Thailand. Nearly 300 bucks. I agree with other posters about build quality vs price. They did work great when they did work. How disappointing to have them not work this trip! And just try to get product support!!?? Website takes you in many directions but not to a real person to talk to. But that would be easy for the consumer and costly for the company! I’ll try calling the customer service number that amazon provides when they open and see if I have any better luck!",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Good Headphones",
      "text": "The headphones are extremely comfortable on the ears. When you turn on the noise cancelling switch, it blocks out nearly all of my surrounding sound so that I only hear what's playing on my mac or phone. When I'm not playing music and I use it for complete silence, I can still hear some things. If I'm in a coffee shop, I will still hear people talking, however I can't understand their entire conversation, it'll just sound muffled. Of course for the price I would've thought the noise-cancelling would be better, but I still like the headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "cheezee",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Very nice headphones",
      "text": "While I know there are supposedly better options available now, these suit my needs perfectly. They sound quite good, they're more comfortable than all my other headphones [granted, all my other headphones are cheapies, so I get what I pay for...] and they were reasonably priced. I absolutely recommend these to anyone who can still tolerate being wired to the device being listened to. This seems perfectly normal since I've been listening this way since the 70s... but I might still try the latest wireless ones eventually and then give these ones to the missus as a present.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiberius J. Nougat",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Beware of significant battery problem",
      "text": "Like some of the other one star reviews, I loved these headphones. 9 months after I bought them the battery portion failed, and the headphones are useless without an active battery connection. Since still under warranty, they replaced the head phones. Now, two months after end of warranty the second pair of headphones failed just the way the first set failed. You would think that at these prices a simple battery connection would not be such a significant problem.",
      "rating": 1.0,
      "verified": true,
      "author": "archer",
      "helpful_votes": 9,
      "publication_date": 20140827
    },
    {
      "title": "Failure in Bose Head Phone padding cover",
      "text": "These headphones are good. However after less than 4 years of occasional use, the cover of the internal padding of the right ear piece is coming apart and exposing the spongy padding inside. I am disappointed and don't know if Bose covers this through some warranty. These head phones are among the most expensive in the market and I expected them to last longer. I would definitely not buy them again. This model is also a bit old now and they have newer models. I have treated them with utmost care and always keep them in their original (zipped) pouch when not in use.",
      "rating": 3.0,
      "verified": true,
      "author": "M.Techy",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "They helep a lot; would like more silence",
      "text": "They work, and the sound is great, and they are quite small. I believe they have been replaced with a newer model, that seems to be a tiny bit better. My gripe -- only one, I WISH the people that make noise cancelling headphones would provide adjustable attenuation; sometimes I want the noise around me attenuated more than these offer. I hardly ever use them as headphones when on an airplane (often, too much maybe) and sometimes want to be able to completely attenuate the too loud conversation of the guy behind me or the kid two seats over playing his gamething at high volume, or the 20 something in front of me with earbuds cranking out 105 d.",
      "rating": 5.0,
      "verified": true,
      "author": "review 86",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "Horrible build quality–opt for more durable options",
      "text": "These headphones are incredibly cheaply made. I bought mine a few years ago and used them very sparingly. When I went to change the battery the second or third time, the tiny wire that connects to the negative end of the battery broke in two. They have been sitting idle since. I cannot solder it back together because the battery compartment is too small, so it is not repairable. I opened them up to see if I could find a way to fix it, but it's as if these are designed to be unfixable. Waste of ~$250.",
      "rating": 1.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Don't Buy this ANR set",
      "text": "Died after 3 years. Sent it for repair - around $50. Worked fine for 6 months. Now dead again. I'm trashing it and filing under Buy Other Sound Equipment, ie BOSE. Recommend - Don't buy it",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Shmoe",
      "helpful_votes": 4,
      "publication_date": 20170629
    },
    {
      "title": "So comfortable and great sound",
      "text": "I purchased this after buying highly rated Skull candy head phones. The Skull Candy headphones made my head hurt after a couple of hours. The Bose Quiet Comfort 15's I could wear them for days. The triple a battery lasts hours. I keep forgetting to turn the headphones so I go through way more batteries than is necessary. I also own Bose noise cancelling ear buds. I love them too.",
      "rating": 5.0,
      "verified": true,
      "author": "knitter4years",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Sound",
      "text": "I am very picky about sound, have a high end stereo at home. The sound of the QC15 is outstanding, you can easily separate sound components, the bases are deep enough to be real-like and rounded without sharp surroundings, not the tap-tap sound of cheap sound systems. I haven't tried it on a plane but at home it nicely muffled completely my noisy heating system, grand kids screaming in the house, the old fashion flashing toilet, oh well you get the idea. If in doubt, give it a try, the return policies are excellent. I didn't give a 5 star simply because I don't know what perfect is.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 2,
      "publication_date": 20140211
    },
    {
      "title": "The product is great, but it does not have any warranty - ...",
      "text": "The product is great, but it does not have any warranty - The seller said it has one year warranty and Bose will honor it; but Bose said the warranty had expired but the time they sold it!!!!!!!!!! It is not working now and nothing can be done.",
      "rating": 1.0,
      "verified": true,
      "author": "FrozeninMinnesota",
      "helpful_votes": 2,
      "publication_date": 20171114
    },
    {
      "title": "Great experience. Hope Bose continues making",
      "text": "Really comfortable with great sound. A member of the audience coughs and I looked right to see who! Really makes watching on the computer a treat. Is plugged into the computer,(radio, phone,etc.) and a new battery about every week of use. I can see why these were so expensive when they first came out. Noise canceling is amazing and a big help to listening.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Easterbrook",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Short-lived",
      "text": "These were fantastic at first but the noise canceling (which is really the only reason to buy them) completely stopped working within a year for no apparent reason...not worth $300 with such low durability.",
      "rating": 1.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 5,
      "publication_date": 20160418
    },
    {
      "title": "Awesome headphones, awesome noise cancellation, only one negative point...",
      "text": "These things are awesome, I would have given them five stars except for one negative that is a real bummer, since I wanted these for the office: They leak too much sound! I wanted closed headphones so I would not disturb my cubicle neighbors, and I have some Sennheiser studio headphones that are AWESOME as far as having very little sound leakage, but they don't sound as good to the user as these do! I think I will need to keep the volume down, which is hard to do because they sound so good! If you want them for home, traveling on airplanes, etc., they are perfect, albeit pricey.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter in Maine",
      "helpful_votes": 3,
      "publication_date": 20130508
    },
    {
      "title": "Great but....!",
      "text": "First off don't get the idea that these will block out all noise no matter how loud, because they wont, especially if in close proximity to a boom box. + Very comfortable for long term wearing. + flexible and adjust to a wide variations of head shapes and sizes - Drains batteries quickly - the cable it comes with is very poor quality and I had to purchase a more expensive one from a 3rd party - seems a little overpriced",
      "rating": 4.0,
      "verified": true,
      "author": "LtTora",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "A must have for plane travel",
      "text": "These are great!. My wife and I fly fairly often together and separately for work. My wife was coming back and sat next to someone that was using these. She talked to him about them and he gave one of the cards that came with the headphones. She then bought me a pair for Christmas. All I can say is that these are great on planes. I've flown for years and have never been able to really relax or sleep. Until now I thought I had been. The first trip I took with these, I came off the plane feeling much better than usual. Until you try them you won't believe how well they work.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim M",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Good, but not great",
      "text": "I've been using these for many months at work to focus in a noisy environment. They cancel noise out much less significantly than I had expected. They seem to be made to cancel out white noise from airplanes vs. insert white noise to cancel out nearby conversations. The sound quality for music is very good. I've already had to replace the cord used for iPhone's that includes a microphone; my mic stopped working. It's been an expensive experience.",
      "rating": 3.0,
      "verified": true,
      "author": "cm",
      "helpful_votes": 2,
      "publication_date": 20151128
    },
    {
      "title": "Great for air travel.",
      "text": "Very good noise cancelation. Better than average sound, not quite as good sound quaility as my HiFiMan but not in the same price category. These are just great for travel. Purchased for flying, you know, crying babies, people playing music and video games without head phones, etc. You can also just wear them in noise cancelling mode and they definitely quiet things down. Very pleased. A little bulky for traveling but lightweight and comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Richie Rich",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "Decent But Overpriced.",
      "text": "The noise cancelling part is fairly effective and the headphones are reasonably comfortable, though far from the most comfortable I've had. But I had to get a replacement within a few weeks because the first one broke for no discernible reason. Further, though I imagine it is nice sometimes going cordless, most of the time it just gets annoying how easy it is to accidentally rip the cord out of the headphones. There should be some sort of locking mechanism or a bluetooth adapter or something. It's really aggravating to move a couple inches and suddenly have the cord come flying out the headphones. Something you pay three hundred dollars for shouldn't have this sort of aggravation.",
      "rating": 3.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "My dream headphone!",
      "text": "I got these originally for my father who suffers from extreme noise sensitivity causing severe migraines. His frequency with headaches and migraines has reduced dramatically. He wears them on long trips and when he just needs some peace. He also loves the clarity of music. Nothing better than some \"Dark Side of the Moon\" to destress. Then I needed a pair because my work environments fluorescent lights we're making my days unbearable to work. They are well worth the money. Amazing for air travel or just to relax in your favorite chair. They are well built and can handle a 3 year old tossing them and pulling on them. Thank you Bose for an amazing stress reliever and product :)",
      "rating": 5.0,
      "verified": true,
      "author": "chelput",
      "helpful_votes": 0,
      "publication_date": 20131229
    },
    {
      "title": "Too much ear pressure, prefer to ae2",
      "text": "The sound quality coming from this headphone is exactly the same as bose ae2. The noise canceling is fantastic. You don't even have to listen to any music, once you turn it on, you will stop hearing most of noise. However, I really cannot wear this phone for more than half hour. I feel ear pressure immediately, like I'm taking a high speed elevator, my ears get sweating, and hot. The pressure sends a biological response to my stomach and thus feel a little sick. I love the sound and function. But obviously, this is not for me. The other downside about this earphone: it is tied to a AAA battery. It cannot function without using the battery.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan InGold",
      "helpful_votes": 2,
      "publication_date": 20130829
    },
    {
      "title": "Nice Headphones",
      "text": "I use these all the time at work to drown out the office noise and other conversations. The noise cancelling by itself is good for white noise but not so great for other noises (like voices). In combination with some hardcore metal however it does the trick nicely on all noises up to and including fire alarms. Fit is quite comfortable, I have worn these for hours on end (including international flights) with no issues. Battery life is OK, just keep a couple spares in the included case.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Brodowicz",
      "helpful_votes": 2,
      "publication_date": 20150105
    },
    {
      "title": "Great for reading while hubby watches TV",
      "text": "These Bose QuietComfort 15 noise canceling headphones are the perfect solution for me to read in quiet. I love being immersed in a book on my Kindle, while my husband watches TV. I was just too distracted by all the noise in the room. The noise cancelling feature puts everything in the background, and with a relaxation audio playing, all other sound disappears. (I use an underwater MP3 while I read.) The sound quality is vibrant and rich, and the ear cups are incredibly soft, so they are extremely comfortable. They offer the superior quality that I have come to expect from Bose, and come with a nice hard case for storage or travel. Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Great headphones for studying and blocking out noise.",
      "text": "Best pair of headphones I have ever owned. They are comfortable and they block out background noise very well. A must have if you are going to try to study in a crowded coffee shop or a library near finals time when things get a little bit loud. Sometimes I'll even use them without music playing just to block out excess noise. The sound quality is also really good. I'm no expert but I enjoy listening to just about any type of music on these. The battery life is great, but you may want to keep one spare AAA battery on hand just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Don M.",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "The best of the best...",
      "text": "We could write a huge review full of our perspective and technical facts, however, everyone else who likes or dislikes Bose has done that already. We purchased two pairs for our college aged kids and they love them. I have a pair that I've used for years for business travel, and enjoy them every time I'm in the airport or tin can they call a plane.....especially with young kids or babies around me!!! Amazon has the best price, quality, delivery, so what else can you ask for right? Lot's of choices out there, so if you have the time or you're into the latest style these might not be for you....however, stay with the proven leader.....go with Bose!",
      "rating": 5.0,
      "verified": true,
      "author": "cperfection",
      "helpful_votes": 0,
      "publication_date": 20140222
    },
    {
      "title": "Comfortable and great noise-cancelling",
      "text": "I've had to use these headphones a lot lately to watch movies without disturbing my family. They're very comfortable for two hour movies and the battery lasts a long time compared to a cheap JVC noise-cancelling set that I used to have. I never thought I would pay $300 for headphones, but these are definitely worth it. The noise-cancelling works well so you protect your hearing because you don't have to turn on the volume that high to hear what's going on. I love these so much that I recommended them to a coworker and he also purchased them and loved them.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Jones",
      "helpful_votes": 0,
      "publication_date": 20140215
    },
    {
      "title": "Just Completely Terrific",
      "text": "Why did I wait so long? These are amazing! Light and comfortable (and I used them while wearing glasses on board planes), they helped me sleep more soundly on two transatlantic flights than I ever have in years of flying. I mean solid, uninterrupted, heavy sleep. I put them on, set some soft music going, and was gone. They're perfect, too, for watching a movie or whatever and yet hearing the register of the flight attendants. Best of all, I also used them in London to help me chill in my flat, and even to fall asleep at night, either with music, or just with the noise cancelling. I recommend these unreservedly.",
      "rating": 5.0,
      "verified": true,
      "author": "Viking2020",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Noise cancelling beyond expectation or compare",
      "text": "I'm no audiophile so see other reviews if you want that level of detail. I will say that these headphones are life changing on a flight. I've logged a lot of air miles recently, including two long hauls. I usually have a headache after flying just from the noise - but not if I wear these. I bought them for my parents as well. Hard to believe that I've spent almost $1,000 on headphones this year but they are worth every dime! (FYI - I had previously owned a pair of $50 noise cancelers from Sony and there is absolutely no comparison.)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "The BEST",
      "text": "I got these for my partner and he LOVES them. I am so jealous, now I want a pair for myself. He uses them all day long while he is in the studio to keep out the sound of the stuff going on outside his curtain, and they work really well. They do run through batteries quite a bit if you use them that much, but well worth it. It can also be hard to remember to turn them off after you are done for the day, so keep an eye out for the red light. If you can afford them, THIS IS THE WAY TO GO, so stop looking and wasting your time reading reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Collie Lover",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "Great Headphones",
      "text": "I received these as a Christmas gift and they are terrific. Wonderful fidelity, and great noise cancelling. My wife has had a set for several years and they have held up well. I guess she got tired of my using hers. Will really be appreciated on plane trips. By the way, it does come with a case, which my wife didn't realize that and ordered a separate case. The return (reviewed separately) on the case was not pleasant; they wanted me to mail it to China! But don't let that dissuade you from purchasing these headphones; they're great.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Gehring",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Very satisified.",
      "text": "Pros: excellent battery life comfortable fit good noise cancellation good quality sound great travel case Cons: Not wireless (wish I could find a Bluetooth edition.) Unable to use the headphones without noise cancellation (sometimes I need to be interrupted) I haven't yet found a great pair of wireless noise cancellation headphones but for wired headphones, these are really enjoyable. If I could still use them and be able to turn off noise cancellation, I'd easily give this a fifth star. Not disappointed at all in the purchase though!",
      "rating": 4.0,
      "verified": true,
      "author": "Mateo Spencer",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "Amazing!",
      "text": "Never had noise canceling headphones, let alone a Bose product. I always thought they made a nice product, but a little too pricey for me. I finally bit the bullet and purchased the QC15. All I can say is \"WOW!!!\". The headphones that I paid $60 for about 6 months ago are now going to my daughter as a hand-me-down gift. The noise canceling feature works amazingly well. I didn't know what to expect, but now I know what the hype is all about. And to boot, the acoustics in this little headphone is simply amazing. I can't wait to use it next week on my flight.",
      "rating": 5.0,
      "verified": true,
      "author": "Thorsten Felies",
      "helpful_votes": 3,
      "publication_date": 20140617
    },
    {
      "title": "Would recommend",
      "text": "These are spectacular. I sat through a 2 hour flight with a screaming baby behind me, an overly PDA couple beside me, and a loud snoring guy in front of me, but couldn't hear a thing with these on and music playing. I've had them for a year and the durability is still superb. I use them in Starbucks while studying, and they block out about 85% of the sound. I listen to everything from dubstep, country, pop, rock, rap, house, trap, Norwegian death metal, country, to classical music and these headphones produce great sound for them all.",
      "rating": 5.0,
      "verified": true,
      "author": "ICantBelieveThisUsernameIsntAlreadyTaken",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Do not buy recommended accessories!! They are in box!",
      "text": "Fantastic headphones for plane travel - they pretty much kill the jet roar. Buyers should realize, though, that these are not designed for canceling human voices (so not a great help for coffee shops, say, or cubicle offices). NOTE: AMAZON-RECOMMENDED ACCESSORIES ARE ALREADY IN THE BOX! The headphones come with a carry case and separate 2-prong airplane adapter. For no clear reason, Amazon recommends that you buy these two accessories as part of a special bundle. I trusted them only to find that the box already included the accessories. Grrr. Guess who has to pay the postage to return the duplicate items that Amazon lured me into buying? Grrr again. Oh, and the recommended bundle is STILL shown. Pretty irritating.",
      "rating": 4.0,
      "verified": true,
      "author": "Frank Rogers",
      "helpful_votes": 0,
      "publication_date": 20121214
    },
    {
      "title": "Great noise cancelling headphones with the Bose name",
      "text": "These things are awesome! I fly often enough that I wanted a nice pair of noise cancelling headphones. These work very well, and these were a refurbished pair. They came in and looked as if they were 100% new. I have had them for about a year now with no issues or complaints. It came with a nice hardshell case to prevent damage when tossing them into a bag or briefcase. The battery life is excellent and I think I've only changed them 2x in the past year with considerable use! As a note - always keep a spare battery (AAA) on hand - if the battery dies you won't be able to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "amland1",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Works great but not durable",
      "text": "The sound quality you expect from Bose, but these headphones aren’t durable. The ones my teenagers use barely made it a year. I was careful with mine, and it didn’t last much longer.",
      "rating": 3.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "I haven't found a better set. Cancels most background noise",
      "text": "Expensive, but effective. I haven't found a better set. Cancels most background noise. It won't save you from someone shouting nearby. The plug wears out fast, but is detachable and therefore replaceable. I go through about 1 AAA battery a month. I can't leave it on for extended periods because even when it isn't playing it is canceling noise. I end up with a pressure headache. Sound quality is very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Mutch",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Love these on the Plane!",
      "text": "3 pair of Bose so far in the family, very happy with them, I'm no Audiophile, but I think they sound great, and for the reason I buy them, mainly for taking me away from the planes I'm on, they are Perfect!! Update, just bought a 3rd pair of the QC15's, in my mind their the best noise reduction for me, but like I said I am no Audiophile, I'm sure there's people who would disagree with me. I just love the affect they have on my time on the plane, we even just got my 76 year old Mother a pair, and she just loved them!!",
      "rating": 5.0,
      "verified": true,
      "author": "Simon John Crawford",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Dead on Arrival",
      "text": "These arrived not working. No light, no sound. I work in Africa so it took quite a while to get to me so very disappointed. I would not buy from this seller again.",
      "rating": 1.0,
      "verified": true,
      "author": "dj",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great!",
      "text": "I was hesitant paying $300 for headphones. I've had them for over 2 years and don't regret the purchase one bit. The sound quality is great. I'm not an audiophile, so I don't nit pick, nor do I expect absolute perfection. An added benefit that I didn't anticipate - wearing the headphones by themselves, without music, for noise canceling sanctuary of silence. Don't expect it to cancel out all noise completely. You will still hear high pitched noise. It will block out significantly, noise from outside your home (lawn mowers, screaming kids etc.), the rumbling of your refrigerator, air conditioner and other extraneous noises, and the ever complaining housemate, wife, mother etc. (just don't let them catch on ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Ropik",
      "helpful_votes": 0,
      "publication_date": 20130531
    },
    {
      "title": "Bose rocks.",
      "text": "These headphones have drastically improved my being able to work in my noisy cubicle farm. I can focus on my job while blocking out the 5+ conversations going on at any given moment. A must have for anyone with sensory issues related to sound. They work perfectly and they don't drain the battery. On a side note, these are authentic Bose. There have been a few knockoffs floating around so check your serial number on the Bose website to make sure.",
      "rating": 5.0,
      "verified": true,
      "author": "hahawhat?",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Most comfortable headphones I own",
      "text": "Most comfortable headphones I own. Does a great job of noise cancelling. Sound quality is pretty decent, but not at the level of reference grade headphones. Only gripe (and not even worth losing a star over) is that it *only* works when powered (ie. when the battery dies, so does the sound). That said, it gets excellent battery life, and the carrying case even has a convenient zipper pouch for a couple of extra AAA's.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Makes that long plane ride much less painfull",
      "text": "WOW - what more can I say. This product does as advertised, but so has all of my other Bose products. Background noise is almost completely eliminated when not connected to an electronic device. When listening to anything at all, all exterior noise is gone. I slept like a baby on the 8.5 hour flight to Germany with no tactile discomfort whatsoever. Additionally, if you need to make a phone call in a noisy environment the headphones help with that as well. They come with a cable that facilitates control of Apple products. I'm very satisfied with this slightly expensive purchase. They are worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "H. Morrison",
      "helpful_votes": 0,
      "publication_date": 20140317
    },
    {
      "title": "Best thing since pitted olives",
      "text": "I fly 3 weeks out of the month. I no longer fear getting seated nearby screaming kids. Plop them on, hit the on switch and R-E-L-A-X!! There's room in the case for a spare AAA battery and a business card should you ever leave them on the plane. I speak from experience since the case is black you need to be careful you don't walk out with it remaining on your seat. Thankfully there are still wonderful people in the world that return lost items.",
      "rating": 5.0,
      "verified": true,
      "author": "J Michael",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Finally I can enjoy plane travel",
      "text": "I tried these at a counter in the air port. I was blown away by the effect. Note that this cancels low frequency waves such as engine noise and rumble but you can still hear voices, although much quieter. They are comfortable enough to sleep with and if you want to then listen to music or the sound of the movie that works great too. The single AAA battery lasted through 10 hours of round trip flight and the adapters worked on the plane I was on. Hint: You can add regular ear plugs and get rid of most of the upper mid frequencies (like voices) in conjunction with these phones to cancel just about everything.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Baker",
      "helpful_votes": 0,
      "publication_date": 20140411
    },
    {
      "title": "Thank you Bose",
      "text": "Thank you Bose - These are magical for a long flight and have used them for cross world trips to Australia. Being able to use them without music is also a nice touch as it blocks all that annoying hum for the entire flight. Plus drowns out the rest of the cabin noise when listening to music or a movie. I cant say enough about how great these are and worth every penny. If you're looking for a smaller package however, the in-ear model is a nice touch",
      "rating": 5.0,
      "verified": true,
      "author": "randumtasx",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Love 'em",
      "text": "I read some reviews about poor quality or heavy base but I can't say either of these is an issue for me. In my opinion, the sound is excellent and the NC is just amazing. The ear pads are soft and comfortable, the head band is adjustable over a wide range. The product is light weight, which is a good thing in my view, but I do take a little care when changing the battery and inserting the cable and I have had no problems whatsoever. It comes with a pretty flat case, airplane adaptor and TRS and TRRS 3.5 mm plugs to work with a wide variety of sources, including iPad etc. Bottom line: I love these phones.",
      "rating": 5.0,
      "verified": true,
      "author": "pidloop",
      "helpful_votes": 0,
      "publication_date": 20140307
    },
    {
      "title": "No longer need to blast the tunes",
      "text": "Very effective. The best thing about noise cancelling headphones: I no longer need to play my music loud in order to drown out noise. The benefit to my hearing is worth it. I'm no audiophile, so couldn't tell you about audio quality, but I haven't noticed any issues either. They seem reasonably well-made. They eat batteries, so my coworkers and I (three of us have these) just keep a communal set of rechargeables and a charger. Then again, I do have them on at least 4 hours a day, 5 days a week. When the battery runs out, the headphones cut in and out, and it's really annoying. Other than that, though, great.",
      "rating": 4.0,
      "verified": true,
      "author": "leaf",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Can't beat Bose headphones",
      "text": "Love these. I have owned a pair for year and bought these for my son. He loves them as well. There are many less expensive headphones out there that work very acceptably for people. When considering the higher cost keep the Bose warranty in mind. I have worn out the ear cushions on mine a couple of times over the years. You can either replace the cushions for $30 or get a brand new latest issued set of headphones for $90. That has served me well. Bose knows how to keep their customers. Of course the sound is just awesome as well.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Excellent head phones",
      "text": "I own less expensive noise-reduciing headphones. These are the real deal. Their test run was travel involving around 15 hrs combined flight time (10-12 hrs for the trans-Atlanitc legs) each way. I used ear plugs to sleep, but otherwise had these on all the way. Pros: comfortable, don't feel any weight. Nice case, holds my ipod nano and plug adspters easily. Good build quality. Good battery life. Excellent noise cancellation. Excellnt sound quality. Cons: pricey (as with anything Bose), cannot use them with power off Overall, I love them. Money well spent if you travel, or want to tune out the world from time to time.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Rafe",
      "helpful_votes": 0,
      "publication_date": 20120930
    },
    {
      "title": "best headphones I've ever owned",
      "text": "Fantastic noise cancelling capabilities. Any constant noise is eliminated. Voices not as much, but turn on some music and you're in your own world. I can't compare against any competitors since I haven't tried them, but the reviews when I bough this indicated it had the best noise-cancelling qualities. I occasionally forget to turn off the switch and it runs through a battery, so I recommend getting some eneloop batteries and a lacross bc700 charger, so you don't feel like you're wasting money on batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "zaphod",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Stock up on the cords",
      "text": "I bought them for my niece and she enjoys the comfort and lightness. On the flip side, she's on her third cord in 2 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great!",
      "text": "These headphones are great. The noise-cancelling is awesome. I can still hear someone talk, but I cannot hear the fans on my tower system. Great for focusing on coding. At first, I regretted not getting the wireless version, but now I think I made the right choice, as wireless has issues of its own. This unit lasts about a week or so on a single AAA-battery, and let's you know the battery's dead with a sort of \"popping\" sound. Just keep a package of fresh batteries near your desk & you'll be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasper B.",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "truly amazing",
      "text": "These headphones are very comfortable - I can wear them for hours even with my glasses on and they don't hurt my ears. Also, they make my music sound great. I have heard things in my music that I've never heard before. Most importantly as a medical student - they have superior noise cancelling abilities. This is the wow factor! Nothing compares to the cancelling abilities. I can study anywhere, even in a busy Starbucks and not hear a sound. I also wear them while taking my exams in class as to block out any coughing or shuffling noises that distract me.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Cowles",
      "helpful_votes": 7,
      "publication_date": 20130907
    },
    {
      "title": "Best headphones on the planet !!!",
      "text": "When you put those headphones on you feel like in another world. Noise canceling is amazing. You hear nothing but uninterrupted music. No outside noise bother your listening experience. Just the best headphones on the planet. I even use it on the plane to sleep. I remove plugin cable from the headphones, turn noise canceling on and it's so quiet the I fall asleep like a baby. What an experience. This is the only way I can get a decent sleep on overnight flights. At home there is no better way to listen music then on this Bose Headphones. Enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Maciej",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Bose QC15 is just awesome - second to none in noise canceling",
      "text": "Took a long time to think about it... finally pulled the trigger and loved it on my first trans-pacific flight. Now I can't believe i waited this long. Bose is awesome quality. The noise canceling feature is second to none. If your are looking for something primarily for sound re-production, there are other options you can consider. But for noise canceling this THE ONE!",
      "rating": 5.0,
      "verified": true,
      "author": "Longhorn Fan",
      "helpful_votes": 3,
      "publication_date": 20140630
    },
    {
      "title": "I have hyperacusis which makes me super sensitive to noise---this is a life saver on planes",
      "text": "lots of products out there but this is superb. I have hyperacusis which makes me super sensitive to noise---this is a life saver on planes, in noisy restaurants, big open spaces like COSTCO or areas with background music. I can hear well when wearing them but it knocks the irritating noise level down to a tolerable level----pure heaven!!! Also have the new travel earbuds version and never leave home without them. Worth the price---quality is outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert H.",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "Bose® QuietComfort® 15 Acoustic Noise Cancelling® Headphones",
      "text": "I finally broke down and bought the Bose headphones. They are definitely much more comfortable than my $140 Sony MDR-NC200D Digital Noise-Canceling Headphones, which makes my ears hurt after a half hour or so. Bose also does a way better job at cancelling out the jet engine noise than the Sony. The headphones come with a flat hard plastic case and the ear pieces twist flat to fit in the case. Initially, I thought the case would be too bulky for my backpack, but the flat design does make it easier to pack and protects the headphone. I guess I should mention that the sound quality is really good.",
      "rating": 5.0,
      "verified": true,
      "author": "deb t",
      "helpful_votes": 0,
      "publication_date": 20131116
    },
    {
      "title": "Excellent",
      "text": "Noisy kids. Loud airplane. Busy commons. These block out all of the loud and distracting noises while still allowing you to hear conversation at a low soft level. Add music in and all sound is washed out. The quality of these headphones is far superior to Beats. And, from a lay persons perspective with no audiophile skills, these serve their purpose well. Great purchase for us. My wife and I both have a pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Michal",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "The Best.",
      "text": "www.wirecutter.com did the research, and these are the best. Anything that sounds better sucks at noise canceling. Anything that cancels noise better sounds like crap. If you want noise canceling AND good sound, this is the way to go. I had the previous generation for 8 or 9 years of fantastic service, and when those finally got lost, I got these to replace. These are even better sound, and even better with noise handling. Also, the parts most susceptible to wear (the cable, ear pads) are user replaceable, so they can kept working for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Stout",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Best ever",
      "text": "I have used these on 4 flights so far. They are amazing. Very comfortable and block out that droaning sound from the plane engines. I used them both for listening to the TV on the plane by plugging it into the armrest and just to read. You don't have to plug them into something for them to work. Just turn them on and the background noise is blocked out (even just with the cord dangling). I recognize these are expensive but my perspective is I will have them for a very long time and the quality is worth it. I would highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Runnergirl",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Great comfort and cancellation",
      "text": "I had a cheaper pair of noise cancelling headphones, but the fit / comfort and cancellation were not very good. The Bose QC15 headphones are amazingly comfortable and the noise cancellation is very good. My ears do not feel like they are getting too hot and the noise of the engines is all but gone - wish I could say the same for the loud-talking passengers who seem determined to share their conversation with the entire plane.",
      "rating": 5.0,
      "verified": true,
      "author": "R Howard",
      "helpful_votes": 2,
      "publication_date": 20141225
    },
    {
      "title": "Outstanding",
      "text": "Listening to Netflix show on cellphone. I love Bose products but didn't expect these headphones to be this awesome. Bass is incredible. I'm very happy with these headphones and the noise canceling works really well. Buy these! UPDATE: 07/25/2014 I highly recommend these for airline travel. Could not hear the 2 noisy kids (both under 4 years old) in front of me on 4.5 hour flight. I was so happy I can't tell you, just ecstatic. Especially if you are listening to something through the headphones as opposed to just using the noise cancelling.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffers",
      "helpful_votes": 0,
      "publication_date": 20131219
    },
    {
      "title": "Cancelled airplane noise enough for me to sleep!",
      "text": "I was traveling a long distance, a 12 hour flight, and I was very concerned that the noise of the engines was going to aggravate an already existing ear condition I had of noise being amplified. I expected it to be a nightmare, but I decided I might try Bose noise-cancelling earphones to try to diminish the aggravation! We have other Bose equipment, and am always impressed with their quality. I couldn't have been happier! I just snuggled down into the seat, connected some soft soothing music, and the airplane noise was literally unheard.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvija Hellbusch",
      "helpful_votes": 0,
      "publication_date": 20130530
    },
    {
      "title": "Great sound and SO comfortable to wear",
      "text": "Comfortable and great sounding, these headphones are the best! They are so effective at blocking out background noise that your kids will NEVER hear you again while wearing these. That's annoying, but the headphones deliver on the heritage of Bose sound quality very well and are so comfortable, you'll forget you have them on. Everyone in our household has their own pair now, and Bose includes a great case to store/protect the headphones and store accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "Laughin Bones",
      "helpful_votes": 0,
      "publication_date": 20140609
    },
    {
      "title": "Can't Imagine Flying Without These...",
      "text": "Peace. Quiet. Two words rarely associated with hours (or days) spent six miles in the air trapped inside a small metal tube... Placing these over my ears and flipping the switch is probably the closest i get as an adult to experiencing wonder and gratitude at the same time.... the science behind them may [now] be passe' but the effect always put a smile on my face. If i ever find myself in an airport and realize that i've somehow managed to forget my Bose the first place I'm heading is the \"electronic\" outlet to buy another pair; i simply cannot imagine ever flying without these.",
      "rating": 5.0,
      "verified": true,
      "author": "mark",
      "helpful_votes": 0,
      "publication_date": 20130224
    },
    {
      "title": "Oldie But A Goodie",
      "text": "My old QC15's lasted me more than 10 years (although I had to do some padding replacement over that time). I lost them when I left them on an airplane. I tried my son's QC25's before deciding to buy the older model again. I just find them more comfortable. Glad there are still a few left to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Colin",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "I used at work in a cubicle environment (super noisy) ...",
      "text": "I used at work in a cubicle environment (super noisy) QC15 blanks it all out, ppl have to tap you on the shoulder to get your attention. Definitely need a \"rear view mirror\", or metal on metal tapping gets through these head phones--not much else!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Superb Sound",
      "text": "Sound with these earphones is noticeably better. They are also comfortable to wear. I bought them used from Ultronics and they were outstanding to deal with when the wrong item was shipped by mistake. They immediately sent the correct item and gave me a mailing label to return the item that I had received in error. Highly recommend the headphones and Ultronics.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hughes",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "I just love these.",
      "text": "I suppose there is something even more amazing out there and that even Bose makes it. But at this price point, it is 1. a sanity saver and 2. Nice quality sound. The hard part is remembering to turn them off when not in use. If I remember to turn them off, I can use them on long flights and for a LONG time. If I just leave them turned on for 24 hours straight, well, one teensy battery doesn't make it. But the fact they run on one teensy, easily transportable, readily found battery makes them light and convenient. (AAA). They are worth the space in the carry on, and few things are.",
      "rating": 5.0,
      "verified": true,
      "author": "Those Darn Donkeys!",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "I don't know how I travelled without these before",
      "text": "I used to use earbuds on the plane and I'd have to turn up the volume on IPod or movie so loud that I know it couldn't be good for me. The battery lasts a long time so I don't have to worry about carrying a bunch of batteries when I travel. Carrying case is very convenient - has enough space to carry extra stuff (iPod, passport, pen) so I use it as the thing I keep with my at my seat on the plane. I do notice a slight weird feeling (pressure maybe?) when I have the headphones on but no sound, but when I turn on music or whatever that instantly goes away.",
      "rating": 5.0,
      "verified": true,
      "author": "reviewer",
      "helpful_votes": 0,
      "publication_date": 20130405
    },
    {
      "title": "Perfect travel / office headphones",
      "text": "Very effective noise isolation - lightweight & comfortable. Compact and well protected when stored in the included case. Tremendous audio quality, very balanced. I have owned Dr. Dre Studio headphones and found them to sound very artificial, lacking in mid-range fidelity, these are much more natural. My only criticisms are the length of the cord (too long) and the battery life (not long enough). However the comfort, convenience, effective noise isolation and great audio quality make these highly recommended. Worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "rets38mot",
      "helpful_votes": 0,
      "publication_date": 20130619
    },
    {
      "title": "overpriced but worth it!",
      "text": "Always thought noise canceling headphones were just too expensive. Then someone loaned me theirs and I was hooked. After reading so many reviews and knowing Bose products are overpriced I went ahead and ordered them for $269 instead of the normal $300. Just got back from using them on different airlines flying 6 hours to Brussels, then to Munich, Budapest, Bucharest to Frankfort and back to Toronto. Lots of hours and I didn't have to listen to the engines or the babies crying. Worth every penny!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike M",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "The solution to annoying coworker sounds!",
      "text": "These headphones don't drown out people's loud conversations, but they do provide blessed relief from the grotesque sounds coming from my horrible mouth-breathing co-worker’s cubicle when he slurps, smacks, crunches and chomps down on his at-desk lunches. Also, I have trouble getting the headphones to work properly while using an extension cable, but plugged directly into my computer tower, they work like a dream.",
      "rating": 4.0,
      "verified": true,
      "author": "jessikraut",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Worth the extra expense",
      "text": "Quality and performance expected from Bose. Light weight,cancel virtualy all surrounding noise from kids dogs traffic. You will hear your favorite musics intricate details,like the lightest touches of guitarist fingers brushing the frets of a mellow martin acoustic. Hear vocals as if you are sitting with vocalist in recording booth. Yes we are very pleased with our purchase. Cons hard to use to turning off headphone switch to save battery life. headphones will not work without battery. a minor inconvenience for true listening pleasure.",
      "rating": 5.0,
      "verified": true,
      "author": "MonsterBronco",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "Also are terrific in the office",
      "text": "Yes, they are terrific on an airplane, but I've also been delighted at how well they do with office conversation. I can concentrate so much better on my work when I'm not distracted by nearby sniffing, coughing, and talking. One other thing that's great -- apparently when you buy a set of these you are fixed for life. I had owned a pair of the QC 3 for several years before these, and they finally started cutting out in the right ear cup. Even though they were out of warranty, Bose let me get a new set for $99. Able to add this review because we bought another new pair from Amazon for my wife, who hadn't had them before.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Posey",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "As expected",
      "text": "I have read reviews and viewed reviews on Youtube and so far the Bose QuietComfort 15 Acoustic is everything I expected. It comes in a nice case and cords are packaged in durable plastic. I decided to keep both cords in the plastic package. The little pocket inside is a nice touch for storing batteries. I let me my wife try the headphones and she was amazed at the noise canceling feature. The headphone feels cheap but holds up when I stretch apart. Very light weight. Hardly tell you are wearing them!",
      "rating": 5.0,
      "verified": true,
      "author": "Norman Harris",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "Perfect additon to iPad",
      "text": "I have traveled with these several times now and they are wonderful. I think they are the perfect addition to my iPad. pop in a movie and I am outta here. The sound is so rich and clear, and sometimes I sit right near the engines on the plane (hey, its steerage). In my opinion, worth the price and Bose stands behind their product. I did have a slight hum in one ear, so I called to find out if it was normal, it is not. They asked me to send it back, they paid shipping, and they sent me brand new ones!! Find a company like that nowadays = Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel J. Fox",
      "helpful_votes": 0,
      "publication_date": 20130423
    },
    {
      "title": "Incredible Listening Experience",
      "text": "The best headsets I've ever used. Period. In addition the set looks good, has fantastic features and can be used on airplanes and easily with my iPhone5S. The set is comfortable and while the noise cancellation feature is great, don't expect every sound to be 100% blocked out. For example if you're watching TV and listening to music you will hear the TV to an extent, but the sound will be significantly lower that what you would hear without the headset on. I'm sure I'll enjoy this set for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Caribe",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Good for planes - that's it.",
      "text": "Look, this thing is amazing if you're a frequent flyer. I haven't tried other models but after using this on a few flights I wouldn't bother with any other model. But when using this outside a plane, it's not worth the price. Keeping in mind that this is battery powered so it won't work at all without batteries. Second, the sound quality is good, but I didn't appreciate it that much. I'm not a Beats by Dre fan (meaning I don't need all the bass) but this thing just isn't loud enough when you're not using it inside an airplane. It's like the magic only happens when you pit it against an airplanes engines.",
      "rating": 2.0,
      "verified": true,
      "author": "Aristotle",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "Best Birthday GIft Yet!",
      "text": "Bought this for my husband on his birthday and he has been using this for half a year now and loves it! He can't thank me enough for this headphone. It's the best I=gift I've ever given him - and it takes the noise out of everything. I can see how well this works because when he has to work remotely from home while our toddler is fussing over her toys and her shows, the dishwasher running, the dogs barking at the mailman and I'm doing laundry - he does not hear a thing. NOTHING. He can't even hear me talk. :)",
      "rating": 5.0,
      "verified": true,
      "author": "coffeegirl",
      "helpful_votes": 0,
      "publication_date": 20140617
    },
    {
      "title": "Great product from Bose",
      "text": "You have to have this head phones from Bose if you are a frequent traveler, especially for long haul flights. I'm from Asia and I frequently travel in the US. It cancels the noise from the airplane's engines and gives you a clear sound from the movie that you are watching. Dozing off while in flight won't be a problem, this one will do the trick - giving you a nice & clear sound of music from your mp3 player. Its worth every dollar.",
      "rating": 5.0,
      "verified": true,
      "author": "ALAN",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "Well worth it",
      "text": "I tested these at Bose but the price they wanted was much higher than what I paid. The noise cancelling is so good. I put them on while off then turned it on and the 1st time about 60% less noise. Now after about 3 weeks it more like 90% of the noise is now gone and seems to keep getting better. Also it has no problems with the highs or lows sound. it is so clear and comfortable to wear. I will buy the cordless to see if it just as good in a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "David P Whaley",
      "helpful_votes": 0,
      "publication_date": 20130910
    },
    {
      "title": "BOSE QC15",
      "text": "I work in an area that is sometimes very distacting due to telephones and conversations. The office space is very close together. I needed to find head phones that would help to silence the noise and be pleasent sounding when listening to music. The Bose QC 15's are top of the line and do everything I wanted them to provide for my needs. I was hesitant to spend the money as you know Bose does not sell it's products cheap! That's because they aren't made cheap! Anyway try Bose you won't be wasting your time and you won't be wasting your money. DTM Florida,USA",
      "rating": 5.0,
      "verified": true,
      "author": "D. Marotta",
      "helpful_votes": 0,
      "publication_date": 20120316
    },
    {
      "title": "Make the world go away",
      "text": "I have had these for about two years now and they have really come in handy for myself and my wife. They really do cancel out most background noise. Great for long plane trips, vacuuming the floor, putting the other person's TV show off your radar as you browse the web, etc. Pretty conspicuous for use in public places but when you have to have a break from what is happening with sound around you, these headphones work. Sound quality for music is fine, as expected from Bose.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Nielsen",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Wish I'd known how good these were years ago",
      "text": "Honestly, if you've never tried noise cancelling headphones before, try some out. It's just amazing. I use them at work since my office has a noisy kitchen area on one end, construction noise on the other, HVAC noise from above, and computer fans from below. With just the noise cancelling active, I can't hear the HVAC or computer fans. At all. It's like magic. I do need music or white noise to completely obliterate the rest of the noise, but even then, I almost always have the volume at one notch above mute.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis Dube",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "I like it.",
      "text": "Noise cancelling is great and it's the most comfortable pair I recall ever having. The biggest drawback I see is that they don't work as regular headphones when the noise cancelling is turned off, like another brand of nc headphones I've had. These build up pressure and emit a slight hiss that I don't want to put up with when there's no background noise. It's also a power hog. Get a lot of batteries or rechargeables. I got mine used for a big discount, and highly recommend Unclaimed Baggage Center for their customer service.",
      "rating": 4.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "These headphones rock!",
      "text": "I work in a very populated office environment with a lot of background noise and chatter. With just the noise cancelling activated (and no music) they eliminate a great deal of the noise and chatter. When I play music I can't hear any of the noise or chatter around me. It took me about two years before I finally bought these and I wish I hadn't waited so long. Highly recommend these to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton Sheppard",
      "helpful_votes": 2,
      "publication_date": 20140225
    },
    {
      "title": "Best purchase ever",
      "text": "These headphones have helped me improve my experience of music. They're great for turning off most of the office noise, when I feel I need some peace and quiet to concentrate on work. It's also great for those long flights, you can't even go to the bathroom without it because the airplane is so loud and you get used to the peace and quiet of the headphones. It really does live up to it's name quiet comfort. Fantastically amazing battery life, just don't forget to turn it off when you leave work for the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Armando",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Great! They are very comfortable and helps me keep ...",
      "text": "Great! They are very comfortable and helps me keep sleeping in the morning when there is a lot of noise going on. Case provides extra room also! If you are okay with replacing the battery once in a while and good at not leaving devices on, this is for you. The quality is not like sennheiser but it is not like a pair of headphones from the store where you will be dissapointed. Not bass heavy but does have some bass. Mid's and highs are great. It allows you to enjoy the music more because you don't get to hear the world outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorry",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Best buy ever on Amazon!",
      "text": "When I bought these headsets, I had the expectation that they were used and refurbished, as long as they worked when I got them. I was pleasantly surprised to find that these headsets looked brand new when they arrived, and that the box contained all the cables, spare battery, and case. I could not have been more pleased with this purchase, thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Beck",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "I generally take very good care and do not handle my electronics (or any ...",
      "text": "The left ear pad broke within a month of purchase. I generally take very good care and do not handle my electronics (or any goods) disagreeably. My neighbors upstairs are very noisy folks, and i invested a lot in this headset. Was really low when the ear pad fell apart. Other than that, it user-experience has been average. I am only continuing to use it since i spent so much on it.",
      "rating": 2.0,
      "verified": true,
      "author": "Shruthi",
      "helpful_votes": 0,
      "publication_date": 20150831
    },
    {
      "title": "Wish the build quality was better",
      "text": "These are good for noise canceling as I compared them to the Beat's one at the time which were the same $300 at Best Buy. Problem is build quality is crap. The phone muffs have frayed off and Bose wants $35+ to replace it. For $300 I expect something to last a little longer. I don't even use them that often. Occasional flight and some occasional listening at work. :( I will be shopping around more carefully this time.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Suh",
      "helpful_votes": 2,
      "publication_date": 20141006
    },
    {
      "title": "Peace in Flight",
      "text": "These headphones really get you rested well in flight. I always travel on business class and many business class seats nowadays offer noise-cancelling headphones. Bose still works a lot better. I also find myself more rested when I have them on. Sleeping in it on a long-haul flight may be a bit difficult because it is quite large. I sleep on my back but when I turn on my side while asleep, I wake up because the headphones get in the way. I always travel with an extra battery in the case as it could drain fast depending on use.",
      "rating": 4.0,
      "verified": true,
      "author": "G. V. Carpio",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "... bought the QuietComfort 15 headphones and have not been disappointed, except for price",
      "text": "After trying several other brands I finally gave up and bought the QuietComfort 15 headphones and have not been disappointed, except for price. Apparently Bose tightly controls the retail price of its products since there is almost no deviation regardless of the outlet. Noise cancelling feature works well and headphones are light and comfortable but seem a little flimsy, especially compared to some of the less-expensive competition. Still, appears to be the best product for travellers looking for an over-the-ear noise-cancelling headphone.",
      "rating": 4.0,
      "verified": true,
      "author": "Stuart M",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Great Headphones",
      "text": "I love the Bose QuietComfort headphones. These are some of my favorite headphones I have purchased. The noise cancellation is good and the sound quality is great. I particularly enjoy listening to music at mid to low level volumes whiles relaxing. I have listened to Beats Studio headphones, but I am impressed more with the Bose. There are several other noise cancellation headphones out there, but I have only had the pleasure of listening through the Klipsch One, Beats Studio, and the Bose Quietcomfort 15. The Klipsch were nice, but I like their home theater speaker better than their over the ear headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Sterling Widner",
      "helpful_votes": 0,
      "publication_date": 20131212
    },
    {
      "title": "supreme sound",
      "text": "Really cancel the noise! Amazing! Now I don't have to listen to my husband's nagging anymore. The sound quality is supreme. It beat my old Sony headphone of the same price. Only complaint is the cord was weak with the connector toward the headset like all the other reviews said. I try to be very,very careful not to break it. The sound is little thin but one may say it is crystal. It is not a boom box!",
      "rating": 5.0,
      "verified": true,
      "author": "H. Fann",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Very satisfied",
      "text": "A little pricey, but the noise canceling quality is the best on the market. Did a lot of research and initially bought a cheap pair of sony noise canceling headphones. They don't compare to this. Bought these for movies on airplanes. They only cancell noise when you have them on and are listening to something ie music or movie. If you turn them on and don't have them connected to a computer or iPod they don't cancell any noise. I have had them for a year and still love them, and bought one for my wife.",
      "rating": 5.0,
      "verified": true,
      "author": "PT",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "Never go to the airport without them",
      "text": "I had no idea just how noisy airplane travel can be. After having two back-to-back flights where the people behind me talked loudly and non-stop the entire flight I had to get these. We've all been there, the flight is perfectly quiet except for the two young people excited to leave their town for vacation. They talk and talk and talk and talk... you get the picture. If you're a frequent flyer, have loud neighbors, or just need some peace and quiet then the Bose QC 15 are what you need. I'm still amazed at how much background noise is reduced. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20140321
    }
  ],
  "product_meta": {
    "title": "Bose QuietComfort 15 Acoustic Noise Cancelling Headphones (Discontinued by Manufacturer)",
    "description": "QuietComfort 15 headphones feature exclusive Bose advancements in noise reduction technology. You hear less noise and more of your music and movies-with quality sound and a long-lasting comfortable fit. You won't find this combination of benefits in any other headphone.Connectivity Technology: Wired,Jack Type: Angled(3.5 mm) and One (1) Year Warranty.\n\nFROM THE MANUFACTURER\n\n\nBOSE® QUIETCOMFORT® 15 ACOUSTIC NOISE CANCELLING® HEADPHONES\n * The best Bose® around-ear headphones reduce noise across a wide range of frequencies\n * Enjoy music and movies with clear and lifelike sound\n * Comfortable, around-the-ear fit\n * Includes cable with remote for iPhone®/iPod® control, mic for hands-free iPhone calling\n * AAA battery: 35 hours average life\n * Ideal for frequent flyers\n\nFULL SPECTRUM NOISE REDUCTION\nThey're the best Bose around-ear headphones, period. QuietComfort 15 headphones feature exclusive Bose advancements in noise reduction technology. You hear less noise and more of your music and movies-with quality sound and a long-lasting comfortable fit. You won't find this combination of benefits in any other around-ear headphone.\n\nBOSE TECHNOLOGY AT WORK\nEngine roar fades to a whisper Within every pair of QC®15 headphones, advanced electronics use microphones inside and outside each earcup to sense the sounds around you-and reduce the noise. Proprietary ear cushion technology blocks some of the noise before it even reaches your ears. Together, these Bose innovations add up to a more enjoyable listening experience.\n\nRELAX WITH MUSIC - OR WITHOUT IT\nQC15 headphones also feature proprietary signal processing and TriPort® acoustic headphone structure for more lifelike sound-including deep low notes-from small, lightweight earcups. And when you'd rather relax without music, switch on QC headphones to simply reduce the noise around you, wherever you are.\n\nTAKE CALLS. TAKE CONTROL\nQC15 headphones come with a cable customized for select Apple® products. A three-button remote and microphone let you take calls on your iPhone and control music functions on other Apple devices. You can also purchase a mobile kit that lets your QC headphones work with other cell phones, too.\n\nWELCOME TO A BETTER-SOUNDING WORLD\nSwitch between calls and music with a press of a button When you fly with QC15 headphones, engine roar fades to a whisper. When you listen at home or at work, fewer distractions get in the way of your music. And when you want to stay connected, calls are just a button-press away. QC15 headphones continue to give you more of what you want to hear, and less of what you don't.\n\nQUIETCOMFORT 15 ACOUSTIC NOISE CANCELLING HEADPHONES HIGHLIGHTS\n * Significant noise reduction across a wider range of frequencies. Proprietary Bose innovations use microphones both inside and outside each earcup to sense and reduce the sounds around you.\n * TriPort acoustic headphone structure, another Bose exclusive, features tiny vents in the earcups to enable a tonally-balanced audio performance-including reproduction of deep, low notes-from relatively small and lightweight headphones.\n * Active equalization electronically tunes the headphones' frequency response, enabling outstanding audio performance.\n * Interchangeable audio cables, one for general use, and one just for select Apple products, offer greater convenience than permanently connected Y-cables.\n *  The inline remote puts control right at your fingertips \n * Inline microphone allows for hands-free iPhone conversation and access to certain voice applications, such as VoiceOver and Voice Control, in other Apple products.\n * Inline three-button remote switches between calls and music, and controls volume, track selection and voice applications on select Apple products.\n * Advanced ear cushions use new materials in a proprietary design to establish a critical acoustical seal-helping to further reduce noise while providing a comfortable fit.\n * Fold-flat earcups rotate 90 degrees for easy storage and portability in the included case.\n * Slim carrying case helps protect headphones and accessories during travel.\n\nAPPLE CABLE COMPATIBILITY\nThe QuietComfort 15 inline remote and microphone cable is compatible with iPod nano (4th, 5th and 6th generation), iPod classic (120GB, 160GB only), iPod touch (2nd, 3rd and 4th generation), iPhone 3GS, iPhone 4, iPad and iPad 2, and Macbook (unibody) and Macbook Pro. The remote is supported by iPod shuffle (3rd generation). Audio is supported by all iPod models. Requires latest iPod software.\n\nPRODUCT DETAILS\nOverall headphone dimensions 7.5\"H x 6\"W x 1.5\"D ( 19.1 cm x 15.2 cm x 3.8 cm ) Ear cushion outside dimensions 3.8\"H x 2.9\"W ( 9.6 cm x 7.4 cm ) Weight with cables 4.9 oz (140 g) WHAT'S IN THE BOX\n * QuietComfort 15 headphones\n * QuietComfort 15 inline remote and microphone cable (detachable)\n * Standard audio cable (detachable)\n * AAA battery\n * Carrying case\n * Airline adapter\n\nSIMILAR BOSE PRODUCTS TO CONSIDER\nBose® QuietComfort 3 Acoustic Noise Cancelling Headphones --For those who prefer a compact on-ear design and a rechargeable battery, QuietComfort 3 headphones offer a proven combination of Bose noise reduction, audio performance and comfortable fit. Enjoy full-spectrum noise reduction that dramatically reduces engine roar--and fades background distractions at work and at home, too. Bose quality sound reveals nuances in your music you might have missed. And the soft-cushioned headphones stay comfortable for hours. Earcups fold flat for easy storage in included case.",
    "rating": 4.5,
    "feature_bullets": [
      "The best around-ear Bose headphones reduce noise across a wide range of frequencies. Connectivity Technology: Wired/Wireless",
      "Enjoy music and movies with clear and lifelike sound",
      "Comfortable, around-the-ear fit; ideal for frequent flyers",
      "Includes airline adapter, carrying case, and two audio cables-one with mic/remote for iPhone/iPod control and hands-free iPhone calling",
      "AAA battery included: 35 hours average life"
    ],
    "specifications": {
      "Product Dimensions": "8.5 x 8.75 x 2.75 inches",
      "Item Weight": "7.4 ounces",
      "Department": "Electronics",
      "Manufacturer": "BOSE",
      "ASIN": "B0054JJ0QW",
      "Item model number": "370509-0010",
      "Batteries": "1 Lithium Polymer batteries required.",
      "Customer Reviews": "4.5 out of 5 stars3,797 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,078 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 6, 2011"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 499.99
  }
}