{
  "website_summaries": [
    {
      "verdict": "A great option for adhesive removal that covers more surfaces than most other options.",
      "pros": [
        "Large can holds a large supply of adhesive remover you can keep a supply on hand",
        "More VOC-safe compared to other adhesive removers",
        "Comes with larger size options"
      ],
      "cons": [
        "The best removal results require a lot of effort to rub the adhesive completely off"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "very slow on old stick-on weight adhesive",
      "text": "I tried it on very old stick-on weight adhesive. It worked only very slowly and with lots of elbow grease and rubbing. I gave up. It essentially does not seem to dissolve the old adhesive. But then, it says \"cleaner\". Not sure why one would want to \"clean\" adhesive, but there you are. I am going to order the 3 M adhesive \"remover\", since that is what I am trying to do. That may do better. I will also learn to read.",
      "rating": 2.0,
      "verified": true,
      "author": "John K.",
      "helpful_votes": 9,
      "publication_date": 20180521
    },
    {
      "title": "Best product I found to remove old decal adhesive",
      "text": "I was removing the old decals off the side of a fiberglass RV. I tried using GoofOff, GoopOff and one other brand that a hardware store swore by. None of those items touched the old adhesive that was left behind. With the 3M spray, I would spray it on let it sit for a minute and then wipe off. On a couple stubborn areas I had to repeat a couple times and use a razor blade, but overall this did a great job. After I was done, I washed the area with soap and water and then waxed it and it looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "VagaBarnes",
      "helpful_votes": 3,
      "publication_date": 20170216
    },
    {
      "title": "Not recommended for painted surfaces",
      "text": "Although the paint on my garage door had been cured for at least 6 months, this glue remover damaged the painted surface. I used a soft cloth and tried teasing the glue off the surface with this glue remover as recommended by the manufacturer. Some glue was removed, but the paint underneath was damaged in the process. I am disappointed, but I do have more paint, so can recoat with no problem. I had to try! I will keep the product for use on other surfaces, but won't try it on paint again.",
      "rating": 3.0,
      "verified": true,
      "author": "ALS",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Worked well to remove sticker residue from auto paint.",
      "text": "Used this to remove 10 year old adhesive that was used to attach 3M paint protection film on a car I bought. I had to use about 1/2 a can and lots of scraping/wiping to get the residue off, but it's fresh and clean now. Would have been bear impossible without this or another chemical, and this did no apparent damage to the paint job. I had to spray and let it soak for 1 minute or two, then spray again and scrape while wet...small patches only, about 5\" square at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "M. J. Lang",
      "helpful_votes": 5,
      "publication_date": 20160803
    },
    {
      "title": "Everyone needs this",
      "text": "This is my third can of this over 15 years. It is invaluable. It will dissolve away virtually any sticky, gummy, adhesive. And it will not damage the painted surface of most things like cars. I would use a test dose on any painted surface just to be sure, but it has never stripped paint on anything I've ever used it on. When you need it, you need it, and I don't like being without it.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Great product!",
      "text": "Hey, this stuff is amazing! I ordered a new car, and took delivery in December. I wanted to remove any sticker and plastic residue from the outside of the car that came from the factory. They had a plastic film on the car when it arrived, and when removed it left traces of sticky stuff around the edges. This product removed it promptly. I didn't spray it directly on the car but soaked a microfiber cloth with it and daubed it on. With very little wiping motion of the rag it came off in a breeze. Can' say enough good for this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Carl L.",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Stand up to it's name",
      "text": "I've used a lot of different 3m products. They are all expensive but they all work well. This one olso falls in that catagory. It's a little pricey but you get what you pay for. Top quaility product. Oh I called 3m and they personally recommended this product to me. They have fantastic customer service if you ever have questions.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Clark",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Finally",
      "text": "After trying so many other YouTube (WD40, this or that solvent home remedies- all failed attempts) to remove a solid hood worth of decal adhesive, I came across this. It worked so fast I thought it was going to remove the paint And panicked at first but following directions and with my plastic razor and after months of looking at half peeled adhesive, within seconds it scraped right off! Finally! Something does what it says it does! Safely!",
      "rating": 5.0,
      "verified": true,
      "author": "Mathew ",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Waste of money and time.",
      "text": "I bought 2 cans of this product to try and remove the woodgrain decal adhesive on a mid 90's station wagon. I followed directions and after 3 applications (used up half a can) or 3 attempts on just one fender, I gave up on this product; it just makes a big white mess after it dries that has to be scraped off, but after scraping, the adhesive was still there. This product DID NOT loosen the adhesive on this wagon AT ALL. I just used goo-gone on the adhesive residue and it worked better than this expensive crap. Because of Amazon's return policy on hazardous materials, it can't be returned either. Don't waste your money or time on this.",
      "rating": 1.0,
      "verified": true,
      "author": "MusicFan234",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Doesn't work on wheel weight adhesive",
      "text": "Before I bought this adhesive remover, I called 3M to make sure that it would remove wheel weight adhesive from my alloy wheels. They assured me that it would. Well it didn't. Be forewarned.",
      "rating": 1.0,
      "verified": true,
      "author": "Ol' J.T.",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Great Product",
      "text": "I used this to remove the clear plastic shield (also made by 3M) that protected the front of my RV. It still took some elbow grease, but removed the leftover adhesive very well. Be SURE to use this in a well ventilated place.",
      "rating": 5.0,
      "verified": true,
      "author": "Weimaranchand",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Average",
      "text": "Still requires a little more elbow grease than I would have anticipated. If removing camper decals, invest in a heat gun and a plastic scrapper. You will still have to use this product or one like it to get the adhesive residue off. Only spray a very small area at a time as this evaporates extremely fast. Spray count to 3 and start rubbing and scrapping.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott C.",
      "helpful_votes": 3,
      "publication_date": 20141104
    },
    {
      "title": "Never Ever Ever use this product to clean Embroidery machine hoops!",
      "text": "This product may work well, but not for what I bought it for. It is totally sticky, requiring several washings with soap and still it's sticky residue was awful. Not clean removal. Only purchased this because DK5 product no longer manufactured. Have to use sticky remover to remove this sticky remover solution.",
      "rating": 1.0,
      "verified": true,
      "author": "bdmcdona",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Junk",
      "text": "Does not do what it says, did not even remove scotch tape glue. When i tried to to return it they would not take it back.....",
      "rating": 1.0,
      "verified": true,
      "author": "David Salzillo",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Worked great on my camper!",
      "text": "I had some old Command Hook glue/residue on the side of my camper and nothing would take it off. I applied the 3M Specialty Adhesive Remover and after a couple of treatments it was completely gone! No sign of the glue and no harm to my camper.",
      "rating": 5.0,
      "verified": true,
      "author": "C. D. CHANDLER",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "It Works!",
      "text": "I bought this to remove some very nasty, persistent decals from my bike frame. I don't know why every company is insistent on slathering stickers all over their products like some NASCAR stock car. But they want free advertising. What is a minimalist to do? Buy this stuff! It works VERY quickly, and is strong. But it didn't damage the paint on my bike. I'm sure it's something you should use sparingly, due to its strength, but for me it seemed gentle enough. I didn't risk it by leaving it on a long time. I didn't need to, though, as it removed a nasty decal sticker in 5 seconds, with a little elbow grease added.",
      "rating": 5.0,
      "verified": true,
      "author": "Paige Turner",
      "helpful_votes": 2,
      "publication_date": 20140628
    },
    {
      "title": "Truly effective - Strong Smell - High price",
      "text": "This remove is for real. Works very well an removes dirt or strong adhesive perfectly without leaving much of a residue. Highly recommend to wear a mask if using alot and be ready to spend a nice buck on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "When GooGone or GoofOff Fail You, Try This",
      "text": "Excellent product! I took some discolored factory protective plastic off my Toyota Prius. You have to work at it a bit, (I used a razor blade with it), but it does the job.!",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold Bruveris",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Got the stuck on glue from cat protection material from my leather chair",
      "text": "Tried vinegar, nail polish remover; nothing worked. Bought this stuff and it worked in no time. Very strong odor though. Must have fan and mask though. It's powerful!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alonzo",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Adhesion remover",
      "text": "This is the product to use to remove rockshield adhesion from your car, truck, or rv. Will not hurt the paint.",
      "rating": 5.0,
      "verified": true,
      "author": "William L. Skelton",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "It works ok.",
      "text": "This product is ok and works but Goo gone/ Goof off works just as well and they are cheeper. The price is why I am giving this product a lower rating.",
      "rating": 3.0,
      "verified": true,
      "author": "Kitty Koal",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Excellent!",
      "text": "This stuff makes short work of things that Goo Gone would take hours to do. Amazing! Just a little stinky, use outside. Wish I knew about this stuff years ago. Just make sure the default seller has it in stock before you order. They like auto-selecting the seller that's cheapest, even if it's not in stock and takes weeks to arrive..",
      "rating": 5.0,
      "verified": true,
      "author": "LoganExplosion",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Stunningly mediocre",
      "text": "This General Purpose adhesive remover claims it can remove silicone, adhesives, stickers, and a variety of other things, though I haven't seen the any evidence of this while attempting to remove any of that. Perhaps the liquid version is more capable, but I would look for alternatives next time either way.",
      "rating": 2.0,
      "verified": true,
      "author": "Josh Suppa",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "3M - 3004.7855 General Purpose Adhesive Cleaner",
      "text": "CLEANER EASILY REMOVED TAPE AND GLUE RESIDUE FROM METAL DOOR. WONDERFUL PRODUCT. STRONG CHEMICAL SCENT BUT WORTH EVERY PENNY. THANK YOU!",
      "rating": 5.0,
      "verified": true,
      "author": "CharlieBooksNYC",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Be patient! This works wonders",
      "text": "Used to remove 5.0 emblems off my mustang gt. Use this, be patient, very patient. Don't damage your paint. If you take the time to buy this, be very patient / gentle when using this on a painted car.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Montgomery",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Works as advertised",
      "text": "Used to product to remove residue on my truck. Specifically, I had 3M Paint Protection Film on my truck's rear wheel wells. The film was over 10 years old and was brown and cracked. I contacted 3M, they told me how to remove the film, and then suggested that I used this product to remove any remaining residue. The adhesive cleaner worked extremely well in removing the residue and I would recommend it without hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 2,
      "publication_date": 20160608
    },
    {
      "title": "Very Useful",
      "text": "Everyone should have a can of this at home, because it removes anything sticky or sticker residue immediately. It also cleans the surface for the application of adhesive items, like Velcro patches or exterior car trim. Makes those things stick much better.",
      "rating": 5.0,
      "verified": true,
      "author": "historyfuzz",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Works like a champ",
      "text": "Works like a champ! Cuts through adhesive and makes it far easier to remove. This has been used to remove old emblems and stickers from my car. I tried many other products to remove the left over residue but this stuff works! I'll never be without a car of this in my house.",
      "rating": 5.0,
      "verified": true,
      "author": "Candace Crane",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Works if you can get it out of the can!",
      "text": "I ordered (2) spray cans of this product. Only one of them works leaving one can worthless and a complete waste of money! I’m a big believer of 3M products but I’ll think twice before buying a spray can of a 3M product.",
      "rating": 1.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Another great product from 3M.",
      "text": "I use this adhesive when changing the weatherstrip on my 2000 Corvette. Anyone who is changed weatherstripping on a classic or sports car knows that it is often difficult unless you use a good adhesive product. Of course, 3M has always had a good reputation and their products are at the top of the list for quality. I was not disappointed and would quickly buy this product should the need arise again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Franklin, JD/PhD",
      "helpful_votes": 4,
      "publication_date": 20150323
    },
    {
      "title": "Perfect for Car Care",
      "text": "I use this product on my vehicles to remove tar, grime, oil, etc. from the painted surfaces. It works quickly and won't harm the finish if the paint is cured and a factory finish. Spray it on, let it sit, wipe it off and follow up with a cleaner, wax or sealant. It also works great on wheels that often get pitted with brake dust, tar and other contaminants. I've used the different levels of this product and found this one to work best. Wear gloves and work in an open area as it's gotta be bad for your skin and lungs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rocko A",
      "helpful_votes": 4,
      "publication_date": 20130915
    },
    {
      "title": "Removes adhesive leftover from decals!",
      "text": "We use this in our truck/trailer repair shop. It does a phenomenal job at removing adhesive leftover on our trailers after removing decals. We spray it on with a spray bottle, let it sit for a little bit and then scrap it off. It doesn't damage the paint and also doesn't irritate our skin. Yes it has an odor but its not too overpowering. This is our 2nd 5gallon purchase. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "ABranham",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "The best stuff out there",
      "text": "Best adhesive remover out there and we go through a lot and have tried many different brands. We have race stickers to take off of our helmets every weekend, this is the one to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin K.",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "This stuff really works!",
      "text": "It really works. We removed a ton of stickers off my daughters door with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "David Blue",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "This is a great product. It by far out performs Goo-Gone",
      "text": "This is a great product. It by far out performs Goo-Gone. I would recommend purchasing the plastic scraper/razor blades to speed up the process or removal. All glue residue came off with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "LChaun",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Removes the glue",
      "text": "Worked great for removing adhesive. I was taking a emblem off my car worked good . Had to clay bar the last little bit off . I expected that",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Refurbished an old band saw",
      "text": "I couldn't get the adhesive off of cast iron band saw wheels after removing old, cracked rubber tires. It still took some elbow grease, but this stuff loosened up the old adhesive very well. I'm pleased that it worked well, and also didn't appear to affect the surrounding paint.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan David Mandell",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "This stuff is so much better than goof off",
      "text": "This stuff is so much better than goof off. I removed side window louvers from my 2011 Mustang 4 years after I applied them. This remover, along with some plastic razor blades removed all of the built-up double sided foam tape in less than one hour. The goof off took 2-1/2 hours to remove 1/8 as much. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Reyes",
      "helpful_votes": 2,
      "publication_date": 20150518
    },
    {
      "title": "Love it! Very handy!",
      "text": "Worked as intended and removed all the tough glue on the vehicle without damaging the paint. It is a bit pricey but worth not taking the risk otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "SCYLLA",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "bumper stickers",
      "text": "This is just a fantastic product. I had glue from a bumper sticker , I tried removing it will all options possible. When I was about to give up I came across this product. This is magic. I got the glue out within 20 minutes (of course it required some work) but it worked!",
      "rating": 5.0,
      "verified": true,
      "author": "VC",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Not bad !",
      "text": "It removed the residue of the double sided tape in rather short order. Although several applications were required.",
      "rating": 4.0,
      "verified": true,
      "author": "NYB",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Removed Ford Badge",
      "text": "Used to remove the OEM Ford badge from my 2011 Ford Ranger...worked flawlessly! Not sure what this stuff is but it didnt damage any vehicle paint !",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Worked when nothing else did.",
      "text": "Finally found a product to remove the adhesive from my 01 Yukon molding. Spay on heavy and use a plastic scraper. Repeat.",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Great product",
      "text": "Great product have been using it for years on my automobiles to remove adhesive.",
      "rating": 5.0,
      "verified": true,
      "author": "David P.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Old proven product can’t remove modern graphics",
      "text": "I purchased this product to remove stripes from a surplus police vehicle. Used as directed, the product failed to remove the stripes. I used a 3M rubber stripe removing wheel on an electric drill instead to finally, successfully, remove the stripes.",
      "rating": 2.0,
      "verified": true,
      "author": "Gary Smith",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Completely useless!",
      "text": "The push button was missing from the Specialty Adhesive Remover Aerosol can so it is completely useless. Tried to return only to discover that this item is not eligible for returns.",
      "rating": 1.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "worked perfect",
      "text": "took three passes to get all of the old gasket off did not damage the finish or tenting on the camper",
      "rating": 5.0,
      "verified": true,
      "author": "Mike in Miami",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Great stuff",
      "text": "I used this to strip off the factory glue/tape on a truck. A little bit goes a long way, and it took it off the door itself along with the plastic mouldings. It did not harm the truck paint or the plastic mouldings.",
      "rating": 5.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "The smell is really bad. Do not use it at home.",
      "text": "The smell is so bad and it's really unhealthy if you use it at home. You can still try it in your backyard though.",
      "rating": 3.0,
      "verified": true,
      "author": "Ming Chi",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Works great!! Used on my boat!",
      "text": "This stuff is amazing! Used a heat gun to heat up sticker, removed sticker, and sprayed this stuff where sticker was and let it sit for a minute. The gummy stuff came right off. Used it on my boat and no discoloration noted.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "\"It smells like pure gasoline\" This stuff is PUNGENT -- very noxious ...",
      "text": "\"It smells like pure gasoline\" This stuff is PUNGENT -- very noxious fumes -- but it works... use in a well well well ventilated region and then clean the rag or dispose of it properly -- it basically smells like a combo of gasoline and spray paint fumes.... I used it to get excess white lithium grease of the garage door after I lubed the hinges for the winter.... works great.",
      "rating": 5.0,
      "verified": true,
      "author": "8765",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "Good buy",
      "text": "Used this to remove decals on my vehicle that have been on for 10 years. Worked perfectly! No residue at all.",
      "rating": 5.0,
      "verified": true,
      "author": "John JMG",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Three Stars",
      "text": "didn't really work as expected RAPID REMOVER works way better",
      "rating": 3.0,
      "verified": true,
      "author": "Cristine M. Shuldberg",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Five Stars",
      "text": "Nothing works better for getting sticky residue off of ANYTHING.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie M.",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Acetone was better cheaper and easier to buy",
      "text": "Pretty disappointed. Requires multiple applications and lots of rubbing as funny as it might sound.",
      "rating": 1.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Great addition to any residential or professional shop",
      "text": "Worked perfect on removing duct tape on my wifes car.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190211
    },
    {
      "title": "Removes just about anything sticky",
      "text": "Great for getting sticky messes off just about anything. This is the only thing that would get foam strips with adhesive backing off my couch that my 2 year old stuck there. Also great for getting tar off cars (just make sure you wash it all off)",
      "rating": 5.0,
      "verified": true,
      "author": "DaEagle",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "tried this and it worked great.",
      "text": "tried everything to remove an adhesive from a window wind blocker that had fallen off, nothing worked, tried this and it worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Four Stars",
      "text": "not 100% necessary... didn't make much of a difference compared to carburetor cleaner or 98% IPA.",
      "rating": 4.0,
      "verified": true,
      "author": "Brown",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Stuff works great but produces the same fumes as a spray paint ...",
      "text": "Stuff works great but produces the same fumes as a spray paint can. Also, if sprayed directly on the product youre trying to separate the adhesive from, it can soak into it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "It works",
      "text": "Since the state of California has restricted the sales of most solvents that are effective, I consider myself fortunate to have found 3M General Purpose Cleaner. This product removes road tar and adhesive/sealant from auto finishes. I expect it will be as effective in cleaning tools and car parts from grease and gunk. Not as harsh as Goo Gone, which removes everything down to the metal. Don't tell California this stuff works or they're likely to ban it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert C Blanchard",
      "helpful_votes": 19,
      "publication_date": 20100131
    },
    {
      "title": "It Works",
      "text": "Although it took quite some time to remove the double sided \"goo\" car manufacturers use for placing emblems (as it always should), this product worked wonders. My only wish is that something is released that removes that crap in seconds without any harm to vehicle paint surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Collis",
      "helpful_votes": 0,
      "publication_date": 20160512
    },
    {
      "title": "Use it everywhere around the house",
      "text": "Me and my wife love it. In addition to removing stickers and other sticky residues, we widely use it for rubbing off something, that just soap and water was unable to remove. Like permanent marker. Or shoe or suitcase scuff marks on the painted wall. Compared to some gel kerosene stinking removers, this one smells less and not that long.",
      "rating": 5.0,
      "verified": true,
      "author": "Sluh",
      "helpful_votes": 2,
      "publication_date": 20140615
    },
    {
      "title": "remarkably strong",
      "text": "This is a remarkably strong adhesive remover, and a little bit goes a long way. IF you're in a position where normal means are just not going to work... this will solve it. I used it on a silicon based adhesive tape and it literally took seconds for it to work. Note: HIGHLY recommended that you wear a respirator and gloves while working with this... it's not a toy or a watered down product.",
      "rating": 5.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "As always, 3M does it right",
      "text": "Amazing product, 3M continues to make the best chemicals in the world.",
      "rating": 5.0,
      "verified": true,
      "author": "wentintothewoods",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Worked great for removing the wheel weight adhesive",
      "text": "Worked great for removing the wheel weight adhesive. Some of it was baked on for years. This and a little Purple Power makes quick work of cleaning your wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "GJ Kingston",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Removed the tree sap from my car with a little elbow grease... Worked wonders!",
      "text": "Removed the tree sap from my car with a little elbow grease... Worked wonders!",
      "rating": 5.0,
      "verified": true,
      "author": "Azulza",
      "helpful_votes": 2,
      "publication_date": 20170714
    },
    {
      "title": "I'm glad I listened to the other reviewers because it worked ...",
      "text": "I bought this to remove the adhesive from gorilla glue tape from my car. I'm glad I listened to the other reviewers because it worked so well!",
      "rating": 5.0,
      "verified": true,
      "author": "kgrout",
      "helpful_votes": 0,
      "publication_date": 20170805
    },
    {
      "title": "3m adhesive remover",
      "text": "Used this to remove adhesive left after taking plastic coating of of front of Rv. Found this alone wasn't enough but also sprayed wd40 to same area before scraping with a plastic blade. Very SLOW process, but this is best combo so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Amazing",
      "text": "Works amazingly for any glue residue. Instantly removes baked-in adhesive without effort. - Does NOT work on road tar or tree sap! - Remember to protect hands with gloves, the substance is very aggressive, irritating and smells bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Very effective product",
      "text": "I removed a number of decorative stripes on my van and was left with a stubborn adhesive residue that wouldn't come off easily with alcohol, turps or solvents. This product did it in a matter of minutes - you spray it on (it gels and doesn't run off) and then scrape it off with a plastic scraper. Everything came off immediately with no damage to the paintwork. Amazing product and well worth the money. Just note that one can doesn't get you far - I removed two 2\" wide stripes around the car and one can only did one side!",
      "rating": 5.0,
      "verified": true,
      "author": "hhkiwi",
      "helpful_votes": 0,
      "publication_date": 20100420
    },
    {
      "title": "Cleans sticky gunk",
      "text": "This worked well to remove those dealer nameplates/ stickers on the back of a new car. Who wants those anyway? Just use fishing line, a little heat, and 3M 08987 General Purpose Adhesive Cleaner and no one will know where you bought your car!",
      "rating": 5.0,
      "verified": true,
      "author": "G. D.",
      "helpful_votes": 7,
      "publication_date": 20131024
    },
    {
      "title": "Worked great",
      "text": "Used this to get the old molding tape/adhesive off of the car and the moldings before remounting them with 3M Molding Tape. It worked great and did not damage the car paint. I would use this to get off any old adhesive where you need a clean finish.",
      "rating": 5.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 7,
      "publication_date": 20130727
    },
    {
      "title": "Easy to use",
      "text": "Great product for removing decals on automotive paint and other surfaces. Did not damage the finish.",
      "rating": 5.0,
      "verified": true,
      "author": "htgrimmi",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Good to have around the house/shop/wherever it is needed",
      "text": "Good to have around the house/shop/wherever it is needed. It didn't completely break down the double sided tape that had dried up on my rear bumper but got most of it off with some elbow grease.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony T",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Five Stars",
      "text": "best ever to remove 3m double sided foam tape with plastic razor blade scraper",
      "rating": 5.0,
      "verified": true,
      "author": "the Critic",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Review",
      "text": "It does remove the 3M woodgrain vinyl Adhesive, but it takes 3 applications to get thje adhesive off the car. This Adhesive Remover is very expensive because it takes so many applications to remove the Adhesive. At this rate of Usage it will take 5 or 6 cans to remove the adhesive from my vehicle.",
      "rating": 3.0,
      "verified": true,
      "author": "STEVEN M HENDERSON",
      "helpful_votes": 0,
      "publication_date": 20140307
    },
    {
      "title": "Best tough adhesive removee",
      "text": "Best adhesive remover. Specialty works perfect on clear bra deposit removal",
      "rating": 5.0,
      "verified": true,
      "author": "sean d",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Best Adhesive Remover ever!!!",
      "text": "Worked as described, no harm to underlying paint, little effort needed. Very expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "ACE ",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Removes adhesive from stick-on wheel weights",
      "text": "Works great for removing leftover adhesive from stick-on wheel weights. Use with plastic razor blades. 5 minute removal.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary H.",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Worked very well to remove adhesive from a car front ...",
      "text": "Worked very well to remove adhesive from a car front protector that had been on the car for seven years.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "Good stuff",
      "text": "It is the only thing I have found their removes the glue from 3 m or diamond shield coating",
      "rating": 5.0,
      "verified": true,
      "author": "GEORGE D BRYAN",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Four Stars",
      "text": "This stuff is expensive but it works quite well and doesn't damage fully cured automotive paint.",
      "rating": 4.0,
      "verified": true,
      "author": "Craig, no longer in Burlingame",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Best Product",
      "text": "Worked great removing the adhesive from our RV defective decals. Once I scraped the top layer off with plastic scraper blades, it was easy. Just spray and scrape effortlessly. Some spots took a bit of elbow grease. Very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "Collandtmartin",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Five Stars",
      "text": "Great for clean up on invisible mask or automotive clear plastic bra removal.",
      "rating": 5.0,
      "verified": true,
      "author": "TomH",
      "helpful_votes": 0,
      "publication_date": 20161018
    },
    {
      "title": "Worked well, no damage to car paint",
      "text": "Worked well and fast to remove double sided tape on a spoiler without any damage to the paint",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry CRNA",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "This is my go-to solvent",
      "text": "This is my go-to solvent. Gets sticker glue off everything and tar off of my cars without harming the paint. Goof Off is too nasty and will strip paint, ‘melt’ plastics. Goo Gone is not strong enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Quark",
      "helpful_votes": 2,
      "publication_date": 20151103
    },
    {
      "title": "Best weather strip remover.",
      "text": "Best stuff for removing old weather strip adhesive. I tried everything I had and could not remove the old adhesive. Just spray this on and presto, the weather strip adhesive softens and you wipe off. Have to do it a couple of times but still saves lots of rubbing.",
      "rating": 5.0,
      "verified": true,
      "author": "chasqui",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "FANTASTIC !!!",
      "text": "This stuff works great. Got the gunk off my door panels in 2 passes. It kinda evaporates quickly, so you have to get to rubbing it fast. There is no damage to the paint what so ever. It works great on dvd cases as well with no after effects. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "ERNESTO",
      "helpful_votes": 3,
      "publication_date": 20120706
    },
    {
      "title": "Easy removal",
      "text": "This will quickly and effortlessly remove glue from vinyl bumper stickers or decals. It has never marked the paint on any vehicle I've used it on. 3M is a name you can trust, and this product is typical of the other 3M products we use, they just work!",
      "rating": 5.0,
      "verified": true,
      "author": "Abi",
      "helpful_votes": 4,
      "publication_date": 20130516
    },
    {
      "title": "You will never go wrong with 3M",
      "text": "This company I have always felt would be a good purchase. I have never been disappointed with a 3M product.",
      "rating": 5.0,
      "verified": true,
      "author": "kk53",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Sticky no More",
      "text": "My husband uses this to remove adhesive residue off his vehicle and it works like a dream.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Highly recommended!",
      "text": "Easiest and quickest way that I have found to remove tar from the paint of my cars. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "gs919",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Good stuff, but not super strong",
      "text": "THis was great when I had to remove the adhesive from the glue holding the sound deadening inside my car. This was perfect for the glue but the discoloration and harder glue didn't come off. That is when i used stronger stuff (which also took off some paint)",
      "rating": 4.0,
      "verified": true,
      "author": "Tonggi",
      "helpful_votes": 11,
      "publication_date": 20101129
    },
    {
      "title": "worked like a charm",
      "text": "worked like a charm, had a glue trap blow upside down and stick to my garage floor, took it right up",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "GREAT – Easy to use aerosol",
      "text": "Best product which I've ever used to remove stickers etc.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "Recommend!",
      "text": "Bought this 3M adhesive remover to remove decal/punstripe residue on my vehicle. Very easy to use. Just apply to cloth and wipe the sticky residue on your car. No more rubbing your fingers for hours just to get rid of those left overs.",
      "rating": 5.0,
      "verified": true,
      "author": "Yang",
      "helpful_votes": 2,
      "publication_date": 20140605
    },
    {
      "title": "Worked well",
      "text": "A construction machine backed into my car in my parking lot and scraped some orange paint onto the plastic bumper. I couldn't get the paint off just with elbow grease, but repeated applications of this solvent and rubbing with paper towels eventually removed the orange without damaging the finish on the car at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark J.",
      "helpful_votes": 3,
      "publication_date": 20121129
    },
    {
      "title": "Five Stars",
      "text": "Used this stuff for years always with good results. Pricing is more than reasonable here too.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Best plastic safe adhesive remover on the market",
      "text": "This is a fantastic product that I can't get locally. Amazon saves the day again!",
      "rating": 5.0,
      "verified": true,
      "author": "glenn",
      "helpful_votes": 0,
      "publication_date": 20180611
    }
  ],
  "product_meta": {
    "title": "3M Specialty Adhesive Remover, 38987, 15 oz Net Wt",
    "description": "Style:3M Specialty Adhesive Remover| Size:15 oz.3M Specialty Adhesive Remover is a solvent-based specialty adhesive remover is designed to remove reactive adhesives from a variety of substrates.",
    "rating": 4.5,
    "feature_bullets": [
      "Product removes reactive adhesives from a variety of substrates",
      "Reactive adhesives include adhesives that require a hardener or catalyst in order for the bond to occur",
      "A solvent-based specialty adhesive remover",
      "Examples of reactive adhesives include, but are not limited to, epoxies, urethanes and silicones",
      "Specialty adhesive eases removal of stubborn residue"
    ],
    "specifications": {
      "Product Dimensions": "9.5 x 2.5 x 2.5 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "3M",
      "ASIN": "B005RNCBQQ",
      "Item model number": "38987",
      "Customer Reviews": "4.5 out of 5 stars406 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#6,113 in Automotive",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Car Care",
      "Garden & Outdoor",
      "Exterior Care",
      "Cleaners",
      "Automotive"
    ],
    "price": 18.74
  }
}