{
  "website_summaries": [
    {
      "verdict": "Inexpensive video lighting kit that will serve beginners well by giving them the basic equipment they need.",
      "pros": [
        "Ships with 2 tall light stands and 1 small light stand so you can easily adjust the lighting positioning for your video recording needs",
        "Includes umbrella reflectors to ensure the highest quality of light throughout the area"
      ],
      "cons": [
        "Color temperature is only available at 6500 Kelvin and isn't adjustable in this simple light kit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "... is my first set of lights and are a great beginners set",
      "text": "This is my first set of lights and are a great beginners set. I am new to photography, but this set ha really helped get the desired lighting in my pictures, even when I have low natural lighting available. The set comes with two umbrellas, with stands and light bulbs, and a shorter light stand and light bulb. The bulbs have their own night case and Styrofoam to keep them safe and the stands and umbrellas also have their own bag. The setup is very easy and it all breaks down just as well and fits nicely into the bag. Such a wonderful lighting setup!",
      "rating": 5.0,
      "verified": true,
      "author": "lking",
      "helpful_votes": 890,
      "publication_date": 20161228
    },
    {
      "title": "I took this photo using these lights!",
      "text": "For the price and for someone trying to start out small in building a studio these things are amazing! I took this photo using these lights!",
      "rating": 5.0,
      "verified": true,
      "author": "MichaelBaileyMedia",
      "helpful_votes": 262,
      "publication_date": 20160829
    },
    {
      "title": "Best for home photo shoots!",
      "text": "I'm so happy with these lights for my photoshoots I do on my baby. It was cloudy outside and these pictures came out bright and vivid and just amazing. No photoshop used!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Smith",
      "helpful_votes": 124,
      "publication_date": 20161101
    },
    {
      "title": "Lighting is the LimoStudio Photography Photo Protrait Studio 600W Day set",
      "text": "I definitely love this set! I use it to film my youtube tutorials and use it in my photo shoots. The lighting is great and you can't beat it for the price. Just be sure to be gentle with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole A.",
      "helpful_votes": 116,
      "publication_date": 20160217
    },
    {
      "title": "Unboxing video - Product is great for beginners!",
      "text": "I ordered this kit to start studio portrait photography as well as to use for my youtube video filming. This is a medium quality semi - professional lighting kit. Its great for beginners to experiment and start studio portrait photography. I have posted an unboxing video for this product which shows you how exactly you will receive this product. It is a strong build, the tripods are metal and are very sturdy. It comes with 3 600w white light CFL bulbs which can fill in the shadows moderately. The light is bright enough to be used in a small studio/room space. Also, please check out my youtube channel (New york elite picture) for a complete review video.",
      "rating": 4.0,
      "verified": true,
      "author": "xtremerjay",
      "helpful_votes": 17,
      "publication_date": 20170719
    },
    {
      "title": "AWFUL non-working lighting set that is a FIRE HAZARD. Horrible Customer Service!! BEWARE.",
      "text": "AWFUL. This may be the WORST item I have ever purchased. This set comes with 3 stands and three bulbs. The very first time I tried to use this, one stand didn't work at all, one stand began to smoke, and one worked. Out of the 3 bulbs, 1 was ruined when one of the stands started smoking. Then finally, my last stand lasted about 4 sessions before it started to smoke and stopped working. I contacted this companies customer service, and they said there was nothing they could do. They did not apologize nor did they offer to refund or replace my item. ABSOLUTELY AWFUL.",
      "rating": 1.0,
      "verified": true,
      "author": "ashley sams",
      "helpful_votes": 45,
      "publication_date": 20161015
    },
    {
      "title": "Strong chemical smell is irritating",
      "text": "My problem with this set was that the entire packaging and the gear itself has a very strong chemical smell. So much so that it irritated my lungs making it difficult to be around in close contact. Since I have asthma, this just wasn’t acceptable. I tried wiping the stands with soap and water and just letting the gear sit outside of the packaging but it became too much of an issue. I enjoy breathing more than I need cheap lighting. The stands are lightweight which is to be expected for the price. But your really need to have the lights right next to your subject.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Warren",
      "helpful_votes": 8,
      "publication_date": 20180411
    },
    {
      "title": "Very Disappointing product.",
      "text": "Very disappointing product. First the zipper broke on the bag,then when I finally tried the lights, they were extremely dim, no way they are as bright as they claim, barely any light came trough the umbrellas. I replace the lights with 100 wat equivalent led light bulbs and the led lights bulbs were brighter Save your money and buy something else.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Q",
      "helpful_votes": 10,
      "publication_date": 20170213
    },
    {
      "title": "Great buy!!",
      "text": "I believe this set is very beginner friendly! Very easy to assemble. I haven't had a chance to use the umbrellas. The light bulb by itself gives great lighting for pictures in my iPhone!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20170620
    },
    {
      "title": "A bit flimsy, but works great and good value",
      "text": "The shipping packaging was a bit busy, with tons of little cellophane bags for everything, and there was quite a bit of assembly. But for the price, this is a good kit. I used it to conduct video interviews for a documentary, and the video turned out very good. The bulbs are not very bright, so you may need to supplement in certain environments to avoid shadows. Strangely, there are three bulbs and holders, but only two umbrellas. Note that the whole kit breaks down and fits in a single provided duffel, except for the compact florescent bulbs which have their own container. This is not pro gear. But for the occasional shoot for indoor situations, recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "H. A. Newness",
      "helpful_votes": 2,
      "publication_date": 20190414
    },
    {
      "title": "It’s great for beginners",
      "text": "I’m actually surprised with the quality. It’s pretty legit for a cheaper lighting kit. The directions were extremely simple and it serves its purpose. I’ve only tested out one out of the three lights so far, so I may update this review later on. The plastic is a little flimsy, but it was to be expected for the price. I tried a iPhone 6 and iPhone 11 Pro Max camera and both photos looked incredible, the lighting really does make a difference. If you’re an amateur or beginner photographer, I highly recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Krissy",
      "helpful_votes": 3,
      "publication_date": 20200331
    },
    {
      "title": "Great product for the price",
      "text": "I run a low budget photography business out of my home. Most of my work is done natural lighting, outdoors, but I needed to get some studio lighting for small studio sessions. I was looking for something light & easily portable that would easily fit in my home at a moments notice without much fuss. This product has been great! I have used this now several times and have had zero issues. The stands are sturdy, easily adjustable & the light is nice and bright even through the umbrellas. It does get quite warm in the room while using them though, just as a heads up :).",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 3,
      "publication_date": 20181108
    },
    {
      "title": "Save your money",
      "text": "After reading all the awesome reviews I thought these would be awesome for my studio...WRONG. Turned BOTH lights on and waited a little while and took a sample image. You cant even tell there are lights in my studio they are not powerful AT ALL. I usually need 1 light for newborns, lit 2 of these ones on the area and I literally was so disappointed in seeing it barely gives any light off of 2! Sad, but not for me and my studio! Literally waisted $50.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie Stenger",
      "helpful_votes": 3,
      "publication_date": 20181011
    },
    {
      "title": "Lacks light, stability",
      "text": "These were replacements for a softbox that my child knocked over that I can no longer find online. The light output is almost non-existant and the stands are flimsy, one breaking within a week in the middle. I put them up and leave them standing and they have not been knocked over. But the thin metal made a clean break right at the tightening knobs with no pressure. Having to replace them already for lack of light, cheapness of product. Do not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Lori - A Day in Motherhood",
      "helpful_votes": 4,
      "publication_date": 20170409
    },
    {
      "title": "Not that bright but decent for fill light",
      "text": "I bought these as supplemental lights for recording videos and they aren’t that great. The stands feel cheap but I’ve had them for over 6 months and they are still functioning. The lights are dim and you can’t buy much brighter ones because of the capacity of the socket. I did buy lights that were brighter than the originals but they still aren’t the best. I use these mostly for fill light to help reduce shadows in my videos but never for main light. If it’s super overcast outside I can’t record quality videos because these aren’t bright enough.",
      "rating": 3.0,
      "verified": true,
      "author": "TristianElizabeth",
      "helpful_votes": 3,
      "publication_date": 20181203
    },
    {
      "title": "Nice begginer set up",
      "text": "This is an awesome light weight set up for anyone interested in practicing studio photography. Easy to assemble and break down. The bulbs each have their own plastic storage and wrapped in light weight foam and all three bulbs store nicely in their containers in the small travel tote. The umbrellas are not silver lined, so your positioning of the lighting will vary depending on placement to the subject. I used this for the first time and I'm very pleased with the results I was able to achieve without having to use a flash and no background shadows.",
      "rating": 5.0,
      "verified": true,
      "author": "TNmountainMan",
      "helpful_votes": 6,
      "publication_date": 20170614
    },
    {
      "title": "Do not buy terrible for photography!😋",
      "text": "This is terrible for photography. It's a waste of money. Light bulbs are very weak even I added 3 other soft boxes with 2500w total. I still needed to used high ISO to get decent lighting. Do NOT BUY this and waste time and space.",
      "rating": 1.0,
      "verified": true,
      "author": "Ann ",
      "helpful_votes": 10,
      "publication_date": 20170621
    },
    {
      "title": "Inexpensive Lighting Kit Has Great Benefits and Value!",
      "text": "This light stand kit is well built for any studio or customer location. I prefer the lower power fuorescent lights and umbrella reflectors for better fill-in of subjects versus the higher power quartz lights, which casues more shadowing effects. Overall, I'm happy with this light kit. However, different power lights are required for different situaitons. I've used both types of lighting for different effects.",
      "rating": 5.0,
      "verified": true,
      "author": "R. LarsonTop Contributor: Photography",
      "helpful_votes": 16,
      "publication_date": 20141215
    },
    {
      "title": "Good value for the price - good for basic use!",
      "text": "I sell clothes online and needed an inexpensive lighting kit. This is perfect for non-professional use - the kit is easy to put together and store, and the lighting is great. The quality of my photos has improved immensely. It's sturdy enough for general use, and lightweight and easy to move around. I have had a few problems with adjusting the stands, but not a huge deal. I don't know if I'd buy for professional use - but the quality is great for the price, and for my purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "RE",
      "helpful_votes": 2,
      "publication_date": 20181118
    },
    {
      "title": "... I received the product I thought it would be great. The carry case was good",
      "text": "When I received the product I thought it would be great. The carry case was good, and the quality seemed good. However, that was not the case. From the moment I plugged it in I started having issues. The lights would not turn on, then after fiddling with them and getting them to turn on, they would randomly shut off. This made it very difficult to take pictures. I would not recommend this product and I am returning to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 10,
      "publication_date": 20161206
    },
    {
      "title": "Disappointed.",
      "text": "I guess for the money I spent I shouldn't be disappointed. But. I should have bought a better quality product. The bulbs are not bright enuf and the umbrella shades are very thin and do not do a good job. The plastic stands may prove useful for me to mount another light system. Next time I will do my homework and not trust an affiliate link to purchase it...",
      "rating": 1.0,
      "verified": true,
      "author": "marco770",
      "helpful_votes": 3,
      "publication_date": 20180112
    },
    {
      "title": "Good photography umbrella lights",
      "text": "This is an awesome umbrella photography light, especially for amateurs like myself. I was mainly doing pictures of my baby and needed good lighting. We also bought the matching backdrop stand. This product comes with two umbrellas, an extra single light, 3 light bulbs and a carrying case. The set up was simple and easy to do. You can adjust the height and angle of the umbrella lights. You can also do the same for the single free standing one. Everything looks just like the picture included. It gave good lighting and looks very professional after set up. Will post pictures. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "PCTop Contributor: Baby",
      "helpful_votes": 4,
      "publication_date": 20170520
    },
    {
      "title": "Very functional at a bargain price.",
      "text": "Very happy. Yes, the parts are of a lower quality than professional equipment, but I expected that going in. You can't expect high quality for Walmart prices. Having said that, I can definitely say that I'm quite pleased with what I got. I bought the bigger bulbs because the ones that come with the kit are not bright enough and have used the set up for both video as well as product photography.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiny Yogini",
      "helpful_votes": 2,
      "publication_date": 20181021
    },
    {
      "title": "Don’t be cheap with your lighting",
      "text": "This lighting setup is a total scam. The stands are week. While I was doing a photoshoot at a party, someone walked by it, just barely touched the stand’s legs and the whole thing tipped over. It broke my external flash mount which sucks, but I got a new one over the next year. Also the lights have a cold color temperature, the lights are weak, and the cords are short and annoying. Just got the flashpoint turtle base stand, that’s worth the money. Go big or go home with the stuff, because I basically wasted my money on this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Damian Williamson",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "This has been a great starter lighting set",
      "text": "This has been a great starter lighting set. I own my own cake studio and have been trying to improve the quality of my cake photography. Most light boxes are too small for my needs so I bought this kit. It's easy enough to set up and I really appreciate the carrying cases. When not in use the kit doesn't take up much room at all. My only complaint is that the bulbs provided don't seem as bright as I expected. I see I brighter bulb is available and will look into trying those in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 2,
      "publication_date": 20171224
    },
    {
      "title": "These are ok, but not as bright as I thought, and these get very hot!",
      "text": "These are a good set for beginners. I have a small space where I was using these, and I found myself having to put them very close to the subject in order to get good lighting. I tried them in a few configurations as subject >> Umbrella >> light (screening) and Subject >> Light >> Umbrella (reflecting), and the results were almost the same but perhaps reflecting a little better. They are good for beginners shooting in tight spaces...but I would not expect these to light up a large group. Overall these are good, and met the need that I had when I purchased these.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos Rey",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Lighting at an Affordable cost and portable for multiple uses",
      "text": "I like that it is not expensive for a useful lighting setup for my uses (i.e. EBAY pictures and taking digital photos of my hard copy photos). It has all the items you need including the light bulbs. Things that could be improved - the lights get HOT! Maybe a cooler light could be suggested for replacement when these go out. I would like to have a sheet explaining how to set up a shot for taking the best pictures. Yes - I googled it but I still don't know the best placement of the lights for the best photos. Love the product though - it works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Beatrice Hooper",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Not a Good Product",
      "text": "One of the umbrellas tore. The others look as if they will sooner than later. This happened before I even used it. I would have gotten a refund, but it was past the allotted time from Amazon. They also make shadows despite moving them around the subject. My opinion is save your money. Get a softbox instead.",
      "rating": 1.0,
      "verified": true,
      "author": "BMS",
      "helpful_votes": 2,
      "publication_date": 20181029
    },
    {
      "title": "Stand doesnt work after ONE use",
      "text": "I was very satisfied with this product for the one time that I got to use it. They do make for great pictures. However after taking great care to pack it back up carefully, i took out the equipment to use the for only the SECOND time and one of my stands will not turn on. I tried all the bulbs, it's not that because they work in the other stands. I checked the plug, I checked everything, the stand is dead. I'm highly disappointed because now I only have 1 functioning tall stand and a small stand. I hope to get this resolved but can't find contact info for the company right now.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Great for the price but kinda cheap in quality",
      "text": "These have worked really well for the simple photo setup we use them for. We sell furniture and other products online and needed a quick lighting for easy photos. The stands themselves are a little top heavy with the umbrellas and the joints and adjusters on the poles are cheaply made with thin plastic but they work well enough. The light bulbs make the stand a bit top heavy so when they do fall over the light bulb will almost alway break. However, the lighting itself works really well for the price. Comes with a nice bag for the poles and the lightbulbs so traveling with these become a bit better.",
      "rating": 4.0,
      "verified": true,
      "author": "RatherDashing",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "This is a nice light but it stays on and does not have a very long power cord",
      "text": "This is a note to all beginning photographers this light will stay on and it's semi bright it does an OK job but what you really might want is a mono light which has extreme Flash power and is portable to get the the look that a lot of new photographers think they're going to get immediately this did the job however since a lot of photography these days requires outdoor shooting and this type of lighting set up does not help.i volunteered to take pictures of my best friend's baby announcement and the wind blew over the light and broke the bulb all over her pool which was a little bit of a disaster.",
      "rating": 4.0,
      "verified": true,
      "author": "missiefae",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Work great but pretty big",
      "text": "These work great for photos and I really like the small light as more of a movable light I use for different angles although the other two are quite large so just make sure that you have the room for them. This set is for someone using a dedicated room in their home for photos or someone with commercial space for them but otherwise a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Krystal",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great value for money",
      "text": "This is a great value for the money. got everything I need and more. I use the lighting for my YouTube channel. Quality is... well... marginal at best - but considering the cost I suppose it fall in where it should. The tripods are a bit flimsy. so treat them with care. One of the tightening knobs broke off after the first use.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark's reviews",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Perfect for my needs. Performed flawlessly, and very compact.",
      "text": "This is really killer stuff for the price. These are very light weight. I won't call them flimsy, but realize these are not industrial gauge steel. I wouldn't use them outside on a windy day, but for most cases, the weight vs. strength is a worthwhile trade off. You would not mind carrying these for a distance. The general fit and finish are quality. I do a lot of video green screening and just ONE of the umbrellas on my background yielded flawless results. It's a versatile kit. Also, these pack up into two lightweight bags (even one for the bulbs that fit three boxed perfectly.)",
      "rating": 5.0,
      "verified": true,
      "author": "Jan R. Klincewicz",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Perfect for taking photos of my dog",
      "text": "I often take photos of my cat and dog indoors, and was frustrated with some of the quality of my photos due to either poor or yellow lighting. After searching and doing a little bit of research with what is available out there, I decided to purchase this set. It came exactly with what is in the photos and description. Very easy to assemble and put away when you're finished. I'm by no means a professional photographer, but if you're looking for something relatively affordable, this is a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tenchi",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Not for people with migraines:(",
      "text": "Bought this to get a better light on video calls. The ring light reflected in my eye glasses and this seemed like a good solution. Well, I get migraines that are brought on by light. I attempted to place these lights in multiple positions - facing me, on my side and nothing worked. The bright diffused light was bothersome. The unit did exactly what it said - the light on the face was fantastic. However for one plus hour calls it ended up giving me a Severe headache",
      "rating": 2.0,
      "verified": true,
      "author": "Daisy Hoshi",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "I'm a total amateur and this was amazing! So professional and easy to put together!",
      "text": "Yes!!! This is such a great high quality professional photo shoot set up! It created just the most amazing photos! It was just the PERFECT setting for my daughters 1st birthday. She is my rainbow baby and I wanted to go all out for her photos. Putting together this set up was super fast and easy, it was great and wouldn't be the same without this light set up. I have NO experience with photography and I literally just set this all up in my dining room! It's such a FANTASTIC buy and not expense at all for such high quality. Totally worth it! I see loads and LOADS of family pictures in my future!",
      "rating": 5.0,
      "verified": true,
      "author": "M_K_Customer",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Great product & customer service",
      "text": "Thank you for making a product that works great for what I'm using it for. It looks very professional. Shipping time was acceptable as well. Your company took great care in packa ging the items separately. I would definitely recommend purchasing this equipment for most photography & video projects. I wish it would have come with the stand for the backdrop, but it was my fault I didn't click every photo and read carefully. Therefore I had to go in & purchase the stand. So, if you're reading this make sure you know the stand for the backdrop isn't included. You will need this, in my opinion. Again, it's not the company's fault, I should have read clearly,",
      "rating": 5.0,
      "verified": true,
      "author": "Joswen E.",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "nice studio lights",
      "text": "I use these lights everyday for my cam show. My viewers have told me they make a great difference especially having the umbrella to make the lights not so blinding. when my room is darker, sometimes I take off one of the umbrellas to provide more light which boy does it! the light bulbs are BRIGHT!!!! only complaint is they are pretty unstable and need to be on a sturdy surface. With the umbrellas out they are pretty big and I knocked it a little tipping it over and broke one of my bulbs :( it was my fault but if the stand was sturdier I don't think it would have tipped over.",
      "rating": 4.0,
      "verified": true,
      "author": "cocoluv",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "First I'd like to say that I do not own a photo ...",
      "text": "First I'd like to say that I do not own a photo studio, or use this kit for taking photographs. I am a live streamer on twitch and found not only for my green screen, but in general I could use more lighting. This kit is SPOT ON for my needs. I actually only use the two tall lights on either side of me shining back on the green screen, which is plenty to make the chromakey work perfectly and shine some much needed light on me as well. So for a photo studio I cannot help. But for live streaming and green screen use I have to say these lights are perfect for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ragetrip",
      "helpful_votes": 2,
      "publication_date": 20161116
    },
    {
      "title": "Excellent Light System",
      "text": "For shooting a photo directory for church, this was an excellent purchase. is it professional? If not then it is pretty close. No matter whether it is a professional tool, it sure did benefit our photo directory. I've been using the lights in various positions in the \"studio\" to mitigate glasses reflection. Shadows are also mitigated while the subject's face is well lit. I used the small light behind the backdrop to highlight the people.",
      "rating": 5.0,
      "verified": true,
      "author": "Superior.Shores",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Yes a must buy for beginners and for those that want to take photos of projects and more!",
      "text": "I really love this product. It came with everything needed to set up a mini studio. The way you can store this product is also awesome and means you can set up anywhere for a mini photo suit!! The quality is great. The lighting you get is great. The versatility of adjusting the height and angle is a plus!! This is perfect for those just starting out in photography like myself. OHHHH and the price is amazing. The customer service of this company is very responsiveness and so nice. Fast shipping. I would highly recommend this product. THis is my honest review and was not asked to leave one!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Holt",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "You get your money's worth, but it's a cheap setup.",
      "text": "These don't put off as much light as 4 45 watt CFL bulbs, I thought it would be closer than it was at least. But they are nice for some soft light. If you're a cheap person, you probably bought a cheap camera. You'll need more light if you did. With a nicer camera these will work, but there's not a whole lot of control. You kind of just have to deal with what you get here. However, it's exactly how I pictured it. remember, these stands aren't strong enough for outdoor stuff. They're very weak. For sturdy stands you'll need to drop 3X what this whole kit costs. Worth it for the bulbs and light sockets alone though.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Foster",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Great for Beginner Photo Shoots",
      "text": "I bought this for a one-off photo shoot needed for my company. It performed well and as expected. The bulbs that are included are not very bright so you may want to swap them out but everything else works quite well. Easy to pack up and relocate, easy to reassemble and use. I break these out from time to time for other projects and so far they have held up well. Overall I'm pleased and would definitely purchase again if I were ever in need.",
      "rating": 5.0,
      "verified": true,
      "author": "jason sparks",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Just what I needed!",
      "text": "Awesome package. This is just what I needed for my studio. I make simple videos with my iPhone and share them on social media. I'm getting lots of compliments about how good my lighting looks in the videos. I just use this setup. Namaste Knuckles! Jace Jacobs Mindset Poet and Amazon Author",
      "rating": 5.0,
      "verified": true,
      "author": "Jace Jacobs",
      "helpful_votes": 3,
      "publication_date": 20170630
    },
    {
      "title": "Cool kit",
      "text": "The product arrived and everything assembled and work properly as described in the product details. I have not used it yet to take photos, so I have no pictures to post. I can tell you that the lighting this product in it's is very bright and appears to cast the proper luminescence for good photography. The only thing I would change would be able to house a single bag that can Hold the light bulbs and tripods, vs the 2 separate bags, but this is understandable, as you want to protect the bulbs from damage. Thanks, looking forward to taking some product photos.",
      "rating": 4.0,
      "verified": true,
      "author": "Art K (Elec Eng Consumer Products) ",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "They go up fast and breakdown quickly as well.",
      "text": "These lights work great. I use them in the field as a photographer when I need a little extra light. They go up fast and breakdown quickly as well. The only con I have so far is that some of the connections, specifically on the lamp head, feel cheaply made, and I don't feel they will last forever, but then again this is a very inexpensive light set, so I am ok with that. You will need weights with these lights if you go above 4 feet or so. They will stand on their own, but they are built light, and will tip in a stiff breeze. Nothing a small sandbag won't fix.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Steve",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Perfect for YouTube Content producers",
      "text": "This affordable set was purchased to bring natural lighting to my indoor YouTube studio set up. You can see the look of the lighting on YouTube _skindipity _ channel. I think that the viewer could never tell that I was in a dark room with no windows :-). If you are just starting a YouTube channel & looking to improve your lighting, I'd give this a try.",
      "rating": 5.0,
      "verified": true,
      "author": "About Face With Mona",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Love this kit!",
      "text": "I think this is a really great product, especially for the price! There are some people in the reviews saying that this isn't very bright, and so I was worried and almost bought new bulbs before receiving it but I decided to wait. Upon delivery, I discovered it is actually very bright and produces a ton of light. It was super easy to put together, and you will, of course, get faster with practice. Everything except the bulbs fits in the bag with space left over. The little baggie for the bulbs holds each of them perfectly. Overall, I am super happy with this product, especially considering I once had a more expensive set that was nowhere near this quality.",
      "rating": 5.0,
      "verified": true,
      "author": "DakotaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "Well worth the money!",
      "text": "I bought this set for selling clothing online - Pluswear on Poshmark & I am very pleased with it. The only thing I would change is for the bulbs to be LED instead of the spiral type because the spirals put out heat. But that’s minor. My favorite parts are the diffusing umbrellas & that the cords of at least 2 of the lights are nice & long, which is a feature that some manufacturers skimp on. Great delivery time as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Darla",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Looking for lights to make Videos..  You will want to read my review.",
      "text": "I really cant say anything \"bad\" about these lights. I have owned them for over a year now, and they are still working great. When I bought these, it really made by videos better (I am a youtube blogger with over 1900 videos now) I used this set up for over a year and thought it was really good.. Until a few months ago when I got a softbox kit.. Esddi Photography Softbox Continuous Lighting System Photo.. The softbox REALLY was what I needed in the first place, not these lights. Do youself a favor and spend a little more now for some much better lights.",
      "rating": 3.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20160817
    },
    {
      "title": "Wow made everything come together",
      "text": "I have been working on projects for training videos. I was so limited because of the lighting. Not anymore I can film anytime day or night in any room. Easy to use 3 lights the headlight set up at 45 degrees from the main light tall umbrella and then the shorter one on the other side. Wow, I have had so many comments from editing and family on how good my videos look. I wish I had bought these 5 years ago. Great starter kit very happy thank you so much for listing this great value. HAPPY CUSTOMER I will share the link with everyone that ask.",
      "rating": 5.0,
      "verified": true,
      "author": "Trailhound",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Excellent for the low cost!",
      "text": "Very good quality photography equipment for the extremely low cost. Not four mobile photographers but excellent four boutique clothing photos which is what I am using them for. I think as long as you don’t move them around to much they will be fine. Very bright and pleasing light.",
      "rating": 5.0,
      "verified": true,
      "author": "BeckyW",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Easy to use and portable.",
      "text": "For the price you can’t beat it. The lights are bright and are very close to daylight. The umbrellas are nice and large and can be configured in lots of different ways to give varying effects. Carrying cases are a definitely plus if you are traveling to remote sites or client location. Not high end professional equipment. But a great backup for smaller gigs where huge professional assemblies are not necessary but you want a little more light versatility.",
      "rating": 4.0,
      "verified": true,
      "author": "ZPTN615Top Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great lights/stands - okay bulbs",
      "text": "Bought this for the green screen ensemble that my girl put together. The stands are great and the way the umbrellas manipulate the light sources give our videos a very human look to them (not too bright or dark). The only reason I took off a star was because of the bulbs they came with. Out of the four, one of them popped within 5 minutes of first use and the company regrettably declined on honoring a replacement. Them not replacing it isn't entirely their fault - we waited a bit before using the product (2 kids and careers do that to you!).",
      "rating": 4.0,
      "verified": true,
      "author": "King of the Stream",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "The portable case makes it easy to carry",
      "text": "Wow! I can't believe that I didn't order this sooner. What a difference these lights have made! It's contrast of night & day. The portable case makes it easy to carry. This especially great since I am petite. It is also easy to assemble & disassemble. I don't need any help. 1,2,3, and I'm done. To coin AT&T, it's that simple. Lol. Thanks a million. My pictures have improved by 100%. I have a great lens but the lighting is equally important.",
      "rating": 5.0,
      "verified": true,
      "author": "Elle",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Bulb did not work, no response from seller",
      "text": "Would have given 5 stars, but one of the bulbs did not work. On 12/22/16, seller sent an email asking for positive feedback, I responded by telling them that one of the bulbs did not work, as of 12/26, I have not received a reply. No reply from seller....Had to purchase another bulb elsewhere. kit itself was OK, and works for what I needed, except I need 3 working bulbs",
      "rating": 2.0,
      "verified": true,
      "author": "Teresa P",
      "helpful_votes": 3,
      "publication_date": 20161225
    },
    {
      "title": "Great for noobs!",
      "text": "I'm no photographer, but I bought these for taking the occasional high-quality family picture. We love them! Super easy to use and set up, and honestly idiot-proof (I'm vouching for this as a total idiot). The light they give off is soft and natural; perfect for taking baby/family pictures without leaving the house.",
      "rating": 5.0,
      "verified": true,
      "author": "EmTop Contributor: Baby",
      "helpful_votes": 3,
      "publication_date": 20170621
    },
    {
      "title": "Extremely good product. We have used the kit for both ...",
      "text": "Extremely good product. We have used the kit for both photography and video lighting use cases. The entire kit is very lightweight and the included storage options make it very practical to use on the go. The only downside I can think of is that the power cords are a little short, but extension cords are cheap enough that it doesn't make a real difference. The other nice thing about this kit is how easy it is to take down and put up. With a little practice, I've found that I can get the entire thing (plus a backdrop) put away in 10-15 minutes, with a very similar set up time.",
      "rating": 5.0,
      "verified": true,
      "author": "Teo S.",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "LOVE LOVE LOVE this set!!",
      "text": "I had always been looking for some beginner equipment for recording and taking portraits and this equipment is perfect! The lights are high quality and easy to assemble. I received the item quick and I definitely feel this item was way worth the purchase!! I have used these lights several times and the quality of the lights really makes a difference in my videos!! I would recommend this set to any new (or advanced!) photographers.",
      "rating": 5.0,
      "verified": true,
      "author": "Elise Ambrose",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Easy to use; great value",
      "text": "I bought these lights for my livestream dance class (had to close the studio due to COVID-19). It made a huge difference with the image quality piped through Zoom! It was very easy to assemble. I also took a few photos with my iPhone and it made a huge difference with the image quality. I will using this again and again! PROS: Easy to assemble Easy to use Portable Carry bag included Great value for the money CONS: Tripods may be a bit light",
      "rating": 4.0,
      "verified": true,
      "author": "RAG",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Portrait photography and portability!",
      "text": "These lights were the perfect buy. I bought my daughter a camera for Christmas. She wanted lights for portraits and for taking pics of clothing merchandise for a website. The are easy to assemble and use. The price was great and the results are fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "Pswright01",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "High Quality All-in-One Kit at an Affordable Price. Light Bulbs Even Included!",
      "text": "Very convenient pack for a studio lighting kit! We used this for our wedding's photo booth area and it was perfect! All-in-one kit that includes everything you need: 2 umbrellas with taller stands and lights, 1 shorter stand with lights. They all come securely packaged in styrofoam cases and nice zippered bags with handles for easy carrying. This is perfect for an all-in-one studio lighting kit. We actually are buying more of this item for our product photography since the quality was so great and the price was affordable! I couldn't believe that even the light bulbs were included. Hassle-free products are the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "Not much light for portraiture",
      "text": "It works ok but the amount of light it puts out is not that high. I find having to move it really close to the subject for adequate lighting at 400ISO. I mean within a foot from the subject which can make people feel claustrophobic. So clearly not ideal. I use it now only in an emergency. Really just not that much light for photographing portraits.",
      "rating": 3.0,
      "verified": true,
      "author": "Redbird",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "didn't make much of a difference when i tried using ...",
      "text": "didn't make much of a difference when i tried using it for my shoots. i am packaging it up and sending it back",
      "rating": 1.0,
      "verified": true,
      "author": "A. Riley",
      "helpful_votes": 3,
      "publication_date": 20170915
    },
    {
      "title": "YouTuber",
      "text": "Amazing light kit for the money. I do YouTube videos and when I went from using my iPhone 8plus to using a canon 80D the lighting got a lot darker. I needed to purchase studio lights and this is the kit I went with. Now my videos are super bright and very professional. You can check out my YouTube channel TheBeardDream to see me setting them up and talking about them. Even the bulbs come with the kit!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "These are great lights!",
      "text": "I was so excited to order these lights, and they fulfilled my expectations! They added the lighting I needed! I am brand new to photography lighting like this, but the instructions were very easy to follow and the design is intuitive. I loved that the case for storage is so nice, and that there is a case just for the bulbs—which were very well-packed! Easy set-up and take down. The cords are a bit short, but I had two extension cords, so no biggie, I love it! So glad I ordered it—now my photos are kicked up a notch!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria L. Smith",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "I love this lighting set up",
      "text": "I love this lighting set up! I use them in my home photography studio, and have used them for headshot as well as boudoir shoots. They're not made of the sturdiest materials, but if you're careful they work just fine! Combined with my normal home lighting, they make beautiful light for photographs. Don't regret this purchase at all. Two of my bulbs did not work but I contacted the email provided with the lighting set and had two replacement bulbs in no time. I also highly recommend buying two of the silver reflector umbrellas from the same seller, they've added a lot of variety to my photos.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Allison",
      "helpful_votes": 3,
      "publication_date": 20160623
    },
    {
      "title": "Versatile, quality lighting setup on a budget!",
      "text": "For the price, I was pleasantly surprised by the quality of these items. After setting up all 3, I was able to achieve a very balanced, even lighting for recording YouTube videos, game/product review videos, and green screen effects. The stands are fully adjustable and light while still feeling very sturdy, the removable umbrellas make the setup more versatile, and the carrying bag was a nice touch to make this setup portable. Overall, I am very happy with this purchase, and look forward to using it in all of my upcoming projects! This is a great budget lighting setup to help achieve professional looking results.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Everything is fine except for the bulbs. They are woefully inadequate for video. Expect to pay 50-80.00 for a new set of bulbs.",
      "text": "Just got it. Disappointed. All the other components are fine. However, expect to pay another 50.00 plus to get some bulbs that are actually bright enough for video. It's hard to fault the manufacturer for my lack of knowledge, but these bulbs do seem to be really undersized bulbs. They are woefully inadequate for my canon vixia rf 700. I need like 6 to 8k lumens to get a good video. I'll have some extra lights bulbs for the porch light or utility room I guess.",
      "rating": 3.0,
      "verified": true,
      "author": "Surgbinder",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Get the soft boxes instead",
      "text": "These are just O.K.A.Y. I purchased these as well as the 2 soft box led lights and I always just use my soft boxes... these umbrellas just lay in the closet. They do not produce as much light as the soft boxes.. there is a lot of shadows as well you definitely will need more lighting to go with these 2 umbrellas.",
      "rating": 4.0,
      "verified": true,
      "author": "Chase ",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Absolutely love this photography set",
      "text": "Absolutely love this photography set! I previously had one big photography light that cost me over $150 (plus $80 in bulbs) and it was hard to collapse and store. A friend had this set and I immediately sold my other one and bought this. I love it and recommend it to all of my photography students (I teach iPhone Photography and Instagram Strategy Classes). It is such a great set if you are trying to take high-quality product or lifestyle photos in your home for your business or blog! Grab yourself 3 pieces of white foamboard and you're set.",
      "rating": 5.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Great lights!",
      "text": "You can turn any room with a white wall into a portrait studio instantly! Just know that they can be flimsy, so careful with the stands. I have one of them holding together with tape, but for the price, you just can't beat it. Also, don't use this outside, if they fall I'm afraid they won't make it.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Wish cords were longer.",
      "text": "Using this photography setup for my blog photos. I've been pleased with the lighting so far. This kit was made with lots of bags for taking the lights with you places- although I don't see myself using that feature. I just wish the cords were longer. I've had to use extension cords quite a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Do-It-Yourself Danielle",
      "helpful_votes": 8,
      "publication_date": 20160224
    },
    {
      "title": "I like it!",
      "text": "I am just an amateur baker and photographer. I needed something that wasn't too expensive to give some light to my baking setup for videos and photos. This works perfectly for that. It isn't the best quality, but I didn't want the best right now. This is perfect for someone just looking for a starter lighting kit.",
      "rating": 4.0,
      "verified": true,
      "author": "Krystal Jenkins",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Good deal but not very sturdy",
      "text": "Worked very well for the price and suited my needs very well but it is not a set you should be rough with. Somewhat flimsy and cheap plastic parts would not stand up to much abuse. I used it to take photos of clothing in one location. I needed to adjust very little but still managed to break a small twist piece on the stand that anchored the umbrella part. I was able to \"jury rig \" it but it did not hold up to normal usage. Still, good deal for the price ...",
      "rating": 4.0,
      "verified": true,
      "author": "HobbyHomesteader",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Great Value for Beginners",
      "text": "Great first setup. After a few months now I'm already thinking about replacing them with something higher quality, but for $50 this was a great way for me to learn how to setup lights, and to make sure I wanted to continue doing product photography for my own products, before I spent $$$ on a professional setup. Recommended!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Anderson",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Good hobbyist solution",
      "text": "I needed lighting for recording instructional videos and video conferencing. This does the job at a good price. Mechanical execution is fine and more than sufficient for indoor use -- at this price you cannot expect military spec. hardware. The bulbs have a nice color tone (what I would consider as daylight outdoors, but this is an amateur eye) and are lighten up a subject well without being too bright.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Hulpke",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Easy, Lightweight and Quality for the Price",
      "text": "I opened my Lighting Kit today and practiced with it. Everything was packed so well! Everything worked! It's lightweight and a good quality for the price (less than $50!). It puts out a nice light and works fine with both my Canon full frame camera and my iPhone. I am looking foward to using this on some of my portrait shoots. Will report back after I do.",
      "rating": 4.0,
      "verified": true,
      "author": "LuAnn",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Okay for the Price",
      "text": "Average light kit. Not the best, but good for price. The quality and durability is so-so, stands are a bit on the flimsy side. However, everything worked and, they were easy to set up. Cords could be longer, had to use extensions.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Well made entry level equipment",
      "text": "As an artist I have worked with photographers who have some of the best and priciest equipment; as an artist I can not afford the best and priciest equipment but I'd like to think that I can recognize a good deal. This set up is a very good deal: affordable, easy to assemble, and performs as expected. I purchased this to support my meager goals in documenting my artwork (primarily watercolor and needlecraft stuff), using a basic digital slr. Everything went well and I am very satisfied with how everything worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Adnil",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "Nice set, and very affordable for the beginner!",
      "text": "UPDATE: ONE YEAR LATER (7/2016) Nice set, and very affordable for the beginner to photography. I am still using it with great enthusiasm, with a couple of add-ons for better results. l appreciate the stands-they have standard 1/4\" screws at the very top for most photo accessories. The umbrellas do make a nice soft glow and overall the equipment is sturdy. 5.2015: One of the bulbs included is acting odd with turning itself on and off. (The switches and such are fine.) This bulb still works with nudging in the socket. CONCLUSION, 7/2016: If the quality has stayed relatively stable for this product, I urge ALL amateurs to purchase this for very rudimentary portrait work or still life photos.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew L Burke",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Low quality overall. Missing parts.",
      "text": "This was returned. You get what you pay for. Parts were missing, as if this was already a returned item (the original box appeared frayed), and it was shipped out again. Overall, the quality was extremely low.",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie A. Poscablo",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Great deal!",
      "text": "I am an online ESL teacher and wanted to improve my lighting. Saw these and thought they would work great — and they do! Super simple to use and really brighten up my video while teaching.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Coffey",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Excellent Quality!",
      "text": "These are excellent quality stands and the height versatility is amazing! Just have to be real careful if you are opening package with a knife since you do not want to go too deep to avoid cutting the umbrellas (this is clearly marked on the package box). As an excellent bonus, each stands comes with a removable black tap that reveals an \"universal stud head\" that allows you to mount standard cameras or other standard adapters. So i might use the 2 big stands for lighting and use the third smaller stand as a tripod for my camera when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Top Reviewer",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "perfect for green screen",
      "text": "I am doing a spokesperson business and needed these lights for green, white screen lighting. They work great! Very easy to install and put together - the tripods seem not terribly sturdy but that's ok. they do the trick! I highly recommend this set- they will work nicely for video purposes and I am sure photo as well",
      "rating": 5.0,
      "verified": true,
      "author": "CD Shop",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Good to start with.",
      "text": "The lights are not that strong if you plan to use 2 of them total. However, the rest is good. Easy assembly. Easy to understand manual. Pro tip is put the bulbs at the end and leave about 10 inches gap from umbrellas to not break bulb. Easy assembly, etc. Will need three if no additional lighting is present.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Trying to Be Helpful",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "I LOVE this light set",
      "text": "I LOVE this light set. The wattage capacity is superb, the build feels like quality, and the sale price was excellent. Provides a strong soft light. I recommend pairing it with a few items I'll list below to get the most out of them. With the 4 socket adapter and a set of the ALZO bulbs I could get my camera ISO down to 400-500 in an enclosed room with no outside light, where previously with the standard lights it had been 1600. Can't recommend these enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Works well, but there's better options out there.",
      "text": "Worked great for a while, when I didn't know any better options existed. I was using this for product photos. But tearing down and setting up became cumbersome, time consuming and when it's assembled it takes up a lot of space. If you're using a light kit regularly I recommend saving yourself the time and ordering a ring light. Since I made the switch to the right light I've been very happy!",
      "rating": 4.0,
      "verified": true,
      "author": "L. Waugh",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "lighting that's simple but effective, it works.",
      "text": "Price was great, delivery very fast, packed well. every thing worked. I also bought a flash. I plan to order more lighting. this is not a flash system the lights stays on which makes it easer to judge the lighting. Great system for the beginner photographing people or children. Very portable, take with you to some ones house or party. For the money, you can't do better. might want to add or make an extension cord with a switch and buy extra bulbs, just in case. Think about a back drop set.",
      "rating": 5.0,
      "verified": true,
      "author": "Ktown",
      "helpful_votes": 0,
      "publication_date": 20170916
    },
    {
      "title": "It Really Helped my YouTube & selfies lol",
      "text": "Not a Photographer but a youtuber and definitely a Girl who loves taking pictures and I love it or the price it's really good. The lights are bright as ever sometimes I only use one when I'm taking selfies. It's really good of course if I wasn't on a bugget I would look into something more advanced but this was worth it if your a beginner and just starting out or just for YouTube videos it's perfect. Hope I helped someone",
      "rating": 5.0,
      "verified": true,
      "author": "Unique Lior",
      "helpful_votes": 3,
      "publication_date": 20161116
    },
    {
      "title": "BUYER BEWARE",
      "text": "This is a great wine preservation system, but it is important to know how to use it or it will not work. I have used this so far on a wine that I tapped with Coravin and still super fresh 9 months ago. Amazing! However, I have friends that have used this and are not happy. I have a full length video on that covers the four main mistakes people make. It's very simple to use as long as you know what to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Fagin",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Great Product, Easy to Use.",
      "text": "Great product for a portrait photographer. They are easy to set up, I am not very good at setting this type of stuff up and this was very simple. My only complaint is that the bag that the light bulbs come in doesnt zip all the way when you get them in there. But other than that these work very well.",
      "rating": 4.0,
      "verified": true,
      "author": "courtneyTop Contributor: Eye Makeup",
      "helpful_votes": 4,
      "publication_date": 20170323
    },
    {
      "title": "Great for beginners or small businesses!",
      "text": "This is a great beginning setup for photographers or those photographing for their businesses! It is easy to set up and understand. You could easily change out the bulbs to get your desired warmth. It also is easy to adjust the height of the lights for what you need. I use it to photograph clothing for my small business and it makes such a difference in the photo quality without much effort! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaden Braunagel",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Amazing lighting kit at the best value!",
      "text": "This set is amazing! I was super excited to find a reasonable lighting kit for my small business so when I found this one I knew I had to try it. I ordered multiple items so my shipment took just under two weeks to receive. It was packaged very well and included the instructions and a business card in case I had questions or needed to contact them back. It was very user friendly to set up!! Everything was easy to understand and the best part is the bulbs all worked. I highly recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly9",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "No complaints",
      "text": "You’re getting what you pay for here. I’ve used them on sets and they’re pretty good for filling dark spots and the diffusion on them is nice. They perform well enough so that we’re not seeing constant flickering in the footage so it’s a solid buy.",
      "rating": 5.0,
      "verified": true,
      "author": "reader",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Nice little light kit perfect for the hobbyist/amature photographer!",
      "text": "Great little lighting set! Easy to set up and break down, easy to transport, and gave great results this weekend! I like the CFB's as opposed to the photo-floods (incandescent) that I used to use as they were very hot!! The stands seem to be well-made (aluminum) and are steady enough for me. They can always be weighted if need be. I really like the tote bag for the bulbs also-a nice touch! Sure, it's not a $500 studio flash kit but it's perfect for the on-site stuff I do!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Beckett",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "Great!",
      "text": "Never realized how much simple light increases the quality of photographs. Self portraits are my hobby, and the beauty of my photographs after using these as opposed to the built-in flash on my camera is like night and day. I also travel a lot for photos in different settings, and these were surprisingly easy to have in tow.",
      "rating": 5.0,
      "verified": true,
      "author": "Tia",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Arrived with broken part",
      "text": "Arrived with a broken clamp on the tripod. I emailed seller and haven't heard back yet. If and when part is replaced, then I'll ammend my review.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob R.",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Good price for the novice photo/youtuber",
      "text": "I'm VERY new to photography. So take this review for what it's worth. I use these to do youtube reviews on LEGO products. It works well, I get better light disbursement, but still trying to make them kill all the shadows. That's on me. The stock bulbs that came with it seemed under powered for any kind of outdoor use (but they are studio lights so duh). Good price for the lot, can't judge quality because I'm a novice, but it seems solid to me. With some tweeking i'll get them to work right.",
      "rating": 4.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 0,
      "publication_date": 20160420
    }
  ],
  "product_meta": {
    "title": "LimoStudio Photography Photo Portrait Studio 660W Day Light Umbrella Continuous Lighting Kit, LMS103",
    "rating": 4.5,
    "feature_bullets": [
      "⭐Contents: [3 pcs] 45W CFL Bulb / [3 pcs] Bulb Socket / [2 pcs] 33-inch Umbrella Reflector / [2 pcs] 82.3-inch Light Stand",
      "⭐[1 pc] 29.8-inch Light Stand / [1 pc] Bulb Carry Bag / [1 pc] Photo Equipment Carry Bag",
      "⭐45W Photo CFL Bulb: 6000K / 1820 Lumen / E26, E27 Standard Screw Base / Max Energy Saving up to 80%",
      "⭐33-inch Diameter White Umbrella Reflector: Made of Enhanced Nylon / Works well with Any Flash or Lighting Fixture",
      "👇 Instruction Manual Download, under \"Product information\" 👇"
    ],
    "specifications": {
      "Product Dimensions": "7 x 7.25 x 31.25 inches",
      "Item Weight": "9.38 pounds",
      "ASIN": "B005FHZ2SI",
      "Item model number": "FBA_LMS103",
      "Customer Reviews": "4.5 out of 5 stars6,230 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#1 in Photographic Lighting Umbrellas",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 1, 2011",
      "Manufacturer": "LimoStudio"
    },
    "categories": [
      "Lighting",
      "Lighting & Studio",
      "Lighting Controls & Modifiers",
      "Umbrellas",
      "Electronics",
      "Camera & Photo"
    ],
    "price": 55.6
  }
}