{
  "website_summaries": [
    {
      "verdict": "The Panasonic Lumix G X Vario PZ 14-42mm F3.5-5.6 ASPH. lens is one of the smallest zoom lenses available for the Micro Four Thirds camera system, but soft images and distortion prevent it from really shining.",
      "pros": [
        "Compact design",
        "Useful zoom range",
        "Optically stabilized"
      ],
      "cons": [
        "Soft images",
        "Expensive"
      ],
      "aspects": {},
      "publication_date": 20130814,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "I bought a used lens....",
      "text": "Bought this to put on my Inspire 2 and yes it is incredible. The video quality is unreal and really impresses my clients. One but here, and it is a biggie. I knowingly bought this as a used in \"very good condition\" and thought it would be ok, not new but functional. Problem is there are spots on the lens that will not clean off. They are not visible in all shots but yeah they are there. Really thought that \"very good condition\" should have a clear lens. So what to do....",
      "rating": 2.0,
      "verified": true,
      "author": "Kenney",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Compact zoom lens for 4 third cameras",
      "text": "Very good lens, use it on several Olympus Pen and one OMD Olympus camera. Not one of the best lens I own (have several professional quality lenses for my 4 thirds cameras). Its overall image quality is acceptable to good and I do like that it is very compact. This is important when traveling by air and sight seeing in museums and cultural centers. One does not want to be over bearing with a large camera and huge lenses in these environments. Les lens on a 4 thirds compact camera is only lightily larger than typical tourist point and shoot cameras. This is great!",
      "rating": 4.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "pretty decent for my gh4",
      "text": "I bought this for my gh4 and I'm very please with it. For the price, I can't really complain; it gets the job done and everything looks nice and crisp. Very good bokeh effect and has a good depth of field. These are some budget friendly and affordable quality lens that I would recommend for beginners. The zoom button is solid and works great for a smooth transition! The manual focus is a bit weird, since you focus by pressing up/down rather than having a focus ring.",
      "rating": 5.0,
      "verified": true,
      "author": "SelflessHERO",
      "helpful_votes": 0,
      "publication_date": 20150903
    },
    {
      "title": "it is the best way to go for a zoom lens",
      "text": "I Use it for my Inspire 2 Drone with the x5s gimbal/camera... it is the best way to go for a zoom lens.. highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Neil",
      "helpful_votes": 3,
      "publication_date": 20170303
    },
    {
      "title": "My go to for the Inspire 2",
      "text": "Great lens for my Zenmuse X5s on the Inspire 2. Just make sure you get a balance ring.",
      "rating": 5.0,
      "verified": true,
      "author": "Toby",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "works great with my Lumix G5",
      "text": "I was a little nervous by some of the negative reviews, but the compact size was too much to resist trying. I don't see any image issues with this lens on my G5. Maybe it doesn't do as well with the earlier models in the series, I don't know. But the ability to have some telephoto zoom capability in a compact format keeps the whole package ultra portable, which is why I got the Lumix in the first place.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Trails",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Excellent compact zoom",
      "text": "I bought this lens with great reservation because of the negative reviews about its soft focus at mid range speeds. I have done no sophisticated testing but am very pleased with the quality of my images. The small size is remarkable and it makes my Panasonic GX1 a very versatile pocket camera which is why I bought the camera. I recomend the lens for its compactness for everyday use in good lighting conditions. Professional quality work will obviously require higher end lenses at higher end prices and size.",
      "rating": 4.0,
      "verified": true,
      "author": "pen name",
      "helpful_votes": 0,
      "publication_date": 20130603
    },
    {
      "title": "... my DJI INSPIRE 2 drone and it is a great lens. The zoom feature allows for safer flights",
      "text": "I use this on my DJI INSPIRE 2 drone and it is a great lens. The zoom feature allows for safer flights.",
      "rating": 5.0,
      "verified": true,
      "author": "Image In Flight",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Nice compact lens",
      "text": "Lens is sharp; zoom and focus work very well. The design allows for a compact, pancake profile when the camera is off. The lens extends when powered up. The best solution if you want a four thirds camera with a nearly point and shoot footprint (It's still a bit larger of course).",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Kafka",
      "helpful_votes": 2,
      "publication_date": 20130622
    },
    {
      "title": "Works great!",
      "text": "Great replacement for the stock lens, at the expense of shorter battery life.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Great image quality on my GX7",
      "text": "I use this as my primary lens on m GX7 works great is sharp. i tend to use AE-L button on the rear for focus so don't worry taht this is a focus by wire lens. it collapses flat like a pancake and becomes compact when in my camera bag. Highly Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Wally brooks",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "Great lens; retracts to a very small size which ...",
      "text": "Great lens; retracts to a very small size which allows the camera to be put into a pocket. The zoom button on the barrel takes a little getting used to, but that's a fair compromise for a lens this small. I have not noticed any lens distortion but I am not a professional photographer.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Chase",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Great Lens!",
      "text": "I have always wanted the convenience of a zoom with the size of a pancake, but I have also read many poor reviews on this lens. I finally took the plunge and mine is perfect. The blurry image problem that some have reported is supposed to occur at longer focal lengths with shutter speeds between 1/160 to 1/200 and handheld. I cannot duplicate the problem on my G3. This little gem is very sharp, can focus faster than any lens I own (P20, PL25, P45-200), and the power zoom is really nice. This is now my favorite walk-around lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee O.",
      "helpful_votes": 9,
      "publication_date": 20120725
    },
    {
      "title": "Awkward",
      "text": "It's a fine lens, but the servo zoom controls were just too awkward for me. I ended up returning.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Clough",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "It makes a great travel zoom on my Lumix GM1 body",
      "text": "It makes a great travel zoom on my Lumix GM1 body. Very good optical quality as well. I am very pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Liang",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Lens quality is fine, but it's terribly ugly and the sliders are not fun to use.",
      "text": "I won't comment on the quality of the lens, there are enough reviews of that here and on the Internet about it and the general consensus is that it's fine. It's very compact but I couldn't get used to the buttons for focusing and zooming. Made my GX7 feel like a camcorder and not a camera. Went with the Olympus instead. I keep reading that it's good for smooth zooms in video. That might be true, but honestly you shouldn't be zooming in video. It never looks good.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Hedstrom",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Very Good!",
      "text": "I use this lens as my main lens since I bought just the camera body. It works very well and I am very pleased with the pictures and videos taken with this lens.",
      "rating": 4.0,
      "verified": true,
      "author": "Eduardo A. Derivera",
      "helpful_votes": 0,
      "publication_date": 20130306
    },
    {
      "title": "lovely",
      "text": "My new copy of this lens from Amazon exhibits none of the blurry / double-line phenomenon that others have discussed... Just clear images from a remarkably small package. It is a great lens for hiking, etc., focusing close-up on small details and then zooming out to take in vistas. Pretty amazing to pack so much into something so light.",
      "rating": 4.0,
      "verified": true,
      "author": "Shenanalysis",
      "helpful_votes": 14,
      "publication_date": 20120404
    },
    {
      "title": "small and weighs very little",
      "text": "It's very small and weighs very little. It's my first lens and works fine in my Panasonic GH3, clear and smooth images, fast autofocus.",
      "rating": 5.0,
      "verified": true,
      "author": "lowdowngt",
      "helpful_votes": 0,
      "publication_date": 20130423
    },
    {
      "title": "So far so good",
      "text": "I have not fully tested this lens yet and I am aware of the double image issues that this lens is supposed to exhibit. So far so good. I ordered it for my GH2 and it really is smaller than I expect a zoom lens to be I am amazed and if it does not exhibit the blurry image problem then its a keeper. Please be aware that this lens is bulk and not retail and does not come with a rear lens cap.",
      "rating": 4.0,
      "verified": true,
      "author": "johnnyw888",
      "helpful_votes": 2,
      "publication_date": 20120606
    },
    {
      "title": "Lasted one year.",
      "text": "I went to mount the lens last week and got messages saying to check to see if it was mounted properly. No amount of removing and replacing or jiggling helped. By pressing and holding the lens release button Isometimes get rid of the message but lens will not focus or zoom or go anything. I believe it was a mistake to miniature this optic by doing everything electonically. I still love the original 20mm 1.7 lens. Nothing beats a fast sharp prime lens. I just wixh there were morw fixed focal lengths available.",
      "rating": 1.0,
      "verified": true,
      "author": "John carrow",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "quite good delivery",
      "text": "item corresponds to what I expected, quite good delivery performance",
      "rating": 4.0,
      "verified": true,
      "author": "Poignant",
      "helpful_votes": 0,
      "publication_date": 20141005
    },
    {
      "title": "The lens has performed well so far.",
      "text": "I am still learning the PZ 14-42 lens. I like the compact package this lens makes on the GX7. A very handy package. I have not had any problems that cannot be attributed to operater error. Now that the weather has moderated I will use this product more.",
      "rating": 4.0,
      "verified": true,
      "author": "Old hac",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "I strongly suggest it for video",
      "text": "Compact and pretty sharp, good motorized zoom, transformed my GH3 into a real camcorder with tremendous quality",
      "rating": 5.0,
      "verified": true,
      "author": "G. Sartori",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Two Stars",
      "text": "Not a great lens id save my money and look at others",
      "rating": 2.0,
      "verified": true,
      "author": "DustinDep",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "Four Stars",
      "text": "Paired with lumix cameras you can't really complain I just wish I had known about other lenses",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20140812
    },
    {
      "title": "Miss the Zoom ring.",
      "text": "Got this lens because it was f/3.5, instead of f/4.0. I like that it is so small, too. I do wish it had the regular zoom ring, but given that the lens is pretty inexpensive, I can live with it.",
      "rating": 4.0,
      "verified": true,
      "author": "dcant",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "great as a very compact zoom",
      "text": "I bought this lens as a compact zoom on an Olympus OMD. For that purpose only, it works great -- kinda a pocket camera for a large pocket.",
      "rating": 4.0,
      "verified": true,
      "author": "After posting, they promptly made it good",
      "helpful_votes": 2,
      "publication_date": 20130512
    },
    {
      "title": "This lens is aproved by Blackmagic Pocket Cinema Camera but ...",
      "text": "This lens is aproved by Blackmagic Pocket Cinema Camera but it is not working. It is blocked , no zoom , no focus. Is it a camera or lens problem? I want to return both.",
      "rating": 1.0,
      "verified": true,
      "author": "Peterson Medeiros Beltrame",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "machined well",
      "text": "Effective in hooking up a fine Olympus 18-180 Lens to my Panasonic GH3. I do have to manually operate the lens but have gotten some great pictures from it. I have since upgraded to a panasonic 14-140. I frequently use manual and have found the Olympus can produce some very exact photos with time. And as the GH3 is so adaptable, it opens up the possibility and opportunity to utilize other lens. Also, the GL3 is practicully (reasonably) waterproof and although i have not tested it, the adaptor should not limit the camera's weather proof aspect significantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Mack",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "NOT BLACK like the image.",
      "text": "Amazon blew another description as this is a SILVER lens and not a black one. Had it been the black one, I would have kept it. The silver color though looks stupid on my black body Lumix.",
      "rating": 1.0,
      "verified": true,
      "author": "Chip Thome",
      "helpful_votes": 0,
      "publication_date": 20120711
    }
  ],
  "product_meta": {
    "title": "PANASONIC LUMIX G X Vario Power Zoom Lens, 14-42MM, F3.5-5.6 ASPH, MIRRORLESS Micro Four Thirds, Power O.I.S, H-PS14042K (USA Black)",
    "description": "*:BlackThe Panasonic premium LUMIX G X VARIO PZ 14-42mm/F3.5-5.6 ASPH./ POWER O.I.S. (H-PS14042) lens is the newest addition to the Lumix CSC lens lineup. With electric-powered zoom operation, the retractable Power Zoom H-PS14042 lens is extremely compact, approximately 26.8mm in length, and weighs approximately 3.35oz, offering ultra-high portability.Panasonic’s new premium LUMIX ”X” Series of lenses, including the LUMIX G X VARIO PZ 14-42mm/F3.5-5.6 ASPH./ POWER O.I.S., offers a versatile zoom range of 14-42mm (35mm camera equivalent: 28-84mm) suitable for a wide range of scenes, such as dynamic landscape to portrait. Crystallizing Panasonic's optical technologies, the LUMIX X lenses feature superb image rendering for lifelike textures, crisp edge-to-edge contrast, a unique Nano Surface Coating to help minimize ghosts and flaring in natural settings with remarkable transparency.",
    "rating": 4,
    "feature_bullets": [
      "28mm-84mm in 35mm equivalent zoom",
      "Nano Surface Coating technology minimizes reflections at entire visual light range",
      "POWER O.I.S. (Optical Image Stabilizer) integrated into the lens makes it easy to shoot sharp images even in low-lit situations",
      "Power zoom"
    ],
    "specifications": {
      "Product Dimensions": "1.06 x 2.4 x 2.4 inches",
      "Item Weight": "3.35 ounces",
      "ASIN": "B005J5TZVG",
      "Item model number": "H-PS14042K",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.0 out of 5 stars86 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#82 in Mirrorless Camera Lenses",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 26, 2011",
      "Manufacturer": "Panasonic"
    },
    "categories": [
      "Mirrorless Camera Lenses",
      "Electronics",
      "Lenses",
      "Camera & Photo",
      "Camera Lenses"
    ],
    "price": 349.0
  }
}