{
  "website_summaries": [
    {
      "verdict": "This bench vise is an affordable alternative to professional-grade vises designed for heavy duty use. Woodworkers and gunsmiths will especially appreciate the size and depth of the jaw assembly.",
      "pros": [
        "Large 6-inch jaws and a nearly 6-inch maximum depth will handle most amateur projects with ease",
        "Large anvil area for bending and hammering metal",
        "360-degree swivel base"
      ],
      "cons": [
        "Not designed for heavy-duty professional use",
        "Vise can lock up permanently if extended to maximum advertised depth"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "this thing is amazing. Once you lock it",
      "text": "For the price, this thing is amazing. Once you lock it, it does not swivel. You also do not want to turn the handle all the way out. The threaded rod that moves the jaws open and closed, is a bit of a pain to put back together. Other than that, this is a very good vise. Smooth working and things clamped down in the jaws do not move. The only thing they could improve on this is. Put a stop on the thread rod. You unscrew the jaws to wide, it's a challange to get the threads started to screw back in. I had to partially dissemble it to and get working correctly.",
      "rating": 5.0,
      "verified": true,
      "author": "WheelHorse74",
      "helpful_votes": 3,
      "publication_date": 20160803
    },
    {
      "title": "Quality was higher than anticipated, great value",
      "text": "I needed a vice for working on guns, but didn't want to spend a lot. Enter the D3248. I expected mediocre quality at this price point, but was blown away. This thing is solid as can be, heavy and can take some abuse. It moves very well with no grinding or hiccups from poor machining. The only negative, if you can call it that, is that it appears that the manufacturer applies grease to the system through the submersion method. I had to use about 10 paper towels to wipe it down and clean it up, but that's preferable to not being greased at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Gunderson",
      "helpful_votes": 10,
      "publication_date": 20130711
    },
    {
      "title": "Cannot be beat for the price.",
      "text": "For my purposes this vise is perfect. I'm using it to hold metal stakes to hammer/forge silver against in jewelry-making. It's been very sturdy so far and all of the elements operate smoothly. Yes, it was covered with a ton of grease when I received it - but this is to protect it from rust between manufacturing and purchase......the same reason I lightly oil steel tools I don't use on a regular basis.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Thinks",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "Solid vise, solid value",
      "text": "This is a great all-purpose vise, and a very good value at the price. Clamping is secure and true, and the swivel and and screw are reasonably smooth. Now, if you're running a professional machine shop, this may not be precise and well-made as a Wilton, but at about 1/4 or 1/5 the price of a Wilton, it's plenty good for the vast majority of homeowners.",
      "rating": 4.0,
      "verified": true,
      "author": "Costero",
      "helpful_votes": 5,
      "publication_date": 20121110
    },
    {
      "title": "Great vise.",
      "text": "I bought this strictly for working on AR 15s and other guns. I was hesitant about the quality since I couldn't see it before I bought it. I've torqued things down, banged, tightened and untightened things and this has held up like a champ! I'm very happy with this vise and I'm glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "6 inch Jaws",
      "text": "I ordered this and everything said 6 inch. But it didn't specifically say base or jaws. It is Scarry ordering on line and needed a very nice vice for my husband. This was exactly what I needed . Someone else commentet nice vice for small garage work. I believe this is way more than that. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "amazon lori k mi",
      "helpful_votes": 2,
      "publication_date": 20131227
    },
    {
      "title": "Incredible vise.",
      "text": "I was pleasantly surprised when I opened the box and saw how husky and big it was for the $. I have used it now for several months and it is better than others I have had in the last 30 years. Very precise and smooth. I have beared down pretty hard on it several times and it has taken it in stride. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "wallace m duffy",
      "helpful_votes": 3,
      "publication_date": 20140205
    },
    {
      "title": "broke within a week",
      "text": "The first time I opened this vise all the way (but not to the point of it separating), it would not close again no matter how much pressure I applied to the handle. And the handle was bent upon receipt btw. It seems the screw mechanism is poorly made and jams easily. Sent it back! Don't buy this, invest in a quality vise instead.",
      "rating": 1.0,
      "verified": true,
      "author": "JeffNYC74",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "Great buy!",
      "text": "This little guy has held up well through several projects. Do be careful not to vise anything that you don't want teeth marks in. Overall, the built quality is great and it doesn't loosen while vised like other cheap ones do. Nice color, nice price, great product by Shop Fox!",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "Really like this vise",
      "text": "Really like this vise. Just the right size for home use as long as you don't need to clamp anything over 4\". Like the durability of it. Used 3/8\" bolts with flat washer and a lock washer. I like the color too.",
      "rating": 5.0,
      "verified": true,
      "author": "Char",
      "helpful_votes": 0,
      "publication_date": 20150412
    },
    {
      "title": "Nice vise and claps evenly and firmly",
      "text": "Nice vise and claps evenly and firmly. Although it came VERY greasy with black lubricant. Had to thoroughly clean it before mounting it to the bench.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Quality Built",
      "text": "This is a heavy, well made unit that is a stable platform for the usual work I do around the house. I have not struck the anvil with a hammer or used a pipe extension on it to tighten up beyond my hand strength. Good value.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren N.",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Super Vise!",
      "text": "Arrived well packaged. Coated with a lot of grease but it wiped off easily with paper towels. Very heavy duty and smooth...what else do you need in a vise? Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "JAMBO",
      "helpful_votes": 2,
      "publication_date": 20140123
    },
    {
      "title": "This was a darn good purchase. I got it through Amazon's warehouse deals",
      "text": "This was a darn good purchase. I got it through Amazon's warehouse deals. Try obtaining a vise like this quality for the price you can obtain via Amazon. Solid construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Wagon",
      "helpful_votes": 0,
      "publication_date": 20141009
    },
    {
      "title": "Shop vise",
      "text": "This vise is well made,strong enough to break stubborn bolts. An excellent addition to your shop will hold any item while pounding with a hammer, takes a beating.Well satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 10,
      "publication_date": 20120819
    },
    {
      "title": "nice little vice",
      "text": "good little vice I have used this a good many times and has worked great with no problems. It is not a big vice but for the average tinker in the shop guy this will work just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Great for my Work!",
      "text": "This vise is a strong, sturdy asset to my shop. I recommend this vise for small to medium jewelry makers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 3,
      "publication_date": 20121217
    },
    {
      "title": "Great Bench Vise",
      "text": "I have not had this long but initial impression is that it good quality. It got a good amount of weight to it and everything moves smoothly. Easily bolted to work bench.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddog",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "not bad",
      "text": "it is a cast vice but building horse shoe's doesnt requier a whole bunch of hardnes and the anvile is wide and plained nice and flat and the jaw's are alined and nice and tite [ no woble] good medeim duty pice .",
      "rating": 5.0,
      "verified": true,
      "author": "Michael j Riemer",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Five Stars",
      "text": "Husband likes likes likes it. Thank you for sending it faster than expected!",
      "rating": 5.0,
      "verified": true,
      "author": "Corkey Hallberg",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Great vise for the money",
      "text": "So far it's turned out to be a very nice vise for the money. Very handy to have when a third hand is needed.",
      "rating": 5.0,
      "verified": true,
      "author": "JoeBotts",
      "helpful_votes": 4,
      "publication_date": 20130915
    },
    {
      "title": "Tough",
      "text": "this a very good, tough vice and it works great. Recommend finding the right size bolt to anchor it down so there is no movement.",
      "rating": 4.0,
      "verified": true,
      "author": "tunamba",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Good Vice",
      "text": "Medium duty vice for home workbench. Works well & seems sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "JD-MAC",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Vice",
      "text": "This vice is very well made. Precisely machined. Worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Whitey",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "glad to have it",
      "text": "great bang for the buck. glad i found this product",
      "rating": 5.0,
      "verified": true,
      "author": "Dzu Duong",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Good tool for the price",
      "text": "The Vise is very good for the price. If you need one small step better the price will be almost doubled.",
      "rating": 5.0,
      "verified": true,
      "author": "valdim",
      "helpful_votes": 2,
      "publication_date": 20140224
    },
    {
      "title": "This product is \"GREAT\"",
      "text": "I recently purchased this item off amazon and it came in excellent condition and works perfect, and looks great. I would recommend it to anyone looking to purchase a good bench vise.",
      "rating": 4.0,
      "verified": true,
      "author": "AUDRIUS TARVYDAS",
      "helpful_votes": 5,
      "publication_date": 20120303
    },
    {
      "title": "Good for the price",
      "text": "This vise does what I ask of it; good clamping and easy operation. Took off one star because the handle could be stronger, thought that might be a user problem--I'm using it to reform 6061 angle, and tried using a \"cheater\" bar. Wound up bending the handle instead.",
      "rating": 4.0,
      "verified": true,
      "author": "RGM",
      "helpful_votes": 3,
      "publication_date": 20121218
    },
    {
      "title": "Vise",
      "text": "Small, heavy, strong and does everything I need to be done. I also purchased their drill press/sander and I was pleased with both items.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Birch",
      "helpful_votes": 3,
      "publication_date": 20130504
    },
    {
      "title": "Great Vise for a great price",
      "text": "The vise jaws line up great, and has no play when locked in place. I had no problems with product when it was shipped, just took it out of the box and set it up. Would recommend to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "it is too expensive!",
      "text": "I thought it would be bigger when I saw it on the page,( they should show it better), it is however a good vise.",
      "rating": 3.0,
      "verified": true,
      "author": "moto-x",
      "helpful_votes": 0,
      "publication_date": 20130223
    },
    {
      "title": "Bang For Your Buck",
      "text": "This vise is exactly what you pay for and more. It is a great buy when you consider what you paid. Used within its limits for mild to intermediate shop work it more than does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Buck Bartholomew",
      "helpful_votes": 5,
      "publication_date": 20130523
    },
    {
      "title": "Just Okay",
      "text": "Would be okay I guess, bought it for my dad. But he was looking for something bigger. looks like it would be okay for home use.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay McDonald",
      "helpful_votes": 0,
      "publication_date": 20140130
    },
    {
      "title": "Bought for my husband. He absolutely loves it! ...",
      "text": "Bought for my husband. He absolutely loves it! He says it is strong and he really likes how he can swivel it.",
      "rating": 5.0,
      "verified": true,
      "author": "crow",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Great vice",
      "text": "This is a really nice vice. You will not regret your purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Hollingshed",
      "helpful_votes": 0,
      "publication_date": 20140913
    },
    {
      "title": "Good heavy product",
      "text": "It should be a relativly simple product. It needs to be solidly built, and do what it's suppose to do and be a good value. On these points it does well, 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean Fife",
      "helpful_votes": 7,
      "publication_date": 20121221
    },
    {
      "title": "Missing in action",
      "text": "I ordered this vise several months ago and still don't know when it will arrive. I can't rate it till I see it.",
      "rating": 1.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "First one recieved broken, second one damanged during shipping",
      "text": "First one I unscrewed all the way to clean the cosmoline packing oil off of it. Well, after that I could never get it to screw back together. There were a lot of metal shavings from production so I cleaned them out of the threads. Still nothing. I had to send back to amazon. The new one which was poorly packed...shame on amazon..... had the adjuster bar bent into an L. I kept it. I can still use it fine this way or bend it back.",
      "rating": 3.0,
      "verified": false,
      "author": "bms231",
      "helpful_votes": 3,
      "publication_date": 20140128
    },
    {
      "title": "Bad choice!",
      "text": "After opening the jaws they will not close. I've tried slowly threading the screw back in but to no avail. Very poor quality. Do NOT Buy!",
      "rating": 1.0,
      "verified": false,
      "author": "Doug Lilly",
      "helpful_votes": 0,
      "publication_date": 20140805
    },
    {
      "title": "great vise",
      "text": "the only reason this vise did not recieve 5 stars is because it didnt come with any mounting hardware. Now i am not sure whether this was a mistake with just my order, or if i am the only one that doesnt know you have to get your own bolts for mounting... probably the latter... but all the same my vise didnt come with it and now i gotta run to lowes lol... great quality vise and would still buy despite missing hardware!",
      "rating": 4.0,
      "verified": false,
      "author": "Ignomoly",
      "helpful_votes": 0,
      "publication_date": 20140212
    }
  ],
  "product_meta": {
    "title": "Shop Fox D3250 Bench Vise with Swivel Base, 6-Inch",
    "description": "Size:6-InchFROM THE MANUFACTURER\nThis precision made Bench Vise feature heavy castings, 360 Degree swivel range with two locking levers, pipe jaws and a perfectly flat anvil face. Milled square center slide ensures jaws stay aligned as the vise is tightened.",
    "rating": 3.8,
    "feature_bullets": [
      "6-Inch long",
      "6-1/4-Inch capacity",
      "360 Degree swivel",
      "2 locking levers",
      "Pipe jaws, flat anvil face"
    ],
    "specifications": {
      "Manufacturer": "Shop Fox",
      "Part Number": "D3250",
      "Item Weight": "31.6 pounds",
      "Product Dimensions": "15 x 9 x 8 inches",
      "Item model number": "D3250",
      "Is Discontinued By Manufacturer": "No",
      "Size": "6-Inch",
      "Item Package Quantity": "1",
      "Measurement System": "Inch",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "1-Year Warranty",
      "ASIN": "B005W0V88G",
      "Customer Reviews": "3.8 out of 5 stars64 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#628,347 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "October 29, 2011"
    },
    "categories": [
      "Bench Vises",
      "Hand Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools",
      "Vises"
    ],
    "price": 102.87
  }
}