{
  "website_summaries": [
    {
      "verdict": "Featuring every instrument your little one needs to start up their very own 1-man band, this captivating musical activity table makes early learning fun and comes with a bonus Bendy Ball Toy to boot.",
      "pros": [
        "Introduces kids to a variety of musical instruments with a drum, strummable guitar, spinning french horn, and brightly colored piano keys",
        "Piano keys feature 2 modes: musical notes and light up numbers",
        "Removable legs allow for seated play and can be attached once little ones learn to stand",
        "Comes with the popular Bendy Ball with an integrated rattle for extra fun"
      ],
      "cons": [
        "The legs could be sturdier",
        "Supervision may be required for babies who are using it to pull themselves up"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great toy children with moderate dystonia",
      "text": "My 18 month old has cerebral palsy and is still unable to sit up on his own. We put him in a floor sitter and this toy encouraged him to try to stay upright for a pretty long time. He's also deaf and had his cochlear implant activated about 3 months ago so sounds are very new to him. He loves the lights and music of this toy. Very easy to activate! I love it! Also for something less than $40, plus free shipping with Amazon Prime - totally worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Chloe Happ",
      "helpful_votes": 83,
      "publication_date": 20170226
    },
    {
      "title": "Too many buttons and not stable",
      "text": "We got this for our son as a toy for pulling himself up to standing at 6 months. Unfortunately it is too light for a 16 lb baby to pull up and and can tip over. Of course, you can play with it with your baby and hold the legs so that it is stable. However one more drawback is that there is too much stimulation on this table for our (now 8 months old) baby. He quickly bores with it bc he presses a bunch of buttons and the mileau of classical songs is too jumbled. I hope he grows into this toy, but it is too much for him right now.",
      "rating": 3.0,
      "verified": true,
      "author": "Jesse Schroeter",
      "helpful_votes": 11,
      "publication_date": 20161230
    },
    {
      "title": "Great toy!",
      "text": "This is a super fun toy for my baby. It helps her stand and she enjoys the music and lights. I like how it plays Instrumental music as opposed to annoying kid songs that get stuck in your head and play on repeat. The only thing I don’t like about it is that it turns on after your child moves on to other toys inticing her to return. She has moved on toy, don’t distract her with your lights and sounds, let her play with her book and use her imagination. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Venus Kennedy",
      "helpful_votes": 7,
      "publication_date": 20180723
    },
    {
      "title": "Only one month before complete breakdown!!!!!",
      "text": "It was amazing while it lasted!!! So, here it is one month after purchase and it no longer works. Switched the batteries just to see if it would help, but no difference. It's not that there's no noise, but there's no sweet music anymore, just static and freeze and then static followed by a slamming noise. Disappointed mostly because baby toys don't last long due to child interest but it's worse when the toy doesn't last long enough to even make it to that. I won't says it's not worth buying but if you're in between this and another standing you.... if it has good reviews and lasts longer... go with the other.",
      "rating": 2.0,
      "verified": true,
      "author": "L Dani",
      "helpful_votes": 4,
      "publication_date": 20170907
    },
    {
      "title": "Don’t buy!",
      "text": "I would not recommend this table. The legs are not stable at all, and if you remove the legs then the toy slides all over the floor. The low volume is too low, and the highest volume is way too loud. If you leave the toy on then it drains the battery after just one night. I’m having to return this because the sound keep sticking on one noise. It just repeats “eh, eh, eh” over and over. I expected more out of a Baby Einstein product.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarrae84",
      "helpful_votes": 3,
      "publication_date": 20180609
    },
    {
      "title": "Fun, while it works.  Stopped working way too soon.",
      "text": "It was amazing. Until it stopped working after 1 month. My son LOVED it. It just stopped one day. I changed the batteries. And all it does is make a static sound and die. I tried different batteries. Same thing. Basically it lasted 4 weeks and that was it. Find something more durable from a company that stands by their products and will replace/fix if they cease to function after just a few weeks.",
      "rating": 1.0,
      "verified": true,
      "author": "Texaschikkita",
      "helpful_votes": 4,
      "publication_date": 20180205
    },
    {
      "title": "Great toy, son loves it!",
      "text": "Bought this for my 9 month old son for xmas. Hes still using in the seated position but I can tell he will get plenty of time out of this. He loves banging on it and dancing to the music, it's so adorable. Decent product! I love that it also plays in English, Spanish or French ... a neat feature and segway for babies to learn other languages ; )",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 2,
      "publication_date": 20200115
    },
    {
      "title": "Great toy and walker",
      "text": "Probably my 9-months old favorite toy. 3 language, plenty of different interactions. He loved it without the legs when he was just doing tummy time. Now he is crawling and standing and this is the best walker. It is stable on carpet for him to pull himself up and he pushes it all around the room. We have several walkers but this is the best and safest. He hasn’t tipped over with this at all and walks at his pace unlike walkers with wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnnn",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Not durable..but my son loves it",
      "text": "Honestly my son LOVES this toy but I’m giving it 2 stars because the legs are NOT stable at all even for my 9 month old who’s super sturdy on all his other sit to stand toys. Second I’m giving it 2 starts because we’ve had this a little over a month and there’s something glitching with it. It will either repeat over and over again the same word/sound or it will sound like a scratched CD to the point where we have to turn it off.",
      "rating": 3.0,
      "verified": true,
      "author": "Carmen Barrera-Orozco",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "Stimulating but tips over easily if child can’t stand alone",
      "text": "My nine month old granddaughter loves this activity table. She can reach to the middle objects easily. She loves playing the piano keys which activate built in music. My only issue with the table is it’s sturdiness. It tips very easily when pulls herself up to it. She is just at the point where she wants to pull herself up to any object. We must keep one hand on the table at all times or it will tip over on her. We’re all it is very stimulating and well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "LucyAnns' Treasures",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Excellent ! Love it",
      "text": "We waited so long to get this toy! It's sold so fast and often out of stock! We are so happy about it! Very well wrapped and shipped in double box! Brand new , clean and works perfectly. We did not use It as a table because once you put the legs you won't be able to remove it. We prefer to use the toy on the floor so it is accessible to any age baby. Would definitively recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "mrko",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Good but technical glitch after 5 months of use",
      "text": "3 stars due to sound issues after few months of use. Otherwise the product is good learning wise. This activity table is nice for babies. I bought it when my baby was 4 months old. My baby would still play with it if possible. However, after 5 months the sound started getting stuck once a while when I tried to switch it on. I somehow made it work but switching it on and off. Now it does not start what so ever. Every time I switch it on, the voice is stuck and plays on repeat.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Topples Over",
      "text": "If you want your kid to topple over, buy this. If you want to deal with a hysterical baby then buy this. Not sure if it is because of the tripod or if all activity tables are like this. Never trust product reviews or websites with best product lists to buy for your child. This activity table was on quite a few websites that say this is the best activity table to purchase. I gave this 3 stars instead of 1 because you can remove the legs, so not a complete loss.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabby W",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Waste of time and money.",
      "text": "This toy quickly became my son's favorite toy, but it barely lasted a week before malfunctioning. It's just playing endlessly and switching between songs sporadically as if someone is smashing all the buttons. My son loves this toy, but it is flimsy and apparently can not stand up to the strength of an eight month old. I'm going to try to return it, but that's such a hassle. I don't have a lot of time as a parent and it makes me so angry that I'm going to have to go through the inconvenience of a return with everything else I have to get done this week.",
      "rating": 1.0,
      "verified": true,
      "author": "Shaybe",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "This thing sucks!",
      "text": "Had the product for less then 24 hours and the speaker doesn’t work anymore. It’s either to light or the base isn’t wide enough because my 9 month old son who weighs approximately 20 lbs kept knocking it over and falling on it. Was about to take it away in fear he might tumble over it the wrong way but it didn’t work long enough for me to even make that decision. But thank God it was easy to assemble. Would like to get my $ back but unfortunately I threw the box away because initially it worked. Would not buy or suggest this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Mitchell Weimer",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Great toy, horrible stability",
      "text": "My son loves this toy. He spends a lot of time pressing the buttons and waiting for the accompanying sound. The toy is great, but the legs provide no stability. We take the legs off when he plays with this. I’d suggest the same to you, unless you like the sound of a toy flipping over and the thud of a baby’s head on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Alexander Wall",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "Entertaining and educational",
      "text": "Purchased for grand daughter’s first birthday. Her 2.5 year old brother plays with it as well. As other reviews state, it isn’t very sturdy. Not designed for baby to use to pull up on, but can be used without the legs! It is nice that you can change language and adjust for learning levels.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynnette S",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Terrific buy for music loving kiddos",
      "text": "Talk about easy to assemble! Just pop the three legs on and you’re good to go! This little table does everything! My favorite feature however is that after kiddo has stepped away from it to play with something else for a few minutes, it plays a little diddy on its own as a little reminder that it’s there and he could come back and play more music if he wants! Our boy lovvvvves music and uses this as “background tunes” while playing.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie M.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Love this! There is music and learning",
      "text": "Love this! There is music and learning, piano keys, buttons, a drum, and a spinning ball with beads inside. The sun in the middle lights up. All things that appeal to my baby! You can use it flat or standing with the 3 legs. I actually used it with one leg so it was propped at an angle perfect for playing with while sitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "My 10 month loves it!",
      "text": "Our little 10 month old boy loves this!! He got is for Christmas and it was great because we started it out for him with only one leg so it was on the floor and tilted up. My only complaint is that when standing, because it only has 3 legs, at times it isn't as sturdy as I would like. However, otherwise, this is a great buy. Sounds, music, three different languages, very easy to assemble.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura Dougherty",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Do not use with legs",
      "text": "Using this activity center with the legs does not work for a baby who needs to hold onto something for stability. The table is not sturdy enough to stay standing when a small baby leans on it to play. Lightweight legs with a heavy top is not a good recipe. It has fallen over and hurt my child multiple times. I would only recommend it as a floor toy without the legs. Having bought it to encourage my child to stand and play, I am quite disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "M.A.",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Mmh",
      "text": "Buy this product for my baby, since a friend has it for her son and we love it! The box where they sent him was badly treated, the toy had scrapes on the happy face. We tried to turn it on and did not want to work, we took it out of the box and changed the batteries and did not want to work, I'm a little disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Why are the legs wobbly?",
      "text": "It's a great toy, lots of features to have your infant entertained and it's a fun learning tool. Huge and major con - THE LEGS WOBBLE AND IT SLIDES ON HARDWOOD/SLICK surfaces - not safe for baby / have to add non-slid stickers for furniture or something at the bottom",
      "rating": 4.0,
      "verified": true,
      "author": "kai",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "legs are very flimsy",
      "text": "The top part is easily removed from the legs and my son loves it. However, if you purchased this for a stand up learning toy like I did I would look elsewhere. The legs are very thin light weight plastic that don't keep the toy in place. I have to use this over a rug or carpet to make sure it doesn't tip over and I only use supervised.",
      "rating": 3.0,
      "verified": true,
      "author": "Britney R.",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "The music and lights are fun and entertaining",
      "text": "My daughter lives this toy! The first day after getting it she learned how to pull her self up on it. The music and lights are fun and entertaining. I was a little nervous getting this toy because reading other reviews it said children were getting the their fingers stuck in the flap, however I took my chances and got it anyways and I'm so glad I did. This toy keeps my daughter busy and in the months we have had it we haven't had any issue with her getting her finger stuck.",
      "rating": 5.0,
      "verified": true,
      "author": "Casey C.",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Educational but not Sturdy",
      "text": "It’s a great kids toy, our daughter loves it, and I love how it has the options for English French and Spanish. However, it is NOT safe at all for babies who are learning to pull themselves up. It tips over very easily and only has 3 legs when some other tables have 4. Its great for sitting and playing but I wanted this to be used as a toy my daughter could learn to stand with and it’s not made for that at all. It is a great learning toy and I am satisfied with my purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "... play with this I will have to express my dislike for this product",
      "text": "While my little girl likes to play with this I will have to express my dislike for this product. The platform is very unstable and will tip very easily. The unit is very top heavy and is a great black eye maker. The enjoyment my daughter gets from this is always ended with a nice face plant an many tears. If the legs were more stable, or heavy then this would be a decent product. The top itself is full of great buttons and lights and without the legs on it is SO much safer for babies to play with. I would not buy this again and I would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "David Price",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "Great for babies learning to stand up!",
      "text": "My 7 month old loves it. She likes to push all the buttons and hear and see the lights and music. I always change the setting and keep it on the Spanish setting. It's cool because you can take it apart and put it on the floor or you can put the legs on it and it helps them strengthen their muscles to get ready for walking. I used this same thing for my 10 yr old and now with the new one! Great buy for the $ as well because of all the activities.",
      "rating": 5.0,
      "verified": true,
      "author": "Mommy of Two!",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Unsafe",
      "text": "The colors, buttons, sounds and lights are all great... And it's fantastic for a toy to sit on the floor to play with... However-- it is EXTREMELY unsafe.. The legs are not sturdy at all.. My baby fell over trying to pull himself up on this toy and it fell over right on top of him.. Luckily he wasn't seriously hurt... More scared than anything... But I was highly disappointed in this product.. I purchased it for the sole purpose of my son standing and playing with it.. But after him falling with it twice.. I ended up taking the legs off and buying him a different toy to stand and play with..",
      "rating": 2.0,
      "verified": true,
      "author": "Brittany Brocato",
      "helpful_votes": 2,
      "publication_date": 20140816
    },
    {
      "title": "Worth every penny!",
      "text": "My granddaughter is almost 1, I got this for her when she was 7 months and it’s been a favorite toy, played with multiple times daily. We still haven’t put the legs on it, just using it as a floor toy. Very well made, durable, huge variety of songs, music and sounds, and it can be set to English, French or Spanish with a flick of a switch. She shows no signs of tiring of it at all. This toy is worth every penny, I’m so pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "NAB",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Not stable for babies who learn to stand/walk",
      "text": "It’s a entertaining toy for kids BUT the only think that I don’t like is it’s not stable. I had to put the table on a corner in order to not make my kid slide on the floor. Otherwise it’s a good toy maybe quite expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "celine",
      "helpful_votes": 2,
      "publication_date": 20171112
    },
    {
      "title": "six month lifespan",
      "text": "My kiddo LOVED this toy. She has used it since she was about 3 months old, first as a tummy time activity, and later as a table (which also helped her learn to stand/support herself). She is now 9 months, and I am so disappointed to report that it has stopped working entirely. It started its decline by sputtering a bit before it stopped working entirely. Changed the batteries hoping it was just a weird fluke, but no dice -- still doesn't work. She and I are both very disappointed that this only had a six month lifespan.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Our favorite toy!",
      "text": "This is my son’s absolute favorite toy! Before he started standing, we used this flat on the ground. Not what he’s standing, it’s helping him get balance while he stands and plays the keys. Also great that it has 3 languages that we are currently teaching him. He’s been using this for months and I’m sure he will continue to love it in future! Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Flimsy and smaller than I thought.",
      "text": "Sadly it’s not as big as I thought. That’s on me anyways but what I didn’t like was how flimsy it is. My kid it’s just one year old and he was easily removing the legs by mistake. He would just move the table a bit and legs would just fell off. We had to remove the legs and leave it on the floor. Bad design.",
      "rating": 3.0,
      "verified": true,
      "author": "Rise G.",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Great toy, but stopped working out of the blue",
      "text": "I bought this for my 7-month old daughter a little over a month ago and she was immediately obsessed with it. Plays with it all day, every day. Yesterday, it out-of-the-blue, stopped working. The buttons stopped making music sounds and lighting up. Randomly, the buttons will work but the sounds are in fast-forward and high-pitched (think chipmunk voice). I am so disappointed because she loves this toy so much and we haven't had any problems with Baby Einstein products in the past. I know the batteries do not need replacing because it will sometimes make the fast-forward noises, so I'm hoping they can advise me.",
      "rating": 2.0,
      "verified": true,
      "author": "Liberty Cogen",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "6 month old loves it!",
      "text": "6 month old loves it! Lots of buttons to push whether she is sitting next to it or standing. Keeps the legs off and she sits next to it on the floor and plays with it while working on her balance. Put the legs on and she is learning to hold on while standing and playing. This activity station works on teaching colors and numbers, but at this age we are just happy to see her play and enjoy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris N.",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Great toy",
      "text": "Bought this last year for my daughters 1st birthday. Its easy to assemble and light weight so easy to move around but maybe not to good as support if childs just learning to stand. She loved it and played with it alot, she loved slapping it and making the lights light up and sing. Her fingers never got stuck in any part and now as a 1 almost 2 year old climbs all over it, flips it, and uses it as a step stool/jungle gym lol aka she climbs everything. So its durable its never broke, cracked, nothing. And every piece of it still works. A+ in my books",
      "rating": 5.0,
      "verified": true,
      "author": "AwkwardPenguin",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Cheap piece of crap",
      "text": "Received one for Christmas 2019, it stopped working. Bought a new one and it arrived yesterday. We put new batteries in and it stopped working again. This is a horrible toy, do not buy. Dave yourself the trouble and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Dillon",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Top heavy and flips over",
      "text": "Top heavy and tips over if your toddler tries to use it for support. Other than that we love it but we have to hold onto it all the time when he’s playing with it so it doesn’t knock him down and land on top of him. Needs more weight toward the bottom of the legs.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca L Hamrick",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great Table Top, Poor Leg Support",
      "text": "We bought this music table for our daughter, and she loved playing with it. However, as the table top itself is a fun piece, the supporting legs definitely have design flaws. The shell shape legs are hollow in the center, which works for stacking when in the package. But once assembled, you will notice the exposed edges are still quite sharp, which would leave deep scratch marks on baby's skin. We plan to return it, because we found more scratches on my daughter's finger and legs today.",
      "rating": 2.0,
      "verified": true,
      "author": "Shaoxuan Dong",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "RIP musical table",
      "text": "Bought this for my son when he was six months. He LOVED it right out of the box and played with it on the ground for awhile. I put the legs on after a couple of months, but this is not very heavy or sturdy and I felt more comfortable taking them back off. However, after less than five total months of usage the circuits or something inside the toy broke and it no longer plays. Not a durable toy, unfortunately.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaclyn Joy Smith",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Nice little baby toy",
      "text": "Bought for my son. He loves this little table. Yes the songs are a little repetitive but this is a baby product they like repetition. I also think it has a good variety if you can convince them to pick something other then their favorite color, green so far for my boy. The addition of different options is interesting, but unused by me so far. The batteries are holding up great and the volume is not soul stealingly loud.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Good toy...",
      "text": "I bought his for my granddaughter when she was about 10 months old. Nine months later she still likes it. I only gave it four stars because the legs are flimsy and unstable. I’ve never used them.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great fun",
      "text": "Such fun for 9 month old he enjoys this activity table every day. You do have to be there or it tips when baby is learning to pull up on it to play with it. But so much fun either on floor or on its legs which are easy for me to take off to place toy on floor for baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Absolute horrific legs! They dont come out once installed.",
      "text": "The legs would not come out. And there is a small line in the manual about that. It is a toy do you really think people read line by line on the manual before putting this together when your kid is so excited to start playing with the toy? Now this toy is going to the garbage because i cant have my daughter use it. What a horror show! and customer care team just wasted my time telling me the same thing on the phone so why ask to call them? I gave it two stars because it is a nice toy with good learning things but come on should the legs be like that?",
      "rating": 2.0,
      "verified": true,
      "author": "Shailender",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Don't buy it. If your child will press more than one button",
      "text": "The table started playing music at hyper speed and is completely dysfunctional after maybe 5 uses. I had it set up at an angle on the floor. My son doesn't have the concept of pushing one button at a time...well suddenly the thing goes crazy. I like the different language options and music. I dont think I'll waste my money on this item again.",
      "rating": 1.0,
      "verified": true,
      "author": "Diana wilson",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Pass on this.",
      "text": "This thing is not sturdy. My baby likes it but I have to keep my foot on it to help her stand up. Really poor design and cheaply made.",
      "rating": 1.0,
      "verified": true,
      "author": "Lacey",
      "helpful_votes": 3,
      "publication_date": 20170613
    },
    {
      "title": "Baby can topple this",
      "text": "Baby likes playing with it and keeps her entertained. She is 8 months. The only complaint I have is that she likes to try to pull herself up on this table but the legs are not strong enough, so she ends up turning it over. I have to keep my hand on top of it she that she doesn't do this.",
      "rating": 4.0,
      "verified": true,
      "author": "Nime",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Happy Times",
      "text": "Grandbaby loves this activity center. Lots of music, lots of interaction buttons. Easy access for a baby that is just beginning to pull up in a standing position.",
      "rating": 5.0,
      "verified": true,
      "author": "Marjorie Alcorn",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "good entertainment",
      "text": "This toy is great to have just as your baby is learning how to pull themselves up. Actually, the legs come off so technically your crawler could use it. My daughter has been walking for about 7 months now and still plays with it at times. Of course now she just likes to push it across the room, but still!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Fleischhauer",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Read Review",
      "text": "With the legs on it is very top heavy and easily tips. Legs not easily snapped into secure position. Only recommended to use with legs if your little one can already walk around while holding onto things. Main toy itself is great and our little one loves it.",
      "rating": 3.0,
      "verified": true,
      "author": "Brittney Edwards",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Would gift",
      "text": "Easy to put together. My daughter loves it. I wish it had a quieter setting. It has medium and loud. It’s in 3 languages as well. I like that it can be used for laying or sitting or standing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Works too much like a slot machine.",
      "text": "Works too much like a slot machine. The table has two modes music and discovery (learning mode). Unfortunately they are both music mode so our baby would click on a number or color and it would start playing music right away preventing our child to learn anything because of all the racket and lights. I think this is more of a babysitter and less of a learning tool. :)",
      "rating": 2.0,
      "verified": true,
      "author": "GordonShumway",
      "helpful_votes": 0,
      "publication_date": 20160402
    },
    {
      "title": "Lightweight",
      "text": "Love this activity table so much! The only downside is my daughter can push it around the room. She has even tried to use it to climb onto other things! I’m always watching her though so no worries. It was also a great toy to bring with us while we were camping. The legs come off so it is very portable!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Granddaughter pulls herself up and pushes the buttons for music fun. She just turned 1",
      "text": "Cute, promotes music and learning. Granddaughter pulls herself up and pushes the buttons for music fun. She just turned 1, so the learning component will come when she is a little older. She has fun, dances, and spends a lot of time playing with this music table.",
      "rating": 5.0,
      "verified": true,
      "author": "LeaC",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Another 5 star product",
      "text": "Seems the entire line of Baby Einstein toys are well made, very durable and gets are enthralled by them. 5 stars which means, for me, it’s gotta be perfect, and it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Pro Makeup Artist4Life",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "She loves it",
      "text": "My now 8 month old daughter loves this toy she uses it as a walk. The only thing that might be a problem is around the sun is a thing that flips back and forth to change music to abc that she keeps squishing her finger in.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth ",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Best toy you can buy",
      "text": "This is well worth the price. My daughter loves playing with it and making the music play. This is her favorite gift she got for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Excellent!",
      "text": "Hours of play time! Makes a bit o’ noise but... but she loves it. It’s helped her gain strength to stand and walk as an unintended benefit! If I have additional grandchildren, this will undoubtedly be a repeat purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Granddaughter loves the music",
      "text": "I wish the legs were more stable. That being said, my granddaughter loves this toy. It is a toy she can play with her big brother so it’s a win win!",
      "rating": 5.0,
      "verified": true,
      "author": "Dorene P. Bassett",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Caution, legs dont come off once they are on :-(",
      "text": "My son loves it. I put the legs on to see how high it stood but then couldn't get them off to use on the floor. I wish I had known this before putting the legs on or I would never have put them on! It's too tall now and we are missing out on lots of fun. Would be 5 star review if I had know this before I put legs on or it they came off. Will update",
      "rating": 3.0,
      "verified": true,
      "author": "BoyMomx3",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "Kept it anyways",
      "text": "One of the button did not work when it was delivered. There was No way to repackage the toy to send back for an exchange or refund.",
      "rating": 3.0,
      "verified": true,
      "author": "Silvia D",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "A good learning toy !",
      "text": "My kid loves it. He started standing up and this was the perfect item for him. It slides when we keep on wood/laminate floor. Could have added some rubber to the legs. We keep it on a rug so it doesn’t slide.",
      "rating": 4.0,
      "verified": true,
      "author": "UBA",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "6 month baby LOVES it!",
      "text": "My grandson plays with it on the floor when the legs are removed however when the legs are on it he enjoys standing at it with assistance. We're looking forward to keeping the legs on all the time as he is able to stand on his own. The high and low volume settings are also very nice. Quality is very good - great item for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "kwm1970",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Had to return",
      "text": "Broke internally somehow quickly with mild use by an infant on the floor flat at all times, something glitched. It would get stuck on one word and rapidly repeat it and would not stop until manually restarting it, then shortly after it'd do it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Awesome!",
      "text": "My 7 month old loves this! He is a big fan of music and has really enjoyed playing with this! Definitely worth the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Leighann Preston",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Great for the price",
      "text": "My 10 month old granddaughter absolutely loves it. It's sturdy enough for her to pull herself up on carpet, but I wouldn't use this on hardwood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "CiCi",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Great for baby",
      "text": "This was a Christmas gift for my 8 month old daughter. She is unable to stand or pull herself up yet but so far after only playing with this twice she was able to stand and hold on to the toy. Also, there are 3 settings in English, Spanish, and French so the children can even learn the a couple numbers and other words in different languages. I thought that was super neat!",
      "rating": 5.0,
      "verified": true,
      "author": "gina kocheff",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "The Perfect Toy for a Toddler",
      "text": "My 18-month-old grandson couldn't stop playing with it as soon as we got it out of the box. I also have to say that it came WITH batteries! That's something you almost never see these days. This made it very convenient and we didn't have to worry about forgetting them on Christmas morning. The toy is bright and colorful with lots of action, music and lights. It kept his rapt attention for over an hour which is unheard of in a little one. I'm so glad I bought it for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Mountain Sprite",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Perfect musical toy for my 12 month old",
      "text": "Bought this for my 12 month old son who loves music. He plays with it constantly and can never get enough of the different sounds, colors, and lights. We even used it to teach him how to pull up on things to stand up. My son absolutely LOVES this toy. We recently went on a road trip and took this toy with us for him to play in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer G. Green",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "It has so many elements which are good for coordination and dexterity and she loves the music",
      "text": "My little 10 month old granddaughter is enchanted with this toy. She plays with it for nearly an hour. It has so many elements which are good for coordination and dexterity and she loves the music. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Earthy",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "CAME BROKEN",
      "text": "Straight from the Amazon warehouse and it came with no sound. Shame. It caused me inconvenience. Oh, and the customer's services from Baby Einstein is non-existent.",
      "rating": 1.0,
      "verified": true,
      "author": "SharShar",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Baby loves it!",
      "text": "Got this for our baby when she was 4 months old. She couldn't do much with it yet but watch the colorful lights, but she's 9 months now and still loves it! It can definitely fall over while baby is leaning on it, so we have it pinned between a couch and chair in the living room. And the music and sounds are not annoying at all like most noisy baby toys! Highly, highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Little to gain",
      "text": "It’s just WAY too busy and over stimulating. Push one button, and everything lights up. It’s difficult for the child to understand what buttons cause what action. I found little to gain from this, other than an overstimulated and frustrated child.",
      "rating": 2.0,
      "verified": true,
      "author": "MW",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Sturdy product. I would definitely recommend this and even ...",
      "text": "Bought this for my nephew and he absolutely loves it! hes been playing with it starting at 6 months old. Sturdy product. I would definitely recommend this and even purchase for other kids in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Townsend",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Super cute",
      "text": "My baby boy loves this. It plays great songs and keeps him busy. Just b careful wit it on hard wood floor because it does slide",
      "rating": 5.0,
      "verified": true,
      "author": "Raejoe",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Perfect gift",
      "text": "Bought this for my son's first birthday and he loves it so much. He's played with it so much over the last 6 months and loves to hit the buttons and dance to the music.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Johnson",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Lovely music!",
      "text": "This is a great toy that my baby never got bored of. Baby loves it and plays with it everyday. The music is lovely. It has English, Spanish, and French language settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Good activity table",
      "text": "Got this for my 9 month old grandson for Christmas. He likes to play with it when he comes over for a visit. It doesn't hold his attention very long but he still likes it.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlynn Robertson",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "We love this table",
      "text": "We love this table! It has a music only option and then a \"learning\" option. The music is classical which is a VERY NICE change from the ridiculous and annoying music most other baby toys have. It is a little smaller than some of the other tables we've seen, but not enough to deter me from buying. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "bookwormie",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Love this product!",
      "text": "Such a great product for kids. My nieces and nephews love this table, used it when they were just starting to pull themselves up, loved all of the lights and noises. I love that it can be used before kids can stand too, can take the table legs off and just use the top of it with the lights and sounds. Definitely would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20151230
    },
    {
      "title": "Sparks creativity and will keep their attention",
      "text": "This is a wonderful toy for children who are just learning to stand alone. My grand daughter is able to pull up on it and it is very stable because of the construction and placing of the legs. She is kept entertained for long periods of time because of all the different activities there are on this activity table. The sound is just the right volume to entertain her without annoying me. I recommend the Baby Einstein Discovering Music Activity Table to anyone who has a child or grand child they want to spark creativity in.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Williams",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "Now my baby is a month older and gets up on it just fine and leans all over it and it seems sturdy",
      "text": "My 9 month old really likes this table, however when he was learning to stand the table was a bit wobbly when he would pull himself up, I'm not sure if something with 4 legs would have kept it from toppling over. Now my baby is a month older and gets up on it just fine and leans all over it and it seems sturdy. For younger babies it is nice b/c the legs come off and they can play with it on the floor. I also like there are no pieces to break off.",
      "rating": 4.0,
      "verified": true,
      "author": "kt346888",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Legs do NOT come off, once attached.",
      "text": "Overall, a great product, but I'm extremely disappointed that once the legs are attached they can NOT be removed. My 7 month old enjoyed playing with it in the floor. Now we've attached the legs so she can stand and play. We plan on having more children, and they won't be able to play with this toy now until they're old enough to stand. I'm extremely bummed.",
      "rating": 3.0,
      "verified": true,
      "author": "sar0932",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Perfect toy stand for infants that are just standing and young toddlers.",
      "text": "Perfect toy stand for infants that are just standing and young toddlers. Very educational and stimulating.",
      "rating": 5.0,
      "verified": true,
      "author": "Fletcher Coffman",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Wore out way too fast.",
      "text": "We have had this for a little over a month and it is already broken. Very disappointing because my baby loves it. About 2 weeks ago one of the buttons stopped working (wouldn't move, like it was jammed) and now it is not working at all - tried new batteries, and switching it on and off. We are new parents so we aren't sure of the general \"shelf life\" of kid toys, but a month and a half is pretty pathetic.",
      "rating": 2.0,
      "verified": true,
      "author": "Ellie Petrichevich",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great fun",
      "text": "I think my husband plays with it more than my kids. But they all love it, especially french mode",
      "rating": 4.0,
      "verified": true,
      "author": "Kc Creed",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Flimsy legs",
      "text": "The legs just kept popping off. Which for standing babies leaning on them is not good.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Not Durable",
      "text": "This product does not hold up. We have only had it for a few months and it no longer turns on even with new batteries. It does not withstand baby drool. My son barely drooled on the keys and it sounded like it had a short; high pitch, sped up sound. My son loved playing it while it worked. I just wish it would have lasted longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Miller",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Good buy",
      "text": "My son loves this table he pushes it around the house. The legs could be a little more sturdy,but overall it is still a great buy. Love the music it has 3 language options.",
      "rating": 4.0,
      "verified": true,
      "author": "Sports mom",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Slides when any weight is applied",
      "text": "Great sensory toys but the table is so light that it becomes a walker for infants. An infant cannot pull up on it or put any weight on it without it sliding.",
      "rating": 2.0,
      "verified": true,
      "author": "CaS",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "It's okay",
      "text": "The legs are made of thinner plastic. Doesn't seem too sturdy. Slides on hardwood floors. The buttons itself are fun for my infant, but I have to hold it or it'll slide on him when he leans on it",
      "rating": 3.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Easily tips over",
      "text": "I love this toy! Easy to snap the legs on and off, and easy for the baby to use! Only problem is it's top heavy, so when my 7mo old tries to use it to pull himself up and falls on him! I just make sure I'm sitting with him the whole time he plays with it",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "The music and different features are wonderful and it does not drive me crazy to listen ...",
      "text": "My so absolutely loves this. It has helped him learn how to keep his balance while helping him with interaction skills. The music and different features are wonderful and it does not drive me crazy to listen to! Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Awesome toy!",
      "text": "My niece is obsessed with this. Smaller than expected but great size for babies Learning to pull themselves up on stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessi S",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Fun!!!",
      "text": "Love it! My two year old keeps flipping it over and pulling off the legs but it's fun anyways. Boys will be boys. He also now knows where the cat is and knows how to get it to make the sounds he wants. Learning colors as well",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Love this! The volume is not too loud",
      "text": "Love this! The volume is not too loud. This is truly the perfect size for a small area. It's lightweight as well. Great opportunity to promote sharing. Super easy to snap the legs into place.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Fritz",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "I love this for my daughter",
      "text": "I love this for my daughter! She loves it too, certainly helps them learn to stand and play! I love the duel ways of playing. ( Standing table position or sitting floor position) Highly recommend this activity table!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly White",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Nice lights, sound doesnt work!!",
      "text": "There are serious issue with the sound on this product. I received it and assembled it in very little time. I changed out the batteries as soon as I took it out of the box and in less then 5 minutes this item no longer plays any sound! It only lights up. So it would make no difference if this thing had 50 languages to choose from, it would still make no noise. This thing us garbage!! We will Never buying baby einstein toys again!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Must have !",
      "text": "This is a total must ! It’s always been my sons favorite . He’s up and waking, to y’all to just stand at it but still loves playing with it !",
      "rating": 5.0,
      "verified": true,
      "author": "Olivia Long",
      "helpful_votes": 0,
      "publication_date": 20181212
    }
  ],
  "product_meta": {
    "title": "Baby Einstein Discovering Music Activity Table",
    "description": "Babies are naturally drawn to music, and the Baby Einstein Discovering Music Activity Table will have your little one coming back for encore after encore. Introduce your child to a world of creativity with an activity center that helps them discover and make music. Babies can tap the piano keys to hear musical notes, and with the switch of a button the piano keys will introduce colors and numbers. The strummable guitar, tappable drum, and spinnable French horn ensure your little composer will have a blast exploring baby instruments. At the center of the table, a music book is ready for your baby to flip the page and activate melodies, lights and discovery modes. The music development table grows with your baby – it’s great for floor play without the legs for younger babies or attach the legs for stand and play discovery. Wipe clean with damp cloth and mild soap. Do not immerse in water",
    "rating": 4.6,
    "feature_bullets": [
      "Empowers baby to make their own magical music",
      "Features piano, drum, guitar and French horn",
      "Piano keys teach numbers and colors",
      "Switch between 3 languages (English, Spanish, French)",
      "Suitable for children from 6 to 36 months"
    ],
    "specifications": {
      "Product Dimensions": "6.1 x 2.17 x 8.82 inches",
      "Item model number": "90592",
      "Batteries": "3 AAA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Batteries required": "Yes",
      "Battery life": "51.07 Hours",
      "Dishwasher safe": "No",
      "Is portable": "No",
      "Item Weight": "4.88 pounds",
      "ASIN": "B005P5D7G4",
      "Customer Reviews": "4.6 out of 5 stars1,506 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#8,510 in Toys & Games"
    },
    "categories": [
      "Baby",
      "Toys & Games",
      "Musical Toys",
      "Baby & Toddler Toys"
    ],
    "price": 34.99
  }
}