{
  "website_summaries": [
    {
      "verdict": "Inflates easily, holds up to three people, and is built with added safety features.",
      "pros": [
        "Keeps water at bay",
        "Maximum weight of 410 pounds",
        "Transports easily and can be compacted to fit in 29-inch spaces, including backpacks",
        "We love the side rings that help with balance and also controlling the oars"
      ],
      "cons": [
        "Material is not designed for shallow water or abrasive terrain"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "How to Escape the Wife 101",
      "text": "I never thought it would be this easy and cheap to escape my wife, but this truly is the ultimate wife escaper. Don't believe me, try it yourself. Just blow up, row and wallah... it's that easy. Don't do what I did the first time and let her join. I haven't seen my wife in ages. I rowed across Lake Erie and life has been incredible ever since.",
      "rating": 5.0,
      "verified": true,
      "author": "Ceriously",
      "helpful_votes": 338,
      "publication_date": 20180903
    },
    {
      "title": "Fun was had by all",
      "text": "This raft worked fantastically for riding out of the back of an airplane at 13,500ft. Fun was had by all!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Stocker",
      "helpful_votes": 892,
      "publication_date": 20160422
    },
    {
      "title": "An incredible vessel",
      "text": "The Explorer 200 demonstrates superior performance as an inflatable watercraft far beyond the walls of the suburban above ground pool for which it was designed. This so called 'toy' valiantly charged through the choppy waters of Lake Powell, effortlessly deflecting plates of ice with its seemingly impenetrable rubber hull as I explored a vast network of narrow sandstone canyons. Some may call it the 'poor man's packraft', but I strongly disagree, as any man fortunate enough to call an Explorer 200 his own is a rich man indeed.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Brandon",
      "helpful_votes": 434,
      "publication_date": 20161125
    },
    {
      "title": "Lake Michigan!",
      "text": "We were researching kayak rentals when planning for a vacation to Saugatuck, MI. One of these Explorer 200's cost less than renting a kayak or canoe. We bought four of them for about 85 bucks and used them on Lake Michigan daily for a week. They handled well, even in choppy water. Each one comes with a hand pump that works well for its size. They earned my five star rating!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Samuels",
      "helpful_votes": 182,
      "publication_date": 20150728
    },
    {
      "title": "Worked great as a \"trailer\" on kayak camping trip!",
      "text": "Used this as a \"trailer\" for a kayak camping trip. We fit 3 coolers and a 5 gallon bucket in. I had read reviews about the front piece popping out when towing it, so I ran the tow ropes from the oar locks through the front piece then reinforced with duct tape. Had it inflated for 4 days, with temperatures ranging from 80-40 and while it lost a little air I did not need to reinflate it at all. It worked perfect and will be used on many more river trips!",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda A.",
      "helpful_votes": 55,
      "publication_date": 20170906
    },
    {
      "title": "We gave people a good laugh at the lake. This is for kids or one adult",
      "text": "3 person? right!!!.. I am 5'2 and my friend is 5'10. We got in (325 pounds combined) and we almost sunk in the lake LMFAO.. we gave people a good laugh.. not even room for a small duffel cooler or our fishing gear. Rowing with both in? forget it! I almost pissed myself laughing... bahahahahaha just awful this is ok for kids in my opinion or one adult",
      "rating": 1.0,
      "verified": true,
      "author": "tinyprincess",
      "helpful_votes": 45,
      "publication_date": 20170828
    },
    {
      "title": "Nice for dogs",
      "text": "Do you have a dog that wants to play in the pool, but either doesn't want to get wet or you don't want them wet? This works well. I have two small labradoodles -- 60 pounds together -- that float around in this. I got the 200 in case a human wanted to join them. It has been used several times and no punctures, so I got a second one to use elsewhere. This was only $12 when a dog float where they would get wet was over $50! I should note, though, that my dogs are groomed monthly and have their nails trimmed and ground. One is 24 pounds and the other is 34.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Waddell",
      "helpful_votes": 55,
      "publication_date": 20160814
    },
    {
      "title": "Love it",
      "text": "Bought this for my 6 year old... omg we love it. Says it holds up to 210lbs.. we went over that some haha but it still held us well! Great buy and fast shipping. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 23,
      "publication_date": 20180524
    },
    {
      "title": "More Uses For This Then You Think.",
      "text": "I had purchased this product for a completely different reason than its intended purpose. On a remote camping trip, we needed some extra cargo space to kayak some essentials to the campsite. All of our supplies could not fit in our kayaks (i.e. coolers) so I needed a way to transport them across the lake. This raft did the job perfectly and will be using it again for the same purpose. After using it for that purpose, I've even decided to possibly use it for its intended purpose also. It held 2 coolers just fine, so I am sure it will work with me also.",
      "rating": 5.0,
      "verified": true,
      "author": "Gadde15",
      "helpful_votes": 15,
      "publication_date": 20180907
    },
    {
      "title": "I have taken this across many littler bodies of water and it works great. Often get looks from other people on their ...",
      "text": "For the money you pay for this it isn't going to sale you across any oceans. However, I have taken this across many littler bodies of water and it works great. Often get looks from other people on their motorized boats but this sucker works great. Not really sized for 2 people, but for one it works perfectly. Oars are kind of weak so you have to tweek a few things",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20170129
    },
    {
      "title": "Summer Fun for Lake Life",
      "text": "My boys absolutely had a ball with the Explorer 300. We bought this just before heading up to Grand Traverse Bay in Traverse City, MI. It has been used all week. Once the sun hits it and it's used the first day we needed to add air to it due to breaking it in. The oars are soild. My two boys 10 and 8 fit in it taking their mom along for a cruise on the lakeshore.",
      "rating": 5.0,
      "verified": true,
      "author": "Hi-Def Dude",
      "helpful_votes": 17,
      "publication_date": 20170816
    },
    {
      "title": "Epic Fail",
      "text": "Bought this as a gift and they hate it. Only fits two people and bends in the middle no matter how full of air it is. They had to swim back to shore when this thing would not hold two people that weight 128 and 117. They did not use in a timely manor or I would have returned it.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 14,
      "publication_date": 20171031
    },
    {
      "title": "Perfect little raft",
      "text": "We bought this raft for our visit to Schoodic Lake in Maine. It’s a bit small for two people (unless you are putting two kids or very small/thin people in it). However, for one person it easily fits up to 280lbs. My husband used it and he fit just fine. Given the way the boat is structured, it makes sense to sit in the bigger end. It is much more comfortable and easier to maneuver this way. Once fully inflated it is sturdy and comfortable. The paddles it comes with are a little cheesy, but they do the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Bosch Tanguy",
      "helpful_votes": 8,
      "publication_date": 20180812
    },
    {
      "title": "Use it before the replacement window.",
      "text": "We gave this boat to our children for Easter in April. Living in Michigan, they were not able to use in until last week. They floated in it for a bit last Tuesday and then again on Saturday. Unfortunately, the top & sides separated along the seam. Our children weigh much less than the maximum weight & did not play roughly in it. When I contacted the seller for replacement, they immediately said it was outside the 60 day window. Guess I should have made my kids use it in the cold & rain this spring. =(",
      "rating": 1.0,
      "verified": true,
      "author": "Kathryn Morey",
      "helpful_votes": 6,
      "publication_date": 20190708
    },
    {
      "title": "Yes I know you should read the fine print but when you see a photo of the ...",
      "text": "All the comments about the boat is straight on. However, the photos are really miss leading. There are no oars included with the purchase. Yes I know you should read the fine print but when you see a photo of the boat and oars your assumption is that they are included. They are not.",
      "rating": 5.0,
      "verified": true,
      "author": "Robbie Griffin",
      "helpful_votes": 27,
      "publication_date": 20170611
    },
    {
      "title": "Get the pro version...",
      "text": "Beware that this is much much different than the pro version. It says it holds 2 people which I can't imagine as it is too small for even one person. It is cheaply made and doesn't seem like it would last. Spend the extra and get the pro version. It has held up fairly well and is much better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 15,
      "publication_date": 20170102
    },
    {
      "title": "Missing items",
      "text": "The ad clearly states the boat comes with a mini pump and French oars. All that arrived was the boat and nothing else. I cannot seem to find the contact seller button or problems with order and missing items. I would just like to receive the rest of the order because I am sure the boat is fine and the ad definitely shows and says it should come with the extra items.",
      "rating": 1.0,
      "verified": true,
      "author": "brookep78",
      "helpful_votes": 6,
      "publication_date": 20190327
    },
    {
      "title": "Pup loves it!",
      "text": "I bought this inflatable boat 3 weeks ago for my 10 pound puppy to float in the pool without getting wet. She loves it, gets excited and steps off the concrete into her little boat all by herself! The grandkids have played with it also, and it is still holding up well. I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 6,
      "publication_date": 20190826
    },
    {
      "title": "Tom Hanks wishes he’d had one of these in castaway.",
      "text": "I used to hunt mutant frogs in the strawberry field retention ponds near my house when I was a kid. We would shine at night to see their eyes, offer them a well-placed gift from a 10/22, and then we would send my brother on a tethered “little explorer” to retrieve the dispatched tango. These rafts are indestructible (until you tow it behind an ATV on land during hurricane charlie). While I still love frog legs, I just purchased two of these to float around the pool with my kiddo.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonPrimate",
      "helpful_votes": 3,
      "publication_date": 20190520
    },
    {
      "title": "No paddles or air pump",
      "text": "Didn't come with air pump or the paddles. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron Parker",
      "helpful_votes": 9,
      "publication_date": 20180614
    },
    {
      "title": "A good reading spit",
      "text": "Bought this to be a \"reading radt\" in my camping themed classroom. The only way to get in is with a book so it has encouraged kids to at least look at pages if nothing else. Has held up well so far, about a month. Well worth the $$.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy in SC",
      "helpful_votes": 9,
      "publication_date": 20170904
    },
    {
      "title": "This is a fantastic little boat",
      "text": "This is a fantastic little boat, more than i expected. I bought it for grand kids when they come to swim in our pool, and yes you can take it on a lake if you wanted to but only in swimming area, not designed or big enough for true boating. Its designed for small children 5 and under to have a blast. Oh and they also take a bath in it afterwards that's even more of a blast for them. So if this is your intent (for kids to have a lot of fun) then definitely get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Manuel Reyna",
      "helpful_votes": 14,
      "publication_date": 20150829
    },
    {
      "title": "Versatile!",
      "text": "We have had this boat for 2 years now and love it! It is great for keeping small kids occupied during outdoor activities. My 2 and 4 year old can both fit in it at the same time easily. We have tied this boat to a kayak to pull the kids around, filled it with water to make a mini pool, used it to transport (float) items from our motor boat to the beach, etc. You can easily tie a rope to the front of the boat so that you can keep it near you when you are in the water, or just tie it up to the side of the dock or boat. We love it!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "False advertising!!",
      "text": "This only came with the boat. No oars or pump included.",
      "rating": 1.0,
      "verified": true,
      "author": "Trishcabob",
      "helpful_votes": 8,
      "publication_date": 20180509
    },
    {
      "title": "Great fun at the beach!",
      "text": "This is our second boat of this brand and model. The first lasted 3 years of multiple beach trips with our two daughters, friends' children, and several nieces and nephews. It is a GREAT value for the price! It's been used as a kiddie pool on the sand, a nap area for the toddlers in the shade on the beach, and taken the kiddos out on the waves countless times. The little rope included is perfect to tie to the front and lead them through the water. We even bought oars for it, and our oldest now takes it out past the wave break point to float and paddle around.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca R. Adams",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Fun for all ages and sizes.",
      "text": "Got 3 of these for a company camping trip to a nearby lake. This survived 2 days of 16 people taking turns using them... ranging from kids under 100lbs bouncing all over them to adults that range up to 300lbs. It was hot... Layed them on the ground at camp... Only problem was one of the crazy kids was able to loose one of the rubber ore stoppers.",
      "rating": 5.0,
      "verified": true,
      "author": "GrizzyBear",
      "helpful_votes": 4,
      "publication_date": 20180729
    },
    {
      "title": "The absolute best pool toy I've ever bought!",
      "text": "I bought this for my sons (10, 15, and 17) to use as a pool toy. Other pool floats we've bought typically cost twice as much and pop within a week but not this one! My boys like to drag each other around the pool in this and dump each other out and steal it. It lasted through all that abuse the whole summer long and it still holds air. As far a size goes, my husband fits and he's over 6 ft tall and close to 200lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Maline",
      "helpful_votes": 11,
      "publication_date": 20151231
    },
    {
      "title": "Doesn't last long if left outside",
      "text": "These are really disposable. They lasted over the summer season and we left them out and by the end of fall they were faded and sappy and had to be thrown out. If you're looking for something that's going to last you a long time, this isn't it. Also you need an inflater blower thinga ma jiggy and it still takes a bit to blow it up. It's fun and I guess worth the price, but a bummer that it won't last long.",
      "rating": 2.0,
      "verified": true,
      "author": "NJD & DMD",
      "helpful_votes": 2,
      "publication_date": 20190510
    },
    {
      "title": "Good for one, if you're not in a hurry",
      "text": "Bought the 200. This is a good priced little raft, but you're not going to get anywhere very fast. There is no finn on the bottom, so if it's even slightly breezy, then you are at the mercy of the wind. This says it fits two people but it does not, it's an inner tube with a bottom. Even my preteen girls cannot fit in it together. But if you need something cheap to just get out on the water, this is a good boat for you!",
      "rating": 3.0,
      "verified": true,
      "author": "JEM",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Fun for the price (we paid $38) good for a couple of uses.",
      "text": "We only paid $38. To be fair, these were to replace an inflatable kayak that got ripped. If these were the first purchase my kids would have been fine with them but after the big, maneuverable kayak, these paled in comparison. Oars were flimsy, (one ended up with a leak by the oar lock) and you sit very low so it’s hard to get enough power to row. After using the aluminum paddle and the inflatable seats from the kayak, these were more fun. Used them to float 4 miles down a slow, shallow river and they worked great. Roomy for one person, cozy for two adults, could fit 3 kids.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucky Fin",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Love it!",
      "text": "My husband and I have been wanting one of these boats for a very long time, once we got it we went straight to the lake and tested it out. Everything about this little boat is great. Hes about 6 foot and I'm 5'7, we both fit inside very comfortably with our 1 year old son in it too! It's very thick and durable and hold very easy to pump up. It takes about 5 minutes to blow up with the pump that comes with it! We can't wait to use this more often!",
      "rating": 5.0,
      "verified": true,
      "author": "SANTIILC",
      "helpful_votes": 5,
      "publication_date": 20170811
    },
    {
      "title": "Dont expect much out of this boat",
      "text": "Bought this boat to float a tame river. Since it isnt something I do often I didnt want to break the bank. This boat feels like its made from the cheapest materials and will pop at any moment. Survived the river and made the trip feel like I might die so it had a sweet adrenaline factor. If you are cheap and not afraid of possible drowning this is your boat. 4/5 simply because I got exactly what I paid for.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharks93",
      "helpful_votes": 2,
      "publication_date": 20190305
    },
    {
      "title": "Need to buy a real kayak...",
      "text": "This was my 'cheap' option instead of getting a kayak or an inflatable kayak...but it just didn't work out for me. It's a bit hard to row as the sides are very high and there is no tracking at all (very easy to go in circles). It is very good construction and I'm sure is a good option for people who just want to play around in waves or use it to get out to their yacht or whatever. I used it once and then just re-sold it. Comes with a nice pump as well.",
      "rating": 3.0,
      "verified": true,
      "author": "FBeart",
      "helpful_votes": 4,
      "publication_date": 20170919
    },
    {
      "title": "Best purchase- great price, durable, and endless fun!!",
      "text": "This is the best purchase we have made during this COVID-19 lockdown. We have two girls ages 6 and 3. They spend hours playing with this boat every single day. I’m tempted to buy an extra one to have when this one eventually gets destroyed by the Arizona sun. I’ve had at least 6 of my friends purchase this product since we got ours and everyone has loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cortney Arnold",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Pkg did not have oars/pump",
      "text": "Product description stated boat, oars, patch & pump. 1st order arrived with just the boat. Sent back requesting replacement with promised oars/pump. Arrived 2nd time without oars/pump. I am sending back again requesting money back. Very dissapointed as the reviews for the boat were good; however, deceptive advertising.",
      "rating": 1.0,
      "verified": true,
      "author": "Ginger",
      "helpful_votes": 3,
      "publication_date": 20190227
    },
    {
      "title": "Sturdy and Stable",
      "text": "This boat is for above-ground swimming pool use. I got in it from the ladder easily and stretched out to the end, while sitting. I am 5' 5\" and 110 lbs. If legs are folded, one more smaller person could fit without trouble. It paddles easily in the water, with arms & hands. It's very comfortable and sturdy, if inflated properly. I used an air compressor to do it quickly. The vinyl material is thicker with sturdy seams. I hope to use it for my grandchildren, who need to adjust to the cold swimming pool water gradually...from The Boat!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Shaffer",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Easy to inflate, hold 3 grow adults.",
      "text": "Cute little thick rubber blow up raft. Says it will hold up to 300 pounds, but I had my self, nephew and mother in 1 and that combined weight was closer to 475 pounds. Rowed across a lake that had boat traffic. No worries of tipping and it held up very nicely. Only issue is that the oars are a thin plastic that easily bends if you are an excitable rower. Also doubles as an air mattress in a pinch!!",
      "rating": 4.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 6,
      "publication_date": 20171129
    },
    {
      "title": "not perfect but OK",
      "text": "We bought this to go to the lake for the three of us. However, it is not large enough for two adults and a 9 year old. It does take a while to blow up and we purchased a bellows type inflation device which did help. Our 9 year old can handle it by himself so that was good and it was fun when one adult and our 9 year old were in it together but was too crowded when we added the second adult. It was difficult to row when there were three people in the boat. Overall not too bad when used by one or two people.",
      "rating": 3.0,
      "verified": true,
      "author": "kdr",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "small Single person",
      "text": "It was easy to inflate and its possible I missed the weight specifications but the 100 is for single person up to 120 pounds max. I would say even less my son is only 113 and its maxed out on the performance due to the weight. he is 5'5 in height and also must keep his legs bent. I have no complaints its just for a small single person. I ordered the 200 waiting for that one to arrive. I have only tried this in the pool, as for my son just wanted it to play not sure how good it would fair in other water.",
      "rating": 5.0,
      "verified": true,
      "author": "nancy",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "A hole in its seam less than a week",
      "text": "My kids used it in the pool, not that rough and it gets a hole in it on the seam, so you can't fix it. I got it for them a gift before summer so now we can't report it because it is over the 30 days. Wrote to company and no reply. Terrible, I know they sell a lot of these rafts. I got a bad one I guess but customer service is not being nice.",
      "rating": 1.0,
      "verified": true,
      "author": "Al F.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Almost a great product....",
      "text": "The price is right, but...My son weighs only 100 pounds, yet when he's sitting in this raft, it bows a bit....I can't imagine trying to put 2 people in and asking it to stay afloat. The vinyl is pretty thick, and it's endured several lakes with rocky shores, but I wish the vinyl were a bit thicker. As for the great little oar locks....nothing fits in them. We can't find a paddle that can fit inside the holes, so they're pointless.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian & Sue",
      "helpful_votes": 2,
      "publication_date": 20180827
    },
    {
      "title": "Perfect For the Price",
      "text": "Great value...my son loves to use it in our pool. He's 8 y.o., 4'10\" and 100 lbs.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Jacquet",
      "helpful_votes": 9,
      "publication_date": 20170526
    },
    {
      "title": "Do not buy it leaks air around the seams",
      "text": "This product has been used only in my inground pool. I have only had the raft for a week have we gave it to our 7 year old grandson for a early birthday present on the 4th of July. Sence then I have had to blow up this raft every day. It appears that the raft is leaking around the seams that can't be fixed. I aired the raft as the directions said in fact I have put in a little less air, because let's face it how much air does it take for a 7 year old. This raft couldn't hold the air it takes to hold up 250lbs. That the directions say it should.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Duffie",
      "helpful_votes": 4,
      "publication_date": 20180707
    },
    {
      "title": "Nice little raft",
      "text": "My dog doesn’t like to be left out and she’s not the best swimmer, so I purchased this raft for my dog. The product is much bigger than I anticipated for the price and the material seems solid. If I get one season from this float, I’ll be happy. But I seem to think it’s going to last a little longer. Of course this is for pool and flat water only. This isn’t meant for whitewater. It’s not a real raft!",
      "rating": 4.0,
      "verified": true,
      "author": "Ibats ",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "LISTING IS FAKE",
      "text": "Boat doesn't come with Oars. Also, the boat is terrible - takes forever to inflate and deflate. But mostly, it just doesn't come with any of the parts clearly advertised on the listing",
      "rating": 1.0,
      "verified": true,
      "author": "AJ Buyer",
      "helpful_votes": 5,
      "publication_date": 20190416
    },
    {
      "title": "Great raft for the pool",
      "text": "We use this in our pool and the kids love it. Few things we did: -Only used half the oars so they didn't stick out so much -Youll have to refill it every few weeks if it sits out in the sun -I weigh 250 and I feel comfortable in it with a small child, so ignore the 220 weight limit (within reason) Takes about 12 days from when ordered, so don't tell the kids about it till it tells you its on the way. Pump it comes with is decent, but it'll take about 20 minutes to blow up.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe E",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Little toy inflatable",
      "text": "We have a really decent kayak from the same company, and I thought this “boat” would be of at least comparable quality. This is not a boat and not a kayak. It’s an inflatable toy. There is zero stability, and the soft, toy like sides make it almost impossible to actually row. It’s also tiny. Only two children might fit in this, and not even well. I’m not sure what one could want this inflatable boat-toy for, but sailing would not be it.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Moller",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Good for pools, bad for rivers.",
      "text": "Boats are like tents in that if you wanna fit 2 people, you get a 3 person unit. With my backpack in the back, I had to sit in a ball or with my legs hanging out to fit, and I am not a large man. (5'7\", 160lbs) Otherwise, be wary. I wouldn't recommend this raft for any kind of outdoor use: a stray branch can poke the bottom and cause a leak, leaving you stranded. It'd make a nice pool toy though.",
      "rating": 3.0,
      "verified": true,
      "author": "SBN Codey",
      "helpful_votes": 11,
      "publication_date": 20150615
    },
    {
      "title": "Bought as a gag gift during a family xmas vacation ...",
      "text": "Bought as a gag gift during a family xmas vacation to Puerto Vallarta. It fit in my suitcase and I was able to pump it up in the hotel room, wrap it, and put it under our \"tree\" (just a picture of a tree). No one wanted it, so I ended up using it myself. I rode it down a creek into the Pacific Ocean. There were a bunch of kids playing on the beach, so I gave it to them I think I bought it for 6 bucks or so.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Stoker",
      "helpful_votes": 2,
      "publication_date": 20180715
    },
    {
      "title": "Not a boat, just a float",
      "text": "This is not a boat. It doesn't have oars or a fin under. It's a little floatie in the shape of a boat. It's made from the same thin plastic as pool floaties, it's very light, and 5 mph wind can easily flip it. I tie to the back of my paddleboard to carry my 8 year old (tallish, 56 lbs, fits comfortably), and it's perfect for that purpose. But don't think for one minute that anyone can use this as a boat, because it's not. Deceptive name. Great floatie.",
      "rating": 3.0,
      "verified": true,
      "author": "HappyFloridian",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Fun little raft, but really for 1 adult or 1 adult & a child....",
      "text": "The Intex-Explorer-200-Boat-Set is an inflatable boat designed for 1 or 2 people, but feel it fits more for 1 adult or 1 adult w/a child comfortably. The compact design allows you to carry the boat in the trunk of your car. The raft has a grab rope at the bow which provides for fast and convenient entry and exit into and out of the water. There are two inflatable chambers, including the inflatable floor. This provides stability for the passengers. The oar locks are welded into place for security. It is made of a heavy 13 gauge PVC vinyl. Total weight capacity for the raft is 210 pounds.",
      "rating": 4.0,
      "verified": true,
      "author": "Living the dream!",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Disappointing",
      "text": "The first time we used this boat my seven year old granddaughter started yelling I'm sinking! An 18 inch section ripped out where the bottom meets the sides. Fortunately she was wearing a life vest and was near the shore. But it was quite disappointing because it was new and we had also purchased oars separately. She weighs less than 90 lbs and the boat was supposed to be rated for two people!",
      "rating": 1.0,
      "verified": true,
      "author": "Heather R. Hurley",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Not made for two",
      "text": "Definitely not built for two like the picture shows. My 15 year old and my 9 year old tried to use it together (probably weight 190 between the two of them). They were sinking the whole time. Then my 9 year old had a friend come over and they were able to use it together but they probably weighed 120 together. It’s a really cute raft though. Durable. Hadn’t gotten snagged on anything. Don’t have to constantly refill it. Holds air well.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Not a great buy for what I wanted",
      "text": "First time I used on the lake it won’t hold solid air continues to partially deflate. Would never use this for rafting, youd have to sit on your keens or something to see anything. Not a great buy for what I wanted, if it held air I’d be fine with it. Good for kids to paddle around in and that’s about it. Like my other index stuff. Miss here",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180715
    },
    {
      "title": "Tucks in Car easily",
      "text": "In the summer of the pandemic most cities closed their local beaches for swimming but for our family, each person could take the boat out and enjoy the water on the lake. The paddles do come apart and you can use the paddles like a row boat or screw them together like a kayak paddle. The boat has two separate air chambers in case one leaks. The pump blows the boat up quickly and we never had a leak.",
      "rating": 5.0,
      "verified": true,
      "author": "DocTheology",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Didn’t last more than 2 days",
      "text": "Easy to inflate with a pump. That is the only good thing I can say about it. Blew it up, my 8 year old son used it 2 days and it went flat. That is the picture on the deck. It got a hole in it. The one in the pool we’ve had for 3 weeks I think. Had to add air yesterday and today is flat again. He didn’t jump on it nor was he rough on it. He wanted this one so he could share with his 6 year old sister who has Down syndrome. Very disappointed that we bought 3 and only got a few weeks out of them. Am contacting the company today.",
      "rating": 1.0,
      "verified": true,
      "author": "akremington12",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "No bueno",
      "text": "Well, this touched a stick and popped before the first time using it. I patched the two tiny holes following the instructions on the included patch, waiting 30+ minutes, blew it back up and the patches did not hold up what-so ever. Needless to say I never got to use it, ruined my plans for the day and it’s still deflated after multiple attempts at patching to where I used all of the patch that was included. So disappointed. Good thing it was cheap but was still a waste of money. Can I return a popped float? Lol",
      "rating": 2.0,
      "verified": true,
      "author": "MarieMarie",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Great price for recreational use",
      "text": "Not that easy to inflate with manual air pump, its my recommendation to use an electric air pump it will make your life a lot easier. Nice inflatable boat for a recreational family outing. The 3-person capacity I would say its only for small children's, and perhaps only 2 so they are more comfortable. Mostly tie it to one of our kayaks and pull our son around, since he was too tired to do anything. Only been used twice so can't speak yet of durability. However I believe to be well built and sturdy for use recreation ally on passive bodies of water.",
      "rating": 4.0,
      "verified": true,
      "author": "Marla",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Just bought it, it leaks!",
      "text": "Really disappointed that we just got this and blew it up for our pool for the kids to do a test run with the paddles so when we go on the lake they will know how to row, etc. Noticed the boat was deflated the next day, filled it up again and deflated again the following day. They are now out of stock so we don't want to return it but will go hunting for the hole and hope the patch works. The size and paddles are perfect for our two kids, or a kid and a parent...totally what we were looking for, just hope it's durable for more than a week!",
      "rating": 2.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Affordable, good quality.",
      "text": "While all other kayak or paddle board are over $500, this item can easily give you a chance to have fun on the water. It does take a while to inflate and the manual one takes energy too. I suggest to inflate more because it will be easier to operate the paddle cause the rings on the side of the boat are more stable. When I left it on the dock overnight, it slightly deflated. Overall it's good for its price.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted Liao",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Inexpensive and Durable Little Boat",
      "text": "This is an inexpensive and fun little boat which we used every day on our beach vacation with the grandkids. It definitely holds 3 small people, but 3 teenagers was too much, which was ok, as the kids adapted. Fun to row, the pump that comes with it works very well. The boat held its own, keeping well inflated, and had a lot of tough use. This is a great little boat for fun. It's in our swimming pool now, continuing getting use.",
      "rating": 5.0,
      "verified": true,
      "author": "pam coon",
      "helpful_votes": 3,
      "publication_date": 20170826
    },
    {
      "title": "Amazing value",
      "text": "My favorite mom floaty. Super comfy to sprawl out in & has sides to keep the little kids from toppling into the water. I bob around my pool with my two youngest tucked in with me and we have the best time splashing & relaxing. Then when i want to lay on my stomache (without kids) i just flip the boat over & voila! instant air mattress. These boats are such good quality. I cant believe how cheap they are. We started out with 1 but our household now has 3 b/c everyone wants to use them.",
      "rating": 5.0,
      "verified": true,
      "author": "STAYATHOMEMOM",
      "helpful_votes": 2,
      "publication_date": 20171201
    },
    {
      "title": "No Oars!",
      "text": "The inflatable boat is great, but it did not come with the oars or the accessory to help inflate it as described. Amazon says they have no contact number for the seller.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Spitler",
      "helpful_votes": 6,
      "publication_date": 20180508
    },
    {
      "title": "Well Worth the Money",
      "text": "This is perfect for what we needed - a small raft to pull behind a kayak. It's the perfect size for a dog who loves the water. I paid $10 for it, and we have gotten 4 uses out of it so far, with no issues whatsoever. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "mwmwm",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "My favorite floatie!",
      "text": "If you have ever purchased one of these at a sporting goods store, this is the exact same thing but 1/3 the cost. What a deal! I'd highly recommend the 300 over the 200. We got both, but the 200 is too small... its a good size for 1 kid, this easily fits one adult and one child, or even 3 small children. Although this is my favorite floatie ever, I wouldn't trust it on raging river, its more for a lazy river, playing, and relaxing at the lake.",
      "rating": 5.0,
      "verified": true,
      "author": "PrivateAccount",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Not super durable but up for the challenge.",
      "text": "So far so good, fine to inflate takes a lot more work to deflate. I wish this had inflating points like a tube but all negatives aside it does work as it was intended. I used it both as a boat with just myself and as a cooler holder/carrier for the dry stuff while tubing. Works well for both! It is not as durable as a tube or an inflatable kayak also made by intex. But it does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Caleb Tangeman",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Who bought this? Me???? No way, when?",
      "text": "Oh totally awesome! I forgot I even had this thing! You see, like so many others I have a horrible amazon addiction and I buy random stuff because it’s a lightning deal or deal of the day!! Then it’s a surprise when I open it, and then a surprise six months later when I discover it again for the very first time sitting on a random shelf in my garage!! Well, I guess it will come in handy if there is ever a tsunami, biblical flood, or if I want to go white water rafting for the first and last time all in the same day!",
      "rating": 5.0,
      "verified": true,
      "author": "Rain Man Did it",
      "helpful_votes": 2,
      "publication_date": 20180306
    },
    {
      "title": "Deflated after 3 hours of use.",
      "text": "Really disappointed. Was in the pool for 3 hours for my 2 kids to play in over the holiday weekend. It slowly started deflating. No idea how as the kids just sat in it, still hunting for the hole. Kids are gutted. Wish I'd listened to the reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Sa",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Good.",
      "text": "Doesn't hold 3- more like 2 adults who don't mind being close or one person comfortably. You will want a power inflater for this thing. Tried using the pump it came with and it literally took over an hour to inflate. The next time we used it, used an electric inflater that you might keep in your car. That still took maybe 30 mins. Once it's inflated it's great though. Easy to maneuver and makes a good day of floating on a lake.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Not bad for a cooler and stuff you want kept dry",
      "text": "We take this boat tubing down the river and put our cooler and snacks in it because it's a dry bottom. It works decently well at keeping our stuff from getting wet. I don't love the nozzle to inflate it, as it takes FOREVER and is small and inconvenient which surprises me from Intex. My other issue is that there's really not anywhere to tie it to other tubes. Which again, surprises me from Intex. Most of the tubes come with an interlocking mechanism whereas this one is severely lacking.",
      "rating": 3.0,
      "verified": true,
      "author": "Elyse Police",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "It's made of thin plastic material so will puncture easily. We've used these and get about three seasons ...",
      "text": "It's a cheap inflatable raft that my kids use to play on the river with. It's made of thin plastic material so will puncture easily. We've used these and get about three seasons out of them on the river. Not bad for the money. Cheaper than the hardware store at the river for the same exact one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason L.",
      "helpful_votes": 6,
      "publication_date": 20161216
    },
    {
      "title": "Takes a while to inflate but worth it for the price",
      "text": "This is a great buy for your buck! We have a community pond in our backyard and decided we needed to explore it. It takes a while to inflate but eventually it gets there. It should also be inflated before each use as it doesn’t retain the air very well. The raft is big enough to fit my husband our daughter perfectly. I wouldn’t go white water rafting in it. But calm waters are definitely good.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Super fun for the kids",
      "text": "For the price, this is a really great sturdy boat/float. We have only used in the pool, but it is sturdy and has held up well so far. I have gotten in it a few times and it is a bit hard to paddle because you sit deeper in it and the paddles don't stay in the side holes perfectly. I am not very good at it either way but I wanted to attempt it for exercise./ edited, it popped after 3 weeks",
      "rating": 4.0,
      "verified": true,
      "author": "jb adams",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Avoidable. Cant row it actually. Center sinks. Cant fit one adult and a kid properly",
      "text": "Purchased it long time ago, but used it yesterday at a lake. It inflated alright, but the air kept oozing out even while pumping in. Then we took it in water and the center just sinks when an adult gets in, kinda fold the \"boat\" in half. The part where oar holder is joint on the boat also sinks while trying to use oars. Not good enough for use, unless you want to use this to just lie down on without going anywhere. Avoidable.",
      "rating": 2.0,
      "verified": true,
      "author": "Nisarg",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "We love it",
      "text": "My teen son said he wanted a boat for the pool. I know they make pool floats, but I never heard of a pool boat. Of course, Amazon has a selection of pool boats. This one fits ONE teen or adult. The included pump is nice, not super fast but not super slow either. It was pretty easy to get it inflated. Can't complain. We haven't tried it out on a lake or ocean yet. Update: we used it at Galveston, there's constant waves there, it worked out great. Kept us floating on top of the waves.",
      "rating": 5.0,
      "verified": true,
      "author": "BAGS",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Intex Explorer 200",
      "text": "I wouldn't recommend Water Rafting in this but hey, you may have more luck than others. We use this to float down the river and spring. My son will be the one in here since he doesn't want his toes in the water and we may put some things in that we don't want to get wet. It does hold a 185lb adult just fine. Please hit the Helpful button if you found this review helpful!",
      "rating": 4.0,
      "verified": true,
      "author": "QuyDaddi",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Returned",
      "text": "Returned. The Second one I’ve had a problem with. A thin piece of vinyl holds the inflated floor to the inflated frame and that’s where the problem was. Disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "JOHNNY DOLLAR",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Good toy",
      "text": "Our little boy wanted a row boat. Having already purchased him a kayak I didn’t want to spend a small fortune. This is a pool toy material wise. I won’t be comfortable with him taking it out on the open water. It’s way bigger than anticipated. Our living room isn’t small, but man does this boat make it look small! This will be a fun boat for pool but not much more.",
      "rating": 5.0,
      "verified": true,
      "author": "S. E. Langer",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Floated down a river in this for 4 hours!",
      "text": "Held up well even though we went over a few rocks a few times... The only thing I don't like about this is the pump it came with will take you a while and a workout to get it inflated with, then deflating it is tough too, it took 2 of us to deflate one person the squeeze the valve while the other sat on it to push out the air. Otherwise a great purchase especially for $13 on sale! I saw this same one without paddles or pump and big % for $45",
      "rating": 4.0,
      "verified": true,
      "author": "Nica Morgan",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "good option for carrying supplies alongside our float tubes however ...",
      "text": "Boat held up well on a 4+ hour river trip with a couple spots of mild rapid, good option for carrying supplies alongside our float tubes however have not used for a person to ride it. It takes a while to blow up as the air holes are very small and only fit a needle nose pump. Material around the handles seemed flimsy at points and I didn't want to test them with extra pressure. However worked well for our use and didn't pop, so a win for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "A.M.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Durable enough for a big Dog",
      "text": "Bought this so we could take our German Shepherd Kayaking. Its durable it held up well. It has plenty of room for him. Inflated it with our air pump took a few minutes and we were up and running. However deflation would be so much better with an unscrew valve to pack up and go. We have a big car so we were able to throw it in the back inflated, but I can see where others might have an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal Sitar",
      "helpful_votes": 2,
      "publication_date": 20190902
    },
    {
      "title": "Great as a fun beach toy for grandsons",
      "text": "Used the motorized pump I had for an inflatable mattress. Otherwise would have taken me forever with the pump provided. That's why I gave it 4 stars. Was durable and withstood my two grandsons (6 and 8) playing with it as well as my husband. Used it without the oars a lot - more like a beach float for that rather than a boat.",
      "rating": 4.0,
      "verified": true,
      "author": "LAF",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Super fun for the kids, but don't expect it to last",
      "text": "These are super fun for the kids to play on, but don't expect them to last more than a couple seasons. They will tear easily if your kids jump on the boat or are too rough. For the price, you can't beat these boats. The cost is almost the same as a pool float, except the material is much stronger. We have owned both the Explorer 100 and 200.",
      "rating": 5.0,
      "verified": true,
      "author": "M.McFly",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Fun and easy to setup",
      "text": "Fun pool toy for a large pool, we also have used; the smaller version; on a lake so this one could easily go on a lake too, but it's a toy not a fishing equipment. Can carry up to 210lbs which is great if a parent wants to sit in and teach their kid to row in a playful way. Easy to inflate with included pump. The oars are 2 rod pieces twisted together and 1 paddle twisted/screwed on. Really easy to pack and portable.",
      "rating": 5.0,
      "verified": true,
      "author": "nitamay",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Fun, but it didn't last.",
      "text": "It was fun twice in the lake! On the third outing, it lost air slowly enough so that we didn't notice for a while. We were far from shore when we realized it was deflating. We were glad we had life jackets when we had to get out and swim it back. Do yourselves a favor and pick up cheap life jackets at your local big box store, you never know when you'll need them.",
      "rating": 2.0,
      "verified": true,
      "author": "laba",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Disappointing",
      "text": "Raft was used not even a handful of times in a swimming pool under strict supervision. We gave this to our 10 year old grandson for his birthday, it busted at the seam and is unusable. Never got to enjoy this boat, Bought at the end of July for his birthday that was at the end of July. Used for a couple weeks. Would not advise anyone to purchase this.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Hinrichs",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Fun boat for kids... and adults!",
      "text": "My kids really enjoyed this boat on the lake. I am a 250 lb. man and I had no difficulty enjoying this boat either. It’s plenty stable with myself and one other child in it. We found it more convenient to use the oars freestyle instead of mounting them. The pump was also a nice feature too! It’s nice that it was included and that it actually works. It probably took about 15 minutes to pump up each boat. We were the envy of many beachgoers on Independence Day.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Nice but not really sturdy",
      "text": "We played with it rather rently. No jumping in it or dragging on the ground but it still got a hole rather quickly. We bought additional patches and will attempt to fix it. It was fun while it lasted but we only had it for a about a week. Maybe want to make sure you have a bigger oumo because it took forever with that little pump haha",
      "rating": 3.0,
      "verified": true,
      "author": "germangirl88",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "lots of fun.",
      "text": "Perfect raft for a lazy day on the lake. Seems to be made with good quality materials....I wasn't looking for a life time of use...lol...sure the family will have many good times with this raft. The only reason I gave it 4 stars instead of 5 is because I really wouldn't consider it a 2 person raft...it really is only good for 1 person at a time unless u put 2 small children in it unattended... which won't happen at my house! Other them that, the older kiddos...teenagers...will have a great time fishing off of it or just floating around the water.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 4,
      "publication_date": 20160105
    },
    {
      "title": "Fun Tow Boat!",
      "text": "Gift for my 3 year old grandson who loved it! It’s his first boat. Of course we held onto the rope while he tried to paddle. This is also fun on land. With constant supervision, fill up the boat with water & toys and use as a mini pool. You can even put a few live minnows in the water and the kids have fun watching them swim. Always supervise & empty the water out of tow boat when not in use! Nice color boat.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Belanger",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "sprung a leak within an hour of easy use",
      "text": "Three young kids, not using it roughly, and one of the seams popped within less than an hour. The boat seems better than I was expecting other than this but.... UPDATE: Bought a patch kit and fixed the leak. A new one cropped up immediately. Patched it. A third leak. Patched it. Another one. All the leaks are along the seam where the floor of the boat attaches to the sides. It's an hour or so of fun... then landfill.",
      "rating": 2.0,
      "verified": true,
      "author": "Richard Quarles",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Easily tears in River use!",
      "text": "On our second launching of the Intex Explorer 300 with two of us in the raft drifting slowly with a total weight well under the 410 Lb capacity, we barely scraped a branch (deadhead) in the middle of the river and it quickly tore all the way through. While it certainly is not Intex's fault that we hit debris, previous rafts that we have owned with a similar pricing structure had a much stronger rubber composition and would not have punctured so easily. Possibly a workable raft for swimming pools, but be careful when drifting in a river.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill M.",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "glorified pool tubes- both ripped on first use.",
      "text": "We bought two of these to yosemite to raft down the merced river. Neither lasted all the way through the ride. These are much more like pool floats but the odd shape makes them really hard to steer. The one thing that makes these a bit better than pool floats is the bottom is covered and a separate blow up from the rest of it so when it does get torn (which it will) the whole thing doesn't deflate at once.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "returned it",
      "text": "I got three of these for a beach trip with my grandkids, We ended up only using 1 of the boats, and within an hour it had a hole in it, it was used on a sandy soft white sand, in the Gulf. So it wasn't hit by a log or something like that. it just spilt. so we didn't open the other boats. I just sent them back.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Boat seems fine, but where are the oars? :(",
      "text": "I ordered the boat with the oars and mini pump, but only received the boat. Of course, this is the biggest part of the purchase, but I wanted the other pieces as well. We are using the boat for pretend play at my preschool, and the oars would have added much to the experience for the kiddos.",
      "rating": 1.0,
      "verified": true,
      "author": "JT LeBaron",
      "helpful_votes": 2,
      "publication_date": 20190118
    },
    {
      "title": "Not worth the money!!! Do not buy!!",
      "text": "This is horrible, not sturdy at all..the pump provided will have you arms fall off after pumping air in that disatreous thing, the weight limit is 210 pound, that was a lie! I'm no where near 150!, Nearly died..don't buy this people",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 2,
      "publication_date": 20200102
    },
    {
      "title": "We put it to the test! Worth it!",
      "text": "Have a favorite camping spot in Superior National Forest. It is near a tiny lake, with a tiny island in the center. With our canoe trip postponed to 2019, my sister and I decided we would find another way to \"portage\". This little raft is meant for one adult, but... made for a hilarious time for the two of us! We absolutely were over the weight limit, and had to kind of pretzel together for space. All things considered, this is a tough little \"boat\". Excited to take it out on future adventures.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "My dog loves it.",
      "text": "I bought this for my dog to float the new lazy river section of the colorado river for my dog. She likes it. It had plenty of room for the both if us if i want to join her in the same float device. As she floats it's fun to see people's reactions to it being a dog in it and not a person. It is rather roomy, it'll take up a truck bed.",
      "rating": 5.0,
      "verified": true,
      "author": "kari",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Would not buy again based on experience",
      "text": "Waited some time to write this review. The oars fell apart and the boat popped after just one summer of use in an Inground swimming pool. The boats and oars are in a landfill at this point. I would not recommend nor buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve D",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Standard inflatable boat",
      "text": "We love this little boat to transfer items from our anchored boat to the shore. We have had a couple and over the years, they pop or tear from the kids playing in them. Totally standard. This boat’s pump arrived broken so we were very upset that our last boating trip didn’t go as planned. Many trips to / from boat to land.",
      "rating": 2.0,
      "verified": true,
      "author": "Deanna",
      "helpful_votes": 0,
      "publication_date": 20200524
    }
  ],
  "product_meta": {
    "title": "Intex Explorer Inflatable Boat Series",
    "rating": 4.2,
    "feature_bullets": [
      "Includes two 48\" French oars",
      "Includes (1) high output manual pump",
      "83\" x 46\" x 16\" (211cm x 117cm x 41cm)",
      "Persons Capacity: 3",
      "Weight Capacity: 410 lbs",
      "Welded on oar locks",
      "Grab rope on bow"
    ],
    "specifications": {
      "Date First Available": "July 14, 2020",
      "ASIN": "B08CY22Q89",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Fitness",
      "Sports & Outdoors",
      "Boating & Sailing",
      "Boating"
    ],
    "price": 84.99
  }
}