{
  "website_summaries": [
    {
      "verdict": "The Phiaton PS 20 BT earphones, with their strong bass response, are an affordable example of how much stereo Bluetooth audio transmission has improved.",
      "pros": [
        "High-quality audio performance for the price",
        "Considerable bass response, which is rare for Bluetooth",
        "Call clarity is solid",
        "Easy, quick pairing process"
      ],
      "cons": [
        "No AC adapter is included",
        "just a USB cable",
        "Shirt clip is in awkward spot"
      ],
      "aspects": {},
      "publication_date": 20130131,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sound/volume is the best I have heard from any bluetooth set I have owned or used.",
      "text": "So far this set is on par or a notch above the LG700. One thing that I have encountered with BT's in this price range or any for jat matter is the volume is lacking, including my more pricier Harmon Kardons. Not so with this model. I dont anybody will be lacking if they choose to buy this model. As for sound these rank up there with the best BT's and with in ears of the $100 plus price range. Time will tell if they hold up to everyday use. My only slight so far is I wish the cord length was a tad longer. I would endorse this model for anyone looking to upgrade to bluetooth.",
      "rating": 5.0,
      "verified": true,
      "author": "guamie",
      "helpful_votes": 2,
      "publication_date": 20130728
    },
    {
      "title": "Good sound, but poor sound isolation",
      "text": "These sound good, but I wish they had better sound isolation. They're designed more as an open headset. Even attached Comply foam tips did not help with sound isolation. For many this might be good, especially if you want to hear people around you in your office, etc. I found that the ear tips included were very comfortable, and I only tried the Comply tips to see if they would isolate sound better.",
      "rating": 3.0,
      "verified": true,
      "author": "JesseRPI",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Works Great",
      "text": "Picked this up as I am a fan of their stereo headphones. Product shipped fast, great packaging, etc. Hooked up and connected seemlessly to my Nexus 7. Somewhat skeptical of these psuedo \"audiophiles\" making comments about audio quality. Any headphone/ear bud is lowfi for serious audio listening and to get close you need very expensive headphones and hi-end source material, not mp3 junk on most mobile devices. So that being said, for movie and audio bluetooth listening more than adequate, connects easilty but as others note, cord length seems a little short.",
      "rating": 4.0,
      "verified": true,
      "author": "Charles R",
      "helpful_votes": 3,
      "publication_date": 20120809
    },
    {
      "title": "FINALLY!! paid for a good pair of headphones and got exactly what I was looking for.",
      "text": "Im in and out of huge data centers all. I need my hands free to work on servers and other equipment. I also wanted superb sound with plenty of clean bass. I got everything I could hoped for, the bass sounds very full and genuine, and the mids and highs compliment each other. I'm able to use all of the headphones bluetooth remote control features with my galaxy blaze, and get at least 7 hours of continuous use on streaming like pandora. 5 stars easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Livio Leonardi",
      "helpful_votes": 5,
      "publication_date": 20121129
    },
    {
      "title": "I love it for apple products",
      "text": "This is the first bluetooth stereo headset I have purchased and it works great for me on my iphone and ipad. Unfortunately it is not compatible with my HP laptop. I contacted support and they replied that it is compatible with most phones but not all types of computers. at this price I would recommend checking if it works with your equipment before purchasing.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue Herman",
      "helpful_votes": 0,
      "publication_date": 20120416
    },
    {
      "title": "We've tested several",
      "text": "The Phiaton bluetooth earphones are the best we've evaluated for both phone and music. They are comparable in sound quality to the lg hbs 700's but look better. They are dramatically superior to the Sony Ericsson Wireless Stereo Headphones, but so is everything. They are notably better on the phone than Jaybird Freedom Stereo Bluetooth Earbuds, and are moderately better for music. Two of us have tried them for three months and it is my go to headset for music. Since we custom make our earpieces our bass response is superior to the n/c included ear retainers that come with the unit.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron L",
      "helpful_votes": 4,
      "publication_date": 20120524
    },
    {
      "title": "works for me",
      "text": "I power walk a lot and the sound quality as well as noise elimination works well. I use it only for calls. You can clip it on the bill of your cap (once my wife saw me that was over), or on your sleeve (once my daughter saw me that too ended), so now it is conveniently clipped on my collar.",
      "rating": 5.0,
      "verified": true,
      "author": "kirk",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "Excellent device. Durable for about two year",
      "text": "Excellent device. Durable for about two year. Got it replaced once it would not charge by customer service for nearly half price on an upgrade. Own the latest PS210BTNC. May forever purchase Phiatons.",
      "rating": 5.0,
      "verified": true,
      "author": "MLCarroll (The Wife )",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Great sounding and work well",
      "text": "I like everything about the earphones. Good, crisp loud and clear highs and lows. Controller unit is a pain however as it constantly comes unclipped from what ever you clip it to. It's too short to put in your gym shorts pockets",
      "rating": 4.0,
      "verified": true,
      "author": "MICHAEL LANZA",
      "helpful_votes": 2,
      "publication_date": 20130219
    },
    {
      "title": "Good while they lasted",
      "text": "My first pair of Phiaton PS 20 BT headphones worked fantastic--for about 1 month. They stopped charging or powering on, so I sent them back to Amazon for a new pair (no problems at all there). My 2nd pair worked for a year but just quit last week. 2 stars because they did give me a year of good use at the gym and while traveling, but for the money I'd expect them to last longer.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Hall",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Best value for Bluetooth headset",
      "text": "Good bass sound. I like the way the earbuds mount or hold in your ears. I found I stopped utilizing any equalizer enhancing software on my Android devices with this headset. I have owned a number of BT headsets and this set is hands down your best bang for the buck. Granted the the tethered cords to the base device is cumbersome so this is my listening headset. Not my workout headset.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Kentner",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "So Far So Good!",
      "text": "Have had absolutely no problems pairing this up with any of my devices. Sound is very good as these are ear buds and designed for music but make your phone calls sound great too!",
      "rating": 5.0,
      "verified": true,
      "author": "flbikerman",
      "helpful_votes": 0,
      "publication_date": 20120824
    },
    {
      "title": "Keep looking.",
      "text": "Constant static. Poor connection. Hard to work the controls. Just don't buy this product. It's a waste of $$$$$ and time.",
      "rating": 1.0,
      "verified": true,
      "author": "Ntbtebmkb",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Thanks for the quick delivery.",
      "text": "I just sorry I got the other water damaged. I would have used one for my Kindle and one for my phone. Love the tone. It's superior to the other one much pricier.",
      "rating": 5.0,
      "verified": true,
      "author": "Reno J. Faoro",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "Love my new headset.",
      "text": "My new Phiaton PS 20 BT is a great headset. Bluetooth connected right to my Galaxy s4 with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "this is the second one i got",
      "text": "I had to add this review after a bad review i gave after the headphone stopped working after 4 month. anyway Phiaton replaced the bad one so i am very happy so i got another one for my wife those are the best Bluetooth head phones on the market very happy they have a great RMA service in case you need it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20130108
    },
    {
      "title": "Sound quality Headphones",
      "text": "My first bluetooth device - works reasonably consistently - sound is big! Turns out these have a bass boost - not really promoted on this site as I recall .. Whilst this feature is good on balance it makes the whole sound a bit \"washy\" - lacks balancing highs... I would like some control over this feature.. However so far on balance - very good..",
      "rating": 4.0,
      "verified": true,
      "author": "Phil Whiteley",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Awesome",
      "text": "Great fit, good sound, Bluetooth is nice and works well. Great pair of earphones. Phiaton is a great company and I love their products.",
      "rating": 5.0,
      "verified": true,
      "author": "gghost",
      "helpful_votes": 0,
      "publication_date": 20130126
    },
    {
      "title": "Good quality",
      "text": "The sound is great and it's easy to use. The battery life exceeded my expectations with the Bluetooth. Will highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Norma Marrero",
      "helpful_votes": 0,
      "publication_date": 20131212
    },
    {
      "title": "The Phiaton PS 20 BT Headset delivers what is most important",
      "text": "The 2 most important considerations for a headset: Good fit and GREAT sound The fit is perfect! The ear buds are soft and fit snugly....making them very comfortable. The sound is truly great and they seem to be noise canceling. I use them at the gym and when I am plugged in I do not hear any other sounds. You can move forward or backward through your song list, change volume and answer your pesky phone via the clip on. My only negative would be that the cord between the clip on and the ear buds is a little too short.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Workman",
      "helpful_votes": 3,
      "publication_date": 20130528
    },
    {
      "title": "PLEASE, DON'T WASTE YOUR MONEY!!!!!",
      "text": "AFTER READING REVIEWS OF THESE HEADPHONES, I HAD HIGH HOPES. THESE HOPES WERE DASHED AFTER ONLY 1 WEEK!!! CONSTRUCTION MATERIALS-CHEAP. SOUND IS JUST OKAY. LOW FREQUENCY (BASS) IS WEAK. EARPIECE UNCOMFORTABLE. BUT MOST IMPORTANTLY, THE HEADPHONES JUST WORKING. I HAD ONLY WORKED OUT WITH THEM 4 TIMES, AND WAS CAREFUL NOT TO PERSPIRE ON THEM, TO NO AVAIL. I SHOULD HAVE BELIEVED THAT OTHER POST THAT WARNED OF THE SAME SITUATION THAT I JUST EXPERIENCED...PLEASE, DON'T WASTE YOUR MONEY ON THIS INFERIOR PRODUCT.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Pena",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Glad I bought it.",
      "text": "Great sound, very comfortable. Less likely to lose it than typical ear piece but still struggling with best way to store it when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 2,
      "publication_date": 20130321
    },
    {
      "title": "Very happy with product",
      "text": "Would have given 5 stars if the cord from the headphones to the main unit was longer. The length is just a tad short to reach from your ears to your waist and so can't be clipped to your belt or waist.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20121009
    },
    {
      "title": "Not for Droid Razr Maxx",
      "text": "I'm disappointed. The \"button\" on the control pod doesn't have any effect on the Droid Razr Maxx. It works well with my Blackberry, but not the Droid. On the BB, it will start the \"voice dialing\" mode, or \"hang-up\". Too bad. It no longer serves my purpose.",
      "rating": 3.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 0,
      "publication_date": 20120906
    },
    {
      "title": "Works well could be more compact",
      "text": "This Bluetooth works very well. The sound quality is as good as connected headphones. Just wish it didn't have to have the control hanging separately .",
      "rating": 4.0,
      "verified": true,
      "author": "Jim C",
      "helpful_votes": 3,
      "publication_date": 20130311
    },
    {
      "title": "Superb Product",
      "text": "Bought it for a friend of mine and he simply loves the performance of the headset. More than just a budget headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Anoop Michael",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "love it but cord to short",
      "text": "love it \"BUT\" give it a longer cord so it can go in the pocket, that will make me very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Paris Dunson",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "Broke after 2 months",
      "text": "Bought in November of 2011. Stopped working while at the gym in Feb 2012. Sent it back to Phiaton. Not heard anything yet or have gotten a replacement. Best audio of bluetooth devices compared to Jaybird freedom and Sony ericson. Did not last.",
      "rating": 2.0,
      "verified": true,
      "author": "Shaman",
      "helpful_votes": 14,
      "publication_date": 20120224
    },
    {
      "title": "Phiaton PS 20 BT Review. Better than expected.",
      "text": "I was quite suprised by how good the sound was coming out of my cellphone. Cellphones (HTC Thunderbolt) are not known for the best sound quality (non iphone). My Monster Coppers are clearly superior, but these little babies do offer a nice bass with the ability to take and make calls on the run (bicycle for me) without wires everywhere. I simply place the phone in my cycling jersey, and off I go!. I am a little concerned over the build quality as it appears so light (hence 4 out of 5 stars). I have only had it for a couple of days. They do clearly serve their purpose with ease. I will post more if a build issue arises.",
      "rating": 4.0,
      "verified": true,
      "author": "Gun2Head",
      "helpful_votes": 6,
      "publication_date": 20111108
    },
    {
      "title": "Wonderful sound, but only lasted 3 days.",
      "text": "The first time I turned on the PS 20 BT, I was taken back by the excellent sound. Three uses later it on its way back to Amazon totaly dead. It would like to think that at this price level, the quality would be much better. Phiaton's customer service was no help in troubleshooting the unit. If you plan to be active with your headset, try another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Wildbill1",
      "helpful_votes": 0,
      "publication_date": 20121203
    },
    {
      "title": "Super quality sound  and easy in the ears, for a nice price ! Recommanded by my brother.",
      "text": "Super quality sound and easy in the ears, for a nice price ! Recommanded by my brother. I got it very quickly !",
      "rating": 5.0,
      "verified": true,
      "author": "Thierry Djeonghe",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "very bad experience",
      "text": "I have this headsets since january and right now it does not work, the blue light is always turned on.",
      "rating": 1.0,
      "verified": true,
      "author": "Leoncio",
      "helpful_votes": 0,
      "publication_date": 20130402
    },
    {
      "title": "Wonderful sound!",
      "text": "Reviewed using iPod Touch 5 Pros: - Sound is great - Ear buds come in 4 sizes - Clip is secure Cons: - Must be recharged - Cord could be longer The Phiaton PS 20 BT has some of the best sound quality I've ever heard from an earbud. It's very balanced so when switching to the next song you don't have to adjust the sound. Speaking of adjusting the sound...if you need to adjust it the controls are pretty easy to master. There is even a \"lock\" button so you don't accidentally hit something. I bought it within the last 60 days to it's still relatively new, but so far so good.",
      "rating": 5.0,
      "verified": false,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Great Bass and comfortable to wear for hours",
      "text": "I got this bluetooth headset and I couldn't be more pleased. I'm not a technical person but the sound is amazing and the earbuds are really comfortable. The battery last for hours. The only thing one has to be careful is not to get them too wet and it's better if one is wearing a v neck shirt or a shirt with buttons for the clip.",
      "rating": 5.0,
      "verified": false,
      "author": "Jose L Navarrete",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Great sound and quality",
      "text": "THe quality is top notch and bluetooth works quite well. I used my aftermarket ear bud connectors on the ear buds, because the ones it came with are not bad, but not better than what I have. I cannot wait to order the new ones!",
      "rating": 5.0,
      "verified": false,
      "author": "PG",
      "helpful_votes": 0,
      "publication_date": 20141027
    },
    {
      "title": "Works well",
      "text": "Pros - Easily connects to my devices, has great sound. Cons - Has to connect to my PC or laptop to charge. Did not come with adapter plug for AC outlet.",
      "rating": 4.0,
      "verified": false,
      "author": "ruthlyngw",
      "helpful_votes": 2,
      "publication_date": 20130306
    },
    {
      "title": "Splendid sound experience that lasts",
      "text": "My wife bought this headset for me as a xmas gift and I have become addicted to it. The battery life is outstanding and the sound quality excellent. I recently experience an issue with my headphones, but he Phiaton Support staff was very helpful and promptly resolved my issue.I use it with my iPhone, Ipad,and computers.",
      "rating": 5.0,
      "verified": false,
      "author": "Felipe",
      "helpful_votes": 5,
      "publication_date": 20120526
    },
    {
      "title": "One glitch",
      "text": "I liked the sound quality. The only problem I have is that I couldn't get them to work with iTunes on my PC. Worked great with my Android though.",
      "rating": 4.0,
      "verified": false,
      "author": "Blake B",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Sound fine, worked for less than 3 weeks",
      "text": "I purchased these for my teenage son as a Christmas gift. The headphones were easy to set up and my son thoroughly enjoyed having wireless headphones for working out. However, about 3 weeks after Christmas, the stopped working entirely. I'm awaiting a response from the Phiaton customer service to see how the situation resolves. Even if I am sent a replacement set, I will reserve changing my rating until after they have been operational for at least a few months.",
      "rating": 2.0,
      "verified": false,
      "author": "Kimbell Brown",
      "helpful_votes": 0,
      "publication_date": 20130129
    },
    {
      "title": "Love these!!!",
      "text": "Deep bass, great sound isolation, works without any issues. Bluetooth connectivity range is pretty impressive. Came quickly and were a great black friday deal!",
      "rating": 5.0,
      "verified": false,
      "author": "IAM4UNC2",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Great headphones",
      "text": "I've had many different head phones wired and blue tooth and these are amongst the best! Great headphones. They are one of the best sounding pair of headphones I've ever heard that's due to their accuracy and smooth bass response. They sound phenomenal! And for this price they can't be beat!!!!",
      "rating": 5.0,
      "verified": false,
      "author": "D.J",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "Good sound but sucks for the gym/working out",
      "text": "Good sound but I wanted something convenient to work out with that would reduce wires while working out. This was awkward and the connection to my Iphone was poor unless I was near the phone.",
      "rating": 3.0,
      "verified": false,
      "author": "Ross",
      "helpful_votes": 0,
      "publication_date": 20121210
    }
  ],
  "product_meta": {
    "title": "Phiaton PS 20 BT Bluetooth Stereo Headset (Black) (Discontinued by Manufacturer)",
    "description": "Product Packaging:Standard PackagingIts time to really break free from your headphone cables! The Phiaton PS 20 BT Bluetooth Stereo Headset is a stylish and lightweight personal calling and music listening solution that combines the total freedom and flexibility of cable-free and hands-free Bluetooth technology with a dramatically enhanced audio experience. Thanks to the built-in Bluetooth v3.0 technology, users can easily answer phone calls without having to remove their earphones - and with the special Echo-Off Noise reduction technology, background noise is virtually eliminated while you're on a call. For total flexibility - and to make sure you never miss a call-the PS 20 BTs provide a calling / music playing time of 6 hours and 250 hours of standby. Musicality and overall audio quality is a top priority in all Phiaton products, and the PS 20 BTs' powerful 14.3mm drivers produce pure and accurate sound. Most importantly, the unique half in-ear design of the earphones allows them to be worn just outside the ear canal for a comfortable fit and hours of listening enjoyment anywhere, anytime. PS 20 BT Bluetooth Controller Specifications: Communication Network: Bluetooth standard Ver.3.0; Operating Range: Within 10m; Bluetooth Profile: Support A2DP, AVRCP, HFP, HSP; Battery: lithium polymer DC3.7V / 150mA; Microphone Frequency Response : 10 - 4,000Hz; Microphone Sensitivity: -40 dB; Dimensions: 51 x 30 x 17( mm); Weight: 16 g. PS 20 BT Earphones Specifications: Type: Dynamic; Driver Diameter: 14.3 mm; Sensitivity: 110 dB/mW; Frequency Response: 15 - 22,000Hz; Impedance: 32 ohms.\n\nFROM THE MANUFACTURER\n\n\nEasily answer calls without having to remove the earphones. View larger\n'Clip and Go' controller provides even more convenience while on the go. View larger 2011 Digital Trends \"Best of\" award winner for Best Wireless Headphones\nDelivering unprecedented audio performance. View larger It's time to really break free from your headphone cables. The Phiaton PS 20 BT Bluetooth Stereo Headset is a stylish and lightweight personal calling and music listening solution that combines the total freedom and flexibility of cable-free and hands-free Bluetooth technology with a dramatically enhanced audio experience. Thanks to the built-in Bluetooth v3.0 technology, you can easily answer phone calls without having to remove the earphones--and with the special \"Echo-Off\" Noise reduction technology, background noise is virtually eliminated while you're on a call. For total flexibility, and to make sure you never miss a call, the PS 20 BTs provide a calling/music playing time of 6 hours and 250 hours of standby.\n\nMusicality and overall audio quality is a top priority in all Phiaton products, and the PS 20 BTs' powerful 14.3mm drivers produce pure and accurate sound. Most importantly, the unique \"half in-ear\" design of the earphones allows them to be worn just outside the ear canal for a comfortable fit and hours of listening enjoyment anywhere, anytime.\n\nTAKE CHARGE OF YOUR MUSIC & CALLS WITH FULL IN-LINE CONTROLS\nThe PS 20 BT feature full inline musical controls to let you take charge of all the songs in your music library (FF, REW, PLAY, STOP, PAUSE, Vol+, Vol-)--all without even having to locate the music device or take it out of your bag. The controller also features an answer button to allow you to answer phone calls, and then resume listening to your music when finished, while never having to touch your actual device. For even more convenience while on the go, the PS 20 BTs come with a handy 'Clip and Go' controller that attaches to your bag or clothing so everything is within easy reach.\n\nMAXBASS REFLEX FOR POWERFUL LOW-FREQUENCY AUDIO AND NO VIBRATION\nIdeal for use with iPhone, iPod, laptops, MP3 players, and CD or DVD players, the PS 20 BT earphones deliver unprecedented audio performance with a wider frequency range and more realistic musical presence. To provide listeners with rich, gentle-yet-powerful bass response, they feature Phiaton's acclaimed \"MaxBass Reflex\" technology with a dual-chamber structure that virtually eliminates unwanted vibration and echo. you'll enjoy carefully balanced low-frequencies and treble equalization for great sound quality with all music genres, from jazz and classical to rock, hip-hop, and house.\n\nHOURS OF COMFORTABLE LISTENING WITH 4 SETS OF SILICONE EARTIPS\nThe PS 20 BT's unique and ergonomic \"half in-ear\" design combines the excellent bass response of in-ear-style buds with the crystal clear high frequency response of open-ear style headphones. Engineered for a snug fit just outside the ear canal, they feature a lightweight glossy housing that allows for hours of comfortable listening. The PS 20 BTs come with four separate sizes of soft silicon tips to ensure a natural feel and a welcome \"no slip\" fit.\n\nThe PS 20 BTs come with a handsome carrying pouch for easy portability and are available in a glossy black finish. The easy-to-use cord adjuster ensures total convenience and comfort, and the compact remote control is perfect for on-the-go use.\n\nWHAT'S IN THE BOX\nPhiaton PS 20 BT Earphones, 4 sizes of silicon ear tips (XS, S, M, L), carrying pouch, owner's guide, product registration card, USB charger cable, neck strap.\n\nTECHNICAL SPECIFICATIONS\nCONTROLLER:\n * Communication Network: Bluetooth standard Ver.3.0\n * Operating Range: Within 10m\n * Bluetooth Profile: Support A2DP, AVRCP, HFP, HSP\n * Battery: lithium polymer DC3.7V / 150mA\n * Microphone Frequency Response : 10 ~ 4,000Hz\n * Microphone Sensitivity: -40 dB\n * Dimensions: 51 x 30 x 17 (mm)\n * Weight: 16 g\n\nEARPHONES:\n * Driver Type: 14.3mm Dynamic\n * Sensitivity: 110 dB/mW\n * Frequency Response: 15 ~ 22,000Hz\n * Impedance: 32 ohms\n * THD: Less than 1% at 1 kHz\n * Sensitivity: 101dB at 1 kHz\n * Maximum input power: 30 mW\n * Weight: 13 g\n * Cord Length: 1.2 m",
    "rating": 2.8,
    "feature_bullets": [
      "Cable-free and hands-free with Bluetooth v3.0 technology",
      "MaxBass Reflex for powerful low-frequency audio and no vibration",
      "Unique and ergonomic half in-ear design allows for hours of comfortable listening",
      "Full inline musical controls allow you to take charge of your songs without having to find your device"
    ],
    "specifications": {
      "Product Dimensions": "4.33 x 2.09 x 6.14 inches",
      "Item Weight": "6.9 ounces",
      "Manufacturer": "Phiaton Inc.",
      "ASIN": "B005QQ8SDE",
      "Item model number": "PS 20 BT",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "2.8 out of 5 stars55 ratings2.8 out of 5 stars",
      "Best Sellers Rank": "#6,081 in On-Ear Headphones",
      "Date First Available": "September 29, 2011"
    },
    "categories": [
      "Electronics",
      "Headphones",
      "On-Ear Headphones"
    ],
    "price": ""
  }
}