{
  "website_summaries": [
    {
      "verdict": "Stylish yet highly functional with a simple design that's incredibly user-friendly.",
      "pros": [
        "Stands out for its functionality and durable construction",
        "The magnetic latch doors allow you to tend your fire without needing to move the whole screen",
        "It comes in two sizes to fit flush to your fireplace",
        "The heavy duty mesh is of a quality build"
      ],
      "cons": [
        "Shipping packaging not up to scratch—some users report damage in transit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Seamless fit!",
      "text": "I have ferrets that won't stay out of the fireplace. In the past, I've just blocked the wood-burning fireplace with cardboard and put the TV in front of it, but moving into my new house, with a beautiful gas fireplace, I didn't want to hide it. This screen is extremely heavy. Despite their neverending attempts, my little catsnakes have been unsuccessful at opening the doors or tipping the screen. Personally, I wouldn't trust this to withstand small children without some kind of mounting or heavy-duty adhesive, but it's great for keeping your furbabies safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Kitty Redden",
      "helpful_votes": 2,
      "publication_date": 20190827
    },
    {
      "title": "for the money this works pretty darn well",
      "text": "for the money this works pretty darn well. the only negative is how it grips the inside of the fireplace. we ended up anchoring points inside and screwing it into our fireplace to make it more sturdy. we ended up NOT using the L shaped brackets in front because they don't look as nice with them and were a tripping hazard (have a toddler).",
      "rating": 5.0,
      "verified": true,
      "author": "Bubbles-Desmo",
      "helpful_votes": 7,
      "publication_date": 20160518
    },
    {
      "title": "Awesome screen for the hearth",
      "text": "We have a rather flat hearth front, and a cat that loves to hide in the flu. Toss in the odd small child wandering about, and it all means that the hearth needs something stout on it. This is a gorgeous piece or work that installed in minutes, with the 'feet' being adjustable so we could get it nice and ight against the entrance of the fireplace. The glass panels throw some light, and the mesh allows for easy air/heat transfer. The shipping box is sturdy and it arrived with no damage to the contents.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Crawford",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Serviceable, but cheap and ugly",
      "text": "A classic case of you get what you pay for. You can see the clumsy welding marks on the front and the thing is just embarrassing to present to guests. My guess is that if you have a really nice façade to your fireplace, say high quality stone, then this might work. But if that's the case you can probably afford a properly made screen and aren't looking to get it cheap on Amazon. Also, the door handles of course get very hot. Caution to parents of little ones. Overall it's not horrible and it was a breeze to assemble.",
      "rating": 2.0,
      "verified": true,
      "author": "Pleased to meet you",
      "helpful_votes": 0,
      "publication_date": 20161206
    },
    {
      "title": "Almost perfect.",
      "text": "Exactly what I needed. True to specs. Looks great. However... you must have 4 inches or so of room for the supports on the backside to go into your fireplace, or it will not fit flush to your fireplace. I put the back supports on the front, which lessened it’s eye appeal (slightly) but made it sturdy and flush with the fireplace. Great quality and attractive overall.",
      "rating": 5.0,
      "verified": true,
      "author": "GAC",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Looks exactly as advertised",
      "text": "The screen was assembled except for the stabilizing front and back feet. Was easy to assemble. The front feet were outside in front of the screen and my husband was able to place the back feet inside the fireplace. The back feet can be placed anywhere inside along the bottom of the screen. We bought this to keep our new kittens out of the fireplace. They were ready to jump into the fire out of curiosity. We had to watch them constantly. This solved the problem. It is very sturdy and beautiful. The bonus was how beautiful it is with a fire. I love the look of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra H. Chapman",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Good buy",
      "text": "I do love the look of this . Ive had a screenless fireplace for over 2 years now. The problem i have is that when you pull on the doors, the entire thing pulls away from the fire place. its only supported by legs on the outside of the screen so once you pull it away it actually topples towards the fireplace. I have to use my foot or hand to hold it against the fireplace then i open the doors . There are rails that secure it from sliding side to side .",
      "rating": 4.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Pretty good",
      "text": "The screen is very nice and sturdy. Easy to assemble and fits well into the fireplace. Only complaint is the magnet that holds the doors lost its magnetism after the first fire, probably from the heat of the fire. Doors still close but they don't secure anymore. Otherwise a great buy and addition to any home.",
      "rating": 4.0,
      "verified": true,
      "author": "josh",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Very nice",
      "text": "Very nice fireplace thing. The doors work great and it is built nice. It looks great and stays right where you put it.",
      "rating": 5.0,
      "verified": true,
      "author": "William B.",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Nice fireplace screen",
      "text": "It helped us transform our 1960 fireplace with a brass door to one where heat will fill the room. It is relatively sturdy although we don’t have it secured with the brackets and are relying on the feet on the outside. Overall a nice look and have received good reactions from others on the fireplace transformation.",
      "rating": 5.0,
      "verified": true,
      "author": "In Minnesota ",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Love it!",
      "text": "This is exactly what I needed. I like that it goes all the way to the bottom. It has doors, so you can easily add logs without having to move the whole screen. The glass is such a nice touch. It's very pretty, functional and appears to be well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "We love it.",
      "text": "We love it. It looks great on our fireplace and very sturdy. We have not lit a fire with it on yet, but it has been about a month since we've had it and our kids have never been able to knock it down. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "I love this fireplace screen",
      "text": "I love this fireplace screen. It fits my fireplace perfectly and keep my cats out of the it. The only thing I think they could improve on is the glass surrounding it. It's a little thin and moves if I open the doors. If the glass was a little thicker it would be better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Attractive look",
      "text": "Doors swing easily and handles stay cold when fire is burning.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory Farrell",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Lovely!",
      "text": "Really lovely and fit perfectly. Get lots of compliments on it, and it seems very sturdy and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Iliketurtles",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Cabin fireplace charm",
      "text": "Very good product. Easy to assemble and set up. Dimensions right on.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Heironimus",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "attractive compiment to fireplace",
      "text": "very nice product - simple, quick assembly, fits nice and snug against fireplace face. the packaging was atrocious ! Styrofoam blocking was completely disintegrated into hundreds of pieces but all glass was intact and unbroken. the packing is only complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "Looks even better in person.",
      "text": "I actually like this far more than I thought I was going too. I was a little concerned on whether the glass would clash with the iron look, but I couldn't have been happier once I had put it in place. More importantly, my wife loved the look.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian B.",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "The glass isn't as pretty as I was expecting and it rattles quite a ...",
      "text": "The glass isn't as pretty as I was expecting and it rattles quite a bit but other than that this is a good buy. It was easy to put together and the doors are so convenient. I had a friend drill a hole on each side and secure it to the fireplace with a couple of screws. It's a good buy for the price just not as pretty as the picture would have you believe.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Great for uneven walls",
      "text": "I had difficulty finding a door for my fireplace because of the uneven granite. This fits great, is stable, and beautiful. There is no way to avoid the gaps on the sides and top but it is perfect for keeping the cats out and keeping embers where they belong.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Nice product but needs better quality control",
      "text": "Nice looking product for those with large fire places. Mine arrived quickly but it seems to be out of square.",
      "rating": 3.0,
      "verified": true,
      "author": "Dean with the Machines",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "It looks really nice! The only issue I have is the welds ...",
      "text": "It looks really nice! The only issue I have is the welds where pieces meet look sloppy, but from a distance it is not noticeable. I had to bend the little tabs holding the glass in place to keep it from rattling but that's easy.",
      "rating": 4.0,
      "verified": true,
      "author": "JClark",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Easy to assemble and in excellent condition when it arrived",
      "text": "Easy to assemble and in excellent condition when it arrived. Absolutely beautiful and it does a great job of keeping small pets from poking around the fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "frsnogirl421",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Excellent, You Will Love It!",
      "text": "First the cons...the product arrived with a bent back brace and a piece of paint finish missing off one of the front braces. Sent an email to Plow and Hearth through Amazon and they shipped out replacement parts the next morning. Excellent customer service. The pros...with the back braces, the screen will sit out approximately 4 inches from the fireplace. Without the back braces, the screen will sit flush against the fireplace and looks exactly like inserted glass doors. The screen is HEAVY and is beautiful in person. The glass inserts are beveled and show up beautifully against the black and look very upscale. Totally worth the money especially since the company acted so promptly to correct the damage issues.",
      "rating": 5.0,
      "verified": true,
      "author": "pinklady",
      "helpful_votes": 54,
      "publication_date": 20120511
    },
    {
      "title": "Review of product",
      "text": "The screen is a great addition to a faux fireplace I built. It was missing the hardware when it arrived but I contacted the seller and they shipped it right away. Very sturdy and does what I expected. Very pretty addition to the room - makes my fireplace look real.",
      "rating": 5.0,
      "verified": true,
      "author": "C. M. Howard",
      "helpful_votes": 4,
      "publication_date": 20120906
    },
    {
      "title": "Wrong size and won't return",
      "text": "I bought this about a month ago for my mother in law. She was undergoing some renovations and we tried to place this over her current fireplace and our measurements were way off. It's way too big for her fireplace. Just tried to return the product and amazon wouldn't let me. Can someone from plow and hearth contact me so that I can try to get a sizable fireplace. This is a big purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Looks Perfect",
      "text": "I was looking for fireplace screen that would look elegant in front of my small fireplace. This was PERFECT. My fireplace is both gas and wood burning and the screen was a great addition to keep my young toddler away from the fireplace. The glass gives the screen a very elegant touch. Very sturdy design, would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Newman",
      "helpful_votes": 6,
      "publication_date": 20121115
    },
    {
      "title": "Fantastic!! I gave it as a Christmas gift ...",
      "text": "Fantastic!! I gave it as a Christmas gift to our daughter and her husband . . . it looks great and they are happy with it . . . cannot ask for much more than that!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana Christian",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "Wow",
      "text": "The picture is nice but it doesn't do it justice, it's beautiful, well made and solid construction. We really like the look, it's like bling for our fireplace. Came well packed, very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Not finished for assembly without a means to drill a hole in the iron frame",
      "text": "This was a disaster. They hadn’t put holes in the cast iron frame for assembly. By the state of the package, we were not the first to receive this defunct product.",
      "rating": 1.0,
      "verified": true,
      "author": "Josef Ansorge",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Five Stars",
      "text": "this fireplace screen is really nice, love the looks, fits perfect, nice update to the living room area",
      "rating": 5.0,
      "verified": true,
      "author": "Pam B.",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Great Screen",
      "text": "Great fireplace screen. Easy to put together, just four braces. Everything we were hoping for. Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "buckyrusty",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Five Stars",
      "text": "Love it! Made well and fits perfect into our fireplace. Good buy for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "DanielBanks",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "The best firescreen",
      "text": "We enjoyed using this all winter long. Love the double doors. It sure cut down on clean up time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "As pictured.",
      "text": "Wow. This is just what I was looking for in affordable protection. Looks really nice. It was up in five minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "LaViva",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "Works great!",
      "text": "Item arrived just as promised, and the quality is nice. The outer screen area obliterated the inside housing of fireplace, which is what was needed for the overall look.",
      "rating": 5.0,
      "verified": true,
      "author": "jk",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Assemble",
      "text": "Very easy to assemble, exactly what I expected, Very nice looking",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa Behr",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "LIKE IT A LOT",
      "text": "LIKE IT A LOT. SITS FLUSH UP TO THE FIREPLACE...(i DIDN'T PUT ON BACK BRACKETS...ONLY LEFT THE FRONT ONES ON ).NO SPARKS",
      "rating": 5.0,
      "verified": true,
      "author": "Gracie Serritella",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble, very sturdy. Looks pretty. Heavy enough to keep my 22 month old out of the fire place. The door makes it even better.",
      "rating": 4.0,
      "verified": true,
      "author": "manu",
      "helpful_votes": 4,
      "publication_date": 20140724
    },
    {
      "title": "Five Stars",
      "text": "Beautiful. Really completes the fireplace. Packaged well and there was no issue with anything broken like other reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul w.",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Five Stars",
      "text": "This is a beautiful screen! Sturdy and easy to assemble!",
      "rating": 5.0,
      "verified": true,
      "author": "Karin",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Works great. I get many compliments on",
      "text": "This is gorgeous. Works great. I get many compliments on it",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Great fireplace screen!",
      "text": "LOVE!!! It looks great, and I won't be nervous about my kids throwing something into or accidentally getting knocked into the fire anymore!",
      "rating": 5.0,
      "verified": true,
      "author": "J-Bird",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "Don't bother",
      "text": "I purchased this through Amazon and was excited it was coming from Plow and Hearth. The packing was terrible. Missing parts, torn parts bag, poor packing. Very boring and not attractive at all in person. Returned it for a prompt and full return. That part was the only good thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynea J DAngelo",
      "helpful_votes": 7,
      "publication_date": 20131015
    },
    {
      "title": "but this is a really pretty piece.",
      "text": "Could be sturdier, but this is a really pretty piece.",
      "rating": 4.0,
      "verified": true,
      "author": "Kendall Park",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "This is the second fireplace screen we've purchased from Plow & Hearth and have been very satisfied with both purchases",
      "text": "Looks fabulous! This is the second fireplace screen we've purchased from Plow & Hearth and have been very satisfied with both purchases. Arrived promptly and in excellent condition, an added bonus!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen M Thompson",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Like the product, disappointed in the packaging",
      "text": "I like the fire screen. Looks very nice against my fireplace. And it arrived quickly. However, the shipping packaging was less than unsatisfactory. Box was thin and arrived a little smooshed; the fire screen has glass and the glass was not wrapped in any bubble wrap or cardboard (I'm surprised it did not break) and two pieces of the glass were floating around in the box. Although I like the product, I may think twice about having something shipped to me from Plow and Hearth.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 17,
      "publication_date": 20130926
    },
    {
      "title": "This product looks even better in person",
      "text": "This product looks even better in person. The glass really adds a nice effect. Product is sturdy and well built.",
      "rating": 5.0,
      "verified": true,
      "author": "GMR",
      "helpful_votes": 0,
      "publication_date": 20141211
    },
    {
      "title": "Large Two-Door Tubular Steel Fire Screen with tempered Glass",
      "text": "Love the fire screen, and would recommend it to others. It adds a lot to our living room area. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron G.",
      "helpful_votes": 2,
      "publication_date": 20131002
    },
    {
      "title": "great product.",
      "text": "this came when they said it would. It was packaged well. It was vey easy to put together and made our fireplace look exspencive. A great product for a reasonable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Harvey",
      "helpful_votes": 2,
      "publication_date": 20130522
    },
    {
      "title": "nice looking but miss leading description.",
      "text": "I thought the doors were glass with wire behind them. They are not. Miss leading on the description. I wanted more glass to help keep the heat from going up the chimney. Doors for our older fireplace are so expensive. The only glass on this screen are in the middle around the doors. Wasn't what I wanted but we kept it. Sturdy, really nice looking and shipment was quick. Really like how it looks on the fireplace.",
      "rating": 4.0,
      "verified": true,
      "author": "JBA",
      "helpful_votes": 19,
      "publication_date": 20131210
    },
    {
      "title": "GREAT FIRESCREEN!",
      "text": "This is a beautiful fire screen for the money. The glass insets are a \"plus\" to this screen. It is just what we were looking for at a fraction of the price we saw elsewhere. I recommend it to anyone looking for an expensive looking firescreen at a minimal cost.",
      "rating": 5.0,
      "verified": true,
      "author": "dmclellan",
      "helpful_votes": 24,
      "publication_date": 20121231
    },
    {
      "title": "The unit looks nice enough but I was expecting glass to cover the ...",
      "text": "The unit looks nice enough but I was expecting glass to cover the entire surface as my goal of this was to keep cold air from coming in and warm air from escaping. Very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Two Stars",
      "text": "Very light weight and not well made. The glass is not attached well and there are broken parts.",
      "rating": 2.0,
      "verified": true,
      "author": "Carole",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "Really nice fire screen",
      "text": "I bought this for my fireplace. When it arrived the doors did not stay closed properly because of the magnets not lining up. I called plow and hearth and they said to send it back for replacement. In the days that followed I punched some magnets at the hardware store and fixed it myself. Plow and hearth gave me a credit for my trouble and the cost of the magnets. That being said, I really love this screen and it really looks nice against the fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "margaret e. wilson",
      "helpful_votes": 5,
      "publication_date": 20150407
    },
    {
      "title": "Well made and very nice looking",
      "text": "this fireplace screen is very well-made and looks great. It was the perfect size for my large family room fireplace. The glass is well-made and does not get too hot. The magnetic closure for the doors are easy to open but stay firmly in place when they are closed. Some other reviewers are worried about the welds on the outside of the grades. These do not detract from the overall look and are very well placed/hidden. Overall I am very happy with this product. I would highly recommend this. I am looking to buy another one. I hope this helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "I love this fireplace screen",
      "text": "I love this fireplace screen. The magnetic doors stick well and the screen prevents any sparks or coals from landing outside of the fireplace. The only down side is that you have to either set it up as recommended with legs on the front and back, but this means it will rest a few inches away from your fireplace. Or, as I did, you put just the front legs on so it sits flush with your fireplace, but that means if you move it, it won't stand on it's own. It does, however, stay in place with weight balanced between the fireplace and the front legs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Bought a “used/acceptable” Plow & Hearth small fireplace screen and I’m very very satisfied with the condition and the quality of the product ...",
      "text": "Very well made product. Bought a “used/acceptable” Plow & Hearth small fireplace screen and I’m very very satisfied with the condition and the quality of the product purchased from the Amazon warehouse. Been a Amazon Prime member since 2009. Absolutely love buying from Amazon. Excellent customer service. I was very comfortable with ordering this fireplace screen used because Amazon always backs-up their products with total satisfaction. Love this fireplace screen. Excellent product and totally satisfied with thick metal and very sturdy product.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Not bad, the soldering was a little sloppy",
      "text": "Not bad,the soldering was a little sloppy, but the doors work well and it's attractive. I didn't install the inside bottom brackets since I wanted the screens to rest flush against the fireplace. I have a see through fireplace, so these screen solved a safety concern I had with my fireplace. The packaging was secure. I included pictures of both sides of the fireplace.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy camper",
      "helpful_votes": 4,
      "publication_date": 20161112
    },
    {
      "title": "... screen and searched high and low for something I'd love, and this is it",
      "text": "I needed a fireplace screen and searched high and low for something I'd love, and this is it! It's sturdy, substantial and can be easily moved completely out of the way, if you want full access to clean inside your fireplace,if you're not using gas logs. The doors open and close smoothly, and the magnetic latch is perfect--it keeps the doors securely closed, which is important for safety. The glass inserts are highlighted when there is a fire and look amazing. It was extremely difficult to find a screen that would look stunning with a small fireplace while maintaining a budget. Do not pass this one up; I'd buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "RHONDA",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Excellent and durable screen!",
      "text": "We bought this screen for a fireplace in our child’s playroom and couldn’t be happier! It is extremely sturdy and looks great. It does a fantastic job protecting our daughter (and her friends) from touching the hot glass, and also protects the glass from flying objects (it is a playroom after all). It was very well packaged and easy to assemble.",
      "rating": 5.0,
      "verified": true,
      "author": "MASH Polson",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Easy to assemble",
      "text": "Easy to assemble and looks great. I was a little concerned after a few of the reviews I saw, but I my experience was a good one. Packed well, nothing broken or damaged, easy to assemble, and looks great. Best of all, it is stopping my cat from playing in the fireplace!!!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Riechert",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Images listed does not match product received.",
      "text": "Item arrived today with various scratches and a few things that do not match the listing here. First, the handles are not sturdy welded on, as they show in the listing, they are very cheap looking screw on handles. The quality of the item received does not match what is shown here in the listing images. In the image I posted, left is what’s advertised here, right is what you receive. Same can be said for the hinges and general quality.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "It does the job!",
      "text": "This item is what I expected it to be. So far time will tell how it holds up, and have no reason to believe otherwise at this point. We have made several fires, and the doors open and close easily. The pieces is well balanced and I have never been concerned that it will tip over. It sets up tight to the perimeter of the fireplace, and I like the glass inserts as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Fugmann Brongo",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Rusted!",
      "text": "I live in Alaska so the cost to ship this product back isn’t worth it. Very excited to receive this item; opened up the packaging and item was literally covered in rust, within the plastic packaging. I waited a long time to buy this item so my disappointment is running rather deep.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Attractive and easy to assemble",
      "text": "Well packaged. No damage. Very easy to assemble. Tighten four nuts with the included wrench. I can't use the back braces because hearth is raised, but screen is flush against the facade. That is plenty of support.",
      "rating": 5.0,
      "verified": true,
      "author": "David M. Cordell",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Good value",
      "text": "Very pleased with this screen. Not burning real wood (gas/glass chips), but just for safety. Looks nice/clean finish.",
      "rating": 5.0,
      "verified": true,
      "author": "JR in OC",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Looks beautiful",
      "text": "This Fire Screen looks stunning in front of the fire place at our cabin. Be sure to measure the inside of the fire box as this one, I hadn't even thought about the inside bars. Looks beautiful when the fire is burning! The picture was a little deceptive as it looked like the outside glass was amber colored, but not so, it is clear.",
      "rating": 4.0,
      "verified": true,
      "author": "bbucks",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Beautiful Fireplace Cover",
      "text": "Beautiful, simple design. Very easy to put together. Took me about 5 minutes to assemble. Sturdy and functional. The doors stay closed with a strong magnet. So happy I purchased this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley S.",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Who gets compliments on their fireplace grate?? This ...",
      "text": "Who gets compliments on their fireplace grate?? This is really a gorgeous product and worth every penny. It's also very sturdy--a very determined toddler could probably knock it down (if you don't secure the base), but dogs/vaccuums/etc won't bother it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Redd",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "It looks elegant and expensive!",
      "text": "I love this!!! It's pretty much plain which makes it look expensive and elegant. It was very easy to put the legs on and that was all that had to be put together!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Carpenter",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Add a little charm to your fireplace",
      "text": "I looked everywhere for fireplace doors to fit an oversized fireplace. These were the closest I came and I ddn't need to compromise - these are stunning. Love the patterned glass in the doors. They are sturdy, well-built and beautiful to look at!",
      "rating": 5.0,
      "verified": true,
      "author": "Gopher Gal",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Nice product, had a slight issue but overall",
      "text": "Nice product , had a slight issue but overall nice",
      "rating": 5.0,
      "verified": true,
      "author": "jjans",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "looks good but all the weld points are on the front",
      "text": "looks good but all the weld points are on the front. I called there customer service but they did not seam to care... they looked up the reviews and said \"yes, that's what most of the bad reviews are about\". hmmmm",
      "rating": 3.0,
      "verified": true,
      "author": "LDK",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Superb product.",
      "text": "Great product that looks nice and will last a long time. Very pleased with purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie L. Gesner",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "otherwise it's a very nice piece.",
      "text": "Arrived with glass broken, otherwise it's a very nice piece.",
      "rating": 4.0,
      "verified": true,
      "author": "Monique Sikich",
      "helpful_votes": 2,
      "publication_date": 20160621
    },
    {
      "title": "very nice",
      "text": "it is very nice and the right size for my fireplace love it if I had another fireplace I would order another one",
      "rating": 5.0,
      "verified": true,
      "author": "Phanorris C Artis",
      "helpful_votes": 3,
      "publication_date": 20130822
    },
    {
      "title": "Four Stars",
      "text": "Doesn't stay closed as good as I'd like. Needs a stronger magnet up top.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Pollard",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Beautiful! Not hard to put together (my13 year old ...",
      "text": "Beautiful! Not hard to put together (my13 year old son put it together). Really updates a dated FP!",
      "rating": 5.0,
      "verified": true,
      "author": "texaspeeps",
      "helpful_votes": 2,
      "publication_date": 20140919
    },
    {
      "title": "Great quality!",
      "text": "The glass feature is lovely. This is very well made and we are really happy with the appearance. The picture does it justice. The glass seemed loose when it arrived, but little tabs along the back make securing it easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly J.",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Five Stars",
      "text": "Love love love. Easy to put together. No issues at all. Would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "myracle777Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Well pleased.",
      "text": "Quick delivery, no damage, quality construction, easy to assemble (15 minutes), beautifully accents my fireplace & great room. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Hendon",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "I am pleased with this product",
      "text": "I am pleased with this product. It made my old fireplace look great. I left off the stabilizing legs for the back so that it is flush with the fireplace.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Fit just right and looks good. It was a gift to my daughter and ...",
      "text": "Fit just right and looks good. It was a gift to my daughter and son in law and they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Rubio",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Sturdy, good looking design.",
      "text": "It has a smple design, looks great, doesn't overwhelm the rest of my decor. Have gotten plenty of complimen r so on it.",
      "rating": 4.0,
      "verified": true,
      "author": "MR",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "packaging was terrible, but the screen was unbroken and fit perfectly",
      "text": "As reported, packaging was terrible, but the screen was unbroken and fit perfectly. It is large enough to fit our fireplace and looks awesome.",
      "rating": 4.0,
      "verified": true,
      "author": "Deb L.",
      "helpful_votes": 0,
      "publication_date": 20151023
    },
    {
      "title": "Practical Fireplace Screen",
      "text": "We like the way it looks and fits our fireplace opening. When we first received the screen and parts, our glass fell out of its panel, but did not break. Think the pieces should packaged better.",
      "rating": 5.0,
      "verified": true,
      "author": "billiejo",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Five Stars",
      "text": "Love this product, it is exactly as it appears in the photo. Works wonderfully and enhances our fireplace nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Five Stars",
      "text": "Looks just as beautiful in person as in the picture. Very happy with product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "LOVE THIS",
      "text": "Thought would be too big - - NOPE, Perfect Size. The first one came with some broken glass, but they replaced it in no time! They were very friendly, will order from there again.",
      "rating": 5.0,
      "verified": true,
      "author": "Extreme Shopper",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "screen looks like it has glass in all openings but has screen ...",
      "text": "screen looks like it has glass in all openings but has screen in many, I altered it for my use",
      "rating": 4.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20150227
    },
    {
      "title": "Perfect",
      "text": "This screen is exactly what I was looking for. Its very heavy and very sturdy. A perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 20,
      "publication_date": 20151002
    },
    {
      "title": "Great",
      "text": "Fit perfect. Easy assembly. If u are looking for a two door oppenning then go for this . It fits flush.",
      "rating": 5.0,
      "verified": true,
      "author": "FRANK C",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "I love it. It is exactly as described and was ...",
      "text": "I love it. It is exactly as described and was just what I wanted. I love the mix of glass and mesh.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora K.",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Tempered glass prevents the flow of heat from the fire place",
      "text": "Everything is OK for this screen, but the tempered glass on top of the screen prevents the flow of the heat. The screen looks good too, but with this minor design flow. I have to pull back the screen about 3 inches away from my fireplace for the heat to flow correctly. I thought the tempered glass is pretty, but it actually not noticeable at all. I would buy one without no tempered glass.",
      "rating": 4.0,
      "verified": true,
      "author": "johnandroid",
      "helpful_votes": 8,
      "publication_date": 20130519
    },
    {
      "title": "Absolutely beautiful. It fit perfectly",
      "text": "Absolutely beautiful. It fit perfectly, was easy to set up, and makes it much easier to build a keep a fire because of the doors. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "ArubaFam",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "One Star",
      "text": "fire shot through the screen on this ,the material was cheap I had to get rid of it",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151204
    }
  ],
  "product_meta": {
    "title": "Plow & Hearth Small Fireplace Screen with Hinged Magnetic Doors, Tubular Steel Frame, Tempered Glass Accents, Metal Mesh, Free Standing Spark Guard, Decorative Design, Matte Black Finish, 38 W x 31 H",
    "rating": 4.5,
    "feature_bullets": [
      "TEMPERED GLASS INSETS - Three glass panels shine in the firelight and add elegant style to any hearth",
      "TWO-DOOR DESIGN - Hinged, straight-top doors with handles add safety and convenience; magnetic latch for a secure closure",
      "FLAT GUARD SAFETY - Firescreen fits flush against hearth for best protection; front and back feet offer stability, even on uneven hearths",
      "FUNCTIONAL & DECORATIVE - Classic fireplace screen is elevated with glass panels for beauty in any season; scroll front feet add to the look",
      "TUBULAR STEEL & HEAVY-DUTY MESH - Lightweight, durable, long lasting construction; black powder-coated finish"
    ],
    "specifications": {
      "Product Dimensions": "42 x 34 x 3.9 inches",
      "Item Weight": "25.2 pounds",
      "Manufacturer": "Plow & Hearth",
      "ASIN": "B005FNJ6RU",
      "Customer Reviews": "4.5 out of 5 stars165 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#571,705 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Warranty Description": "A_gen_tax.",
      "Batteries Required": "No",
      "Included Components": "Child"
    },
    "categories": [
      "Stove & Fireplace Accessories",
      "Home & Kitchen",
      "Parts & Accessories",
      "Heating, Cooling & Air Quality",
      "Fireplace Screens"
    ],
    "price": 199.95
  }
}