{
  "website_summaries": [
    {
      "verdict": "Not only does this concealer and pencil combo hide tattoos well, it also works wonders for blemishes and under-eye circles.",
      "pros": [
        "Available in six colors",
        "Fairly inexpensive",
        "Includes a liquid and stick concealer",
        "Long-lasting",
        "Easily blends into skin"
      ],
      "cons": [
        "Shade selection could be more inclusive"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "BEST COVERAGE I HAVE FOUND YET----PERFECT FOR ME",
      "text": "The color I bought blends invisibly, and the pencil that comes with it is indispensable when using under eyes. I bruise easily, and that is what I bought this product for, but now I use it for concealer on my face too. I tried other, more expensive products trying to get total coverage that looked natural, and Hard Candy is the only one that works for me. I'm so happy that I found this. Very easy to apply; you don't have to do a lot of blending. I recommend it to anyone looking for a heavy-duty concealer for hard-to-cover age spots, scars, tattoos, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "MinOregon",
      "helpful_votes": 2,
      "publication_date": 20170730
    },
    {
      "title": "Good enough. . .",
      "text": "This makeup worked good enough for me. The tattoo was slightly visible through it but it covered mostly. I just needed to cover a tattoo for work so it doesn't have to be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Sara Faulkner",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "It would look great on someone with very fair skin",
      "text": "The product definitely is full coverage. It stays put all day. But I wouldn't call this color \"medium\". It would look great on someone with very fair skin, but on my tan skin iIt looked like I was rubbing white paste on my face.",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole James",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Not covering my tattoo...",
      "text": "I ordered this concealer to cover up a tattoo for my wedding. Shipping took about a week which was fine. I tried it out today and it makes my tattoo lighter, but you can still obviously see it. It seems fine as a regular concealer, although it doesn't really match my face color so I personally won't use it for that, but I don't think it's going to work out for my tattoo cover up. Going to look for something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Melanie W",
      "helpful_votes": 2,
      "publication_date": 20140623
    },
    {
      "title": "Nope",
      "text": "Did not cover my tattoo for the wedding. Only made it look like there was make up gobbed on it!",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Works well for price",
      "text": "Purchased to cover a pigmented mole on my face. Works very well upon application, but it does not cover all day. Would still purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "Elise",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Great product for under eyes circles or covering birthmarks or tattoos.",
      "text": "Great product for under eyes circles or covering birthmarks or tattoos.",
      "rating": 5.0,
      "verified": true,
      "author": "BeckyW",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "I wanted a heavy duty concealer that this stuff is ...",
      "text": "I wanted a heavy duty concealer that this stuff is VERY heavy duty. It stays on really well too. Actually a little more coverage than i was looking for so i use it rarely. If you have dark areas or something that requires a lot of coverage this will definately do the job.",
      "rating": 3.0,
      "verified": true,
      "author": "stefanie n jones",
      "helpful_votes": 2,
      "publication_date": 20150911
    },
    {
      "title": "Good for covering tattoos.",
      "text": "This product runs extremely light. I needed medium, and I would consider myself pretty fair. However, it really works for covering tattoos. I cover tattoos on my thumbs, and it doesn't crease or transfer. Awesome stuff. Better than Dermablend, and cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison W.",
      "helpful_votes": 3,
      "publication_date": 20150517
    },
    {
      "title": "Works great!!",
      "text": "This concealer is amazing. You only need the smallest amount because it's so thick and it covers well. It won't crease under your eyes as long as you set it with a powder. I think I should have ordered a light/medium instead of medium, but it still works good for me!",
      "rating": 5.0,
      "verified": true,
      "author": "eyezayuh",
      "helpful_votes": 2,
      "publication_date": 20140428
    },
    {
      "title": "Good coverage.",
      "text": "Covers well but kinda thick which is fine. Don't use it every day.",
      "rating": 4.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Great concealer pencil!",
      "text": "I mainly buy this because of the concealer pencil because it outlines eyebrows and, lips precisely.",
      "rating": 5.0,
      "verified": true,
      "author": "Lizbeth",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "I purchases to cover a mole on my face,",
      "text": "I purchases to cover a mole on my face, the mole is not dark at all but still did not cover it",
      "rating": 3.0,
      "verified": true,
      "author": "DM",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Great product. I bought the expensive stuff from (not ...",
      "text": "Great product. I bought the expensive stuff from (not sure I can say that company n still have it post) but u get the point.... n this works every bit as good for under half the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Tkat",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Just like a designer brand",
      "text": "I was looking for a concealer similar to it cosmetics . This one works great at 1/5 of the price",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle James",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Not what I expected",
      "text": "Way too light for medium/deep skin as the description stated. This product was also very watery not heavy duty coverage like I was expecting and what it claims to do. Catchy name though I give em that :)",
      "rating": 1.0,
      "verified": true,
      "author": "Jazzy Jazz",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "this is a great cover up for small blemishes",
      "text": "this is a great cover up for small blemishes. I use it to cover my splotchy red neck/chest, then dust with a little loose bronzer. Also helps to use a little lotion when you apply it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "Ehhh...",
      "text": "This did not cover my tattoo at all. It just looked like a heavy duty concealer that made my tattoo stick out even more. Still looking for the right one...",
      "rating": 2.0,
      "verified": true,
      "author": "LPN78",
      "helpful_votes": 0,
      "publication_date": 20140409
    },
    {
      "title": "Thick Make Up",
      "text": "it is just thick and gooey and hard to apply and there is no way it looks real, or that I would leave the house with it on.",
      "rating": 2.0,
      "verified": true,
      "author": "Debbie Pilgrim",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "I love it.",
      "text": "I like a this concealer for my undereye and I like a flawless look and this does just the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Sophia",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "love this stuff",
      "text": "This is my go to heavy duty concealer......love this stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Schlenker",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Four Stars",
      "text": "Very thick, does the trick well for covering blemishes, just make sure to blend well. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacie Brooke",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "It was a bit dark on my skin and I ...",
      "text": "It was a bit dark on my skin and I am NC20 in MAC. Also the pencil was smashed in and I could not use it.",
      "rating": 2.0,
      "verified": true,
      "author": "jasmin",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Great buy!!!",
      "text": "By far my favorite under eye concealer!!! I have told all my friends and they have also loved it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Horrible",
      "text": "AWFUL, just awful.... no other way to say it...thick, cakey....hard to apply...color is WAY off....ugh.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauram424",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "Five Stars",
      "text": "Amazing coverage. Kinda thick. A little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "N s l",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Wrong",
      "text": "I bought this to cover up my arm tattoos and it did not work, it is way too light even after several applications.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer Georges",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "Quick shipping",
      "text": "The makeup was shipped quickly, but did not work to cover up my tattoo. I have a small tattoo on the top of my foot and wanted to cover it up for work. Unfortunately the product simply looked like a pile of makeup rubbed into the top of my foot. It didn't cover anything either. I would not buy this product again. I was pleased with how quickly it came and the pleasant smell the product had.",
      "rating": 3.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Great!!",
      "text": "Absolutely love this concealer it's so pigmented you only need a little and it goes a long way. It also works great with highlighting and looks great with flash photography.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Lens-Leon",
      "helpful_votes": 0,
      "publication_date": 20131209
    },
    {
      "title": "Amazing",
      "text": "I have EXTREMELY dark circles, and most days, this is allI need to leave the house. Nothing I have ever tried works as well. And I have tried it all. Covers dark circles and blemishes too.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Edmiaston",
      "helpful_votes": 3,
      "publication_date": 20130716
    },
    {
      "title": "THIS STUFF IS AMAZING. IT WILL COVER UP ANYTHING",
      "text": "THIS STUFF IS AMAZING. IT WILL COVER UP ANYTHING. the only issue is it has a strong smell, but a lot of other makeup does as well, and it can rub off even though it lasts, so I recommend using a setting spray!",
      "rating": 5.0,
      "verified": true,
      "author": "Hoda",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "I seriously use a tiny amount for both eyes- like smaller than a nail head amount",
      "text": "Works wonders! As a new mom I'm always tired! This really covers my puffy bags and dark circles under my eyes. It is a little thick so be careful not to use too much or it looks caked on. I seriously use a tiny amount for both eyes- like smaller than a nail head amount! It will last me forever! It does run really really light so order darker. I ordered one shade darker but should have went two!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "awesome",
      "text": "cover everything . been using this for a while now . and it met my expectation . all the redness and some spots that is not even its gonna be all gone .. and it has a good amount inside",
      "rating": 4.0,
      "verified": true,
      "author": "erika",
      "helpful_votes": 0,
      "publication_date": 20140322
    },
    {
      "title": "Wouldn't call it heavy duty",
      "text": "I was disappointed with this. I felt like it kind of just slid off of my skin. Not worth it!",
      "rating": 2.0,
      "verified": true,
      "author": "Aubrey Vande Velde",
      "helpful_votes": 0,
      "publication_date": 20130628
    },
    {
      "title": "Decent Coverup",
      "text": "Product tends to get gummy on my skin; I've found I have to put on moisturizer or oil before using. That being said, it does cover pretty well. I am using it to cover a tattoo, and while the tatt won't disappear it does fade enough that I am satisfied with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Treebeard",
      "helpful_votes": 7,
      "publication_date": 20130426
    },
    {
      "title": "Bought it as a gift for my sister who is a makeup junkie",
      "text": "She read about it on all the makeup guru pages and couldn't find it overseas. Bought it for her and she says it rocks. If she says it rocks, it rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "VibrantStar",
      "helpful_votes": 8,
      "publication_date": 20130102
    },
    {
      "title": "Great coverage",
      "text": "Excellent product and price. A little goes a long ways. Covers sun freckles. Has a pencil to just dab on tiny areas",
      "rating": 5.0,
      "verified": true,
      "author": "Karen DeBenedictis",
      "helpful_votes": 0,
      "publication_date": 20140315
    },
    {
      "title": "HCC heavy duty concealer",
      "text": "It does not cover up tattoos! It said it would cover up, it lied. I would NOT recommend it. I hate this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "just ok",
      "text": "i read about this on a famous magazine i have to try it , but is not what i expected too thick and the color is way off im from PR my skin is yellow but im fair skin i do not take any sun kim kardashian uses this color so i try the same color but it didn't work for me maybe for a more dark person or very tan .",
      "rating": 2.0,
      "verified": true,
      "author": "shoelover",
      "helpful_votes": 0,
      "publication_date": 20120703
    },
    {
      "title": "Not a Tattoo-Covering Concealer",
      "text": "I bought this because it was recommended to me as a tattoo cover-up. It's not the best, but with the price I can't complain. I will be using it in my regular make-up routine, but if you are looking for a tattoo cover up, I suggest investing in a concealer of higher quality (aka Dermablend). It shipped on time and got here really fast! Thank you!",
      "rating": 3.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Blends well!",
      "text": "It's OK, but I have Melasma due to being on medications after several surgeries and it doesn't cover as well as I thought it would. The pencil works better. It's good if you don't have very dark spots. It does blend in well.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela M.",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "It's pretty good. I was gonna use it to cover ...",
      "text": "It's pretty good. I was gonna use it to cover up a tattoo but I use it to clean up my eyebrows. It's amazing. A little bit goes a long way!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Lopez",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Absolutely recommend!",
      "text": "This product is amazing , it truly is heavy duty concealer that really hides your imperfections!",
      "rating": 5.0,
      "verified": true,
      "author": "ms sunshine",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "Where'd that mark go?",
      "text": "Can't say enough about this concaler. I use it for blemishes and to cover a small tattoo I have on my ankle. Works like paint, and you only need a tad. Came with a pen that is just amazing too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sinnthia",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "Ok",
      "text": "Used it to cover a tattoo on my foot. It was 75% covered, but still pretty easily seen if you looked directly at my foot.",
      "rating": 3.0,
      "verified": true,
      "author": "jovigirl214",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Great but definitely a lot darker than I would have ...",
      "text": "Great but definitely a lot darker than I would have expected. Got it to cover up a tattoo temporarily.",
      "rating": 4.0,
      "verified": true,
      "author": "7CentCricket",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "i really do like this a little goes a long way and it ...",
      "text": "i really do like this a little goes a long way and it lasts allday as well as in general. i will but this again. really good concealer especially for the under the eyes",
      "rating": 5.0,
      "verified": true,
      "author": "Laura marino",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Unbelievably good",
      "text": "I have heavy acne and scarring and dark spots. This is the only product that has ever covered everything without being noticable!! I've already re-ordered.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelle",
      "helpful_votes": 0,
      "publication_date": 20150526
    },
    {
      "title": "i love it",
      "text": "Wonderful, that counselor can cover the black freckles and tattoos and scars.",
      "rating": 5.0,
      "verified": true,
      "author": "darinehoney",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "Really disappointed by the quality as the product is highly rated",
      "text": "This color is not just too dark, but not even a natural tone. Really disappointed by the quality as the product is highly rated.",
      "rating": 1.0,
      "verified": true,
      "author": "ashleigh christopher",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "they could never come up with a better name than glamoflauge",
      "text": "This product is a lifes saver, they could never come up with a better name than glamoflauge. AWESOME!",
      "rating": 5.0,
      "verified": true,
      "author": "Luz R.",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "does what it says!",
      "text": "bought this for my daughter to cover an ink tatoo on the back of her neck. When she needs it, it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Squire",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "This product was way better than I expected",
      "text": "This product was way better than I expected. It works perfectly with my skin, and was a perfect match for tone.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Vondal",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Much too dark for my skin",
      "text": "Product came MUCH DARKER than expected. I have fairly pale skin.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda Walton",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "Five Stars",
      "text": "This product is excellent and arrived in very good time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rossmery Gavilanez",
      "helpful_votes": 0,
      "publication_date": 20141015
    },
    {
      "title": "not so much",
      "text": "This stuff is aweful. It's goopy and doesn't cover any better than a regular concealer, in fact I get better coverage from my regular concealer.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Biller",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Good coverage",
      "text": "My favorite part of this concealer is that it takes the tiniest amount to cover my rosacea",
      "rating": 5.0,
      "verified": true,
      "author": "satisfied buyer",
      "helpful_votes": 0,
      "publication_date": 20140814
    },
    {
      "title": "Three Stars",
      "text": "good coverage but way lighter than advertised. not impressed and will buy from Sephora in the future.",
      "rating": 3.0,
      "verified": true,
      "author": "ctz",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Five Stars",
      "text": "Awesome product! It conceals redness without looking too \"cakey\" like other products.",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "Im In Love!",
      "text": "Im in love with this concealer! it does its job. covers all the dark spots! also helps my eyebrow with the shape when I fill it in!",
      "rating": 5.0,
      "verified": true,
      "author": "Nini",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Stays forever, but doesn't necessary hide dark, purple under eye circles",
      "text": "It's okay. The pencil that comes with it is surprisingly awesome....ad for me and my super dark purple under eye circles...I'm not so sure this helps. But it stays!",
      "rating": 3.0,
      "verified": true,
      "author": "megaton",
      "helpful_votes": 0,
      "publication_date": 20141029
    },
    {
      "title": "I love this concealer",
      "text": "I love this concealer! It arrived pretty quickly. It sure does the job! Goes on smooth as well but a little goes a long way. I love it, its perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Carina",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "Tattoo coverage",
      "text": "Worked great for covering my dark tattoo in conjunction with Hard Candy Glamoflauge HEAVY DUTY CONCEALER with pencil (MEDIUM TAN color).",
      "rating": 5.0,
      "verified": true,
      "author": "Leah Gray",
      "helpful_votes": 0,
      "publication_date": 20131105
    },
    {
      "title": "hard candy",
      "text": "others said light too light well the medium is too dark and not the color of any complexion. tried mixing with a bb moisturizer did not help. Covered dark spots no beter than a regular concealer.",
      "rating": 3.0,
      "verified": true,
      "author": "joanne s swartz",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "Two Stars",
      "text": "Didn't do what I needed it to do, which was to conceal some small tattoos.",
      "rating": 2.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Works Well, Priced Well",
      "text": "For the price, this is a very nice concealer. It does tend to cake up around my eyes, though, and make me look a little chalky. I do like the texture in general for other parts of my face. It's good at covering blemishes because it's so thick. The little pencil is nice but you can't really use it on zits because it's too pointy (ouch). I think it's priced fairly and gets the job done.",
      "rating": 4.0,
      "verified": true,
      "author": "SaMi",
      "helpful_votes": 0,
      "publication_date": 20130227
    },
    {
      "title": "I loved the pencil it came with more than the concealer",
      "text": "I loved the pencil it came with more than the concealer. I thought the concealer was very watery like a foundation vs a concealer.",
      "rating": 3.0,
      "verified": true,
      "author": "Merci B.",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "Did not cover as Expected!",
      "text": "This item was a waster of money! I purchased it to cover a small tattoo and it did not work at all...Just called more attention to what I was trying to cover.",
      "rating": 1.0,
      "verified": true,
      "author": "jaggirl",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "Not the best concealer for tattoos",
      "text": "I gave it a 3 stars because it came well pack and on time. How ever is not the best BY FAR concealer for tattoos. I have tried another brand that DEFINABLY beast this product. And the medium color wasn't even close to my skin tone. I will use this for pimples if I have any or mix it with another lighter color concealer.",
      "rating": 3.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20130228
    },
    {
      "title": "I love it!",
      "text": "This stuff works GREAT! It cover blemishes, and dark spots just the way I imagined it to! Awesome, awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina F. Yoakum",
      "helpful_votes": 10,
      "publication_date": 20130522
    },
    {
      "title": "Dry",
      "text": "Somewhat dry to apply. okay if you use moisturizer or a silky primer first.",
      "rating": 3.0,
      "verified": true,
      "author": "Debbie Carter",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "The worst concealer",
      "text": "I read all these reviews about this and I was reluctant to try it. I decided let me give this a try. It's horrible. Big mistake of a purchase",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Selman",
      "helpful_votes": 0,
      "publication_date": 20140116
    }
  ],
  "product_meta": {
    "title": "Hard Candy Glamoflauge HEAVY DUTY CONCEALER with pencil (Medium 313)",
    "description": "Medium 313;A heavy-duty, multi-use concealer that provides ultimate coverage;Formula blends flawlessly into skin;Hide everything from dark circles and blemishes to tattoos;Concealer: 0.71 oz; pencil: 0.023 oz",
    "rating": 3.9,
    "feature_bullets": [
      "Hard Candy Glamoflauge Heavy Duty Concealer Medium"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4.3 x 1.2 x 0.9 inches; 0.35 Ounces",
      "Item model number": "313",
      "UPC": "676045603133 885596122233 885193019868 798627793831 794437051758 885573253288 785479319654 781549935021",
      "Manufacturer": "Hard Candy",
      "ASIN": "B005JPBFBY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Concealers & Neutralizers",
      "Face",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}