{
  "website_summaries": [
    {
      "verdict": "This is a rugged, attractive, high-quality timepiece for men seeking a more informal-looking watch with a non-metal band, but who wish to retain well-made workings and an upscale, fashionable look.",
      "pros": [
        "Water-resistant to 300 feet (100 meters)",
        "Suitable for swimming and snorkeling",
        "Stitched leather band",
        "Comfort and style from the storied Victorinox brand",
        "Swiss automated movement",
        "Illuminated hands, numbers, and hour markers provide ability to see in dim light",
        "High-quality leather band available in brown or black, which matches well with the gunmetal-colored case",
        "Sturdy and durable",
        "We like the 2-year warranty"
      ],
      "cons": [
        "Some owners have had problems with the date mechanism working correctly",
        "Warranty on this model only available if you purchase from Amazon"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "ETA 7750 movement at a reasonable price!!!",
      "text": "Just arrived and I can't stop looking at it! Feels amazing on the wrist! In my impression, this is the best looking mechanical chronograph in Victorinox's lineup! go ahead and pick this up if you are looking for a mechanical chronograph from a reputable watch brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Vinit",
      "helpful_votes": 2,
      "publication_date": 20170203
    },
    {
      "title": "Love it!",
      "text": "Love it!! I had been eyeballing this watch for some time but hadn't purchased it because of the price tag. However, I finally did and am I glad I did. It's worth every single penny. Quality is amazing, and the vintage look it has is even better in person than it is in the pictures. A definite must buy for any watch enthusiast.",
      "rating": 5.0,
      "verified": true,
      "author": "Ram333",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Outstanding Value for the Money",
      "text": "You will not be dissapointed with this watch! The pics do not do it justice. In fact I find the design smarter than their more expensive Air Boss models. The detail on the dial is awesome and the ETA engine is normally found in watches that are 10 times the price.",
      "rating": 5.0,
      "verified": true,
      "author": "kupajo",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Such a balanced watch",
      "text": "Excellent product, which looks good on your wrist. Strap colour blends in so well with the gun-metal case. So pleased to have purchased this watch",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Keighley + Rachael Keighley",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Quality Timepiece",
      "text": "This timepiece is gorgeous. Good heft, quality build, and the name you can trust. This is the most recent Victorinox watch I have purchased and my second automatic. However, this is the first automatic with the see through case back and I can tell you its mesmerizing to view the movement. The anti-reflective coating does well but there is still reflection from the metal on the hands as its is very polished. The lume coating on the hands and markers is also very impressive. Good Job Victorinox!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian P.",
      "helpful_votes": 6,
      "publication_date": 20150729
    },
    {
      "title": "Five Stars",
      "text": "Pretty, the size and the weight is excellent Authomatic with price good",
      "rating": 5.0,
      "verified": true,
      "author": "Marcelo Solano",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Beautiful watch. I've owned quite a few victorinox watches ...",
      "text": "Beautiful watch. I've owned quite a few victorinox watches and this one is my favorite by far. Extremely accurate for an automatic. Only off a couple of seconds over an entire week.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Holter",
      "helpful_votes": 2,
      "publication_date": 20150402
    },
    {
      "title": "Unique craftsmanship",
      "text": "A beautiful watch with wonderful movement. Really in love with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Javaid iqbal",
      "helpful_votes": 2,
      "publication_date": 20170820
    },
    {
      "title": "Five Stars",
      "text": "Nice design, best machine, casual and sport and good price.",
      "rating": 5.0,
      "verified": true,
      "author": "JCM",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Smaller than a typical 44mm watch",
      "text": "I like everything about this watch except the size. The 44mm case measurement is from the case edge to the outside of one of the long chronograph buttons making it much smaller than a typical 44mm watch. I returned it which is too bad since it is a very nice watch.",
      "rating": 4.0,
      "verified": true,
      "author": "Rik",
      "helpful_votes": 2,
      "publication_date": 20160719
    },
    {
      "title": "Awesome gorgeous watch!",
      "text": "This is a gorgeous watch, it looks so much better in person than in that horrible picture and fits perfectly on my wrist, even though I'm a little big haha. It's an awesome awesome awesome watch!! Automatic, 25 jewels, swiss made, 44 mm case. What else do you want? Oh and the price is a win win!",
      "rating": 5.0,
      "verified": true,
      "author": "José Abraham López Arciniega",
      "helpful_votes": 4,
      "publication_date": 20170329
    },
    {
      "title": "Classy, Sexy & Playful!",
      "text": "I bought this watch for my Husband for his birthday! We found it at a local jewelry store for $1800 and came home and checked Amazon where we found it for $1200!! It's the first watch I have ever seen that doesn't require batteries, it is soo cool to see the inner mechanics through the back side! We love it!! It is classy and playful! Very Sexy!! I know there are other brands similar that are upward of $3-4,000... I don't see the point of paying so much when you can have this one!!!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Martinez",
      "helpful_votes": 2,
      "publication_date": 20121018
    },
    {
      "title": "Tic Tac",
      "text": "Buy once and buy well is a good credo. This piece is perfect for cocktails and for rough outdoors. Dressy. Stylish and better yet: With a life of its own... non battery dependent.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Klaus",
      "helpful_votes": 2,
      "publication_date": 20121010
    },
    {
      "title": "Recurring Problem with Date Mechanism",
      "text": "Love the watch size, appearance, functionality, etc. However, the date mechanism is troublesome. Had my first watch in the shop for 8 weeks due to inability to manually change the date. Dealer replaced with new watch, but 3 weeks later the same problem has occurred. Hate to give up on this watch, but expect more from a watch at this price.",
      "rating": 3.0,
      "verified": false,
      "author": "Daniel Patton",
      "helpful_votes": 7,
      "publication_date": 20140331
    },
    {
      "title": "QUALITY AS ALWAYS",
      "text": "As always victorinox watches presents a quality at an excellent price. On the seller only say good things, I get the article very fast.",
      "rating": 5.0,
      "verified": false,
      "author": "Juan Carlos Martinez Solbes",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "Exceptional Watch",
      "text": "I just received the watch today. I was able to get it for great price and I can not stop watching it on my wrist. It simply amazing. With the triple coated sapphire glass and automatic movement ETA 7750, the price for this watch is a bargain. Very happy about this product.",
      "rating": 5.0,
      "verified": false,
      "author": "durovem",
      "helpful_votes": 4,
      "publication_date": 20130423
    },
    {
      "title": "Movement stopped working after a year. Called Victorinox multiple ...",
      "text": "Movement stopped working after a year. Called Victorinox multiple times to no avail. Even though I have the warranty card, they claimed it was not sufficient. The warranty card was filled out by the number certified victorinox repair shop in the country. Moreover, they kept my watch for 4 months before I got it back from them. They promised to call me back and never did.",
      "rating": 1.0,
      "verified": false,
      "author": "Hamletofsd",
      "helpful_votes": 6,
      "publication_date": 20150927
    }
  ],
  "product_meta": {
    "title": "Victorinox Men's 241526 \"Infantry\" Stainless Steel Automatic Watch with Grey Leather Band",
    "description": "Victorinox Swiss Army – HistoryMaster Cutler Karl Elsener opened a cutlery shop in Ibach, Switzerland in 1884. Seven years later, in 1891, Karl supplied the Swiss Army with its standard issue Soldier’s Knife. After the death of his mother in 1909, Karl Elsener introduced the brand name Victoria and the iconic Cross and Shield emblem is registered as a trademark. With the advent of stainless steel, Karl Elsener coined the company’s name, Victorinox, by combining his mother’s name with “inox”, an abbreviation of the French word for rust-resistant steel, “inoxydable”. After World War II, the “Original Swiss Army Knife” began its successful progression around the world and enjoyed exceptional popularity. In 1989, Victorinox entered the timepiece business in the United States under the brand name “Swiss Army”. Ten years later, Victorinox joined the Travel Gear market, partnering with TRG Group in St. Louis. And in 2001, Victorinox fashion was introduced in the US to further capture the brand’s essence of practical luxury. In 2002, in order to promote global unity, the Victorinox Swiss Army timepiece brand was launched internationally. In 2007, Victorinox set up Victorinox Swiss Army Fragrance AG, and in 2009 Victorinox Swiss Unlimited was launched. 2014 marks Victorinox Swiss Army’s 130th anniversary, and each Victorinox Swiss Army product embodies the spirit of the Legendary Original Swiss Army Knife, a universal symbol of Functionality, Innovation, Quality and Iconic Design.\n\nBrand Values\n\nFUNCTIONALITY\n\nOur Victorinox Swiss Army timepieces are designed to optimize their usefulness. Functionality ranges from easy-to-read dial designs to sophisticated professional functions. Every design detail is purpose-based. Functions are never add-ons or embellishments. The goal is to create watches that are timeless.\n\nINNOVATION\n\nVictorinox Swiss Army constantly enhances its timepiece lines with new design elements and innovative functions while seeking creative ways of upgrading existing components to enhance their capabilities.\n\nQUALITY\n\nVictorinox Swiss Army timepieces are designed and manufactured with the same rigorous attention to quality as the brand’s legendary Pocket Tools. They also meet the highest standards of the Swiss watchmaking industry. The quality controls and testing that every timepiece undergoes (material, movement, assembly, finishing, etc.) allow Victorinox Swiss Army to offer a three-year limited warranty.\n\nICONIC DESIGN\n\nThe Original Swiss Army Knife is one of the world’s most functional pieces of design. Victorinox Swiss Army timepieces share this icon’s spirit and heritage. They are multifunctional precision instruments engineered to last, yet also timeless and contemporary in design.\n\n\n\nVictorinox Swiss Army Infantry Vintage Mechanical Chronograph watch features a Swiss mechanical, self-winding movement, 44mm stainless steel case with gun metal PVD, exhibition case back, anti-reflective sapphire crystal, anthracite dial with telemeter scale and accented sub dials, luminous hands, numerals and hour markers, chronograph with 30 minute and 12 hour counters, sectorial small seconds hand, date calendar and an anthracite genuine leather strap. . Swiss Made and water resistant to 330 feet.\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :5 x 5 x 4.6 inches; 0.8 Ounces\n * Item model number :241526\n * Department :Mens\n * Date First Available :July 7, 2014\n * Manufacturer :Victorinox\n * ASIN :B006HIRTD0\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #2,552,747 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #22448 inMen's Wrist Watches \n    *  #877931 inMen's Shops \n   \n   \n\n * Customer Reviews:4.3 out of 5 stars34 ratings \n\nVictorinox Swiss Army – HistoryMaster Cutler Karl Elsener opened a cutlery shop in Ibach, Switzerland in 1884. Seven years later, in 1891, Karl supplied the Swiss Army with its standard issue Soldier’s Knife. After the death of his mother in 1909, Karl Elsener introduced the brand name Victoria and the iconic Cross and Shield emblem is registered as a trademark. With the advent of stainless steel, Karl Elsener coined the company’s name, Victorinox, by combining his mother’s name with “inox”, an abbreviation of the French word for rust-resistant steel, “inoxydable”. After World War II, the “Original Swiss Army Knife” began its successful progression around the world and enjoyed exceptional popularity. In 1989, Victorinox entered the timepiece business in the United States under the brand name “Swiss Army”. Ten years later, Victorinox joined the Travel Gear market, partnering with TRG Group in St. Louis. And in 2001, Victorinox fashion was introduced in the US to further capture the brand’s essence of practical luxury. In 2002, in order to promote global unity, the Victorinox Swiss Army timepiece brand was launched internationally. In 2007, Victorinox set up Victorinox Swiss Army Fragrance AG, and in 2009 Victorinox Swiss Unlimited was launched. 2014 marks Victorinox Swiss Army’s 130th anniversary, and each Victorinox Swiss Army product embodies the spirit of the Legendary Original Swiss Army Knife, a universal symbol of Functionality, Innovation, Quality and Iconic Design.\n\nBrand Values\n\nFUNCTIONALITY\n\nOur Victorinox Swiss Army timepieces are designed to optimize their usefulness. Functionality ranges from easy-to-read dial designs to sophisticated professional functions. Every design detail is purpose-based. Functions are never add-ons or embellishments. The goal is to create watches that are timeless.\n\nINNOVATION\n\nVictorinox Swiss Army constantly enhances its timepiece lines with new design elements and innovative functions while seeking creative ways of upgrading existing components to enhance their capabilities.\n\nQUALITY\n\nVictorinox Swiss Army timepieces are designed and manufactured with the same rigorous attention to quality as the brand’s legendary Pocket Tools. They also meet the highest standards of the Swiss watchmaking industry. The quality controls and testing that every timepiece undergoes (material, movement, assembly, finishing, etc.) allow Victorinox Swiss Army to offer a three-year limited warranty.\n\nICONIC DESIGN\n\nThe Original Swiss Army Knife is one of the world’s most functional pieces of design. Victorinox Swiss Army timepieces share this icon’s spirit and heritage. They are multifunctional precision instruments engineered to last, yet also timeless and contemporary in design.\n\n\n\nVictorinox Swiss Army Infantry Vintage Mechanical Chronograph watch features a Swiss mechanical, self-winding movement, 44mm stainless steel case with gun metal PVD, exhibition case back, anti-reflective sapphire crystal, anthracite dial with telemeter scale and accented sub dials, luminous hands, numerals and hour markers, chronograph with 30 minute and 12 hour counters, sectorial small seconds hand, date calendar and an anthracite genuine leather strap. . Swiss Made and water resistant to 330 feet.",
    "rating": 4.3,
    "feature_bullets": [
      "Stainless steel watch featuring textured border around grey dial, green hour markers, and leather band with tonal stitching",
      "Swiss automatic movement with analog display",
      "Protective anti-reflective sapphire crystal dial window",
      "Features deployant buckle closure, luminous indexes, date window, and chronograph subdials",
      "Water-resistant to 300 feet (100 M): suitable for snorkeling, as well as swimming, but not diving"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "5 x 5 x 4.6 inches; 0.8 Ounces",
      "Item model number": "241526",
      "Department": "Mens",
      "Date First Available": "July 7, 2014",
      "Manufacturer": "Victorinox",
      "ASIN": "B006HIRTD0"
    },
    "categories": [
      "Wrist Watches",
      "Men",
      "Watches",
      "Clothing, Shoes & Jewelry"
    ],
    "price": ""
  }
}