{
  "website_summaries": [
    {
      "verdict": "With a host of advanced features and fantastically customizable settings, this toaster takes the guesswork out of making the perfect slice, whatever the bread.",
      "pros": [
        "Automatically toasts, defrosts, and reheats at the touch of a button",
        "Impressively consistent results in every setting",
        "Boasts a whopping 7 browning levels",
        "2 control panels conveniently allow for different levels of toasting at the same time",
        "Leverless slots self adjust to accommodate any thickness",
        "LCD countdown display and beeping readiness alert are nice touches",
        "Motorized lift works smoothly and quietly, with no alarming toaster-to-counter ejection",
        "Attractive design"
      ],
      "cons": [
        "It's on the higher end of the price spectrum",
        "Chunky build can take up extra counter space"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked for three months, then became fire hazard!",
      "text": "When the toaster first arrived, I liked it. Toast was consistent, controls were intuitive and the \"leverless\" feature was cool. After three months, though, one side started activating automatically, going through toast cycles even though you hit cancel. Only way to stop it was to unplug it. We tried everything we could think of, nothing helped. May still be under warranty, but really who is going to take the time to ship a toaster for repairs, especially when you didn't save the box (and really, who has the space to save every box from every gadget)? Very disappointed, have always used Cuisinart toasters but now I will have to look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Jung",
      "helpful_votes": 62,
      "publication_date": 20180326
    },
    {
      "title": "Dont' buy Cuisinart!!",
      "text": "Beware - a Cuisinart \"WARRANTY\" isn't worth much. After less than 6 months of use the digital display has made a considerable collection of sesame seeds and other debris that doesn't seem to be removable. Cuisinart doesn't see anything wrong with this but for a mere $50 or so (about 50% of the original cost) in shipping cost (I get to pay both ways) I could get a new one. For an obvious design or manufacturing flaw in the product, Cuisinart is taking a pretty arrogant attitude to standing behind their products. I guess it kind of makes caveat emptor pretty clear. DON\"T BUY CUISINART.",
      "rating": 1.0,
      "verified": true,
      "author": "Stanley R. Gage",
      "helpful_votes": 83,
      "publication_date": 20160104
    },
    {
      "title": "Not great.  Doesn't toast well",
      "text": "I was so excited to get this toaster, I love leverless. But, it has to be on the highest setting of 7 and that just gets the bread lightly toasted. This is our second unit, sent the first one back for the same reason. We are using normal bread at room temperature, it isn't frozen or extra thick. This is a toaster, plug it in, put bread in, it doesn't get much easier. But I am either somehow doing something wrong or this toaster basically doesn't work",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Ketchum",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "Consistent even toasting. Motorized is cool too.",
      "text": "The toasts are evenly cooked. One improvement for a future version, I like my toasts on setting # 4, but to have the same result with bagels, I need setting # 6. I wish that when I pick the bagel option the last setting I used for bagel would be automatically set as sometimes I forget to go from 4 to 6 and then the bagel come out too pale for my taste. I have to toast them again and watch them to cancel the toasting at the proper time. I still give it a 5 stars because I don't think my lack of attention at what I'm doing, and my laziness, should detract from the quality of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "cpu99",
      "helpful_votes": 3,
      "publication_date": 20180907
    },
    {
      "title": "DON'T BUY THIS TOASTER!!  IT'S A PIECE OF CRAP!",
      "text": "I thought this was going to be a great toaster. We have a Cuisinart coffee maker and love it. My brother-in-law has this one so when ours stopped working, we bought this one. WHAT A PIECE OF CRAP! This toaster sucks!!! Returned the first one because only 1/3 of the bars were hearing up. Gave it he benefit of the doubt and returned it and had them send me a new one. This one is even worse. Had to put down an English muffin twice on 7 and once on bagel just to get it to brown. DO NOT BUY THIS TOASTER!!",
      "rating": 1.0,
      "verified": true,
      "author": "M. Lind",
      "helpful_votes": 6,
      "publication_date": 20170222
    },
    {
      "title": "Not as good as my first one",
      "text": "I had one of these toasters for nearly ten years. I bought it because of its smart styling and ease of use. But a housekeeper tried to use a toothbrush to clean the inside -- which, of course, broke something. I read the reviews including the one-stars for the current toaster, thinking I'd be a lucky one and receive a replacement that was as excellent as my previous one. No. It looks the same, but the buttons need to be pushed multiple times and the bread does not get a good even color. Too bad since for the price it should be as good as my first one.",
      "rating": 3.0,
      "verified": true,
      "author": "KAJAK",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Good toaster, needs break in period!",
      "text": "I really enjoy this toaster. Although at first it wasn't toasting evenly. One side would be darker than the other. After using it more and more it works perfectly fine now toast comes out evenly cooked. I guess it just needed a break in period. Glad I kept it and gave it a chance. I love the automatic lever. Just hit the button and down it goes. The beeping is kind of annoying, I dont think it is necessary imo. Other than that I'm pretty happy with this purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Medicore at Best",
      "text": "Never great, and never toasted bagels/English muffins on 1 try. Always toasted on highest setting for medium toasting (Dark toast required a 2nd visit). It suddenly \"bit the dust\" 18-months after purchase. It was getting hotter over the last 2 weeks, then yesterday 1 side does not toast at all (only getting warm) and the with other 2 slots 1 is toast dark and 1 is burning 1/2 of 1 side the other not toasting at all. I will not buy again nor do recommend it if you like English muffins or bagels.",
      "rating": 3.0,
      "verified": true,
      "author": "SStone",
      "helpful_votes": 2,
      "publication_date": 20180614
    },
    {
      "title": "Would not purchase again.",
      "text": "This toaster requires quite a bit of maintenance. 1. Crumbs end up inside the machine, at the bottom, and not on the tiny crumb trays which causes burning & smoke. (Our previous toaster had a larger tray to catch the crumbs and we never experienced smoking issue. 2. After shaking out the crumbs on the bottom, some bits lodge behind the LCD countdown screen, which can't be removed. (See image) 3. This is my bad, but the all stainless steel finish requires clean-up daily due to fingerprints! Not happy with this purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Morty",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Pretty, but doesn’t make toast",
      "text": "The leverless feature is neat and it’s not a bad looking toaster, but it doesn’t make toast. You know, it’s primary function. Just warms it up, but only on the inner side, and you have to get it to repeat 2-3 times to get one-sided toast. This is not a cheap Walmart toaster - I don’t get it! Returned it and pulled the trigger for the fancier Breville, which is very, very nice and, get this - it makes toast! Don’t waste your money on the Cuisinart.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara L. Peters",
      "helpful_votes": 3,
      "publication_date": 20180723
    },
    {
      "title": "This thing couldn't melt an ice cube!",
      "text": "Looks great, leverless is nice for storage convenience...but this thing couldn't melt an ice cube let alone toast anything. Very weak coils! Most toasters glow...this one, does not. I have to toast bread twice on 6 (second to highest setting) to get a muffin to brown...slightly. The worst toast I've ever purchased. Never again.",
      "rating": 1.0,
      "verified": true,
      "author": "JZ",
      "helpful_votes": 4,
      "publication_date": 20171122
    },
    {
      "title": "Does Not Toast Evenly",
      "text": "I did quite a bit of research on a new toaster before settling on this particular one. I have a wonderful Cuisinart Coffee station that works perfectly. The features of the model are pretty good, but toasting ins't one of them. The coils are not uniform, and every single slice of toast is uneven. I really wished I could have returned this to Amazon and tell Cuisinart how bad this product is as a toaster. I have to set it on the highest setting and I still have to do it twice, still not uniform toast or english muffin, etc. I exected so much more from this product. My first bad purchase on Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "Phil C",
      "helpful_votes": 4,
      "publication_date": 20160704
    },
    {
      "title": "Good looking & functional toaster",
      "text": "I've only had this toaster for a week, but it's great so far. The determining factor for my purchase was a beeping sound when the toast is finished toasting. My last toaster had this feature, and I didn't think about how convenient that was until reading product reviews. You can hear the beeping from the next room, reminding you that you actually put something in the toaster at all. The slots are wide enough for bagels or thicker bread items. So far - so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180226
    },
    {
      "title": "Class Act",
      "text": "When compared to most other 4 slice toasters you can't go wrong with this Cuisinart Offering. Aluminum housing resists fingerprints; the controls are clear and easy to manipulate. Retraction and Ejection functions are automated, all you have to do is select duration, temperature and push the button to start. As an additional plus; it ejects the toast / bagel / whatever higher than most I've seen so you can grasp your toast without burning your fingertips. A LOT of nice touches.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter R. Adams",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Experience toasted good on another level.",
      "text": "Used a cheap toaster all my life and since we toast on a daily basis We finally purchased a fancy toaster. This unit is beautiful, not an eye sore like the old toaster we used to have. Performs flawlessly and each toast is consistent. Surprise toasts comes out better. Frozen waffles now have a nice crisp outer texture while the center is soft and moist.",
      "rating": 5.0,
      "verified": true,
      "author": "findle",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Great toaster - Great Price",
      "text": "After a kitchen remodel, we were looking to replace our prior Cuisinart toaster. That toaster had been a bridal shower present and had served us faithfully for 30 years! So we wanted to stay with the Cuisinart brand. Prices at the local home/kitchen store were almost double the price here. This is a really nice toaster at the Amazon price and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "peabodyjd",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "This toaster is not good",
      "text": "I can’t say that I’m very happy with this toaster. On the plus side, I love the push button mechanism, the backlight, and the bell for when it’s done. But my praise ends there because... This thing can’t toast anything. Well yeah I guess that’s an exaggeration, but it doesn’t toast anything at all well. A piece of bread on the darkest setting does not brown more than 25% of the bread. What you get is dried out bread, not toast. I’ve tried with white, wheat, English muffins, you name it. I regret this purchase. Worst toaster I’ve owned.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Beasi",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "An exceptional toaster at it's price point of $100",
      "text": "Much like our previous Cuisinart toaster only instead of levers that put down the toast, & over time get worn out, this one uses a simple push button. Has special abilities like toasting only the cut edge of a bagel, accommodating thick pieces of bread etcetera, defrost & reheat. All of which this toaster does especially well. I have used this toaster fairly regularly since my purchase earlier this month. The previous model lasted about 4 years... Maybe this one will last longer? One can hope... 😉",
      "rating": 5.0,
      "verified": true,
      "author": "Maia A.",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Best of Cuisinart Toasters",
      "text": "Tried Cuisinart Toaster for less money that Costco had at Christmas but it didn't toast bread at all. Soft & flimsy! Started doing more online research as we wanted 4-slice toaster & liked the size of this one. Soooo Much Better than the other one. We've been very pleased. Only issue was if my husband wanted 2 slices on the left & I only had one on the right side, found I needed to have my setting 1 below what the left side was set on.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20200212
    },
    {
      "title": "I like it!!",
      "text": "A lot of people are critical about this toaster. I really enjoy having this. I'm sure I am one of very few who reads the user manual, but take the time to do so. I found it interesting to read that different types of bread and/or bagels require different time settings. Also, if the bread is moist, you need to take that into consideration as well. I have a similar Cuisinart toaster without the auto down and up feature and found that both toasters are very similar. I found the left two slots toast a little lighter than the two slots on the right side. I like gadgets so I enjoy seeing the bread go up and down automatically.",
      "rating": 5.0,
      "verified": true,
      "author": "KC in Vero Beach",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "a bit better than standard toasters",
      "text": "The higest setting is a 7 and it takes two cycles to really get a good toast on try bread or English muffins. Traditional rye bread a bit too big to fit all the way down to toast. Nice the the bread pops up automatically rather then fiddling with pushing down/down levels on other toasters. It has a countdown timer so you can tell when the cycle is almost over. Audible notice when it will finish cycle.",
      "rating": 4.0,
      "verified": true,
      "author": "FD Firefighter 121",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "It's that good",
      "text": "Yup.......this is the one. If the zombie apocalypse happened today.....I would take a knife, water purification tablets, and this toaster into the brush with me.... and head south. I'd figure out how to build the generator out of twigs and rocks and stuff later.....so I could get it to fully function again. OR First contact with the aliens.....Say Nothing.....we just hand them one of these. OR Seriously....this toaster is great...hands down the best toaster we have ever owned. Take a frozen bagel...defrost it...and toast it perfectly...pushing 3 buttons...really? Yup, and it looks good doing it.",
      "rating": 5.0,
      "verified": true,
      "author": "bob",
      "helpful_votes": 6,
      "publication_date": 20150406
    },
    {
      "title": "toasts lighter on one side and dark the other.",
      "text": "This item is a letdown and can't believe it was made by cuisinart! wasn't able to send it back within 30 days due to surgery. just hope review alerts others of problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Gabby",
      "helpful_votes": 2,
      "publication_date": 20190727
    },
    {
      "title": "Quality by Cuisinart.",
      "text": "My family have been Cuisinart users for many, many years. We have always relied on their products, This toaster, was given to my daughter and son-in-law as a gift. They are so pleased. Easy to use and clean. As I do, so do they. Recommend Cuisinart for all buyers. DP. Castro Valley, CA.",
      "rating": 4.0,
      "verified": true,
      "author": "DP",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Perfect toast",
      "text": "I had a very old toaster, that just browned the outside of the toast. I had become used to this type of breakfast. Boy was I surprised when I discovered real bread toasted, really. What a dif. . Plus the toaster creeps up on your bread once it is placed in the toaster, and slowly consumes it -- all by itself. Soon it let's you have it back, automatically, with a beautiful toasted color.",
      "rating": 5.0,
      "verified": true,
      "author": "B. read",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "No cheap levers that break on this one",
      "text": "I love this toaster. It’s all push buttons, does 1 slice or 4, bagels and there is no cheap levers that break off like other toasters I tried. There is even a tray in the bottom that holds all the crumbs so you just clean out the tray every once & a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri Sanders",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "I love this thing!",
      "text": "I’ve seen a lot of comments about pop tarts being decimated by this toaster, well I haven’t had that problem. I absolutely love the leverless aspect. It looks modern and slick, i no longer feel like i have to hide the toaster after i use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Goetz",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Awesome Toaster",
      "text": "Really happy with this toaster. Was a little concerned after reading reviews. I think several reviewers were utilizing the bagel function for their toast. Couldn't be happier because it reminds me of the toaster we had while growing up.",
      "rating": 5.0,
      "verified": true,
      "author": "Consejero",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Falls short due to defect",
      "text": "We liked it first one that we bought a second. The second was built in a way that when the item rises up, it is caught on the top lip of the stainless steel finish and bends or breaks in the toaster. I'm attempting a warranty replacement as we like it otherwise, but this defect ruins whatever we are making unless it's so tall it doesn't fully fit in the toaster.",
      "rating": 3.0,
      "verified": true,
      "author": "Eric Rosenberg",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Nice upgrade",
      "text": "We had a previous model of this loverless toaster for years and it was great, until my wife dropped it in a water-filled sink and then in her haste to get it out she smashed it on the floor. I decided to keep using the brand and got this new model, and absolutely love it. It even allows better \"toastiness\" control than the previous one.",
      "rating": 5.0,
      "verified": true,
      "author": "Alberto R.",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Effective Toaster",
      "text": "This is an effective toaster - but does not toast quite evenly - using a different number setting on the right side from the left side - to get similar toast. Bottom of bread does not seem to toast as well - comes out a bit uneven. This is a better toaster than than I have had in the past but for the money I would have expected a bit better.",
      "rating": 4.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Looks great, doesn't make toast",
      "text": "This is an expensive, fancy, gimmicky 4-slice toaster that fails in the one thing it should do well--toast bread. I was getting awful results, and fiddling with settings and getting no improvement, until I looked inside and saw the problem: The heating elements are all wonky, only roughly 1/3 of them lighting consistently across all 4 slots. When you're experimenting with trying to get the toaster working properly, the automatic lowering/raising mechanism is doubly frustrating, as you have to wait each time. Returned, replaced with $20 Oster toaster from Wal-Mart that performs beautifully.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "... of these toasters for my daughter and it works great. So",
      "text": "I purchased one of these toasters for my daughter and it works great. So, when my 43 year old GE Toaster finally died, I bought one for our house. I find that I have to push the toast control to the darkest setting (7) -- and then put it though twice. My daughter's unit never has to be set above 3 and does the job the first time through. I think I got a lemon. I would still recommend it -- just keep the box until you have used the toaster for a week or two. I made the mistake of assuming it would work just like my daughter's toaster and threw the box away the day it arrived.",
      "rating": 4.0,
      "verified": true,
      "author": "The Amazon Man",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "The top part of the toast is nice and brown (on the 4 setting) but the bottom ...",
      "text": "What other reviewers have said about the uneven toasting is true. The top part of the toast is nice and brown (on the 4 setting) but the bottom portion is lighter. So I usually have to place the bread in the toaster (set at 4) when done I turn the bread slice upside down and toast again (on setting 1 or 2), this will ensure a very nice toasted slice of bread. I still love my toaster, I really like the fact that it does not have a lever.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Dominguez",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Toasts very unevenly.",
      "text": "Absolutely the worst toaster I've ever owned (and the most expensive). It toasts very unevenly, from top to bottom, and from front to back. The wires hardly glow and some don't glow at all. After 17 months of frustration I have thrown it away. I have ordered a Krups at less than half of the Cuisinart price. I'll bet it toasts better. We'll see. Isn't the most important feature of a toaster the quality of the toasting? Otherwise it's just a piece of art deco.",
      "rating": 1.0,
      "verified": true,
      "author": "Howie",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Dying in less than 4 years",
      "text": "We bought this toaster in March of 2016. It has had light use. It is dying quickly. One side has stopped working completely a few months ago, and now the controls on the other side are failing. Bad quality. It has been an adequate toaster, not much better than cheaper brands. Nothing special. I regret our purchase and do not recommend it.",
      "rating": 2.0,
      "verified": true,
      "author": "Okie Jokie",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "At first I really liked this toaster",
      "text": "At first I really liked this toaster. It was very consistent and toasted evenly and exactly to the level selected. I particularly liked the countdown timer to completion. Then one day (after 4 months) the “toast” button got stuck inside. I pryed it back out with a flat head but then it became a normal occurance. After another month, both “toast” buttons were stuck and after a few more attempts of prying them, the buttons broke, making this very extra expensive toaster, completely useless. I have since stopped buying all Cuisinart products because I have noticed their quality has diminished substantially in the last few years.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristen Anderson",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "An excellent toaster",
      "text": "I do not usually write reviews for items that I buy from Amazon however with this toaster I felt it was necessary to make the comments. The toaster does an excellent job when toasting white bread, wheat bread, bagels and English muffins. When bread is toasted it does not dry out the bread, but toasts the outside nicely. It looks very sleek on the kitchen counter. I have only had the toaster for a week and will update this review later down the road.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Godfrey.",
      "helpful_votes": 2,
      "publication_date": 20180104
    },
    {
      "title": "Great Toaster",
      "text": "This item might be a tad more expensive than some others, but it is a great toaster and I would recommend it for anyone who likes to control the degree of toast they like. It has 7 process levels and you can have your toast lightly browned or heavy browned. Makes great toast with different types of bread!!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Duval",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Best toaster we've had!",
      "text": "We decided to upgrade from the $20-$40 toasters purchased at big box stored. Wish we'd done that years ago! This toaster is amazing, toast, bagels, muffins all toasted to perfection. My favorite is to toast hamburger buns on the bagel setting, just that little extra crunch.",
      "rating": 5.0,
      "verified": true,
      "author": "MW",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Buy it,",
      "text": "Absolutely love this toaster. Great for bagels. Self lowering and rising feature is great. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Geno",
      "helpful_votes": 2,
      "publication_date": 20190910
    },
    {
      "title": "Nice looking toaster.",
      "text": "Nice looking toaster. It toasts evenly and looks great on the counter. Best toaster we’ve owned so far. We haven’t had any issues and almost use every other day. The beep is kind of loud when your toast is done, but I like that, because I forget I’ve put toast in there sometimes when my children are running around distracting me.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris10",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Nice toaster",
      "text": "I got the 4-slice leverless, and it's definitely an upgrade over my two-year-old $40 Black & Decker. Relatively even and significantly faster than I'm used to. It does toast quite light if you have both slots filled as I tend to (but darker if there's only one slice in), so keep that in mind if you like dark roast.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah C.",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Approximate cost:  $25 per month of use",
      "text": "I wanted to like this toaster. It's sleek, it's beautiful. But after four months, it stopped toasting. One side doesn't toast, and the other side of the bread barely gets brown. Be aware that even though there is a three year warranty, YOU have to pay to ship this back to Cuisinart, and they will charge YOU $10 to ship the new unit to you. Some warranty. This will be the last Cuisinart appliance I buy. I've had $20 toasters that have lasted longer.",
      "rating": 2.0,
      "verified": true,
      "author": "SueSee",
      "helpful_votes": 4,
      "publication_date": 20150722
    },
    {
      "title": "Perfect Toast every time!",
      "text": "This is a high quality toaster. Easy to set to the desired doneness for perfect toast every time. Well made, easy to operate with choices for bagels, frozen pastries, etc. Handles thick slices (e.g. Texas Toast) well, too. As easy to clean as any other toaster. Also, looks great sitting on the counter.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce I. Watson",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Product has a defect",
      "text": "This is a defective product. When you turn it over to clear out the crumbs or pieces of bread stuck in the toaster, the crumbs get stuck in the display and cannot be removed. I cannot recommend it. When I tried to return it to Conair Cuisinart ‘s parent company and get a replacement, they require return of the defective product at the customer’s expense. The unit was only purchased 33 days earlier. Amended: Overtime the crumbs gradually become smaller and disappear from view.",
      "rating": 2.0,
      "verified": true,
      "author": "Rosemarie",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Sophisticated, nice blue light, no startle pop up :)",
      "text": "Elegant design, this brand is the best for toasters and as a family of 6, we’ve gone through a few toasters. This is a step up, more sophisticated than our previous one that we still use, same brand. I’m sure this will last bc the kids can’t break the lever which always happens. Would like there to be an easier way of cleaning out large crumbs but that might not be necessary with this type of toaster.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernanda",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "I like the digital display",
      "text": "This toaster had a strong smell when turned on for the first week or so. We almost sent it back but instead just kept running it with no bread and all the windows open. Yuck! Glad we kept it though because it works great for bread and bagel and its easy to control the degree of toasting you are looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "Joanna",
      "helpful_votes": 2,
      "publication_date": 20180226
    },
    {
      "title": "Had great hope based on reviews, however...",
      "text": "Came today 12/10/15 opened and as advised started the burn off. First time on 2 of the 8 heat elements would not turn on. Obviously their quality control does not check operation before packaging. Back in the box and ready to ship back. Bummer. I won't be reordering.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20151210
    },
    {
      "title": "LOVE this toaster!!!",
      "text": "My family of five absolutely LOVES this toaster!!! We haven't had it very long but it works amazing so far! My girls love to watch it go down and pop back up by itself, including my 14 year old. (They even named it Carl...LOL) We bought this toaster because our other one had died. Finally, I don't know what some of the other people were talking about when stating that the outside gets hot when using it. I have not had that issue at all.",
      "rating": 5.0,
      "verified": true,
      "author": "JMS",
      "helpful_votes": 3,
      "publication_date": 20170411
    },
    {
      "title": "THIS, is a good toaster - yes, it really is",
      "text": "Finally got a decent cuisinart toaster.... Good features: The slow lowering of bread when you press the toast button Ding alert & slow rising of toast when done LED display of what browning level Indicator bars, decreasing to show what stage the browning is at - this completely surprised me, did not notice that for the first few days and must have missed reading that feature The blasted toaster even looks decent on the counter top Would I buy this again after my last disastrous cuisinart toaster foray, which I gave them one more chance before abandoning them - yes.",
      "rating": 5.0,
      "verified": true,
      "author": "Zeus",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "It does what it advertises",
      "text": "This is a very nice toaster and other people that complement to your house love it. Pros: Looks nice. Does a great job of toasting. Cons: Is very slow, Buzzer isn't loud enough, I would like it better if it timed down letting you know how long until the toast is ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Houston",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "Great toaster, works well and looks good!",
      "text": "We have been using this for many months and it works great. We enjoy the different modes. It is fast and quiet. It looks good on the counter. I am quite happy with the purchase. There are a bunch of crumbs stuck in it, so I've marked ease of ckeaning down to 3... but it has two crumb trays which helps a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Omnifine",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Beautiful and it toasts too!",
      "text": "A work of art, and would be beautiful on your counter. I keep mine in the cupboard to hide it, not to tempt someone who like to have the best toaster out there. We have purchased a few toasters over the last few years because we couldn't find any that actually did a good job on toasting the bread. This four hole toaster is the best that we have found, and works so nicely. I'm proud and highly satisfied that this purchase makes me happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Little",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Very disappointing",
      "text": "Totally awful I had one for 5 years was perfect but then one side didn’t work so have it to goodwill but the new one is hopeless have to put it down twice at top level to make it brown enough then it seems too crunchy I threw the box away so can’t send it back",
      "rating": 1.0,
      "verified": true,
      "author": "Elaine N. Oxford",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Where have you been all my life?!",
      "text": "I just love this toaster. It makes perfect toast. Yes, there is such a thing as perfect toast! Bagels are toasted on the inside and no crispy topping on the outside! My Eggo's are to die for. I thought they were supposed to either come out partially toasted and partially mushy. Or, too dark. Or where you needed to then nuke them after you toasted them to get them soft. I wonder how it will to with Aunt Jemima french toast? These two are for those lazy or time crunched mornings! It looks great ON the counter top! No need to hide the puppy! I would absolutely buy it again and wouldn't balk at the price.",
      "rating": 5.0,
      "verified": true,
      "author": "SpendTooMuch$OnAmazon",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Makes better toast",
      "text": "Our old Cuisinart toaster developed a problem. I am not handy, so I decided to buy a new toaster. this seems like the best at any reasonable price. We have it over two weeks now. Makes better toast and the defrost setting works very well. The big Q will be longevity!",
      "rating": 5.0,
      "verified": true,
      "author": "Chescat5",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "My first one lasted 3 years",
      "text": "As a toaster it does what it is supposed to. Rarely burns food. Unfortunately after 3 years of daily use, one side stopped working. I am going to buy another one, because in today's \"planned obsolescence\" 3 years is pretty good for an electronic appliance.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Burgess",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Not worth all the extra cash",
      "text": "Its just buttons. They don't do anything more than a cheaper toaster would do. Plus it can't handle anything above your regular bread since the slots are too small. Save your cash (do you really need to do 4 slices at once?) and get the less buttons but higher qualtiy version that can accept longer (artisian) bread slices or 4 regular bread slices in the two slots.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "Love it!",
      "text": "My old toaster was burning everything- but you get what you pay for! I am in love with this toaster! Not only does it NOT burn anything, it is so easy. Especially for my 8 year old twins. Looks great on my counter too. bonus",
      "rating": 5.0,
      "verified": true,
      "author": "Cbw Productions Holly Seppala",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "No more broken push levers!",
      "text": "Our senior residence has a dining room where residents can toast their bread to their hearts' desire. Having a toaster that has just buttons and no lever means the end of forcing the lever up instead of hitting the cancel button. Hopefully these toasters will last a long time, and help end the broken lever frustrations! Thank you! The one piece of a learning curve is that on an initial toasting, they have to hit the \"toast\" button twice. Otherwise they're great.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Good toaster",
      "text": "Great toaster, toasts evenly, love that my bread does not jump out of the toaster like with my old one. Like the beep when it's done. It hums when it stays plugged in so I tend to unplug it which resets my settings.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacky ",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Better than most toasters I have tried",
      "text": "Better than most toasters I have tried. Fairly even toasting. Slots not quite deep enough for my home made bread. A bit slow in toasting.",
      "rating": 4.0,
      "verified": true,
      "author": "JW. Healy",
      "helpful_votes": 4,
      "publication_date": 20170417
    },
    {
      "title": "doesn't like wide bread slices",
      "text": "They should make the toast-slot longer, wider breads like Orowheat Oatnut have to be jammed in since the edges hang up and the mechanical feed doesn't quite do the trick. It's consistent, as indicated in the reviews i read, but next time i'll be more careful with the simple things, because they're not.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Not good since I'd be pressing them daily",
      "text": "I really wanted this toaster, so when the first one arrived with buttons that would not reset after being depressed, I ordered a replacement. The second one came dented, so I simply repackaged it and ordered another replacement. It arrived today, and the buttons on the right (for toast darkness) had the same issue as the first: they stick after being pressed. Not good since I'd be pressing them daily. I will try something else.",
      "rating": 1.0,
      "verified": true,
      "author": "TKY",
      "helpful_votes": 3,
      "publication_date": 20161018
    },
    {
      "title": "Excellent",
      "text": "Its such a wonderful item. All my family is enjoying toasting the bread and bagel",
      "rating": 5.0,
      "verified": true,
      "author": "Archana",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Two Strikes and You're Out!",
      "text": "The heating elements in my first toaster partially functioned. Not a single side lit completely, or even at 75%. I called Cuisinart Customer Service and was told I had a faulty toaster. Amazon promptly sent a replacement which functions no better. I had to use the highest setting (7) and then toast the bread again at 4 before getting an acceptable light brown slice. I will return this toaster too and request a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. Pizza",
      "helpful_votes": 4,
      "publication_date": 20150816
    },
    {
      "title": "Really Good... but",
      "text": "We have owned this toaster for several months. It has worked flawlessly and overall I really like it. The only complaint is that it will not get my English muffins brown enough on the highest setting. I end up cooking them twice.",
      "rating": 4.0,
      "verified": true,
      "author": "W. S.",
      "helpful_votes": 3,
      "publication_date": 20170127
    },
    {
      "title": "This toaster is cool",
      "text": "I have to say this toaster is cool looking, impressive to use and does a great toasting job. No more digging for lost toast by sticking your fork in. This toaster raises the toast to a reachable level. My wife likes the cool led lights and we both love the perfect toast.",
      "rating": 5.0,
      "verified": true,
      "author": "scottmurphy",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Leaverless feature is great!",
      "text": "I would recommend this toaster. I replace an older toaster. This all push button toaster is great and does a good job for function and ease use. Use it to toast bread, defrost/heat waffles and bagels. Does a great job for all. Good price too. Look at the picture to make sure is leaverless. since similar ones with leavers are also available.",
      "rating": 5.0,
      "verified": true,
      "author": "readrose",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "At Last...",
      "text": "Bestill my heart. I have FINALLY found a toaster that knows how to toast a slice of bread. Top to bottom, side to side, both sides...a beautiful golden brown. I hesitated to write my review after only the first try, but it's kept up the pace with every piece of toast. Yes, it was pricey and yes, I indulged myself; but I've been so discouraged by toaster performances that I could scream. I hope to have this toaster for many years to come. Go ahead - spoil yourself - you deserve it. The two-beep sound is simply telling you your product is ready. The toaster is so quiet, you may forget you're even toasting.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Queen",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Fancy but doesn't toast better than any $15 toaster",
      "text": "Neat toaster and does a pretty good job but it still doesn't toast as evenly as it should for the $. Using the bagel function works fine if the bagel is room temp...if they are refrigerator cold don't use the bagel function because the top and bottom of the bagels will still be cold. Just the standard toast function seems to work best. I am still trying to figure this machine out because the default level is 4 but I usually lower it to 2 and the level of toasting is excellent sometimes and a little too much sometimes. So, this high tech toaster is pretty and fancy but it doesn't toast any better than any other toaster.",
      "rating": 3.0,
      "verified": true,
      "author": "SMK",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Trust the brand, very good quality",
      "text": "I love that fact it has many setting for different items, and that the toast goes down on its own.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Matelski",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Light toasting",
      "text": "As previously noted: - There is an odor that has to burn off during initial use. - No danger of burning your toast with this. The toasting, even on the highest setting, is pretty light.",
      "rating": 3.0,
      "verified": true,
      "author": "trs",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Very pleased",
      "text": "I bought this item at least 6 months ago and have been very pleased with the quality, look and function of this toaster. It's easy to clean and set for different breads, bagels, etc. It sounds a \"beep\" when the toast is done and automatically raises the bread for easy retrieval. I would buy this again for sure and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ohgram",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "This is a beauty! Love it.",
      "text": "My husband and I love this toaster. It takes four slices. The two halves can be adjusted for individual use. It is like having two toasters in one machine. He can make his settings, and I can make separate settings. And voilà, all four slices are done at the same time to each individual preferences.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie B.",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Good toaster",
      "text": "My husband is the main toast maker in our family. He has said several times that he really likes it -- it makes good toast and is simple to operate, can adjust each two-slot side separately. A good value. I bought it because it was the highest rated \"good buy\" toaster on a toaster review site.",
      "rating": 5.0,
      "verified": true,
      "author": "A reader from TN",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "DEFECTIVE!! Coils don’t heat up- read reviews",
      "text": "This toaster is amazing if it worked!! Listen to the other reviews. All the coils don’t heat up. I am SO disappointed because other than that it’s a great toaster but if it doesn’t toast what’s the point?",
      "rating": 1.0,
      "verified": true,
      "author": "Rose Garden",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Somewhat expensive",
      "text": "Somewhat expensive but this is the best toaster I've had.",
      "rating": 5.0,
      "verified": true,
      "author": "Jase",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Kind of busted",
      "text": "This toaster on the highest level 7 barely toasts English muffins without having to retoast at a much lower level before getting the level of toastedness preferred. I think I have a defected item But I'm out of my 30 day warranty. For a relatively more expensive toaster i’d expect better quality. This toaster also toasts unevenly.",
      "rating": 1.0,
      "verified": true,
      "author": "Kyle Andrew smith",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Does not toast well",
      "text": "This toaster does not do the one thing it is designed to do. It doesn’t make toast. It makes slightly warm bread. Using the highest setting of 7, you have to put it back in for additional time just to get the bread to start to brown. Very disappointed. The KitchenAid version of this model was 100% better. Sadly, KitchenAid doesn’t make their version anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Alarm clock toaster",
      "text": "Probably not worth $70, it either overcooks bread or undercooks frozen items most of the time no matter what setting. It also has a very obnoxious alarm clock sounding beep when it's done cooking, wakes me up every morning when my boyfriend is making his breakfast. Next time I'll be a $10 toaster and call it good.",
      "rating": 3.0,
      "verified": true,
      "author": "Blanca",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Ordered, October 17, 2016 and Still going Strong...",
      "text": "Ordered this on October 17th., 2016 and still going strong just like the day I plugged it in... as a matter of fact, today is April 16th., 2020 and I just used it today to toast some Wheat Bread as I used it yesterday, to toast some Whole Wheat Grain Bread. Could never toast with a standard, no feature toaster again. I would definitely buy again, love this item ! (Full Disclosure: I do Not Review Products I have not Paid for with my Own Hard Earned Money... No Freebies here)",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick Harrison",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "Only okay",
      "text": "After doing lots of research, I decided on this toaster. For having SEVEN settings, it only toasts medium... NOT even medium dark. Yes, I know, it depends on what kind of bread.... We have tried a variety of bread... same results. Also, for toasting evenness, it is again only okay--not really even, but not really bad.",
      "rating": 3.0,
      "verified": true,
      "author": "N Robins",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Works well!",
      "text": "Works great! I use toast level 4 and it makes perfect toasted bread. Does not dry out the bread too much (this happens when a toaster toasts too slow). This toaster does not do that. The LCD screens turn on when you touch buttons, illuminates in bright blue, and they turn off automatically (within about 60 seconds). I have used the defrost button once (on eggos) and it worked well. Instead of \"toasting\" the eggo it actually warmed/defrosted and then I was able to toast perfectly. I do recommend this toaster. Easy to clean and the brushed steel look does not absorb greasy fingerprints and stays clean.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Herrin",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Love it so far.",
      "text": "Bought this to replace a different Cuisinart that failed far too soon. I don't use most of the features, I just want to toast things. I love the self lowering feature. I hope it lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill F.",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "To make matters worse, it only really attempts to \"toast\" on ONE ...",
      "text": "it has seven heat levels, and even number 7 doesn't produce toast any darker than something taken from your armpit. To make matters worse, it only really attempts to \"toast\" on ONE side of the bread. I'm sending this creation back to China. My Gawd ! Does making a damned toaster have to be rocket science ?? ( and NO, I didn't have it set on the \"bagel\" side. I tried all slots, and got the same results...",
      "rating": 1.0,
      "verified": true,
      "author": "phil36",
      "helpful_votes": 3,
      "publication_date": 20170110
    },
    {
      "title": "UNEVEN TOASTING",
      "text": "This unit that I received does not toast evenly and I mean one side is very toasted (almost burned) the other side is barely toasted. You can see that the heating elements on the inside of the side that did not toast correctly did not heat up. I see that some other folks had this issue so but most people loved this toaster, so I am assuming I have a \"lemon\" and will return it and try one more time. Wish me luck. Later: So I got the 2nd unit and it still have very uneven toasting, sent it back for refund",
      "rating": 1.0,
      "verified": true,
      "author": "Mikey",
      "helpful_votes": 2,
      "publication_date": 20151203
    },
    {
      "title": "This toaster is really cool. I read the bad reviews",
      "text": "This toaster is really cool. I read the bad reviews, and haven't had any problems yet and I use it often.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170224
    },
    {
      "title": "Love all my cuisinart ( kitchen helpers) ❤❤",
      "text": "Love this toaster!! Looks nice on my counter.. Works well ,cuisinart small appliances are always great accessories to my kitchen. ☺️(big home cook) need the right tools to do the job! (Right ladies and gentlemen) I highly recomend this toaster. Thanks cuisinart!!",
      "rating": 5.0,
      "verified": true,
      "author": "🌺🌿Amazon  shopper🌿🌺",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "March 2019 Great product",
      "text": "August 2019 the heating elements on one side quit working so bread was only toasting on one side. I unplugged over night and now all the elements are working again. March 2019 Great product Consumer Reports was right on the spot in the heating if this appliance.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmie R. Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Terrible!",
      "text": "I read good reviews on the 10 best website. I unfortunately through away the box or I would have returned the toaster. Yes, it looks good and has nice features but it is terrible at what is important: toasting! The highest setting is too light, bagels, have to be done 2x and is done poorly on both sides, and lastly toasting is very slow. I would be better off with a quality 2 slot toaster and using it 2x. That would still be faster and better. I plan on purchasing a Breville (you get what you pay for) and selling this one, used (you buy cheap, you buy two times). IMHO!",
      "rating": 1.0,
      "verified": true,
      "author": "Claudia Resnick",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Not as good as the first one.",
      "text": "This is our second one of these toasters. The first was great and lasted about 3 years which I thought was fine. This one just doesn't toast the bread well and I have to re-toast every piece. And the buttons don't work as well as the first one we had.",
      "rating": 2.0,
      "verified": true,
      "author": "shalb",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "love it!",
      "text": "Fast with elegant design. Love the automatic leavers. one point, in some of the toast brand sizes cannot fit easily and you have to push the bread down",
      "rating": 5.0,
      "verified": true,
      "author": "Firas",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Toastin' in Style",
      "text": "Family of 5---Makes you nervous spending so much on a toaster, but after a year----we still love it! It has a chime for when the toast is ready. Sometimes I still look around to see what that noise was! Setting 4 is our favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Emz",
      "helpful_votes": 0,
      "publication_date": 20171227
    },
    {
      "title": "Worst toaster ever!",
      "text": "Bought this toaster based on the good reviews on Amazon. The first one stopped toasting about 2 months after we purchased it. We sent it back to Cuisinart and was given a new one. The same thing happened with the new one. It lasted about 2 months. My wife just called Cuisinart but they couldn't help because their system was down. Update: 3rd toaster did not properly toast out of the box. This is the worst product I've ever owned.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Meier",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "Good quality",
      "text": "The LCD display shows a countdown bar so you know roughly how long before it's done toasting. The motorized lift is a neat feature. Wide slots for bagels. Quality level is top-notch. Browning is even. We've had so many junk toasters, even expensive ones, that getting one that works this well is nice. Edit 7/28/2017 Still going strong even with daily use. Highly recommend this model. Edit 8/26/2018 Like the Energizer bunny... 3.5 years later it still works every day.",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "Favorite toaster of all time",
      "text": "I love this toaster. I can do 2 pieces of toast and 2 hash browns at the same time. Also good for pop tarts, waffles, bagels, English muffins.....",
      "rating": 5.0,
      "verified": true,
      "author": "Karen S. Simpson",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "TOASTED is no longer a Bad Word !",
      "text": "Finally, a bread, bagel, unfrosted slice of pound cake toaster that doesn't lose handles AND actually has consistent toasting ! Plus, it is fun/neat/cool to watch it count down to \"Ready\". I Love It !",
      "rating": 5.0,
      "verified": true,
      "author": "Doctor Love",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Great looking, flexible and fun to use",
      "text": "Whole family loves this new toaster. Clear and easy to use, functions flawlessly. Even toasted hamburger buns last night. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "zippydog",
      "helpful_votes": 0,
      "publication_date": 20200315
    }
  ],
  "product_meta": {
    "title": "Cuisinart Touch to Toast Leverless toaster, 4-Slice, Brushed Stainless Steel",
    "description": "Color:Brushed Stainless Steel| Size:4-SliceCuisinart gets extra credit for its innovative Touch to Toast Lever-less Toaster! A motorized controllowers items into 4 extra wide slots with the touch of a button. Dual control panels, with blue backlit LCDdisplays and countdown timers, control two slots each. Features one-sided enhanced bagel toasting, reheatand defrost controls, audible alert signal, and 7 shade settings – everything you’ve come to expect from atop-of-the-line Cuisinart toaster. Streamlined, in elegant brushed stainless steel, it’s the toast of the town!\n\nIf the bagel button is On, only one side of the bread will be toasted.",
    "rating": 4.4,
    "feature_bullets": [
      "Stainless-steel housing with a motorized lift",
      "Lcd countdown feature with a blue backlit led function display, Voltage: 120V",
      "Enhanced bagel toasting with cancel, defrost and reheat options",
      "Easy cord wrap for minimal use of your counter space. BPA free",
      "Toaster comes with a 3 year limited warranty. If the bagel button is On, only one side of the bread will be toasted."
    ],
    "specifications": {
      "Product Dimensions": "11.42 x 10.08 x 7.75 inches",
      "Item Weight": "6.5 pounds",
      "Manufacturer": "Cuisinart",
      "ASIN": "B006OQSNYY",
      "Item model number": "CPT-440P1",
      "Customer Reviews": "4.4 out of 5 stars2,406 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#8,673 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Personal",
      "Finish Types": "Brushed",
      "Material Care Instructions": "Hand Wash",
      "Is Assembly Required?": "No",
      "Number of Pieces": "1",
      "Warranty Description": "Limited 3-Year Warranty",
      "Batteries Required": "No",
      "Included Components": "Toaster",
      "Import Designation": "Imported"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Ovens & Toasters",
      "Kitchen & Dining",
      "Toasters"
    ],
    "price": 99.95
  }
}