{
  "website_summaries": [
    {
      "verdict": "A lot of camera, both in lens and features, the Sony Cyber-shot DSC-HX200V is a solid choice for point-and-shoot users looking to do a little more than that.",
      "pros": [
        "The Sony Cyber-shot DSC-HX200V is a fast-shooting megazoom with excellent photo and video quality for its class, and plenty of shooting options to make casual and advanced shooters happy"
      ],
      "cons": [
        "The HX200V lacks advanced bridge camera features like raw image capture, a hot shoe, or mic input",
        "Some of its shooting modes and  general operation can get confusing if you want to do more than leave it in auto"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Image quality": 8.0
      },
      "publication_date": 20120607,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Bridge  Camera",
      "text": "This is a very nice camera.... it has nice presets and, as any bridge camera, lets you choose priorities for aperture, F value, Shutter speed, ISO etc.. Zoom is awesome (800mm) and of course with 18.2 MP, great resolution. Weight is OK.. and is very user friendly.. with an in camera help guide... ISO can go from 100 to 12600 (even though, everything above 8000 wouldnt look good). Definetely recommend.. Shame it doesnt give the option of choosing different lens, even though i have found here on amazon some lens for it.. maybe worth a try after...",
      "rating": 4.0,
      "verified": true,
      "author": "Erick",
      "helpful_votes": 5,
      "publication_date": 20121016
    },
    {
      "title": "A+ For what it is",
      "text": "This replaced my H5, and it is so much better, The H5 had the Zoom control in the wrong spot, Just holding the camera it would go to full zoom, a pain. This camera is much better, The manual options are very nice and the user interface is great, so glad they did not go with a touch screen, my fingers are too fat, I much prefer the buttons. The pictures are very very good IMO. The 1080P 60 frame video is also very very good. IMO The best bang for the buck. The Nikon 510 was nice but felt cheaper and smaller. Very happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Walker",
      "helpful_votes": 6,
      "publication_date": 20120422
    },
    {
      "title": "Nice Camera!",
      "text": "A great gift for my father !! If I had more money I would have bought a professional camera. But this camera takes her to all the events he attends. You have to put an ultra fast SD memory card if you want to take many photos in a row.",
      "rating": 5.0,
      "verified": true,
      "author": "Josue Cabrera",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Hands down my favorite camera of all I have ever bought!",
      "text": "I am not a professional and I wanted a nice camera to go on vacation to ensure I had great pictures and I am so glad that I did. I usually use the camera on my Iphone and that takes nice pictures but when I use this camera there is a night and day difference in how beautiful the pictures with the Sony Cybershot are in comparison. The zoom works great and the clarity is beautiful. I have tried working with changing the shutter speeds and other functions on this camera to be familiar with the options and it is very easy to use and learn. A great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Hamilton",
      "helpful_votes": 0,
      "publication_date": 20130824
    },
    {
      "title": "Way better",
      "text": "I have an old sony cyber shot and loved it until my son dropped it. This one takes way better photos. My old one always took blurry pics with out flash and this one so far has not. I've only had it a week or two. Still testing it out but so far seems great. One thing I do really like is that it has directions right in the camera all you have to do is press the ? button. The continous shooting is different then my old one and harder to use. The old one is better for that. but so far really happy with it and the price was great.",
      "rating": 4.0,
      "verified": true,
      "author": "bmom",
      "helpful_votes": 2,
      "publication_date": 20130320
    },
    {
      "title": "Great camera for beginners",
      "text": "Great camera for beginners. The zoom is awesome, the features are great, and the daytime quality is decent. The biggest cons would be the battery life, the limited rotation of the preview screen, and the poor quality of night shots. Get a second battery when you buy one.",
      "rating": 4.0,
      "verified": true,
      "author": "Konstantin",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Theres alot of camera here",
      "text": "I've only taken about 500 pics so far but the keepers are a lot higher percentage than my Panasonic was capable of. Its going to take a while to become proficient in all its capabilities. It does well in low light conditions, anti jitter works very good close up and with telephoto. Videos are sharp. Tried the video out at a fireworks display, hand held and got great results. The Panorama feature works great. The only complaint is the manual. Its missing a lot or its well hidden. Sony really needs to address this.",
      "rating": 4.0,
      "verified": true,
      "author": "Larslink3",
      "helpful_votes": 7,
      "publication_date": 20130710
    },
    {
      "title": "Sony Cyber-Shot Exceeds Expectations",
      "text": "This digital camera exceeded my expectations. It's easy to use, has a great optical zoom, and with both the LCD and SLR functions can be used in any light conditions. I haven't had time to use all the funtions yet, but so far it takes fantastic pictures. I highly recommend this camera due to its features relative to its price. It is very affordable. You won't care for this camera if you are looking for a pocket digital, but it's way smaller than my older Sony Mavica!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom K",
      "helpful_votes": 3,
      "publication_date": 20121002
    },
    {
      "title": "A technically wonderful machine",
      "text": "Importantly for me, it provides the usual viewfinder with the LCD screen view too, necessary for those with weaker vision. While it may deserve 5 stars, it turn on too easily by accident and it lacks a user's manual in the ordinary sense of one. The LCD allows a manual experience, but who wants to look at a tiny screen for instructions, except perhaps in an emergency? As for the photos it produces, you will only find outstanding performance that would require much, much more money in a traditional 35mm changeable lens camera. It is a big hit with me.",
      "rating": 4.0,
      "verified": true,
      "author": "DAVID A FULLER",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "An affordable High End camera",
      "text": "I am impressed with the ease of use and the great capabilities of this camera. The automatic settings are good enough to get very good pictures and video in almost any light condition, distance from subject, etc. This camera allows you to shoot video and perform zoom in and out at the same time, so it works pretty well as a video camera too, besides the image quality is really great. I had a Canon camera which suddenly died for no reason, and exactly the same happened to one of my friends recently. Personally I do not like the images from Canon cameras very much, I really prefer the colors and durability of SONY.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Sainz",
      "helpful_votes": 0,
      "publication_date": 20130608
    },
    {
      "title": "Powerful, Functional and Compact",
      "text": "In a fast-paced world full of cell phones with built-in cameras, it is frequently easier and faster to point and shoot than take the time to address quality and purpose. For me, this multi-functional camera addresses my desire to take photos or shoot video of high quality and do so in a compact package. The Sony Cyber-shot was highly recommended by a close friend as being one of the best he had ever owned at any price, and after using it for several weeks, I could not agree more. If you are looking for a quality product at an affordable price, take a look at this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "Clearance Sale Purchase",
      "text": "After thinking about buying a new digital camera for many months and researching options, my husband determined that to hit the quality bar he wanted would put us in the $400-500 range, which we were not willing to spend. I found this item on a One-Day Deal for half price (it's since been replaced with the newer model year), so we snagged it. Original price was in the high range we were looking for, so when we saw the sale, we took a chance on this model. It's absolutely great! The zoom is amazing, and it has tons of great features. Great find!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Great camera",
      "text": "I have had many compliments on the pictures I've taken. I took it on our Montana vacation this past August and was very happy with it. The camera lens cover can be irritating...it doesn't pop off when you turn the camera on. The camera is heavier than my last one but I've gotten used to both issues. I had a earlier version Cybershot so getting used to the camera was easy without an instruction book. The 18.2 megapixels make for clear pictures and the zoom is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Miller",
      "helpful_votes": 0,
      "publication_date": 20131005
    },
    {
      "title": "Beautiful camera",
      "text": "I got this a a replacement for my beloved Epson PC850, which finally gave up the ghost after 15? 20? years. So far I'm real impressed with its features and ease of use, though I haven't tried everything out yet. I mostly shoot on automatic, but I like having the manual options available when I want them. It does a great job on close-up shots, which I do a lot of in my job as a museum registrar, but I think it'll be great for portraits and landscapes, too. Haven't played with the movie function much, but it seems to do a good job compensating for unsteady hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130403
    },
    {
      "title": "great camera",
      "text": "the zoom feature is incredible. Great photo quality and tons of useful features. just have to learn how to use it better",
      "rating": 5.0,
      "verified": true,
      "author": "Mihaela Copil",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great camera, beautiful pictures plus GPS tagging",
      "text": "I took this camera with me throughout Thailand. I wanted a good SLR-style camera that didn't cost a fortune in the event I dropped it or it was stolen. Came home with beautifully sharp photos. The video was beautiful. I didn't use the myriad of features, mostly auto mode. However, I did use the panoramic function - very cool. It GPS tagged all of my photos too! NOTE ABOUT GPS: You have to connect the camera to your computer and use the Sony software to update the camera's GPS database every 3-4 months. Not a big deal but FYI.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas ParkerTop Contributor: Smart Home",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "Great camera once I purchased a battery",
      "text": "Great camera once I purchased a battery, memory card, lens cap and found then printed out the manual. This camera came with NOTHING!",
      "rating": 4.0,
      "verified": true,
      "author": "al sohl",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "I just love it!",
      "text": "Still trying to get through all the options on this camera - there are so many. Bottom line is that it takes a great photo and is easy to use. It gives you an option of using an auto mode or manual. It has a viewfinder which is great when you are outside in bright light and cannot see the display. The battery is long lasting, too. So far, I have not found anything I don't like about this camera. Couldn't be happier with my choice,",
      "rating": 5.0,
      "verified": true,
      "author": "Rfd0507",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "Great camera good price",
      "text": "easy to use, very low cost picture processing, good price. It comes with small amount of memory only good for about 17 pics. Plan early to get a level 4- 16 gig for about $12 san disk card. Lens cap pops off if you forget and turn it on. No haze filter included. Many extra shoot scenes, pan, close up, faces, kids, animals, etc. I like the low light capability, dont even have to use flash for many evening scenes. I can recommend it highly. Note the v stands for GPS which can be added to memory record for each shot.",
      "rating": 5.0,
      "verified": true,
      "author": "Rbets",
      "helpful_votes": 0,
      "publication_date": 20130603
    },
    {
      "title": "Better than SLR for non-pro/non-hobbyist",
      "text": "This camera is nothing short of amazing. I got it to replace a Nikon DSLR that was stolen, and I like this one much better. Not as many bells and whistles, but I didn't know what to do with the bells and whistles anyway. The lens is incredible, the zoom is outstanding, using the features is intuitive, and the LCD is so great I doubt I'll use the viewfinder even once. This camera is absolutely perfect, and the videos it takes are of incredible quality. Buy one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitch Gibson",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "Awesome camera!",
      "text": "I tried many cameras before finally settling on this one. This camera has everything I want in a superzoom camera. 18.2-megapixel, high speed AF, 30x/60x Clear Image zoom, Full HD 1080/60p with dual record, Active 3-way stabilization, GPS and Compass functionality, 3D stills and Sweep Panorama mode... The abilities of this camera are impossible to describe through words. You must try it to believe it! Oh and don't forget the Carl Zeiss lens! Has to be the best lens maker in the world!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy D.",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "Great camera for the novice and pro",
      "text": "Have taken many great pics with this Sony HX200V. The Zeiss lens allows as much light as you can get with a lens diameter of this size. Have taken many shot in lower early morning light (wildlife) and they have turned out quite well. The zoom is fantastic and the see-thru window allows me to get on target faster than looking a the LCD display. The tilt and swing LCD display is also great so you don't have to have your face aligned with the LCD. Can't go wrong with this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "DJH",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "Great Zoom Range",
      "text": "This a good camera with lots of features. The zoom allows closeups of distant objects as well a wide angle shots within a room. Image quality is reasonable for this type of camera - it is not a high end DSLR. It is a nice camera to travel with as it is very flexible in both focal length and choice of photos or HD movies. The GPS tags the locations of your photos so that you don't have to keep a log to remember where you shot that particular photo.",
      "rating": 4.0,
      "verified": true,
      "author": "paladinwest",
      "helpful_votes": 2,
      "publication_date": 20130726
    },
    {
      "title": "Good for the intended purpose",
      "text": "While I normally use a Canon DSLR Rebel t4i for most photography needs, I do like a smaller, simpler camera for taking along on kayak and camping trips. I was mainly searching for the zoom length when I purchased this camera and it did not disappoint me at all! Pictures are fast, crisp and in focus, and the colors are, I must admit, much better out of the camera than those with my Canon. I have always liked Sony digital cameras and this one keeps me right on liking them.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn A. Cummings",
      "helpful_votes": 0,
      "publication_date": 20131224
    },
    {
      "title": "Fly me to the moon?",
      "text": "Or, just take a picture. This camera can do that! We have all seen the sports cast where the camera man gets a good moon shot, well, now you can do the same with this camera. Here is the video that convinced me to buy this camera [...]. If you would like a video review, here is another link [...]. I would love to submit another video review, but I just got the camera. Even though Sony has released another camera, (better than this one!), this is still worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "does its job",
      "text": "I have had this for a month now, love the video feature, also tried a few of the preset features in picture mode , love the results and as always pictures in bright areas are excellent. can actually use the long zoom with the built in stabilizer in hand held mode. does a lot of corrections to make up for hand shake and bad lighting. fast zoom, excellent point and shoot if u do not care for the smallest form factor, battery life is decent, needs an after market external battery charger cause the included charger requires in camera charging .",
      "rating": 5.0,
      "verified": true,
      "author": "hard worker",
      "helpful_votes": 0,
      "publication_date": 20130118
    },
    {
      "title": "Nice Camera!",
      "text": "This is my 4th Sony camera and 2nd HX200V. This phone is awesome and I use it almost every day. I used my other HX200V to take over 10,000 pictures and it still works great. I wanted a newer camera so I picked another one. I highly recommend this camera for almost all shooting conditions. I use it for sunrise/sunsets, taking pictures while riding our motorcycle with my husband, he drives. I have taken hundreds of pictures of moving children and animals and majority come out great. This camera is very sturdy also.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Dillehay",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Digital Camera",
      "text": "This is an excellent camera for the serious photographer - it is a cross over camera - half way between a Point & Shoot and full blown Digital camera with all the toys. The perforamce is outstanding and will nevewr let you down. I have won many photo contests with this camera - excellent product - excellent price - excellent quality",
      "rating": 5.0,
      "verified": true,
      "author": "Russell J. Pendred",
      "helpful_votes": 3,
      "publication_date": 20130324
    },
    {
      "title": "Nice camera!",
      "text": "Overall I am very pleased with this camera. The focus is instantaneous and does not make a noise while recording video. The stabilization is excellent, in fact I don't know how they did it! If your hand is trembling the video will appear to have a slow ocean wave type of movement which is much more tolerable then shaking. The exposure for pictures is very good as well. You just press the button and it does everything instantaneously.",
      "rating": 5.0,
      "verified": true,
      "author": "markbyte",
      "helpful_votes": 0,
      "publication_date": 20130913
    },
    {
      "title": "Good camera but I have had some problems",
      "text": "I bought this camera for work, to take photos of apartments before and after tenants and for marketing photos. For the most part it's an excellent camera. The marketing photos have been turning out great! However, perhaps I'm doing something wrong because when I need a close up, for example to show how dirty a bathtub was left, or the inside of an oven, the photos aren't always clear. I am still learning so I am hoping to make the camera work for me.",
      "rating": 4.0,
      "verified": true,
      "author": "RetiredAndLovingIt",
      "helpful_votes": 2,
      "publication_date": 20130616
    },
    {
      "title": "Five stars for delivering performance for the price",
      "text": "For what I paid Amazon for this camera, I am pretty certain that it can't be beat. I haven't bought a new camera in a long, long time, when I saw what this camera could do on Youtube, and saw it was a Sony, I was sold. I have had this for about a month now, and have taken pictures every day, I haven't been disapointed at all. Remember, I said it's fantastic \"for the price I paid\", I'm sure you could pay more and get more.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Stone",
      "helpful_votes": 2,
      "publication_date": 20130305
    },
    {
      "title": "Great addition to my camera collection, I've re-evaluated because of screen scratches.",
      "text": "Functional in all aspects. Great addition to my camera collection. This comment was accurate for an in house evaluation, however, when I took it ourdoors the screen was so scratched I couldn't see the image. Is it possible to return this camera?",
      "rating": 5.0,
      "verified": true,
      "author": "William R Johns",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "You'll take a lot of photos! Be prepared with a backup routine!",
      "text": "We purchased this as a family camera for all of our photo needs. It does an extremely nice job on action photos (kids playing soccer) and allows us to pick the best shot by taking a series with one shutter button press. Recently we started doing a little video and it works just fine for that as well. If I have any complaints about this camera it is that we tend to take too many pictures with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Johnnie Norsworthy",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Just what I had hoped for",
      "text": "Took it to Yellowstone and came away with some gorgeous shots. Any shortcomings were on the part of the photographer, not the camera. My grown daughter, who went with me, I think has now claimed it for her own. So I'm in the market again. Will definitely give Sony Cyber-shot a close look.",
      "rating": 5.0,
      "verified": true,
      "author": "K-Dog",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "it's a great intermediate camera and it fits my needs perfectly",
      "text": "Has the performance and some of the options of a higher end camera, while retaining a lot of the simplicity of a point and shoot... it's a great intermediate camera and it fits my needs perfectly. Most of the time I have it on the automatic adjustment setting, but if I wanted to change settings for aperture speed or whatever, I could.",
      "rating": 5.0,
      "verified": true,
      "author": "skierofeast",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Excellent camera!",
      "text": "The Sony Cyber-shot DSC-HX200V is a great camera for a novice who wants to get into photography, but isn't ready to learn the ins and outs of an SLR. This camera can do anything you need it too with lots of great features like manual focus, panoramic photos, and image filters. The zoom is great for far off shots too.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Rivera",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "Bridge camera",
      "text": "I think bridge camera is a good description. I was looking for a step up from my point and shoot . This camera seems to fill the bill for me . I like the fact that I can get good zoom shots and not have to carry extra lens. It seems to have plenty of adjustable settings. I've had about a month so still learning all the features. Did get some low light pics of the moon. You can see the craters on the moon. Fun camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20121127
    },
    {
      "title": "Love this camera!",
      "text": "I did make a mistake in buying a used one to save money. It was clearly stated that it included camera and bag only, but the lack of a charger and other box items was not worth the money I \"saved.\" The camera is amazing, though, with its ability to move from superzoom to macro with a click of the dial and has enabled me to easily capture shots I've longed for with my previous SLR.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Goodrich",
      "helpful_votes": 0,
      "publication_date": 20130814
    },
    {
      "title": "5 Star Product",
      "text": "Excellent camera! Daughter absolutely loves it! Everything about it is good! Paired it up with an Accessory Set, we got here on Amazon and she’s good to go! She’s 25!",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie D. Gonzales",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Nice camera!",
      "text": "This was a great deal on sony's last year's model. It is the nicest camera I have ever owned. It is not an SLR, so if you want that this one won't do, but I have shot quite a few pictures with it and it does a great job. The fact it was the deal of the day and was about half off the regular retail made it an easy decision. I'm loving it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bert",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "works great",
      "text": "We bought this hoping we would take more pictures. We haven't done as much as we want, but when we do the pictures turn out amazing. I just need to figure out all the features so I can take even better pictures. The video quality is also great and a main reason to get this in lieu of getting an HD camcorder as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Melina",
      "helpful_votes": 0,
      "publication_date": 20140105
    },
    {
      "title": "Love this camera",
      "text": "This has been a great camera. Tons of great features, and easy to use. You don't have to be a professional photographer to take some really great shots. Does fantastic HD videos as well, panoramic shots (you click, hold and pan with the camera and it pieces the whole shot together for a cool shot), fun color features, etc..",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 2,
      "publication_date": 20121216
    },
    {
      "title": "Best camera I have ever owned!",
      "text": "I purchased this camera to take on my recent honeymoon to Costa Rica as we knew our old Sony poiint nad shoot wouldn't cut it anymore. I could not be happier with the quality of pictures this camera takes. There are certainly people more savvy than me that could probably take much better photos with it than I, but you will not be disappointed with the standard default setttings that optimizes everything for you. Also, the optical zoom on this camera is incredible for the camera being so compact. I could not be happier with this purchase. It also didn't hurt that we picked up cheap on Amazon because Sony was subsidizing their products for some reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric A Simaga",
      "helpful_votes": 0,
      "publication_date": 20130615
    },
    {
      "title": "This performs mixed results",
      "text": "This has given me mixed results. On Auto mode, sometimes very good (bright) quality pictures & sometimes shaky images. Looks like, the image stabilization is still not that perfect. It gives blur even if the object moves little. Another bad thing I observed is, the photos show distortion when I upload the photos to facebook. Probably I have to compress the file size. I have to try that.",
      "rating": 3.0,
      "verified": true,
      "author": "Kiran5July",
      "helpful_votes": 0,
      "publication_date": 20130416
    },
    {
      "title": "Takes photos as good as most more expensive cameras",
      "text": "This little guy is awesome! Takes photos as good as most more expensive cameras. And the telephoto lens is great.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wallace",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Love the zoom and the pictures",
      "text": "I returned a Panasonic because this camera had a better zoom and the landscape pictures were beautiful. The exposure on automatic + is beautiful. I do a lot of landscape and it handles multiple lighting and landscape scenes beautifully. I've been a Canon and Panasonic user for years, but this one is my favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Skiff",
      "helpful_votes": 2,
      "publication_date": 20130608
    },
    {
      "title": "This camera is phenomenal",
      "text": "I love this camera. Went to the Miami zoo for its first expedition out and it gets in so close to the animals, I zeroed in on a small portion of an elephant's face. I was told that the photos I took with it look like they came from a Nat Geo magazine. It's the most lightweight camera I could find with the best zoom.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Gray",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "It is awesome.",
      "text": "I bought this for one of my friends. As I wanted to give it as a gift, I used it for couple of weeks. And it was great. Truly amazing. Even when I gave it as a gift to my friend, He was very happy with its specification, and how it worked. Thought I've never used it's GPS capability. I bought it when it was on a deal through amazon. I would want to buy it again if it is on a deal :) We are able to take really long shots with great quality. When I first bought it I as skeptical about its Zoom feature but it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "AMAWSM",
      "helpful_votes": 0,
      "publication_date": 20130817
    },
    {
      "title": "Great Camera - Love IT",
      "text": "I had a Kodak camera for many years and loved it too. When I wanted a new one - I wanted one with a rear view finder in addition to the LCD screen (which isn't easy to find). I like to use the rear view finder when it is dark out or in bright sun light. I love the quality of pictures from this camera and it is super easy to use. The feel of it in your hand is also great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130905
    },
    {
      "title": "Great high-zoom camera",
      "text": "The Sony HX200V has met all my expectations. I purchased the camera to take shots of Elk and various other wildlife I am not always able to get close to and it has produced much better results than any of my previous point and shoots. I recently photographed a herd of elk from over 300 yards and even the texture on the velvet covering their antlers is visible.",
      "rating": 5.0,
      "verified": true,
      "author": "BartmanMT",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "Great camera!",
      "text": "Love this! I bought this for myself for Christmas, and I really love this. Makes awesome pictures and is easy to use. Highly recommend! The only draw-back is that it is a BIG camera. My old camera would easily slip into my pocket or purse, and this one isn't quite that easy. So, what I do with this camera is just hang it around my neck.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Charm",
      "helpful_votes": 0,
      "publication_date": 20130303
    },
    {
      "title": "wonderfull resolution.",
      "text": "the only complaint is that the lens cap hangs up when you turn it on. it takes fantastic pictures. the movies are phenomenal. the battery life is much better than my prior digital camera. resolution was my main requirement and this provided the best i could find in a reasonable zoom camera.",
      "rating": 5.0,
      "verified": true,
      "author": "garyhere",
      "helpful_votes": 6,
      "publication_date": 20120816
    },
    {
      "title": "Takes great pictures. Probably the best camera I have ever ...",
      "text": "Takes great pictures. Probably the best camera I have ever owned. The only downside is the 30min of video. It would be nice if there was not such a short video limit.",
      "rating": 4.0,
      "verified": true,
      "author": "Brian C Toner",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Excellent Photos and A+ camera.",
      "text": "This is my day to day camera, I love this easy of use and the lots of functions that you can use if you needed. A super zoom an a Macro complements the excellent camera. Sony made a very one one model. Congratulations to the Sony Team.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20140825
    },
    {
      "title": "Excellent camera",
      "text": "This camera is amazing. The Exmor sensor is the best system ever when light is a problem. The zoom and stabilization are the best partner because no matter if you want to use full zoom this camera always take pictures without blur. Great focus. The only bad is that I would have liked this camera had a compatible system to change lenses, but it is not.",
      "rating": 4.0,
      "verified": true,
      "author": "alvaromisea",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "Not the best mega zoom",
      "text": "The camera is well built, very easy to use. I consider it a very user friendly product. The camera took good pictures in most environments with plenty light. Did not do well with long range shots. Most came out blurry or they displayed too much noise. I am sending this product back. Its more average than great.",
      "rating": 3.0,
      "verified": true,
      "author": "Vo-Flex",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "Great starter camera",
      "text": "I was tired of using cheaper cameras ($100 range) because of the slow shutter speed. This camera has quick shutter speed and even has the option of taking 5 shots with the push of the button once. This makes it great trying to take pictures of kids playing outside, sports games, and anything else that doesn't hold still for a photo. The video quality is also high, so high that you can transfer them off your memory card to a Blu Ray disc. Great camera for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "badkharma22",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Lots of great options for photos at a great price",
      "text": "There are several different ways you can use this camera - as a still camera with a great telephoto capability, as a HD video camera, and as an in-camera photo editor. I bought this on Amazon at a terrific, albeit temporary, sale price, so I'm very happy with my purchase. Sony does however have an updated version of this model now available.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura in BC",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "Takes great pictures!",
      "text": "This camera is super easy to use and takes great pictures, both up close and landscapes. You can use the camera in many different setting from fully manual to fully automatic to only showing red tones in a picture. I've had no problems with it and have used it daily for almost 2 months. I love this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20130916
    },
    {
      "title": "Awesome Camera",
      "text": "If you can't get good pictures off this camera you need to read the manual if that still doesn't work then you need to take a class in photography. If all that doesn't work then give the camera to someone else. At 18.2 MP this camera will produce very good images at the largest typical size found in a home.",
      "rating": 5.0,
      "verified": true,
      "author": "Emme",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Amazing",
      "text": "You can do SO much with this camera. I needed to update, and shopped for a long time to get the right fit for us and my business. The best part about this is that the manual is on the camera, so if you need help it's only a few buttons away. It's not as light as something slim that would slip into a purse (or pocket) but it's not as heavy and bulky as something 100% professional either. It's a really great camera for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Fulton",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "Lightweight and crisp pictures",
      "text": "I have used a Canon DSLR for several years and the weight of the camera/lens began to cause pain in my hands and wrists. Based on other reviews I purchased the Sony. It is so much more lightweight, but you have the feel of holding a larger camera. I needed lens stability and have had no issues with blurry pictures (except for fast moving grandkids). I'm still trying to get familiar with all the multiple settings, but overall I really like this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky T",
      "helpful_votes": 2,
      "publication_date": 20130604
    },
    {
      "title": "Great camera, Recommend it for sure",
      "text": "I looked at reviews for about a week on all different cameras of this category and this one for the price and what it offers with its features was great. My wife uses this camera all the time for everything and she loves it, and I got her the accessories kit with and it is just awesome. Great device",
      "rating": 5.0,
      "verified": true,
      "author": "Scoop",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Excellent camera!",
      "text": "Have used for about 2 months, still learning the options. Have had multiple digitals over ten years, and usually photo edit most pix. Pix from this are most always so clean, don't require any \"touch-up\". Only complaint: When holding camera to shoot with one hand (right), tendency to hit the flash on/auto button with thumb. Other wise, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Juke",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "I like the automatic features of this SONY camera",
      "text": "this camera is an advanced point and shoot. I was considering buying a DSLR, but I don't need the extra features of those. I like the automatic features of this SONY camera. I use it almost everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader One",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Fast shutter speed!",
      "text": "We have used very few features on this camera yet, but so far we love the picture quality and the fast shutter speed! The shutter speed was the main reason for the purchase as our 2 year old is not cooperative when it comes to picture taking. This way we can actually catch the smile!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Awesome Camera!",
      "text": "ITS REAL AWESOME CAMERA ITS BEST CAMERA I NEVER HAVE AMAZING PHOTOS QUALITY AND VERY CLEAR PHOTOS AND FAST BUT I WAS LOVING TO BUY THE HX300 NEXT TIME REAL THANKS AMAZON FOR SEND ME THE SECOND ONE AFTER THE FIRST ONE LOSE IN SHIPPING THANKS A LOT.",
      "rating": 5.0,
      "verified": true,
      "author": "MMRashad",
      "helpful_votes": 0,
      "publication_date": 20130319
    },
    {
      "title": "I like this camera",
      "text": "It seems to take really clear pictures - even when you are moving. Video is crystal clear. If you want to burn the video to DVD n HD you will need a blue-ray burner. You will also need special software to view, edit, and encode the video's for burning to a DVD. I downloaded \"Magix\" Movie Edit Pro from Amazon for this job. It works pretty good but does take some time to encode. Overall we have been happy with this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20130214
    },
    {
      "title": "FANTASTIC CAMERA!!!",
      "text": "Love this camera! Easy to use and the 30X is fantastic and even with my shaky hands the pictures turn out perfect. I do recommend this camera to anyone but would also recommend purchasing a tri-pod for taking those long shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Customer 13",
      "helpful_votes": 0,
      "publication_date": 20131210
    },
    {
      "title": "Very nice camera",
      "text": "Great camera, I have taken this thing all over the place and it works so great every time. So glad I picked this camera. I would buy another Sony again after having this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "Great Camera!",
      "text": "I wasn't familiar with the Sony camera, but I loved the fact that it had an optical viewfinder as well as a LCD display. Once I started to find out what it could do I just fell in love with it. If you want to use the optical viewefinder it automatically switches by placing your eye up to the viewer. The picture quality is outstanding. The zoom strength is superb. The price was very reasonable and the delivery time was fanastic. I would recommend this camera to family, friends and fellow travelers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary B",
      "helpful_votes": 0,
      "publication_date": 20130417
    },
    {
      "title": "wow! i love this camera~",
      "text": "The more I use it and the more I figure out all the different settings the more i love this camera. I have taken action shots of my pup easily, taken still shots easily, and I am looking forward to taking it on vacation for some more play time.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Nice camera. Really brings in distant objects when you ...",
      "text": "Nice camera. Really brings in distant objects when you need it. I wish the owners manual was printable, but it is not. Operation is similar to other Cyber-shot pocket cameras, which is nice. I would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Grant",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Really nice camera",
      "text": "This is a larger camera than we are used to but it takes great pictures. We can see the difference between these pictures and the ones you take with the small instant cameras. We are not experts in photography so this is a nice blend of great picture quality without a lot of functions that we would never use.",
      "rating": 5.0,
      "verified": true,
      "author": "HW",
      "helpful_votes": 3,
      "publication_date": 20130704
    },
    {
      "title": "Just simple and excellent",
      "text": "This was simply a great camera. The photo quality is 1000x better any other camera brand in this price range. Before getting this unit, i tried Canon, Nikon, and Samsung equivalents but they just didnt match up to the quality of this Sony Cybershot camera. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammad Najar",
      "helpful_votes": 0,
      "publication_date": 20130601
    },
    {
      "title": "Awesome camera",
      "text": "I am new to photography and decided to buy this camera based on the reviews. I have not been disappointed. I love the fold out LCD screen, the enormous setting options, etc. I'm still learning all the many options to use on the camera and am loving every minute of it!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hartin",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "... and there but for it being used its a nice camera. Wish it would have come with instruction ...",
      "text": "Few blemish scratches here and there but for it being used its a nice camera. Wish it would have come with instruction manual as I am confused about a couple of things. But overall seller shipped out quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara J",
      "helpful_votes": 0,
      "publication_date": 20150924
    },
    {
      "title": "Great Camera",
      "text": "lots of features; takes fantastic pics!!! I am still learning something new about this camera every day. wonderful purchase! great for an amateur who wants to take more professional looking pics",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly D Miller",
      "helpful_votes": 0,
      "publication_date": 20130629
    },
    {
      "title": "Sony Cyber-shot DSC-HX200V 18.2 MP Exmor R CMOS Digital Camera with 30x...",
      "text": "This camera is perfect for my needs, which are taking digital pictures and loading on my computer Great pictures! Easy to use compared to the nikon that I had Arrived intact Wonderful Price Free Delivery No Tax",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Brouillette",
      "helpful_votes": 0,
      "publication_date": 20131030
    },
    {
      "title": "Versatile Family Camera",
      "text": "Nice, clear pictures and video. Love the zoom and panorama features, and the fact that you can zoom while filming video. For me, this camera is easy to use. It has several automatic settings, so I can take a picture quickly, and still have it turn out well. There are also manual options, such as focus and ISO, that I haven't used much yet. I am looking forward to learning more about photography as I research how to use these options. I am very satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Riverwalkr2",
      "helpful_votes": 0,
      "publication_date": 20130909
    },
    {
      "title": "Takes Fantastic Pics & Easy to Use!!",
      "text": "We love this camera and would recommend it to all who share an interest in photography. Easy to use with easy to understand options. Love the zoom and that we don't have to be on top of someone to get a good quality picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs B",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "great product",
      "text": "I bought this for a family member in the real estate business. Good lens to get wider view of small rooms. Amazon had a super deal too which was much appreciated. Fast shipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Bas the MythBaster,,LOLC.",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Camera",
      "text": "This camera arrived in such a quick time frame. I love its 30x zoom and the large, movable viewing screen in the back. It is so easy to operate. I would highly recommend this camera to anyone who wants a nice, easy point and shoot camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine A Houser",
      "helpful_votes": 0,
      "publication_date": 20131010
    },
    {
      "title": "I really like this camera and I am still learning",
      "text": "I really like this camera and I am still learning. Not super happy with the fussy focus while doing macro shots. Pictures are very clear. Lots of options to learn.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Lockrey",
      "helpful_votes": 0,
      "publication_date": 20140825
    },
    {
      "title": "Wonderful camera",
      "text": "Takes the best pictures I have ever taken. Easy to use. Easy to charge. Takes great close ups of people. Took beautiful pic of scenes at the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Oldaker",
      "helpful_votes": 6,
      "publication_date": 20130718
    },
    {
      "title": "It's A Great Camera",
      "text": "Amazing options and functionality all built into a lightweight camera. Great for the amateur who wants everything from high quality video to super zoom and a great second/backup camera for someone with DSLR equipment when you don't want to lug your heavier stuff around.",
      "rating": 5.0,
      "verified": true,
      "author": "RJS",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "Best Camera ever",
      "text": "Took it to Vegas, loved the clarity. Amazing speed, just what I was looking for. No issues with speed, or anything it all. In an auto mode, it was point and shoot with AMAZING results. I strongly recommend it to all. I did a lot of research and trial with Canon too, but this far surpassed it. Zoom was amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "World wide shopper",
      "helpful_votes": 0,
      "publication_date": 20130311
    },
    {
      "title": "Just Love IT",
      "text": "I have an older Sony Cyber Shot that I really love and still do but this one has a few more bells and whistles to where it is very easy to use. I use it to take wildlife pictures and because of the 30 zoom, I can get close ups without scaring the animals.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Daniel",
      "helpful_votes": 0,
      "publication_date": 20130207
    },
    {
      "title": "Great camera for the price",
      "text": "Easy to use; quite fast; great resolution; handy adjustable viewer. Still trying to figure out how to do manual focus...I use it to photograph birds, and they aren't always sitting out front, so I need to focus further back than auto wants to. When i get this figured out I'll give it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "JOHN BLACK",
      "helpful_votes": 0,
      "publication_date": 20131212
    },
    {
      "title": "Satisfaction",
      "text": "Product was what the description said. I consider it was a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "I",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Excellent, well-built camera",
      "text": "It has been one year since I bought this camera. I have never had a problem with it. We use it regularly to shoot video at the skate park. Great quality video, easy to use interface.",
      "rating": 5.0,
      "verified": true,
      "author": "B.B.",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "Christmas Gift",
      "text": "My husband and I bought this camera for ourselves as a Christmas gift. We are still using it to this day and have taken it on many trips, including Hawaii. Takes very clear pictures and is easy to operate.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Kittel",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Good family camera",
      "text": "I'm not a photographer, but I am able to get great quality pictures and the settings are very intuitive and user friendly. The zoom capability on this camera is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "JennF",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Great little digital camera.",
      "text": "This was a replacement for my wife's older Kodak digital camera. She really enjoys this one. She takes a lot of outdoor pictures of the wildlife that hangs around the pond in front of our apartment. The pictures are very crisp and clear. It has taken her a bit to get used to the new menu system on this camera but now she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130319
    },
    {
      "title": "Great camera for the money!",
      "text": "This camera has a really nice zoom. We are ranchers and shooting from a fair distance is important but having a huge camera is hard to pack on your horse. This is a good size, clear pictures, and worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "RanchWife06",
      "helpful_votes": 0,
      "publication_date": 20130311
    },
    {
      "title": "sony hx200v",
      "text": "I had previously owned the Sony hx100, and decided to upgrade when the 200x came on the market. both are excellent one piece cameras, and the 200v has that little bit more - particularly in the zoom area. an excellent choice for me.",
      "rating": 5.0,
      "verified": true,
      "author": "kiwi",
      "helpful_votes": 0,
      "publication_date": 20120517
    },
    {
      "title": "A Keeper!",
      "text": "I have been taking pictures with my new HX200V and am really elated with the results. I like the camera's ability to zoom manually without having to use the lever. Happy that I chose this camera over the Panasonic Lumix FZ 150. A hobbyist photographer for over 50 years this is my first Sony camera.",
      "rating": 5.0,
      "verified": true,
      "author": "HGH",
      "helpful_votes": 3,
      "publication_date": 20120712
    },
    {
      "title": "Stellar and solid camera",
      "text": "Amazing camera. Everyone kept complimenting my pictures also the battery life lasts long. The auto scene image plus is usually the best setting to set this on if you're not DSLR saavy",
      "rating": 5.0,
      "verified": true,
      "author": "Dena ahmed",
      "helpful_votes": 0,
      "publication_date": 20131102
    },
    {
      "title": "Absolutely wonderful camera with affordable budget",
      "text": "I and my husband have been using this camera for more than 8 months now. We have gone through the specifications and prices of other cameras in this category before we finally order this camera and we love every feature of this camera. It is the best camera for this budget and clearly beats its competitors in this range. This camera comes with a cool GPS feature too, though we have not used it yet but it is good to have :). I strongly recommend this camera to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "yasmeen",
      "helpful_votes": 2,
      "publication_date": 20130325
    },
    {
      "title": "me too",
      "text": "I have to concur with \"tech guy\". His review is as good as the camera. I am very impressed with the high quality of the Zeiss lens and the fantastic range. The image stabilization is much better than one would anticipate. This is truly a carry it anywhere camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles W. Taylor",
      "helpful_votes": 0,
      "publication_date": 20121208
    }
  ],
  "product_meta": {
    "title": "Sony Cyber-shot DSC-HX200V 18.2 MP Exmor R CMOS Digital Camera with 30x Optical Zoom and 3.0-inch LCD (Black) (2012 Model)",
    "description": "Frame your shots like a pro with the Sony Cyber-Shot 18.2MP digital camera. Its 18MP sensor and Sony digital camera 30x Zoom 3.0\" LCD display help you capture breathtaking photos at up to 10 fps, plus ultra-stabilized Full HD 1080/60p videos. The High Speed Focus of this Sony DSC-HX200V Cyber-Shot black digital camera improves AF speed and accuracy, while a GPS and compass record location and shot direction so you can share your trips online. Note: Memory card not included. Purchase of a memory card is highly recommended.\n\nFROM THE MANUFACTURER\n A+ \n\n\n\n\n\nFrame your shots like a pro with the DSC-HX200V. Its 18.2MP sensor and \n30X optical/60X Clear Image zoom capture breathtaking photos at up to \n10fps, plus ultra-stabilized Full HD 1080/60p videos. Exmor® R CMOS Sensor. High speed AF. 60x Clear Image Zoom/ 30x optical zoom. The 18.2MP Exmor® R CMOS sensor captures ultra-high definition images that take full advantage of the sharp Carl Zeiss® Vario-Tessar® lens. The sensor enables advanced processing that reduces noise levels resulting in stunning low light images with incredible details. Focusing is faster than ever thanks to the collaboration of four technologies: an advanced Sony G lens, Exmor® R CMOS sensor, a newly-developed BIONZ® image processor and optimized focus processing. The HX200V combines impressive 30x optical zoom with Clear Image digital zoom technology to offer a whopping 60x total zoom. \nTechnology 18.2 Megapixel Back-illuminated Exmor® R CMOS Image Sensor The 18.2MP Exmor R CMOS sensor captures high resolution images that take full advantage of the camera's sharp Sony G lens. Advanced BIONZ® image processor analyzes data from the sensor & activates By Pixel Super Resolution technology reducing noise, resulting in stunning low-light images. High speed AF To improve focusing speed and sensitivity, the Exmor® R CMOS sensor uses its rapid throughput to deliver high-quality image signals to the camera's BIONZ® processor. The result is fast, DSLR-like focusing speeds, even in low light. 60x Clear Image Zoom Zoom in close for great travel, sports and wildlife photos without the inconvenience of additional lenses or equipment. The HX200V combines impressive 30x optical zoom with Clear Image digital zoom technology to offer a whopping 60x total zoom. Powerful pixel-by-pixel processing reduces graininess for crisper, more realistic, higher-quality images. Full HD 1080/60p Record crystal clear movies at the highest resolution available with capabilities for 60p in 1080.1 This provides stunning, fast motion video with less distortion for playback on \nyour HDTV.2 Never Miss a Moment Capture up to 10 frames per second at full 18.2MP resolution. The perfect feature for high-speed sports or capturing a unique sequence of photos, no matter how fast the action, you know you'll get the shot. Plus, a mechanical shutter helps reduce distortion when continuously shooting moving subjects for even crisper, clearer high-speed shots. Say Goodbye to Blur Don't let a not-so-steady hand prevent you from capturing the moment. Optical SteadyShot™ image stabilization compensates for camera shake by countering camera movements in both horizontal and vertical directions. Active 3-Way stabilization adds digital rolling control for steadier videos even at long focal lengths. \nProduct description and full feature list Explore the full range of features and options below. \n18.2 Megapixel Back-illuminated Exmor® R CMOS Image Sensor\nThe 18.2MP Exmor® R CMOS sensor captures ultra-high definition images that take full advantage of the camera's sharp Carl Zeiss® Vario-Tessar® lens. The sensor enables advanced processing that reduces noise levels resulting in stunning low light images with incredible details.\n\nHigh speed AF\nTo improve focusing speed and sensitivity, the Exmor® R CMOS sensor uses its rapid throughput to deliver high-quality image signals to the camera's BIONZ® processor. The result is fast, DSLR-like focusing speeds, even in low light.\n\nOptical zoom plus Clear Image zoom\nMost digital zooms use electronic cropping to get closer to the subject, resulting in unsharp images. With Clear Image Zoom the powerful processor compares patterns found in adjacent pixels and creates new pixels to match selected patterns, resulting in more realistic, higher-quality images. Clear Image Zoom doubles optical zoom for closer photos. \n\nFull HD 1080/60p\nRecord crystal clear movies at the highest resolution available with capabilities for 60p in 1080.1 This provides stunning, fast motion video with less distortion for playback on your HD TV.2 With dual record of stills and movies, you can shoot both at the same time.\n\nOptical SteadyShot™ image stabilization with 3-way Active Mode\nOptical SteadyShot™ image stabilization reduces shake and blur by countering camera movements in both horizontal and vertical directions. Active 3-Way stabilization adds digital rolling control that counters clockwise and anti-clockwise rotation, resulting in more stable videos even at long focal lengths. \n\nGPS and Compass\nGPS and compass record location data and camera direction as you shoot movies and photos. GPS Log lets users track a photographic journey and later view the path and images on a map. Map View in PlayMemories Home™ software, allows users to view images on a map showing where they were taken. The logged path and images can also be displayed on Google Earth.4\n\nCapture the decisive moment\nwith up to 10fps\nCapture full 18.2 megapixel resolution images at up to 10 frames per second, helping to ensure that the decisive moment is captured such as the soccer ball flying into the goal. In addition, a mechanical shutter helps reduce distortion when continuously shooting moving subjects.\n\n\nPicture Effect for\nmore expressive photos\nPicture Effect adds a new level of expression to photos, making ordinary landscapes and portraits come to life by heightening mood and emphasizing certain attributes. Select camera models have up to nine different effects.\n\nPhoto Creativity \nPhoto Creativity allows you to fine-tune your exposure settings, such as brightness, color, and vividness, and quickly choose the right enhancement for your subject. Now you can view Picture Effects and Photo Creativity effects in real time on the camera's monitor or in the viewfinder before shooting.\n\nBackground Defocus\nDSLR photographs are often beautiful because they blur the background, putting the emphasis on the subject. Now our point-and-shoot cameras can deliver this signature DSLR benefit. The system takes two shots, identifies the background and applies a defocused background keeping the subject crisp and clear. \n\nIntelligent Sweep Panorama™ \nHR mode\nWith Intelligent Sweep Panorama™ HR mode just press the shutter, pan the landscape and let the camera do the rest. It automatically links together each frame to produce a high resolution panoramic image providing the ability to zoom in on small details. This model even detects faces and moving subjects to stitch intelligently different widths to help avoid subject distortion.\n\nSuperior Auto mode\nGet cleaner, more dynamic pictures and fewer missed shots. The camera automatically recognizes the correct scene mode, then quickly shoots and combines up to six shots to produce images with greater clarity, optimum dynamic range using backlight correction HDR technology and lower image noise using 6 shots layering technology. Superior Auto intelligently detects 33 scenes for still images and movies, making it easy to get the best shot. \n\nFace Detection technology\nFace Detection technology detects up to eight individual faces and adjusts focus, exposure, and white balance to help deliver crisp, properly lit images of family and friends. \n\nSmile Shutter™ technology\nSmile Shutter™ technology captures a smile the moment it happens. Simply press the Smile Shutter™ button and the camera does the rest. You can also select adult and child priority and indicate the degree of Smile Detection sensitivity. Intelligent Scene Recognition can now be used together with Smile Shutter™ mode when the Intelligent Auto mode is on.\n\n3D still image and 3D Sweep \nPanorama™ mode\nProduce awe-inspiring images with 3D still image and 3D Sweep Panorama™ capabilities.3 Photos will take on a new dimension of creative capabilities for viewing the world in a whole new way.\n\nAnti-blink Function\nIt's frustrating to capture the perfect shot, only to review it later and discover subjects blinked during the photo. The Anti-blink function works to help counter blinking and squinting. When the camera is set to Soft Snap, the Anti-blink function captures two images, recording only the photo with less squinting. If a blink is detected in other shooting modes, a warning will be displayed after you take the shot. \n\nSoft Skin mode\nPortrait subjects will love the results. Soft Skin mode recognizes skin tones and reduces the appearance of blemishes and wrinkles without affecting the rest of the shot. \n\nIntelligent Scene Recognition mode\nIntelligent Scene Recognition (iSCN) Mode automatically detects 33 different types of scenes and selects the appropriate camera settings. In Auto Mode, the camera takes a single shot using the optimal settings. In Advanced Mode, the camera takes a photo with the optimal settings and, if in difficult lighting (low light or back light) immediately takes a second photo with another optimized setting so you can choose which to keep.\n\n\n\nWhat's in the box: Sony Cyber-shot DSC-HX200V Digital Camera, NP-FH50 H-Series Info-Lithium Battery Pack, AC-L200 AC Adapter, Micro USB Cable, AC Cable, Shoulder Strap, Lens Cap, Lens Cap Strap, Instruction Manual and 1-Year Limited Warranty. \n\n\n1. Records in 29 minute segments\n\n2. Requires HDTV and HDMI cable sold separately\n\n3. Requires 3D HDTV, HDMI cable (at least 10.2 Gbps) and active 3D glasses sold separately.\n\n4. Service provided by Google and subject to change without notice.\n\n© 2012 Sony Electronics Inc. All rights reserved. Reproduction in whole or in part without written permission is prohibited. Sony, Cyber-shot, Optical SteadyShot, Smile Shutter, Sweep Panorama, Exmor, BIONZ, PlayMemories Home and the Sony make.believe logo are trademarks of Sony. HDMI is a trademark of HDMI Licensing LLC. Microsoft, Windows, and Windows Vista are trademarks of Microsoft Corporation. Mac is a trademark of Apple, Inc. All other trademarks are trademarks of their respective owners. Features and specifications subject to change without notice.\n\n\n\n\nNP-FG1 InfoLITHIUM® G Type Rechargeable Battery\n3.6V typ. 3.4Wh (960mAh)\n\nNP-BN1 LITHIUM Ion N Type Rechargeable Battery \n3.6V typ. 2.3Wh (630mAh)\n\nNP-BX1 LITHIUM Ion X Type Rechargeable Battery \n3.6V typ. 4.5Wh (1240mAh)\n\nNP-FV50 InfoLITHIUM H-Series Rechargeable Battery \n6.8V typ. 6.1Wh (900mAh)\n\nNP-FG1 NP-BN1 NP-BX1 NP-FV100 DSC-HX200V DSC-HX30V DSC-HX20V DSC-HX10V DSC-H90 DSC-TX200V DSC-TX66 DSC-TX20 DSC-WX150 DSC-W690 DSC-WX70 DSC-WX50 DSC-W670 DSC-W650 DSC-W630 DSC-W620 DSC-W610 DSC-RX100 DSC-RX1",
    "rating": 4.5,
    "feature_bullets": [
      "18.2 megapixels \"Exmor R\" CMOS sensor for superior low-light performance",
      "30X optical zoom",
      "3.0-inch LCD",
      "GPS and Compass record shot location & direction",
      "Optical SteadyShot image stabilization with 3-way Active Mode"
    ],
    "specifications": {
      "Product Dimensions": "4.8 x 3.66 x 3.43 inches",
      "Item Weight": "1.29 pounds",
      "ASIN": "B006K551TO",
      "Item model number": "DSCHX200V/B",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.5 out of 5 stars512 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#148,696 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 27, 2012",
      "Department": "Digital Cameras",
      "Manufacturer": "Sony"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 199.95
  }
}