{
  "website_summaries": [
    {
      "verdict": "A 4-person tent tall enough for an adult to stand in.",
      "pros": [
        "Sturdy steel and fiberglass frame",
        "2 internal storage pockets",
        "Great airflow in warmer weather",
        "Easy to set up",
        "Absolutely stays dry",
        "8' x 8' footprint with a 7' middle height"
      ],
      "cons": [
        "Interior pockets are placed high, making them hard to reach when you're lying down"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Floor is NOT WATERPROOF.  WATER COMES UP THROUGH FLOOR",
      "text": "This tent is a waste of money and should not be purchased. As others have said, the floor material is very thin, which requires a tarp to be put down. I used the tent last weekend. It rained all weekend and puddles of water got between the tarp and the floor. The water impregnated the material and after around 10 hours started coming through the floor. My clothes got wet and I was miserable and had to buy a hotel room. DO NOT BUY THIS TENT. Get a regular tent with a water impervious floor. Eureka has no business making tents if it doesn't know that floors have to be waterproof. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20181205
    },
    {
      "title": "Works Great !!",
      "text": "This tent is GREAT ! In the campground, In the woods, And on the beach ! Withstands all types of weather conditions. I was really impressed. The beach it was a little bit of a struggle setting up with the wind, But once up it was like bulletproof, good stakes and all lines tied down, It didn't budge. More adventures ahead !",
      "rating": 5.0,
      "verified": true,
      "author": "Vetteman07",
      "helpful_votes": 5,
      "publication_date": 20190831
    },
    {
      "title": "Great height & ventilation. Fine for two people",
      "text": "Great height. Fine for two people. Simple to set up. Eureka quality. Technically this tent (and any other tent) is rated for 4 people, will sleep 4 people, BUT WOULD BE VERY CRAMPED and much too crowded if you had to spend the day inside due to rain, especially if you wanted to include some camping furniture inside. At a minimum, I'd suggest a \"6-8 person tent\" for 3-4 people! I bought my first (of several) Eureka tents over 40 years ago, and the quality is still there. I especially like the heigh so I can stand up and the oversized windows for summer ventilation. i would buy this (or the larger version) again!",
      "rating": 4.0,
      "verified": true,
      "author": "R.H.",
      "helpful_votes": 3,
      "publication_date": 20180706
    },
    {
      "title": "CHEMICALS",
      "text": "Great tent, seems/feels sturdy. However, after having chemical irritation redness on hands, and the back of my neck burning, and the 100 gallons or so of water that was required to wash EVERYTHING that came into contact with this tent, I cannot say that I recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Zach JSB",
      "helpful_votes": 4,
      "publication_date": 20191008
    },
    {
      "title": "Spacious and Great Views",
      "text": "I loved the height! I’m 5’10” and I had no issues standing and had plenty of head room. I can put it up and take it down alone, but it’s easiest with two people. The poles are so sturdy and it held up in a few heavy rainstorms. The windows are perfect! There is a large window for views on each side and we enjoyed waking up and unzipping them to see the amazing views (the dogs loved it too). This would also work well as a “shade tent” for a table and chairs to keep the mosquitos away. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Good tent but ..",
      "text": "Nice cabin tent, fast shipment, packaged well. Eureka is my favorite brand, and this is a tent that seems it will last, it's made well. Waterproof, and love the zip up windows, held up during a rainstorm with mild winds. Small issues in design is the door zippers are at the bottom, not two way zippers, hard to bend to get the lower one. No pockets or storage lower than say 6 ft in this 7 ft tall tent, which has been a real issue. Over all a good tent but I do wish I'd researched my purchase more. Okay with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Quick and Easy for Short Trips",
      "text": "This is quick and easy to set up. Lots of windows for light and fresh air. Big enough for two, possibly add a couple of young ones. Best for short trips where you don't want to go to all the trouble to set up the multi-day tent. Only problem is there is no stiff ring around the interior floor to keep the floor flat so the exterior edges of the floor rise up making it difficult to get the benefit of the interior floor. For a quick night or two it's hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Tall",
      "text": "Absolutely love this tent! I am 50 years old and have been camping my entire life. I finally got the right tent! I am 5'6\" and can finally have standing room to change my clothes etc... It is perfect for 2 people with a queen matress but is PERFECT for one person, a cot, and a portable potty lol. I just had a 4 day trip with some friends and have the absolute best set up. They call it my she shed. Absolutely love it! Very easy to put up and take down and very spacious. I love the height",
      "rating": 5.0,
      "verified": true,
      "author": "Lucinda Oliver",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Good Purchase - Great Tent",
      "text": "Bought the tent for my son to use at a bluegrass festival. Just not room enough for everyone to sleep inside the camper. Worked perfect. We purchased a blow up twin size mattress and a battery operated lantern and he was \"good to go\". Once we understood how all the parts fit, it was easy to put up. Even though 4 people could sleep in it, I think it is best suited for 2 people so that you can move around real easy inside and have all your stuff inside with you.",
      "rating": 5.0,
      "verified": true,
      "author": "5 String Jo",
      "helpful_votes": 2,
      "publication_date": 20170925
    },
    {
      "title": "Flimsy and shoddy",
      "text": "The Eureka copper 4 tent is useless as constructed. Flimsy and shoddy flooring material. An indoor play tent has better flooring material. Floor shredded with first use even with ground cloth and interior rug. We used duct tape to repair in order to continue out-of-state trip. Tent poles rusted. We will not recommend purchase of this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Deborah Jackson",
      "helpful_votes": 4,
      "publication_date": 20180901
    },
    {
      "title": "Love this tent.",
      "text": "We've taken this camping twice. The second trip it rained for most of the 3 days. It did not leak inside. I love how tall it is with the straight walls, I bought it for my 6'2\" husband with a bad back. It's hard for him to bend over, and this tent has been good for him. I love how the window flps tuck into the tent, and that you can leave the fly off to see the stars. I can't wait to camp in it next time!",
      "rating": 5.0,
      "verified": true,
      "author": "Mareza",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Great tent",
      "text": "I went camping with my new tent and made the mistake of setting it up in a low meadow. After a night of furious rain, I was pleased to find that there were no leaks at all. Even though I could see water that had settled between the floor of the tent and the tarp I set it up on, it was nice and dry. Not only that, it took me less than 10 minutes to set up by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "OregonCynthia",
      "helpful_votes": 6,
      "publication_date": 20150921
    },
    {
      "title": "Tall ceiling!!",
      "text": "Set it up in my living room just to see how it was, super EASY and blew up a serta queen air mattress inside Which fit really well with lots of room to spare. I’m 5’7” and I can stand with arms extended and not touch ceiling Will update with how I like it out camping",
      "rating": 5.0,
      "verified": true,
      "author": "Avg. consumer REAL REVIEWER",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Great Tent",
      "text": "This is the first tent I have ever purchased. Reasonably easy to put together. Yes it's easier with two people. I've only used it on one occasion so I don't know how durable it will be. We put a queen sized cot in it and it was perfect for two people. You can stand in it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Great tent!",
      "text": "Amazing tent! Used in the gulf during some humid nights filled with mosquitoes and stagnate air. Thanks to the power cord opening I was able to put a fan in there. I have the 4 person which has enough room for a queen air mattress a small table and a 3 duffel bags. This tent is made for ventilation even with the rain fly. The door is easy open and close. Very easy quick set up and take down. Everything is well made and with purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea hoffer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "and would have expected something better for this price point",
      "text": "Floor material is same as walls, and would have expected something better for this price point. Use tarp under tent to help protect flooring. Able to easily stand up inside tent. The tent peg plastic parts within poles did not stay attached after second camping trip. Eureka honored warranty and mailed out replacement parts, plus a couple extra for free. Replacement parts arrived with a week.",
      "rating": 3.0,
      "verified": true,
      "author": "Debby Alexander",
      "helpful_votes": 10,
      "publication_date": 20150519
    },
    {
      "title": "Very easy to set up and tear down:",
      "text": "I appreciate the simplicity of Eureka's design with the Copper Canyon--I am very short, but was still able to set up and tear down this tent without any assistance. This is my first tall tent, and I love it! It's so nice to not have to hunch over while changing or getting things out of a tent! Would highly recommend, and will likely purchase future tents from Eureka as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca S. Rea",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Eureka makes a superior product",
      "text": "We bought a Eureka tent for our son in Oregon, primo camping country, and we fly up to visit and borrow it from him. Strategic thinking, right? I like the somewhat retro look of this tent it's a good height so you can stand upright to change clothes, and is easy to set up. A good tent!",
      "rating": 5.0,
      "verified": true,
      "author": "Law of Reciprocity",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Easy set up for one person!",
      "text": "I was a little worried about setting this up by myself, it's big, and it's tall! It turned out to be easy to assemble alone and I had no issues, even in 12 mile/hour wind. So roomy and comfortable. Enough room for cots, so nice to be able to stand without stooping, and generally a good tent.",
      "rating": 4.0,
      "verified": true,
      "author": "Jana Kelly",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "We slept comfortably every night and were able to stand and get ...",
      "text": "I used this tent for just two people. We slept comfortably every night and were able to stand and get dressed every day. My husband is six foot five, so he had to bend a little....but it was great. highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Poetivity",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Roomy",
      "text": "Seems everyone likes this tent because there were so many at the music festival I attended. Great in the rain. I have to train myself that I can actually stand up straight! So roomy and little ceiling hammock is great for little items that want to get lost. Just look up and there they are. This tent is so roomy, I actually thought I might get a little table to put inside.",
      "rating": 5.0,
      "verified": true,
      "author": "campernan",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Excellent tent. Now that I'm approaching 60",
      "text": "Excellent tent. Now that I'm approaching 60, it's nice to have two comfy cots inside so I'm not sleeping on the ground, plenty of room for hubby, medium size dog, bags, and me! Ease of setup is a huge plus, well-designed, nicely thought out. I've camped all my life and appreciate a no-muss tent!",
      "rating": 5.0,
      "verified": true,
      "author": "Cha Will",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "love it so much, I bought it twice....",
      "text": "Great Tent! Its my second of the same style, first one was left out in my yard for months & eventually tattered away from the sun.... Love the design & windows, my favorite tent for our family of 3.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel L.",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Good tent",
      "text": "I love the height of this tent. And it seems well constructed (haven't tried it out in the rain yet).. But I was a little disappointed that the 8'x8' dimension is to the poles, not the tent itself. It's probably 7'-6\"x7'-6\". Still pretty good, but smaller than my last 8' wide tent, which is a bummer. But all in all, I'll make it work.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Brown",
      "helpful_votes": 3,
      "publication_date": 20150918
    },
    {
      "title": "great tent, lots of room",
      "text": "great tent, lots of room, easy to set. (we have not tested it under rainy conditions yet.) the only issue I have with the tent -- the pockets are high above, along the top, all of them, I could not put a flashlight next to me.",
      "rating": 4.0,
      "verified": true,
      "author": "elena k. k.",
      "helpful_votes": 3,
      "publication_date": 20150904
    },
    {
      "title": "He can comfortably stand up in here",
      "text": "I bought this tent to accommodate my 6'7\" boyfriend. He can comfortably stand up in here. The tent is really easy to set up and has a reasonably sized footprint considering its height. Our queen sized foam mattress fits great with room left over for bags, etc. this was a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessicac",
      "helpful_votes": 2,
      "publication_date": 20151102
    },
    {
      "title": "Held up for Watershed beautifully",
      "text": "It’s tall, did not like the top having to be staked so we tied the top around the 4 poles,loved the tent, watched everyone else struggle, and everyone wanted to use our tent to change",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Great tent at a great price!",
      "text": "This is a great tent for the price. We wanted a tent with a high ceiling (for car camping) and after trying several other styles settled on this and have not been disappointed. Sturdy and well made and easy to set up. We liked this tent better then styles we paid twice as much for ! Would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth A. Skeen",
      "helpful_votes": 3,
      "publication_date": 20141106
    },
    {
      "title": "Sturdy, waterproof",
      "text": "Sturdy, waterproof, relatively easy to set up for 1 person. I'm very happy with this tent. Worth the extra few dollars. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Shame on you Eureka!!",
      "text": "I've always trusted this name for quality...not anymore. There are some pros on this tent design: tall, beefy poles, large windows. BUT the cons outweigh the purchase price. #1: the floor material is just like the sides...WAY too flimsy (Cot made a hole 1st day, WITH a tarp.) #2: Rain fly suffered small slits from pea sized hail (1st outing) #3: Set up not easy, especially when breezy #4: Pockets to hold keys and flashlights at the top of the tent, must stand up at night. I should have bought another Coleman...much better quality (and available at Costco for cheap!)",
      "rating": 2.0,
      "verified": true,
      "author": "~U~",
      "helpful_votes": 8,
      "publication_date": 20160813
    },
    {
      "title": "Great for the nieces and nephews",
      "text": "We used 2 of these tents when we had lots of family visiting. Convenient hole for power cords.",
      "rating": 5.0,
      "verified": true,
      "author": "online shopper",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Best tent imaginable",
      "text": "This tent packs up small and then unfolds into everything you could want in a tent. At 8x8’ it’s no space hog, but I can’t even reach the top of it on my tip toes. I’m headed out to camp for three months. Being able to stand up tall inside my wee house tent will be a huge morale booster. Every other tent I’ve had forces me into a Neanderthal posture that just isn’t cool over time. Buy this tent. I’m just saying.",
      "rating": 5.0,
      "verified": true,
      "author": "Van N",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "My one-man palace",
      "text": "Excellent tent. It takes a bit to put up by yourself, but it's like a private cabin in the woods.",
      "rating": 5.0,
      "verified": true,
      "author": "Bandersnoot",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Easy to Set Up",
      "text": "Easy to set up, well built, roomy. I had never camped before and I was able to set this up by myself. Roomy enough to put a Queen size air mattress in and had extra room for the backpacks!",
      "rating": 5.0,
      "verified": true,
      "author": "ANTLCOX5",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Good Quality",
      "text": "I don't have a lot of experience with tents - this seems easy to put up and pull down",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Excellent customer service from seller and Amazon",
      "text": "The is a beautiful tent and very useful in many ways providing beautiful 4-sides of window views, keeping bugs away, etc. and can be easily set up by one person. It is really worth the price. The seller responded my questions and requests in a timely fashion and very responsible. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cloudia",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Great Tent",
      "text": "We set it up (just to see how it went and it was a no-brainer. Seems well constructed and it even fit back easily into the carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti and Jeff",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Very nice general purpose tent especially considering the price",
      "text": "Very nice general purpose tent especially considering the price. Well above quality of the entry level tents you find in the big box stores.",
      "rating": 5.0,
      "verified": true,
      "author": "David Denn",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "This tent worked great for my 9 year old son and me at ...",
      "text": "This tent worked great for my 9 year old son and me at a scout camp out. I showed up without testing the tent before hand (because I'm really smart) and it worked like a charm. My 9 year old said he knew how to set it up without my help even though he had never set up or seen a tent being set up before. Well, he was wrong, but the tent was easy to set up anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "wootpro",
      "helpful_votes": 2,
      "publication_date": 20151220
    },
    {
      "title": "Great size and height",
      "text": "Great size and height, love the huge windows and love how the ceiling is all window without the rainfly. Great for a night under the stars. A little flimsy if you don't tie it down though,",
      "rating": 4.0,
      "verified": true,
      "author": "newman shanks",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "easy to erect and spacious",
      "text": "Heavy, easy to erect and spacious, ppl can stand up inside. Luxurious for queen air mattress, a couple, and car camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory N Thyssen",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Awesome tent. Pretty easy to assemble as well",
      "text": "Awesome tent. Pretty easy to assemble as well. I like all the large windows which allows air to flow through on hot summer nights.",
      "rating": 5.0,
      "verified": true,
      "author": "rlh",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "I had the Canyon 6 and truly loved that one but wanted one slightly smaller",
      "text": "I had the Canyon 6 and truly loved that one but wanted one slightly smaller. Like the head room but it's missing all the bells and whistles of the 6.",
      "rating": 4.0,
      "verified": true,
      "author": "Squirrelly",
      "helpful_votes": 4,
      "publication_date": 20141127
    },
    {
      "title": "This tent is great. Easy to put up and take down",
      "text": "This tent is great. Easy to put up and take down. Has plenty of room to stand in it. Its just what I had hoped for.",
      "rating": 5.0,
      "verified": true,
      "author": "rockersister",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Love this tent",
      "text": "Love this tent! I am so happy to be able to stand up inside. It also has great windows for viewing out of and just laying inside and dreaming. Many mosquitoes outside so I spent lots of time in the evening and morning in here!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber Rose",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "Love this tent",
      "text": "Love this tent. I did a lot of research before settling on this tent, and am happy that I did. It is easy to put up and take down and being able to stand up is worth its weight in gold.",
      "rating": 5.0,
      "verified": true,
      "author": "Tejaspro",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "by myself 15 min that's not bad for an 8ftx 8ft",
      "text": "this was the easiest tent that I have ever put up .by myself 15 min that's not bad for an 8ftx 8ft ,then 2hours after putting up the rain came steady for 2 hrs after opening up found 2 spots of water the size of a quarter.",
      "rating": 5.0,
      "verified": true,
      "author": "john budnick",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Awesome tent as a 6'3 guy",
      "text": "Awesome tent as a 6'3 guy, as I can stand up no problem. It's super spacious and has become my go-to tent for trips to state parks with my dog, who gets a whole little corner to herself so neither of us feel cramped. It's also super easy to set up, maybe takes ten minutes by myself if that.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Wieckowski",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "This is a great car camping tent",
      "text": "This is a great car camping tent. I used it for the first time last weekend on a 4 day trip. It took me 15-20 minutes to set this tent up by myself. The taller walls make it roomier and I like that the rainfly doesn't cover the windows. Some reviewers had concerns that the floor isn't made of heavier material, but I think it's just fine with a footprint under it.",
      "rating": 5.0,
      "verified": true,
      "author": "CLS",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "It is very well built and easy to set up",
      "text": "The kids and I camp out in this tent all the time. It is very well built and easy to set up . It went through some rough weather and problems and no leaks.",
      "rating": 5.0,
      "verified": true,
      "author": "James S",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "This tent is excellent quality. It's nice",
      "text": "This tent is excellent quality. It's nice, easy to set up, and strong. The only concern I have is the height. It seems so tall that I'm not sure how it would do with heavy winds.",
      "rating": 4.0,
      "verified": true,
      "author": "DANIEL M",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Loved it, bought a second!",
      "text": "Awesome! Using as a cat playhouse. Super sturdy, easy set up!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Kurisu",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Easy Tent",
      "text": "Great tent. Easy directions, easy to put up. Comes with bags to keep everything together in one place. Room enough for four and tall enough if your over 6' to stand inside the tent.",
      "rating": 5.0,
      "verified": true,
      "author": "luv2kraft",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "Goes up in minutes.",
      "text": "Great tent for the price. Roomy, sturdy and easy to put up.",
      "rating": 5.0,
      "verified": true,
      "author": "LettersHead",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "excellent tent, be sure an get a tarp to ...",
      "text": "excellent tent, be sure an get a tarp to put down before you put up tent, other than that, i love this tent, it really is very tall,",
      "rating": 5.0,
      "verified": true,
      "author": "Brock",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Love the tent",
      "text": "Love the tent. The height is great. Did well in a big storm. Just a bit more dealing around door.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Easy set up for tall tent",
      "text": "Love that I can stand up in tent and the foot print is the same size as my smaller dome tent, held up well in rain and not as hot as my smaller tent.",
      "rating": 5.0,
      "verified": true,
      "author": "John Lloyd",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Spacious and easy assembly!",
      "text": "This tent is a nice change of pace from the usual crouching and crawling in the middle of the night to go to the bathroom. So spacious and very easy to assemble!",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Some of the hangers eyes inside where missing",
      "text": "So far so good. Brought out to hunting camp and had a bad rain storm for two days and it did just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good Tent",
      "text": "I wanted a tent that would be big enough to stand up in and had plenty of room and this one definitely fit the bill. I was able to stand up to windy conditions and rain as well. A good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Bodhi",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Best. Tent. Ever.",
      "text": "This is my second Eureka tent (the first being a Spitfire) big enough to fit two regular sized cots and have a decent walkway between along with a little room for storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Four Stars",
      "text": "Love the head room but the floor is way fragile!",
      "rating": 4.0,
      "verified": true,
      "author": "Bill J.",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Five Stars",
      "text": "Love this tent! Easy to put up. Lots of ventilation and large windows. Has plenty of Headroom.",
      "rating": 5.0,
      "verified": true,
      "author": "ed",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "and it was stress-free and easy to put up and take down",
      "text": "I put this tent up with a 4- and a 5-year old's help, and it was stress-free and easy to put up and take down. Very roomy, comfortable, airy. A great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Good quality at a fair price point",
      "text": "Purchased in July 2014, have used it once. Pleased with the quality, ease of assembly, sturdiness of materials. I use a 16 mil 10 x 10 poly tarp underneath it to protect against rock, twigs, etc. Another person described it as a \"one person Taj Mahal\" for camping and that's a very accurate description of why I purchased this for my two or three times/year car camping trips.",
      "rating": 4.0,
      "verified": true,
      "author": "William Rieger",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Best tent ever",
      "text": "Best tent ever! Can set it up all by myself, and can stand up and have a disco party in it if I want.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Youngs",
      "helpful_votes": 2,
      "publication_date": 20150814
    },
    {
      "title": "Didn't realize this tent doesn't have a tub style tapped ...",
      "text": "Didn't realize this tent doesn't have a tub style tapped bottom. But not seller fault I guess I didn't read the through the description well enough",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Franks",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Wow! What an upgrade from our 2 person tent ...",
      "text": "Wow! What an upgrade from our 2 person tent! It took a bit of work to put it up but it held up over 2 windy nights.",
      "rating": 5.0,
      "verified": true,
      "author": "TKW",
      "helpful_votes": 0,
      "publication_date": 20160614
    },
    {
      "title": "tent",
      "text": "Eureka tents are the best. super easy to put up, roomy inside with pockets to put your stuff in, a hook for hanging a lantern, a hole for an electrical cord to fit thru...very well made. This is my second Eureka and I can't even begin to say how long the first one lasted. The old tent started to have problems with the zipper, and true to their word, Eureka fixed it for free, two times, costing me only shipping. I wouldn't own another brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Linnea",
      "helpful_votes": 22,
      "publication_date": 20130626
    },
    {
      "title": "Roomy sturdy tent. The door is not the best",
      "text": "Roomy sturdy tent. The door is not the best, probably would have been better if they just did a center zipper.",
      "rating": 5.0,
      "verified": true,
      "author": "Reviews",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "Five Stars",
      "text": "tall enough for 6\" person fits our cots with enough space to change our clothes and stand up.",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "awesome!!",
      "text": "love this tent! sets up in a few minutes... tears down in less...headroom galore...i think i'll keep it. Bravo Eureka!!",
      "rating": 5.0,
      "verified": true,
      "author": "steve sellars",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Its light weight",
      "text": "Camping council grove lake Kansas and needed bigger stakes for rock",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Five Stars",
      "text": "plenty roomy for large cot and my stuff, due to upright walls",
      "rating": 5.0,
      "verified": true,
      "author": "W. Husen",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Five Stars",
      "text": "Great for car camping! Put the fly on right after roof poles and before the side poles :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Haring",
      "helpful_votes": 6,
      "publication_date": 20150529
    },
    {
      "title": "Great in the wind.",
      "text": "Just weathered a big downpour in the desert. High winds and driving rain. This tent performed beautifully!",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Turley",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Height and Durability",
      "text": "I like the height and size. I'm 6'3\" and it works for me",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel L",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Just back from camping with a new tent",
      "text": "The tent is well done, easy to assemble, roomy enough for two cots with a distance in between. Wolud recommend to get one who is looking for a decent tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyalya",
      "helpful_votes": 6,
      "publication_date": 20130530
    },
    {
      "title": "Five Stars",
      "text": "easy set up even in the dark for a first time use",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Review",
      "text": "Perfect for a week in the woods. Held up great through some nasty weather",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Mitchell",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "and it has been great. Old people need to stand up in their ...",
      "text": "We're in our second camping season with this tent, and it has been great. Old people need to stand up in their tent, and this tent makes that possible by having nearly verticle sides straight up to the roof. Very easy to set up. This tent does call for additional canopy protection in the event of a heavy rain.",
      "rating": 5.0,
      "verified": true,
      "author": "poptu",
      "helpful_votes": 3,
      "publication_date": 20170112
    },
    {
      "title": "comfortabel",
      "text": "easy to assemble - well made- I consider this a family tent - they call it a 4 person tent - I would say it sleeps 2 adults comfortably or mom dad and 2 small children.... I also call this a \" retirement \" or \"guest\" house tent...It is not a backpackers tent..... Yes I am satisfied....",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Jackson",
      "helpful_votes": 3,
      "publication_date": 20130901
    },
    {
      "title": "Perfect!",
      "text": "Bought this tent after much research and, so far, it's great. Easy to set up and roomy for one to two people. Not really designed for winter camping due to roof ventilation, but should be great in summer!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "Four Stars",
      "text": "Easy setup, and great space. Fit two people fine, 4 would be a tight squeeze.",
      "rating": 4.0,
      "verified": true,
      "author": "Andres",
      "helpful_votes": 0,
      "publication_date": 20160501
    },
    {
      "title": "GREAT!",
      "text": "got it today and set it up. I was surprised at the ease of setting up such a big tent. I like the heighth inside. I thi k it will work out well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "the tent is of good quality, is easy to set up with two ...",
      "text": "In retrospect I should have gotten the next larger size; after inflating my queen-sized air bed inside, there wasn't a lot of floor space remaining. Nevertheless, the tent is of good quality, is easy to set up with two people, and fairly easy to set up solo. The price was reasonable for what you get - three or four nights in the tent instead of a motel room and it's paid for itself.",
      "rating": 4.0,
      "verified": true,
      "author": "boywizard",
      "helpful_votes": 3,
      "publication_date": 20161010
    },
    {
      "title": "Lovely tent for standing tall!",
      "text": "GREAT tent for tall height and ease of setting up. It is compact and light weight. Has large windows and a large door for good ventilation. The only drawback I could find was the material of the tent floor. It was not reinforced, but made from the same materials as the tent sides. That is the only downside for this tent.",
      "rating": 4.0,
      "verified": true,
      "author": "Book Lover",
      "helpful_votes": 3,
      "publication_date": 20140730
    },
    {
      "title": "This is a great tent. I used it this weekend camping",
      "text": "This is a great tent. I used it this weekend camping, and invited several people to come in and take a look. Every one of them, stepped in, and looked up and up. Great height. One of my friends is 5'2\" (I think) and could not touch the ceiling even standing on tip toe. My cot fits against the back wall, leaving enough room for all the other stuff you take camping. I'd call it 2 person at most though, if you use a cot. The floor is not a heavier weight, which results in it wrinkling up and making it a little slippery. I'll probably bring a rug to lay over the floor.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Looks like a solid tent, other than flooring",
      "text": "I've owned Eureka tents before. They have been great and lasted a long time. This looks like a very sturdy tent and should hold up reasonably well to winds, despite its high aspect ratio. I do think the flooring is awfully light, so it will be interesting to see how well it holds up over time. I like the ventilation panels; lots of them and large and easy to open and close.",
      "rating": 4.0,
      "verified": true,
      "author": "Matt Carter",
      "helpful_votes": 0,
      "publication_date": 20141206
    },
    {
      "title": "I'm not a camper",
      "text": "I use the tent as someplace to sleep while at the races. I bought it because it was the tallest tent available. I need to stand up to put on my race suit between stints. It has worked out well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Dumbeck",
      "helpful_votes": 0,
      "publication_date": 20131012
    },
    {
      "title": "I love this tent",
      "text": "I love this tent. This was a great deal. Nice head room so you don't have to hunch over, but small enough to be put up by one person.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly C.",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Five Stars",
      "text": "The tent is perfect! We loved the height, windows, and easy set-up.",
      "rating": 5.0,
      "verified": true,
      "author": "maria garcia",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Easy, durable and comfortable!",
      "text": "Easy to put up, held up very well in a thunderstorm, very roomy and comfortable. We will keep this tent for life!",
      "rating": 5.0,
      "verified": true,
      "author": "A Richardson",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Five Stars",
      "text": "Good quality tent. Everything was as described. A bit hard to set up in the wind",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Gilbertson",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "STAYS UP FOR MONTHS IN THE TROPICS",
      "text": "I KEEP MY TENT UP MOST OF THE WINTER IN THE LOWER FLORIDA KEYS. MY LAST COPPER CANYON (10 X 10) WAS USED FOR SIX SEASONS AND WAS PASSED ON TO MY SON FOR CAMPING UP NORTH IN PENNSYLVANIA. THE FLY HAD TO BE REPLACED AFTER FOUR YEARS ($50) DO TO THE TROPICAL SUN. OTHERWISE IT SHOULD LAST ANOTHER 6 YEARS.THESE TENTS ARE BUILT MUCH BETTER THAN THE ONES YOU SEE AT YOUR LOCAL XXXMART. IF THERE IS A CRITICISM IT IS THAT IT M-U-S-T BE TIED DOWN. ONCE SECURED, IT'S VERTUALLY A HOME AWAY FROM HOME!",
      "rating": 5.0,
      "verified": true,
      "author": "james j conlin",
      "helpful_votes": 4,
      "publication_date": 20131004
    },
    {
      "title": "Love that the walls are pretty straight up with no ...",
      "text": "It is a little smaller than we'd hoped for. It JUST fits a queen size mattress with room for a bag on the side and no room to walk around both side of the mattress. We should have gone a size up. Love that the walls are pretty straight up with no sagging and the height is great!",
      "rating": 4.0,
      "verified": true,
      "author": "WA Mom x3",
      "helpful_votes": 0,
      "publication_date": 20140921
    },
    {
      "title": "... spacious tent I'm 6 foot 3 & I could easily stand up inside need my girlfriend were able to ...",
      "text": "big spacious tent I'm 6 foot 3 & I could easily stand up inside need my girlfriend were able to fit a queen size air mattress with plenty of room around for activities and supplies great weather proofing very sturdy well built overall great tent",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "but for music festivals and the like, this thing is the Taj-Mahal",
      "text": "I'm 6'2 and have never been able to stand up in my tent. Obviously not for the backpacker type, but for music festivals and the like, this thing is the Taj-Mahal! You can have a queen air mattress in it and still have plenty of standing room to change clothes or have a party in your tent. Awesome tent!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161201
    },
    {
      "title": "Nice tent",
      "text": "We use this when camping with our pop-up camper, to add an extra room for changing or for guests. Always goes up very easy and has lots of head room. Great little tent. No sings of wear after using it a dozen times or so.",
      "rating": 5.0,
      "verified": true,
      "author": "John P.",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "Awesome Tent!",
      "text": "Worth the money! Nice to be able to stand up in a tent instead of having to crawl around! Would purchase this tent again if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "dinguskhan65",
      "helpful_votes": 0,
      "publication_date": 20121211
    }
  ],
  "product_meta": {
    "title": "Eureka Copper Canyon 4 -Person Tent",
    "description": "Style:4 PersonRelax in cabin-like comfort with the Eureka! Copper Canyon 4 four-person, three-season tent. Near-vertical walls in this cabin-style tent create a spacious interior ideal for cots and airbeds. Outlast rain and wind storms with the durable steel/fiberglass frame, which includes pole sleeves, hubs, and a ring/pin assembly for easy setup. Eureka!'s zippered E! Power Port allows you to bring an outdoor-grade electrical power cord inside the tent to power phone chargers and other electronics. Two high-stash storage pockets and a gear loft keep essentials close at hand and within easy reach. Measures 8 feet by 8 feet (floor) and 7 feet tall; packs to 7 by 26 inches; minimum weight of 18 pounds, 10 ounces. Eureka! found its humble beginnings in 1895 and today their camping gear gives you the freedom to have fun - from tents to cooking systems, and sleeping bags to camp furniture - reliable, easy-to-use, and packed with features campers care about.",
    "rating": 4.5,
    "feature_bullets": [
      "Relax in cabin-like comfort with the Eureka! Copper Canyon 4 four-person, three-season tent.",
      "Near-vertical walls in this cabin-style tent create a spacious interior ideal for cots and airbeds.",
      "Outlast rain and wind storms with the durable steel/fiberglass frame, which includes pole sleeves, hubs, and a ring/pin assembly for easy setup.",
      "Eureka!'s zippered E! Power Port allows you to bring an outdoor-grade electrical power cord inside the tent to power phone chargers and other electronics.",
      "Two high-stash storage pockets and a gear loft keep essentials close at hand and within easy reach.",
      "Measures 8 feet by 8 feet (floor) and 7 feet tall; packs to 7 by 26 inches; minimum weight of 18 pounds, 10 ounces.",
      "Eureka! found its humble beginnings in 1895 and today their camping gear gives you the freedom to have fun - from tents to cooking systems, and sleeping bags to camp furniture - reliable, easy-to-use, and packed with features campers care about."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "15 x 10 x 22 inches; 18.6 Pounds",
      "Item model number": "2601296",
      "Department": "Unisex-Adult",
      "Date First Available": "December 16, 2011",
      "Manufacturer": "Eureka!",
      "ASIN": "B006MQCLKS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Tents",
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Tents & Shelters"
    ],
    "price": 529.99
  }
}