{
  "website_summaries": [
    {
      "verdict": "You don't need to be in charge of a fleet to keep track of a new or elderly driver, thanks to frequent, real-time updates.",
      "pros": [
        "In vehicles 1996 and newer, unit plugs easily into the OBD port and sends comprehensive reports to computer or cellphone – no battery needed for operation",
        "Tracks braking and acceleration as well as location, all with a reasonable monthly cost"
      ],
      "cons": [
        "Only operates in North America",
        "there is a reactivation charge if you cancel and want to reinstate service later"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Can't cancel the subscription!!",
      "text": "I have had the device for a few months, however I no longer need it and its impossible to cancel the subscription. I really liked the system itself, until my teenage son kept unplugging it, so there really is no use for it. 1) I logged into my account online and you can't delete your credit card information. 2) Trying to get a hold of a live person is a joke. 3) The monthly fee increased last month without my knowledge, this alone infuriates me. I'm extremely frustrated at this point!",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie B.",
      "helpful_votes": 20,
      "publication_date": 20190525
    },
    {
      "title": "For peace of mind...",
      "text": "I feel a little guilty, but I bought this to track my 17 year old son who is a fairly new driver, and I just didn't think he was being straight up with me about where he was going, which he wasn't. I can't confront him without blowing my cover but it has definitely given me peace of mind. I won't leave it his car forever, but for now it helps me maintain my sanity. The tracking is very accurate and the app user friendly. For $40 to buy and $20/month it's money well spent!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri",
      "helpful_votes": 22,
      "publication_date": 20180621
    },
    {
      "title": "a very helpful and user friendly gps tracking device",
      "text": "a very helpful and user friendly gps tracking device. It provides several useful alerts (harsh braking, speeding and time stopped at location) just to name a few. I use it to monitor my business trucks. This has been a great investment for us. I would highly recommend it to anyone. Very reasonable monitor rates and original device cost is very reasonable",
      "rating": 5.0,
      "verified": true,
      "author": "Sam_I_Am",
      "helpful_votes": 25,
      "publication_date": 20180209
    },
    {
      "title": "You will be glad you ordered the Linxup tracker",
      "text": "Very easy setup. Amazing data recordings. Immediate intimate supervision, puts employees on notice without heavy handedness. I ordered one for every patrol vehicle. Within a short time, I identified a negligent employee who apparently did not believe I could monitor his travels while I was out of town. Receiving engine codes and diagnostics is also very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20180304
    },
    {
      "title": "a very good product",
      "text": "I have been more than pleased with the product and support that I received since day one of purchase. I would recommend to any company who needs to know what takes place with their vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 7,
      "publication_date": 20180811
    },
    {
      "title": "works great for kids",
      "text": "This thing is awesome. I use it to keep tabs on my daughters driving. It shows me exactly where she is. Where she went, if she stopped somewhere and for how long. It also shows if she accelerated rapidly, braked hard, or speeding. All of from either their website or their mobile app that can be used on your phone. 22 monthly fee is the bad thing about this. Installing was also easy. Just like plugging in a wall socket on her 2006 Honda civic. No tools needed. Plugged right into the obd2 port under the steering wheel. If your not sure where your obd2 port is on your car try YouTube as that's how I found mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Hughes",
      "helpful_votes": 9,
      "publication_date": 20150304
    },
    {
      "title": "Five Stars",
      "text": "Excellent product and very accurate tracking. using in a 2002 blazer and 2002 Ford van.",
      "rating": 5.0,
      "verified": true,
      "author": "DZ113",
      "helpful_votes": 6,
      "publication_date": 20180319
    },
    {
      "title": "Battery Killer",
      "text": "In March I started working from Home, did not unplug this from my Truck. Truck parked for 4 months then the battery - Sears DieHard (good luck with that warranty. Bought a new Walmart battery and keep it unpluged. It uses a small amount of battery drainage (you can tell by the blinking lights) and kills batterys if you do not drive the vehicle regulary. Maybe a software fix is needed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "The idea of the device is great, I think it doesn't work in the middle ...",
      "text": "The idea of the device is great, I think it doesn't work in the middle East, TBH I purchased the device but unfortunately it didn't work, but Mr. Steven is a great guy, he accepted to give me a refund. Thanks Steven.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180108
    },
    {
      "title": "Price of monthly use not listed.",
      "text": "$23 each month for use placed on credit card. Way to expensive to use. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryll ",
      "helpful_votes": 4,
      "publication_date": 20190126
    },
    {
      "title": "but I like this one which needs no recharging",
      "text": "I have some other trackers, but I like this one which needs no recharging.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike T.",
      "helpful_votes": 5,
      "publication_date": 20180303
    },
    {
      "title": "You Can Stop Shopping Around-This is the One!",
      "text": "I like it! Easy set-up. Best bang for the buck. The 3G coverage so far has not had any dead spots. You people looking for a GPS tracker, be sure that it has 3G service like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 3,
      "publication_date": 20170823
    },
    {
      "title": "One Star",
      "text": "Description did not adequately explained that their was a monthly service associated with this divide",
      "rating": 5.0,
      "verified": true,
      "author": "Tadd J.",
      "helpful_votes": 7,
      "publication_date": 20170318
    },
    {
      "title": "The PC and Phone software really make it great. In the Western US where phone reception is ...",
      "text": "Does what it says. The PC and Phone software really make it great. In the Western US where phone reception is spotty, I've never lost track. You can really keep an eye on your vehicles. It will give a breadcrumb trail for any day you like. Tells if they are speeding. Tells when they stop, and for how long. Is it worth the $25/month to use? That's for you to decide. If you choose to use it, you'll find it's an accurate, reliable device. The Apple/Android software is really sweet.",
      "rating": 5.0,
      "verified": true,
      "author": "Tucker Mac",
      "helpful_votes": 5,
      "publication_date": 20141119
    },
    {
      "title": "Worthless",
      "text": "Misleading and outdated and subscription costs too much for little to no details about the vehicle it's installed in",
      "rating": 2.0,
      "verified": true,
      "author": "Jerome Burke",
      "helpful_votes": 2,
      "publication_date": 20181008
    },
    {
      "title": "Perfect product",
      "text": "I ordered a similar device from my mobile carrier, 3 weeks later and I still haven’t receive it. I then searched on amazon and found this one. I ordered on Friday, received on Sunday had it up and running Monday morning (activation was the easiest thing ever) Don’t waste your time and money in other product",
      "rating": 5.0,
      "verified": true,
      "author": "Radler Inc",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Five Stars",
      "text": "Wow this tells you everything exactly what's going on with my company truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaunna P.",
      "helpful_votes": 5,
      "publication_date": 20180422
    },
    {
      "title": "Very cool Thanks",
      "text": "If anyone is looking to get into fleet tracking this setup is the way to go. There is a monthly fee that you should know about but I can tell you one thing it is a very user friendly unit and is very comprehensive when it comes to the features. Very cool Thanks Linxup",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160606
    },
    {
      "title": "It is everything that it is advertised to be.",
      "text": "Totally love this product. I was very skeptical at first but let me tell you, it works and works well. Recommend it highly to anyone looking to buy a tracker.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Mc--Texas",
      "helpful_votes": 3,
      "publication_date": 20180809
    },
    {
      "title": "Five Stars",
      "text": "Works great and accurate also ease of use it awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Panhandle Paint & Decorating",
      "helpful_votes": 3,
      "publication_date": 20171019
    },
    {
      "title": "Good product.  Easy to",
      "text": "We use this in my mother’s car as she is older. My family can keep up with where she is. We know when she’s coming to visit! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "DENNIS M SULLIVAN",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Simple. And it works.",
      "text": "I bought this to be able to track or locate my daughters car. She has short term memory loss and this has taken a lot of stress off her. She knows she can call me and I can locate it's exact position. I then find it on Google Maps and send her a pin! I am very happy with this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Hooper",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Very Easy",
      "text": "Extremely easy setup and install. Very straightforward. We are using it for maintenance tracking on small HVAC company fleet. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "JD-BoilerUp",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Five Stars",
      "text": "Do you need to track your nefarious teen? If so, this is a product you should seriously consider!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 9,
      "publication_date": 20180106
    },
    {
      "title": "A Satisfied Linxup Customer",
      "text": "The installation was very easy & the unit has worked flawlessly (OK, it was a little challenged in the middle of Death Valley National Park). Tracking a family car is readily done from my desktop, laptop, tablet & smartphone. I am a satisfied customer and may be purchasing additional Linxup GPS units in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas D.",
      "helpful_votes": 6,
      "publication_date": 20150408
    },
    {
      "title": "Conveneient",
      "text": "First tracker we purchased stopped working after a few weeks, SlowlAfter more than a week's delay another one arrived which did caused some difficulties following the vehicle during the missing period, However, the second one is working well, The one thing I would improve upon is making the buyer select the tracker from a list when you only have one tracker If you have just one, why should you have to \"select: which tracker it is?",
      "rating": 4.0,
      "verified": true,
      "author": "Patti Pollock",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "To complicated to program",
      "text": "It’s toooo complicated to make the set up, I was trying about 2 hrs to open a account and get the app etc, I definitely prefer to return it and get a different brand",
      "rating": 1.0,
      "verified": true,
      "author": "Sergio P.",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Highly Recommended",
      "text": "a very helpful and user friendly device. It provides several useful alerts (harsh braking, speeding and time stopped at location) just to name a few. I use it to monitor my teenager. This has been a great investment for us. I would highly recommend it to anyone. Very reasonable monitor rates and original device cost is very reasonable",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn",
      "helpful_votes": 5,
      "publication_date": 20150915
    },
    {
      "title": "Five Stars",
      "text": "It came on time and had an easy install... up and running we will order again for our fleet",
      "rating": 5.0,
      "verified": true,
      "author": "Tamera Padgett",
      "helpful_votes": 3,
      "publication_date": 20170531
    },
    {
      "title": "Five Stars",
      "text": "great tracker, unfortunately its a bit noticeable and not too discreet :/",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda S.",
      "helpful_votes": 7,
      "publication_date": 20150624
    },
    {
      "title": "Does not work like they say it will work.",
      "text": "Bought these for my fleet vehicles. None of them works with my trucks and tech support is terrible!",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Shelton",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "great product",
      "text": "this product is so good so easy to install just plug it into your car diagnostic obd2 port and install the linxup app in my iphone and then call up the 1800 number to activate a monthly charge 25$ a month and insistently see your vehicle on the map in real time great for cheating spouces well worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Ramdeo",
      "helpful_votes": 7,
      "publication_date": 20130623
    },
    {
      "title": "Five Stars",
      "text": "Great detail now she just a damn microphone and Camera",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph",
      "helpful_votes": 3,
      "publication_date": 20170913
    },
    {
      "title": "Five Stars",
      "text": "I have been with them for 3 years and have over 15 units with this company and they are by far the best. I have tried many different service providers and they are more expensive and they do not compare to Linxup.",
      "rating": 5.0,
      "verified": true,
      "author": "ANTHONY",
      "helpful_votes": 4,
      "publication_date": 20150310
    },
    {
      "title": "I would recommend for any small or large companies",
      "text": "This product is very useful in my company especially for the real time tracking and the check engine light alerts. There are just a few small errors with the timing and location that need some attention.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Highly Recommended",
      "text": "The unit is very easy to install and sign up was very easy as well... I would recommend this to anyone needing to keep track of vehicles and how they are being operated.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 7,
      "publication_date": 20150511
    },
    {
      "title": "Great vehicle teacker",
      "text": "Works as advertised. Able to track vehicle when son takes it. Hard braking, speeding and fence areas places I dont want vehicle near..",
      "rating": 5.0,
      "verified": true,
      "author": "michael",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Simple tracker.  Great details.",
      "text": "Simple Installation. Simple Software. Great reports. Set the date and time range and view the map, speeds, details. I used an extension plug for OBC to hide the lights (placed device up under dash.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph hebert",
      "helpful_votes": 5,
      "publication_date": 20150412
    },
    {
      "title": "It work",
      "text": "Very nice gps good price but my only issue is the tracking update every 1 minute would be better every 10 to 20 second, beside that is very good product and I recommend....",
      "rating": 4.0,
      "verified": true,
      "author": "Kelvin Munoz",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Item works as advertised!  Maybe even better.",
      "text": "This worked better than I imagined it would. Easy to install and love getting the alerts. I would highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Kowal",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "4 years and stil love it.",
      "text": "Really great when my children had problems on the road. Was easy to pin point location. Also great at monitoring the kids heavy foot on the gas. Only draw back for me is device cannot disable vehicle.",
      "rating": 4.0,
      "verified": true,
      "author": "MC Boyd",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Best in the market Smart phone friendly But",
      "text": "Best in the market Smart phone friendly But, I would love to be able to locat address easier",
      "rating": 5.0,
      "verified": true,
      "author": "King James",
      "helpful_votes": 4,
      "publication_date": 20150201
    },
    {
      "title": "Do not buy beware",
      "text": "Garbage do not purchase site don’t work well hassle to activate very unhappy !",
      "rating": 1.0,
      "verified": true,
      "author": "abraham gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Make sure you want it",
      "text": "Never worked. They run your card even though they say that they're not charging you, but there's a $22per month charge. Nightmare to return",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Not bad",
      "text": "Does what it’s supposed to. A little hard to check route on map as it overlaps",
      "rating": 4.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "This tracker is awesome. I purchased it to keep track of my ...",
      "text": "This tracker is awesome. I purchased it to keep track of my teenage daughter. I bought this based on the reviews I read. Very easy to install. I created my account on their website and activated it and then installed the app on my phone. I use the app several times a day to see where she is at. She had no idea I had installed it in the car and lied to me about where she was at and I tracked the car down to a parking lot. The tracker gave me the precise address of where the car was located.",
      "rating": 5.0,
      "verified": true,
      "author": "DHR",
      "helpful_votes": 4,
      "publication_date": 20160621
    },
    {
      "title": "Works as expected",
      "text": "Needs to be more compact, depending on port location can get knocked off by drivers leg",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Works great, but monthly fee not so great.",
      "text": "Will need to paid a monthly fee to Link company, not mention in deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "but a good website for this tracker tho",
      "text": "Works flawlessly, but the monthly single user fee is a bit pricey @ $22 +, a month, but a good website for this tracker tho, lots of setup and mobile phone alerts options",
      "rating": 5.0,
      "verified": true,
      "author": "Slippery Sam ",
      "helpful_votes": 3,
      "publication_date": 20140705
    },
    {
      "title": "Impressed",
      "text": "Even with adverse weather conditions they still placed customer service in high regard I can proudly give them five stars",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Casselman",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Five Stars",
      "text": "The product is great. Very , very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 3,
      "publication_date": 20141014
    },
    {
      "title": "this product is the best thing that I could find on the Internet",
      "text": "it has been a lifesaver everything I needed it to do it has done for me and then some. It will tell you within a few feet the location and address where my vehicle is at all times. I could not ask for a better product I highly recommend this product to anyone who is looking to track their vehiclea.",
      "rating": 5.0,
      "verified": true,
      "author": "earnest hillard",
      "helpful_votes": 4,
      "publication_date": 20140327
    },
    {
      "title": "Great tracker",
      "text": "We were very pleased with this purchase. The price and delivery of the product was quite reasonable, the installation was extremely easy, and the tracking software meets our needs, It has proven to be quite accurate, and is easily monitored on most of our devices (phone, tablet, computers).",
      "rating": 5.0,
      "verified": true,
      "author": "Audomer",
      "helpful_votes": 4,
      "publication_date": 20140130
    },
    {
      "title": "Overall a good device for me",
      "text": "This unit did exactly as advertised. The setup was simple and so far tracking the vehicle has been relatively accurate. I have had to close the ap and reopen on occasion in order to see movement. Overall a good device for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "This works great!",
      "text": "I love how this rates my drivers in regard to their driving habits.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd M.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Not sure if that is due to a faulty device or a bad satellite link",
      "text": "Works well for the most part. At times the device will go dormant and will not report for 20-40 minutes, two or three times a week..Not sure if that is due to a faulty device or a bad satellite link. Overall ok though.",
      "rating": 4.0,
      "verified": true,
      "author": "jv",
      "helpful_votes": 2,
      "publication_date": 20150615
    },
    {
      "title": "Highly recommend",
      "text": "Love this product for my teenage driver! I don't have to text or call to find out where he is I just pull up the app and get the info in real time. I have recommended to many of my friends and all have been satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "jenn frederick",
      "helpful_votes": 4,
      "publication_date": 20150905
    },
    {
      "title": "Very easy set up",
      "text": "Unit installation and account set was extremely easy. No need to wait to start. The unit works as advertised. Web site takes some getting used to, but that's no big deal. I've never had one of these before so it's fun to watch the reports/updates as they come in and gives the oppurtunity to get used to the interface and play around.",
      "rating": 5.0,
      "verified": true,
      "author": "miked",
      "helpful_votes": 8,
      "publication_date": 20130117
    },
    {
      "title": "Perfect",
      "text": "East to install and easy to set up. Plug it in, activate and you're done. Great product and I would recommend to anyone wanting to track driver routes. Would have easily paid more money for something this simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Eisenhauer",
      "helpful_votes": 5,
      "publication_date": 20130410
    },
    {
      "title": "Excellent. Did exactly what it said it could do",
      "text": "Excellent. Did exactly what it said it could do. No issues and very easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Bell",
      "helpful_votes": 4,
      "publication_date": 20150115
    },
    {
      "title": "Good Stuff",
      "text": "i would recommend this to anyone who needs to keep[ track of their vehicles location. The alerts is good also for obvious safety reasons. Good Service and a good product to boot. What else could you ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "James A.",
      "helpful_votes": 4,
      "publication_date": 20130624
    },
    {
      "title": "great device, feed back is great and it has ...",
      "text": "great device, feed back is great and it has provides needed feed back to those who need to be reminded to drive safely.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 4,
      "publication_date": 20160818
    },
    {
      "title": "GPS Tracker works like a charm",
      "text": "This item performed perfectly, if you want to know what your drivers are doing and how they are driving this is the answer........",
      "rating": 5.0,
      "verified": true,
      "author": "Hubert M. Vanover Jr.",
      "helpful_votes": 4,
      "publication_date": 20131222
    },
    {
      "title": "easy install get tracker",
      "text": "Easy install. My car it was detectable thou and my husband found it.. bummer",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Mcnut",
      "helpful_votes": 3,
      "publication_date": 20141010
    },
    {
      "title": "Great product!  The smartphone app is awesome!",
      "text": "This product is very accurate and the computer and smartphone app are great! I would not expect anything more. Would buy more in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "bao vinh",
      "helpful_votes": 5,
      "publication_date": 20130630
    },
    {
      "title": "GPS tracker",
      "text": "If you're looking for a relatively inexpensive tracking device for a car for elderly parents, teenagers, etc, this thing is great! Just plug it in the EDO slot and you're done. Customer service from Linxup is very responsive as well. Plus, you can purchase a month to month program for $25. One year or two year agreements for lower rates are availalbe. For me and my needs, this unit and plan we're right on target.",
      "rating": 5.0,
      "verified": true,
      "author": "JeffryDon1953",
      "helpful_votes": 28,
      "publication_date": 20121126
    },
    {
      "title": "The device itself works fine. Unfortunately",
      "text": "I was going to use this to track driving habits for my teens. The device itself works fine. Unfortunately, Linxup doesn't actually know what speed limits there are for roads and highways. So sometimes it tells me that driving at 45 mph road is overspending yet the speed limit is 55 mph. Or it's not flagging when the highway speed is 55 mph and you're already driving at 60 mph. You can preset limits for small roads and highways but it's not enough as there are small roads that have the same speed limits as the beltway especially in Maryland.",
      "rating": 3.0,
      "verified": true,
      "author": "Arlene Medija",
      "helpful_votes": 2,
      "publication_date": 20141214
    },
    {
      "title": "Not too bad",
      "text": "this product works quite well unfortunately the monthly fee is twenty + so when you have 45 3 vehicles you are paying over $100 a month to operate the system seems a little Steep",
      "rating": 3.0,
      "verified": true,
      "author": "Master Blaster",
      "helpful_votes": 2,
      "publication_date": 20141004
    },
    {
      "title": "It works exactly as described!",
      "text": "Installed the tracker in seconds. After approx. 30 seconds it started transmitting and was visible on the website via any computer. Just log into your account and all the information is at your fingertips! The Linxup support staff was VERY friendly and helpful in setting up as well as follow up calls to clarify the questions I had regarding the symbols and available print outs of the information that was stored from the tracker. I would recommend this to anyone who needs to track a vehicle for ANY purpose. I could not have asked for a more PERFECT product or \"ready to assist you at any time\" support staff. THANK YOU",
      "rating": 5.0,
      "verified": true,
      "author": "DaveM",
      "helpful_votes": 7,
      "publication_date": 20130107
    },
    {
      "title": "As advertised",
      "text": "No problems. Works exactly as advertised. Would definitely recommend for personal or business use. It has operated flawlessly for the 3 months since I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bart B.",
      "helpful_votes": 4,
      "publication_date": 20130812
    },
    {
      "title": "Plug & play doesn't work for me.",
      "text": "Used this to keep track of a flaky employee in a 2006 Tacoma, but the coverage is so spotty it isn't even worth it. It skips huge chunks of time and sometimes even entire days. The whole reason I purchased it was so I could just plug it in and go, I don't want to have to buy a kit and hardwire it in. I purchased another system and returned this.",
      "rating": 1.0,
      "verified": true,
      "author": "Susanna",
      "helpful_votes": 14,
      "publication_date": 20151130
    },
    {
      "title": "Works well",
      "text": "I wish I could register it online rather than having to phone during business hours. Otherwise, it works exactly as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Dot",
      "helpful_votes": 6,
      "publication_date": 20130827
    },
    {
      "title": "Five Stars",
      "text": "Works as described. Does everything I expected it to do",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160306
    },
    {
      "title": "Four Stars",
      "text": "A wonderful piece of technology you will love to have especially if have teens in your house.",
      "rating": 4.0,
      "verified": true,
      "author": "Glitches some times",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Three Stars",
      "text": "I sent it back because there is a monthly fee to get the service.",
      "rating": 3.0,
      "verified": true,
      "author": "It helps",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Service is kind of a trap!",
      "text": "Very difficult to STOP the subscription service once they have you paying.",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 8,
      "publication_date": 20160924
    },
    {
      "title": "i tried it on a 2003 chevy monte carlo and it work fine.",
      "text": "i order this for a 2001 chevy tahoe. it did not work on 2001 Chevy Tahoe. i tried it on a 2003 chevy monte carlo and it work fine.",
      "rating": 2.0,
      "verified": true,
      "author": "eldenson",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "It doesn't tell you when target car is moving you ...",
      "text": "It doesn't tell you when target car is moving you have to visually watch the monitor other than that it works",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20151102
    },
    {
      "title": "Poor suppprt and lots of spam mail to your email account which should be used for alerts from the device.",
      "text": "Unit worked for a few weeks then stopped. I have a subscription. Have been in contact with support and issue wasn't resolved yet....four months later i am still charged for monthly service when service has been out for that duration. Asked to cancel but they continue to charge. Very dishonest...",
      "rating": 1.0,
      "verified": true,
      "author": "Hugh O.",
      "helpful_votes": 5,
      "publication_date": 20180803
    },
    {
      "title": "Works as promised, albeit the movement updates should be  shorter",
      "text": "Please send me the ACCOUNT NUMBER associated with this device I purchased so I can activate it. The saved views option does NOT WORK. When you go back to click on he saved view it doesn't show you THAT view. It only showso you the current real-time view, NOT THE PAST VIEW! Needs further improvement, since you cannot collect EVIDENCE.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert L. Dietrich",
      "helpful_votes": 8,
      "publication_date": 20141224
    },
    {
      "title": "Cheap device",
      "text": "This device drains batteries. It's a known issue, yet they refuse to put in make it know. There is also a $25 restocking fee if you have it over 30 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew M Kelly",
      "helpful_votes": 10,
      "publication_date": 20151027
    },
    {
      "title": "Software Sign Up Glitch",
      "text": "Product arrived promptly in good condition. Called to pay monthly fee by credit card. E-mail was sent to my box with user name and temporary password. Was instructed to Log-in to weblink to set up account. Did not work. E-mailed company via \"contact\" us link and told of my problem. Have not heard back. So what is this? Others said it was bullet proof and I got nothing. Anybody got any suggestions? Amazon, are you listening? Thanks. Subsequent followup with company was excellent and all problems resolved. Have used it many months and it works perfectly. Biggest problem is instructions are in FAQ form, rather than a simple PDF summary.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 7,
      "publication_date": 20130220
    },
    {
      "title": "Hope you don't have problem on weekend",
      "text": "Just received it. Easy install but.....got it on Friday evening. No info in box how to create an online account. Customer service disappears on weekends. Out of luck until Monday morning. So let's see you start getting charged from when it ships but hopefully you get it on a weekday. Hmmm.....let's see when are most teens doing extended driving and need to be tracked?would have loved to have left a nice review but pissed I can't activate it for three days.",
      "rating": 1.0,
      "verified": true,
      "author": "SW1",
      "helpful_votes": 9,
      "publication_date": 20131026
    },
    {
      "title": "Not worth it",
      "text": "Been using this for a few months and I'm disappointed. So many issues and didn't even track correctly. Showed the vehicle stopped all day when it was not. Not worth the money each month.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna G",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "NOT COMPATIBLE IN CANADA",
      "text": "FIRST ONE DID NOT WORK AND THE SECOND ONE DID BUT CANNOT IN BE USED IN CANADA THE NUMBER PROVIDED WON'T EVEN ALLOWED CALLS FOR INFO FROM CANADA. HAD TO SEND IT BACK GET A REFUND.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170326
    },
    {
      "title": "One Star",
      "text": "it didn't say need monthly service on the website, BAD",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Shen",
      "helpful_votes": 4,
      "publication_date": 20140713
    },
    {
      "title": "purchase of GPS to protect property",
      "text": "only worked for one week: talking to support, they say \"storing input\"; not receiving data because of location. I thought it it was vertical GPS not cell towers; they cannot answer my questions with an intelligent answer; only mumbo-jumbo that I am not suppose to understand, this is an insult to my intelligence.",
      "rating": 1.0,
      "verified": true,
      "author": "matthew echesleine",
      "helpful_votes": 5,
      "publication_date": 20140218
    },
    {
      "title": "Do I have to return the product after we finished ...",
      "text": "Do I have to return the product after we finished it or not? We are so confused about this gps tracking. I bought 2 but I returned one. I need details.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "One Star",
      "text": "Requires a monthly fee and contract. After trying it didnt work well either.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Schroeder",
      "helpful_votes": 4,
      "publication_date": 20180401
    },
    {
      "title": "I am very disappointed that it was not stated that this unit only ...",
      "text": "I am very disappointed that it was not stated that this unit only works in the USA, I purchased two only to see at the bottom of the box that it works only in the USA. I am in Barbados and trying to return them.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Holder",
      "helpful_votes": 2,
      "publication_date": 20141213
    },
    {
      "title": "... subscription and i've already spend money to buy this crap dont not make the same mistake as i",
      "text": "this is a rip off you have to sign in a monthly subscription and i've already spend money to buy this crap dont not make the same mistake as i",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Joseph",
      "helpful_votes": 5,
      "publication_date": 20141210
    },
    {
      "title": "These pieces of garbage want a monthy fee to track",
      "text": "These pieces of garbage want a monthy fee to track. Don't waste it money buy one u do not have to get sucked into a scam to rob your money via hidden fees.",
      "rating": 1.0,
      "verified": true,
      "author": "K. fike",
      "helpful_votes": 5,
      "publication_date": 20150502
    },
    {
      "title": "LOVE IT! VERY RELIABLE!",
      "text": "I love this! It works with satellites, rather than cell towers, so it tracks the vehicle all of the time. You can set the alerts so that you get an app alert as well as a text or you can pick just one. You can set geofences, speed alerts, time frame alerts, just everything. It costs about $23 a month for the service, but it is well worth it. It is very comparable to the hum. If you've seen those commercials, except, like I said, this one uses satellites, not cell towers.",
      "rating": 5.0,
      "verified": true,
      "author": "RD",
      "helpful_votes": 8,
      "publication_date": 20170628
    },
    {
      "title": "After installing this as a condition of my buying a ...",
      "text": "After installing this as a condition of my buying a new car for our daughter to \"use\" not \"own\", we found her slowing down and being more careful on the roads. It gives considerable peace of mind when she is late coming home because we cans still see where she is.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda A. Hughes",
      "helpful_votes": 4,
      "publication_date": 20170923
    },
    {
      "title": "Excellent Customer Service! Sound Product 👍",
      "text": "I am changing my review as I feel I may be mistaken in my previous assumption that the car was located by repo company through access to my gps account. I feel it is more likely that it was located in store parking lot by a plate scanning system which I understand is commonly used in the repo biz these days. Linxup has been nothing but considerate and accomodating and I believe their product is sound and private, and the gps tracking ability worked great. Good program. Thank you Linxup Customer Support, wish every company had representatives as understanding as you. 👍",
      "rating": 5.0,
      "verified": true,
      "author": "DLW",
      "helpful_votes": 2,
      "publication_date": 20170628
    },
    {
      "title": "Easy to Install/Works as Advertized",
      "text": "Super easy to install and discreet. I purchased an OBD to OBD cable to \"hide\" the device but it was not needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 6,
      "publication_date": 20171120
    },
    {
      "title": "pretty amazing device",
      "text": "Delivered as promised and works as promised. Really, pretty amazing device.",
      "rating": 5.0,
      "verified": true,
      "author": "James H. Mcelroy",
      "helpful_votes": 5,
      "publication_date": 20180311
    },
    {
      "title": "This is a great GPS unit",
      "text": "$22.99 per month for the monitoring. Will bring you right to where this unit is pinging from. Gives harsh breaking alerts along with accelerated acceleration. Great for those with kids just beginning to drive.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Pedlar",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Great product with real time tracking.",
      "text": "This device works as advertised. It is stupid easy to use and the iOS app and website are incredibly detailed. I love the fact that it does not need an independent power source, and that it is extremely small. This device is worth the price if you want to know where a vehicle is at all times. Really great product works as advertised.",
      "rating": 5.0,
      "verified": true,
      "author": "Nanotek",
      "helpful_votes": 6,
      "publication_date": 20161011
    },
    {
      "title": "Best bang for the buck!",
      "text": "We use these on ALL of our company vehicles and I even use them on my personal vehicles to make sure I know where the teens are and how they are driving. Since they even track vehicle maintenance - it's a must-have for more than 3 vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "G-Man",
      "helpful_votes": 4,
      "publication_date": 20160831
    }
  ],
  "product_meta": {
    "title": "Linxup GPS Vehicle Tracker",
    "description": "Linxup is a 3G GPS tracking device for companies, fleets, and personal vehicles.\n\nUse Linxup GPS trackers to quickly identify driver locations, reduce FUEL usage, increase efficiency, review driving history, and monitor driver safety & performance.\n\nThe Linxup GPS system makes it easy to take advantage of powerful GPS tracking capabilities.\n\nLinxup GPS tracker simply plugs into the OBD II port of any car or truck manufactured after 1996.\n\nThe web-based GPS software lets you track vehicles in real-time and review driving history on an interactive map with vehicle GPS details on direction, speed, stops, and more.\n\nLinxup GPS trackers also have a native mobile app for iOS and Android. Monitor driving activity and the location of your tracking device even when you're not in the office.\n\nBuilt-in GPS tools allow you to monitor safe driving habits such as speeding, harsh braking, and rapid acceleration; text and email Alerts tell you when a driver speeds, brakes abruptly, accelerates rapidly, tampers with a GPS tracking device, or uses a vehicle outside of authorized hours.\n\nThe GPS system creates a driver safety report card that summarizes and rates each driver's activity and compares it with the other drivers in your fleet.\n\nThe GPS system also allows you to track and monitor vehicle maintenance activities over time. Set up geofences (virtual boundaries on the Map) to identify important locations and monitor when your GPS vehicle tracker enters or exits these locations.\n\nLinxup GPS trackers can reduce FUEL usage in your vehicles by as much as 20% per month by monitoring and coaching your drivers to reduce speeds and eliminate unnecessary vehicle idling.\n\nOnly operates in the United States. \n\nWhat are you waiting for?\n\nGet Linxup GPS trackers and start saving today!",
    "rating": 3.9,
    "feature_bullets": [
      "No installation required – it’s as easy as plug and track.",
      "Compatible with any car, or truck manufactured since 1996",
      "System provides Real-time GPS tracking every minute when the vehicle is on and every hour when it is off",
      "Provides alerts for speeding, idling, unauthorized use, tampering and geofencing",
      "No long term contracts. Requires monthly airtime subscription. 30 Day Money Back Guarantee"
    ],
    "specifications": {
      "Product Dimensions": "1 x 1.75 x 2.1 inches",
      "Item Weight": "2 ounces",
      "ASIN": "B006TZGJDC",
      "Item model number": "LPVAS1",
      "Customer Reviews": "3.9 out of 5 stars376 ratings3.9 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "OS": "IOS & Android",
      "Connectivity technologies": "Wireless Cellular",
      "Additional Features": "Harsh Braking Monitoring, Rapid Acceleration Detection, 4G Cellular Data, Speeding Monitoring",
      "Other display features": "Wireless",
      "Colour": "OBD Install",
      "Included Components": "Linxup OBD GPS Tracker with installation and activation instructions for 4G cellular data",
      "Manufacturer": "Agilis",
      "Date First Available": "January 5, 2012"
    },
    "categories": [
      "All Departments"
    ],
    "price": ""
  }
}