{
  "website_summaries": [
    {
      "verdict": "An adorable Child to Cherish piggy bank that is a well-made, adorable option capable of holding lots of coins. Ideal for young sports fans.",
      "pros": [
        "Attractive, glazed ceramic piggy bank by a popular brand",
        "Has sports graphics, including a baseball, basketball, football and soccer ball",
        "Coins can be removed from belly stopper"
      ],
      "cons": [
        "Breakable",
        "Rare reports of flaws in the paint have been noted"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Adorable Banks",
      "text": "We loved these banks! Ordered 2 of the white with sports balls on for our 2 grandsons' birthdays and were very pleased with the size and appearance. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Leda Banic",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "It's big enough to put plenty of money in",
      "text": "Like it very much it's for my grandson and plenty of room to put money in",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Gasper",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Perfect for 2-year old",
      "text": "Great birthday gift. Obviously, not a toy to be played with, but a great 'heirloom' gift to be remembered in the years to come. I love it. Love the sports theme.",
      "rating": 5.0,
      "verified": true,
      "author": "William R. Clayton",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Super cute",
      "text": "This arrived packed really carefully so that it would not be broken. Its a large piggy bank and the print on it was really nicely done and the colors were great. I bought this as a baby shower gift for a friends daughter who was having a baby boy. They loved it. I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "C Smith",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Great quality piggy bank",
      "text": "My 2 year old is obsessed with balls and loves this piggy bank to put his coins in. He had a tiny bank that was full, so he was excited for how big this one is.",
      "rating": 5.0,
      "verified": true,
      "author": "Misty",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "This was a birthday gift for our 6 year old ...",
      "text": "This was a birthday gift for our 6 year old granddaughter. She loves owls so this ceramic bank was exactly what we were looking for. It is large and will hold lots of change---of course papa and nana put in some change to get her savings started.",
      "rating": 5.0,
      "verified": true,
      "author": "CT",
      "helpful_votes": 2,
      "publication_date": 20160421
    },
    {
      "title": "Best Piggy Bank on the Market",
      "text": "I have been looking for the perfect piggy bank that would last over the years for my now 3 year old grandson. This is by far the best one on the market. Super thrilled with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Geri",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "piggy bank",
      "text": "I searched and searched for a large ceramic bank and found it here at Amazon. It is a perfect size. Was shipped carefully and got here in one piece so I was pleased. It is a really nice bank although I felt it was a little pricey..................",
      "rating": 5.0,
      "verified": true,
      "author": "quilter",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Customer  service is great thank you",
      "text": "The first one was broken the the seller fixed that got a new one fast love it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon112368ha Customer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Colorful",
      "text": "What a cute bank! I got it for myself to put in the laundry room for all the loose change I seem to wash. It's well made and sturdy with skid proof tabs on each hoof. Bank was larger than I thought (which is good), colors are bright and happy.",
      "rating": 5.0,
      "verified": true,
      "author": "katz",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Sticky feet inside",
      "text": "Size is large piggy bank. Design is exactly as pictured. Only problem is when change is put in, the pig's feet are sticky on the inside so change got stuck. This is from nonslip stickers and hole at bottom of each foot.",
      "rating": 4.0,
      "verified": true,
      "author": "Leigh",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Adorable",
      "text": "This piggy bank is very cute and perfect for the child that likes all sports!!",
      "rating": 5.0,
      "verified": true,
      "author": "packermom",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Its important to teach kids to save",
      "text": "This is what Grandparents are for. Lessons that kids don't want. But it is nostalgic and fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Famousk1",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Baby gift",
      "text": "This is so adorable!!! Very big and colorful. Great paint job on animals. Really a very good price!!",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Fun for our kids",
      "text": "Tried to find a piggy bank to start teaching our kids about saving, and that would last through the years... we have girls and I wanted to stay away from anything too specific. These were perfect although a bit larger than expected! The girls love them!",
      "rating": 5.0,
      "verified": true,
      "author": "JLV",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Beauitful Piggy Bank",
      "text": "All of my kids have piggy banks and I was on the hunt for a cute piggy bank for my daughter and I found it. The ladybug and flower design is beautiful and the piggy bank is very large so you definitely get your money's worth. If you are looking for a unique, high quality piggy bank for your kid's room I recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany F",
      "helpful_votes": 0,
      "publication_date": 20130716
    },
    {
      "title": "Looks just like the picture.",
      "text": "It is very cute just as in the picture and arrived just fine. It is ceramic so must be careful with little ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg Wuebbels Leal",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Cute gift",
      "text": "Given as a gift and was well received. I was happy with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Joslyn",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Terrific LARGE piggy bank!",
      "text": "This piggy bank is GREAT! The plane decor on it is beautiful, the size is ideal, and furthermore, it came wrapped very securely. If anyone wants a substantial bank for a kids' room, this is it. I am very happy w/my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Cute little piggy bank",
      "text": "I'm expecting a new niece soon. Her parents decorated her room with a safari theme, so I wanted a piggy bank to represent that same theme as well. I came across this one on Amazon...I was expecting it to be bigger than the actual size, but for a new born I think this will do. The painted animals on there are adorable...I know Amazon doesn't show the side with the monkey, but that one is my favorite...too cute!!",
      "rating": 4.0,
      "verified": true,
      "author": "RLo",
      "helpful_votes": 0,
      "publication_date": 20120814
    },
    {
      "title": "teach them so save when they are little!",
      "text": "I love it. My grandson will be so excited with all the sports stuff on it. I think it will encourage him to put his money there when he gets it instead of in his pockets! He loves to carry it --- he is only 3.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Great product",
      "text": "Just received this product and I have no complaints. I was worried if it would arrive broke due to being fragile but it was packaged perfectly. It looks just like the picture and I have no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg M.",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Big bank with great workmanship.",
      "text": "This piggy bank was a lot larger than I expected it to be. I was very happy with the quality of the painted designs. This ended up being a great surprise gift at my co-worker's baby shower as she hadn't seen this in the typical baby stores before and it was in the same theme as her baby's nursery.",
      "rating": 4.0,
      "verified": true,
      "author": "A.T. Douglas",
      "helpful_votes": 0,
      "publication_date": 20130305
    },
    {
      "title": "It is cute, sturdy, and made me smile.",
      "text": "A gift for myself. I may start collecting banks. Even at my age lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Gayle W.",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "the pick of the litter",
      "text": "this is the second ladybug piggy bank i have bought because of great excitement the first brought. I looked for quite a while before choosing because I thought it the prettiest one in the litter. my two little granddaughters feel the same way",
      "rating": 5.0,
      "verified": true,
      "author": "BOBOSTON",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Perfect Piggy Bank!",
      "text": "Perfect worked well with my little daughter's flower bedroom! I am sure we will be putting change in this for college for quite some time!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Kingsley",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Really cute and would recommended.",
      "text": "For my grandson's his room is sports. Really cute and would recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "nana 28",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Made well and Great product that won’t disappoint!",
      "text": "Absolutely adorable! Big hit at baby shower! Looks beautiful in my new Great Neice’s nursery!",
      "rating": 5.0,
      "verified": true,
      "author": "Quilt girl",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Five Stars",
      "text": "Love it!!! It is so cute!!! I bought 2 colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Not So Much",
      "text": "Paint job not so great. Not happy with the placement of the compass painted under the curly tail. REALLY?",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "very nice bank",
      "text": "This was a gift for my grandson, was happy with the product. Looked even nicer in person.",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Five Stars",
      "text": "I ma glad this product comes in styles for girls and boys. Great product at an affordable value.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Really cute piggy bank",
      "text": "it was a baby gift for my brother and his wife. I filled it with money too. The quality is good and it is cute and fun!",
      "rating": 5.0,
      "verified": true,
      "author": "stefanie gates",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Cute!",
      "text": "Cute! Cute! Large and looks hand painted. Giving for a new grandbaby's baby shower gift. His room is decorated with owls and this should fit right in. I would order again if the need arose.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie McDermott",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Just What I Was Looking For",
      "text": "We were looking for a traditional piggy bank for our granddaughter, and this one caught our eyes. Grandma likes giraffes and Grandpa likes monkeys. The price was reasonable, the delivery sooner than expected, and the packaging was great. We would definitely recommend this as a wonderful gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama G",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Beautiful and nicely made",
      "text": "We ordered three different banks for three of our grandchildren. We loved them all, as did the children",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya Rogers",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Overall, this is a great product",
      "text": "This really is a beautiful piggy bank. The colors are much more vibrant in person. The only drawback is that most of the design is on the side and back of the piggy bank- the face of the pig is completely without any color and just looks like a plain white piggy bank. I wish some of the design carried over into the front of the bank.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha M Slusher",
      "helpful_votes": 4,
      "publication_date": 20121130
    },
    {
      "title": "Good product",
      "text": "Love the design, a little smaller than i thought it was going to be",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Much nicer than expected.",
      "text": "I should have ordered more and will. High quality, large piggy bank with vibrant colors and ceramic coating. Darling piggy bank that I will be proud to give as a gift. I will be ordering more soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy Wimmer",
      "helpful_votes": 0,
      "publication_date": 20131015
    },
    {
      "title": "LARGE piggy bank",
      "text": "Very nice LARGE piggy bank. Approx. 23\" around belly and 25\" around nose/tail direction. I highly recommend if you are looking for large.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruby",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Beautiful Piggy Bank!",
      "text": "My 6-year old daughter was thrilled to receive this! Beautiful first piggy bank. Don't expect a tiny bank. It's a fabulous large size. Would certainly buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "DMeader",
      "helpful_votes": 4,
      "publication_date": 20130213
    },
    {
      "title": "Looks exactly like the picture",
      "text": "Bought for my niece's birthday. My sister in law absolutely loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Donya",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Five Stars",
      "text": "This piggy bank is adorable and exactly what we wanted! It's big and so cute. Our daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica C.",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "Beautiful, large piggy bank",
      "text": "Beautiful, large piggy bank. My son loves putting change into it. The painting on it is just gorgeous, matches his nautical themed room perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Miller",
      "helpful_votes": 0,
      "publication_date": 20140922
    },
    {
      "title": "It is never too early to start saving.",
      "text": "I love this piggy bank. I always purchase a piggy bank for new born babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Harris",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "VERY PLEASED WITH MY",
      "text": "VERY CUTE PIGGY BANK FOR NEW GRANDSON......VERY PLEASED WITH MY PURCHASE",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine Walter",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Cute",
      "text": "I was looking for a red,whit, and blue piggy bank and this was the closes piggy I could find. Very happy with it and hope my son will use it for some years.",
      "rating": 5.0,
      "verified": true,
      "author": "S@r@h_C",
      "helpful_votes": 0,
      "publication_date": 20140130
    },
    {
      "title": "Great gift idea",
      "text": "This product is exactly as described and is very detailed, I bought it for my buddy when his son was born and him and his wife loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "JLH",
      "helpful_votes": 0,
      "publication_date": 20140625
    },
    {
      "title": "Thank you for your good service.",
      "text": "Its a very large, traditional piggybank, which is exactly what I wanted. The colours are clear and bright with an appealing cartoon. It came well-wrapped and arrived undamaged. Thank you for your good service.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Sanders",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Cute Pig",
      "text": "I think some piggy banks are funky looking and ugly but this pig is very cute. The hand painting is adorable and we'll keep this for many years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "John Kilman",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "pretty colors - lovely in a girls room",
      "text": "Well done, pretty colors - lovely in a girls room.",
      "rating": 5.0,
      "verified": true,
      "author": "Peach1",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Beautiful!",
      "text": "This piggy bank is large, cute, and seems to be high quality. The painting on the outside is so pretty! It will hold lots of money...overall, I'm impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Beckeroo84",
      "helpful_votes": 0,
      "publication_date": 20130427
    },
    {
      "title": "Five Stars",
      "text": "Adorable! Well made, large in size, just what I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "robin ferry",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Piggy Bank",
      "text": "Very pleased with the piggy bank. Very elegant paintings on it which correspond to my grandson's bedroom theme. Just wish I could have gotten it personalized with his name on it. Otherwise, it was of very good quality and am glad that I ordered it for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Allen",
      "helpful_votes": 0,
      "publication_date": 20140409
    },
    {
      "title": "Loved this bank",
      "text": "Loved this bank. Got it for my 2 year old grandson for his birthday. Great art work painted on this bank!",
      "rating": 5.0,
      "verified": true,
      "author": "BNE",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "Super cute!",
      "text": "I ordered this in Jungle jill and it's Super cute! It would make a great addition to any nursery or as a baby shower gift. It's great quality, sturdy, and not too heavy like some piggy banks can be. The hand painting is lovely and really gives the piggy bank that nursery feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20120808
    },
    {
      "title": "Beautiful bank for a child",
      "text": "It is beautiful. I will be buying several more. Well made and packaged to ensure safe delivery. I like the size not an itty bitty bank",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130918
    },
    {
      "title": "So cute",
      "text": "Just what I was looking for in question piggy bank for my niece. The size is great and it is very cute. Great price and quick delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Perfect Gift",
      "text": "Was so happy to find this for my future nephew! His room is being decorated in a nautical theme and this bank is precious and fits right in. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "maryann pinelli",
      "helpful_votes": 0,
      "publication_date": 20130308
    },
    {
      "title": "Loved it!",
      "text": "It was a gift and all really liked it. It is bright and colorful and good sized. Baby too small to comment but big sister liked it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "Couldn't find it any cheaper!!!",
      "text": "This bank is decent sized and will go perfectly in my neice's nursery!!! Love it!! I was worried it would be too small... again LOVE IT!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Winter",
      "helpful_votes": 0,
      "publication_date": 20130325
    },
    {
      "title": "Perfect!",
      "text": "I bought this for my baby her for her first christmas gift and is so beautiful and the size is great, I would recommend it and i would buy every design they are so CUTE!!",
      "rating": 5.0,
      "verified": true,
      "author": "mariela",
      "helpful_votes": 0,
      "publication_date": 20121207
    },
    {
      "title": "Love the bank",
      "text": "This piggy bank is larger than I thought it would be. Love the bank!",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Tallent",
      "helpful_votes": 0,
      "publication_date": 20150529
    },
    {
      "title": "Three Stars",
      "text": "Some pink paint on the nose... definitely not supposed to be there",
      "rating": 3.0,
      "verified": true,
      "author": "amanda frankoski",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Nice Large Piggy Bank",
      "text": "Purchased this bank for my new granddaughter. My son and daughter-in-law just love it!! I was looking for a larger than usual bank that was pretty and this one definitely meets my requirements!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bubbie",
      "helpful_votes": 0,
      "publication_date": 20130509
    },
    {
      "title": "good buy",
      "text": "My little buddy loves it, however I no longer have any change.",
      "rating": 5.0,
      "verified": true,
      "author": "Bearman",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "Five Stars",
      "text": "Purchased as a gift for my niece and she loves it. Very cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Monroe",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Five Stars",
      "text": "Absolutely beautiful, and larger than I thought it would be (which is what we were looking for)!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurel",
      "helpful_votes": 0,
      "publication_date": 20170819
    },
    {
      "title": "disappointing",
      "text": "its big, pretty, BUT there's a silver paint smudge on its ear",
      "rating": 2.0,
      "verified": true,
      "author": "Elizabeth.M",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Not heavily painted but very cute.",
      "text": "The people I gave it to as a gift loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Caltroon",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "FIRST FLIGHT",
      "text": "Gift for my soon to be nephew who made his first flight before even being born..",
      "rating": 5.0,
      "verified": true,
      "author": "linda urgo",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Beautiful bank!",
      "text": "This piggy bank is absolutely beautiful! I was surprised how large it really is, will definately hold a lot of coins! The artwork on the bank is bright and cheerful. Love the giraffe, zebra, and the monkey on the other side. Great product would absolutely purchase another one.",
      "rating": 5.0,
      "verified": true,
      "author": "charlie",
      "helpful_votes": 0,
      "publication_date": 20121120
    },
    {
      "title": "Best Piggy Banks Ever",
      "text": "Santa brought one for granddaughter and the rest of the family had to have one too! we have lady bug, owl, Jungle jack and birds",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Laughlin",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Arrived fast!",
      "text": "My niece broke her first one. Sadness all around. But no fear! For auntie \"fixed\" her piggy! :) such a cute little bank. Arrived very quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirch",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Super Cute",
      "text": "Purchased this for a birthday gift. Was super cute, and I felt that i get a lot of bang for my buck Would order again.....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Nicer than I expected!",
      "text": "I love it! I didn't expect it to be as nice as it was. The price was great, and it arrived a few days after I placed the order.",
      "rating": 5.0,
      "verified": true,
      "author": "Peppermint",
      "helpful_votes": 0,
      "publication_date": 20130422
    },
    {
      "title": "Great Bank",
      "text": "Love it and so does my little girl who loves owl's",
      "rating": 5.0,
      "verified": true,
      "author": "Tobster",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Adorable!!! and LARGE!!!",
      "text": "Matched what the theme the mom was doing in the babies room and she LOVED it!!! A lot of people at the shower wanted to know where I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Such a cute piggy!  Love the raised designs!",
      "text": "This little piggy bank is actually a replacement for one that \"accidentally\" got smashed last year - and I love this new one! Not only is the pig itself quite adorable, the raised designs actually make it easier for my three-year-old daughter to carry safely without it slipping from her chubby little fingers! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Robert & Barbara Lapointe",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Child to Cherish Piggy Bank, Sports, Large",
      "text": "My grandson has a sports theme in his room with blue and orange as the colors. The piggy bank was a great addition, especially since he didn't have one yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn Strawoet",
      "helpful_votes": 0,
      "publication_date": 20140301
    },
    {
      "title": "So adorable!",
      "text": "I was looking for a special gift for my baby niece, and this was the perfect thing. It's a great size, beautifully painted and so cute. I liked that there were different scenes to choose from. And the monkey on the other side was a neat surprise. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "BLI",
      "helpful_votes": 0,
      "publication_date": 20130314
    },
    {
      "title": "Five Stars",
      "text": "bought this for a new granddaughter of a friend - really cute and quite large",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn Reinke",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "Grandson Was Very Happy",
      "text": "I received the piggy bank on time and in very good condition. My grandson was very happy with the bank and showed it to everyone. It was much larger then I expected so I am sure he will be able to save up a fortune. One happy customer.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia I. Penley",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Cute piggy bank!  Loved the painted details.",
      "text": "Was a great gift for some new parents! We used this at the baby shower for collecting bets on when she would have the baby. So cute and a great piggy bank going forward for the baby.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Five Stars",
      "text": "This bank is absolutely adorable! The painting is good. I would recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "So cute!",
      "text": "Bought this as a gift for a nautical-themed nursery and it was a huge hit. So cute, beautifully painted. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "The Best Piggy Bank for any child of yours or anyone else .....GrandPa Mike",
      "text": "My 2 year old GrandSon loves it....He only hates it when he realizes he can't get his money out ! Well made, wonderful artwork ! Great for any child.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael E. Tamburri",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Love it!",
      "text": "My daughter is expecting and plans to decorate the baby's nursery with an owl theme. The bank was large, and we all loved it. Precious!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Hudgens",
      "helpful_votes": 0,
      "publication_date": 20140505
    },
    {
      "title": "Perfect Gift",
      "text": "Absolutely perfect. Shipped and received with 2 day shipping. Perfect quality, beautifully painted. ♡",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Heeter",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "Awesome Piggy Bank",
      "text": "Super cute, and very big! Just what I was looking for to give to my niece. Almost wanted to keep it for myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Berceau",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "Jungle Jill Cherish Piggy Bank",
      "text": "The Child to Cherish Piggy Bank is really cute & arrived in good condition. Rated 4 stars instead of 5 because of the price.... It was high for a piggy bank.",
      "rating": 4.0,
      "verified": true,
      "author": "Bethann  Davis",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Wonderful gifts and the kids are so proud to have ...",
      "text": "Expecting our 4th grandchild, so this is the 4th piggy bank for us! Wonderful gifts and the kids are so proud to have their own bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Big and super cute! My 2 year old son loves to ...",
      "text": "Big and super cute! My 2 year old son loves to save his coins in this",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Preonas",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "Fast Shipment",
      "text": "Received the product in a timely matter. Bank was to replace one my daughter broke. Some scratches in the paint",
      "rating": 3.0,
      "verified": true,
      "author": "Sommer M Joslin",
      "helpful_votes": 0,
      "publication_date": 20121217
    },
    {
      "title": "Ms Kinzie's Piggy Bank",
      "text": "My Niece is only a couple months old.. but she needed a christmas present.. her mom has her room and theme as Owls in all her stuff.. this piggy fit the theme for her thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Bryant",
      "helpful_votes": 0,
      "publication_date": 20121218
    },
    {
      "title": "Nice Quality Piggy Bank",
      "text": "Very Happy with this bank--nice detail on painting to match our Grandson's room.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Parsell",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "piggy bank",
      "text": "Exactly what I wanted and what I got! Well made. Bright colors. Will grow with our grandson! This is good for any age group.",
      "rating": 5.0,
      "verified": true,
      "author": "carol stratton",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Who wouldn't love this?",
      "text": "It was much larger than I thought it would be. I am very pleased with this bank. We will be able to save lots of money with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty Peterson",
      "helpful_votes": 0,
      "publication_date": 20130210
    },
    {
      "title": "Great !!",
      "text": "The bank was exactly what I was looking for. The large size fit my purpose of starting to save foru first grandchild.",
      "rating": 5.0,
      "verified": true,
      "author": "Faye Black",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Very pleased",
      "text": "It arrived on time and was true to the description. Perfect for any nautical theme room.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Carbajal",
      "helpful_votes": 0,
      "publication_date": 20160325
    }
  ],
  "product_meta": {
    "title": "Child to Cherish Ceramic Piggy Bank for Boys, Sports",
    "description": "Color:Sports DesignOur ceramic piggy banks are a classic keepsake made to last. Each bank is commissioned from the highest quality ceramic known as dolomite ensuring increased durability. All of the banks are then glazed, hand painted, and fired to lock in the colors and attention to detail, making them truly one of a kind. The Child to Cherish brand features coin banks of all shapes and sizes, with many color options and themes to suit boys and girls rooms alike. Child to Cherish piggy banks are a great addition to any nursery decor or kids room that will last through the years and grow with the child as they learn to save their money. Find the perfect baby shower or christening gift that is sure to touch the hearts of any new or expecting parent. We hope the little ones will enjoy saving for many years to come.",
    "rating": 4.8,
    "feature_bullets": [
      "Beautifully glazed piggy bank features a hand painted design and measures at 8 x 7 inches",
      "Made of high quality ceramic dolomite for a long lasting classic keepsake",
      "Piggy bank is equipped with a 1.5 inch coin slot at the top and a removable rubber stopper to hold in the coins at the bottom.",
      "Kids will love learning to save their money as they fill up this special piggy bank",
      "Perfect for any baby's nursery or kids room, making this a great gift for baptisms, christenings, birthdays, and more."
    ],
    "specifications": {
      "Product Dimensions": "7 x 7 x 8 inches",
      "Item model number": "36822",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Male",
      "Number Of Items": "1",
      "Batteries required": "No",
      "Item Weight": "2.55 pounds",
      "ASIN": "B006TTEDMW",
      "Customer Reviews": "4.8 out of 5 stars222 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#46,679 in Toys & Games"
    },
    "categories": [
      "Baby"
    ],
    "price": 28.99
  }
}