{
  "website_summaries": [
    {
      "verdict": "A good-looking, versatile table with 2 games in 1. Makes a great addition to a game room, garage, or basement.",
      "pros": [
        "Pool and table tennis in a 7' model",
        "Easy to convert by simply placing the table tennis top over the table surface",
        "Easy to assemble",
        "Handsome and sturdy",
        "Comes with all the accessories you need to play both games"
      ],
      "cons": [
        "The bounce on the table tennis top could be better, but this isn't a deal breaker"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "mavrick 7 ft pool table",
      "text": "Received the table a few days ago. As other reviewers said, easy to put together. As long as you know what to expect from a table in this price range I don't think you will be disappointed. If you compare it to tables of similar construction you will be happy, if you compare it and expect balls to roll and bounce off the rails as a higher priced slate board you will be disappointed. Balls don't roll as fast and the bounce off the rails are not as strong. However, if you are aware of that you will be happy.",
      "rating": 5.0,
      "verified": true,
      "author": "richard preslar",
      "helpful_votes": 54,
      "publication_date": 20160401
    },
    {
      "title": "Great quality for the price. Perfect for young families.",
      "text": "We are really enjoying this pool table. The price was right for our family as we have 3 kids from teens to tweens and didn’t need an expensive professional pool table to suit our needs. Easy to install and change out the table top for tennis. My husband and I genuinely enjoy this table; it completes our family room nicely without taking up too much space and you can’t beat the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Mitchell",
      "helpful_votes": 9,
      "publication_date": 20190603
    },
    {
      "title": "A great beginners pool table!",
      "text": "Me and my roommate split this beautiful pool table as we loved billiards. You need two strong individuals to assemble the table and move it as it's quite heavy. Once fully assembled everything works great and function as promised but after awhile the legs seem to get a little wobbly. It's great for practice and if you're looking to have fun, but if you're competitive and want a quality pool table I'd recommend looking for another. The ping pong table worked great and was easy to set up on top of the pool table. Great for party games too!",
      "rating": 4.0,
      "verified": true,
      "author": "Tomas",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Worth the Price!!!!",
      "text": "This is definitely worth the money!!! The kids and us as the parents loved the pool table and it is very sturdy and easy to put together. The table cloth is also pretty good and the cues and paddles are nice too! The ping pong table is very sturdy and works perfect!!Great gift for Christmas or birthdays!",
      "rating": 5.0,
      "verified": true,
      "author": "ASHRAF W.",
      "helpful_votes": 3,
      "publication_date": 20190722
    },
    {
      "title": "OK for the money.",
      "text": "If I had to do over, I would have gotten the 8' table. Table tennis table is a joke. Way too small. The Pool cues and paddles are worthless also. The table is level which is important and plays okay. Great for kids. We ended up buying a regulation size ping pong table top, pool cues, and paddles. The table is slow and the rails are stiff.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard Blodgett",
      "helpful_votes": 4,
      "publication_date": 20170812
    },
    {
      "title": "Great for kids!",
      "text": "Very easy to put together, with very little time needed. This was a great present for the family and we've used it everyday since we got it. The pool table has been very solid. The table tennis top doesn't get as much use as the pool table because it requires effort to setup. Nonetheless, this was a great buy with no issues so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Huy Le",
      "helpful_votes": 7,
      "publication_date": 20160202
    },
    {
      "title": "Good for the most part.",
      "text": "Took a process to finally get this for church youth group. It's been a few years and from what I know still is going very well. One of the balls busted shortly after I bought it so I got them two new sets of pool balls.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter M. Haugo",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Great pool table for the price",
      "text": "Seems like it a great quality for the table, the grandkids are young and didn't want to spend to much. hopefully it will last for years to come",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Aufiero",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Good product and fair price",
      "text": "Easy to assemble, but look instructions over completely and carefully to do it right! Amazon shipping was excellent. Had it for a week now. So far, so good. We like the table very much. Very sturdy. Needed smaller version than competitive size and it fits perfectly. Two teens at home, loving it.",
      "rating": 4.0,
      "verified": true,
      "author": "2forMom",
      "helpful_votes": 4,
      "publication_date": 20160101
    },
    {
      "title": "Best value you'll find (for a low-price)",
      "text": "I'm no expert, but after plenty of research I've concluded that this is truly the best value that you'll find if you're looking for an affordable pool table. It arrived in perfect condition, and assembly was very easy. Despite other reviews, the felt has held up well. So far, it has provided several hours of entertainment for my wife and me. When I purchased this, I didn't really care about the table tennis aspect -- it's just an added bonus. I will say, though, that you will definitely need to get some better cues than the ones that come with the table (I went to Sears and picked up a couple for $20 each). Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160820
    },
    {
      "title": "was delivered via freight truck on a thurs and they ...",
      "text": "was delivered via freight truck on a thurs and they left it in my garage, I was told by people that they cant help move table into basement which was 10 ft away. so I opened the box and removed all the parts and even was able to maneuver the table on its side with a blanket and slide it into basement. I payed extra to have people come to assemble. they came on Monday and were little late and only took them 30 min to assemble. I had no scratches, or rips in the felt or no problems with table top either. I already purchased nicer paddles and maybe new pool sticks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon S.",
      "helpful_votes": 3,
      "publication_date": 20170201
    },
    {
      "title": "and the quality of the cue and ping pang pad are not so good. I need to ask for a replacement and ...",
      "text": "Came with damaged felt, and the quality of the cue and ping pang pad are not so good. I need to ask for a replacement and buy new cues and ping pang pad.",
      "rating": 2.0,
      "verified": true,
      "author": "Ray Chu",
      "helpful_votes": 2,
      "publication_date": 20180411
    },
    {
      "title": "Pool /tennis table",
      "text": "Comes in on a pallet. Get help to move around(2 guys are enough to flip). When assemble leave some play on screws to attach all legs and then tighten up. Sturdy table great for home fun. Comes with everything you need to play. Table top is smaller size than original tennis table but is just fine for home play. Tennis pads and balls are low quality definitely u need to buy better ones( $30-50 ). Make sure u check your table game play space. 7 foot is just enough for home its perfect for the money and will recommend it to others",
      "rating": 5.0,
      "verified": true,
      "author": "Vladi",
      "helpful_votes": 3,
      "publication_date": 20161204
    },
    {
      "title": "It's worth the price",
      "text": "I am really enjoying the pool table, it was easy to set up but heavy to carry up the stairs along. I would not advise but I did and got half way up and had to go back downstairs and unpack the set. It was much easier to transport upstairs out of the box. For everything that came with the table it was worth the price. The outer box came bent and damage but the product inside was safe and secure from damage. I would highly recommend the pool table.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great table for both kids and adults.",
      "text": "I am favorably impressed with this pool/ping pong table. It is actually nicer than I had expected, and is very solid. I had two friends help assemble, and they had it completed in about 30 to 40 minutes. All the parts were included and were well labeled. I purchased the table for kids ages 5 to 10, but it's great for adults, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet P.",
      "helpful_votes": 0,
      "publication_date": 20201024
    },
    {
      "title": "Really good not great",
      "text": "Every thing is as advertised and the pingpong is awesome. The pool table is slow but very nice. I really would give a 5 but wish i had paid the extra for larger table. The value and quality are good not great. You will need to upgrade pool cues, table tennis rackets and ping pong balls. We bought this for kids to use and abuse and we use often. I would purchase again just bigger.",
      "rating": 4.0,
      "verified": true,
      "author": "tpob",
      "helpful_votes": 2,
      "publication_date": 20160307
    },
    {
      "title": "Great table for the money",
      "text": "Great table for the money! It was difficult to take it through the stairs into the basement, but doable. It was fairly easy to put together and to level it. The pool table is pretty sturdy and the felt on the top of table is of good quality. We have not tried the tennis table yet. My two sons and their friends are having a blast playing pool!",
      "rating": 4.0,
      "verified": true,
      "author": "Rejane smith",
      "helpful_votes": 6,
      "publication_date": 20150124
    },
    {
      "title": "Product had many issues. Cloth was damaged at delivery ...",
      "text": "Product had many issues. Cloth was damaged at delivery and I had to tape and glue one of the legs. It has a feel of cheap but that's expected. However, I expected no cosmetic damage out of the box.",
      "rating": 2.0,
      "verified": true,
      "author": "Philibert Girurugwiro",
      "helpful_votes": 3,
      "publication_date": 20171020
    },
    {
      "title": "Not a professional table!! But loads of fun.",
      "text": "They sent me all the same legs. Smh. Fortunately, my husband is handy and was able to drill new holes and put it together. Know what you're getting. This is not a professional table. The wood is not of good quality but when put together properly, it will be sturdy. This is a good table for a family game room. Be sure to buy a protection plan. Other than that we have been having a good time. Table tennis is great!",
      "rating": 3.0,
      "verified": true,
      "author": "Lawana",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Looks great. Decent for the price",
      "text": "Looks great. Decent for the price. Some \"dipping\" towards the edges causes balls to roll towards the sides. It was originally shipped with the wrong legs but when I contacted customer service they promptly sent new ones. Definitely doesn't play like a slate table but it's fun for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicholas Filarelli",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "I bet you will like it",
      "text": "When I ordered it online, i was kind of worried and was't expecting such a great table. its perfect. I love it. 7 feet perfectly fit into my small house. easy to put together and need at least 2 person to bring it in, kind of heavy. I haven't tried table tennis yet but i bet it would be awesome as well. Thank you Hathaway and Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Gunjal",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Love it",
      "text": "great for me and my husband the step away from the kids and have us time",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Great buy",
      "text": "Pretty nice for what it is. Would buy again. If your a serious pool player it might not be for you, but for the casual player its great. We also use it for a dining table as it is high enough to get your legs under with a chair. Cover it in a table cloth and its perfect. Great buy for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Sukusia",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "This combination table works well - easy to take off the top table",
      "text": "This combination table works well - easy to take off the top table. Love playing pool and ping pong. The colors are great. Looks like the picture online and it was delivered as promised",
      "rating": 5.0,
      "verified": true,
      "author": "Laura B",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Very worth it!",
      "text": "We're having a great time with our pool/ping pong table. After receiving a damaged one initially Amazon did a good job of getting us a replacement. The shipping had some issues - neither company's driver would agree to bring it inside, despite Amazon assuring us they would. So, make sure you have at least 2 guys on hand to bring it inside when it's delivered (very heavy). Sets up easily and it was perfectly level right of the box. It seems to be very good quality. We've already gotten more dollars worth of fun out of it than it costs. Thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Scott Crider",
      "helpful_votes": 7,
      "publication_date": 20160729
    },
    {
      "title": "nice table for your bucks",
      "text": "just set it up....very nice pool table....affordable, sturdy and prefect size! my husband loves it...took about 1 hour or less to out together, easy to set up...not problem as of now....will update if any changes occurs.....",
      "rating": 4.0,
      "verified": true,
      "author": "kena",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "It’s a great size and is fine for the kids to play ...",
      "text": "The table is almost impossible to level. The plywood used is slightly warped and the balls on each side of the table roll toward the bumper. It’s a great size and is fine for the kids to play on.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron Laughlin",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "It came with a defect on one of the legs and went underneath the felt.",
      "text": "The defect crack affects how the balls roll over that area of the table. We had to hire someone to put it together. Amazon wanted to pick it up for free but there was no replacement offered. We are bummed as it is a fun table but would prefer it to be defect free!",
      "rating": 2.0,
      "verified": true,
      "author": "Alecia Viera",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Easily adjustable legs",
      "text": "Met my expectations. Easily adjustable legs. Less than 1 hour to build it. Could use better pool cues as these are extremely light.",
      "rating": 5.0,
      "verified": true,
      "author": "Kris Schlembach",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Great pool table",
      "text": "This is nice table for the price. Friends and family have all enjoyed it. The size was perfect for our room. It was delivered very professionally & packed extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 3,
      "publication_date": 20150126
    },
    {
      "title": "GREAT TABLE for the price.",
      "text": "Great Table for the money. It plays well, even though not slate, but also didn't cost me $2500. Some of the holes didn't quite line up when assembling. This was noted in others comments. But nothing that a little drilling didn't fix. Very Happy with it. Great to be the house kids come over to play at without having to spend a ton of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160305
    },
    {
      "title": "1st one was destroyed 2nd not much better",
      "text": "When it arrived the driver didn't even take it out of the truck it was in such bad shape. Finally after a few weeks I got the second one. This one has a crack in the board and scratches everywhere. I'm keeping it since it was a gift for my son and he didn't want to wait for another one to arrive. See pics",
      "rating": 1.0,
      "verified": true,
      "author": "Amnon Arama",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Love it",
      "text": "Good value for the price. It is smaller than usual size, but perfect for our living room with limited space.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalia",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Great pool table",
      "text": "Great pool table, a lot of fun without taking up large space. Especially good for kids. Delivery was free, which is great for this bulky item. Good quality and easy to assemble. The table tennis top is good quality. However the net and racket quality could have been better.",
      "rating": 4.0,
      "verified": true,
      "author": "SJman888",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "Not level",
      "text": "Not level. One end slopes down. Such a pain to get in and up not sure if it would be worth it to request a replacement. Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "... it for about 3 weeks and it has been fun! No problems so far and it was fast ...",
      "text": "We have had it for about 3 weeks and it has been fun! No problems so far and it was fast and easy to put together. As the saying goes, you get what you pay for, but for the price it is a pretty good deal. As of now I would definitely recommend to anyone looking for a fairly inexpensive source of fun but it only comes with 2 cheap pool sticks. Otherwise we are very much enjoying our new table!",
      "rating": 4.0,
      "verified": true,
      "author": "Alex Horst",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Returning my third try with this table. First and ...",
      "text": "Returning my third try with this table. First and third one was not flat at all. Balls rolled to each edge. Second one arrived broken. We will be buying another table.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Perfect for my basement",
      "text": "This is a nice table. Assembly was not too difficult. Be sure to attach the legs with the table upside down. Its really easy. I was surprised at the size. It's bigger than I expected. I was able to level the table with no problem. 2 young people flipped the table around with a little effort. Its not a pool hall table but it is impressive to me for the price. My children and I enjoyed both the pool table and the ping pong table which is also easy to assemble. Pool cues are cheap but usable. I bought red chalk ( the table came with blue chalk).",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 3,
      "publication_date": 20161109
    },
    {
      "title": "Great Value Table",
      "text": "Excellent product. I had this on my wish list for about 8 months before pulling the trigger when the pricepoint dropped. This table fits perfectly in my basement and I would recommend to anyone with limited space. The two pool cues that come with the table are pretty cheap (58inch 11 ounce), I would recommend replacing these early, along with the rack. The balls that come with the table are adequate, the coloring is not always even. The Ping-Pong paddles are the plain kind with no padding so you may want to replace these as well depending on preference. This table should pay for itself in time by keeping me at home instead of buying games/beer at the bar!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Jahnke",
      "helpful_votes": 7,
      "publication_date": 20150709
    },
    {
      "title": "Great product!",
      "text": "Great product for the money. You won’t be disappointed. The only thing I did after purchasing was upgrade the pool sticks and balls.",
      "rating": 5.0,
      "verified": true,
      "author": "Renae Fultz",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Excellent pool table",
      "text": "Excellent pool table for the money. We are enjoying playing on this table.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisabeth",
      "helpful_votes": 5,
      "publication_date": 20141209
    },
    {
      "title": "waste of money",
      "text": "Poor quality of table I dnt like it planning to return..all accessories are very cheep quality table cloths also not a good quality",
      "rating": 2.0,
      "verified": true,
      "author": "Ayesha ",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Good for the price level but had to spend too ...",
      "text": "Good for the price level but had to spend too much time on the phone with the shipping company who could not get their schedule right and communication issues on the delivery... the felt is wrinkled around the edges to a dissapointing degree. The plastic pocket nets are warped and not staying trimmed properly around the pockets. Also, the pocket nets are only large enough to hold about 3 balls before you have to spread the balls out in order for more to fit...otherwise leading to a missed shot.",
      "rating": 2.0,
      "verified": true,
      "author": "Webjoe98",
      "helpful_votes": 4,
      "publication_date": 20151215
    },
    {
      "title": "Fun pool table!",
      "text": "Easy to put together. Solid table. I would recommend this table for a game room or a man cave. Even though it's not regulation size, you still need a lot of room to play without obstruction.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Pappas",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "We love it!",
      "text": "We love it!!! my husband put it together in about 45 minutes, so easy. It is heavy, which is a good thing , my husband and I were able to turn it right side up when it was done , no problem. It's worth every penny!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "James G.",
      "helpful_votes": 0,
      "publication_date": 20171114
    },
    {
      "title": "So So.... So Far on Recent Purchase",
      "text": "Easy to assemble. Came with level playing surface. Did not have product a week and felt started loosening on bumpers.",
      "rating": 2.0,
      "verified": true,
      "author": "CF",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Very good buy.",
      "text": "Wow! I just received my pool table, so far I'm very impressed with my pool table, it was package very good and no damage was found on any parts. Assembly was pretty easy and the parts fit together good too. This was a very goobuy and the shipping company even delivered it inside my house for me I ordered this pool table back in March of this year, I have really enjoyed playing pool on this table, the month is now July of 2015 and I have to say that I'm still very happy with this pool table. If anyone is looking for a real good pool table I would recommend this table you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Ace",
      "helpful_votes": 4,
      "publication_date": 20150317
    },
    {
      "title": "Seems to be excellent quality. The size is just right",
      "text": "Shipped sooner than expected. Seems to be excellent quality. The size is just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Okay product",
      "text": "The felt was ripped when it arrived , and it also looks very thin and low quality. No idea if Amazon can fix it . But the table was okay.",
      "rating": 2.0,
      "verified": true,
      "author": "sudip",
      "helpful_votes": 2,
      "publication_date": 20161109
    },
    {
      "title": "Great value.",
      "text": "Sturdy well built. Packaging was very well padded and kept table from damage in transit.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis McLeod",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Five Stars",
      "text": "Great product and great service!! I will come back to buy again if needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael zhao",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "After reading the reviews I shouldn't be upset but I ...",
      "text": "After reading the reviews I shouldn't be upset but I am. I just got it today and noticed the material was torn and had scratches. Last time I order a pool table on line.",
      "rating": 2.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 2,
      "publication_date": 20170321
    },
    {
      "title": "Five Stars",
      "text": "Easy assembly, easy to move around. Great quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "i'd say better than what you'd expect",
      "text": "The table is what you'd expect for the price, i'd say better than what you'd expect, and is a good value, based on the few days of use. HOWEVER, I am missing a tiny part and it's impossible to find a contact to get the tiny part replaced. VERY frustrating. It's a marker that goes along the edge of the pool table. PLEASE send me the white marker. Thank you.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Engles",
      "helpful_votes": 3,
      "publication_date": 20160507
    },
    {
      "title": "Great Value and Great Quality for the price",
      "text": "Table Arrived and plays very well. Great Value and Great Quality for the price...",
      "rating": 5.0,
      "verified": true,
      "author": "J.R.",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "Five Stars",
      "text": "Great table.. The sticks are too light but everything else is great..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "AWESOME!",
      "text": "My husband was so excited to get a red top pool table to complete the look of his Marines themed game room. The table came on a pallet with just a few pieces to put together before setting it up. It was extremely easy to level off and looks amazing!!! We were beyond happy with the discount we paid but would gladly pay full price for this.",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Four Stars",
      "text": "Very well put together easy to assemble Very nice for small area",
      "rating": 4.0,
      "verified": true,
      "author": "kenneth pruiett",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "This a great table for the money",
      "text": "This a great table for the money, have used it for 3 months! Neede 3 adults to set it in place",
      "rating": 4.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 8,
      "publication_date": 20141116
    },
    {
      "title": "Billiards and Ping Pong in one.",
      "text": "Works great. Easy to adjust the table lean. The paint on the ping pong table does align perfectly, but can live with that since the middle lines doesn't do anything in the game.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Scher",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "This was easy to assemble",
      "text": "This was easy to assemble, easy to level, and has provided constant daily and nightly enjoyment for my family. It pretty much came with everything you need, but we opted to purchase additional cue and balls, along with a self standing holder for all of it. Besides my hot tub, I can't think of a better investment for the family I have made in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "oddgriffin",
      "helpful_votes": 6,
      "publication_date": 20141208
    },
    {
      "title": ") Just bought blacklights for an extra fun ping pong game",
      "text": "We're having a blast on the new table! I think I'm getting the hang of pool again. ;) Just bought blacklights for an extra fun ping pong game ;)",
      "rating": 4.0,
      "verified": true,
      "author": "Alice ThompsonTop Contributor: Harmonicas",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Love this new pool/ping pong table combo",
      "text": "Love this new pool/ping pong table combo. Very nice and met all of my expectations. Very easy to put together, although I was missing four washers. I made it work none-the-less. Great investment, especially for entertaining.",
      "rating": 5.0,
      "verified": true,
      "author": "Mia Dozier",
      "helpful_votes": 2,
      "publication_date": 20141231
    },
    {
      "title": "Very disappointing",
      "text": "Very disappointed. Just assembled it and found a large scratch in the playing area. Also, one side on the top of the table has a big chipped spot. See two attached pics. Will contact Amazon to replace or return.",
      "rating": 2.0,
      "verified": true,
      "author": "Tauheed Q Siddiqui",
      "helpful_votes": 2,
      "publication_date": 20170110
    },
    {
      "title": "I've had it for three weeks now and I love it. The ping pong conversion is a little ...",
      "text": "I've had it for three weeks now and I love it. The ping pong conversion is a little cumbersome for setup but not too bad. Lots of fun and great quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Table good cues too light and as with other reviews the ...",
      "text": "Table good cues too light and as with other reviews the table tennis net needed sewing and the triangle was too big. would also be good if the chalk was the same colour as the table!",
      "rating": 4.0,
      "verified": true,
      "author": "Graham Gilbert",
      "helpful_votes": 2,
      "publication_date": 20150421
    },
    {
      "title": "Four Stars",
      "text": "My husband love it. We needn't have to leave the house to enjoy pool .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Four Stars",
      "text": "Fantastic and fits my game room. My family continues to enjoy this.",
      "rating": 4.0,
      "verified": true,
      "author": "Ngozi",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "Nice!",
      "text": "Nice table for the price and the ping pong table top is a great bonus. I was a little fearful because of the composite playing surface, but the table is solid and well built, Very easy to assemble - just make sure you have the legs in the correct position before you screw them in. We have been playing non stop since Christmas. Perfect fit for our game room.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Alteri",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Five Stars",
      "text": "It was easy to assemble and everything came in the package",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Patterson",
      "helpful_votes": 0,
      "publication_date": 20160424
    }
  ],
  "product_meta": {
    "title": "Hathaway Maverick 7-foot Pool and Table Tennis Multi Game with Red Felt and Blue Table Tennis Surface. Includes Cues, Paddles and Balls",
    "description": "The Maverick 7-ft Pool Table delivers top quality billiards with the extra bonus of table tennis - all at this great price! If you love to play pool, this table has quality features and the compact 7 foot playing surface fits in many game rooms where a larger table won't. Double the fun with the included table tennis table top! Includes all the accessories you need to play pool and table tennis. Add this versatile Hathaway game table to your rec room for hours of gaming fun! 180-day limited .",
    "rating": 4.1,
    "feature_bullets": [
      "TWO GREAT GAMES IN ONE – Save space with this gorgeous, mid-size pool and table tennis combination table. Why buy multiple tables when you can get all the fun in one? Simple 2-step conversion makes switching games a snap.",
      "PERFECT FOR FAMILIES – This 7 foot pool table is the ideal size for kids. Adults will love its premium features and stylish design. And switching to table tennis is seconds away with the Maverick’s space-saving top.",
      "QUALITY CONSTRUCTION – The Maverick stands up to the toughest competition, with a poly-sealed billiard surface featuring beautiful blended felt and K66 rubber cushions.Durable resin molded drop pockets",
      "EVERYTHING YOU NEED – The Maverick comes loaded with accessories, including two 57” pool cues, sixteen 2.5” billiard balls, a triangle, chalk and brush. It also comes with two table tennis balls and paddles, a net and post.",
      "DIMENSIONS - 84 x 46 x 31 inches. Pool Table playfield: 74.75” L x 36.75” W. Table Tennis playfield: 84” L x 46” W."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "84 x 46 x 31 inches; 252 Pounds",
      "Item model number": "BG1023",
      "Department": "Unisex-teen",
      "Date First Available": "November 19, 2011",
      "Manufacturer": "Hathaway",
      "ASIN": "B0066NROUY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sports & Outdoors",
      "Sports & Fitness",
      "Arcade & Table Games",
      "Tabletop Table Tennis",
      "Leisure Sports & Game Room"
    ],
    "price": 699.99
  }
}