{
  "website_summaries": [
    {
      "verdict": "The Renew SleepClock is a user-friendly gadget that also keep tabs on how well you sleep without the need for wires, headbands, or watches.",
      "pros": [
        "The Renew SleepClock monitors your sleeping habits, presents data in a easy-to-read app, and has decent sound quality"
      ],
      "cons": [
        "The SleepClock may be too expensive for some, and its large build takes up a lot of nightstand real estate"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 7.0
      },
      "publication_date": 20120731,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "so regrettably this was a complete waste of money",
      "text": "Unfortunately, it will be very difficult to use this with the new iPhones (6 & 6+). I was able to get the Apple adapter to allow me to use this with the i5, but when using any kind of cover on my i6, the adapter is too short, so regrettably this was a complete waste of money. I had my original Gear 4 for several years...it worked very well...but until someone comes out with a longer adapter, my Gear 4 is an expensive paper weight. The only alternative is to take my phone case off every night...which is not an option.",
      "rating": 3.0,
      "verified": true,
      "author": "Walter  L.",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "Still works, even without website being active.  Great buy if price is hugely discounted (as it was for me).",
      "text": "Web site is dead. Clock gets it's time settings form your iDevice, so there is no time drift. Alarms are pleasant. Sleep auditing is so-so. App still works fine. I used it with my iPhone and iPad and both work fine. I got these at a discontinued price for 12 dollars each for a pair of them. For that price, they're great. They will still wake you even if you forget to start the app that monitors sleep.",
      "rating": 3.0,
      "verified": true,
      "author": "Schly",
      "helpful_votes": 0,
      "publication_date": 20140826
    },
    {
      "title": "Compact and works great!",
      "text": "I bought this to use in the baby's room with my old iphone so I could stream lullabies. Works perfectly and has great sound. Small and compact too and a great price!",
      "rating": 5.0,
      "verified": true,
      "author": "TXcust",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Stay asleep.",
      "text": "I bought this for my wife (her alarm clock was very finicky) and has been wonderful for me. She only uses it for an alarm clock and it works great. Soft bird chirping gradually getting louder. Her previous alarm was very loud and extremely annoying. If your spouse gets up before you and you have a chance to purchase this at a good price, do so.",
      "rating": 5.0,
      "verified": true,
      "author": "happyparent",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Doesn't work",
      "text": "Do not buy this! It's at such a discounted price because you need an app to run it and THE APP IS NO LONGER AVAILABLE. I tried finding it and bootlegging it so many ways, but nothing worked. Waste of time and money--I returned it after owning it two days.",
      "rating": 1.0,
      "verified": true,
      "author": "Myr",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Good alarm clock.",
      "text": "I like the way this wakes you up. Gradually getting louder after it senses your movement. Sometimes it doesn't seem to notice me getting up during the night but for the most part it works well. I still have an iPhone 4 so I use \"do not disturb\" to keep my phone from making noise during the night while I'm sleeping..",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Interactive and very nice features",
      "text": "Not really something you can program your entire sleep schedule around, but it gives plenty of functionality and definitely offers a way to tell whether you are getting enough sleep. In essence, it is a great product to adjust your sleeping schedule and the features that wake at the best time during the sleep cycle appear to work well also. After using the product for about a week, I do feel that I have been waking up feeling somewhat better.",
      "rating": 5.0,
      "verified": true,
      "author": "ismail kukhmazov",
      "helpful_votes": 0,
      "publication_date": 20140525
    },
    {
      "title": "Don't buy it, you will lose your money",
      "text": "It is a big crap. Impossible to download the software associated with it and it regularly stops to work. Very not convenient if you want to use the alarm clock. Don't buy that product. It is big decoy. You are losing your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Charly",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Stopped working",
      "text": "This worked well for several months but now the sleep data - my primary interest - have gone haywire. Perhaps this is the reason it's no longer being manufactured/supported?",
      "rating": 1.0,
      "verified": true,
      "author": "Sophia Nilsson",
      "helpful_votes": 3,
      "publication_date": 20140709
    },
    {
      "title": "No battery-backup = dealbreaker",
      "text": "I had to return this clock since it does not respond well to a power-outage. If power goes out there is no battery back-up, and the phone's software does not know how to set-off the alarm properly during a power-outage condition. After all, the phone at least has power, so they could have designed some fall-back based on the phone's power. I'll consider repurchasing if they update the software to respond well to a power-outage condition, or provide a model with a simple battery-backup that will at least set-off the alarm like a standard digital alarm clock in case the main power is out.",
      "rating": 3.0,
      "verified": true,
      "author": "customer9999",
      "helpful_votes": 3,
      "publication_date": 20130527
    },
    {
      "title": "Have enjoyed the clock",
      "text": "Have enjoyed the clock. Not sure it is accurate. It told me i did not sleep well last night and I was yawning a lot. The power of suggestion? Maybe but seems to be kind of accurate.",
      "rating": 4.0,
      "verified": true,
      "author": "Evelyn",
      "helpful_votes": 0,
      "publication_date": 20140920
    },
    {
      "title": "Works as advertised",
      "text": "Works well. Sound is decent. Instructions indicate that it should be placed on a surface about 6 inches above the top of mattress. Mine seems to work fine sitting on a night stand a little below the mattress top. Needed to purchase a gen 4 IPOD since the APP needs IOS 5 or later, and my gen 2 cannot be updated to IOS 5.",
      "rating": 4.0,
      "verified": true,
      "author": "J Ick",
      "helpful_votes": 0,
      "publication_date": 20121123
    },
    {
      "title": "I recommend this product for old ipods.",
      "text": "It was a very nice docking system but did not support my Ipod 5 even with supporting Ipod 5 device.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori Ross",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Awesome sleep clock",
      "text": "This clock helps me monitor my sleep so I can adjust my sleeping patterns. It is also an awesome clock with lots of neat features.",
      "rating": 5.0,
      "verified": true,
      "author": "Fburg Gma",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Excelent product, good quality",
      "text": "Good quality, better price. easy to use, good information provided and accurate. There are not similar products on market. you can share with Family",
      "rating": 4.0,
      "verified": true,
      "author": "GM",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "but is a good price.",
      "text": "Although the interface has been out of date (30 pin), but is a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "LiangWenJi",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Bad customer service and application",
      "text": "After I updated my iPhone the device stopped working, I tried to contact the company but no answers, the application is not exist anymore, now I use it as charger only.",
      "rating": 1.0,
      "verified": true,
      "author": "Thinker",
      "helpful_votes": 0,
      "publication_date": 20151009
    },
    {
      "title": "Buyer Beware....App no longer available.",
      "text": "This is like a great item, but is completely worthless without the App to work it. The app is no longer available in the App store and I was not able to get a response from the manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn Lambert",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "Two Stars",
      "text": "App no longer in Apple Store will not work without app",
      "rating": 2.0,
      "verified": true,
      "author": "C. Randolph",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Three Stars",
      "text": "It doesn't play music from my phone... not sure if anyone knows how to do that?",
      "rating": 3.0,
      "verified": true,
      "author": "COURTNEY GREGORY",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Excellent product, not to loud but is a alarm ...",
      "text": "Excellent product,not to loud but is a alarm not a stereo,fast shipping",
      "rating": 5.0,
      "verified": true,
      "author": "MALIVA27",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "I love this when I saw it",
      "text": "I love this when I saw it. Unfortunenately I couln't find power adapter for 220 volt. How can I get this? Except that this is perfect!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyung-Lan,Ahn",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "Terrible product, no customer service seemingly available",
      "text": "Worked fine for a day or so (though I think the sleep findings were a bit sketchy), then app said there was firmware update, but then nothing happens except for the app to freeze, which then must be deleted. Glad I only paid $45 for clock at Amazon, not bad for a typical iPhone/iPod radio unit, but garbage as far as a sleep monitor.",
      "rating": 1.0,
      "verified": true,
      "author": "Scot I.",
      "helpful_votes": 0,
      "publication_date": 20131124
    },
    {
      "title": "Very Good",
      "text": "It is very good as an iphone dock and speaker. The sleep monitor function has not be tested.",
      "rating": 5.0,
      "verified": true,
      "author": "wangpq2553",
      "helpful_votes": 2,
      "publication_date": 20140916
    },
    {
      "title": "Great seller",
      "text": "This clock is a great tool for those who think they havent gotten a good nights sleep. I have used it every night since I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "William Peter",
      "helpful_votes": 0,
      "publication_date": 20130811
    },
    {
      "title": "App has been removed from iTunes store",
      "text": "The app has been deleted from the app store. Without the app, the Sleep monitor is of little use. Only thing you can do is play music May 15 2014 The app is back in iTunes store again",
      "rating": 2.0,
      "verified": true,
      "author": "Narayan Hegde",
      "helpful_votes": 0,
      "publication_date": 20140507
    },
    {
      "title": "Gear4 Renew Sleep Clock",
      "text": "Every time there is a power outage the radio loses it's presets. Also, I only use my iPod whenever need to use an alarm and when I don't have the iPod installed it is hard to read the display during daylight hours. Also, my iPod keeps asking me to enter how I slept the night before even though I had not used it.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20130124
    },
    {
      "title": "Very good",
      "text": "The excellent goods is too amazing and cheaper to be beyond belief.",
      "rating": 5.0,
      "verified": true,
      "author": "xiaoyongzhou",
      "helpful_votes": 0,
      "publication_date": 20140826
    },
    {
      "title": "Not so hot...",
      "text": "I bought this to track my sleep cycle and it works good when it works... But only when it works. I returned mine today after three weeks, but in the three weeks, it locked up and didn't work (wake me up) four times. Critical to work when its an alarm clock, eh? Other than that, I loved it. It didn't pickup the person on the other side of the bed and was easy to look at. Maybe some tweaks in the app will fix it, but not for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20130221
    },
    {
      "title": "Perfect. You can use the app to monitor your ...",
      "text": "Perfect. You can use the app to monitor your sleep. Sound is very nice. I love it for the price and the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "ERIC",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Three Stars",
      "text": "Having trouble getting to work and the et up is very difficult",
      "rating": 3.0,
      "verified": true,
      "author": "Connie H.",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "Is the account of the website member closed? I ...",
      "text": "Is the account of the website member closed? I cann`t sign for the member? the speaker is clear and loud.",
      "rating": 4.0,
      "verified": true,
      "author": "park",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Very nice product",
      "text": "Amazing technology, Good alarm clock. It plays FM radio but doesn't have a sleep timer to turn off the radio but not a deal breaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Richard",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "... that it says it would do it does I love it",
      "text": "Is everything that it says it would do it does I love it",
      "rating": 4.0,
      "verified": true,
      "author": "CHRIS MIRANDA",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "One Star",
      "text": "Company stopped supporting the app and pulled it from the app store - DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Warranted",
      "helpful_votes": 2,
      "publication_date": 20141004
    },
    {
      "title": "blah",
      "text": "I now know why this was discontinued it only works well for about a week then it is just a charging dock",
      "rating": 2.0,
      "verified": true,
      "author": "Werking reviews",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "Two Stars",
      "text": "Not compatible with iPad touch 1st gen. This was not specified.",
      "rating": 2.0,
      "verified": true,
      "author": "Gventro",
      "helpful_votes": 0,
      "publication_date": 20150810
    }
  ],
  "product_meta": {
    "title": "Gear4 Renew SleepClock Sleep Monitor for iPhone (Does Not Work With iPhone 5) iPod Touch and iPad (Discontinued by Manufacturer)",
    "description": "GEAR4 is proud to present the Renew SleepClock, a non-contact sleep monitor for your bedside. Track and record how long it takes for you to fall asleep and compare information over time to improve your sleep experience. The Renew SleepClock is simple to use, simply download the free app (available on the Apple app store), select your wake up time and start monitoring. Listen to your favorite FM radio station, or select your favorite tunes or podcast on your iPod as you settle down for the night. Renew SleepClock is the perfect wake up call, choosing the ideal moment in your sleep cycle to wake you from your slumber.\n\nAMAZON.COM\n\n\nGEAR4 presents the Renew SleepClock, the sleep monitor with no wristbands or headbands to wear. Measure your sleep. See how much sleep you get. Track how long it takes for you to fall asleep. Compare information with previous nights to track and improve your sleep. Enjoy a better night's sleep. Select your wake up time and start monitoring. Listen to FM or iPod as you settle down. Renew SleepClock will wake you at the ideal moment in your sleep cycle.\n\nRENEW SLEEPCLOCK\n * \n * Wake up at the ideal moment in your sleep cycle\n * \n * \n * Track your sleep patterns over time via the free Renew app\n * \n * \n * Non-contact monitoring\n * \n * \n * Bedside speaker with FM radio\n * \n * \n * Charges iPod, iPhone, iPad\n * \n\nWakes you up at the lightest moment in your sleep cycle \nUse the app to monitor your sleep patterns each night NON-CONTACT SLEEP MONITOR AND BEDSIDE SPEAKER FOR IPOD TOUCH, IPHONE AND IPAD\nThe Renew knows when you are asleep, and can measure your sleep pattern and wakes you up at the lightest moment in your sleep cycle, so you feel more refreshed and alert.\n\nRenew SleepClock uses a non-contact sensor to measure your breathing rates and movements--no wristband, no headband. It's accurate, comfortable and reliable. Simply dock your iOS device and download the free app (available in the Apple App Store) and begin sleep monitoring. Use the app to monitor your sleep patterns each night and see how efficiently you are sleeping. You can review data daily, weekly and monthly and also compare against other people.\n\nCHARGES YOUR IPHONE/IPAD\nThe Renew SleepClock can charge your docked iPad or iPhone as it plays, making it suitable as a charging station when you need quick power, or as a place to leave your favorite Apple devices overnight so you can wake up to a full battery.\n\nFM RADIO\nScan to find all FM stations in your area by the press of a single button. Up to five of your FM stations can be stored in the Reveal. Instead of constantly tuning up and down, just press the button for the station you want to listen to.\n\nCOMPATIBILITY\nThe GEAR4 Renew SleepClock is compatible with iPod touch (3rd and 4th generation only), iPhone 3GS, iPhone 4/4S, iPad, and the iPad 2.\n\nWHAT'S IN THE BOX?\nGEAR4 Renew SleepClock, power supply, user manual.",
    "rating": 3.1,
    "feature_bullets": [
      "Measure your sleep with no wristbands or headbands to wear.",
      "Select your wake up time and start monitoring.",
      "Listen to FM or iPod as you settle down.",
      "Enjoy a better night's sleep and compare information withprevious nights to track and improve your sleep.",
      "Track how long it takes for you to fall asleep.",
      "Right-time wake up: Knows when you're asleep and when best to wake you up during a light sleep phase.",
      "Non contact monitoring: Measures your breathing rate and movement without the need for any extra equipment (headbands, wrist watches etc.).",
      "Sleep sensor: Measures how long you spend in deep, light or awake sleep phases.",
      "Auto sleep detection: Listen to your favorite music as you drift to sleep. Once you're asleep audio automatically fades.",
      "App interface: Calculate your sleep efficiency, keep record of your sleep progress each night and compare with others Wake up at the ideal moment in your sleep cycle.",
      "Track your sleep patterns over time via the free Renew app.",
      "Non-contact monitoring.",
      "Bedside speaker with FM radio."
    ],
    "specifications": {
      "Product Dimensions": "6 x 7.6 x 5.4 inches",
      "Item Weight": "1.68 pounds",
      "Manufacturer": "Gear4, Inc.",
      "ASIN": "B0069J29P0",
      "Item model number": "PG537",
      "Customer Reviews": "3.1 out of 5 stars75 ratings3.1 out of 5 stars",
      "Is Discontinued By Manufacturer": "Yes",
      "Date First Available": "March 23, 2012"
    },
    "categories": [
      "Electronics"
    ],
    "price": 48.61
  }
}