{
  "website_summaries": [
    {
      "verdict": "A powerful, top-of-the-line auger that offers a quick and efficient drilling experience.",
      "pros": [
        "This lightweight tool is highly accurate and can get the job done faster than manual augers",
        "Features a powerful two-cycle engine with speeds up to 316 revolutions per minute",
        "Perfect for digging fence post holes, and ideal for tough soil areas"
      ],
      "cons": [
        "Some users report the pull string housing is fragile and prone to breaking"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Auger broke after 2 wholes",
      "text": "After 2 holes the auger would not spin. I called the company to return their product and they said they would not take it back. They said that I could fix it myself or take it NC to be fixed. I live in Norfolk Virginia. Other than that they would not do anything for me. I took it apart and found that the pin pointed to in the picture had fallen out. I put the pin back in the slot and put the auger back together three times before I got the Auger to work. I don't know how long it will work before the pin falls out again. DON'T BUY THIS AUGER!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 18,
      "publication_date": 20190212
    },
    {
      "title": "Very disappointed and frustrated",
      "text": "Terrible product. Of course customer Service is not open on the weeekend for us to contact. We bought this, assembled it today and did just as instructed. Worked pretty good for the most part for first 1 1/2 holes, then Would NOT start again. Let it sit for a good 30 min or so and tried again... got it to start but it would NOT stay running, did this multiple times. The one weekend we finally got a chance to do our fence project and the brand new auger craps out. Not happy is an understatement at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Shellie Fink",
      "helpful_votes": 16,
      "publication_date": 20180826
    },
    {
      "title": "amazing",
      "text": "Just finished using this for about 45 post holes for a wood fence. It only took about 3 hours with this this that is with us taking breaks. If I didn't have this it would have taken days to complete love this thing",
      "rating": 5.0,
      "verified": true,
      "author": "steven everling",
      "helpful_votes": 54,
      "publication_date": 20150311
    },
    {
      "title": "Garbage",
      "text": "Works good. The only down fall is cold start. Can be difficult. I did figure out for easier cold starts crack the fuel cap to get the vacuum off the tank. It seems that after it has cooled down the tank kind of vapor locks. Update: Garbage. Not even 2 months old and it will not run unless full choke and full throttle. At that not even enough power to turn the auger. This is with premixed ethanol free fuel.",
      "rating": 1.0,
      "verified": true,
      "author": "My stuff. ",
      "helpful_votes": 4,
      "publication_date": 20180424
    },
    {
      "title": "Perfect! Simply Perfect! A+++",
      "text": "The unit comes well boxed for shipping. Arrived undamaged. Assembly was easy. Even came with the wrenches. A+ Starting the unit was easy too. Much easier then my gas powered weed Wacker. Once running it purrs like a kitten. Once get use to using it, you will love it. I found you let the unit dig by itself d I wn and pull it up once in a while and git it a little gas and spin off the dirt. Then let it back in the hole and dig some more. To start the unit just push the primer bulb a few times and pull. Started right up.",
      "rating": 5.0,
      "verified": true,
      "author": "Honest Reviewer",
      "helpful_votes": 8,
      "publication_date": 20160613
    },
    {
      "title": "A nice powerful auger",
      "text": "I do not need to build fences but I still got tired of digging holes in our rocky soil for saplings and other projects. I use this auger by myself. This auger is easy to assembly and mine starts easily. I do agree with a previous reviewer that the oil mix in not very good so I used a quality one. I learned very quickly that I need to be braced against hitting rocks which quickly stops the auger and twists the top toward me.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Schlueter",
      "helpful_votes": 6,
      "publication_date": 20161110
    },
    {
      "title": "Finally got around to using this auger. It's junk ...",
      "text": "Finally got around to using this auger. It's junk. Bogs down in the slightest amount of clay. Stops on small rocks of just 3 inches in diameter and small roots. I ended up digging my holes by hand with a post hole digger.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul L.",
      "helpful_votes": 7,
      "publication_date": 20180209
    },
    {
      "title": "Highly Recommend",
      "text": "I very rarely right product reviews, but I bought this to complete a fence project I started before the winter. Previously I had rented a two person and a single person auger from one of the big box stores. Both times the bits would get stuck in the thick clay. I was skeptical that I could purchase something that cost me less my two previous rentals and would have any success, but I’m glad to say I was wrong. This thing plowed through the dirt like it was butter. I was able to dig 8 holes in a couple of hours no problem. I would highly recommend this for anyone building a fence.",
      "rating": 5.0,
      "verified": true,
      "author": "Cole_family6",
      "helpful_votes": 5,
      "publication_date": 20170410
    },
    {
      "title": "Don’t buy",
      "text": "Had nothing but issues. Customer service was useless. Telling you I spent more time trying to start than actually using is an understatement. I wish I could do a negative rating",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 7,
      "publication_date": 20171127
    },
    {
      "title": "Has Saved Me Hours of Work",
      "text": "If there are no tree roots or rocks it will dig a 2 to 3 foot hole in about 5 minutes (hard soil is not a problem). Tree roots and rocks slow it down as you will need to stop and remove those, but I've never taken more than 45 minutes to dig a 3 foot hole even in the worst conditions. I have had to move over 6 inches to a few feet to avoid large rocks. Before getting this I was taking minimum of 4 hours to dig a 3 foot hole with post hole diggers and shovels. Before writing this review I never knew I could include a video, I will do this one day soon.",
      "rating": 5.0,
      "verified": true,
      "author": "MLM",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Hole Digger",
      "text": "Bought this to dig post holes on our farm and needed something I as a smaller women could use by myself. I was tired of using the manual hole diggers that took me hours to dig a hole. This is very easy to put together, starts right away. I would suggest having soil a little moist with few rocks this will help from jarring the digger in your arms. It is a little heavy one you start it in the hole and it does help to have someone else hold the other side; but with a little agility it can be done with one person. Two people or a strong man is better. It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Oldster",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "As described",
      "text": "As described, no issues. Used several times, works as expected. They \"ALL\" have issues with roots and rocks even my pto driven tractor auger, don't let the reviews detter you. It's a good machine for the money. If you expect to plunge a hole in the earth with ease, hire somebody, otherwise it's work, No matter what tool you use nor how you do it. I'm happy with this machine, it absolutely beats using post hole diggers, for me anyway. East Tn, roots, rocks, clay, sand, shale, ever hole you dig is something different, luck of the draw, some better than others! 30 yr electrician, lifetime farmboy.",
      "rating": 5.0,
      "verified": true,
      "author": "BTJames",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Awesone",
      "text": "This thing is awesome! Used it today n does fence posts in a quarter of a time vs by hand! Wirth tge money concidering it's 100 a day to rent or 250 with tax to just buy!",
      "rating": 5.0,
      "verified": true,
      "author": "shawna altaffer",
      "helpful_votes": 10,
      "publication_date": 20160723
    },
    {
      "title": "Very impressed",
      "text": "I though I'd regret not getting one of the 50+cc models, but I don't. This little auger is geared low and it packs a punch, even with the 8\" auger. I like that it takes 50:1 gas and not 25:1 like some others. I have used it to dig holes in super dry, compacted, high desert loam/sand/juniper roots/ and it had no problem. As compared to the one I was considering from Harbor Freight this feels like a higher quality tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Great buy!",
      "text": "Great power and performance for a small engine. Made easy work of digging in dense clay/gumbo soil, even when saturated with groundwater. Good design to the handles enable either one- or two-person operation. Included auger bit is good for all purpose post hole digging. Other available bits and extensions provide excellent versatility. I was worried that buying the lowest priced machine would result in regrets by not having enough power to do the job, but I was delighted that this was not the case. Great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 5,
      "publication_date": 20160920
    },
    {
      "title": "This is a great product. Comes with the proper size bit to ...",
      "text": "This is a great product. Comes with the proper size bit to dig post holes. Comes with oil to premix with your first gallon of gas. Started up first try right out of the box. Is very easy with 2 people. A large person can use it by themselves on soft ground. Went through small (<1/2\") roots and small rocks (<1\") with easy. Got hung up on a few larger rocks that we had to dig out with the post hole digger. Dug 10x 28\" holes in less than 30 minutes. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "EVdeluxe",
      "helpful_votes": 4,
      "publication_date": 20160907
    },
    {
      "title": "Great bang for your buck",
      "text": "If you’ve got mostly topsoil this will work like a dream. Make sure you work within this tool’s capability. If you hit a rock, you’re going to have to dig it out before you continue. You’re back will be hurting after a few holes if you’re doing it by yourself just because of constantly pulling it out of the hole to get rid of the dirt. But you can have two guys use this and it will make it easier. Great work for the price tag.",
      "rating": 4.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Powerful Engine - Does the Job.",
      "text": "I dug 16 deck foundation holes (24\" deep) with no problems at all when I got the hang of how to do it. If the auger hangs up in hard red clay (like here in Alabama), simply left it up a couple of inches then back down. It will keep on digging. This is the first power auger I've owned but believe it to be an outstanding purchase. I am 78 years old and able to handle it very well.",
      "rating": 5.0,
      "verified": true,
      "author": "mjs1691",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "The engine was good when I first started using it",
      "text": "Works okay with dry soil with no rocks. If the soil is hard clay, filled with rocks any larger than pea gravel, you'll find yourself using this auger to clean up holes you had to pre-dig with a digging bar. The engine was good when I first started using it, but it became harder to start and more likely to stall with every hole I dug. I used this auger to dig a total of 61 holes to a depth of 34\" for pasture fencing.",
      "rating": 2.0,
      "verified": true,
      "author": "EngineerOpinion",
      "helpful_votes": 2,
      "publication_date": 20180122
    },
    {
      "title": "Make digging shallow post holes quick if two people operate it.",
      "text": "I purchased this post hole auger in order to drill a deep hole for an 8 inch Sonotube. I was able to handle the auger for the first few lifts but fatigued rapidly after lifting the soil out of the hole. Although this auger is easy for one person to operate, two persons will make the lifting part much easier. Otherwise, this is a very well made auger that is easy to start and operate. We also purchased an extension shaft from a different source to enable hole augering of up to 48 inches. It fits this auger perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 2,
      "publication_date": 20170510
    },
    {
      "title": "Great little auger for digging fence post holes",
      "text": "For about the same price as a 2 day auger rental at home depot I was able to purchase this. I was able to dig 9 post holes 3-5 feet deep (with an auger bit extension). It struggles a bit in hard clay but eventually gets the job done. Adding water to the hole makes digging the hole easier, on one hole I had thick, tough clay that required soaking overnight for the auger to get through at a reasonable speed. Overall I'm pleased with this. I'm sure there are more powerful augers out there but this one got the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Very good, powerful auger for the price",
      "text": "This unit goes together quickly and starts up easily. The clutch that gets the auger spinning works well, allowing you to position the unit before spinning up the screw. It has as much power as most people could use in a one person device. Note that decent sized rocks and roots will stop this thing in its tracks and when it does the torque can be significant, banging the handle into your leg. It would be nice if it had a reverse function to help extract it from roots and such. In short, very nice but expect to break out hand tools if you are digging in soil with rocks and roots.",
      "rating": 4.0,
      "verified": true,
      "author": "NotSure",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Great value",
      "text": "Read other reviews which gave me confidence to purchase this product. I have installed 50 poles with it for a fence and it works great. Loose soil is dug with ease. Harder soils take a bit of pushing. Will take out small roots, but not larger ones. Not sure any hand tool could handle larger roots. As others described, it is a bit cold natures, but it has started every time after a few pulls. I just give it 15 seconds to warm up.",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "A must have!",
      "text": "This little machine is the best thing ever! This just dug twenty fence post holes through, shall we say, less than ideal soil conditions. My husband will be sore tomorrow because it does jerk him around (he's 6'2) but he would be the first to tell you that it beats a pair of post hole diggers! If you're looking for a tough little machine that won't break the bank, this is the little guy for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Shelley F.",
      "helpful_votes": 4,
      "publication_date": 20161113
    },
    {
      "title": "Hard to restart when engines warm",
      "text": "Used for fence post digging The depth is a little short but knew that when I bought it because I wanted to adjust each post depth by hand for a straight line. It has a problem getting through small rocks and mostly because of limited power for a one man unit. It saved me labor but not as good as I had hoped for. Appears to vapor lock after it’s hot and doesn’t want to start as easy as when cold. Consider an extension for the auger for depth of hole.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary ",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Time Saver",
      "text": "I'm building a fence, and I cannot imagine digging the 50+ post holes without this machine. Makes a nice clean hole, easily gets 20 in. (or more) deep, and saved me a lot of time and energy. You can rent this kind of stuff, but if you have a big fence (or if you will take more than 1 session to finish your fence) I would advise just getting one yourself. Every time I use it, I think about how good of an \"investment\" it was. Really easy to use, great value for the cost. Can't speak on durability yet, because mine isn't even a year old. However, it still is in great shape after 40+ post holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Harris",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Makes the difficult easy",
      "text": "Bought this for my friend who is planting a 200\" long rosa rugosa hedge for me. When he opened the package, he said it was too small and wouldn't work. By the end of the day, he was raving about what a great machine this is.",
      "rating": 5.0,
      "verified": true,
      "author": "SVC",
      "helpful_votes": 3,
      "publication_date": 20180515
    },
    {
      "title": "Not very powerful.",
      "text": "For the price I was not really expecting an awesome product but many reviews said it was great. The digger works well until you hit hard dirt or a root is in the way then it stops and cannot power through. I have found that even small roots the size of a pencil would stop the auger from digging. I had to cut the roots with an axe to allow the digger to keep going. After that it did fine, it was real slow digging but beats a pair if manual ones.",
      "rating": 3.0,
      "verified": true,
      "author": "Kenneth E. Stump II",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Pull cord broke free...Not Usable",
      "text": "While this little auger does a decent job. It has items on it that are poor quality. I have rebuilt the pull cord that has broken off twice now. First time the knot pulled through their hole. Second time it broke plastic. Now I am unable to rebuild. Imagine a piece of equipment that you own that you cant start because of a CHEAP PULL STRING.",
      "rating": 1.0,
      "verified": true,
      "author": "Shortchefguy",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Worked like a charm...when it wanted to...",
      "text": "I am pleased with the auger, which with tough Texas clay, helped the process of getting trees into the ground much easier. However, as previous reviews stated, if the auger gets hot, it will not restart automatically and will need time to cool down. We just used that as break time. :) This says single person, but recommend having 2 people so that there is better control when digging the dirt. For the money, this has been a life-saver.",
      "rating": 4.0,
      "verified": true,
      "author": "mouth8282",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "SO PLEASED! THE ONLY THING I REGRET IS THAT I ...",
      "text": "SO PLEASED! THE ONLY THING I REGRET IS THAT I HAVE BEEN DIGGING IN ALABASTER, ALABAMA ROCK FOR 30 YEARS WHEN I COULD HAVE BEEN USING THIS TOOL. WE PLANTED 35 ROSE BUSHES IN TWO DAYS. IT WOULD HAVE TAKEN TWO WEEKS WITH A PICK AND SHOVEL (SOMETIMES A CHISEL AND HAMMER)! I DO NOT RECOMMEND THIS AS A \"ONE MAN\" TOOL, HOWEVER. MY HUSBAND IS STRONG BUT IT WORKED MUCH SMOOTHER WITH ME ANCHORING ONE SIDE AND HIM HOLDING THE OTHER AND CONTROLLING THE THROTTLE. WHEN IT HITS A TREE ROOT, IT TENDS TO BACKLASH WHICH IS NO PROBLEM WITH TWO PEOPLE.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary A. Parks Antonio",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "this is a great auger. It takes some work to get through ...",
      "text": "For $150, this is a great auger. It takes some work to get through the rocky clay along the colorado front range, and the clutch doesn't kick in until the auger head hits your leg, but it work fairly well. Of course, a two-person auger with more HP is better, but I can drill a 3 foot post-hole in about 30 minutes with this for the boring and a post hole digger shovel for removing the dirt in the hole. It is much quicker and a thousand times easier than doing it manually.",
      "rating": 5.0,
      "verified": true,
      "author": "Quality Tested Reviews",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "It works, but...",
      "text": "Better not get close to a small root or anything that you could easily snap with your hands. To break through small roots, once the auger binds, you have to jerk it up and down until the root breaks and then it will continue digging. It made a horrible job of digging post holes into a real breeze. Probably about 2 to 3 minutes per hole at a little more than 24 inches of depth.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Cooper",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Jury's still out!",
      "text": "Works okay if/when you get it started, but only in clear dirt. Any roots (even small ones) or any light gravel and it bogs down to a stop. Here's the biggest issue: Its a pain in REAR to start!!!!!!! Choke switch in in line with pull start so its constanly getting hit. You prime and crank and crank and crank and crank (you get the picture). Yesterday I gave up and just used the post hole diggers. It was less effort than trying to start it!",
      "rating": 2.0,
      "verified": true,
      "author": "William Parker",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Impressive power.",
      "text": "Now this is a homeowner hold digger. My soil is clay. Learned to brace myself, and add water to the hole. As a friend I let try it said, \"this a mans tool!!\" Tough, rugged, powerful, easy to start and run. Heavy duty drive and digger blade, not a toy. Advice, bulk up!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave White",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Performed as expected",
      "text": "I have only put this together and dug a few test holes. It worked very well. Cut though small roots. We have very granular soil and zero rocks so I expected it to perform. The information does not say how deep it will go, it is about 3 feet max. For me it isn't a big deal, but it is not an 8 inch auger as stated, it is just under 7 1/2 inches. I put quality fuel in it, used the intended starting procedure, and it started right up and ran smooth. I do recommend for home use.",
      "rating": 5.0,
      "verified": true,
      "author": "W. A. Worden",
      "helpful_votes": 2,
      "publication_date": 20170428
    },
    {
      "title": "Great Buy",
      "text": "Dug 28 post holes for fence with auger and except for about 8 of them used as 1 man operation. The 8 I had help controlling in tough soil or rocks. I did this over a period of 4 days due to the heat. Started fast every time and little gas. I was unsure if it would due the job when ordering it but now I'm happy I made the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip  Yaciuk",
      "helpful_votes": 5,
      "publication_date": 20160712
    },
    {
      "title": "I love it. Just the company give wrong information about ...",
      "text": "The machine very powerful . I love it . Just the company give wrong information about the gas.first time I m use for 3 day in road was work good i was busy with work I don't start went to repair was problem with carburetor can't use regular gas mix with oil but special gas ready mix with oil you find in home depot I start to day the first strock start . Don't the company why don't telling in book .if anyone got problem use this type gas truffle 50;1 I be recommend from the repair man because the machine made in China in cheap way",
      "rating": 5.0,
      "verified": true,
      "author": "guyhandyman",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Building a fence?...you need this product!!!",
      "text": "A great product at a great price...I would highly recommend this product and this supplier, Southland. Keep up the good work...This product makes short work of digging post holes...my only caution to you is be careful the muffler gets very hot...",
      "rating": 5.0,
      "verified": true,
      "author": "G.E.R.",
      "helpful_votes": 5,
      "publication_date": 20170331
    },
    {
      "title": "Don't waste your money!",
      "text": "The On/Off switch came off before I could even use the auger once. Call the manufacturer and after supplying them the model number, serial number and receipt, they sent out a new switch. Not sure though how they expect me to fit a square switch into a round hole. Never trust any product that says it can't be returned. Wish I would have seen that before I ordered it.",
      "rating": 1.0,
      "verified": true,
      "author": "The Circlekiller",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Good purchase...",
      "text": "I figure if I use it twice I’ll come out ahead vs renting one. I used this to clear out a clogged culvert for my ditch. I welded together a 15ft extension pipe and went to town. It has plenty of torque to accomplish that. In fact, it ended up tearing out the bolt holes on my welded piece of pipe. I was concerned it might not run being held in the horizontal position for an extended period, but worked like a champ.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Cheap item and doesn’t run",
      "text": "Do not buy this cheap Auger. My particular Southland Auger never cranked. Sounds like a piece of junk when you pull the cord. Followed the directions perfectly every time and pulled the handle 500 times. Never cranked. I work with a lot of equipment and everything cranks and runs BUT THIS Auger. I had to rent equipment to do the job. Customer support is useless. Put on hold forever and could not return it? Very disappointed in Amazon and Southland product support.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Very hard to start.. stay away from this item",
      "text": "The gearbox was not put together properly had to take it apart, I put it together properly. Too much of a hassle to return so i just fixed it myself. The motor is very hard to start. If you put gas in it you cannot return it but if you don't put gas in it you can't test it. Stay away from this item go to Harbor Freight or Menards same price better quality.",
      "rating": 1.0,
      "verified": true,
      "author": "ThekingamI",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Gets the job done.",
      "text": "Runs great. Easy to start. It did struggle a bit with the heavy clay soil we have. And tree roots will try to tear your arms off. But still way better than digging by hand.",
      "rating": 4.0,
      "verified": true,
      "author": "p38nut",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Mostly useless",
      "text": "Great - if you’re digging in sand or soft powdery snow or goose down. Otherwise forget it. Barely made it through the dirt, and then no progress in the clay. I get that clay is denser, but who doesn’t have clay of some type under the dirt?",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Fletcher",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Terrible Auger",
      "text": "Worst product I have ever purchased. It is useless because it doesn't start. I got it to start once after about 100 pulls. I dug the hole I needed and shutt down before the next hole. Would not start for the second hole. I have exerted more energy trying to start this POS then it would have taken to use a shovel and dig the hole. Do not waste your hard earned money on the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "jon",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Slight damage on arrival, but drills a home in the ground",
      "text": "When the unit arrived the fuel line coming out of a fuel tank into the carburetor was leaking. Rather than Box it up and send it back I fixed it myself and has been working just fine. It is quite difficult for one person to drill through rocky or heavy clay soil, But it can be done because I have done 25 of these holes so far",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "I like the auger",
      "text": "I like the auger. It was easy to get started, set up and crank. It is good for single man; I find it will used mainly for light work and not heavy duty: good for moist ground; I don't think it be good for hard ground. It is a bit heavy and the power is not exactly what I expected but for the money it is a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Theron Hardin",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "This digs through red clay quite well",
      "text": "I'm surprised how well this works. It started very easily and dug through NC red clay quickly. It shaved 6 hours off my project easily. It got stuck many times but backing it out a bit and going back down worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "I enjoy things",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Low expectations, even lower product delivery",
      "text": "For the price I wasn't expecting much, and I wasn't wrong. The good...it was packaged well, assembled easily, started right up, and ran well....a little too well, which brings me to the bad. The off switch didn't work. Yeah, no way to turn it off once it was running. Had to pull the plug wire off to shut it down. Needless to say this was slightly inconvenient not to mention a safety hazard. It didn't dig very well either. Any rocks or roots would stop the auger in its tracks, I ended up having to dig all my holes by hand. Save yourself the headache and rent a real auger.",
      "rating": 2.0,
      "verified": true,
      "author": "MdMarcus",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "hard to start",
      "text": "This item is very hard to start on a cold start. After using 3 times, the on/off switch quit working and I had to pull the plug off the spark plug to get it to stop. I used this for a total of 1.5 hours, and this happens. I plan on contacting the manufacturer/Southland about this.",
      "rating": 3.0,
      "verified": true,
      "author": "pic taking granny",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "My neighbor (who is 70) and a friend used it and thought is was great.",
      "text": "Performed as required. The only time we couldn't finish a post hole with it was due to large roots or chunks of brick. Fairly light weight. I was able to use it solo, but we had a lone fence line to dig and my wife (who is very feminine and only wears dresses) helped me and had no problem controlling it. My neighbor (who is 70) and a friend used it and thought is was great.",
      "rating": 5.0,
      "verified": true,
      "author": "louise",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "great little Auger.",
      "text": "used it to build a privacy fence. You can expect it to do all the work as the size is smaller then some of the bigger guys. but it dug well in hard clay like a champ. Just go slow and let it do the work or it will get exhausting.",
      "rating": 5.0,
      "verified": true,
      "author": "Kye T.",
      "helpful_votes": 4,
      "publication_date": 20170430
    },
    {
      "title": "Better than expected",
      "text": "I live in an area that has some very hard dirt and large rocks. I was able to use this to install over 25 poles. The only issue I had was I ran it for a while and it died from overheating. I placed it in the garage in front of a fan and cooled it down. Fired right up. I took it easy on it after that and never had another issue. Advice, watch your legs, it will catch on rocks.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Little engine they could",
      "text": "Put in over 50 fence posts over the past month. Couldn’t have rented a unit for a week for the cost of this little guy. Lost a star because the air filter is garbage. disintegrated in the first week. I have to wire brush the spark plug every so often, but it’s been ridden hard. I’m in western ky with that famous clay layer and abundant rocks. Definitely doesn’t punch thru them, but beats a post gold digger all day long.",
      "rating": 4.0,
      "verified": true,
      "author": "David Keltner",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Made building a fence much easier.",
      "text": "I had a home fencing project that required me to dig post holes for 100 4x4x8 posts. I did the first 10 or so by hand with post hole diggers. When I cam to my senses I ordered the Southland SEA438 One Man Earth Auger and made easy work digging the remaining post holes. I am thrilled with this Auger.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk Gardner",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Very happy with the steel auger strength/hardness and spring shock mechanism ...",
      "text": "Only used it to drill ~30 holes (30\" in clay) but I have pushed and slammed it hard into the ground at angles of up to 30 degrees. Very happy with the steel auger strength/hardness and spring shock mechanism to reduce impact (when you hit a rock your rests don't shatter:).",
      "rating": 5.0,
      "verified": true,
      "author": "US home buyer",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "Great purchase - used to put fence in only had ...",
      "text": "Great purchase - used to put fence in only had one issue due to huge roots from our giant maple. It worked very well and I would purchase again for sure if this one every dies. Saved me on Rental cost of 75 a day as I did the whole 180 feet of fence my self this made the 3.5 days of work go quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Nelson",
      "helpful_votes": 2,
      "publication_date": 20170529
    },
    {
      "title": "ROAD TEST IN PA",
      "text": "The Southland drilled 20 holes in Pennsylvania root-filled, rocky clay. This unit starts easily and runs strong. Torque is a maximum for one strong man to control. The machine needs diggIng bar assistance with large roots or rocks, then continues to claws it way down. Cutting blades are durable with only a light touch with a file needed after ten holes. This is an impressive one-man machine for the price! If more performance is required, step up to a two-man unit. I suggest full synthetic oil to maintain your investment.",
      "rating": 5.0,
      "verified": true,
      "author": "William Nelson",
      "helpful_votes": 10,
      "publication_date": 20161009
    },
    {
      "title": "Working great for me.",
      "text": "Auger is working great for me. Dug 53 holes all at a depth of 12\" for setting out blue berry plants. The auger burned about a half tank of fuel to do that. The other posting are correct about digging in rocky ground. The auger does not like rocks the size of your fist. You will have to manually extract those. Fine rock and gravel are no problem",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Mooneyham",
      "helpful_votes": 2,
      "publication_date": 20170316
    },
    {
      "title": "Awesome auger",
      "text": "This thing is really great. Saves a ton of time just used this for building a deck and saved a ton of time. If you don’t hit any rocks or anything hard on your way down this thing will blow a 6” hole about 3ft deep in 30 seconds aslong as you put some pressure on it. I suggest getting a post hole digger too though because if you hit a big rock like I did you are dead in the water. Use this to do the heavy lifting then use a post hole digger to move rocks and such out of the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Price makes it great",
      "text": "Product is great for the price. Mine lasted 2 years until the gearbox cracked and there's no replacement parts. I will be buying another. Plenty of power, just don't torque the shaft left and right as you can snap the gearbox case really easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan C. Tewksbury",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Good little auger",
      "text": "I was a little skeptical purchasing this auger. The engine fired right up and never quit while digging.The soil was less than perfect with rocks and tree roots everywhere. It doesn't cut through 1\" roots but a sawzall will. This machine isn't heavy duty but neither is the price. I would have rented a larger auger but we were building a new fence inside the old fence hence no help from the neighbor next door. A two man auger was out of the question. You get what you pay for and I feel I got my moneys worth.",
      "rating": 5.0,
      "verified": true,
      "author": "brodie",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "DOES NOT WORK",
      "text": "I spent 2 hours trying to start this auger. I followed all the instructions and it would not start. I attempted to call to get some trouble shooting advice from the company at the numbers provided by the company however all redirected to the same service number which is not open on the weekend. Mind you I have experience with small motors and gas powered equipment. There is no way to return it from what I can see. I gave one star ratings on this item only because it would not allow me to give less. DO NOT PUCHASE THIS ITEM.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Ok auger for soft ground! Not worth using for dense or clay light soil.",
      "text": "It works ok for soft ground. It was not a surprise as it only being 43cc. Even soft ground I doubt you will get it all the way into the ground. We were only able to get it halfway after lifting the auger many times. It will not go through clay like material. We basically used it to start the hole which makes a nice neat circle. Then we would hand dig after that.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris C",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Good tool /easy start",
      "text": "Not a high end auger but it gets the job done. I have had it for a couple of months and have used it several times. Impressed with how easily it starts right up, even after it has been sitting for awhile. Always starts after at the most 3 pulls, but usually just one.",
      "rating": 4.0,
      "verified": true,
      "author": "bookster100",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "This was a good deal. The auger has plenty of power and ...",
      "text": "This was a good deal. The auger has plenty of power and is working perfectly so far. If you're drilling a lot of holes, you might get a backache from lifting it out of the hole, especially when you're down deep and you have a bad back, but it beats the heck out of the alternative! If you need to go down more than about 2.5 feet, you better get an auger bit extension, but these are pricey...not too difficult to make, though.",
      "rating": 5.0,
      "verified": true,
      "author": "vnxlfsio",
      "helpful_votes": 2,
      "publication_date": 20160607
    },
    {
      "title": "Great machine",
      "text": "This auger does the job very well. It can be handled by one person with ease. I recommend you be able to lift 50lbs or more if you go all the way down. You're going to need muscle power and back power to lift the machine back up. Just food for thought.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Totally worth the purchase",
      "text": "Got this auger to put in a wooden fence on a 1/2 acre yard, it has made setting posts so much easier. The auger starts up pretty easily the only issue we have had is with large roots or packed gravel. We would definitely recommend this auger to anyone who will be digging multiple holes.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Works fine for potting soil",
      "text": "I needed to drill some posts. Thing can handle the dirt, but it just stalls when It hits a fist sized rock. I was very disappointed. Now I imagine that it will just sit in the garage. Amazon doesn't allow returns on this thing. I ended up renting a hydraulic auger from HD for half the price and I'll get to return the equipment when I'm done!",
      "rating": 2.0,
      "verified": true,
      "author": "Crash",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Once running, it's great. Hard to start in the cold.",
      "text": "Finicky to start in the cold (even when loosening the gas cap to vent, and running 92 octane pre-mix without ethanol). I suspect the Chinese spark plug may be iffy. Once it's up and running, it's a real time and back saver if you're going to dig lots of holes.. It's great for pulverizing soil and digging when planting trees in less-than-ideal soil, too. It's pretty loud at full throttle---you'll want a pair of muffs or earplugs for any real time on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Zimmy",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Prepare for an arm workout!",
      "text": "What to expect... You get what you pay for. Worked fine for like 6 holes. Then became a nightmare to crank up. So your best best is to have all your holes marked and when you do get it cranked, do all of them at once. It dug into the ground GREAT. Pretty decent at cutting small roots. Beware of any under ground wiring! It WILL cut through it. Would be a great product if it wasn't for the having to pull the string 30 times after following the start up steps",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy Bradley",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "It's easy to start and digging is a breeze",
      "text": "I was worried this wouldn't be much easier than digging post holes by hand. But I was very pleasantly surprised. It's easy to start and digging is a breeze. I love it! I finished my new goat pen. And now the chickens are getting an upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "E. L.",
      "helpful_votes": 3,
      "publication_date": 20170327
    },
    {
      "title": "Digs like crazy",
      "text": "One person okay in softer soils. The motor started easily and runs well. It is a wee bit on the heavy side. Auger kis well made and torque spring worked well when hitting stone. I think it is a good buy for the home owner user.",
      "rating": 4.0,
      "verified": true,
      "author": "Carl Shipley",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Absolute trash..",
      "text": "It sputters and stops whenever any necessary torque is required for it to work. It's garbage and I'm stuck with it as it's \"nonrefundable\".",
      "rating": 1.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "This thing works",
      "text": "I bought this and a 2\" bit to put in oilfield pipe fence, and it worked great for that, but waited to give my review until I could really put it to the test. This thing really works. We live on an 80 acre place and post holes come up often, as we are always repairing, or adding to. It has handled every hole with ease. One small drawback is that it will only drill to about 26-28 inches. It would be nice if it went a little deeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 4,
      "publication_date": 20160624
    },
    {
      "title": "Wont Start :0(",
      "text": "It was incredibly hard to start, and sometimes wouldn't start at all. However, when we could get it running it worked fine in Texas clay. We didn't expect to get the full fence post hole depth as we know how hard the clay is on machines but it came close so that didn't disappoint. Since the start was unreliable Amazon was gracious enough to accept our return and refund the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Digs in red clay!",
      "text": "Works well... I have dug 6 tree holes so far and it has no issues. Digs fast in red clay and gets the job done with 10in. auger. Rev. Tucker",
      "rating": 4.0,
      "verified": true,
      "author": "Rev.Tucker",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Stopped working after a month.",
      "text": "I've had this just over a month, stopped working 3 days after return window closed. Was ok when it worked, hard to handle, but usable. Doesn't do clay well.",
      "rating": 1.0,
      "verified": true,
      "author": "June Bug",
      "helpful_votes": 4,
      "publication_date": 20170721
    },
    {
      "title": "Perfect for Home Jobs",
      "text": "This auger is perfect for post hole digging along with digging holes to plant new trees and shrubs. Saves a lot of time vs. using a shovel!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Good value",
      "text": "So far I drilled a couple holes with it and it works good but if you have heavy vegetation it bogs it down but that being said it still works 1000 times better then using a have auger",
      "rating": 5.0,
      "verified": true,
      "author": "alex schinke",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Piece of junk from the minute it comes out of the box.",
      "text": ". Came out of box with a leaking ; broken gas tank. Started it with leaking tank only to find that shaft was broken internally. After contacting Amazon and waiting to hear back from seller; I decided to just return it only to discover that it is a non returnable item. How the heck can it be non refundable for an item that did not work in the first place. Don’t waste your time or money on this. Having to set 60 posts by hand is more enjoyable than the aggravation this equipment presents.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael J. Stein",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Works great and at a good price!",
      "text": "Works great and did an excellent job creating perfect 8\" holes that maxed out at about 32\" inches deep. Could probably retrofit another pipe extender on it to go even lower if needed. Machine turned on easily and ran smoothly. Saved me loads of time on about 12 post holes. Thought about renting one from a big box retailer but the cost of having it for two days or so practically pays for the cost to just buy this one. Sure I'll use it in the future on something.",
      "rating": 5.0,
      "verified": true,
      "author": "BruWIN",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Exceeded Expectations",
      "text": "Bought a hand post hole digger to put up a privacy fence around the pool filtration system/pump/electrical. Found this online and purchased. Returned the manual post hole digger... This machine is absolutely awesome...dug four 24 inch holes in less than 30 minutes...extremely easy to assemble and to operate. I used it solo for the post holes...brought a friend over to help dig 3 foot holes to reinforce deck for the hot tub..four holes in an hour... I could not be happier...",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Not so much",
      "text": "It is a well built machine and I am sure in the right circumstances it would perform well. I live in black gumbo clay country. When the ground is dry it has issues going much deeper that a few inches. If the ground is muddy you might as well open a beer and wait till the ground drys up. Probably would work well in sandy loam with no rocks or tree roots.",
      "rating": 2.0,
      "verified": true,
      "author": "Benny R. Perkins",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Does a good job except",
      "text": "Does a good job when roots are not in the way. I would suggest not buying it if you are dealing with a bunch of roots when setting your posts.. Thanks",
      "rating": 4.0,
      "verified": true,
      "author": "wes",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Really good value!",
      "text": "Probably the greatest purchase I have ever made on Amazon. I have dug just shy of 200 fence posts with this auger over a 1 month period. It has started up second pull every time (if you follow the instructions) and dig holes consistently. If you hit a stone or rock and it stops it does not rip your arms off either. It is able to pull pretty good size stones out of the ground as well. If it died right now it would still have been worth what I paid for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Chrs Mercon",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Worked great for privacy fence",
      "text": "My husband used this to dig 17 holes for a 6ft wood privacy fence with 4x4 posts. He needed something he could use by himself that did not require 2 people. Worked great! We do have very loamy soil, so not sure if it would be good in clay. Very impressed with this machine!",
      "rating": 5.0,
      "verified": true,
      "author": "KateS",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "PIECE OF ****",
      "text": "refused to work right from box; could not pull cord completely out to get piston moving; bought right before covid and when well enough to work again, amazon's guarantee expired; company little use",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Graebener",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "HORRIBLE!!!!!! DON'T BUY",
      "text": "This thing is the worse thing I have bought.. at first it was hard to start and keep running.. now it just won't start at all... and it has only been used to dig 6 holes that's it!!! can't return it to Amazon, it's been too long..",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Has quite a bit of kick back if you hit anything other than soft dirt",
      "text": "It will move and kick rocks up but it will not do anything to a root but get stuck. if you're only in dirt then it does its job. Otherwise have a shovel handy for roots.",
      "rating": 3.0,
      "verified": true,
      "author": "Boogzz",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Only twice the cost of a rental...",
      "text": "I bought because to rent you have to do all you holes during a brief--and expensive rental period. We have drilled fence post holes with the 8\" auger over time...And it has very good power in black earth. Would buy again. Don't know about durability-the started cord wants to not catch unless you hold it a certain way.",
      "rating": 5.0,
      "verified": true,
      "author": "kgraggio",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "THis thing is awesome!! Very happy!!",
      "text": "So I had a bunch of fence posts to do. My local rental place for the same thing was 100 a day for the auger and 50 for the bit rental. I have used this for over a month now. Made a hell of a lot of holes with it. I suggest another person to help if you have a bad back though. This thing can get heavy. By far an awesome value I would recommend it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "For my loamy soil this auger worked great. Drilled down 18 inches in about 15 minutes",
      "text": "For my loamy soil this auger worked great. Drilled down 18 inches in about 15 minutes. Self cleaning. Easy start. It is a handful if you have trouble lifting 40 lbs. Torque can be controlled by using leg to resist turning.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "Great value!",
      "text": "Thing is a work horse! Good value for the money. I've used it to install 1500 feet of fencing on my farm. I'd buy another if this one ever does!",
      "rating": 5.0,
      "verified": true,
      "author": "William P. Brigham",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Makes hard work easy.",
      "text": "Great purchase. Digs out perfectly straight post holes like nobody’s business. Passed 2 feet deep, you’ll need an old fashioned manual post hole digger to pull the extra dirt out of the hole. Made what could have been an all day job into a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. P",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Can’t recommend",
      "text": "While using on the first hole the spring shattered. I knew better than to call Amazon or Southland. I am waiting on a new spring from a third party. Cheap spring.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt Rodway",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great purchase for fence project!!",
      "text": "Purchased this auger for a backyard fence project. I read the mixed reviews but took a chance on it. Delivered in one day and easy assembly. I used premixed fuel from home improvement store. Auger was easy to start, only one or two pulls to start during the whole project! I dug 37 post holes with no issues. Yes, some roots and rocks may slow it down but once cleared does a great job! Saved a lot of time instead of digging by hand. Great value and time saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Very under powered! Save yourself a headache and buy something else.",
      "text": "I received this product a few days ago and today was the first chance I had to use it. It was easy to assemble, and started very easily. That’s where the pros end however. The auger is very under powered and completely worthless for its intended purpose. I was unable to drill more than 2” in to relatively soft soil before the auger would stop dead. Please save yourself a headache and look elsewhere. I was drawn in by the price, and know you get what you pay for, but this is ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "it works",
      "text": "i am using it for digging holes for plants and only a few each year for this it is OK but for heavier use needs bigger motor",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191217
    }
  ],
  "product_meta": {
    "title": "Southland SEA438 One Man Earth Auger with 43cc, 2 Cycle, Full Crankshaft Engine",
    "description": "The Southland SEA438 43 cc 8 in. Earth Auger Powerhead features a powerful 2-cycle engine with a bit speed up to 316 RPM for quick, efficient drilling. This auger provides 1.3-feet.-lb. of torque and sports a translucent fuel tank to let you easily keep an eye on fuel levels. Unlike similar competitive units, the Southland 43 cc 8 in. Earth Auger Powerhead also includes an 8-inch auger bit.\n\nThis is a Non Returnable item.",
    "rating": 4.2,
    "feature_bullets": [
      "Manual recoil easy start fuel delivery system",
      "Includes Gas Powerhead with 8” Auger Bit; 6-inch bit available and sold separately",
      "Direct gear with solid steel drive shaft",
      "Wide detachable butterfly handles for better balance and convenient storage",
      "Depending on soil conditions, the maximum depth using the 8 inch bit is 2.5 feet.",
      "Please refer to owner's manual for directions on proper use",
      "Fuel Tank Capacity (gallons): .32",
      "Note : Kindly refer the USER MANUAL which is available below for assistance"
    ],
    "specifications": {
      "Product Dimensions": "26 x 11 x 48 inches",
      "Item Weight": "40 pounds",
      "Manufacturer": "Southland Power Equipment",
      "ASIN": "B0063MSXYY",
      "Item model number": "SEA438",
      "Customer Reviews": "4.2 out of 5 stars776 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#99,670 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Augers & Posthole Diggers",
      "Agricultural & Construction Machinery",
      "Farm & Ranch"
    ],
    "price": ""
  }
}