{
  "website_summaries": [
    {
      "verdict": "The Dropcam system is one of the simplest and more affordable DIY Wi-Fi video security solutions we've seen to date.",
      "pros": [
        "Wi-Fi-enabled network Webcam",
        "easy setup",
        "view remote video feed over the Internet or on your iPhone (via free Dropcam app)",
        "no service fee for basic live viewing",
        "DVR functionality with paid plan",
        "recorded video stored online (in cloud)",
        "Dropcam Echo has audio capabilities"
      ],
      "cons": [
        "Webcam isn't HD",
        "no panning capabilities"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0
      },
      "publication_date": 20100927,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Retired model no longer supported by Dropcam or Nest",
      "text": "apparently Nest no longer supports this model I bought 8 months ago. I updated my router and now cannot readd the camera to the network because Nest no longer supports this model. it is still being sold on Amazon and should be pulled. Nest is going to make this right though, will updare my review once I hear back from Nest. Just save yourself a tech mess and buy the brand new model which is supported through the nest app",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah Troutman",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "The camera works great. Video looks good",
      "text": "The camera works great. Video looks good, two way voice is decent. Emails/sends notifications to my phone when someone enters its viewing space. I think the setup was fairly simple and intuitive. My only beef is that there is no local network mode. If you want to connect it to a local NAS for recording, it wont do that. You will have to look at a Foscam or the like for that. This camera uploads video to the cloud with a fee. Its nice having that stuff offsite for security and remote access, but it would be nice to have the local recording option as a choice instead of having that decision made for you.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Bostinelos",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Greatest ever!",
      "text": "I love this thing. It is super easy to set up. The ONLY thing I wish it had was a LITTLE bit crisper video quality. Would not say this is HD. But, overall, it does what I need it to do. Especially great when the dog gets on the couch and I can go on the microphone and tell him to GET OFF. hah!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffo",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Too bad, given Google is working on providing more available ...",
      "text": "The camera drops off the net without warning. When I unplug the camera fro m 115V AV for 15 minutes everything seems OK. I was going to purchase several dozen cameras to cover 20 archers of property, but with this dropping problem I am going to go some where else with more dependable service. Too bad, given Google is working on providing more available broadband access. There needs to be a better camera that will stay online without constant resets. Drop Cam, get your game together. I want to monitor 30 blocks of property, you can not provide the constant dependable feed I need, Lets up the game guys!",
      "rating": 2.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "Longevity, price, relative to comparable products, makes it not recommendable",
      "text": "The first Dropcam I purchased 18 months previously died. I had purchased the second because I thought it would seamlessly integrate with the cloud storage I purchased for the first. Ultimately, I had to delete all the saved data from the first cloud storage and start a new account with the help of Dropcam support. Hard to justify the price of being more than 2x times that of a comparable D-Link camera. Based on the failure of the camera within 18 months and the price relative to comparable products I cannot recommend. The video and performance works well - no complaints there. Dropcam tech support says it should have lasted at least 3 years.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert B.",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Cool toy, but not reliable for staying connected",
      "text": "It definitely fits the bill of being incredibly easy to set-up and use. The interface is great as well as the overall hardware design. But after having one for nearly 4 months, it constantly disconnects and sometimes requires a power cycle to reconnect. For an always-on device where you rely on the cloud storage - I would say it's not very reliable. It is neat to have for on-demand access (assuming it will work for you when you need it). But after paying for the cloud storage for a month and the camera constantly disconnecting (even though all other WiFi devices work fine in my home) I really can't recommend it unless you want a cool toy.",
      "rating": 3.0,
      "verified": true,
      "author": "Ding",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "Got great pictures of my Robbers..",
      "text": "We got burgled last year, they backed a truck up to my workshop and walked out with $3000 worth of tools.. Really made me angry. so I installed a video surveillance cameras. The problem with those is that you have to know that you've been robbed in order to find that short piece of video to review. Dropcam, makes this much easier. It notifies you when there's activity. the cops loved the video I got off dropcam of two young men trying to break in.. When the \"guy in the hat\" see's the dropcam, they take off running.. It works, it's easy to install. I can watch the video's on my phone or Ipad.. love it..",
      "rating": 5.0,
      "verified": true,
      "author": "James L. Jones",
      "helpful_votes": 3,
      "publication_date": 20130513
    },
    {
      "title": "Perfect Baby Monitor, or WHATEVER Else You Wanna Watch... Sickos.",
      "text": "We use it as a baby monitor, and it's pretty freaken amazing! We absolutely love it! I just wish you didn't have to pay to record footage, but, such is life. I'm just a tight wad! Compared to other \"Baby Monitor\" specific cameras, this one is WAY better, way higher quality, and you can watch ANYWHERE! I love seeing my daughter get put down for a nap while I'm sitting at my desk at work. It's great! The night vision is AWESOME too. Way clearer than most cameras of its kind. Just all around a really great device! I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Tanner Phillips",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "Happy With Product",
      "text": "Very Happy with Camera For Indoor Use In Color Can watch from iPad or computer I had this camera and upgraded it to a newer model. I use the newer camera as a security camera for my front yard. I like the app and that I can watch whats going on using my iPad. The camera is near the wireless router. I used to used the older and newer camera in my barn a half an acre away from the wireless router. It did have connection issues. It was disconnecting. It was still good considering it was a half an acre away from the router.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Not worth dealing with nest customer service.",
      "text": "This camera functions okay, but is designed to require a pay for use website with terrible customer service. If you do not use your credit info to subscribe to the website, you cannot access all the camera functions. This is relevant to the product review, since the product function is limited by the service provider. Unfortunately, Amazon keeps screening this review to prevent me from mentioning Nest.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "The best!",
      "text": "I bought Dropcam when I adopted a dog and I did not know how he would behave in the house. I LOVE this thing. It lets me check up on him to see if he's gotten into anything bad so I know if I need to come home. It has a very small delay (<1 sec). Can send iPhone/iPad/email notifications for movement or sound, and a screenshot is sent to your email with those notifications. Easy to turn those off though if you don't want them. I love that I can hear/speak through this also. It made me much more comfortable leaving my new pup at home while I'm at work.",
      "rating": 5.0,
      "verified": true,
      "author": "mcatron",
      "helpful_votes": 2,
      "publication_date": 20140529
    },
    {
      "title": "Good for watching baby and for home monitoring!",
      "text": "We love our Dropcams. They are super easy to set-up, super easy to use and super easy for checking in on our little one (and on our home when we are traveling). We've been using this camera for a little over a year and have only positive things to say about it. The picture is clear and the sound is great. It's motion detectors pick up every little thing (not kidding, we'll get notices if there is a fly in the room or if headlights go by the windows and cast shadows inside) and bring us tremendous peace of mind. This camera has been a great buy for us and we'd definitely recommend to other parents!",
      "rating": 5.0,
      "verified": true,
      "author": "M Hirst",
      "helpful_votes": 2,
      "publication_date": 20140529
    },
    {
      "title": "Pretty As a Picture!",
      "text": "This has been an enjoyable Godsend for our family. We use the Dropcam to focus on our crated dogs. Not only does it provide great fun to check in and see them laying flat on their backs, legs askew, or nuzzling, it provides a great security advantage. The audio is exceptional and we especially love that we can talk to the dogs (or scare an intruder) if necessary. At first we didn't know if we wanted to incur the added expense of paying for cloud storage (at $99/year after the free trial period) but then we realized even if the Dropcam was stolen, thieves can't take the footage because the \"recorder\" is beyond their reach. Gotcha, suckers!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Mermaid",
      "helpful_votes": 3,
      "publication_date": 20130729
    },
    {
      "title": "Awesome little gadget",
      "text": "I've had this for 2 years. Great little camera with really nice features and video quality. Greatest thing is you can move it anywhere. I recently had contractors in my house and foundation work done. I moved the camera so I could observe their work and when they came and went. During the foundation work I put the camera on the back patio to observe the drilling, pouring of concrete. It's nice to know what actual work went on. It is difficult to conceal and made a couple of my friends uncomfortable so I have learned to put it in the other room when having company over.",
      "rating": 5.0,
      "verified": true,
      "author": "Coop",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Very good \"Nanny Cam\"",
      "text": "Love that this \"nanny cam\" is easy to set up and mounts easily. The service is my favorite thing. I can travel overseas and see what's going on at my house (we have two cams) at the click of the App. Their plans are also straight-forward and affordable. My only beef is that the video quality at night is very poor. Actually, when we got it the quality was pretty great, but quickly (over the matter of a month or so), the quality went down pretty drastically. Going from a good silhouette to blurs. Again, the service is awesome, and if the area you're aiming the camera at is well-lit, the video quality is good.",
      "rating": 4.0,
      "verified": true,
      "author": "H Shore",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "Good hardware bad iCloud service",
      "text": "The camera is really good, both video and sound are useful to identify anything (people, pets, etc). You can even distinguish conversations clearly with high background. My only complain is the iCloud service, which is only good in the US and Canada, no international service available as yet. The other complain is that you cannot do local recording of your video, thus without the iCloud service you can only review realtime action. This is definitely not very useful for surveillance unless you keep checking you video constantly and risk your friends telling you \"get a life man, stop staring at your damn phone\".",
      "rating": 5.0,
      "verified": true,
      "author": "luis v.",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "Don't take a chance with Dropcam",
      "text": "Connection is sporadic even though all other wi-fi devices in the house works fine. Resolution is poor. Customer service is non-existent and they told me they couldn't help me with connection and infra-red issues. The only good thing about this camera is that the box it came with is upscale, perhaps it is why this product is so expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "a.c.",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "No alert schedule.",
      "text": "I have had two drop cams for probably 4 years. They're great cameras. I used them to send alerts of motion on a schedule and I pay the $9.95 for cloud recording. Nest has now dropped the alert schedule from their app and you can only send alerts based off the location of your phone. This doesn't work for me so I have to stop using both cameras and find a different brand that has an alert schedule.",
      "rating": 2.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "this is for every home",
      "text": "I purchase a huge expensive surveillance system and when I moved I tore it out of my old house to install in the new house. Well, it still sits in a box. This camera is of such high quality that I will only keep buying these. Perfect!! And I LOVE that it has a speaker so I can talk to my dogs if I choose. Or yell at the teenagers if I need to... LOL. :) I've got two cameras now, and I'm getting at least two more. LOVE THIS PRODUCT!!",
      "rating": 5.0,
      "verified": true,
      "author": "patsfan4evah",
      "helpful_votes": 5,
      "publication_date": 20131007
    },
    {
      "title": "Absolutely awesome!!",
      "text": "We bought this to keep an eye on our puppy. Setup was fast and easy. We can see what is going on via iPhone, iPad, or via computer (Dropcam website). It couldn't be easier to use, and you are able to zoom in as well as do \"playback.\" Note, however, that this DVR-like feature is only a trial and good for 14 days, then you have to purchase a subscription. it comes in handy, especially when movement or noise is found -- and, those alerts are sent to you, as well, if you choose. Very well done!",
      "rating": 5.0,
      "verified": true,
      "author": "TedVB",
      "helpful_votes": 2,
      "publication_date": 20140608
    },
    {
      "title": "Baby Monitor Relpacement",
      "text": "This is a very neat product. We actually use ours as a baby monitor as it has great night vision (much better than I anticipated) it has a motion sensor and it also has the capability to speak through your tablet or device to whoever is on the listening end. This Camera also has a very sensitive microphone that picks up the slightest noise on the camera end. I like being able to log into the Dropcam app and access it from any device anywhere. This was recommended by a friend who also used it as a baby monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "bdeibs (Quality Connoisseur)",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "A snap",
      "text": "Pun intended...this was simple to get up and running. Plug it in, access the Dropcam website to set up your email address and you are \"on camera.\" Pictures are amazing clear. We have it set up so that we get a notice when the camera detects movement and it is so sensitive that a security light going on and off triggers it. Also, picks up sound quite clearly. You have control of the audio level from the website, too. Nice wide field of vision and you can zoom in remotely. Very pleased. We use it to monitor our vacation home so what we would love to have built in is a thermometer. Are you listening Dropcam???",
      "rating": 5.0,
      "verified": true,
      "author": "Kate --Cook & Reader",
      "helpful_votes": 0,
      "publication_date": 20140420
    },
    {
      "title": "Both dropcams were hacked!",
      "text": "Someone hacked my dropcam!! I am in shock!!!! I think I’ll not be able to turn it on anymore! Someone talked through the dropcam at 3:30 am in the morning!! I have two and the same guy talked through both cams!",
      "rating": 1.0,
      "verified": true,
      "author": "Valeria",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Excellent Camera...now the Army no longer owns the night.",
      "text": "I was amazed at how easy it was to set up the camera. After camera was in place I was curious to see how the night vision operated. I waited until dark and turned off all the lights in the house. I went to a different room in the house and viewed the camera through my phone. I was SHOCKED!!!... at the clarity of the camera in complete darkness. It was as if the lights was still on. I will purchase 2 more camera's to cover other sections of my home. Note: I can't wait until this company provide an \"All Weather\" camera so I can cover the outside perimeter of my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig R. Whitehead",
      "helpful_votes": 2,
      "publication_date": 20130813
    },
    {
      "title": "Great hardware, expensive service keeps it from being perfect",
      "text": "Love the hardware, and easy to set up and use the app. For the price of the hardware, the subscription service for the DVR viewing is disappointing; should be some limited (24 hour?) built into the base price. Too expensive to maintain DVR service, and loses a lot of it's value as a security camera if you don't have the DVR history when you find an issue. Competitor's products are starting to make inroads here, and offering cheaper or included DVR service, perhaps Dropcam will consider these options. Happy with the product, but the inability to save video, or review limited history knocks it down a star...",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Fortin",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "only had it 3 days died got it on friday 17th 2014 died on sunday at 10:15pm",
      "text": "ok so it was really cool to have it working.. i was all excited was gonna even order more.. then it died on me jut now at 10:15 pm just stopped working.. everything was working from my phone from laptop my internet was working .. it was the camera it just died it was located by a window but indoors looking outside..so the temperature was fine , no direct sunlight .. i never even touched it, i just hooked it up and left it just the way i like it i even unplugged everything and plugged it back together many times and still nothing,",
      "rating": 1.0,
      "verified": true,
      "author": "Molyneaux",
      "helpful_votes": 2,
      "publication_date": 20140119
    },
    {
      "title": "Stoked.... so far!",
      "text": "Short and sweet. LITERALLY, took less than 2 minutes to set this up. Picture/sound, for under $150.00, streaming over the web to my McBkPro, iPad & iPhone....fantastic with no issues whatsoever. They made things even better by making it very, very simple to set up. And a big plus for the not so savvy, what I would consider a very user friendly web site to monitor your live video & sound. (App is even easier) Time will tell. All is swell. Going to wait a week or two and if today's any indication of how marvelous this product is, I'm going to buy another. Well done. Dropcam!",
      "rating": 5.0,
      "verified": true,
      "author": "robert",
      "helpful_votes": 3,
      "publication_date": 20121204
    },
    {
      "title": "Dropcam",
      "text": "This camera does what it says, if I have a problem seeing an undefined object, i simply go on my phone and use the zoom button, and getting a clear picture. Many people talk about bandwidth however, I don't have that issue because my service does not charge bandwidth usage. The night vision works great as well. The only downside is the monthly fee you have to pay for the CVR service but without it you don't have a way to view previous activity. I would also like to recommend PayPal as a means for purchasing the monthly CVR, I prefer that payment method for that service. Overall, happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Elisa Garcia",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "Holy sound pick up batman!",
      "text": "Great piece of equipment. We've been using ours over a year for a baby monitor mostly unless we go out of town then we put it on security duty! The picture quality comes in nice and clear especially surprised how great the night vision does. It also picks up an incredible amount of sound we can hear the downstairs tv on it if the sitter is watching a movie while our little lady sleeps. Would recommend to anyone wanting it for a baby monitor or to keep an eye on their house.",
      "rating": 5.0,
      "verified": true,
      "author": "A.W.",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Fast, simple, Low profile, good picture",
      "text": "I had previously purchased the wansview cameras. The wansview did not work for me because it requires port forwarding on the router. My router does not support it. I just got this Dropcam and after about 3 minutes of setup I now monitor my animals from my computer and my iPhone. Simple, low profile and good picture. I have audio if I want and night vision at will. If I ever need recording I can purchase server space from Dropcam but since I only need live feed right now it is FREE. I like it so much I am buying another one right now. If it fails I will update the review, but for now it's 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "G-Man",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "A dream come true- so far",
      "text": "This is for the Dropcam HD Wi-Fi Wireless Video Monitoring Camera. I just received my Dropcam this afternoon, and with much anticipation and trepidation, opened the box and installed it in about ten minutes. I've been burned many times by webcams. I use them to show what's going on at my web site and store. Most of them are garbage. Streaming video with clear resolution and SOUND for under $1,000.00 is awesome. This one not only installs easily, but it does everything I want it to do. Coupled with my Android as a hot-spot, it should prove to be as portable as I could wish for. I just ordered another one. I'm that impressed with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Wimer",
      "helpful_votes": 0,
      "publication_date": 20130104
    },
    {
      "title": "Ideal for me for few reasons",
      "text": "First, install made very easy where I don't need to have some DNS accounts because they would never work since Cablevision blocks port 80. Secondly, software to check via an iPhone is great - everything about this product is solid, I think because this product is mature and that's why manufacturer doesn't jump like others from changing storage on youtube to dropbox. I have bought cloud service as well, so now can go back 7 days to see what was going on. I hope at some point service for cloud service will drop from today's $100 for a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooklyn Settler",
      "helpful_votes": 2,
      "publication_date": 20130709
    },
    {
      "title": "Corporate Buyouts Hurt Consumers.",
      "text": "Drop cam was purchased by Net cam and the service is not the same. I have a hgh def camera and unless I subscribe. I am stuck with grainy feedback. I do not need the full screening. I Just a]want the ability to see what is going on when motion or audio attracks the sensors. A power outage left my camera offlne and we bought another one to replace it. Now we have 2 camera, but again the streaming is exteemly grainy on both views.I miss Drop Cam!",
      "rating": 3.0,
      "verified": true,
      "author": "CMM",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Monitoring Camera",
      "text": "This has got to the be the most user friendly system I have encountered as it relates to video monitoring cameras. We have two of the Dropcams and love how it gives us real-time views of our property no matter where we are located. The monthly charge for the service is reasonable and gives us added peace of mind knowing that we can review archived footage for the previous week. We opted for the 7-day plan rather than going for the 30-day one, but may upgrade if we deem it necessary. The two cons of the Dropcam: 1. No outdoor Dropcam version 2. Sometimes unknowingly drops video feed",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20130922
    },
    {
      "title": "Worst customer service",
      "text": "After a year of using this camera I found the switch to Nest gave me no option to keep my subscription. Calling did nothing to help, they simply said I'd have to start a new account. Not happening, in fact I'd have cancelled service sooner if I knew Google was taking it over. In the end I paid for a camera with a one year life span.",
      "rating": 1.0,
      "verified": true,
      "author": "Beaver Brownlee",
      "helpful_votes": 2,
      "publication_date": 20150815
    },
    {
      "title": "Great for the price!",
      "text": "This is an outstanding product for the price. Image quality is wonderful and the feed is very fluid even over a standard smart-phone 3G connection. Other camers have a high amount of lag with the motion and image quality is not very sharp. Dropcam, especially for the price does not have those problems and set up was very fast and easy. Connected to iPhone 4s, iPhone 5 and iPad 3 in minutes. Works over cell signal or with wifi. Camera is powered by USB cable that plugs in to computer or in to A/C wall adapter. Optical zoom is decent, night vision is excellent within 10-12 feet and unit is very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "JTB",
      "helpful_votes": 0,
      "publication_date": 20130207
    },
    {
      "title": "Still happy with the camera after 4 1/2 years",
      "text": "We have been using this Dropcam now for 4 1/2 years (since Dec of 2012) as a pet monitor. We've occasionally have it disconnect if the wifi signal gets weak, but that's a Comcast problem, not the camera. The motion detector works well and it's great to be able to check up on our dog when we are away. I have been very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Hoover",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "Great home video camera and baby monitor",
      "text": "We got this for our baby monitor and it has been great. It took a little work to get it mounted exactly. The picture and sound quality are really good. We didn't sign up for the CVR service but apparently they can record your video for you to review. It also has automatically flagged movements and highlights them for you when you want to review them. The night vision was really good. I guess the only real downside is if you are worried that someone might be able to log in and get to view your camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Sorensen",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "You don't get full control of this device unless you pay.",
      "text": "I'm not as happy with this as I thought I would be. It works, but seems designed to make you sign up for their services at 9.95$ a month, which is exactly the opposite of what I want. I want to control all of the automation and monitoring in my home. If I wanted a service I could just get one from TimeWarner or CPI etc. The integration with smart things is also just OK. I cannot really control the camera or see a live feed without going to thru dropcam's website.",
      "rating": 3.0,
      "verified": true,
      "author": "LotusEater",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "I like this but much is to be desired",
      "text": "I like this but much is to be desired. I wish I got the HD version. All-in-all as far as indoor cameras you can't go wrong with either DropCam. You can also search the internet for a DropCam outdoor mount which will protect your DropCam if you want to use it outdoors and a neat little hack where you can plug it into a Mophie Juice pack and have your own portable DropCam for a few hours around your house or property as long as the WIFI can reach. I've used it this way when kids are in the pool, as a baby monitor for a play area, etc",
      "rating": 4.0,
      "verified": true,
      "author": "RGBCMYKER",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "I LIKE THE PRODUCT BUT THE CORD COULD BE A LOT ...",
      "text": "I LIKE THE PRODUCT BUT THE CORD COULD BE A LOT LONGER AND THE PLUG IS TO FAT. A BETTER DESIGN WOULD BE A FLAT PLUG. I HIDE MY CORD BEHIDE A PICTURE ON MY WALL THAT HAS A TV OUTLET. THE PLUG IS SO FAT THE PICTURE HANGS CROOKED. ALSO NOT MY UNDERSTANDING OF WIRELESS. IN ADDITION THE COST FOR THE CLOUD IS HIGH FOR ONE CAMERA. AT $10 A MONTH YOU SHOULD BE ABLE TO STORE FOOTAGE FOR AT LEAST 4 CAMERAS.",
      "rating": 3.0,
      "verified": true,
      "author": "grock",
      "helpful_votes": 0,
      "publication_date": 20150915
    },
    {
      "title": "Great features, but WiFi reception is questionable.",
      "text": "These cameras, and the web service that lets you view them and record action, have exceeded my expectations. They also broadcast sound. There are settings that will send you an email with a picture of who set off the motion detector. The iPhone app works great. The monitoring is a bit expensive, but works well. I was disappointed in the limited WiFi range. But, I had a new router and have not had time to determine if the issue was with the router or the camera. Hopefully, other reviewers will address WiFi range.",
      "rating": 4.0,
      "verified": true,
      "author": "John in Amelia Island",
      "helpful_votes": 0,
      "publication_date": 20141025
    },
    {
      "title": "Very Happy with the Dropcam HD!",
      "text": "I own two of these, and they've been working great for over six months now. One monitors the outside continuously, and one monitors the inside when no one is home. Setup is quick and easy, and the portability is a super-plus. The alert system really makes this shine, and I like the cloud storage. Sure, it eats up bandwidth, but if I ever need the footage, I trust it's safe. The unit does tend to get a bit hot, so be careful where you put it. Try to make sure it gets ventilation. There may be better resolution cameras out there, but this one is good, and it's easy to use and move around, so it gets my vote.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Great doggie camera !",
      "text": "We love our dropcam camera and the only reason we purchased it was so we could keep and I on our dogs. The other day I checked up on them and saw that they were all barking when usually they are all sound asleep. Looked around and saw nothing was going on so I just told them all to be quiet through my phone. The all perked up and looked around for me, rather funny but they did quiet down and when I check up on them again they were all sleeping. This is a great camera and we are planning on getting another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 2,
      "publication_date": 20131130
    },
    {
      "title": "dropcam",
      "text": "i love my dropcam, i use it to spy on my dogs in the backyard to make sure they are ok. the quality is really good even for not the pro version, and the app on my phone allows me to drop in on my dogs anytime i want and anywhere i may be. it gives me a sound piece of mind to know that i can see my dogs when i am not at home. the trial version of cloud recording was pretty cool but i am just using the live free portion of dropcam now, and it is fine. they still send me alerts of activity. set-up was super simple. definitely recommended, i want to get 2 more!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan C. Morris",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Works pretty good",
      "text": "This is a good camera. We used it when we were on vacation to watch our cats. It was hilarious because we can talk to them through the camera. They were pretty confused when they heard our voices and we were not there! I am not giving it 5 stars because the picture was not THAT great when looking on our phone. Still. We had fun with it! The creepy thing is my husband keeps it on his desk. I feel like I have eyes watching me every time I am in there. Not the best feeling! :)",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "I love it!",
      "text": "After buying 5 baby monitors, this one did the trick! I love it!! It's not a baby monitor but you can certainly use it as one. It records, you can talk to your baby. The picture is amazingly sharp! And you can zoom! Yes there is a slight delay but it's not that bad. And it does get really warm which scares me but overall it's been okay. We are very happy with it. I went to the market late last night and left my hubby and baby at home and I was watching him randomly. It's perfect!",
      "rating": 4.0,
      "verified": true,
      "author": "Lucie",
      "helpful_votes": 0,
      "publication_date": 20151001
    },
    {
      "title": "Freezes...time delays...no voice at times",
      "text": "Pros: Good concept...tested video on droid..win 7 and iphone..and u can see reasonably clear pictures Setup is quick Cons: Time lag in both video and audio...we use it in the nursery and a lot of times we don't hear the crying in the phone but did get it from the room...the audio came on after i got to the nursery and picked the crying baby... There are times when the audio seems to be coming but the video is frozen...no movement...then i have to go disable/enable in settings and it shows the live feed...wats the point of a camera if it can't give me live feeds ?",
      "rating": 2.0,
      "verified": true,
      "author": "monz",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "It works, but image quality could be much better!",
      "text": "LOVE IT! Installation was a breeze and the camera works flawlessly. Cool Android app and easy/clean browser interface. USB is long to place it anywhere in a room. Sound is OK, could be louder. Image quality is OK, nothing close to HD/720, but hey, the camera serves its purpose (Watching my puppy when I am not home). Sharing feature is nice, but if you're on a DVR plan your friends/family will be able to see the entire camera history (Sharing Live View only is not possible). Overall, I am very impressed. Will buy another one if ever needed.",
      "rating": 5.0,
      "verified": true,
      "author": "fdigiov",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Simple, easy to setup.",
      "text": "Currently using the product to monitor my pet at home. Works like a charm and set up was super easy. It does get fairly hot so make sure you don't obstruct the camera. Night vision mode is great too even though its not the pro version. Sometimes, it does take a while to connect to the camera via my mobile device (Samsung Galaxy S3) but for my use case its not too bothersome. The microphone feature works well too but it comes out a little creepy when you try to talk to your dog through a little camera. Love the product and will probably consider getting the cloud recording features later on.",
      "rating": 4.0,
      "verified": true,
      "author": "lucius",
      "helpful_votes": 0,
      "publication_date": 20140825
    },
    {
      "title": "Okay, but with serious limitations",
      "text": "It does capture snapshots when motion occurs in front of it, but.... If you want to record the snapshots to the \"cloud\" to see later, that requires a subscription. Even more annoying, e-mails notifying you of motion detected can happen no more frequently than every thirty minutes, and this is not user-configurable. There are many folks on the Dropcam forums requesting that this be changed, but so far, no go. I am considering getting a Y-cam instead, which offers free cloud storage of clips of the last week of activity.",
      "rating": 3.0,
      "verified": true,
      "author": "G. Brooks",
      "helpful_votes": 0,
      "publication_date": 20140725
    },
    {
      "title": "I like the dropcam for its ability to work with IFTTT ...",
      "text": "I like the dropcam for its ability to work with IFTTT and smart hubs. The quality is not bad either considering I was using it to replace some of the dlink IP cameras in the house. Nice overlay and app plus the feature to invite people to your camera without giving them your username and password is awesome. My only complaint is that you can not use your own hard drives to record video or even take pictures of motion, and must use their Cloud storage which is an additional cost.",
      "rating": 4.0,
      "verified": true,
      "author": "Probar",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Nice product but didn't work for me",
      "text": "A friend had this monitor and it worked great for her. I have spotty wireless so I didn't have high hopes. It was easy enough to setup and I was able to get a connection but it kept going in and out. Compared to the others I've tried (motorola, baby ping) I think it is probably the best but still didn't work well enough for me to keep it. Note, some let you plug into an ethernet outlet if available but this one does not, wi fi only. It has a nice long cord so you can move it quite a ways from the outlet you plug it into....",
      "rating": 3.0,
      "verified": true,
      "author": "KD",
      "helpful_votes": 0,
      "publication_date": 20131001
    },
    {
      "title": "Perfect as a baby monitor.",
      "text": "Super easy to setup, takes less then 5 minutes to start using it, it has night vision that's really clear and the sound is perfect also. I purchased this for a friend that was looking for a baby monitor she could access from outside of the home when the baby was with the nanny, and she loves the dropcam, you can access from both the website and the app super easy and fast. And if u pay for the DVR service, it says recording also to the site in case u miss something and need to look back. 5 stars, loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Johnathan T.",
      "helpful_votes": 0,
      "publication_date": 20150130
    },
    {
      "title": "At first I wanted to name it: drop-out-cam, but now it's okay",
      "text": "When I opened the box I liked what I saw, a streamlined, very thought out and easy to install camera. That is what I thought. First I had problems connecting it to my Starbridge wireless network. After two days of unsuccesfull attempts I managed to connect it by linking a Linksys wireless router to my network. In the first days there were many drop-outs in the video recordings but the connection is stable now. The camera is positioned to overlook my backyard where my two cars are parked. In daytime the images are very good. But in darkness the images become blurry and the faces unrecognizable. I will try if a better lllumination will solve this problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Walter Lugten",
      "helpful_votes": 0,
      "publication_date": 20130201
    },
    {
      "title": "Awesome!",
      "text": "Love this camera...compared to what these alarm companies charge for similar service you get free notifications and the recording fees are reasonable. I already caught a plumber who came by by vacation home to give me a quote try to sneak back in when I wasn't home. He was snooping around the house. Called the cops and they caught him in the house...said he was there to do some work! Try again thief!",
      "rating": 5.0,
      "verified": true,
      "author": "JMatthews",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Excellent Security Camera",
      "text": "Wow, is this thing ever so impressive! I purchased it after hearing from a friend that he had gotten one of these cameras due to having to hire a nanny. He ended up buying 3 because he was so impressed with the camera and the features. I must say that I am absolutely impressed with this camera. The picture looks great both during the day and night. The mic picks up every little sound, if you want it to, and the speaker is a cute little feature. Everything in the description is accurate regarding this camera and I am truly glad I made the decision to purchase it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaibella",
      "helpful_votes": 0,
      "publication_date": 20130616
    },
    {
      "title": "Good cam with a small issue.",
      "text": "We use this as a baby monitor and don't need this as a recording device so it works pretty good. Night vision is great and the camera is clear. I have no issues with the iOS or Android apps. My only complaint is that it has to be hooked up to the internet and if you leave it running it will chew a big chunk of my Comcast monthly data allowance. For a workaround we just simply turn the camera on and off from the app when we want to view it. It would be nice to have a local option so I would not have to use the internet to leave it on.",
      "rating": 4.0,
      "verified": true,
      "author": "Donny Benfield",
      "helpful_votes": 0,
      "publication_date": 20140406
    },
    {
      "title": "Pretty nice, all things considered....",
      "text": "Setup was pretty easy; liked that a lot . Even in low resolution, there is a few seconds delay. Not too much of a big deal. The mic is REALLY sensitive, but you can mute it if it's a problem. My biggest problem with that is when I'm on my laptop and have muted the microphone, it mutes ALL other sounds coming from my laptop. Likewise, if you turn the volume all the way down on the mic, it turns all sounds down on my computer. If it weren't for this annoyance, I would have given it 5 stars. UPDATE: Apparently, you can turn down the mic sensitivity (or off) under Settings. Rating updated. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonian Woman",
      "helpful_votes": 0,
      "publication_date": 20130223
    },
    {
      "title": "Dropcam Wi-Fi Wireless Video Monitoring Camera",
      "text": "I am very pleased with this Dropcam. I got it for safety reasons so I could check in whenever and wherever I am to make sure my house is secure. There is an occasional slight delay but it continues on and I don't miss any speech. My son set this up for me rather quickly. I could have done it myself but he wanted to. I only bought one for a trial but I plan to buy at least one more. I would highly recommend this to anyone looking for home security, a baby cam, nanny cam or for use as an elder cam.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Clemons",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Great Product and Service",
      "text": "Outstanding Product. I receive emails when it notices something. The photos are clear and the online service is great. I am cancelling my security monitoring service because this is better as I can actually see (including by iphone) what is going on. I can actually speak through the internet to the camera and it is great for \"call me on skype\" or other simple messages to my wife when I am traveling. Great product.....easy (real easy) installation and is better than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandman",
      "helpful_votes": 0,
      "publication_date": 20131207
    },
    {
      "title": "Worked Perfectly",
      "text": "The camera and stand are well made and very sturdy. The camera's WiFi was setup in minutes, the picture is clear, and sound quality is good. I only wish I purchased this earlier. We bought this to monitor the nanny for our four month old and just a few days after installing it we saw her neglecting and mistreating our daughter. If it weren't for this camera who knows what could have happened to her. I did notice that when you are on the site and you view video recorded earlier in the day the speed seems to either be in fast forward or slow motion in during some time frames.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20131101
    },
    {
      "title": "The BEST video camera...",
      "text": "After my house was broken into, I knew I had to take things in my own hands, my control and in my budget. A system such as ADT is expensive and require a very long contract. This is the best camera choice you could make. The ease of installation was amazing. It is VERY user friendly. I recommend this to everyone that I know or who thinks about any kind of video monitoring. I have had this for about 7 or 8 months and have not had 1 issue....",
      "rating": 5.0,
      "verified": true,
      "author": "Loveshopping",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "If they can decrease the width it takes operate the Dropcam it would be a great improvement. There is no way we could ever ...",
      "text": "We use this to monitor our dog while we are away. The app is frequently updated but the camera uses a lot of broadband width and in effect causes some occasional undesirable stuttering in the live video feed. We shut the camera off when we are home because it slows our internet speed down waaaay tooooo much. If they can decrease the width it takes operate the Dropcam it would be a great improvement. There is no way we could ever have more than one of these in operation at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc Holiday",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "LOVE MY DROPCAM!!!!! Awesome Product",
      "text": "Love Dropcam. Awesome company, great customer service. Yes I did need them but it was something on my end not theirs. The pro is better and worth the extra $50 because of the gigahertz difference on the two cameras. But not upset with my purchase at all. Even though it's $10 a month for recording for one week, it is worth it, it's recorded in the cloud not on the device in your house that you have to mess with SMS cards or DVR's. It's awesome!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Pam H",
      "helpful_votes": 2,
      "publication_date": 20140302
    },
    {
      "title": "Don't drop the Dropcam",
      "text": "Dropcam? I think not. At least not the one I bought. It dropped to ground and did not work after that",
      "rating": 3.0,
      "verified": true,
      "author": "johnnyd",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Very unreliable for baby monitoring! Loading...loading...loading...",
      "text": "The concept is great, but they have a lot of work to do. This is a very unreliable camera for baby monitoring. It frequently pauses and displays in the screen a message that says \"loading....\" and I cannot see or hear what my baby is doing. Today this message appeared EVERY OTHER SECOND. I went to the settings and turned off the Alerts and it continued doing it. I called the dropcam customer service and after 15 minutes waiting on the line no one took my call and I was requested to leave a message. I will be returning this product. I just got it a few weeks ago and it doesn't reliably work for its purpose.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria NYC",
      "helpful_votes": 0,
      "publication_date": 20130322
    },
    {
      "title": "Exactly as described. A super camera!",
      "text": "Works exactly as advertised. Set up was so easy. The microphone is super sensitive so you will probably want to scale it down. I really like the alerts to my iPhone. Most are false alarms like the phone ringing but it just means that it absolutely works. The night vision is also very cool and works well. Very clear video for a device like this. I also got the online/cloud recording which seems like a good value just in case you ever need it. All in all, I'm super satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric G. Myers",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "great camera",
      "text": "I bought 4 cameras for monitoring the house. Front, back, sides. Working great... but these cameras taken all bandwidth of the internet. Video and audio. I cant get all four to work at the same time. Always one has to be off. And, my pc internet browser jammed. Soon as I disconnect all four, then my browser works fine, Returned three, kept one. PRO - reasonable cost, size, easy of installation CONS - JAMMED up all bandwidth.",
      "rating": 3.0,
      "verified": true,
      "author": "NCao",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "Great...............................if you get it to work.",
      "text": "I love my drop cam. it's ease and great, but there are a few things to consider. I have the router in the basement and I have some cameras in the bedroom of the boys, so they tend to go out a lot and it gets on my nerve. I try to reset them, and they do work for a bit, but then they turn off again. it's a pain in the neck issue that I hope they have taken care of with the newer ones. So if you can go a little bit more get the dropcam pro. I would only get this one if you are sure the router is not to far away.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge R. Duarte",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Works but needs extra monthly fee to be fully functional",
      "text": "Works as needed but you will want to get the 24/7 video monitoring and recording. It will text/email you when it sees motion but unless you pay the monthly fee to go back and watch the recording you can't see it. So all you know is that someone walked past the camera at 2 PM. You will never know who. I wasn't planning on getting the video recording but after realizing you really do need it I gave the dropcam to my dad.",
      "rating": 4.0,
      "verified": true,
      "author": "Hophouse",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "Good video; super easy to setup; great overall home surveillance solution",
      "text": "These things are great. Easy to setup and provide good video and a wide viewing angle. Actually caught video of an attempted theft that was provided to the police. One unavoidable downside is how much wi-fi bandwidth they consume. If you don't have a lot of wi-fi bandwidth and a lot of upload bandwidth to the Internet, a few of these will bring your networking to a crawl. If you need one nanny cam or have ample networking to support the HD video, then Dropcam is a great solution.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Heartwell",
      "helpful_votes": 0,
      "publication_date": 20140803
    },
    {
      "title": "Good resolution, very easy to install and access.",
      "text": "I would have given dropcam a 5 but bec it affects the wi fi strength and the house phone in a tolerable level, I have to deduct a point. very happy with the product. We use it to monitor my aging parent. It's like 24 hour Skype, we can converse , and because I can see the subject, I can time it when I see that he is close to the dropcam, or make a phone call when I see that he's near the phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Olivia Blumenfeld",
      "helpful_votes": 4,
      "publication_date": 20130702
    },
    {
      "title": "great product and great for a baby monitor.",
      "text": "We use this for a baby monitor. Fantastic. We recommend it to all our friends. Get it and you will be happy. The only problems are that you can't easily grab it and go when going on a trip (needs internet access and we have our's attached to the wall) and very very occationally i loose video connectivity for a few minutes. But it is less expensive than some video baby monitors which is a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "April",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Wish it worked",
      "text": "Have to say this is the first item I have purchased that I requested a refund on. The seller worked with me on the return. Thank you. Tried 2 of them and both failed in a matter of two to three hours. Helpdesk at manufacturer made up my mind. Something to do with my connection to the internet? 50mps consistently and the cameras both stopped working. Router could see both of them wireless as though everything was fine..",
      "rating": 3.0,
      "verified": true,
      "author": "Jay C",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "So simple",
      "text": "I am not a high tech person and this was so quick and easy! The quality is really good. I got it because my dog has separation anxiety and I wanted to see and hear what was happening when I was away. The talk feature was so great! When he started whining I was able to talk to him using my iphone and he chilled out! I'm not crazy about paying monthly for the dvr feature but I'm sure I will use it, it's worth it! Simple is GOOD!",
      "rating": 5.0,
      "verified": true,
      "author": "Be June",
      "helpful_votes": 5,
      "publication_date": 20130708
    },
    {
      "title": "Great DIY Security System",
      "text": "Bought two of these to monitor the main level and basement of my house and plan to add more in the future. Setup is a piece of cake. Picture quality is great and web interface couldn't be easier. The IR, for night vision, likes to bounce off windows/mirrors/pictures and render it useless so you need to be extra mindful of placement. DVR feature is awesome but too rich for my blood. If you are in reach of a computer or cell phone all day then the notifications are quick enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauly D",
      "helpful_votes": 0,
      "publication_date": 20130214
    },
    {
      "title": "There are better options out there.",
      "text": "Kept dropping off network even if I placed it right next to my router. It only supports the crowded 2.4ghz frequency unlike the Dropcam Pro. Also, do like the fact you are forced to sign up for a cloud subscription and you can't use a local NVR option. It's proprietary. Sending It back even though I got it on Black Friday for $99.00",
      "rating": 1.0,
      "verified": true,
      "author": "MarcBH",
      "helpful_votes": 2,
      "publication_date": 20150103
    },
    {
      "title": "Best internet connected camera out there!  I've bought three more!",
      "text": "I have had 4 webcams in my life and this is the best one, hands down, by far! I am purchasing three more to put up at my other home and at my in-laws. Plus, I have a new baby due and we will be using this as the baby monitor. The whole setup time is less than 5 minutes, the clarity is excellent and the DVR is amazing. It's so nice to be able to go back and see through motion and audio alerts what has happened. Their iphone and ipad apps are very easy to use. I fully recommend this produce!",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20130320
    },
    {
      "title": "Awesome!!!",
      "text": "This camera is amazing. It literally takes less than 3 minutes to setup. The picture quality is awesome, and I love the Infrared night vision. It comes with 2 way sound and works on a MAC. What more can you ask for??? Works great on Ipad and Iphone. If I could find one improvement, it would the capability to move the camera left/right and up/down. But honestly, this is thee best and easiest camera on the market. I'm ready to purchase a few more!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck T",
      "helpful_votes": 2,
      "publication_date": 20130725
    },
    {
      "title": "Believe the hype.... this camera is dope!",
      "text": "Great resolution, awesome clear audio, perfect for spying on your crib right from your smartphone. WARNING: Comes with a 7 day trial period for the video recording service which you'll get addicted to. Once it expires... you'll miss it terribly and will likely fall prey to subscribing $99/year for the 7-day history playback subscription.",
      "rating": 5.0,
      "verified": true,
      "author": "PapaSan",
      "helpful_votes": 7,
      "publication_date": 20130914
    },
    {
      "title": "Easiest coolest camera ever!",
      "text": "Dropcam is WONDERFUL! it is very durable strong metal construction. Comes with a mounting piece that's easy to install. All components seem durable and well made. It was literally a 60 second activation after i hung it on the wall and i was looking live into my room and starting the free 2 week trial of the video storage system. I definitely signed up for the monthly contract when the trial was over. I LOVE this camera! you can zoom easy, see very well and can access it in a second from the app or the website. LOVE, LOVE, LOVE this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "The best!",
      "text": "We set these up at our cabin so we could see the weather and how much snow we have in the winter. We just love them! It literally took 3 minute to create an account and set up. If we tired of the view, we just unplug from the wall outlet and plug in somewhere else. It reconnects itself in seconds. Our internet provider changes the IP address daily and this great little webcam somehow changes with it. We have never lost connection. I like all the features it offers for an outstanding competitive price. Three of our friends have gotten them as well and they love them too. Get a few today, you won't be sorry!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20130517
    },
    {
      "title": "Too cool",
      "text": "Really like this camera. The good and bad of it for someone wit networking and related experience is that there is little to the interface. This makes it easy to setup when all other components are playing nicely, and near impossible when not as there is no way to see what is causing the problem; no settings to change to correct the problem. Terrific device and great features, including audio on Apple devices which is a major, major feature that noone else in my experience was able to pull off.",
      "rating": 5.0,
      "verified": true,
      "author": "BgNH",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "Great!!",
      "text": "I've had the camera for a day now, and like it so much I ordered another one this morning. It does everything advertised and that's saying something in this hyped world. The quality of the picture is first rate with only a little jerkiness once in a while, but not all the time, so not a problem for me. The only thing I would like to see is the ability to pan and zoom from the viewing screen rather than going to settings to change the viewing. All in all its a great product for the money and I would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick Lattimer",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Never be unsure again.",
      "text": "Never again will you allow yourself to be unsure if someone is in your house, or if your animals are tearing your place apart. With the Dropcam wifi cameras keeping watch over your kingdom you will always have peace of mind. Access your cameras from anywhere using either the wifi in the coffee shop or your 4g while on the road, no matter what country you are in or time of the day. These cameras are great for keeping an eye on your castle, inside and out.",
      "rating": 4.0,
      "verified": true,
      "author": "Avid user",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "Great for my mom's safety",
      "text": "We purchased these to make sure my Mom is safe at home. She refuses to live anywhere else and won't have a live-in. The cameras were a breeze to set up, Dropcam folks were very patient and helpful. They are very reliable and easy to use. My Mom says it makes her feel better, like we are there with her. The rest of the family sure feels better now that we can make sure she is ok from wherever we are. The cameras take a lot of internet bandwidth, though, so one needs to be sure they have the internet speed if they want to use more than one camera. We love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris W",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Very good wifi cam!!!",
      "text": "At first, I purchased other wifi camera, but I failed setup. I am not such a dum digital IT person. So, setup was really difficult. I reviewed many websites including amazon and found dropcam was very good cam with tons of positive p. So, I purchased it and set up within 3 min!!! Actually, I met a color problem at first. I sent an email question and received an answer one day later even in weekend. Finally, I got nice color vision and am very satisfied with this cam. I strongly recommend this one although I purchased cheaper one.",
      "rating": 5.0,
      "verified": true,
      "author": "sangyong",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "Don't waste your money",
      "text": "Worked fine for 7 months, then just stopped connecting to my WIFI. Called customer service and explained the problem. They took my phone no said they would call me back. Havent heard from them. I used it indoor and liked the way the system worked but it only lasted about 7 months. So far their customer service is a joke, there is none. Sorry that I wasted my money. If they had responded and solved the problem with my dropcam I would have given it 5 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Really unreliable connectivity",
      "text": "This product was just terrible. 1/ the setup was really slow and painful (it took forever for the final step of the USB-based setup to work) 2/ everytime I tried to change the resolution from 720 down to 300s it would stop connecting to the camera 3/ wifi would keep disconnecting some of this could potentially be my wifi - but I haven't had any other issues with my wifi (ie skype / google hangouts all work fine)",
      "rating": 1.0,
      "verified": true,
      "author": "NoPenName",
      "helpful_votes": 0,
      "publication_date": 20150906
    },
    {
      "title": "Very clear picture and sound",
      "text": "We bought this as a nanny cam and we were so glad we did. While it wasn't easy to hide, it does have a great picture and you can see a good portion of the room. The sound is slightly delayed but you can understand it very clearly. The night vision is also very good. We love being able to access the picture from any computer or our phones. We just wish the video recording was included because $10/month for the first camera (and I think $5/month for the second camera), is a lot to pay for the long term.",
      "rating": 4.0,
      "verified": true,
      "author": "Today is a new day!",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Exactly what I was looking for",
      "text": "This camera was VERY quick and easy to set up and install, picture and sound quality is excellent, and I love how easy it is to check in on my children throughout the day from my computer and smart phone. I do wish I could pan and zoom in easier; it lets you zoom in on either the center or one of the four quadrants of the video, but this has to be done in \"settings\" and you can't just click somewhere on the video picture itself to easily zoom in and out. But for the price, this camera does exactly what I wanted and more.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Morse",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Streamlined design & interface makes it a good value",
      "text": "Overall I think the Dropcam is a solid design that works as advertised. Installation was very easy. I think the picture quality is tenable but not outstanding. Sometimes the camera will just go off-line but usually restores itself soon afterwards. The cloud recording & playback interface is well designed (I used it for the free trial but did not purchase an account). I wish it was easier to set up for use in a multiple-router environment.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Schuller",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "when working, features are great! WiFi - very poor",
      "text": "great idea the good - the notifications, cloud storage, picture clarity are excellent. the bad - worst WiFi ever - even if you are sitting within 20 feet of the access point, the dropcam doesn't see it. really bad, and of course, without reliable connectivity, there's no value at all",
      "rating": 3.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Grandma Cam",
      "text": "Purchased two units to cover my mother-in-law's house next door so we can monitor her. (Alzheimer ) We also purchased 4 iPads so 4 families can help with the monitoring. This is keeping her out of a nursing home. Unit works well, easy setup. Only problem is the unit goes offline some but not enough to be a problem, just aggravating. Manufacture says .5 meg upload bandwidth per camera and we have a total of .86 meg bandwidth so we have less than recommended. Night vision not so good so we keep lights on to get a good picture at night. Again, that is a bandwidth problem I believe.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "Dropping is EASY",
      "text": "I was unsure which Web camera to go with, but went with the Dropcam based on reviews and a consumer advocates recommendation. It took no time to set up-just usb into the computer and the software walks you through setting up the wireless internet connection and Dropcam account and smartphone app. Once that is done, just set up the camera wherever you want and plug into the wall outlet Very pleased still the quality in the camera bracket (its metal). Its been interesting to look in on my two dogs from anywhere!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 3,
      "publication_date": 20130919
    },
    {
      "title": "Works for a baby monitor",
      "text": "Great alternative for a baby monitor. I was skeptical in buying this regarding the reviews on the wifi usage and band with. We had no problems setting it up and the picture quality is great. I love the fact that I can check in on my baby from work or where ever I have internet access. One con is it's streamed through the cloud so I don't know if other people (that work at dropcam) can see our camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Fabfamfive",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Excellent Security Cam",
      "text": "Amazing picture quality in all light settings. The two way speaker is so sensitive you can hear things tools away and can have full on conversations from the app, your computer or anywhere in the world through this camera to people in your home. Can be funny but also creepy as you can literally hear things crystal clear. The recording aspect is nice and the camera was a snap to set up. It is pretty warm to the touch almost hot. Not sure if that will affect lifespan but we shall see.",
      "rating": 5.0,
      "verified": true,
      "author": "DMV",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Great Camera",
      "text": "Easy to set-up. My wife who thinks the computer is a \"magic box\" set these up in just a few minutes. AMAZON -- Ok this is where I had issues. I purchased one. It worked great. So I bought two more. Effin Amazon sent me two open and obviously used cameras (already been logged onto) that I couldn't access. BullPoop. This is my first bad experience with Amazon. I have put them on probation for now - we'll see how that goes",
      "rating": 4.0,
      "verified": true,
      "author": "Kyzrsoce",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Love this camera for my dog!",
      "text": "I use this camera to check in on my dog when my neighbor watches him while we are away. It give me great peace of mind knowing I can see how he is doing, as he is older and has heart problems. Not toi mention the family misses him. There is an app for your smartphone and you can check it anytime, day or night. It even gives activity alerts and stores them. You can also interact with your pet or caregiver if you so choose. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ship It 2 Me",
      "helpful_votes": 0,
      "publication_date": 20140407
    }
  ],
  "product_meta": {
    "title": "Dropcam Wi-fi Wireless Video Monitoring Camera (Only) Black - Pre-Owned",
    "description": "Style:New| Product Packaging:Standard PackagingDropcam HD Internet Wi-Fi Video Monitoring Cameras help you watch what you love from anywhere. In less than a minute, you'll have it setup and securely streaming video to you over your home Wi-Fi. Use it to watch your home, your baby, the dog, and your small business. Every camera comes with Night vision, 720p HD video, two-way audio, and Digital Pan and Zoom. Paired with secure online DVR recording, you can watch live and recorded video from anywhere on any device. Dropcam HD makes monitoring what you love and finding peace of mind easier than ever. Watch from any device such as your Apple Mac, Windows PC, iPhone, iPad, iPod Touch, or Android. All you need is a Wi-Fi network paired with the free and easy-to-use Dropcam App. Watch what you love while away with Dropcam HD.\n\nFROM THE MANUFACTURER\n\n\nDROPCAM\n\n\nDROPCAM + NEST PROTECT\nWhen a safety event occurs (smoke or CO is detected):\n> Cameras in your home turn on automatically\n> A clip is generated and saved automatically during an event, even if you’re not a subscriber\n> User receives a notification of the event on their mobile device\n> Event is added to your activity feed and Cloud Recording timeline (as applicable)\nView larger DROPCAM + NEST THERNOSTAT\nWhen a user manually sets Away/Home mode:\n> Alerts turn on or off, respectively\n> Cameras turn on or off, respectively \n\n\n\n\nMEET DROPCAM\nDropcam is a cloud-based Wi-Fi video monitoring service that helps you stay connected to places, people and pets. Receive activity alerts on your smartphone, tablet or computer. Add optional Cloud Video Recording (CVR) to access video from the past week or month.\n\n\n\n\n\nView larger \n\nSTAY SHARP\nWith a 107 degree field of view and 4x zoom, Dropcam keeps you connected to people, places and pets in vivid 720p HD video. \n\n\n\n\nView larger \nHOW IT WORKS\nOpen the box and remove the camera. Connect to your Wi-Fi network via your computer. Name your camera and create an account. You're ready to stream!\n\n\n\n\nView larger \n\nCONNECT ON THE GO\nReceive alerts for motion and sound on your smartphone or other device. Drop in live and talk directly with people and pets.\n\n\n\n\nView larger \n\nVIEW IT LATER\nAdd our optional Cloud Recording service to save up to 30 days (720 hours) of continuous video. Review footage on your device and share favorite clips with family and friends.\n\n\n\n\n\nFEATURES\nMOBILE & WEB APPS\nWatch remotely from your devices.\n\nINTELLIGENT ALERTS\nReceive notifications for motion and sound.\n\nNIGHT VISION\nKeep an eye on things, even in the dark.\n\nTWO-WAY TALK\nTalk directly to people and pets.\n\nSCHEDULING\nSet alerts based on time of day or your location.\n\nLIVE SECURE STREAMING\nStream safely with bank-level encryption.\n\nAUTOMATIC UPDATES\nGet new features with camera and app updates.\n\nOPTIONAL SHARING\nShare your stream with friends or make it public.\n\n\n\nCLOUD VIDEO RECORDING (CVR)\nAdd our optional Cloud Video Recording to save up to a month of video and make clips.\n\n\nSave 7 days of video\n$9.95/month\n$99/year\n\nSave 30 days of video\n$29.95/month\n$299/year\n\n50% off CVR pricing for additional cameras.\n\nTECH SPECS\n * Product Dimensions:4.5\" x 3.15\" x 3.15\"\n * Weight: 5.5oz (156g)\n * Power:\n   Input: 50/60Hz 0.5A\n   Output: 5V-2A\n * Camera: Color with digital zoom\n * Video: H.264 encoding, up to 720HD (1280 × 720) at 30 frames/sec\n * Field of View: 107° (diagonal)\n * Audio: Speaker and microphone\n * Night Vision: High-power IR LEDs\n * Warranty: One-year parts\n * Operating Temperature: 0 - 35°C, designed for indoor use\n\nREQUIREMENTS\n * Computer (for setup)\n * High Speed Internet: DSL, Cable, FiOS\n * Web Browser: Internet Explorer 7+, Firefox 3+, Safari 3+, Chrome\n * Optional Devices: iPhone, iPad, iPod Touch, and/or Android Device\n * Wi-Fi: 802.11b/g/n 2.4GHz\n * Supported wireless security:\n   - WEP (40-bit, 128-bit)\n   - WPA (TKIP, AES)\n   - WPA2 (TKIP, AES)\n\nIN THE BOX\n * HD Camera\n * Aluminum stand \n * Wall mounting hardware\n * 10-foot USB cable\n * USB power adapter\n * Quick start guide\n\nQUESTIONS?\nWebsite: Dropcam.com/support\nPhone: 877-345-3767\n\nHours of Operation\nMonday through Saturday: 6am to 6pm PT\nSunday: closed\n\n\nWHICH DROPCAM IS RIGHT FOR YOU?\nDropcam\nDropcam Pro\nField of View 107° 130° Zoom 4x 8x Night Vision Good Excellent Audio Quality Solid Superior Mobile and Web Apps ✔ ✔ 2-Way Talk ✔ ✔ Intelligent Alerts ✔ ✔ Wi-Fi 2.4GHz 2.4GHz and 5.0GHz Cloud Recording Optional Optional Setup Computer Computer or iOS device* Camera Color Silver Black Video H.264 encoding, 720p HD \n1280 x 720 at 30 frames/sec H.264 encoding, 720p HD \n1280 x 720 at 30 frames/sec *To set up Dropcam Pro using an iOS device, you need an iPhone 4S or later, iPad 3rd generation or later, iPad mini or iPod touch 5th generation or later running iOS 6 or higher.",
    "rating": 3.9,
    "feature_bullets": [
      "Works with Alexa for voice control (Alexa device sold separately).",
      "60 Second Setup - Use your computer to find your Wi-Fi network, live stream in under a minute.",
      "60 Second Setup - Use your computer to find your Wi-Fi network, live stream in under a minute.",
      "High Quality Video - Get into the details with 720p high-definition video.",
      "Fast and easy setup - online and securely streaming 720p HD video in 60 seconds.",
      "Field of View - 107 degrees diagonal, plus Night Vision and Zoom, means you don’t miss a thing."
    ],
    "specifications": {
      "Product Dimensions": "3.15 x 3.15 x 4.5 inches",
      "Item Weight": "5.4 ounces",
      "ASIN": "B006P88VSE",
      "Item model number": "DCAM-001-THD",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "3.9 out of 5 stars2,292 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#1,136 in Home Security Systems",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 9, 2012",
      "Manufacturer": "Dropcam"
    },
    "categories": [
      "Home Security Systems",
      "Security & Surveillance",
      "Electronics"
    ],
    "price": 170.0
  }
}