{
  "website_summaries": [
    {
      "verdict": "The tiny Sony Cyber-shot DSC-WX50 is a lot of camera for the money, with solid shooting performance, and good photo and movie quality.",
      "pros": [
        "The Sony Cyber-shot DSC-WX50 offers excellent features for automatic snapshots and speedy shooting performance, and nice photo and video quality for its class"
      ],
      "cons": [
        "The WX50's controls might be too small for some users and its photos aren't sharp enough for pixel peepers"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Image quality": 8.0
      },
      "publication_date": 20121128,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Replaced my dinky Canon",
      "text": "I had a point and shoot Canon elf something or other, and this camera is MILES above it. It's quick, the battery life lasts forever, and for a point and shoot it has more options than I could imagine. It takes sharp pictures, and doesn't lag a lot between shots. The flash works well (well enough for a P&S), and the autofocus is fantastic. I could rave forever about the other features, but honestly, it's just a great little camera, that's mostly intuitive, with tons of features and takes great pictures. If you need something tiny and quick, this is a fantastic bet.",
      "rating": 5.0,
      "verified": true,
      "author": "emmy5881",
      "helpful_votes": 0,
      "publication_date": 20130807
    },
    {
      "title": "Love this camera works really well but you really need ...",
      "text": "Love this camera works really well but you really need to order extra batteries if you plan on using it for school plays and longer outings as the battery does not last a long time when using the movie feature. Like that you can take video, zoom and take photos (I think 10 per recording time) all at the same time. Bought for my husband and he really likes it as well and he does have larger hands and can use it but wanted to let others know to be aware as camera is pocket sized.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellie P",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "NO BATTERY OR CORD, UNUSABLE.",
      "text": "This used item was delivered from seller Ztron without a battery or charge cord, so I have no idea if it even works.",
      "rating": 2.0,
      "verified": true,
      "author": "anon",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Very Pleased",
      "text": "I bought this camera for my daughter, so please understand that when reading this very brief review. She has owned several cameras over the last several years: a Lumix and a Canon. She greatly prefers this little Sony to those cameras. In the first week she took over 400 pictures with it. She is a terrific photographer and works in the punk community. She has told me that the quality of the images has been consistently terrific and she has loved several of the camera's special effects options.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Gross",
      "helpful_votes": 0,
      "publication_date": 20130524
    },
    {
      "title": "LOVE it....great video and pretty good shots, especially outside",
      "text": "I brought this camera to Mexico for a trip to the Yucatan. It is SO tiny and portable. Got fantastic video clips of all the sights I wanted to see. Was particularly good for outside pictures. Inside, with low lighting, you really need to play with the settings to get shots that aren't grainy. For the price, this camera is fantastic for video and pictures (most especially ones outside in natural light). The portability if simply amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 0,
      "publication_date": 20131001
    },
    {
      "title": "Easy to use, good battery life, customization themes",
      "text": "This camera is great for what I need it for. I am very happy with the quality and the features. Shoots full 1080p video and 4k still photos. I use a micro sd card in it with the adapter and use my phone to import photos i want to share. Works great with Android phones with micro my 16gb sd card. I no longer need to get to a computer to share photos, but when i do works fine. Different themes to choose from and many features to get the right shot,",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20130501
    },
    {
      "title": "The best camera I've ever had",
      "text": "I'm not a tech savy camera buff. So if I can get it to work it must be easy. The pictures in all modes so far have come out great, Clear as a bell. It shoots the picture when you press the button not when it wants to. In movie mode you can shoot stills. By pressing the button. Colors seem lifelike. Battery life seems fine. Have not found any cons yet, except it's a little hard to see the screen in bright sunlight, But I just pointed and shot and the pics came out great. And sound is a little scratchy",
      "rating": 5.0,
      "verified": true,
      "author": "rt1092",
      "helpful_votes": 0,
      "publication_date": 20130120
    },
    {
      "title": "Five Stars",
      "text": "NIce used camera. No problems and its small size is perfect for keeping in my pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne M. Smith",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Pretty good camera",
      "text": "I went through Sony WX1 (lost) and WX5 (repair costs more than the price of WX50 due to my harsh abuse & lack of care) before finding WX50 which seems to beat other models on features and price. I like the WX series primarily for their low light picture taking ability, compact size and I almost never use zoom. Not sure how long this will last, but given the fate cameras suffered in my hands and the low cost of WX50, I'd say this fits perfectly now.",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20130302
    },
    {
      "title": "Great Pictures and love the size!",
      "text": "I have had a digital camera before and was not happy with the quality of pictures, or the size. This one is the opposite! I love this camera! It is small and compact and takes delightful, clear, crisp pictures. I especially like the fact that there is not a sizable delay once focused and then taking the picture. So often pictures would be blurred with my other camera. This one is just great and would recommend to the novice photographer!",
      "rating": 5.0,
      "verified": true,
      "author": "Tall",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "Amazing Camera!",
      "text": "I was very skeptical about this camera (purchased in April 2012), but my wife and I just took it out of the box and are blown away by what this camera can do! I was VERY concerned about its video capabilities, because I'm a mac user. I had read some reviews that said it used an out-dated video codec, so I was surprised to find out that it also has an MP4 option in the menu! Go Sony!!!! Amazing pictures. Amazing video. Amazing camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Berggren",
      "helpful_votes": 2,
      "publication_date": 20120420
    },
    {
      "title": "Works well for the price",
      "text": "I was using this as a camcorder and it works well. It will record 720p video and 1080i video. The downside is that too many of the setting are not manual (if the company would unlock more of the features it would be 5 stars). The optics perform well and there is not too much distortion. Another downside it that the cmos sensor will sometimes do a rolling shutter on rapidly changing brightness. The pictures are clear and crisp.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert J. Broughton",
      "helpful_votes": 0,
      "publication_date": 20130306
    },
    {
      "title": "Fantastic Camera!",
      "text": "We were in need of a good point and shoot camera that delivered the same high quality photos as our DSLR but that could be taken to places that don't allow our \"detachable lens camera\". This fit the bill. This camera is light, slender and has a solid feel to the body. It takes great photos and offers numerous options that are user friendly. The price was fantastic and much less that in the retail stores. I highly recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "mistressofstinge",
      "helpful_votes": 0,
      "publication_date": 20130416
    },
    {
      "title": "Duplicating a good thing...",
      "text": "The first camera model DSC-WX50 was puchased a few years ago and I have been daily amazed by its perforance. It has functioned perfectly since its purchase and the simple fact is, that although my original DSC-WX50 is working fine, I wanted a back-up to a fine product.",
      "rating": 5.0,
      "verified": true,
      "author": "The Watchman",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Great camera on the cheap",
      "text": "I bought the sony Cyber-shot to take with me while I'm living abroad, and so far it works great. Mind you, I'm not trying to take professional photos, just something to send back to my family and show them I'm alive and doing things. The only problem I have had with the camera is that sometimes pictures are constantly blurry, even with the shortest shutter setting and resting it on a solid surface. But, I think this may be more a problem with the settings I changed than with the actual camera because it doesn't happen all the time. If you want to use the other settings, maybe do what I didn't and read the manual!",
      "rating": 4.0,
      "verified": true,
      "author": "PabloFenixx",
      "helpful_votes": 0,
      "publication_date": 20130518
    },
    {
      "title": "Sony Cyber-shot",
      "text": "I absolutely love this little powerhouse of a camera!!! I have been looking for a camera that takes great pictures, small enough to pocket if need be and be able to learn how to use with the computer. This one fits just right in what I wanted in a camera. I can do more with the cyber-shot than I expected. Good little camera and for the price.... well that was even better ; ) Ginny K.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Great when working",
      "text": "The Good: The camera is very small and portable, easily fitting into a pocket or a small purse. Lots of great features and it is very easy to use. The photo quality was extremely good compared to my past cameras. The Bad: The camera worked flawlessly until the lens would no longer retract into the camera in less than a month's worth of use. Sent it off to be repaired (had to pay for shipping to service center). Was very excited for this camera until it stopped working. Hopefully it was just a problem with the camera I purchased and will have no further problems. Will update once I receive the camera back.",
      "rating": 3.0,
      "verified": true,
      "author": "Curtis Wade Tanner",
      "helpful_votes": 5,
      "publication_date": 20120606
    },
    {
      "title": "Good until the mode selector dial becomes hyper-sensitive",
      "text": "This is my second Sony Cyber-shot. Both were good cameras at first but both have suffered the same problem. After about 1.5 years (when they're no longer in warranty) the mode selector dial becomes hyper-sensitive so that it becomes difficult, if not impossible, to set the actual mode that you want... When you do happen to set the mode you want and lightly brush the dial while trying to take a picture it changes mode on you, more likely than not, messing up the photo. I can only assume that this is a common fault with Sony Cyber-shot cameras since it's happened to 2 out of 2 of mine.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Very nice so far.",
      "text": "Bought for a vacation at the beach and took great pics, but not at first. Too Orange and surreal. Use the Easy mode. In this mode not great in low light but we did not do much at night anyway. Kids loved it. Takes great video too. Feels good in the hand. Decent build quality. No plastic. Only had it for two months will update later. Happy with purchase. Would buy again. Got the package deal with case and sim. Great deal for $100.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Sunshine",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Nice Camera, but...",
      "text": "Had higher performance expectations. Glad my Coolpix 6000 still works. Battery life varies. Colors can be bright at times, but some stills have white-out. Video is great, but don't like file saving names. Video shots are NOT saved in sequential order with still shots. Play Memories software can be quirky at times. Will stay with Nikon Brand.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard842",
      "helpful_votes": 0,
      "publication_date": 20131024
    },
    {
      "title": "Easy to use",
      "text": "Bought this camera for my husband who's an electrician. He wanted it to take pictures on job sites when the sheet rockers bury his wires. He finds it useful so he keeps it in his truck. Sorry I can't elaborate on it's specific qualities, but we've owned Sony Cyber-shots in the past and have no complaints. They're great reliable little point and shoot cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "Great Camera!",
      "text": "This is just a great camera and hard to find. The next model sucks! This just has awesome features and reacts quickly! Great quality all they way around!",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Great camera, lots of useful feature and so cheap",
      "text": "I bought this camera because I had bought the previous model in Tokyo and eventually lost it in San Fransicsco. It is the best point and shoot camera I ever had : it is light, small and even though the lens is not fantastic, the digital signal processing it offers allows you to make picture no other camera can do (I have a Nikon D90 that cannot compare for night shot or high dynamic pictures). I love it !",
      "rating": 5.0,
      "verified": true,
      "author": "AntoineWojdyla",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "Great photos and very easy to use",
      "text": "I bought this camera for my aunt as she wanted to replace her existing sony camera which had got damaged. It takes great photos and the panoramic feature is a fantastic feature. Like all Sony cameras it is very easy to use and takes great photos. Would easily recommend it to others, especially at the price at which we bought it, just a little over $110.",
      "rating": 5.0,
      "verified": true,
      "author": "Deepak Gupta",
      "helpful_votes": 0,
      "publication_date": 20130525
    },
    {
      "title": "Great pictures, and fast!",
      "text": "This Sony is a great camera for the price, pictures are very clear and the delay from when you push the button to it taking the picture is FAST! I bought this over the canon A2300 camera, which I bought for Christmas, and this is hands down way better. Night and day difference. The menu options are easy to use. This is a great buy for a point and shoot camera.",
      "rating": 5.0,
      "verified": true,
      "author": "plumber",
      "helpful_votes": 0,
      "publication_date": 20130114
    },
    {
      "title": "Screen Went in 1 year",
      "text": "Loved this camera, especially the soft skin feature. Then, without warning, the screen had a big grey square right in the middle. Took a picture, turned the camera off, and 5 minutes later went to take another picture, and the screen became defective... could only partially view the photos taken due to the grey square. I didnt drop it or agitate it in any way to cause the issue. Called Sony, and the camera was 10 DAYS outside the 1 year warrenty, and they refused to fix it unless I paid $90... the camera itself cost around $100. Poor quality, poor customer service, I will stick to Samsung products. Its a shame Sony does not stand behind their products.",
      "rating": 2.0,
      "verified": true,
      "author": "Maria C.",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Dont buy camera",
      "text": "I thought this was a nice camera when I bought it for my wife , but its been less than 3 months and the swit h for switch to video is already broke inside some how , it just slides instead of locking into position and screen tried to come off with it in my wifes hands !!! All I wanted was a return and they wont even do that.....SAVE YOUR MONEY PEOPLE !!",
      "rating": 1.0,
      "verified": true,
      "author": "STEVE EASTMAN",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Love this camera",
      "text": "This is my first Sony digital camera that I ever bought. I was always been a Canon fan, but after breaking down my third Canon camera in a row, I do not want to buy Canon any more. I was always hesitant to buy Sony due to the memory card comparability. But this camera takes regular SD/SDHC cards, and I am glad that I bought it. I really like the powerful flash, faster shutter speed, great low light performance with in auto mode is a big plus. It is very compact, and yet has 5X zoom. I like the video smoothness as well. Can not expect anything more than these features for a point and shoot compact camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Madhu",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Great Camera",
      "text": "As a professional photographer, I am pretty picky when it comes to cameras. I bought this for an upcoming trip, as I don't want to haul my DSLR all over Prague. I've only played with this camera for a few hours, but the photographs look awesome! I'm usually not a fan of \"in camera effects\", but I am loving some of the extras that this camera comes with. The only downside is that you have very little control over the settings, but the camera is smarter than even most professionals the majority of the time anyway. If you are looking for a camera that takes great pics and fits in your pocket. This is the one!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Pack",
      "helpful_votes": 0,
      "publication_date": 20130614
    },
    {
      "title": "Great pics, but thank God for the tip I ...",
      "text": "Great pics, but thank God for the tip I found about pushing the on button w/out the battery inserted; otherwise it wouldn't work / charge.",
      "rating": 4.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "... impossibly to take well -- my iPhone takes much better panorama",
      "text": "I have retired this camera after having used it a few years -- only fault is the panorama pictures are almost impossibly to take well -- my iPhone takes much better panorama photos",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Petersen",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Great, Camera, Great Price.",
      "text": "I did a lot of research to find a digital camera with a macro setting and high pixels—this is the one! It's slim and lightweight. The picture quality is terrific. The price is awesome. I had a Coolpix but this camera is so much nicer for the less money. I would definitely recommend this camera if you're in the market.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa1981",
      "helpful_votes": 0,
      "publication_date": 20130702
    },
    {
      "title": "Good value",
      "text": "After reading the reviews I was a bit concerned about the lens issues. However, I decided to give it a try. I have it for 2 months now and love it. Pros: HD recording (awesome); Zoom while recording; Small size; Cons: If you zoom a picture after it was taken, it does looks blurry (like a painting); In my opinion, it's the best point and shoot type of camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Claudio",
      "helpful_votes": 0,
      "publication_date": 20130122
    },
    {
      "title": "This camera tipo really nice photos! Very easy to use",
      "text": "This camera tipo really nice photos! Very easy to use. I used this for the past 3 years and I really enjoyed it! Would recommend it but here is probably a newer mode at this point",
      "rating": 5.0,
      "verified": true,
      "author": "Nate Kelley",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Four Stars",
      "text": "Nice camera for the price. Has rotate, zoom, and crop features.",
      "rating": 4.0,
      "verified": true,
      "author": "Evon",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Excellent camera!",
      "text": "I bought this for my mother. She is not a technology fan, however now she is into her new camera. She takes it everywhere and has easily learned to take nice pics. The resolution is awesome, the image quality is impressive. All the features are excellent. Sony is just the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Santamaria",
      "helpful_votes": 0,
      "publication_date": 20131224
    },
    {
      "title": "This camera is great so versatile and quality of images so good",
      "text": "Greta camera, had same one before my wife dropped it, and it died !!!!! This camera is great so versatile and quality of images so good, we will always try to use Sony cameras in the future. BB",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G. Brown",
      "helpful_votes": 0,
      "publication_date": 20141001
    },
    {
      "title": "An investment. A purchase that I'm proud of.",
      "text": "After a few years I still use this! In the age of camera phones this thing is such a step above without breaking the bank. I wanted cleaner shots and HD video. I wanted to take photos I could frame and shoot videos I could watch over, not just retire them them to an online album I'd never see again. The photos are clear and sharp, the video is sooooo nice. I have no need to buy another camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Montero",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "not even 3 months old and button broke!",
      "text": "I like the camera, still works in regular camera/picture taking mode, but the button that switches between panoramic (which I never even tried to use), still and movie no longer works. What's up with that!!!!!!!!!!!! Now I have to try to get it fixed, I suppose... YUCK.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130814
    },
    {
      "title": "Five Stars",
      "text": "we love this camera - it has given us great service and excellent pictures",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Burns",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "I am neutral due to out-of-box failure",
      "text": "The battery must be defective because after charging it twice according to directions, the camera lasted for 1-3 shots taken in succession then just turned off. No real help from original seller, Amazon won't replace, only return this type of item. Since I purchased it using \"points\", I assumed a nightmare to execute an exchange so had to return it to Sony for warranty repair/replacement. Very inconvenient and annoying!! PS This camera model was recommended to me by a professional photographer. When the commotion settles, I am looking forward to a better experience.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130815
    },
    {
      "title": "Pleasant surprise",
      "text": "Over the past few years we have owned a number of lower priced digital cameras. This one is by far the best, both in ease of use and quality of pictures. The zoom is better than most. We are going to buy another like it, for his and hers cameras, since we often aren't in the same place at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Great camera",
      "text": "Love this camera--beautiful, high quality pictures and really easy to use. Love the intelligent auto setting so that the camera adjusts settings based on what it recognizes in the frame (i.e. portrait, landscape, etc.). Fast shutter speed and great battery life.. The battery can be charged with a micro-USB which is easy as well. Also, the panoramic setting and 3-d filming is nice but not necessary. Great camera for a great price--the fact that is' the 2012 model doesn't make it a bad camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Veena",
      "helpful_votes": 0,
      "publication_date": 20130408
    },
    {
      "title": "Sony Cyber-shot DSC-WX50",
      "text": "I needed an affordable compact digital camera for the wife and I, and this camera is a great combination of ease of use for her and still has the serious control settings I like. I think the picture quality is very good for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20130705
    },
    {
      "title": "Perfect for Price",
      "text": "Small. Light. Durable. long lasting battery. charges off phone chargers cable. great photos everytime. easy to use. great on the fly editing system. Hurst me to say all this i hate sony but i really cant say one thing bad with it. sorry",
      "rating": 5.0,
      "verified": true,
      "author": "BikingBerk",
      "helpful_votes": 0,
      "publication_date": 20131029
    },
    {
      "title": "I was hoping that this camera would work better when full zoomed",
      "text": "I was hoping that this camera would work better when full zoomed, but the lens and/or the sensor really can't handle anything over a half-way zoom. Un-zoomed, and with a decent amount of light to work with, the camera works very well. It also takes decent night-shots, and the video is pretty impressive for a camera this inexpensive.",
      "rating": 3.0,
      "verified": true,
      "author": "Crito",
      "helpful_votes": 0,
      "publication_date": 20140923
    },
    {
      "title": "Great camera",
      "text": "I bought this camera for my parents, who are older and wanted something easy to use and portable. It takes great photos and I often can't believe they weren't taken with a larger camera. Easy to use and great results.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20150628
    },
    {
      "title": "Better than Cannon Powershot",
      "text": "Love this point and shoot- small enough to fit in my pocket and my husband is willing to carry it in his when I don't have one. Great lens- Carl Zeiss. I have small children and my camera phone just isn't sharp enough for pictures with fast-moving subjects. This camera satisfies my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis Leonard",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "Smaller than expected but SUPERB photo quality",
      "text": "This camera is so easy to use. I've used it on a tripod and free-hand...picture quality is equal because the Sony Cyber-shot has a photo stabilization feature. I REALLY like the USB photo transfer capability.",
      "rating": 5.0,
      "verified": true,
      "author": "RetAF",
      "helpful_votes": 0,
      "publication_date": 20131008
    },
    {
      "title": "For point and click users",
      "text": "This is a great point-and-click camera. Great for the person that needs a picture in a jiffy and does not want to carry a bulky camera around. When we print the pictures out, we cannot tell that it was from a point-and-click camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Daigoo",
      "helpful_votes": 0,
      "publication_date": 20130413
    },
    {
      "title": "Love it...no regrets",
      "text": "I chose this for the mp rating and I have been completely satisfied. The pictures are great quality. It's also user friendly for the most part because I'm no techie. I would highly recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "LiveLife",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "Too New",
      "text": "Camera arrived few weeks ago but has not been tested enough to rate fairly. The order came quick and I like how it is easy to follow and figure out. Need to use more to really give true rating. Happy so far.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Thomas",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Excellent Compact Point and Shoot Camera",
      "text": "This is an excellent compact, point and shoot camera, doesnt have much zoom, but it is good for compact model. Camera can he held in pant and shirt pockets and easy to carry. Has many good features that fits for this low bill. If you need compact and 5x zoom is enough for ur need, this is a good choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Arunjunai Naresh Varadharajan",
      "helpful_votes": 0,
      "publication_date": 20130303
    },
    {
      "title": "The camera is excellent, but even more than that Sony has provided ...",
      "text": "The camera is excellent, but even more than that Sony has provided superb customer service. They fixed and replaced broken parts after I dropped it at an amusement park for no charge. They were aware the damage was totally due to me and not a defective product, but they performed the extensive repairs anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Cary M Wise",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "LOVE this camera!",
      "text": "I know, smart phone cameras are the thing now; but I don't use a smart phone! The date and panorama features on this camera ROCK! Great photos and durable camera!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Evans",
      "helpful_votes": 0,
      "publication_date": 20140317
    },
    {
      "title": "Quite good. The picture quality could be better",
      "text": "Quite good. The picture quality could be better, but the small size makes up for it, because it makes to possible to fit this camera to almost any jacket pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "Soheil G.",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "bought 3 of them",
      "text": "One for own usage one year ago, when it was like $180. Two as gifts, for family members, $110 around. Neat and pretty. Good pictures taken easily. It indeed has one shortcoming, slow to power on/start to shoot, as it need two or three seconds to pop out the lens. So you cannot reply on it as fast shooter.",
      "rating": 5.0,
      "verified": true,
      "author": "elden2010",
      "helpful_votes": 0,
      "publication_date": 20130601
    },
    {
      "title": "Now my daughter has a nicer camera than I do.",
      "text": "Bought this for my daughter as a starter camera. Easy to use, easy to navigate menus, and takes great pictures. Totally worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Newman Smith",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "simple fun and great photos",
      "text": "bought this for my son and he is loving it. It's very small an yet takes a great photo. simple to use with some fun features. wish they offered option to buy case for it and memory card all at once.",
      "rating": 5.0,
      "verified": true,
      "author": "jmg",
      "helpful_votes": 0,
      "publication_date": 20130621
    },
    {
      "title": "Best camera even to this day for it's size",
      "text": "Best small camera I have ever used 1080 video is mind blowing for such a small camera. see this video",
      "rating": 5.0,
      "verified": true,
      "author": "Tp",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Great Pictures, But!",
      "text": "Takes terrific pictures, no matter what the weather conditions are like or how much light is on the subject. But the battery does not hold out for a long day's photography and it will fail you just as you find the shot of a lifetime!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Calhoun",
      "helpful_votes": 0,
      "publication_date": 20130926
    },
    {
      "title": "Great Camera!",
      "text": "This camera is one of the best Point and Shoot cameras i've ever used! It is a 100% better than my old Nikon Coolpix S4000! By the way the Nikon was a bad camera. Would buy again if this one broke! Great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary Beland",
      "helpful_votes": 0,
      "publication_date": 20130306
    },
    {
      "title": "it's smart VS Cheaper price",
      "text": "It's small like size credit card. It's smart, and it has a nice zoom. It has one problem about take a picture in night. the photo isn't clear. the price is cheaper for me",
      "rating": 5.0,
      "verified": true,
      "author": "Felemban,Ahmed",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "very nice camera for price",
      "text": "best point and shoot camera i have ever owned, tons a features and very good picture quality i would recommend it to anyone looking for a small and affordable camera",
      "rating": 5.0,
      "verified": true,
      "author": "Wolf",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Extremely Great Use and Quality",
      "text": "You Will Not Be DisSatisfied. Worth The Buy. Extremely Great Use and Quality. Coming From A Guy Who Also Owns a DSLR.",
      "rating": 5.0,
      "verified": true,
      "author": "Lover Boy",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "Great for the money and amazing shots",
      "text": "I recommended this camera and so far the pictures come out great. Low lighting is also a plus just don't shake when taking the shot. Very easy and would recommend to any parents with kids.",
      "rating": 5.0,
      "verified": true,
      "author": "J Genao",
      "helpful_votes": 0,
      "publication_date": 20130327
    },
    {
      "title": "Would like one that took less time to focus",
      "text": "Nice camera, takes good photos but it takes time to focus properly for better photos. I just want a camera that is easy to use.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandie",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Fantastic Product for the money...",
      "text": "Great size, pictures and uses zeiss lens. Perfect for travel, easy to use and would recommend to anyone looking for a good camera and product. Use photo's on professional book covers. love the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gypsygirl",
      "helpful_votes": 0,
      "publication_date": 20130503
    },
    {
      "title": "It's working really good far away",
      "text": "I always buy second hand cameras, I love this one, it's a really good camera and it's almost new I mean it has no scratches at all and it works perfectly! I am glad to get this product!",
      "rating": 5.0,
      "verified": true,
      "author": "AngelicaMoya",
      "helpful_votes": 0,
      "publication_date": 20130607
    },
    {
      "title": "Great camera for the price",
      "text": "Great camera. Low light is good, not quite as good as I expected after reading reviews but still above average. Video is excellent. Pics look great. Minimal shutter lag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy R",
      "helpful_votes": 2,
      "publication_date": 20130216
    },
    {
      "title": "Functions Fine",
      "text": "Functions fine however does not come with the micro USB cord required to hook the camera up to your computer so make sure you purchase that separately (unless you plan on just popping out the memory card and inputting it directly into your computer.)",
      "rating": 4.0,
      "verified": true,
      "author": "Randy Deltuva",
      "helpful_votes": 0,
      "publication_date": 20130707
    },
    {
      "title": "Clarity Issue",
      "text": "I am happy with my pictures of scenery as I just returned from vacation and they all came out fairly well. However, all the photos I take of my grandchildren seem to be fuzzy looking . I've tried Intelligent Auto and Superior Auto and I'm still not satisfied with the results. I even stopped using the flash. Any suggestions for best settings? (also used soft skin effect as I don't know which other option would be best for portraits)",
      "rating": 4.0,
      "verified": true,
      "author": "K. Butler",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "Easy to use",
      "text": "This is a excellent camera, compact, easy to manipulate. The pictures are clear, even when in motion. It's fun to view the multi shots, almost like a movie. great for travelling.",
      "rating": 5.0,
      "verified": true,
      "author": "wtdsdd",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "not good",
      "text": "very disappointing - it broke soon after receiving it. very flimsy, but other reviews all seem to love it so maybe its just me and if i hadn't dropped it onto concrete from 20 ft it would still be ok?",
      "rating": 1.0,
      "verified": true,
      "author": "Lawrence in Arabia",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Nice Camera",
      "text": "Nice Camera, still learning all the options, there are lots. There was an issue with delivery, they had no black in stock and emailed me to let me know there would be a delay unless I wanted another color. Once mailed there was issue b/c no weekend service so, took some time to get the camera but, well worth the wait.",
      "rating": 5.0,
      "verified": true,
      "author": "cindylu",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "My new camera",
      "text": "Got my camera and was extremely pleased with it. I would recommend it to anyone that wants great pics and small size that you can carry in your pocket. Love, love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130117
    },
    {
      "title": "Love it!",
      "text": "I've only had this little guy for a couple weeks, but I love it! It fits very easily in the palm of my hand and is portable without sacrificing quality. There are a ton of settings that I had to play around with first and I'm still getting the hang of it, but the pictures have great definition and color. I can't wait to travel with it! Update: I've had this camera for over a year now and I still love it. While I end up taking more pictures with my smartphone for convenience now that I have one, the \"soft face\" setting on this Sony is still unbeatable for pictures of group outings!",
      "rating": 5.0,
      "verified": true,
      "author": "Beetowa",
      "helpful_votes": 0,
      "publication_date": 20130710
    },
    {
      "title": "amazing piece of technology!!!",
      "text": "This camera is amazing!!!!! Such a wonderful value for an awesome piece of technology!!! many different settings to choose from, I just keep it on auto detect and it knows what to do..... everything is clear, amazing print quality!!!! love this camera sooooo much!!!! a great investment for me!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "@robynlovescrafts",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Sony Cyber-shot DSC-WX50 16.2 MP Digital Camera with 5x Optical Zoom...",
      "text": "I bought this as a gfift, but my parents really seem to like it. They say it switches from still photos to video with the touch of a button, and the qaulity is quite good. For the price and available features, I don't think you couyld do any better.",
      "rating": 5.0,
      "verified": true,
      "author": "jeffsteele",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "Works Great",
      "text": "This takes really good pictures and a very good battery life. With the mini usb I can charge the camera with my phone cord. The buttons are kind of small.",
      "rating": 5.0,
      "verified": true,
      "author": "toobad",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Good pics, a little bulky",
      "text": "In this day and age of slimmer and lighter is better, this camera is a bit bulky. However, it takes great pics and has a 3D function as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Evette",
      "helpful_votes": 0,
      "publication_date": 20130509
    },
    {
      "title": "Worth every penny",
      "text": "After comparing a lot of products, I settled with this camera. After using it for a couple of months, I'm really glad that I went with it. I think it's best my <$200 could buy. It has very good in low light; I have never had to use the flash at all! What I think is missing - it's just 5x zoom; I wish it was a little faster in clicking the pictures in auto mode. But, hey for $200 - I really can't complain. :-) Overall, I'd buy this again!",
      "rating": 5.0,
      "verified": true,
      "author": "lobo",
      "helpful_votes": 4,
      "publication_date": 20120715
    },
    {
      "title": "Very Nice camera loaded with feautures BUT....",
      "text": "I ordered Black and they gave me silver i know ... its not a big deal but comeon can't you get the color right? aside from that I love this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Regis",
      "helpful_votes": 0,
      "publication_date": 20130713
    },
    {
      "title": "Tiny and pwoerful- like my brain.",
      "text": "Very happy with the feature set on such a teeny camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Sir Real One",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Sony Cyber-shot DSC-WX50",
      "text": "I decided to purchase the \"Sony Cyber-shot DSC-WX50\" after watching a review on \"c-net.com\"; These Sony Cyber-shot is simple to use and affordable.",
      "rating": 4.0,
      "verified": true,
      "author": "Game Addict",
      "helpful_votes": 0,
      "publication_date": 20130625
    },
    {
      "title": "Five Stars",
      "text": "all excellent, I loved the product is genuine and I do not get battered box",
      "rating": 5.0,
      "verified": true,
      "author": "bosley rodriguez",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "GREAT PHOTOS!",
      "text": "I was looking for a point and shoot camera that doesn't compromise picture quality. Took this to Italy with me and was able to capture all the intricate details and myriad of colors at the Vatican, Basilicas, and Pantheon like I have never experienced with other cameras. I was so happy with this product especially considering the affordable price. Definitely a GREAT BUY!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130621
    },
    {
      "title": "Camera Sony",
      "text": "Excellent in all aspects. Takes beautiful pictures and am very pleased with this purchase as it lived up to all expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "George J. Carroll",
      "helpful_votes": 0,
      "publication_date": 20120608
    },
    {
      "title": "Best pics",
      "text": "I bought this camera for my wife and she loves it. I also purchased a hx 200 v a couple of weeks later. Sony out does my Nikon L810.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130528
    },
    {
      "title": "Great camara",
      "text": "This camara was suggested to me and now I recommended to everyone - I love it - its easy to use and the photos are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha",
      "helpful_votes": 0,
      "publication_date": 20131027
    },
    {
      "title": "Great camera!",
      "text": "As ratings state, this is a little camera with a lot of good features...like the WX9. Takes great pictures and is fast. Controls are small but can be worked effectively.",
      "rating": 5.0,
      "verified": true,
      "author": "koyamike",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "great camera! affordable price!",
      "text": "I bought this camera as a gift for my mother in-law. before we give it as a gift my wife open it and make some testing. we both amazed because this camera can take a great picture like those more expensive model camera. I recommended this camera... very sharp and affordable camera.",
      "rating": 5.0,
      "verified": true,
      "author": "UGYN",
      "helpful_votes": 0,
      "publication_date": 20130525
    },
    {
      "title": "Look elsewhere",
      "text": "My very old Sony camera was terrific. This not so much. It works, but the quality of the shots don't compare to my old cybershot.",
      "rating": 2.0,
      "verified": true,
      "author": "alice a shulman",
      "helpful_votes": 0,
      "publication_date": 20130713
    },
    {
      "title": "Love it",
      "text": "I love the panaromaic (I know I misspelled it sorry) view and I love how its easy to use! I am still getting used to it but I love it regardless. I buy Sony camera every time",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Balsley",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "Great camera and video recorder",
      "text": "I love this camera. Really easy to use and it takes excellent pictures. The video on the camera is great. It's nice to not have to bring a camera and separate video recorder to events. Other things I like: *excellent zoom *photos in poor lighting come out amazingly well *camera is really small Only one little comment, sometimes in darker environments, the auto focus unfocuses while video taping. It did this at my daughter's band concert. The sound is still good but the video comes in and out. It was dark in the audience and I think that confuses the auto focus.",
      "rating": 5.0,
      "verified": true,
      "author": "skier",
      "helpful_votes": 4,
      "publication_date": 20120512
    },
    {
      "title": "excellent",
      "text": "Love the camera and am getting better working I was surprised there was not instruction manual with how to use the camera in every mode",
      "rating": 5.0,
      "verified": true,
      "author": "Amaz",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Great for the price!",
      "text": "The pictures this camera takes are beautiful, it has several options to ensure that the picture will be great. Combined with a good flash memory card it records great HD videos. This camera is great and cheap!",
      "rating": 5.0,
      "verified": true,
      "author": "-=®=-",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Really small so is nice for traveling",
      "text": "Haven't used it, as is meant for a trip overseas we're taking soon. The ratings on this camera were found to be excellent on more than one site for it's review, which for us, means it's worthy. Cost was a factor too, and the Cyber Shot is well within our budget limits. When comparing this to other small camera's at Best Buy & Costso, the value is evident as competitor camera's range to be about 30-50% higher in price. Am not very tech savvy so ease of use was important, and this camera fits this need.",
      "rating": 4.0,
      "verified": true,
      "author": "Catherine O",
      "helpful_votes": 0,
      "publication_date": 20130527
    },
    {
      "title": "Sony Cyber-Shot camera",
      "text": "This is a great compact camera with many shooting options. The pictures are crystal clear and sharp. I love this little camera.",
      "rating": 5.0,
      "verified": true,
      "author": "trvlrsdtra",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "I love it!",
      "text": "This camera is the best money I've ever spent on a camera. It takes crisp pictures and it's really easy to use. It has a lot of cool options that I will probably never use, but it's always fun to know they're there. This also takes awesome videos. You can shoot in HD and get a really great quailty video. I use this to shoot youtube videos, so it does the job I need it to do. I highly recommend this!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 3,
      "publication_date": 20130212
    }
  ],
  "product_meta": {
    "title": "Sony Cyber-shot DSC-WX50 16.2 MP Digital Camera with 5x Optical Zoom and 2.7-inch LCD (Silver) (2012 Model)",
    "description": "Color:SilverGet a mountain of shooting power that fits in the palm of your hand with this compact, easy to use Cyber-shot(R) DSC-WX50 digital camera. Packing 16.2 megapixels, capture frame-worthy, high quality still images of all your adventures. Get close to the action with 5x optical zoom and 10x Clear Image zoom which doubles the optical zoom for closer, clearer pictures. Photos not enough for you? Try the Full HD 1080/60i movie mode to capture compelling video wherever you wander. And with an \"Exmor R\" CMOS sensor, take advantage of outstanding low-light performance for brilliant, balanced images even in darker settings. Optical Image stabilization with improved active mode 3D Still Image and 3D Sweep Panorama mode Intelligent Sweep Panorama HR mode for one shot landscapes in high resolution Background Defocus highlights your subject like a DSLR Picture Effect for more expressive photos Superior Auto; awesome shots, automatically Face Detection and Smile Shutter technologies Anti-blink, Face Priority and Red-eye Reduction functions Soft Skin mode reduces visible blemishes, and wrinkles iSCN detects 33 scene conditions and adjusts camera settings Natural Flash corrects color balance for lifelike shots Motion Detection suppresses blur in people and other subjects Sweep Multi Angle technology for 3D-like view on the camera's LCDSpecifications Imaging Sensor - 1/2.3 Exmor R CMOS Sensor Processor - BIONZ Effective Picture Resolution - 16.2MP Lens Type - Carl Zeiss Vario-Tessar Optical Zoom - 5x Focal Length (35mm equivalent) - Still 16 - 9 - 28-140mm / Still 4 - 3 - 25-125mm / Movie 16 - 9 - 29-145mm / Movie 4 - 3 - 35-175mm Image Stabilization - Optical SteadyShot(R) with Active Mode Image Stabilization LCD - 2.7 Clear Photo LCD (460K dots) ISO Sensitivity - 100 - 12800 Flash - Built-in Media - Optional MS DUO/PRO Duo/PRO-HG Duo & SD/SDHC/SDXC media Still",
    "rating": 4,
    "feature_bullets": [
      "2.7 inch LCD display",
      "5X optical zoom",
      "16.2 megapixels",
      "Full HD 1080/60i with dual record of stills and movies",
      "Picture Effect for more expressive photos"
    ],
    "specifications": {
      "Product Dimensions": "3.62 x 0.75 x 2.05 inches",
      "Item Weight": "4.2 ounces",
      "ASIN": "B006K554BE",
      "Item model number": "DSCWX50",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.0 out of 5 stars286 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#222,948 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 20, 2012",
      "Manufacturer": "Sony"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}