{
  "website_summaries": [
    {
      "verdict": "Basic but efficient device approved by the British Allergy Foundation.",
      "pros": [
        "Three -peed machine with HEPA filter removes 99.97% of airborne particles",
        "Filters can be cleaned and reused",
        "Rated for 55 sq",
        "m. per hour",
        "Simple operation",
        "Unobtrusive design, and easy to move from room to room",
        "Competitively priced"
      ],
      "cons": [
        "Some concerns over durability",
        "One or two reports of faulty motors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "10 out of 10",
      "text": "These are really good - I have breathing difficulties in November & December and (although my hairy dog sleeps in the same room) I put the bigger one of these near my bed & had the first good nights sleep I've had in months - 10 out of 10 - I now run one all night in the sitting room & one all day in the bedroom - hint - go for the bigger ones as they only need to run on a slower speed and hence the fan noise is quieter",
      "rating": 5.0,
      "verified": true,
      "author": "greybeard",
      "helpful_votes": 31,
      "publication_date": 20180114
    },
    {
      "title": "Sent Back",
      "text": "I can't say i'm overly impressed. I tried this for a week and noticed nothing at all. The filter seems really cheap and i can't see how it does what it suggests. The filters are also stupidly expensive to replace for what they are. There is no timer on this filter, so manual on/off It is not as quiet as it suggest, you can not have this in your bedroom and sleep When mine was turned off i heard a high pitched buzzing noise, sounds dangerous so had to turn off at the mains. The above concerned me a little as I've read on how a few have burnt out. So yes, item sent back.",
      "rating": 2.0,
      "verified": true,
      "author": "Mr G",
      "helpful_votes": 15,
      "publication_date": 20181003
    },
    {
      "title": "Great dust extractor, air feels clean",
      "text": "Great dust extractor. Been using for some time now - when it comes to cleaning the filter it's very evident this product works. If left on during the day, the room it's in feels clean to walk into. I am able to sleep with it on setting 1. Setting 2 is reasonably loud and setting 3 isn't pleasant if you are in the room. However it isn't to noisy if you are in another room - so you can leave it on high (3) during the day time and turn it down at night, if you are using in bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 21,
      "publication_date": 20161019
    },
    {
      "title": "Great Product",
      "text": "Product design looks very nice to be honest, on a lowest fan speed it's pretty quiet, the only reason i gave 4 star and returned this item is because i found out that HEPA Filter + Coil (Carbon) Filter does a much better price, so if Homedics will add a coil filter to this model as an update will be really great",
      "rating": 4.0,
      "verified": true,
      "author": "ShoppingEnthusiast",
      "helpful_votes": 64,
      "publication_date": 20170712
    },
    {
      "title": "Ideal for asthmatics",
      "text": "I’ve purchased this model after scouring the internet for the most suitable air purifier to help my breathing issues. It has made a huge difference, it definitely clears the room of allergens etc, and has had a positive affect on my personal breathing condition, I highly recommend it to others, also, it is excellent value for money, no need to be spending in excess thinking the product is superior, this product performs the same duties at a fraction of the cost, economical on electricity also.",
      "rating": 5.0,
      "verified": true,
      "author": "M J Burke",
      "helpful_votes": 57,
      "publication_date": 20181219
    },
    {
      "title": "Relief within 2 hours",
      "text": "My Asthma and my partners C O P D has improved since having 2 of these and TV's don't attract much dust any. If you get a pet and find you are allergic get a couple of these before thinking of rehoming. It has been in the news about indoor pollution so these could answer along with using natural cleaning products.",
      "rating": 4.0,
      "verified": true,
      "author": "Libby",
      "helpful_votes": 6,
      "publication_date": 20190613
    },
    {
      "title": "its a good idea",
      "text": "my daughter has dust allergy, its in her room and she runs it when she remembers, but usually for a few hours in the evening, the lowest setting is fairly quiet. She feels it has improved air, but it is hard to tell how much. The main thing I like is that from comments here, you can just pull out the filter and shake it like mad outside or vacuum it. Some other brands need replacement ones, which is a hassle. I felt it was worth a try for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "buyerE",
      "helpful_votes": 3,
      "publication_date": 20190331
    },
    {
      "title": "Strange design",
      "text": "The air flow from this machine comes out of the back of the top, ie between the black top piece and the main body of the machine. There are no slots on the front, just indents. This seems strange, as the controls face in the opposite direction. That aside, it seems to do a fair job of eliminating odours from damp, but there's no other indicator of how efficiently it's working. Much prefer my previous buy, a Fluoreon, which is no longer available, but has a lot more features and is much quieter.",
      "rating": 3.0,
      "verified": true,
      "author": "awatomic",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Very Poor quality for 70 quid !!",
      "text": "Bought at the end of December 2017, had the system on maybe only 4 or 5 times, went to switch it on last week and there was no power to the unit, checked fuse but that was fine. Would I buy this unit again? I don't think so ...",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 7,
      "publication_date": 20180407
    },
    {
      "title": "Great for allergies",
      "text": "Fantastic bit of kit for allergy sufferers. I was coughing like I was smoking 20 a day for a few months (I don't touch them) After a few days felt so much better and would advise anyone to try air purifiers around the home, but they have to have a hepa filter. I suffer with pets, pollen, dust and dust mites and I am very pleased with my purchase. After this one bought a couple more varying sizes to fit the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise71",
      "helpful_votes": 58,
      "publication_date": 20170718
    },
    {
      "title": "Less dust and easier breathing.",
      "text": "One of the few large units at this price and I've noticed a huge difference to my breathing. I have house rabbits and the hay makes me wheezy and uncomfortable, and since this machine arrived I haven't had a problem. Also seems to be noticeably less dust around generally.",
      "rating": 5.0,
      "verified": true,
      "author": "Alsatian1",
      "helpful_votes": 2,
      "publication_date": 20190601
    },
    {
      "title": "Funny design, can be used as white noise",
      "text": "I bought this air purifier to help with my hay fever unfortunately I don’t feel anything different after few weeks of use. The design of this air purifier is a little funny to me, with clean air coming out from the side and the back of the machine instead of the top like it shown on the picture. The best thing (probably not the best for some) about this air purifier is that it can be used as white noise for kids to go to bed because it is a little too loud even on the lowest setting.",
      "rating": 2.0,
      "verified": true,
      "author": "Kyle Young",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Value for money but initial plastic smell from filter",
      "text": "Apart from the initial plastic smell from the air filter which I hope will wear off soon this works quite well and is value for money. I have a couple of other makes which were rather more expensive which work a bit better but you get what you pay for. Not yet had to obtain or change the filter so can't comment on that but it is easy to get to. I should have checked the measurements as it is a bit bigger than I imagined but not exactly large or unwieldy. As usual the length of flex assumes you have loads of sockets but not too much of a problem re positioning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Works For Hay Fever",
      "text": "My wife suffers with hay fever March - April each year. Bought one a few years ago for the bedroom and this year another for the kitchen. Whenever my wife sits in those rooms she has little to no symptoms. You might want to consider placing it on a work surface/desk. It seems to work better when off the ground which I believe is how they suggest you use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Thomas",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "10/10",
      "text": "I have asthma and also am prone to chest infections. I live in an area where the noise prevents me from having the windows open at night. I therefore get too warm and more importantly have no fresh air entering my bedroom. This Purus product solves all these problems allowing me to have a healthy nights sleep. I really think this will help me considerably.",
      "rating": 5.0,
      "verified": true,
      "author": "luke wong",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great.",
      "text": "This is a great air purifier. I live in a small flat, and my boyfriend smokes, and I can say this has made such a difference. Even my neighbour noticed. I leave it on 1 all day, and it hasn't made much of a difference to my electricity bill either. O.k. on no. 3 it isn't noisy, but you can obviously hear it, but it's swings and roundabouts for me. I can hardly hear it on no. 1 anyway. If you want total silence, put up with the muggy air. Or, open and window, which I do every night in the bedroom.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. C. A. Evans",
      "helpful_votes": 3,
      "publication_date": 20160102
    },
    {
      "title": "Loud and Bulky",
      "text": "Personally I find that the device is very loud for the volume of purified air it outputs. Understandably it's a bulky unit but for the size of the inside fan it feels unjustified. I personally believe it works well on the highest speed (3) but you'll find it disruptively loud if having a conversation.",
      "rating": 2.0,
      "verified": true,
      "author": "c_jamesn",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Fantastic!!",
      "text": "My hubby suffers badly from a variety of allergies, but has found this product to be a godsend. It’s extremely lightweight & easy to use. Reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P. Carroll",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Not too great",
      "text": "This is not so great bought two and does not catch much dust. i opened the filter nothing. I used it for a few months. look sleek, portable, nose wise high setting it quite s loud on the low setting its ok but still a little noisey. if you get one try ones with carbon filter(sound like a maraca when shaken), a sort of mesh filter and a cotton like filter. so three filters. this one has one mesh like filter and you cannot wash cause out bit made out of cardboard.",
      "rating": 2.0,
      "verified": true,
      "author": "Mohammed Ruhel Amin",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Disingenuos descriptor",
      "text": "1. It is marketed as a 'Professional' unit - it then says in the blurb it MUST NOT be used for Professional services, so why use that product descriptor? 2. 'Super quiet' great for the bedroom (on setting #1). It is quiet, but not super quiet on setting #1. If you use (need) #2 or #3 it is at an acceptable level. Apart from those two caveats it is well constructed and easy to operate",
      "rating": 2.0,
      "verified": true,
      "author": "Rev. Norman E. Vivian",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Amazing",
      "text": "Total amazing. My daughter has many breathing issues so it hard for her to get a good night's rest but in one night of using this equipment she not only slept peaceful but no sneezing and irritations in the morning. Amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Friend thinks it's amazing!",
      "text": "I purchased this for a friend who lives in a studio flat and he said its perfect for getting the moisture levels down due to his windows not being able to open. He absolutely loves the little device and he wants me to get another one for him.",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Hayfever",
      "text": "I purchased this purifier in the hope of helping clear my hayfever symptoms during the night. I turn it on about an hour before i go to bed and leave in on full power then turn it off before i get into bed. The 4star is for the noise, on the lowest setting it does still make a fairly loud air con sound so therefore im not able to sleep with it on. But i have def noticed a difference when i wake up with my hayfever, my eyes arent itchy and my nose isnt blocked! I also feel like i can breathe better lol. So i think its been a good investment :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180618
    },
    {
      "title": "Amazing product. I was suffering of a severe cat ...",
      "text": "Amazing product. I was suffering of a severe cat allergy and 2-3 days after using the air purifier every evening for a couple of hours my allergy has dissapeared. It is very silent and reasonable size. Highly recommendable",
      "rating": 5.0,
      "verified": true,
      "author": "Pablo",
      "helpful_votes": 9,
      "publication_date": 20161120
    },
    {
      "title": "After 1 year switch not working well",
      "text": "It's ok... But needs to have a timer on it really. I've also noticed that after just over a year, the switch on the top has stopped working properly. It's also quite bulky and heavy.",
      "rating": 3.0,
      "verified": true,
      "author": "Emily Collinge",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Dose have to be left on for quite a while for full affect",
      "text": "Use this to help with my sleeping, as I do suffer from dust. It has to be left on for most of the day to get full affect and move it around the bedroom, but I have found it useful. For myself it is a little too load to be able to sleep with it on, but it is not very loud even at the high setting.",
      "rating": 4.0,
      "verified": true,
      "author": "Davis",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Well made product",
      "text": "Not really sure is this is actually catching any of the micro fibers tgat float in the air as so far the filter is completely clean. I think this may end up as one of those fad buys like a juicer.",
      "rating": 4.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "The manual supplied was pathetic! How to turn it off and on",
      "text": "I bought this item as my child has many allergies related to dust mites and pollens. The manual supplied was pathetic ! How to turn it off and on. and off, I could have worked that out without the manual.. No details as to the setting strength, duration etc How do I know whether this is helping my child? PS Does this unit turn itself off when the air is clean enough or does it turn is self off when the unit cannot cope with the air level in my location? All advice greatly accepted",
      "rating": 5.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Money Well Spent!!",
      "text": "Honestly speaking it's a decent machine. It's easy to use and cleans the air at a fairly rapid pace. In regards to the size, the machine is quite big (bigger than an Xbox One X). I've opted to buy the extra filter at later date because of how frequently it was going to be used within my household (£20-25 not bad).",
      "rating": 5.0,
      "verified": true,
      "author": "GRAEME COOPER",
      "helpful_votes": 0,
      "publication_date": 20201029
    },
    {
      "title": "Great product",
      "text": "this was much bigger than i expected so it was a nice surprise . Noise is minimal and does not really distract me , the air in the room definitely feels cleaner and my sons allergies have eased a lot so all in all i'm pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Iris  Caveney",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Helped with hayfever",
      "text": "Spend days wondering whether to invest in this having suffered badly from hayfever when pregnant and not being able to take any medication. Can't say it made an instant difference but long term over the summer I definitely slept better! It does automatically switch off after a certain time period so you need to remember to switch back on, especially if you want to run it all day to keep the room clear. The highest setting is quite loud, but I had no issues sleeping with the noise on the lowest setting",
      "rating": 5.0,
      "verified": true,
      "author": "Sian Jones",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Great air purifier",
      "text": "Great air purifiers does what it says on the box keeps pollen away from my grandchildren normally they are sneezing by dinner time but haven’t have to give them antihistamines at all in the evening",
      "rating": 5.0,
      "verified": true,
      "author": "susan stevenson",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Didnt help allergies",
      "text": "Unfortunately this didnt make the slightest difference to me in my allergies, I sneezed just the same after using it for a couple of days. Will probably have to look for a more higher end model, I was just hoping to find something affordable. Clearly this is not the way to go.",
      "rating": 2.0,
      "verified": true,
      "author": "Veronika",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Great product",
      "text": "No remote control but it is a very good item and makes a difference with the air as it’s much cleaner and you can feel the difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynsey",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "You must buy one of these, help you breath so much easier",
      "text": "What a life saver, excellent item use it every single day. My son has massive allergies when he visits now it's safer. Air cleaner house fresher totally brilliant I want one in every room if I could afford it. A must in this warm weather. Clean the filter yourself none of buying a new filter every few months either. Best money I've spent in ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Gill Robson",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Simple to use, effective, cheap",
      "text": "Super simple to use and really quite effective. Air feels cleaner! Quite a large device and makes noise but easy to ignore once you get used to it. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "dvd",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Very good",
      "text": "My partner has mild allergy reaction to dogs which is cured by this product. Need to run it 24/7 btw",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Great product, delivered promptly",
      "text": "Great product, delivered promptly. We ordered this as my boyfriend was suffering from uncontrolable bouts of sneezing after moving to a new place. Since using this, it seems to have stopped. It's fairly quiet on level 1 and we an sleep with it. There is a strong blue light though which in my opinion is more likely to bother you. It's pretty noisy on level 3. But it does the job and I would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Bexx01",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Great for my hay fever",
      "text": "I use this in my bedroom to combat pollen and it does make a huge difference to how well I sleep and also how much of a reaction I have to pollen. Its a great product and works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Eden",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Honestly unsure if it does anything noticeable other than making ...",
      "text": "Honestly unsure if it does anything noticeable other than making a huge racket.... my room is around 5 x 5m and I don't seem to see much difference in dust particles floating in the air. Maybe a little when it is on full power (which means more sound)",
      "rating": 2.0,
      "verified": true,
      "author": "Haes",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Very noisy",
      "text": "I returned this item as it was so noisy. It did do a good job but I couldn’t handle the noise even on lowest setting.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy Woods",
      "helpful_votes": 2,
      "publication_date": 20191215
    },
    {
      "title": "It’s a bit to big",
      "text": "I would Say It does works But you have to keep It on the higher step and makes a lot of noise in This way. Otherwise, you can keep lower but the result are Not quite the same",
      "rating": 4.0,
      "verified": true,
      "author": "Mihaela R.",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "HoMedics air purifier the easiest thing to set up and use ever",
      "text": "I was just sat one day and noticed all the particles in the air swirling around when they entered the suns rays coming through the blinds , as I suffer with breathing problems I purchased this filter unit ,its easy to setup and use with 3 settings and has reduced the dust particles in the air ,",
      "rating": 5.0,
      "verified": true,
      "author": "MR JOHN AINSWORTH",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Good air purifier",
      "text": "I bought two or these. One two year ago and one recently for a new room. They’re good value for the price. I must say that after two years the first setting is not as quiet as it used to be. But as an air purifier I can tell it’s making a different as my allergy is reduced drastically when it’s on.",
      "rating": 5.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Amazing",
      "text": "This product is very effective because I bought it for the birds. I have had this for a long time now and is very pleasant with the results. It’s amazing to see on the filter the amount of dust it collects.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Quite easy to use for a better smelling room",
      "text": "Very easy to set up, if a little bigger than I had thought, very quite and in short time you can tell the air smells better, overall I have to say I’m very pleased would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Noisy!",
      "text": "This unit makes a high pitch noise on the lowest settings, you won't be able to sleep next to it if you are not wearing earplugs.",
      "rating": 2.0,
      "verified": true,
      "author": "Charliefox",
      "helpful_votes": 3,
      "publication_date": 20170405
    },
    {
      "title": "doesnt work after 2 years",
      "text": "this product hardly had any use - 3 weeks each year and only ever intermittent use - it does seem to sort out hayfever. After 2 'seasons' use, the unit does not power up. Warranty from homedics is only 2 years - I called them and they said they couldnt help. FEELING RIPPED OFF",
      "rating": 1.0,
      "verified": true,
      "author": "Rossell Edward James",
      "helpful_votes": 2,
      "publication_date": 20181009
    },
    {
      "title": "good for small roooms",
      "text": "I think that this works reasonably well in a small bedroom. I wouldn't depend on it for a large room or a very polluted environment, where a much more expensive and much bigger industrial scale unit is needed. For a small bedroom it seems to do the job if it is run continuously. It's too loud for me at night when I am sleeping, but so are all of the efficient units.",
      "rating": 4.0,
      "verified": true,
      "author": "PE",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "So far so good",
      "text": "It seems to be working. I am not sneezing as much as I used to. The Air Purifier seems to be very lightweight. If I were daft enough to drop it I feel it would crack. Having 3 dogs is a blessing in one sense but a confounded nuisance in another. Here's hoping the air becomes less hair free.",
      "rating": 4.0,
      "verified": true,
      "author": "N. A. Edmondson",
      "helpful_votes": 2,
      "publication_date": 20150912
    },
    {
      "title": "Good buy",
      "text": "bought for son's bedroom whi suffers with hayfever and have helped eased it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Excellent",
      "text": "Bought this for my son (for his bedroom),he is studying for his A levels. The recent high pollen count was making his life a misery eg, sneezing, runny nose, itchy eyes. This air purifier has been fantastic, his symptoms are greatly improved. His bedroom measures approx 2.5mx4m.",
      "rating": 5.0,
      "verified": true,
      "author": "Yan",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "LOVELY",
      "text": "Lovely does the job! Bought it on sale for £38 Can tell the difference in the bedroom. Nice clean and clear air.",
      "rating": 5.0,
      "verified": true,
      "author": "Lala Chen",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Not impressed",
      "text": "Can't see any difference to our air quality to be honest so wouldn't rush out to by it",
      "rating": 2.0,
      "verified": true,
      "author": "MyRubyRed",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Gratefully received",
      "text": "I bought this for my son and daughter in law during the very hot weather when they were suffering very badly with hayfever and having difficulty sleeping. They reported later to me that the unit had made a really significant difference and they were extremely pleased with it. No details re other features.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Excellent",
      "text": "Excellent! Use this every night and it helps us with our dust allergies and hay fever",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Great item!",
      "text": "I use this in two ways, firstly to clear the air in my bedroom as the dogs are hairy and sleep with me and secondly in the hot Summer I turn it round and use as a fan! Bonus!",
      "rating": 5.0,
      "verified": true,
      "author": "Maxine Hamilton-Wright",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Not much benefit",
      "text": "Bought this for my husband that has asthma, only used it for a while, its annoying shutting the door all the time to keep the air fresh. Even so did not see any benefit health wise.",
      "rating": 2.0,
      "verified": true,
      "author": "elaine",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Broke after two weeks",
      "text": "The speed setting is no longer working after just two weeks of use.",
      "rating": 2.0,
      "verified": true,
      "author": "MrB",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "seems to do the business",
      "text": "seems to do the business. best to put on after dusting surfaces to ensure unit will pull all dust from the air. it ain't gonna suction the dust from your surfaces and bed sheets, but no unit will do this sadly.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Me",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Air purifier",
      "text": "When working the output air has a smell. The body is plastic and seems somewhat overpriced. I wonder how long it will last.",
      "rating": 4.0,
      "verified": true,
      "author": "Binkydaminky",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Just 2 stars !!",
      "text": "Hmmm.....not really seen any improvment , its quite noisy ( you can t sleep with on )",
      "rating": 2.0,
      "verified": true,
      "author": "EleDbeauty",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Made no difference",
      "text": "To be quite honest I found no difference using or not using this device. Complete waste of money",
      "rating": 2.0,
      "verified": true,
      "author": "Queen Bee",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Promotes easier breathing.",
      "text": "This product is of great value in relieving the symptoms of a blocked nose and tight breathing due to hay fever. this is particularly so in the evenings and mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "P. E. Byng",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Review",
      "text": "I'm afraid that I bought one of these and it packed up within two months, suddenly making an abnormally loud noise and producing an acrid smell. I noticed another reviewer had cited the same problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr T",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Helps with dust allergy",
      "text": "Easy to use quality product. I purchased it for my son who is allergic to dust and usually wakes up with runny nose, and itchy eyes. Since using this product it has significantly reduced his symptoms. Highly recommended..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Quiet to sleep through",
      "text": "Low setting is quiet enough to sleep through. High setting is very powerful. Makes a big difference for our hayfever/allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "Cal",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Works great",
      "text": "I have been able to sleep in my bedroom for the first time in months without having to take an antihistamine and it has been great. Product has lost 1 star because of the noise.. I sleep with earplugs anyway so the low setting isn't a problem, but medium and high are louder than I can sleep with.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Love this. You will be suprissed what you breath ...",
      "text": "Love this . You will be suprissed what you breath in at your house. This sucks the fine partials in and clean air out. House feels fresh and Iv always got this on",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": ".",
      "text": "Easy to use and good and cleaning the air in the room from dust etc, it’s not a cooler",
      "rating": 5.0,
      "verified": true,
      "author": "Roy A. Shirran",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Does all it was promised to do.",
      "text": "Excellent performance and really made a difference to air quality in our bedroom. My wife struggled to breathe and we had to leave the bedroom door open, to ensure air circulation. With this purifier my wife no longer has trouble breathing and the door is closed!",
      "rating": 5.0,
      "verified": true,
      "author": "David A.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Slim, light and nice air purifier!",
      "text": "Slim and light and nice shape! Working well, giving fresh air, very low noise! 3 years warranty is great! Filter can be cleaned easily and don’t need to replace a new filter until year later which is good! Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good stuff!",
      "text": "Works great, I stopped waking up with a stuffy nose and sneezing",
      "rating": 4.0,
      "verified": true,
      "author": "Katie ",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Already broken.",
      "text": "Unfortunately after buying this in January 2016, it has broken already. It won't turn on when you press the button, and just sounds like the fan can't get going. So dissapionted, for a couple of months it's been fantastic for my hayfever. For the price paid I would have hoped it would have lasted a bit longer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160727
    },
    {
      "title": "HoMedics HEPA Air Purifier Fan",
      "text": "So far I am very impressed with this Hepa air purifier, the only downside I find with it is that it is a bit noisy",
      "rating": 4.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Dust Buster",
      "text": "Great air purifier, if you’re wanting to take away loose dust this is the product. Can be slightly noisy on setting 3 but it’s smoothing if you like sleeping with fans on.",
      "rating": 5.0,
      "verified": true,
      "author": "james",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "SUPER",
      "text": "Got for my mum she swears by it and got me one too",
      "rating": 5.0,
      "verified": true,
      "author": "SANDY. D",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Good machine",
      "text": "Easy to use. Pretty quiet. Has removed alot of dust so far",
      "rating": 5.0,
      "verified": true,
      "author": "Claire Timbers",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "but design looks good, not too noisey on 1st setting",
      "text": "just got, but design looks good, not too noisey on 1st setting. read review on it. to save filer costs put carbon cooker hood in front of filter, saves cleaning it too often, as will catch large air particles on the carbon",
      "rating": 4.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Bad, returning this and buying the tower version.",
      "text": "Filters air, but even at lowest setting it was loud and it turns off on a timer that you cant set. Bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Hamizan Amran",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Basic",
      "text": "A very basic machine easy to set up and operate but I haven't noticed any difference to my breathing and there is no way of knowing if it makes any difference to the air quality which is why I’ve rated it 1 star",
      "rating": 1.0,
      "verified": true,
      "author": "Mrs Joan Woodhouse",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "Does what it says on the tin",
      "text": "On lowest button,quiet,on the top button clears a room and makes it feel fresh and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "P.R.WRIGHT",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "okay but definitely not quiet in the slightest",
      "text": "I am going to test it out on my allergic daughter this evening to see if it makes a huge difference to her constant sniffing and sinus issues and will do a further update then. The only issue is it's quite loud and that's not what it says on the box",
      "rating": 4.0,
      "verified": true,
      "author": "Keely Hegarty",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "A good basic filter",
      "text": "Good for dust and things. Quiet, etc. Shuts itself off after like 12 hours - but OK.",
      "rating": 4.0,
      "verified": true,
      "author": "David ",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Its is quite enough and small enough. Not been ...",
      "text": "Its is quite enough and small enough. Not been using it for a very long time to see if air purification has helped with the allergies tho.",
      "rating": 4.0,
      "verified": true,
      "author": "J. E. A. Stratton",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Brilliant device and easy too use",
      "text": "Excellent for this warm weather.simple to get working to your needs",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Fitzpatrick",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Keeps the musty smell away",
      "text": "Our house isn't soggy but it functions well as an adjunct to drying clothes on the clothes horse when it's wet outside.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Zoll",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Love it",
      "text": "Love it. We use for more than a year, bought it when we bought a cat...and it's really great when you need to purify the air",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Slade",
      "helpful_votes": 0,
      "publication_date": 20190216
    },
    {
      "title": "I LOVE this air purifier and so do the other inhabitants ...",
      "text": "I LOVE this air purifier and so do the other inhabitants of my home.. it saved my dogs and partner from my wrath during allergy season :P. I was an absolute mess and nothing helped.. until this 'little' (though it is fairly compact and very light considering) wonder came along :). Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Silver Tongue",
      "helpful_votes": 2,
      "publication_date": 20150916
    },
    {
      "title": "great product that really does clean the air.",
      "text": "We have a bad dust problem due to the environment. The HoMedic air filter really does clean the air well and you can tell there are far less particles in the air when breathing. I was sceptical at how well these would work but was pleasantly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "redhotjag",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Very efficient against pollen",
      "text": "I've been using this product for quite a while, very easy to use, efficient against pollen. Totally recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "EnaC.",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Three Stars",
      "text": "Cant say it worked and cant say it didn't , thought it would have been more effective",
      "rating": 3.0,
      "verified": true,
      "author": "RGMac's",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Less fur around the room.",
      "text": "I put this under my cat tree, sooo much fur collected. Gentle breeze and very quite.",
      "rating": 5.0,
      "verified": true,
      "author": "PaulC",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Excellent",
      "text": "Purchased this air purifier after purchasing a smaller one that had great reviews, but this is far superior in every way, and for the extra £15 it was well worth the extra money. Quieter than the smaller one I purchased and does not keep me awake during the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Richardson",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Seems to be working well. Just took one star ...",
      "text": "Seems to be working well. Just took one star off because struggle as I may I have not been able to open the front so had to use it without checking filter. I don't know what I will do when the filter needs replacing. I am elderly, little strength in hands. If anyone has a simple way to open it please post your method. Thanks.",
      "rating": 4.0,
      "verified": true,
      "author": "shuku",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Great product recommended",
      "text": "Great product, really makes a difference. Bought this whilst our house is being decorated to reduce the dust in the air. The air feels noticeably clearer. Good also for reducing cat allergens (we have two).",
      "rating": 5.0,
      "verified": true,
      "author": "RS",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "not up to the job.",
      "text": "It does not purify the air - the filter is loose fitting, meaning that the air leaks around it, the cover is tricky to remove, and is very noisy, not satisfied at all",
      "rating": 1.0,
      "verified": true,
      "author": "david hindley",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "value for money",
      "text": "got this for my father. He is very satisfied and his sleeps are much better now. at the beginning i was looking for other brands which are way more expensive. I got this base on customer's feedback and they were right",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Five Stars",
      "text": "Just love this machine ,2 smokers in house and keeps the nasty smells away,would recommend to anyone.This is second one i have bought ,took one t my caravan",
      "rating": 5.0,
      "verified": true,
      "author": "christine edney",
      "helpful_votes": 2,
      "publication_date": 20150602
    },
    {
      "title": "Good basic air purifier",
      "text": "Very quiet on lowest setting but quite effective despite that. Nice design with easy access to the filters.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20200128
    }
  ],
  "product_meta": {
    "title": "HoMedics HEPA Professional Air Purifier",
    "description": "Ensure the air quality inside your home is as fresh and clean as possible with this slim line, discreet purification system. It removes airborne particles and allergens, tobacco smoke, dust, pollen, odour-causing bacteria and pet dander from the air, yet works so quietly that it can be used in the bedroom. Features 75 CADR (Clean Air Delivery Rate) Save money with its long-lasting HEPA filter: lasts up to five times longer than conventional filters For small rooms ( Room coverage of 11m² Professional HEPA filter removes up to 99.97% of allergens like pollen, smoke, dust, molds and bacteria Three air cleaning speeds; high, medium, low Filter check monitor lets you know when to clean (simply vacuum-clean) Ultra-slim profile looks great anywhere",
    "rating": 4.3,
    "specifications": {
      "Product Dimensions": "8.66 x 14.96 x 16.93 inches",
      "Item Weight": "8.47 pounds",
      "Manufacturer": "HoMedics Group Ltd",
      "ASIN": "B006ZKXIXK",
      "Item model number": "AR-10A-GB",
      "Customer Reviews": "4.3 out of 5 stars595 ratings4.3 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 5, 2014"
    },
    "categories": [
      "Refrigerator Magnets",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Kitchen Accessories",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}