{
  "website_summaries": [
    {
      "verdict": "A quality product at a good price, but not as efficient as some comparable molds.",
      "pros": [
        "Produces large, round ice balls",
        "A favorite of whiskey drinkers because they melt more slowly than traditional cubes"
      ],
      "cons": [
        "Can only make 1 ice ball per mold"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Whiskey Lovers",
      "text": "If you like whiskey on the rocks then you should get it. You would be surprised how many guests comment on the spheres when I bust them out. These spherical ice cube makers overall are a lot of fun. They’re pretty cheap and I really wish I purchased them a few years ago. Tip: You can get significantly clearer spheres of ice when You use boiled tap water before freezing. I love feedback so please let me know if this review was Helpful or not helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris M",
      "helpful_votes": 78,
      "publication_date": 20190528
    },
    {
      "title": "Works great when you follow YouTube left by another customer",
      "text": "Box had no instructions, but I went to the company's site on the box and saw YouTube video posted but another customer. My first batch was ugly because I'm an idiot and filled the water using the little hole in the top. That hole is for expansion people. Lol. Fill to the water line and place in freezer. It's just that simple. Let sit on counter a few minutes and it pops right out. if you run water over it, you'll cause cracks. Love this gadget. Highly recommend you use it and get it right the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Humphrey",
      "helpful_votes": 84,
      "publication_date": 20170419
    },
    {
      "title": "PERFECT !!! Works as advertised !!!",
      "text": "Fantastic product and works perfectly! I was skeptical because of the low price, but the results speak for themselves. Follow the steps exactly as the instructions say. Fill only to the line in the lower section of the mold, no more and no less. The first time I overfilled and the ball was out of shape also, as the instructions say freeze for ONLY four hours and no more. The only thing I did differently was to use distilled water and boil, let the water get to room temperature, fill the mold, then froze for the required time. Take a look at these photographs! I love this product and will purchase more from this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph B. McMullin",
      "helpful_votes": 36,
      "publication_date": 20200104
    },
    {
      "title": "Works just as advertized.  Great price, fun!",
      "text": "These spherical ice cube makers are a lot of fun. Given that they're pretty cheap, I really wish I had bought them earlier! I was able to get significantly clearer spheres of ice when I boiled tap water before freezing (I poured it into the mold while it was still hot). Try it - one without boiling, and one with boiling (I attached a picture of the A/B test I did above)",
      "rating": 5.0,
      "verified": true,
      "author": "dyanacek",
      "helpful_votes": 466,
      "publication_date": 20130814
    },
    {
      "title": "A Must",
      "text": "I was debating ordering these or getting the large square molds from a local retailer. I’m glad that I opted for these! The molds are very easy to use and produce amazing ice balls that have impressed all of the guests at our house. The only problem is that I bought only two so I have had to develop a routine to freeze and store in a container in my freezer to keep up with my increased demand during COVID quarantine 😊.",
      "rating": 5.0,
      "verified": true,
      "author": "TShepp",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Cracks and leaks in less than 3 months",
      "text": "Well a couple of days after I give this product an excellent review it cracks and falls apart. I bought this product on June 3rd and it’s cracks up and falls apart Sept 23rd. And Naturally After the Return period. So I no have to but another brand since this has a crappy warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe-Bama",
      "helpful_votes": 2,
      "publication_date": 20190921
    },
    {
      "title": "Works for the boat and ArV",
      "text": "I have three units and make solid balls in about twelve hours. So as long as I resupply daily, I can keep ahead of our needs for two cocktails per night. I really like these molds, but I have lost one that cracked from tapping on the counter top to remove ice from the mold. Ice to purchase is hard to find in the Bahamas so these ,eat my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "ZoeK",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "ice balls always crack, but not bad product for the price I suppose.",
      "text": "Granted I have crappy water in my area and I don't use a reverse osmosis system to clean my water, but I do use a triple stage filter system from PUR. but I cannot get a decent ball out of these. EVERY SINGLE ONE CRACKS while freezing. I've tried slightly under filling it, over filling it, boiling water and nothing works. I think it's the hard plastic. I think if it were all silicone, it might have better results. Overall, I'm happy with the novelty of the product and the price, just not happy with the results.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobby Lee",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Easy to use",
      "text": "A great way to make spherical ice cubes. Easy to fill and freeze. They stack to take up less space in the freezer. And they release the spheres easily if you let them sit on the counter for 5 minutes or so. And they’re quite impressive in a glass of whatever drink you’re having.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Neumann",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "large spheric ice cubes necessary for Old Fashions",
      "text": "OK. They have a line so you know how much water to place in the mold. Freeze them for 5 hours. They are ready to rock. There is often some difficultly in getting them out of the rubber mold. So set them on the counter and wait about 5 minutes for a bit of thawing. You can also run some water over the top. Use purified water. They won't always come out clear. Sometimes they crack. In general, you'll get a perfect sphere which fills up your glass. They are necessary for Old Fashioned drinks or sipping bourbon. However, they still don't last that long in the glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Zombie",
      "helpful_votes": 2,
      "publication_date": 20170718
    },
    {
      "title": "Very exciting ice",
      "text": "I don't recall being this excited about ice. Every night I fill a water pitcher to have in my room. Ice melted too quickly. These spheres of ice turned it around. Now my ice takes hours to melt. It's just plain fun to find different things to use them for. They are easy to make and take out of the molds. I haven't experimented with how to make my ice clear, but I did stick a lemon in one and as it melted my water had a hint of lemon. Fun with ice!",
      "rating": 5.0,
      "verified": true,
      "author": "Elle B.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "He left them here!",
      "text": "My buddy who is an expert scotch drinker insisted that I get this - he loves these! I don't drink scotch, so you're probably wondering why I bought these? Glad you asked. My son. Need I say more? So I got these for him for Christmas, filled them up, froze them and gave him a frozen package (not the movie). Made perfect ice balls. So here's the best part: he left them at my house when he went home!! So now I get to use them! I'll have to find something other than scotch.",
      "rating": 5.0,
      "verified": true,
      "author": "Kurt",
      "helpful_votes": 2,
      "publication_date": 20180102
    },
    {
      "title": "Best ice ball maker",
      "text": "I used these at a friend's house and instantly ordered a set on Amazon. He tried several versions of these and liked this the best. People really like it when I serve them a drink with a giant ice ball in the glass. I find them very easy to use and clean and they make a nice sized ball. The ice ball will still melt in your glass but certainly slower than a few ice cubes. I keep them on the ready in the freezer. I'm thinking of getting a few more for large punch bowl style drinks for entertaining.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "These are great",
      "text": "I use very hot water and it makes a clearer ice ball. The silicone makes it very easy to peel the ice out - I make them from time to time when I think of it and store them in a freezer bag and thus always have plenty on hand when we have company.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 2,
      "publication_date": 20190627
    },
    {
      "title": "Spherical ice mold works well",
      "text": "I find these do exacty what I purchased them for. That is to make 2.5 inch ice spheres. I however do not understand the justification of slow melting and less watered drinks. A drink is cooled by removing thermal energy. The shape or size has NOTHING to do with how much thermal energy is removed given equal amounts of total mass of the ice. It simply is a matter of physics and the properties of H2O and energy of changing from a solid to liquid.",
      "rating": 5.0,
      "verified": true,
      "author": "TechShopper@Amazon",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "nice for parties",
      "text": "the cubes are so large they last for several drinks which is nice. We make a bunch and store them in zip lock bags for parties.",
      "rating": 5.0,
      "verified": true,
      "author": "robert grudberg",
      "helpful_votes": 2,
      "publication_date": 20200515
    },
    {
      "title": "Space saving",
      "text": "I've tried other sphere molds completely made of silicone that are sphere shaped and take up space in the freezer. They could get really messy and tricky to detach. The design on these molds allow you to stack as many you would like to save space. They are super easy to fill as soon as you can gauge how much water yo use to leave room for expansion. Removal is seamless. Thet suggest running under warm water to detach which I didnt even find necessary. I'm very satisfied with these molds.",
      "rating": 4.0,
      "verified": true,
      "author": "Becka",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Works great!",
      "text": "I read a lot of reviews before I decided to purchase this brand of ice molds. I read all the tips from others who purchased these molds and make my first sphere's last night. I used distilled water (I did not boil it) and put both molds into a soft cooler lunch bag. I took them out this morning and let them sit on the counter for about 6 minutes and they popped right out and are perfect. I am making craft cocktails this weekend so I will add an update once I use them. So far I love these molds!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathi",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Ice spheres do seem to last longer but they're hard to get out of the molds",
      "text": "At first I thought these were great but I've stopped using them. The issue is that the ice spheres are really difficult to get out of the molds unless you run water around the outside to loosen them up. This seems kinda at cross purposes with the original purpose. Thing to note; if you glass doesn't have a lot of liquid in it and the spheres don't float up a little, you can end up with them kinda blocking the glass. Perhaps this is more of a stylistic than a functional complaint. But on the other hand, I'm now using 2-inch ice cubes and as far as I can tell, the ice spheres really do last longer.",
      "rating": 3.0,
      "verified": true,
      "author": "The Lin Family",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Bummed that one cracked",
      "text": "Disappointed. I have used these for a while and loved them! I even bought a set for my brother who loves his. But, not mine have cracked. One cracked to the point where I had to throw it away and the other has cracks started in the plastic. I am still using it, but now I only have one.",
      "rating": 3.0,
      "verified": true,
      "author": "Active Amazon shopper",
      "helpful_votes": 2,
      "publication_date": 20180913
    },
    {
      "title": "Work great. Work much better than the split kinds that you fill from little holes on top.",
      "text": "These work great. I like these much better than the ones with two halves that you individually fill through a little hole on top. Here you simply fill to a marked line, place in a freezer, and out come perfect frozen spheres. I bought other shapes of same brand that also work great. I think this is the best version of making different shape ice cubes.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "My Whiskey Just Tastes Better With These",
      "text": "I love these things. They're so simple and effective to use that I now own 8 of them. I use these for both whiskey cocktails as well as creating frozen urine balls to throw at the local neighborhood kids. Hey man, what I choose to do with these things is my business. Don't laugh, it's effective. I'm simply proving my review of a mold to freeze spheres from liquids. What those spheres are made of is up to you.",
      "rating": 5.0,
      "verified": true,
      "author": "El Reviewer",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Ease of removal & completely round",
      "text": "Loved product. First purchased a mold that looked faucets. It didn’t fill correctly most times & often broke into pieces. Was hard to remove from mold. Saw video-Looked easy so bought this. Easy to remove-Nice & round. Problem: Bought new Tiffany & Co brandy glasses. Says 2 3/8” opening & these are 2 1/2”. Hope they work. They will work in my lemon🍋 drop martini glasses🍸for sure and I drink many more of them. I may need more to keep glasses full.",
      "rating": 5.0,
      "verified": true,
      "author": "Shar Wilson",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Perfect ice balls",
      "text": "I was searching acutely for a squares ice cubes . Found these , I am glad I purchased them . I drink a lot of cognac , this balls hit the spot . Invited few friends over the weekend we’re surprised to see you then To make a sphere ice u gotta use a distilled water . I am obsessed with your this ice balls .",
      "rating": 5.0,
      "verified": true,
      "author": "DIckHertz",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "They worked great",
      "text": "The molds worked great. I'm still trying to work out the exact amount of water that I need for the ice not to crack, due to expansion when they freeze. It would be nice if there was a fill line on the inside of the molds.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim D.",
      "helpful_votes": 10,
      "publication_date": 20160721
    },
    {
      "title": "So far ok",
      "text": "It does make ice spheres, and is easy enough to use, but the ice is always fractured. It stays spherical long enough to drink your cocktail as long as you dont attach the nipple. Haha. If it does take along time for you to finish your drink you might want to try something else. I’m going to do more research and possibly get something else.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Bordeaux",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Easy to Remove and Durable",
      "text": "I tried other brands that utilized a traditional ice cube tray method, but huge squares and odd shapes don’t work with silicone trays. I could tell they’d tear after a few uses... These are built to deal with creating and removing a large round ice cube. They work great and are easy to remove. I can’t wait to try some of their other shapes.",
      "rating": 5.0,
      "verified": true,
      "author": "BAE",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Cracked after 10 months",
      "text": "I use one of these ice cubes per day in my water bottle, meaning each one is used every other day. I have had them for about 10 months, and one of them just cracked. I'm down to only one more, but I love these so much I will probably buy another set. The ice never has the 'yucky freezer taste' and is long lasting.",
      "rating": 4.0,
      "verified": true,
      "author": "Charlo",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "These work great and make nice ice balls for cocktails",
      "text": "These work great and make nice ice balls for cocktails. They are easy to open when they come out of the freezer, easy to fill, and do not spill. We ordered a cheaper brand first and these work way better. We freeze them, then keep a freezer bag in the freezer to put them in and keep making more so we have a few on hand if people come over. They stay solid and melt very slow, keeping your drink from getting watered down. Just be careful plopping them down in your glass.....I cracked a glass once just tossing it in...you need to gently set them in your glass. Hope this helps!!",
      "rating": 4.0,
      "verified": true,
      "author": "Del R Frohlich",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Good for Whiskey",
      "text": "Saw Japanese whiskey hibiki to create a hand made ice ball for whiskey drink, so I purchased this for a try. This tool built very nice and round ice ball. The only suggestion is if this product comes with support tool for easier adding water into it. It will be better and easier to use, but current NOT. Overall, nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jiunjr Feng",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "the smoke will eventually break out and lend a nice depth and character to your drink",
      "text": "These things work fantastically well, but beware they make LARGE iceballs. You can also use them to make smoke bombs. Put one in the freezer for 1-1.5 hours, then flip it and freeze for another hour or so. When you take it out, you can melt a tiny hole in the top and drain the unfrozen water out and refill it with apple or tea smoke and set in your whiskey. As it melts (a few minutes later), the smoke will eventually break out and lend a nice depth and character to your drink.",
      "rating": 5.0,
      "verified": true,
      "author": "YourCallCannotBeConnected",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "I purchased a product like this for myself a couple years ago and loved ...",
      "text": "I purchased a product like this for myself a couple years ago and loved it. I mainly use it when drinking whisky and I love the fact the sphere melts slower then traditional cubes and how it really chills my drinks. My visiting parents loved them so much I purchased this set for their Christmas gift and they loved it. My dad mainly uses when drinking soda. I also purchased a set for a friend to go with an engraved whisky glass we gave her as a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Morgan",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "These are Great",
      "text": "I never knew I needed these in my life. I like a good whiskey on ice, and these mysteriously add to the experience. The only thing I wish was that they would freeze into more clear ice balls. Not a product fault, more of a physics complaint. These form perfect balls, are incredibly easy to use and clean, and you will wish you had more. I bought two sets, and four of these just don't go very far if you have people over for drinks. Order a bunch, you wont regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "B1keDude",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Works as expected",
      "text": "I've wanted some spherical ice molds for whiskey for a while, and these work pretty well. I never have too much trouble extracting the ice balls from the molds, because of the flexible silicon tops, but when I do I just put them under the faucet for a second and they always pop right out. The ice is a little bit cloudy, but I've found that filling the mold with warm distilled water helps a bit (they still aren't completely clear but I guess they don't really need to be).",
      "rating": 5.0,
      "verified": true,
      "author": "mason",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Good until they broke.",
      "text": "After a few years of use, the handles have ripped off, rendering the molds useless. Interestingly, the ones I use at home as well as the ones used in a commercial setting have all worn out at the same time. I would have expected a longer life out of them.",
      "rating": 2.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "MONEY WELL SPENT!",
      "text": "I hate that I wrote this review so late! This is a perfect gift for... well anyone! My husband loves whiskey and this bad boy makes the perfect round Ice ball. Easy to fill, easy to pop out after. There are two in a pack. Really really happy with it, I’ll be buying two more for the men in my family for Christmas! Great stocking stuffer too!",
      "rating": 5.0,
      "verified": true,
      "author": "CassVee",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Almost perfect! Buy these.",
      "text": "These are super cool. Bought as a gift for a buddy and then got for myself once I saw the results. While you won't get pure glass crystal ball looking spheres these are very close. Piece of cake to fill and toss in the freezer and just as easy to remove. Great for any type of drink, not just booze. I have another tray that makes giant bricks of ice and I like the sphere style better. They just look cooler, ha.",
      "rating": 4.0,
      "verified": true,
      "author": "AWDV8",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Large spheres; poor durability.",
      "text": "The spheres produced by this mold are the perfect size to fill a rocks glass, keeping drinks cold longer... when they don't shatter instantly upon adding liquid. Even cracked, they're pretty decent. I do, however, object to the quality of the molds. One of the four I bought survived less than a week before half the bottom broke off. I tend to expect a degree of durability in silicone-based molds.",
      "rating": 3.0,
      "verified": true,
      "author": "Dan Hess",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Awesome and easy!",
      "text": "These work great. They are easy to fill, easy to remove, and the ice stays a sphere when I take them out. They also don't take up too much space in our small ice drawer which is a bonus. The spheres last a long time in our cocktails. We just use tap water because we aren't really concerned about how clear they are. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Limer",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Great molds!",
      "text": "Would absolutely recommend these molds. Definite crowd pleaser. Really easy to use, especially thanks to being able to stand them up individually in the freezer. Some slight cracking of the ice but I attribute that to Florida water quality NOT the molds. Would absolutely recommend. Make sure to note diameter size as they are on the large side and won't fit into smaller mouthed glasses! Great set!",
      "rating": 5.0,
      "verified": true,
      "author": "Nik",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Great quality! Doesn't leave white residue like the floppy ...",
      "text": "Great quality! Doesn't leave white residue like the floppy silicon molds. Love that it's easy to fill to the right amount of water without creating a mess! I bought the silicon ones first because they were cheaper, but hated them and ended up buying these anyway. Definitely worth the price - don't waste your money on the other ones like I did",
      "rating": 5.0,
      "verified": true,
      "author": "Sue",
      "helpful_votes": 3,
      "publication_date": 20180103
    },
    {
      "title": "Nice globes of ice. Easy to use.",
      "text": "Super easy to use. Sometime I don’t want my Bourbon neat and I grab one of these. Fill to the line Freeze for a few hours Remove from freezer Run under cool water for a few seconds and it pops right out. Also good in a rum and coke. Enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "ungalor",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "The ice can sometimes be lumpy",
      "text": "The first few times I used this, the ice turned out strangely lumpy, especially on the bottom. The expansion of the ice during freezing seems to have made it pull away or create strange pockets. My water is not particularly chunky, so I really don't know what's happening.",
      "rating": 2.0,
      "verified": true,
      "author": "R.E.",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Cocktail balls",
      "text": "These are a perfect size and exactly what I have been looking for. My only issue is removing the ball from the rubber cap. If you run underwater as instructed in the cube would melt a little bit. Give it a nice top and it should shake free from the silicone lid",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Awesome Product",
      "text": "My husband received an expensive bottle of scotch as a Christmas gift. He loves his scotch with one large cube of ice. This makes a perfect round cube of ice. Little did I know when I ordered this that I would love using the large round cube in my glass of iced tea. It is slow to melt and keeps my drink cold for a long time. No problem filling and freezing. I am so happy I ordered this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn B.",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Fulfills its Promises - Easy to Use, Long Lasting and Beautiful Ice Spheres",
      "text": "Super easy to use - making thre ice spheres takes me less than a couple minutes (that includes removing one, filling them up and putting them back in the fridge), which is a major point for me as I usually don't have the patience for this kind of thing. I've made quite a few spheres of ice in the last month or so and they seem quite durable as well. The ice made from these did also seem to last much longer than 3~5 ice cubes (3-4x longer) - even though they don't cool the drink as quick (for obvious reasons).",
      "rating": 5.0,
      "verified": true,
      "author": "Paulo RPS",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Works great",
      "text": "This is really good at what it is intended to do but I dropped one as i brought it out of the freezer and a piece cake off. Luckily it was only the part that keeps it leveled. It was not cracked anywhere that will stop it from making the ice cubes I now use but it doesn’t make the ice cubes the same on the dropped mold because it is not leveled now when I set it",
      "rating": 5.0,
      "verified": true,
      "author": "Indira Y Grullon",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Ice ball melts fast.",
      "text": "Cool product, but ice balls melt fast. Prior reviews mentioned boiling the water before freezing to get a clear ball, I agree. Boiling makes a difference in the clarity. Mild is easy to fill and detach the ice from. Only draw back to this product is that the ice ball doesn’t last. Mine were half melted after 45 min in a room temp anejo.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "They last forever and are huge!",
      "text": "I got these and some whisky glasses for my husband for our anniversary and he loved them! They are very large so make sure you have large deep glasses. The ice lasted for two whole whisky drinks too! (But hes a fast drinker so normal people are good for one whole drink lol!!) They can be kind of hard to get out but I just ran the bottom under water for a few seconds and then it popped right out!",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Coffee",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Why spends thousands on a new refrigerator",
      "text": "I know a refrigerator that makes these might be “cool” I’ve been using these for years. I keep a gallon freezer bag filled with these in the freezer section of my refrigerator. Easy to accumulate quite a few just with a routine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Stapleton",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Ice melts weird",
      "text": "I love big cubes and I cannot lie. But it melts way quicker right at the line where the silicone meets the plastic and you end up with a really wonky-shaped piece of ice and a bit-too-watery drink. Sometimes the sphere even breaks into two. Really easy to use but idki if I'll keep using them. If anyone has any tips to keep this issue from happening, let me know!!",
      "rating": 3.0,
      "verified": true,
      "author": "Caroline X",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Best spherical ice molds",
      "text": "These are great ice molds! I've used them professionally in bars, and I've got a set at home. It's good for keep a drink cold without over-diluting. It takes a bit of practice to pop out the ice, but read the instructions, don't over-fill (remember water expands when it freezes!), and you get the hang of it pretty quickly. This is still the bet brand and design for spherical ice molds I've found--and I've tried a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Athena",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "For what it is, works good",
      "text": "They work just fine and I am happy with them but just 4 stars. I have tried different ways and changed the variables. However, the ice balls are oblong or bottom half is wider then top half, lot of imperfections in the ice. I am using them at home just fine and they make the presentation more appealing, so 4 star happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Fred W.",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Easy to use and make ice spheres",
      "text": "These are really neat! The bottom clear part is hard plastic and the grey lid is softer silicone. There is a line inside the plastic base that you fill the water to. When you push the silicon lid on it forms a sphere - don't worry if it's not to the top, it will expand to fill the whole sphere as it freezes. There is an overflow hole too. These stack nicely and come apart easily when frozen. Easy to use and end result is great!",
      "rating": 5.0,
      "verified": true,
      "author": "ylime85",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Love these things!",
      "text": "Not very dramatic, these molds make ice balls. I was a bit skeptical at first, since I wasn't sure what to expect, but I fell in love after the first use! These are easy to fill (just to the little lip inside), and with a little warm water to help the ice turn loose, viola, you have an ice balls that doesn't water down your liquor!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary H.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great purchase. May buy more",
      "text": "I bought this because a friend had them and used it when I came to visit him. The ice is great! It's slow-melting, really chills a drink quickly, and was easy to use. It's one of the best molds out. I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "RR",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Great balls of ice! Truly.",
      "text": "Now I know what I have been missing! These are easy to make and transfer to a glass. Plop one in, and enjoy. Clean taste, no odor, and lasts long time. Very much enjoy with an adult beverage, or a soda / ice tea.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul   -Colorado",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Fun for all",
      "text": "These things are cool as all can be. I got them as an extra to get me over the free shipping limit. They look very cool in a glass. Make sure you have glasses that are pretty wide. The ice balls will not fit in a Tom Collins type glass.",
      "rating": 5.0,
      "verified": true,
      "author": "Augustine R.",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Working great",
      "text": "These ice spheres are working great! They've held up perfectly. The only tricky part was figuring out how best to fill them up. I've settled on filling the base completely with water, then putting on the cap and pushing so the excess water comes out. Works great - I always have at least one ready to go in the freezer!",
      "rating": 5.0,
      "verified": true,
      "author": "May",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "I recommend - simple to use.",
      "text": "Simple, easy to use. The trouble with spherical ice they did not over come is as the ice freezes it expands. Since the first place to freeze is the small hole in top, there is nowhere for the ice to expand to so the mold separates and the ice is oblong. And despite all the YouTube video hacks, I cannot get clear ice (not the products fault directly, just an FYI)",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey Honeycutt",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Easy to use and Reliable",
      "text": "Got these and had my doubts about them. So far after about a week they have been working great and are perfect for drinks. I prefer to just use them in my cocktail drinks but since I started to take the ice balls out and store them in a ziplock to make more I use them now for all my drinks. They are perfect for a hot day because the ice chills the drink for a long time",
      "rating": 4.0,
      "verified": true,
      "author": "stevep",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "This is the best.",
      "text": "I wish this had been the first big ice sphere/cube maker I'd bought. The first 2 were awful--could not fill properly, made ice too big for any glass on the market. This product is easy to get right the first time and the results are flawless.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas E. Ruddick",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Thin, flimsy plastic",
      "text": "Not a fan of this product. The plastic on the inside was thin and flimsy and would not hold the water without leaking. You can see the rippling in the picture attached. Unfortunately, there was no way to contact the seller bedsides returning the product.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 2,
      "publication_date": 20200106
    },
    {
      "title": "Cocktails just got better",
      "text": "I absolutely love these. I’m not good at remembering to refill ice trays so I rarely have ice cubes for drinks. These are fantastic. They are easier to fit in my freezer and keep my drinks colder while looking awesome. I don’t know how long they’ll last since I’ve only had them for about a month, but I haven’t had any problems yet. One of my best purchases this summer.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Lasts a long time. Perfect for RVs and Yeti cups",
      "text": "This item is perfect for RVs or freezers with reduced space. They’re great for liquor drinks that you don’t want watered down. I use them in my insulated/Yeti cups and it does seem to last for many hours.",
      "rating": 5.0,
      "verified": true,
      "author": "Scuba Junkie",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "One of the best sphere molds we’ve ever owned! You won’t be disappointed!",
      "text": "Love these sphere molds. They are easy to use, fill, and clean. The ice sphere slides right out with very little warm water (some have slid out without having to run under warm water at all). Love how they stack in the freezer. They produce nice solid spheres that fit nicely into our whisky glasses, and last most of the evening. Much easier to use and better quality than many other molds we have used!",
      "rating": 5.0,
      "verified": true,
      "author": "Momof5",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "The BEST big ice ball sphere molds! They also make neat gifts! Love these!",
      "text": "Great company, these are quality \"ice ball\" molds and they hold up well. I've had my first set for years and just bought more to give as gifts. They are awesome. And your drinks stay colder/longer! Highly recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "HappyVegas",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Great gift",
      "text": "Bought for a friend, he refused to follow instruction to \"fill water to line\" and used water straight from the sink. He loves them lol UPDATE: all the guys in the house now use these! it's hard to mess up. (although one of the guys is known to under fill them) They still just use sink water and don't bother with pre-boiled water",
      "rating": 5.0,
      "verified": true,
      "author": "Kerianne O'Dwyer",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Perfect",
      "text": "Exactly what we were looking for. Keeps the drink from watering down bc the ice is so solid. We have ours in the freezer at all times ready to go. Usually can get 2-3 drinks out of 1 ice ball depending on how quickly they’re going down.",
      "rating": 5.0,
      "verified": true,
      "author": "KitKat",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Makes Ice Balls",
      "text": "It makes ice balls. There aren’t clear and will crack but that’s just science. My only concern is that the lid doesn’t seat completely. I usually freeze them with something on top to hold the lid. For the price, they do what they should.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Quickly cools any beverage you add to.",
      "text": "I highly recommend this. Me and my wife are so satisfied with this I use it for my alcohol beverages every now and then stays cold for a long time Also for things you refill your cup with perfect perfect perfect! We have ice cube trays that are silicon and they carry a lot of thick ice and all those ice and one cup will still melt quicker than this This lasted me for about 2 hours and 20 minutes Ima say . Great at keeping water cold. Really worth it type of product.",
      "rating": 5.0,
      "verified": true,
      "author": "Hector gonzalez",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Easy to remove the ice",
      "text": "BEST ON THE MARKET! Don’t buy any other brand! These ones are so awesome! They are easy to use. The ball is easy to get out too unlike other brands. Most other brands are impossible to get the ice out. My husband likes to make flavored ice balls with these. He placed a pot of warm water in the smoker so that the water has a smoky flavor. He then fills the ice balls and pours whiskey over them. It’s a smoked whisky flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "Djriise",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "overall happy with purchase - sometimes water spills out of the top",
      "text": "Overall this is a great ice maker for scotch. The only issue I have is sometimes the ice spills out of the hole on the top, and then I end up with half an orb instead of a full orb. However, even the half is plenty of ice so it is almost a good thing..... 4 starts and I would recommend this product!",
      "rating": 4.0,
      "verified": true,
      "author": "Running love",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Worth it",
      "text": "Bought these to make jello with tangerines 🍊 in the middle. Saw the video on YouTube and had to try it. I love these molds. They are easy to use and store and make a perfect sphere! I now use them to make ice and work great!",
      "rating": 5.0,
      "verified": true,
      "author": "CatLover711",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "The perfect ice sphere doesn't exi....",
      "text": "These are amazing! So easy to refill and reuse. They make a perfect sphere every time without the headache of having to bang out of a tough mold. The silicone gripper allows you to pull the ball out and easily squeeze it into your glass. Fun for the kids or for your perfect glass of whiskey.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Follow instructions and they turn out PERFECT!!!!!",
      "text": "I ordered these for my boyfriend for part of an anniversary gift... I saw some reviews that complained of them not being easy to use or having a \"nipple\" so I was a bit skeptical when I got them... As long as you only fill it up to the \"fill to\" line, and run warm water over the silicone piece for 30 seconds, you'll get PERFECT spheres. I LOVE these.",
      "rating": 5.0,
      "verified": true,
      "author": "DWynne",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "The quality of this product is much better than I expected",
      "text": "The quality of this product is much better than I expected. Seems to have a very precise manufacturing process. I use in my motorhome since they cannot spill when driving around. It should be noted that they take a bit longer to freeze due to their extreme thickness. But that is exactly what I wanted, two huge icy balls",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Keeps drinks colder longer without watering them down!",
      "text": "Such a cool product. Apparently the fact that the ice is round reduces the surface area and drastically slows down the melting process so the ice produced keep your drinks cold longer without watering them down. Amazing idea I never knew about!",
      "rating": 5.0,
      "verified": true,
      "author": "Scott G",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "perfect round ice cubes",
      "text": "I bought a set of these and liked them so well that I bought another set.. meanwhile throwing out the set of rubber ones I had bought. These work perfect for me... they are durable.. they make large round ice cubes and are easy to fill and empty. Though I do run a bit of warm water over them as I am removing the round ice cub. Have used the first set endlessly since day one... and now with two sets I can keep a nice supply on hand.. A good buy and I enjoy them and everyone that comes over... wants just ONE ice cube.. but one of my giant round ones...",
      "rating": 5.0,
      "verified": true,
      "author": "stilljojo",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Love these little suckers",
      "text": "It’s pretty self explanatory. It’s ice. These are great. You won’t get a crystal clear flawless sphere. It’s impossible without the professional grade set up, but these are pretty close! Love the spheres!",
      "rating": 5.0,
      "verified": true,
      "author": "TinCup206",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "I loved them. I thought they were amazing",
      "text": "When these first arrived, I loved them. I thought they were amazing, and I couldn't get enough of them. Now, however, I seem to be finding an oily film floating and several chunks floating on my drinks. I only use bottled water to fill them, and that hasn't changed. I think the freezer is breaking down the silicone. I still use these, but I rinse the cubes really well after I take them out of the molds. Unfortunately, that melts a lot of the cube away, making it much smaller than before.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 4,
      "publication_date": 20141027
    },
    {
      "title": "Don't drop when frozen!",
      "text": "Product works great, but just a warning (and was my fault) don't drop it out of the freezer! If it lands on the silicon top you're in luck but if it falls on the plastic bottom it will break. The clear plastic appears to become very brittle with low temperature, it completely shattered.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Ice Mold",
      "text": "These work to make ice. Nothing else promised. You will not get clear ice, however, it does not promise to make clear ice. You get a round ice ball, which is what it promises.",
      "rating": 4.0,
      "verified": true,
      "author": "Fredo",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Sturdy and stackable ice ball maker",
      "text": "Makes a great ice ball. Easy to fill and the stackable design makes it easy to store in the freezer without tipping. Sturdy too - only one of 4 we own has a lid that cracked and that was due to overfilling the container and then applying too much pressure to get the lid off after it was frozen.",
      "rating": 5.0,
      "verified": true,
      "author": "janetk",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Awesome molds!",
      "text": "I didn't get into too much of the science of ice that I see in other posts. I filled them to the line with water, put the lid on and froze them. I got nice, big, perfectly round balls of ice. The 2nd time I used boiled water. I got nice, big, perfectly round balls of ice. The 3rd time I used boiled and cooled water. I got nice, big, perfectly round balls of ice. Next batch I'll try spring water just for giggles and kicks but I imagine I'll get...you guessed it - Nice, big, perfectly round balls of ice.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry107",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Best Ice Ball Maker",
      "text": "I have many ice ball makers. These only make one at a time, but they are a no mess no leak maker. Most of the other ones I have will leak if you're not careful.",
      "rating": 5.0,
      "verified": true,
      "author": "stealthnv",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Bought a second because they were so good for my brother for Christmas",
      "text": "Have a set for myself. Bought a second because they were so good for my brother for Christmas. The ice balls also double as a very fun dog toy! The large size of these spheres is very nice, but be aware they may not fit well in some classes. I have some thick walled double old fashioneds that these sit about 2 cm from the bottom due to how far in the glass tapers.",
      "rating": 5.0,
      "verified": true,
      "author": "Skiddlywinks",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "Good but not perfect",
      "text": "The spherical shape of the ice isn't perfect. The ice expands and pushes the top off making it misshapen. The lid also allows an air bubble in that settles on the top. Making that part flat...",
      "rating": 4.0,
      "verified": true,
      "author": "LostSoul083",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Easy to use",
      "text": "The mold is very easy to use. Pour the water into the mold, and put it in the freezer. A few hours later, it is done. Rinsing the mold under the tab water for a few secs makes the separation of molds easy. The ice ball looks nice in the glass after whiskey is poured over it.",
      "rating": 5.0,
      "verified": true,
      "author": "skittlerocks",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Molds fall apart",
      "text": "Ice spheres are really cool. It's difficult to get them out of the mold though. Also the molds fall spare after a few months so get extras. See photo",
      "rating": 2.0,
      "verified": true,
      "author": "B. Moore",
      "helpful_votes": 4,
      "publication_date": 20170517
    },
    {
      "title": "Giant Ice Balls",
      "text": "Could be used as weapon projectiles. After the attack, the evidence disappears. Put one of these in an insulated drink bottle and it will last all day.",
      "rating": 5.0,
      "verified": true,
      "author": "fourbyfive",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "SO...SO",
      "text": "I bought 2 sets of these. They are hard to get out of the mold. I need to run hot water along the rim. They don't always come out in a full circle. Frustrating !!!",
      "rating": 4.0,
      "verified": true,
      "author": "@audraschaney",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Very easy to use",
      "text": "I did some research before I bought this. I wanted something that was easy to use, clean, and durable. This has definitely exceeded my expectations. I am going to buy this again for multiple guests.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Perfect",
      "text": "Omg what an awesome fathers day gift. Who knew this would be a hit for men. I'm happy I listened to CNN suggestion on gifts. My husband is fascinated with these ice balls",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Must buy",
      "text": "These are the coolest darn things ever! They make really clean sphere cubes. They’re a little oblong but still looks super nice. Our guests love coming over when we make drinks. I bought this for my husband’s whiskey tray and he absolutely treasures this. So affordable too.",
      "rating": 5.0,
      "verified": true,
      "author": "Buckwheat91",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "I love these spheres",
      "text": "I had been given spheres like these for a present from my niece and loved them so much I ordered them for a friend for Christmas. They are easy to use - to fill and stack in the freezer, and to remove to put in glasses. They make the drink not only taste better but look better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Long lasting, aesthetically pleasing",
      "text": "Had these for 2 months now. I love these ice balls. This mold was so easy to use, just fill it to the line, close, then freeze. The silicone cover makes it really easy to pop off. Sometimes I put too much water and it over freezes outside of the lid. But you just need to run it under some water and you can good to go. I usually use these for sparkling water, and they last way longer, and they look nice. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "I look fancy when sipping bourbon now.",
      "text": "These molds work very well. The ice isn't always 100% perfect, but it doesn't matter that much. Sometimes, my ice balls look like eggs a little. But, they're still cold. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Brewyet",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Lid does not stay ON",
      "text": "I was excited to get the item but excitement quickly turned into disappointment when I filled it with water. Water lifted the lid and Lid would not stay no matter how hard you press it down. There should be some type of latch to keep the lid in place.",
      "rating": 1.0,
      "verified": true,
      "author": "SATPAL S.",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Better than expected",
      "text": "This product is easy to use and remove....I actually find myself getting a little salty when guests use this ice cube over the other cube trays I have. So fun to use.",
      "rating": 5.0,
      "verified": true,
      "author": "nativecalgal",
      "helpful_votes": 0,
      "publication_date": 20200607
    }
  ],
  "product_meta": {
    "title": "Tovolo Sphere Ice Molds - Set of 2",
    "description": "Join The High Rollers With Our Chic Sphere Ice Molds. The Innovative And Clever Design Gives You A 2.5″ Sphere, Perfect To Accompany Your Whiskey, Scotch, Or Bourbon. The Slow Melting Sphere Will Bring Out The Full Flavor And Add A Splash Of Class To Your Next Drink Without Diluting It. Neatly To Conserve Space. This Sphere Mold Is Bpa Free, Dishwasher Safe And Comes In A Set Of 2.",
    "rating": 4.7,
    "feature_bullets": [
      "CHILL ALL DRINKS: The large 2.5\" sphere size is perfect for your favorite low- or highball glasses. Globes chill drinks quickly without melting for a long-lasting, refreshing drink",
      "KEEP DRINKS COLD LONGER: Avoid watery drinks by using these large, slow-melting cubes to chill your drink. Large cubes melt slowly to prevent diluting drinks, and ice may last long enough to pour another beverage over it",
      "TIGHT-FITTING LID: Tight-fitting lid seals out odors and allows stacking. Lid creates a seal by fitting into the lip of silicone, and the stable base fits perfectly on top of another tray’s lid, so you can stack multiple silicone ice trays",
      "CREATE SOPHISTICATED COCKTAILS: Create spherical ice for a distinctive, unique look for your favorite cocktails. Also great for iced tea, cold brew coffee, soda, lemonade, punch, and more",
      "ENJOY WITHOUT WORRY: The sturdy plastic construction, leak proof design, and water fill line make this ice tray easy to use for anyone. The durable, food-grade molds are BPA-free and dishwasher-safe for the best possible user experience"
    ],
    "specifications": {
      "Product Dimensions": "3.5 x 3.5 x 6.5 inches",
      "Item Weight": "6.9 ounces",
      "Manufacturer": "Tovolo",
      "ASIN": "B007ACTN54",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "80-9697",
      "Customer Reviews": "4.7 out of 5 stars8,200 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#335 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Is Dishwasher Safe": "Yes",
      "Is Assembly Required?": "No",
      "Number of Pieces": "2",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Ice Cube Molds & Trays",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Specialty Tools & Gadgets",
      "Kitchen & Dining"
    ],
    "price": 9.99
  }
}