{
  "website_summaries": [
    {
      "verdict": "This is an entire AT&T system that will meet the needs of small businesses or anyone who needs multi-phone capabilities with lots of features. However, it's more than the average answering machine user will need.",
      "pros": [
        "An excellent choice for offices, as it includes a corded and cordless phone that's expandable and packed with features",
        "Has clear sound quality",
        "Features caller ID",
        "Answering machine works well",
        "Clear digital display"
      ],
      "cons": [
        "On the higher end of the price spectrum",
        "Not everyone needs all of these additional features"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "\" Everything else works fine, BUT THIS",
      "text": "Purchased a Dect 6.0 base unit with 2 handsets back in 2010. Purchased this handset to add another. Registered OK. Calls work. CID works. Time and date work. Directory? ONE CONTACT ONLY! Will NOT list other numbers! Handset states there are \"21 Entries.\" CORRECT!, but you cannot scroll through the entries. Handset responds \"Not available at this time.\" Somehow the handset will not translate this directory information from the base. Try to save a known number. Handset says \"it's already saved.\" Everything else works fine, BUT THIS, and I find THIS to be IMPORTANT! Wouldn't You? Seems to be just another example of what the masterminds at At&t spend their waking hours messing up.",
      "rating": 1.0,
      "verified": true,
      "author": "P. Graham",
      "helpful_votes": 46,
      "publication_date": 20170324
    },
    {
      "title": "DO NOT BUY THIS !",
      "text": "This phone has all sorts of issues...when I get an incoming call a voice on the phone says no one is available, or hangs up after 4 rings...there are a lot of other issues too numerous to post, just don't buy this phone. I have called AT&T and they do not work on this phone...I can't afford to get another phone right now, but I certainly will and will buy it from AT&T..not a private seller. It is horrible.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 17,
      "publication_date": 20170824
    },
    {
      "title": "Quit working in three months...",
      "text": "Bought this phone extension set three months ago to replace a phone set I dropped in the porcelain punch bowl. The original phone system was a base and four hand sets which have been in use for a couple of years. This replacement phone set extension worked as expected until today. Now the buttons will not respond to the touch, there is no speaker function, and the battery will not get above two bars. Its totally non functional, but it still has a backlit display. No combination of button presses or battery removals has made any difference. Unsatisfactory. Recommend \"do not buy\". Just get a completely new base and set of phones.",
      "rating": 1.0,
      "verified": true,
      "author": "h87111",
      "helpful_votes": 7,
      "publication_date": 20190607
    },
    {
      "title": "Does not ship in manufacturer's original packing.",
      "text": "This arrived with 5 pieces wrapped in bubble wrap inside a non-manufacturer's box. I bought it as a spare in case one of my others stops working, and I do not plan to install it immediately. There is no way to know if it will work when I need it, and returning it would be a hassle because it was not a \"prime\" item. So, I am stuck with it.",
      "rating": 1.0,
      "verified": true,
      "author": "mtg09",
      "helpful_votes": 3,
      "publication_date": 20200426
    },
    {
      "title": "Do Not Buy This Set",
      "text": "Figuring that AT&T used to make decent phones, and I was wrong to go there. The handset on this phone is simply awful. It uses some sort of dialer system when you punch in the number as if it is processing analog to digital and fails two out of three times. You go to enter the number on the keypad, it pauses and then blurts out three numbers and tells you there is no signal. Then when you hang up and go to redial it dials the remaining numbers, always. The base set is OK, but toss the handset with the box. Simply awful and inexcusable.",
      "rating": 1.0,
      "verified": true,
      "author": "Hening",
      "helpful_votes": 4,
      "publication_date": 20181128
    },
    {
      "title": "Pain in the butt",
      "text": "Weirdly spoken words. Cant even say Los Angeles properly forget about names. Every unanswered incoming calls records as message even there are no sounds. I've to manually delete each one because i do not like blinking red light. I know i can turn off message function but my whole point of having this phone set so that people can leave message if there is an emergency. Because some places i do not want to give my cell number. But it is not working for me. Specially the spoken word really bother me. I never heard anything like that!",
      "rating": 1.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 2,
      "publication_date": 20200217
    },
    {
      "title": "If I could give it -5, I would; Customer care wase useless!",
      "text": "The battery charger on my 4th ATT&T Uverse handset died so I ordered another one. It came July 26th. I have tried since July 26th to use the phone. The manual instructs to press a remove button or use a remove menu button. There is neither on the phone. I have been calling AT&T since July 27th for help. All help they have given me has not worked. I guess after 2 weeks the phone had not been connected in so long, that it was removed. With",
      "rating": 1.0,
      "verified": true,
      "author": "rjb",
      "helpful_votes": 2,
      "publication_date": 20200729
    },
    {
      "title": "handsets keep loosing primary base connection",
      "text": "We have had continuous trouble with the handsets becoming disconnected from the home base and need to unplug and replug quite a bit. I would not recommend this if you want the handsets on different floors of your house. We had an AT&T previous to this for 10 years with no issues so I felt comfortable buying this one. I was wrong. I really believe the quality went down. If you buy this I would test it out quite a bit in the first 30 days so you can return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171101
    },
    {
      "title": "Good phone system for the money.",
      "text": "Not bad for the price. Speaker is clear and loud. Comes with 6- or 8-foot RJ-11 cord which is waaaaay too long when mounting the phone on a wall plate -- not enough room to stuff all that cable out of sight which subsequently interferes with mounting on the wall plate -- if you plan to mount this on a wall plate, I highly recommend that you also buy a **5-inch** RJ-11 cord here on Amazon.com.. Mine doesn't fit snugly on the wall mount -- it's a bit wobbly (your experience might be different), but it certainly won't fall off under normal circumstances. .",
      "rating": 4.0,
      "verified": true,
      "author": "Max H. Herr",
      "helpful_votes": 3,
      "publication_date": 20170920
    },
    {
      "title": "Good system except for the low battery life on the portable.",
      "text": "Good system for our home. My Wife works for the Airlines, so she gets many calls from the crew desk and needs a reliable landline system. I use the speaker phone functionality all the time to speak with robo-phones regarding travel plans, utilities, etc. The speakers are clear and the other party hears me well. One big drawback though: My BIG issue with the system is the extremely short battery life on the remote-portable unit. After one 15 minute call, the low battery light comes on.",
      "rating": 3.0,
      "verified": true,
      "author": "Prime customer",
      "helpful_votes": 7,
      "publication_date": 20160815
    },
    {
      "title": "Piece of crap. Save your money.",
      "text": "It worked okay for a short while. Then I noticed a lot of static on the line. Looking through the manual, it said my internet may be causing interference. I ordered an adapter as discribed in the manual, but not included with the phone system. Again it worked for a week, then I noticed calls were not coming through and when you try to call out, you get a busy signal. I've tried three different phone jacks in the house and it still doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170801
    },
    {
      "title": "What a Mess!",
      "text": "I purchased this plus eight handsets. Calls can neither be placed nor answered from the base unit unless one uses the speaker button. The display has always read 'new voice message' however there has never been such a message and deleting all messages does nothing to fix this frustrating situation. Call quality on all the handsets is intermittently reliable and it is not a provider issue. Having bought online and assumed everything would be fine since this was just an update from my previous system I discarded the packaging as I set it up so I am both discouraged and unsure of what exactly to do.",
      "rating": 1.0,
      "verified": true,
      "author": "Cathleendm",
      "helpful_votes": 6,
      "publication_date": 20160405
    },
    {
      "title": "Not what my old ATT set like this was",
      "text": "The corded part of this set is nice. The issues come in with the cordless handset. The volume for calls on the handset is very low and muffled no matter what setting it is on and with the volume turned all the way up. We also notice this handset also often has a strange echo to it when you are talking to someone on it. Our old ATT set we had for 11 years and the sound on both the corded and cordless sets was phenomenal. I don't see this set hanging around as long as our previous one did.",
      "rating": 3.0,
      "verified": true,
      "author": "blm1181",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Terrible product.",
      "text": "Within three days, the cordless phone simply stopped functioning (had nothing to do with the battery: it was fully charged). Sent it back and received another at no cost--same thing happened to the cordless phone. As I finished a conversation, I went to hit the \"off\" button, but the phone just froze and nothing would work. Terrible product...laughably bad. I'll never buy another AT&T product.",
      "rating": 1.0,
      "verified": true,
      "author": "Edward N. Molush",
      "helpful_votes": 8,
      "publication_date": 20170309
    },
    {
      "title": "battery no worth it",
      "text": "i had this phone for 1 year now bought it just in case for my business so if my phone breaks down i will have it so about 6 months ago i opened the box to use this and today i am having problems with the cordless the battery does not hold power bought a new battery and still doesnt charge fully after a half a day the phone dies... i have been using it for a while now and they have been good but dont no why this time they are giving me problems",
      "rating": 3.0,
      "verified": true,
      "author": "rizwan hamid",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Never Again",
      "text": "This phone is OK sometimes; about the same quality as the other brands of phones in this price range. I wish the speaker volume was a little louder. The main problem with this phone is that when using the cordless extension it frequently drops calls. I've never had this problem before. Also, when making calls after you've entered the phone number there is a fairly long delay before it actually dials it. I don't think I'd recommend this particular phone but then I couldn't recommend an alternative. For this price it's hit or miss.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Anthony",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "and to make it worse the return time is gone",
      "text": "No sooner had I got it setup then the cordless part of it stopped charging I tried a brand new battery and it still won't work. The main phone still answers but won't do anything else......and to make it worse the return time is gone....thanks a lot",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Dollard",
      "helpful_votes": 5,
      "publication_date": 20170611
    },
    {
      "title": "bad deal.",
      "text": "i ordered a new base with add ons... bad deal..out of six,, only one still works.....plus one which is loaded with static....i have ordered another package,, a 'set' this time.. i would rather have six battery units,, but i am settlling for five.. i sure hope at least three work... they are SUPPOSED to be new components.... i certainly expected zero defects on AT&T products...i do know..i am paying too much for defective equipment.. if it is from AMAZON,, i expect thier dealers to be ethical...",
      "rating": 2.0,
      "verified": true,
      "author": "del greening",
      "helpful_votes": 2,
      "publication_date": 20170708
    },
    {
      "title": "A very basic phone",
      "text": "The phone is okay -- clarity is good. The operation of inputting phone numbers on speed dial and other functions are a little tricky. The one big thing that is annoying is the mechanical voice that announces who is calling. It sounds more like a woman who has had too many drinks -- she is very difficult to understand. I had to silent her because her voice is so annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "Pat Motts",
      "helpful_votes": 4,
      "publication_date": 20170611
    },
    {
      "title": "I'm Disappointed...",
      "text": "I was initially very happy with this product; however in the last 8-10 days, the cordless phone has number (in particular, #6) that sticks and has to be press numerous times to go through. I have thrown out the box for this but would return it for a new cordless part if I could. I'm very disappointed that I may have to purchase another cordless phone. Also, the \"voice\" is so computerized that it is barely understandable most times. But I could live with that--if the cordless worked properly. Too bad, it's very sleek and doesn't take up too much space on the counter--I thought it was just what I was looking for.",
      "rating": 2.0,
      "verified": true,
      "author": "B3rd",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "No caller block even tough it displays caller id",
      "text": "Call block is a small feature to add when you are already waiting the 1500ms to receive the caller ID data on a phone line after the first ring. In today's world you need call block on every device and this one feel like 15 year old technology. I can usually type a phone number in less than a second by touch but the buttons on this phone do not allow for that - they feel cheap as well and sometimes the number you press isn't registered on the phone. My advice is to buy a different phone for better return on investment.",
      "rating": 3.0,
      "verified": true,
      "author": "Guest",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Bought this as a gift for my mom and she's really happy with it",
      "text": "Bought this as a gift for my mom and she's really happy with it, easy to use, my mom she's 70 years old and she can use it, which I'm really happy, I wanted something simple for her to use, she still has a few things to learn, but she's getting there day by day . She was having problem with her old phone, I think she had it for over 15 years at least, maybe more and I wanted to buy something similar to what she used to have and when I read the reviews , I said to myself, that's a phone for her.",
      "rating": 5.0,
      "verified": true,
      "author": "MARCUS",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Decent telephone.",
      "text": "I was looking for a phone to hang on the wall and this one fit the bill. The sound is good and it was easy to set up. The only bad thing about it is that the audio on caller ID is not understandable. Fortunately, I was able to turn that function off. I can still read the caller ID, I just don’t have to listen a garbled announcement.",
      "rating": 5.0,
      "verified": true,
      "author": "AZshan",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "It’s okay",
      "text": "Base works great but the cordless headset is static-y and have people complain sometimes they can’t hear me too well. Even when I’m close to the base with it, that doesn’t seem to make a difference. Also I t constantly says I have a new voicemail on the display but when I try to check it to delete, it will play back saying I have no messages. This drives me absolutely nuts. I’m the type to make sure my iPhone has no notification notices on it, things like that really annoy me. Otherwise it’s a decent phone, I guess it’s still better than my cell that has no service in my home.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Big LED Screen",
      "text": "very easy setup simple bright led screen good quality not junk, sound quality is excellent big button design I bought it for some one who is elderly and they love it , took less than 5 minutes to setup",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Good, mediumish quality phone",
      "text": "Great for the office. The speaker phone works OK. The microphone is very sensitive...too sensitive. It picks up the window AC 10 ft. away so the speaker goes silent when the mic takes over. Now, if there is no background noise, it's great. clear, I'm clear on speaker phone to my customers or suppliers.The wireless is just another good quality cordless speaker/hand help phone that has a great range...I think I've taken it off my property to the neighbors (half acre each). Good phone. the sensitive speaker is irritating. I'd shop a little more is I could go back only because of the mic thing",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Chapman",
      "helpful_votes": 2,
      "publication_date": 20160926
    },
    {
      "title": "Great phone at reasonable price!",
      "text": "We needed to replace our old Radio Shack base and one handset. We found the AT&T CL84102 that matched all of our needs and had some extra bells and whistles. The quality of the phone is excellent and we're very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "fishing50",
      "helpful_votes": 3,
      "publication_date": 20190806
    },
    {
      "title": "love this series AND THIS ONE THE BEST!",
      "text": "These are great machines. My Mom had her old one for 8 years, and the only reason we had to get this new unit is because of a lightening strike nearby that fried the unit and the nearby TV. Excellent sound, ease of use, large screen for callers names and good quality answering machine sound and all part of the package. Definite great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Read The Instructions!",
      "text": "And above all else, DON'T lose them. This phone is ok, but the menus are nested in succeeding layers and NOT simple to access. You will need the instructions to figure out which button to press to activate which feature, nothing about using this phone's features is what I'd call \"intuitive.\" The tilt-up screen is a nice thing to have, however.",
      "rating": 4.0,
      "verified": true,
      "author": "The Ancient Gamer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Love this phone",
      "text": "Shipping and packaging were perfect. Bought this to replace the company issued phone base that I use in my home office when I work from home. Company issued base was also AT&T but did not have cordeless option, my headset was tethered to the phone. Bought this and the AT&T DECT 6.0 Accessory Cordless Headset to get my free from my tethered headset. Freedom!!!! Great range and sound, and easily paired with the cordless headset i bought to go with it. Other features like answering machine, speaker phone, etc are rarely used, but work great and are straight forward. I was able to figure out how to use this without pulling out the owners manual.",
      "rating": 5.0,
      "verified": true,
      "author": "Saint Mosley",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "The perfect phone",
      "text": "Absolutely happy with it. It is perfect for my needs: a cordless & a stationary phone (to use if the power goes out for work on-call). The answering machine works and the caller ID announces who is calling. I still need to read the handbook to fully benefit from all the features and wish it was just a bit heavier.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa Thomas",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Extremely nice!!",
      "text": "I do wish the ringer volume could be turned up more but other than that these phones have extremely nice features. I can't say anything about the battery life since we have only had them a few months...so far so good. My elderly mother has no problems using them at all. Nice answering machine also.",
      "rating": 5.0,
      "verified": true,
      "author": "BeverlyD",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "It is great. It announces the caller.",
      "text": "It is easy to program the contact list. I love that I can hear who is calling before I answers. It saves me getting up to look at the caller ID.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Moore",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "VER GOOD QUALITY PHONE",
      "text": "I have a hearing problem and use a Caption Call Phone. I have this phone on my other line and the quality of sound is excellent. Caller I.D. is very accurate. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Honeybelle",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Base is cool, but separate handset horrible",
      "text": "Got this for home to get an answering machine. Prior to this unit, lived with $7 analog phones, no answer machine. The base unit is built very well, and interface design makes logical sense. Two family members over 70 years of age are having no problems working with it. The individual handset however, is horrible. It has a mic problem and you can't even use the phone. It came this way out of box new. Based on what I currently see on the market, and the fact that the base works well, I'm not returning this. I thew away the indiv. handset, and am allowing the family to enjoy the base. Using my cell phone to fill the gap :)",
      "rating": 3.0,
      "verified": true,
      "author": "Infected_Autoreiv",
      "helpful_votes": 4,
      "publication_date": 20140310
    },
    {
      "title": "Works great. Sounds great, looks good!!",
      "text": "I had the corded only version (CD4930) of this high quality phone, when a cordless phone addition was availale, it was a no brainer. And all this from a trusted source like AT&T. I use iy in my home & one in my small office with two more cordless handsets.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete ",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Not what I expected",
      "text": "The day of the week would not set on this phone. The volume for the greeting & an incoming message can not be muted, so it’s heard every time there is an unanswered call. Returned because of this.",
      "rating": 1.0,
      "verified": true,
      "author": "Vicky Davis",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "Time tested brand.",
      "text": "As always, AT&T delivers features and quality you can depend on. Within the past ten (10) years the bases and extension phones that I have purchased performed flawlessly. Recently I required a new base and extension for my retirement home.....There was absolutely no question in my mind which brand that I was going to purchase (AT&T of course). This purchase was made to replace the base and extension of a competitor that only lasted four (4) years.",
      "rating": 5.0,
      "verified": true,
      "author": "HAWKEYE",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "A smart, expandable, quality purchase.",
      "text": "This a great phone with excellent functions. As you scroll through the call id, just lifting the receiver will initiate a call back! The answering system is great, the ringers offer many distinct and audible options as well. Also, the keypad has large easy to feel and nice to touch buttons. I'm still discovering positive options and functions of this system. The portable handset has great range and audio standard for the entire system; even the speakerphone. Well done on this one, thumbs up to AT&T. Definitely recommend this system.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Fitzpatrick",
      "helpful_votes": 3,
      "publication_date": 20150424
    },
    {
      "title": "What a great phone.",
      "text": "I bought this phone for a relative and she never complained about this phone. The phone I was using at the time, was not an AT&T and it was giving me some problems. I ordered mine from Amazon and it is so much better that the one I was using. The caller ID will announce who is calling. If you are making supper this is a great feature, because usually that is when all the people who are selling something usually call. There is a feature on the landline phone that will find your portable phone if you set it down and can't find it. That helps a lot. I would buy this phone again if I need another phone.",
      "rating": 5.0,
      "verified": true,
      "author": "sara sara",
      "helpful_votes": 4,
      "publication_date": 20140217
    },
    {
      "title": "JUNK",
      "text": "Bought this for my elderly parents. It continuously has problems. Either the time never syncs when I set it constantly or the phone goes dead for some reason or another. Terrible phone. Don't waste your money. If it worked, it would be an incredible phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Pinderella",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Great Product",
      "text": "Works well PTT feature makes you lazy, I have the main unit in the living room and the other unit in the room, I use the PTT feature alot Device is clear and easy to install and setup, although the time I found it difficult to maintain the right time without it resetting to the wrong time, finally figured it out, Took out the Sync feature and that solved my problem. Overall I love the product so far Also did I mention that you should get Amazon prime as well, I ordered this product by 10am, ETA was 9pm, I received this product by 5pm. That's great service.",
      "rating": 5.0,
      "verified": true,
      "author": "Prince",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "This is a very good phone and separate handset",
      "text": "This is a very good phone and separate handset. It announces who is calling, per the caller ID, on the 3rd ring. It was simple to set up and the Menu is very easy to navigate. The ring tones available are all very robotic, and no selection for a \"regular ring\" is among them. The back light on the phone base is very bright and the print is large, so it is easy to read. The handset's battery charges very quickly, and there is an icon to show how much battery life is left. Overall, this was a good choice, and reasonably priced.",
      "rating": 5.0,
      "verified": true,
      "author": "BBB123",
      "helpful_votes": 2,
      "publication_date": 20151027
    },
    {
      "title": "Perfect replacement.",
      "text": "Needed a replacement phone for the CL83451 that was left out side for several days and this phone is just like the original.To register the replacement phone all I did was place it in the home base and it does it for you. Let it charge on home base for 12 hours and that's it.",
      "rating": 5.0,
      "verified": true,
      "author": "SPOON",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "High Quality!",
      "text": "I purchased this phone to replace the one that my father in law had. It has been a very good phone! He plays his tv very loud and when I call him, you can’t hear anything in the background. It has a built in answering machine and is well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryt",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Can't believe the low cost",
      "text": "I bought the original 2 phone AT&T setup about 9 years ago. Both phone have been working perfectly ever since. When I saw this add-on handset for $20 I jumped at it and wasn't disappointed. It's exactly like to original. When charged and set in the old holder it quickly installed itself as Handset #3. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "MacGregor",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "supposed to have a charger for the base set. ...",
      "text": "supposed to have a charger for the base set . without this charger cannot use the cordless phone. our old phone quit working. if I return this new phone , we will have no house phone until we can get a replacement. I am 80 yrs old and wife is 78.we need the house phone.label on box says phone comes with a charger. where is it. I do not intend to buy another charger. been waiting for you people for over a week, what i want know is. is this the way you conduct business. I need some help from someone.",
      "rating": 2.0,
      "verified": true,
      "author": "edward c mcclellan",
      "helpful_votes": 18,
      "publication_date": 20170529
    },
    {
      "title": "Great system!~",
      "text": "I ordered this for my 86-year-old mother. Her old phone system died. I was very aware of needing to get a phone that was similar to her old one. This was a perfect fit. The keypad is clear and large enough for her to easily dial out. Loading a new directory was fairly simple. This system also has an announcement for both turning on and turning off the answering machine part. Very clever. The expand ability of this system is an extra bonus. I ordered 3 extra cordless phones to go with it. It's nice to know that if, for any reason, I need to get more, they should be easy to find.",
      "rating": 5.0,
      "verified": true,
      "author": "AZN8TV",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "I have had this phone since Nov 2015 I love it. I also purchased a Canopy 3 year ...",
      "text": "I have had this phone since Nov 2015 I love it. I also purchased a Canopy 3 year plan. I'm having a problem with the hand set on the base. When I get a incoming call and I pick up to answer on the base handset I get this really loud tone. This only happens with the base hand set. If I answer with the cordless remote it is fine. And if I answer by pushing the speaker on the base also ok....I really do not know what to do at this point..Please advise...I'm one of Amazon.com excellent customers. I need you help in this matter..Thank you, Jeanne Trosinski",
      "rating": 4.0,
      "verified": true,
      "author": "JM. Trosinski",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "You get one landline needs to have an attachment 4-wall connection. . very mobile",
      "text": "I love the larger numbers on the corded line. It appears that this is a well-functioning product I cannot comment on the battery life .",
      "rating": 4.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Easy set up",
      "text": "Purchased for my in-laws who recently switched to the cable company frtheir phone service, hence their wired extension phones throughout the house no longer worked. They already had an ATT wired base with answering machine and cordless extension, so cable tech recommended these to add on. Pairing it to the base was simple and they were good to go. Very pleased. Might buy another for Dad to use in garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Carbone",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Beyond Frustrated",
      "text": "Bought this as a gift for my Mom. The wireless hand set went out. She cannot answer calls or hear anyone on the wireless handset. All I hear is Hello? Hello? Call me back. She is frustrated and so am I. We are 3,000 miles apart and this is how we communicate. Very frustrating and I feel like I have wasted my hard earned money.",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20171024
    },
    {
      "title": "Iffy phone",
      "text": "Not ideal for outside use but they get their job done",
      "rating": 5.0,
      "verified": true,
      "author": "Erik Walters",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Finally my wife can hear!",
      "text": "My wife has hearing problems & can only hear on 1 or 2 of our older phones. But both of these phones are great for her, plus with the caller ID feature it shows and announces the caller both for her. Features like volume control & speakers make if a lot easier for her to hear the callers. A vast improvement over our older phone answering machine.",
      "rating": 5.0,
      "verified": true,
      "author": "William J.",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Good phone",
      "text": "I ordered this phone for my parents. They are happy with it and its features. I like how clear all the buttons are labeled. The sound quality is good when I talk with them on the phone. I like the fact that the answering machine can be accessed from either the base or the portable handset.",
      "rating": 5.0,
      "verified": true,
      "author": "E. R. Pannell",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Phone stopped working?",
      "text": "It worked well for about 3 months but then the phone on the base stopped working. Nothing happened to it, I live alone and have no kids that could have broken it, so I don't have any clue as to why the speaker in the phone stopped working. I can still use it on speaker, and when I forget that the phone part doesn't work and pick up the receiver to answer, people seem to be able to hear me, I just can't hear them. Its a little frustrating. Probably wouldn't buy this one again, only for that reason.",
      "rating": 3.0,
      "verified": true,
      "author": "Genevieve Harris",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "This telephone is absolutely the most confusing, user UN-friendly ...",
      "text": "This telephone is absolutely the most confusing, user UN-friendly that I could ever imagine. One has to hit 'menu' and scroll through it to get to what you want, and heaven forbid if you hit the wrong button, as then you have to wait and wait for the phone to reset itself and you start all over again. Also, several times I have tried to make a call from the handset, and the person I am calling cannot hear me and hangs up. Also, often the handset has an echoing problem, which makes it confusing when talking to someone. I am contacting Amazon to see what can be done.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonAddict!",
      "helpful_votes": 2,
      "publication_date": 20150120
    },
    {
      "title": "Great phone",
      "text": "I bought this for my mom I haven't had any complaints about it so far so I guess it's safe to say it's a great phone. When I speak to her the sound clarity is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "TY",
      "helpful_votes": 3,
      "publication_date": 20170520
    },
    {
      "title": "Great Sound Quality",
      "text": "This is the best desk top phone I've ever had. The many features are easy to use and find. The silver and black color and design is attractive and the buttons are large and easy to use. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Beachfire",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Very happy that it turned out to work as designed. My second AT&T phone set.",
      "text": "Very clear text displayed from base. This is very useful when I need to key in information in response to automated prompts when calling businesses (e.g. account number). Remote handset has a very good connection - I can not detect an audio difference from the base phone. I had a prior AT&T unit before which I was very pleased with. Finally, after around 7 years, the batteries no longer charged so it was time just to swap out for later version.",
      "rating": 5.0,
      "verified": true,
      "author": "SW In Hawaii",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "Phone cuts out",
      "text": "We have purchased this phone twice. The first one had a problem with the corded handset. It would cut out and we wouldn't be able to hear the person on the other line. So, we bought another one because that was easier than buying a new handset. One month and ten days later (Amazon won't let us return it after a month) the new handset is doing the exact same thing. I tried to call the customer support number that was posted in response to other negative reviews but I was never able to speak to a person. A recording provided me with instructions to send it back, but that would leave me without a phone. Very, very dissatisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20140513
    },
    {
      "title": "All that I hoped for - until I need to buy a base for one of the phones.",
      "text": "I'm very satisfied with this set and am confident it will last a long time. After a few weeks have gone by, I decided to hookup the phone in my shop. I had not got around to this earlier. Unfortunately, I found I either didn't receive the base to this phone of lost it somehow. I thought well, I'll just buy a base, it only seems to connect the phone with A/C, how expensive can it be (I'm thinking $5-10)? Turns out you can't buy just the base, you have to buy the whole phone - over $20. Brings back previous memories of AT&T \"ripping me off\"...",
      "rating": 3.0,
      "verified": true,
      "author": "Larry Poffenberger",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Good looking and loaded with useful features.",
      "text": "This (and an added handset) replaced a perfectly functioning older system so that we could have three phone locations. The nice appearance and added features (intercom, call transfer, paging . . . ) were a bonus. I was impressed by the sound quality of the speaker phone on the base set and on the handheld phones, it is much better than the older system we replaced. The \"spoken caller i.d.\" is a bit . . . umm . . \"odd\" -- this is the first phone I've used that makes independent announcements -- but I think I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "W. J. Laudeman",
      "helpful_votes": 2,
      "publication_date": 20140311
    },
    {
      "title": "Excellent land phone for the price",
      "text": "This is my second AT&T land phone with extension in 12 years. The sound quality is excellent and it simply works for years. I purchased a new one recently-- not because I needed it, because I thought it was time. I use it constantly and rarely use my cell. Highly recommend this brand and model.",
      "rating": 5.0,
      "verified": true,
      "author": "sjsm",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "AT&T CL84102 Dect 6.0-- 2 Handset Landline Telephone",
      "text": "This AT&T landline phone with answering machine is great. The display is large, easy to read and very informative. It has numerous special features that you will love, e.g., recording detailed calls, announcing calls, speed dialing, etc. I highly recommend buying this phone. It is a very good product for the price. The best feature is that it does not require extra batteries for the base unit like other phones.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy M.",
      "helpful_votes": 149,
      "publication_date": 20121018
    },
    {
      "title": "... and 3 cordless phone came with it for a great price. Electric struck and knocked all 4 phones ...",
      "text": "After buying one just a few months ago from Amazon the land line and 3 cordless phone came with it for a great price. Electric struck and knocked all 4 phones out thru phone line somehow. So had to order another one which I could not find, so I found this at the same price I love it, just wish it had more than one cordless. But it's a great product. I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "S.Y.",
      "helpful_votes": 0,
      "publication_date": 20180428
    },
    {
      "title": "Dependable unit.",
      "text": "Good phone. It replaced a similar AT&T phone which finally quit working. Very good price. I have three cordless phones from the old phone. They had to be registered by the old phone and registered with the new phone in order to work. This was no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "David ",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Works quite well, however no jack for hands free use and cordless unit must recharge every day or it dies with heavy use.",
      "text": "Works fine for what it is. Two complaints: 1) The cordless unit does not last very long on its charge. It will work all day with several hours of calls but if you forget to place back into the charge base overnight you can find yourself with a dead battery the next day. 2) It would be nice if the cordless unit had a jack to plug in a head phone unit. One cannot use this phone to conduct lengthy business with at home, as one hand has to keep hold of the phone and you only have one hand free to type.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Jones",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Read MY Review!",
      "text": "Yukky! Problems, Problems, Problems. Won't charge. Won't connect. Won't work. A real shame too cause it has everything anyone would want in a phone. But in the end, it's just more junk from China. Sometimes it'll work, sometimes it won't. You never know until after you buy it and take it home. A real crap shoot every time. AT&T should have better quality control than this, but I guess they just don't care anymore. Junk from China.",
      "rating": 1.0,
      "verified": true,
      "author": "Fel Angel",
      "helpful_votes": 3,
      "publication_date": 20160126
    },
    {
      "title": "Quality of product",
      "text": "I bought this exact item about 2.5 years ago and then it failed. I hope this time the product will last longer than 2.5 years. The price of the item increased from first time I bought the item as compared to this time by some $15.00. This is old technology, not new and the price of the item should have been less and not more.",
      "rating": 3.0,
      "verified": true,
      "author": "Daryl O. Jones",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "He likes the large numbers that are easy to see and read",
      "text": "Purchased for my Dad who's 87. He likes the large numbers that are easy to see and read. The answering machine is easy for him to use. Was happy with the extra phone and the ease it was to hook up in his bedroom.Had looked at other phones but this is by far the best he seen.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Callers message sooo loud! It YELLs your calls & you can't lower that volume.",
      "text": "So if you have caller id and you don't want to pick up the phone, this phone announces whose calling. \"Jane Doe\" it'll say twice. But if you decide not to pick up and screen Jane Does message, it YELLS it for the whole house to hear! And there is no way to lower that volumn except mute, but then you can't screen your calls! Hate it. The rest of the phone works fine. I would have returned it if I caught it in time.",
      "rating": 2.0,
      "verified": true,
      "author": "Melisanthy",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "This phone is easy to use",
      "text": "This phone met all my expectations. I wanted a cordless handset, but also an answering machine and the ability to make calls during a power outage. This phone is easy to use, has easy to read numbers, and clear sound. The only drawback, and it's minor, is the battery life on the cordless handset is a bit lacking. Don't leave it off the charger for more than a day. You may get the low battery alert. But great phone overall.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20161213
    },
    {
      "title": "Usually perfect set, problem with the cordless",
      "text": "I always buy this same set and love them, this set came with the cordless phone not charging. used it fine in the beginning but now the batterie is not charging, the red light is on and it never turns green. people cannot hear me on it now with the low batterie, I always have it on the charger when not in use. this is my only phone so I cannot send it back, would like a new cordless and charger.",
      "rating": 1.0,
      "verified": true,
      "author": "susieq",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "tHIS IS EXACTLY WHAT i NEEDED, but, HAVING ...",
      "text": "tHIS IS EXACTLY WHAT i NEEDED, but, HAVING Ttrouble with the hand set, followered the directions & let it power up for not 10-but 12hours all it says LOW BATTERY, ,something is wrong !! Hardly used it for that reason, don't want to lose a call.",
      "rating": 3.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Great for a Home Office",
      "text": "I have a home office and this allows me flexibility to either work from my desk or roam around my home to carry out business. I don't use the answering function because I have voice messaging though my cable provider (besides, try and get one without that feature). It's straight forward, allows me to conduct conference calls and the battery life on the handset is more than ample for my needs. I've been using it for over a year now and have no complaints. A nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony O",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "A refurbished unit.",
      "text": "I purchased a used, refurbished AT&T Expandable Corded/Cordless DECT 6.0 phone with 1 handset nearly 7 months ago, and was suddenly unable to receive calls on either the base or the handset. I neglected to purchase a Protection Plan. I should always purchase a Protection Plan I know, and will not make that mistake again. Fortunately a friend worked on the unit for me. and it is now working again.",
      "rating": 2.0,
      "verified": true,
      "author": "GPR",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Excellent phone",
      "text": "Been using this phone for the past 2 months. This is the best phone ever bought. Pros: voices are crystal clear, wireless range is very good, answering machine and both wireless handset and base phone have speaker phone. The feature I enjoy the most is that I can use my wireless hand set from anywhere in my yard as an intercom to call the base phone.. Cons: buttons on both base and wireless phone are not lighted for use in the dark I would definitely recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "snowdog5594",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "Good Phone--Problem With Time",
      "text": "I have 2 of these accessory handsets. I like the fact that they do not need to be plugged into phone jacks; and the same features that exist on the corded landline model exist here. However, since they are accessories of the landline, I am having the same problem with the date that I have on the landline--I reset the date; however, when a call comes in, the date displays as one hour later than it actually is. This is something I have reset many times on the landline phone, but the date still reverts. This is my reason for the 4-star rating. Perhaps this annoyance would not bother someone else, in which case, I would recommend the phone.",
      "rating": 4.0,
      "verified": true,
      "author": "pink_icicle",
      "helpful_votes": 0,
      "publication_date": 20130702
    },
    {
      "title": "CL84102",
      "text": "I like this phone. Up and running in less than 10-minutes. It has all the bells and whistles anyone could want in a home phone, and more than I'll use. The back lit LCD display is large with block style letters, very easy to read without eye glasses; and it announces the caller, a feature I have decided to leave enabled. The display dims after a few seconds when the hand set is hung up. Works during power outages if you have standard service. If it only the large number buttons were lit, I would give the coveted fifth star.",
      "rating": 4.0,
      "verified": true,
      "author": "Granddad",
      "helpful_votes": 2,
      "publication_date": 20130802
    },
    {
      "title": "Nice phone, does the job.  Great for my parents.",
      "text": "Upgraded my parents' home phone with this, from an old off-white Panasonic something-or-other. The range is great, as my parents spend a lot of time in the backyard, and it's great the it has a corded handset. Being older, they still use the handset for most calls at home, and the audio quality is good. The numbers are pretty large, as well as the caller-ID. We have it wall-mounted.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff hollis",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "Great phone!",
      "text": "Changed phone provider for mom and went digital and so far it's amazing! I like the fact there's one that's not cordless so she can talk longer without dead batteries!",
      "rating": 5.0,
      "verified": true,
      "author": "DoxieLover",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "It's a housephone and it works well.",
      "text": "Easy to set up, we like the convenience of not needing multiple phone jacks and being able to chat between the 2 phones. Expandable so we can buy more handsets in the future. Glad to find a set with a corded phone since cordless won't work during power outages!",
      "rating": 4.0,
      "verified": true,
      "author": "MissesEm",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "I really like being able to add additional phones.",
      "text": "The phone set arrived promptly and operates exactly as described. I would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fern M Deatherage",
      "helpful_votes": 3,
      "publication_date": 20170831
    },
    {
      "title": "Additional handset exceeds expectations.",
      "text": "Very easy to activate and set up with the existing base unit. Battery life is considerably longer than the older handsets.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph ray justice, jr",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "I love the base as well as the cordless remote phone",
      "text": "I love the base as well as the cordless remote phone. I considered just a base or just a cordless and this is much nicer than I thought. I picked ATT fo the reliability. I have had this a month and it's performing well. Getting in and out of the menu is rather frustrating as you have to use the up and down arrows to find stuff and then cancel to go back. But we don't get a lot of messages so it's not that bad. The buttons are big and easy to read and I like that the base read out tilts up. Nice phone for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "R.Davis",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "This landline handset is very cheaply made....",
      "text": "and I'm very annoyed at how easy you can over modulate when using the extension handset. You must almost whisper to eliminate that horrible feedback when trying to talk. Electronics being what they are today, and considering how AT&T is a quality company, there is no reason for them to put heir mark on a piece of crap like this thing is. For a few pennies more, the electronic components in this unit could have been vastly better. I would not be buying this again.",
      "rating": 2.0,
      "verified": true,
      "author": "Gunther",
      "helpful_votes": 2,
      "publication_date": 20140423
    },
    {
      "title": "Easy to use with the bigger baseed",
      "text": "Easy to use with the bigger baseed, land-line phone that is sold separately. Just plug in the base, let it charge, follow directions (easy), and in no time it works Don't forget to check the product # as it is confusing at times...get the one that matches the base system you are using.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "easy to use phone",
      "text": "This is the 2nd one of these that I've had. The first one just stopped working after a few years. I don't know why. In any case I bought the same one because it's so very easy to program and the volume is high and very clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Perfect. Just the features I wanted",
      "text": "Perfect. Just the features I wanted. Corded hand set on base and a cordless hand set. Additional features are just what I need. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "None",
      "helpful_votes": 3,
      "publication_date": 20170720
    },
    {
      "title": "Very good phone!",
      "text": "Good phone, as described quality phone, cordless handset has quite a distance on it was very surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "mumof5",
      "helpful_votes": 3,
      "publication_date": 20170603
    },
    {
      "title": "Nice phone",
      "text": "Nice phone and answering machine for us land line users. No complaints",
      "rating": 4.0,
      "verified": true,
      "author": "MellowRose",
      "helpful_votes": 3,
      "publication_date": 20170830
    },
    {
      "title": "Happy with a landline for first time in many years",
      "text": "Nice system with high quality audio and good range of features",
      "rating": 4.0,
      "verified": true,
      "author": "vegas mike",
      "helpful_votes": 3,
      "publication_date": 20170918
    },
    {
      "title": "a few good phones",
      "text": "Although the first one I received was defective and the base corded phone made you sound like a chipmunk, Amazon's replacement policy saved this review. The new phone works as it should and I really like the convenience of a portable but the security of a corded phone that doesn't need to be plugged into an outlet to make a call. Very versitale. Would have got 5 stars except for the headache of returns. If it doesn't work the first time, give it another try.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "A great product but ordered the wrong one...",
      "text": "Although I ordered the wrong product, ordered CL80111 and should have been CL80100, it seemed like a good product. Didn't return it since I ordered the wrong one, didn't want to deal with returning it and paying shipping. It worked fine, but was not compatible with the base set. Turned out my brother-in-law ordered a base set for his Mom and I gave him this one to use as a spare for his Mom's handset or a 3rd phone in her house. I did like how they put a plastic covering over the decaled letters and colors, which rub off on the CL80100 with use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Lynn",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Loved it! Immediately ordered it for my house to ...",
      "text": "My sister had owned this system in her house in another city. She recently moved to an area close to me and ordered it for her new house. I was able to see it and put it through its' paces. Loved it! Immediately ordered it for my house to replace the 10 year old phones in my house. Easy to install and program. If you still have a land line and you are looking for a new phone, take this one into serious consideration. Also has accessories to customize to your liking. One of my best purchases this year!",
      "rating": 5.0,
      "verified": true,
      "author": "Golf Bob",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "This phone is excellent, there is a feature for every convenience and ...",
      "text": "This phone is excellent, there is a feature for every convenience and the performance is excellent. The clarity is very good. I'm completely satisfied with this phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170830
    },
    {
      "title": "THE PRICE",
      "text": "SOUND QUALITY,VOLUMEN,CONTROL. BATTERY LIFE I BUY FOR ME BECAUSE I DID NOT LIKE THE CELULAR PHONE",
      "rating": 5.0,
      "verified": true,
      "author": "Leticia Sanchez",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Would buy again if it lasts at least a few years longer",
      "text": "I purchased this telephone set in 2013 at a very affordable price. It has been very reliable with very clear reception, and pairing with my other phones in the house,etc. Currently it has begun to make loud crackling sounds during use. I initially thought the sound was coming from my caller's side but soon discovered that it was actually my phone. Not certain if that means that the set is getting ready to die. If it dies AFTER only 2-1/2 years, I am NOT going to be happy.",
      "rating": 5.0,
      "verified": true,
      "author": "CARO",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "They have improved over the years.",
      "text": "I love my new phones. My old ones “died” after 20+ years. These are a little more modern. Same brand.",
      "rating": 5.0,
      "verified": true,
      "author": "bananaboat",
      "helpful_votes": 0,
      "publication_date": 20200108
    }
  ],
  "product_meta": {
    "title": "AT&T CL84102 DECT 6.0 Expandable Corded/Cordless Phone with Answering System and Caller ID/Call Waiting, 1 Corded and 1 Cordless Handset,Silver and Black",
    "description": "Size:1 Corded and 1 Cordless Handset| Color:Silver & BlackCorded/Cordless Answering System with Caller ID/Call Waiting\n\nMANUFACTURER CONTACT INFORMATION\nFor any technical details contact manufacture at (800) 331-0500",
    "rating": 4.3,
    "feature_bullets": [
      "DECT 6.0 Technology. Caller ID Announce. HD Audio.",
      "Caller ID/Call Waiting — Stores 50 Calls",
      "Up to 14 Minutes of Digital Recording Time",
      "Expandable System up to 12 Handsets (Uses CL80111 Accessory Handset)",
      "Refer instruction manual before use.",
      "50 Name and Number Phonebook Directory",
      "For optimal performance batteries should be charged for 16 hours prior to use"
    ],
    "specifications": {
      "Product Dimensions": "9.1 x 4.3 x 8.7 inches",
      "Item Weight": "3 pounds",
      "ASIN": "B007B5VGFA",
      "Item model number": "CL84102",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "4.3 out of 5 stars1,908 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#5,014 in Office Products",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 20, 2012",
      "Manufacturer": "AT&T"
    },
    "categories": [
      "Office Products",
      "Telephones & Accessories",
      "Landline Phones",
      "Electronics",
      "Office Electronics"
    ],
    "price": 54.95
  }
}