{
  "website_summaries": [
    {
      "verdict": "Despite the added features, the Amped Wireless High Power Wireless-N 600mW Gigabit Dual Band Router R20000G doesn't impress as much as the previous model, and hence fails to justify its higher price tag.",
      "pros": [
        "The Amped Wireless High Power Wireless-N 600mW Gigabit Dual Band Router R20000G supports true dual-band connectivity and USB-based network storage",
        "It offers decent range on the 2.4GHz band and very good data rates on the 5GHz band"
      ],
      "cons": [
        "Amped Wireless' R20000G doesn't support the 450Mbps standard, runs hot, and has terrible data rates on the 2.4GHz band and relatively short range on the 5GHz band",
        "The router's built-in USB port doesn't support printers and didn't fare very well in terms of storage performance, either"
      ],
      "aspects": {
        "Setup": 7.0,
        "Features": 6.0,
        "Performance": 4.0,
        "Support": 7.0
      },
      "publication_date": 20120514,
      "rating": 5.8,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "... back up - and Amped wireless customer support is useless! i stopped even attempting to return it because ...",
      "text": "I have purchased about 10 of these in the past year and noticing about 25% of them are becoming defective over time - signal will drop out of no where then come back up - and Amped wireless customer support is useless! i stopped even attempting to return it because their respond time is very long and even last case they didnt respond at all..soooo Im not buying anymore of these * but to be fair, the ones that are working, are pretty good but nothing overly special",
      "rating": 2.0,
      "verified": true,
      "author": "M.A",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "Overall, a powerful and sort of unreliable router",
      "text": "I'll keep this short: If you're a gamer or looking to extend your wireless network's borders, you could do much worse than this router. I thought I'd get QOS configuration that would be a bit more granular before I logged onto the admin panel. Then again, not sure what I expected. I bought this router because I wanted to ensure my renter, who shares my ethernet, wasn't hogging bandwidth while I gamed in my upstairs office. :-) So, good router, works well, and contrary to some peoples' b!tching on here, I thought setup was a breeze. Addendum: Router gave up the ghost after about two years of using it. Died a little soon, IMO.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Dunlavy",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "Great.",
      "text": "I researched this router quite thoroughly. My main concern was LAN/WAN throughput (mostly WAN to LAN). The other important factor for me was range. This router is fast! I pay for the fastest internet service from Cox and now I can actually use it. Interestingly enough, my old router was also listed on the website, but was one of the poorest performers when it came to throughput. That's what lead me to research routers. The range is great. No problems there. I also have not had to reboot it like I have had to do with my other linksys (aka linksys by Cisco) branded routers.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Hillis",
      "helpful_votes": 7,
      "publication_date": 20130319
    },
    {
      "title": "Confusing interface -- be sure to update your firmware",
      "text": "The interface was a bit confusing, and it seemed like when you made almost any change the router would need to be rebooted (which was a 6 minute process). Older firmware revisions yielded spotty/terrible wireless speeds but were later fixed in newer firmware revisions. Step one should be to update the firmware on this device to make sure you're covered against most of the bugs.",
      "rating": 3.0,
      "verified": true,
      "author": "David Francis",
      "helpful_votes": 3,
      "publication_date": 20131216
    },
    {
      "title": "Increased range",
      "text": "I used \"inSSIDer\" ( a free program to test wifi signal strength). Our TV was in the yellow (weak). This router made the whole house wifi accessible and in the green range. The upgrade was from a department store netgear router to this Amped. I have my PC hardwired into this Amped and its' gigabit port in back allows me to access the full capabilities of bot my PC games and Comcast Xfinity ' downloads speeds (up to 35 mps over netgears' 17 mps).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131027
    },
    {
      "title": "Average Results - not worth paying more than other cheaper routers",
      "text": "This product has been disappointing. I bought it to replace a lower-end consumer router, and the results have been almost identical. I've moved it around, changed the antennae, and restarted/updated it, but nothing has improved. The 5.0 band is a bit better than the 2.4 band, but not enough to change the review. The customization options are pretty good (block IPs, MAC addresses, etc), but the so-called WiFI Analytics software is a joke, looking like it was programmed by a teenager. Not terrible, but not worth a premium",
      "rating": 2.0,
      "verified": true,
      "author": "Sean D. Ryan",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "Not worth the price",
      "text": "I am a point of sale system IT, we most of times have to work with wired and wireless network to setup our systems, we used this router twice hoping to get a powerful extra range WIFI signal for mobile devices we provide, we thought this device can do the expectation but never did, any other regular cheaper router can do the job better, yesterday we had to swipe one and replace it with other basic wireless router we got better result than the dual 1000 feet range Amped router, soon we are going to swipe other Amped device in other location were we had installed.",
      "rating": 1.0,
      "verified": true,
      "author": "SF-GATE",
      "helpful_votes": 0,
      "publication_date": 20130816
    },
    {
      "title": "Was hoping for better",
      "text": "I read mixed reviews and I typically don't put much credence to them. I did get better Wi-Fi signal coverage but the transfer rates were not that good. I should have spent a few more bucks and bought the ASUS Black Knight. There weren't that many good reviews done by leading magazines. I installed the latest firmware and now it hangs up when I change settings and have to unplug the router and plug back in. I have a few more weeks before my 30 day return policy expires and I'll give it another week or two before I decide to return for the ASUS router.",
      "rating": 3.0,
      "verified": true,
      "author": "Tom W",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Not as powerful as advertised",
      "text": "Plus: easy to set up, in fact a breeze. Cons: one big con is the fact that is not as powerful as advertised. The router location in the house makes it difficult and bought this router to be able to broadcast in the whole house. Despite of the \"high power claims my data rate was very low. Ended up returning it and getting a couple of ASUS (RT-N12/B) on sale for a fraction of the cost. The repeater function of the asus solved my coverage problem.",
      "rating": 1.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Awesome little power house...!!",
      "text": "I wanted to wait at least a week or so with this new router before posting a review. One word ; EXCELLENT...!...now I know that every house is different so what works in mine might not work in yours. I was having really bad connection issues with the NetGear router I had. Since buying this little power house baby, all my issues are gone and I get a super strong signal everywhere in my house. It was breeze to set up. Plug it in in, follow the install genie and it was done in under 10 mins....",
      "rating": 5.0,
      "verified": true,
      "author": "MDAN",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "augh",
      "text": "We got this router that promises long range. We are in a 1200 square foot apartment and there area dead areas 40 feet away. Spent several hours on the phone with customer support who suggested we buy the extender (which also ended up not working either). They promised to resolve the matter and said that our devices are defective but want us to pay shipping both ways ($15 per direction). To be returned. Be weary, product does not live up to its guarantee!!! What a waste of time on the phone with their customer service!",
      "rating": 1.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "Their Tech Support is great, but the unit is not performing as advertised ...",
      "text": "Their Tech Support is great, but the unit is not performing as advertised or I hoped. Was able to find a 1000mW Mikrotik RB2011Ui RouterBOARD RB2011UiAS-2HnD-IN Wireless Router 5 Gigabit LAN for less that I paid for this although it's not user friendly. But I'll figure it out if it works better and repurpose the AmpedW. I have plenty of places that are not as mission critical that this should do just fine. Like replacing my R6300v2 (dog).",
      "rating": 3.0,
      "verified": true,
      "author": "FarmerBob",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Arrived DOA.",
      "text": "Item never worked. Two lights would display on front whenever plugged in, no matter what you have connected. Lights would change to other numbers when you held the router just right. That's when I knew it was dead. Never connected to anything, so I could never get to setup. Customer service didn't act like they believed me or something over email, just told me to do the steps in their FAQ. I returned for money back because they took too long to send me that email anyways, probably 2 1/2 business days. Other reviews act like their cust service is awesome, maybe they are and my guy wasn't feeling good those 2 1/2 days.",
      "rating": 1.0,
      "verified": true,
      "author": "Jon Stewart",
      "helpful_votes": 0,
      "publication_date": 20130207
    },
    {
      "title": "Average",
      "text": "Okay for basic WiFi at an above average signal, but it doesn't broadcast as strongly as advertised, and it doesn't work with air print. Customer service is very responsive and professional, but they couldn't solve the problem. Finally gave up and scrapped the router and an Amped Wireless repeater. Switched to a different brand with an access point set up and it works perfectly.",
      "rating": 3.0,
      "verified": true,
      "author": "George Pelton",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Excellent product: no hype",
      "text": "This router actually does what it's supposed to do. It more than doubled the range and strength of the signal. Setting up was easy, with the only problem being that my airport express would not connect. I called support and after an interminable time on hold (got to fix that, guys) I was connected with Cedrick- concierge 115-- who walked me through it quickly and calmly and I was up and running within minutes. I finally have wi-fi throughout the house and even out on the porch with a strong steady signal.",
      "rating": 4.0,
      "verified": true,
      "author": "T-Bone",
      "helpful_votes": 0,
      "publication_date": 20130614
    },
    {
      "title": "Not worth it, at all.",
      "text": "Terrible. This thing crashed all the time, rarely reached the speeds of my cable connection and couldn't handle more than a few connections (wifi) at a time. I guess I got lucky that it went dead after a storm. If you buy this make sure to get the Protection Plan. Mine was dead less than 3 months after I bought it.",
      "rating": 1.0,
      "verified": true,
      "author": "Alex Newton",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "don't know if I love it or not",
      "text": "Bought to replace a Cisco 'N' router to get extended wireless range. To date haven't realized any difference. This may be based on my installation, but after many attempts, haven't been able to reach a live person at Amped for assistance. I even left my telephone number via email. Comments from other writers indicated there phone service is the best, a main reason for the purchase from an unknown, to me, company. Any way, it may be a great product, i am disappointed in the expense an have not solved my range problem.",
      "rating": 3.0,
      "verified": true,
      "author": "rttiii",
      "helpful_votes": 2,
      "publication_date": 20130506
    },
    {
      "title": "Trying to be nice here",
      "text": "I returned this router. I am reasonably good with technical stuff, but this router was horrible. The range was not as advertised. My old TP-Link 54mbps router with one antenna has better range. (based on walking around the back yard with the computer and watching the bars move) I upgraded the firmware, changed channels and frequencies, and it didn't get any better. Our house is only 1000 sq. ft. and we had dead spots. Then to top it all off, it kept dropping connection. I would have to reconnect about 3 times an hour on average. Do yourself a favor and don't buy this router.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Stever",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "was at a horrible state (internally) dropping the signal every 5 minutes",
      "text": "Not even usable,was at a horrible state (internally) dropping the signal every 5 minutes,if i connected two devices into it it would work for like 3 minutes, Really unsatisfying, Would say another review if it was new,but this item used? Never buying it again..",
      "rating": 1.0,
      "verified": true,
      "author": "Alexis R.",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Great output an thru put",
      "text": "I have a two story house and had to run two wireless units before and still had some dead spots. This unit covers everything with no problems. Upstairs and downstairs and out on the porch too. Runs 1 TV using Netflix, 3 computers, 4 tablets, 3 smartphones, Blu-Ray, Stereo using Pandora and Slacker, two game consoles and a partridge in a pear tree with no problems. Has great speed and is easy to setup. Would recommend to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Good Times",
      "helpful_votes": 0,
      "publication_date": 20130913
    },
    {
      "title": "no better",
      "text": "I thought Amped and High Powered would mean that it would be better than an average router, but that is not the case. It is no better than my small Belkin (which I have had a lot of trouble with) , but it is not any more powerful or stronger. I sometimes don't even have Wi-Fi across the living room. When I called the Amped store they said they could give me a discount on another product that would help me with more distance, but that is why I bought a High Powered Router. I didn't realize You would need another product to make the first one work.",
      "rating": 2.0,
      "verified": true,
      "author": "gee123",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "Not good coverage",
      "text": "Not getting very good coverage. I bought this because I need to have wireless coverage during a bowling tournament. The bowling center has 44 lanes, so it is a large space. I do not however believe it is over 10,000 sq ft. which is what this unit is supposed to cover. The bowling center does not have wireless and I am not able to detect any other wireless signals in the bowling center. I need to be within 10 lanes of the router, otherwise I loose half the signal. I will keep trying different settings and see if I can figure out how to increase the range.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeffrey R. Riley",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Not a super long range solution",
      "text": "It works but is not some super router. Due to length of time and power surges I have owned several wireless routers that have been in the same location and this one does no better than the others. FYI - stop worrying about how many \"bars\" you see and do a speed test. I get 4 bars but less than 10MB out of the 30MB service I get within a few feet of the router. Added a router and ran a wire to the other end of the house and added a new access point. Now I get the full 30MB in both locations.",
      "rating": 3.0,
      "verified": true,
      "author": "Bama John",
      "helpful_votes": 2,
      "publication_date": 20131025
    },
    {
      "title": "Easy to setup",
      "text": "Serving as a base station with two Amped range extenders, and this network works perfectly for multiple TVs, tablets, phones, etc on 2.4 and 5.0 GHz. Easy to setup, and... well... I don't have to mess with it. Port forwarding, DHCP, all the regular stuff easy to navigate so I can't speak to the documentation. Will buy more Amped products.",
      "rating": 5.0,
      "verified": true,
      "author": "jeffro",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "Setup and Tech Support (5 stars); signal strength (4 stars)",
      "text": "I'm still working with tech support (smart, available, and helpful) trying to increase the signal strength which so far is only Excellent in my home office where the router is located. In other parts of the house (even on the same floor), it is either Good or Weak. When I get the advertised signal strength, I should be able to give it 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Luise Healey",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Good",
      "text": "This router claims it can reach 10,000 sqft. I am not sure that is completely accurate... I have a 2500 sqft home and I still need extenders... maybe if this was outside, or you had no walls to your house... However, this device replaces a Linksys router that was outdated and not performing well... This device was extremely easy to set up and connect to!",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffrey",
      "helpful_votes": 0,
      "publication_date": 20121119
    },
    {
      "title": "Unreliable and bad range compared to other routers",
      "text": "I thought I was getting one of the best router on the market with good range and reliable connection. I am disappointed with this product. Not only, I am getting bad range, but I am not getting reliable connection. I have an older ASUS (RT-N12) router, that I am now using as access point (on a different frequency). I get good reliable signal from my Asus router than the Amped Wireless. I have not called the tech support to troubleshoot the issues. I will be calling very soon to get more information from them. I will update this review once I do that.",
      "rating": 2.0,
      "verified": true,
      "author": "Dharmik Patel",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Very surprised on quality, power, interface",
      "text": "I must say I am very impressed with this router. The web interface is nice. The power is at least two bars higher throughout the house. The setup was super quick. Please note the WEP is in advanced setup. I did upgrade the firmware, but I recommend that for EVERY product out there. Update on June 2016, still an amazing router, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Hammertymme",
      "helpful_votes": 3,
      "publication_date": 20120922
    },
    {
      "title": "Great Router with a lot of features",
      "text": "Airprint and many other features are available. The range is excellent with the 2.4Ghz band. The 5Ghz band is ok but shorter. It was easy to set it up. I used it now as an access point (yes, I converted it but doing multiple steps). I have a Uverse router which is useless, locked and have no features; so I do want a router with features but wanted to avoid double natting. This router was perfect for this.",
      "rating": 5.0,
      "verified": true,
      "author": "Yaser Elkhatib",
      "helpful_votes": 0,
      "publication_date": 20121211
    },
    {
      "title": "No better than my other routers",
      "text": "I have tried several routers in my home and none of them adequately cover the home. I had high hopes with this router but was highly disappointed because it actually provided less coverage. Yes I updated the firmware and I contacted support. The last time I talked to support I was told that it simply won't work for me and I should return it. I will be returning this tomorrow. I feel bad for Amazon because it isn't their fault yet it will cost them money (man-hours) to process my return.",
      "rating": 1.0,
      "verified": true,
      "author": "Davis",
      "helpful_votes": 0,
      "publication_date": 20120731
    },
    {
      "title": "Works like a champ in two-story home",
      "text": "I bought this router because the signal from my old router (an out-of-date Belkin) was spotty at best, particularly from downstairs (the router is in my upstairs office). After a quick and easy setup, I have the laptops and desktops connecting on the 2.4gHz band, the PS3 (which is connected to a wireless-n access point) and smartphones connecting on the 5gHz band, and I haven't had so much as a video stutter on any device. The signal even carries well outside the house. Could not be happier with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "Solid router, better than average WLAN range.",
      "text": "I replaced my existing Linksys WRT610N router because I was looking for better wireless range. I've found this router to provide greater range and a solid signal. The only issue I've had was with the administration webpage, I was unable to use the url listed in the manual (setup.ampedwireless.com) and instead had to use the ip address. No problem, except that each time the router saved the configuration it redirected back to setup.ampedwireless.com. Like I said not a huge problem, just an annoyance. Overall this router has been living up to expectations, I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph",
      "helpful_votes": 0,
      "publication_date": 20130520
    },
    {
      "title": "Not so high powered.",
      "text": "I thought a \"high power\" router would extend the range beyond the router I was using. Apparently not. I saw no improvement over the Netgear router I had been using for the last few years. Customer Support suggested I should have bought something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Lynda  L. Sudlow",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "This works great, I have had no issues",
      "text": "This works great, I have had no issues. I try to never use the \"setup for dummies\" wizard, it takes some sleuthing to get past it, but it works great for me",
      "rating": 5.0,
      "verified": true,
      "author": "Vandergelder",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "They work great!",
      "text": "I bought two of these for my house and I use them to resend my internet signal on each floor. They work great!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Ekstrand",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Great Router",
      "text": "I know there are mixed reviews but I purchased this because I have setup a network in a building that currently takes 3 wireless routers. 1 as an AP and the other two repeating. With this one router it covers the entire area with 2 bars to spare. Speed seems good. I will also be placing one in another house which currently needs two routers to cover the area.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20130402
    },
    {
      "title": "Amped wireless high power Wireless-N 600mW Gigabit Drual Band Router R20000G",
      "text": "I haven't had the Router long so time will tell better how I like it. I had a problem setting it up but called the support number and was greatly helped by Cedrich-Cocierge #115, he got me going. I had hoped it would reach a little chapel about 100 feet from my house but the computer couldn't connect so I was a little disappointed that is why the three stars. It works well in the house and to my smart TV.",
      "rating": 3.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "The Amped SR20000G Wifi extender works great!!",
      "text": "Read some good reviews. This is my second review ever. The reason for writing is Ricardo concierge # 127. I was ready to return the Amped SR20000G after I to spoke 2 tech support. They seem more confused then me. Called the third time and got Ricardo. Ricardo is great. He knew all the ins and outs of the software. The setup went so nice and smooth. The SR20000G works great. I am writing this review in my bedroom which is actually in a very solid addition, hurricane resistant CBS structure added to the main house. Could not get any wifi prior to adding the Amped. So happy that I happen to get Ricardo",
      "rating": 5.0,
      "verified": true,
      "author": "Evelin H",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Not as strong signal and distance as expected.",
      "text": "Not as strong signal and distance as expected. Im just a hallway away with no interfering walls and i get shortage of signal. Also if the signal is not strong enough it will reduce the speed of your connection considerably. Other than that a stable software and reliable at 5.0 if you're close enough.",
      "rating": 3.0,
      "verified": true,
      "author": "shiro",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Good router but not exceptional",
      "text": "Generally a good router, but nothing really special from a function standpoint. I thought I could use it to extend my range (also had the high-end ASUS ac router), but it didn't do more than the ASUS. Ultimately I went with a Ubiquity Unity and that quite frankly kicked butt both from coverage and number of connections standpoints.",
      "rating": 3.0,
      "verified": true,
      "author": "Christmas",
      "helpful_votes": 0,
      "publication_date": 20140918
    },
    {
      "title": "Everybody builds a bad one now and then",
      "text": "Ordered this Amped product to relieve a wi-fi problem. Alas, the unit came in dead! After talking to Amped Wireless (and they were extremely helpful) had to send this one back for a replacement. We all have our share of boo boos. Amped Wireless makes a fantastic product and I won't hold one bad piece of equipment against them.",
      "rating": 1.0,
      "verified": true,
      "author": "Richard Meinhardt",
      "helpful_votes": 0,
      "publication_date": 20130220
    },
    {
      "title": "Iron Beam problem",
      "text": "The problem to reach upstairs from the modem location did get some better but did not provide the same level of service provided down stairs in the 3500 sq foot house. Know that there is an iron beam between the floors but was in hopes that the unit would over come the problem..",
      "rating": 3.0,
      "verified": true,
      "author": "John M Carmichel",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "Not woth the money",
      "text": "This was an upgrade from my NetZero router, and although the speed and lag of my internet has improved, I am unable to connect to, or on some devices, even able to recognize the 5.0 MHz connection. This disappoints me greatly and it was difficult to give it a 3 star rating for that reason. I do not recommend spending the extra money for a dual band that doesn't allow you to use both bands. Seriously unhappy.",
      "rating": 3.0,
      "verified": true,
      "author": "soonerbackhome",
      "helpful_votes": 0,
      "publication_date": 20140914
    },
    {
      "title": "So far so good!",
      "text": "Ok so I'd have to sat that this product has dramatically improved the wireless experience in my home. Living in an older home, signal on the third floor is flaky at best with standard routers. With the Amped R2000G however it's as if I was directly on the main floor! My only annoyance is that the 5Ghz band is not as strong (signal wise) as the 2.4Ghz is. I only mention this because I had planned on using the higher band do to over crowding on the lower band. That being said, the 2.4Ghz signal is so strong that I have no issues what so ever. Buy with confidence, this one's a keeper!",
      "rating": 4.0,
      "verified": true,
      "author": "Driftmotion",
      "helpful_votes": 0,
      "publication_date": 20120817
    },
    {
      "title": "Love this router",
      "text": "Love this router. Had another brand that kept failing, talked to tech support, and they couldn't help, so bought the Amped. Easy to set up, and zero errors, plus I'm getting better speeds up and down.",
      "rating": 5.0,
      "verified": true,
      "author": "James B. Young",
      "helpful_votes": 0,
      "publication_date": 20140920
    },
    {
      "title": "Unreliable",
      "text": "At first, I really enjoyed the speed over my previous AyrMesh wireless G. Then the new router started having trouble maintaining the connection. It frequently needs to be rebooted and when it does, it usually needs to be rebooted several times in the same day. Then it's okay for a week or two. Unfortunately, I waited too long to return it, so I just stuck it in a closet and reconnected the AyrMesh.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin Burns",
      "helpful_votes": 0,
      "publication_date": 20131027
    },
    {
      "title": "Dont waste your money.",
      "text": "Dont waste your money. Range is poor. Quality is mediocre at best. I bought this based on the reviews but with my experience these are far below advertised specs. Same goes for their sr20000g repeater.",
      "rating": 1.0,
      "verified": true,
      "author": "hydrofarmer",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Works great!",
      "text": "I am becoming a fan of the Amped! brand. This router was installed in a very large house. I used some Amped! accessories to boost the signal even more. It ended up being a great setup. Configuration of this router is very easy and straight forward.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Manning",
      "helpful_votes": 0,
      "publication_date": 20130310
    },
    {
      "title": "no more complaints",
      "text": "the previous wireless router, a WRT54GL worked wonderfully until i started using NAT scripting for the firewall under DD-WRT. I bought this to replace the wireless function. users were being dropped every 10 minutes or so under the linksys. now they're never dropped and the range is phenomenal.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Scheh",
      "helpful_votes": 0,
      "publication_date": 20121212
    },
    {
      "title": "Great Sevice",
      "text": "\"Manuel\" in tech was so helpful to set up my router as an access point. He also help me set the guest networks. Router delivers strong signal. I liked this router so much this is my second one. first one is also used as an access point.",
      "rating": 5.0,
      "verified": true,
      "author": "dr256",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Ok router - good speed , reliable but not outstanding",
      "text": "Too much marketing and too little substance. its a good router and good range but it wasn;t the ultra router i was hoping for when i bought this 2 years back",
      "rating": 3.0,
      "verified": true,
      "author": "K. Ghosh",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Support from Steven #109 was amazing.",
      "text": "I am buying the device from Newegg because there is a promo today to get it for $140. But it is worth nothing the EXCELLENT support i got Steven #109 on a few pre-sales questions. This review is JUST FOR THE SUPPORT and NOT on the product itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Ari",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Amped Wireless seems to have solved my issues",
      "text": "Purchased the Amped R20000G router on 4/25/2013, standard free shipping and it arrived on 4/29/2013. Took all of about 5 min to switch out my old router with the new Amped. Set up was simple. Purchased this router due to issues with my Vizio TV and Directv being too far away to connect to my weak wireless signal. Both TV and Directv seem to have a nice strong signal. Both unfortunately only support the 2.4 ghz signal, but strong non the less. Netflix and On Demand seem to be working well. IPad and IPhones can connect to either the 2.4 or 5.0 ghz signals. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "lrtflood",
      "helpful_votes": 0,
      "publication_date": 20130430
    },
    {
      "title": "Not as advertised",
      "text": "Purchased this product to provide better WiFi coverage in my home. Once installed found that the coverage was no better than my Airport Extreme. Also found that Airplay (music streaming) worked well for one day then the devices became lost on the network and no attempts at rebooting or reconfiguring would correct this. I plugged my Airport Extreme back in and was up & running in minutes.",
      "rating": 2.0,
      "verified": true,
      "author": "McAlpine",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "Great product and simple installaiton.",
      "text": "Ampled Wireless routers really do put out some excellent power. Added security and simplified installation is a huge plus. This has the capablity of running multiple guest networks with seperate keys and limitations.",
      "rating": 5.0,
      "verified": true,
      "author": "GZTCZB",
      "helpful_votes": 0,
      "publication_date": 20131115
    },
    {
      "title": "Range less than advertised",
      "text": "I like this router but it does not have the range that I was expecting. As the signal drops off the through put also declines. The signal strength in my wife's office is much lower than expected and the distance is not that great. It is better than my previous router.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott P Moore",
      "helpful_votes": 0,
      "publication_date": 20130203
    },
    {
      "title": "Do they even test these before they send them out?",
      "text": "This is what you get when you buy a used item on Amazon I have found out. They items state tested and in working condition. I would love to see a checklist of what they test and verify that is in good shape. I received the item and at first glance things looked ok. As soon as I went to screw in the antennas I realize that one of the main parts that you screw the antennas into is broke on the inside and wiggles everywhere. Tech support was great from amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris A.",
      "helpful_votes": 0,
      "publication_date": 20131031
    },
    {
      "title": "Very over rated.  Did not have the coverage it claimed.",
      "text": "Price was good but, I could have done better in terms of range and signal strength by paying a little bit more and staying with Netgear.",
      "rating": 2.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 3,
      "publication_date": 20131014
    },
    {
      "title": "Lousy wireless range and drops connections a lot.",
      "text": "Product overheats, this product does not increase coverage for wifi. The wireless range would not extend outside of one room. The antenna broke into parts after 3 weeks of use. The wifi repeatedly drops and does not connect unless you are directly in the room with the router.",
      "rating": 1.0,
      "verified": true,
      "author": "Buyer No 2",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "my new problem solvers",
      "text": "I've installed a couple of different products from these guys for the extended family. These are my new problem solvers. Everybody is happy with the good signals in huge houses, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "VERY DISAPPOINTED. Complete waste of Money.",
      "text": "I bought this router because it had mostly good reviews and supported dual channels. It is a joke. Second channel hardly works and it is unusable. I replaced net gear that I bought several years ago and this proved to be a much worse product. Its smart features can only block 5 keywords and recently it just stopped blocking websites ... Overall it is a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Paul",
      "helpful_votes": 0,
      "publication_date": 20130804
    },
    {
      "title": "Amped",
      "text": "Easy to set up, works well, but it does decrease your speed significantly. Without it, my speeds are 3,12Mbps, with it, I was getting .07!!!, .12Mbps, so I did send it back. It a shame. I love being wireless!",
      "rating": 4.0,
      "verified": true,
      "author": "Eliza",
      "helpful_votes": 0,
      "publication_date": 20130131
    },
    {
      "title": "I love it! VERY easy to install",
      "text": "Suggested by a Gent who worked with Comcast. It made ALL the difference in the world. Now instead of being angry at my wireless service...I love it! VERY easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Johannah Curtis",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Poor performer and defective.",
      "text": "Was surprised by how mediocre the wireless was compared to my existing wireless AP and Router. It performed worse than they did and really had a lot of issues .. None the least of rebooting every few hours.. So i'm returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Max Bellum",
      "helpful_votes": 0,
      "publication_date": 20130131
    },
    {
      "title": "good quality",
      "text": "however not as strong, i live on an apartment and the 5 ghz signal isn't strong to reach all rooms. 2.4 ghz better. I wonder if the new ac ones are better now.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamex RZ",
      "helpful_votes": 0,
      "publication_date": 20140117
    },
    {
      "title": "AMPED PURCHASE CAN'T BELIEVE MY IT, LIKE A DREAM!!!",
      "text": "THIS HAS GOT TO BE ONE OF THE BEST PURCHASES ON AMAZON OR EBAY I'VE MADE!!! THIS DOES EVERYTHING I WANT IT TO DO!! WELL, NOT EVERYTHING....IT WON'T HAVE SEX WITH ME!!! JUST WAIT TIL I GET IT ALONE TONIGHT, I'LL SHOW IT WHO'S THE MAN!!! sorry for the caps, I'm just so AMPED!!!",
      "rating": 5.0,
      "verified": true,
      "author": "KAS",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "Absolutly great customer service from (Jeramy #148)",
      "text": "Wow! What can I say? I was having some trouble with my amped router but Jeramy saved the day. I won't get into all the details but this guy was very patient with me and walked me through every little step. I still need to test it out with all my other devices, but as far as I can see things are a whole lot better. Thanks, Amped wireless- Jeramy (#148) Alonzo T. Houston Tx.",
      "rating": 5.0,
      "verified": true,
      "author": "REBECCA TECHEIRA",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Does what it does well.",
      "text": "Very good device so far. no complaints. Will see how well it last in the years to come. Most routers are not as powerful as this one is on range so I am impressed with that.",
      "rating": 4.0,
      "verified": true,
      "author": "J Morgan",
      "helpful_votes": 0,
      "publication_date": 20130417
    },
    {
      "title": "Patch cable provided has only two pairs connected. Unbelievable.",
      "text": "This router is Gigabit, but the patch cable that comes with it has only two pairs connected on each end (1, 2, 3, and 6). Giganet networks, however, need all four pairs. Hence, if you use the provided patch cable to connect the R20000 router to your switch or hub, you won't go farther than 100 Mbps, defeating the purpose of this product. It would have been appreciated the manufacturer at least notify us about this small detail - or simply cease to be cheap and provide decent patch cables that are at least compatible with the product.",
      "rating": 3.0,
      "verified": true,
      "author": "Solar_Ize",
      "helpful_votes": 3,
      "publication_date": 20121209
    },
    {
      "title": "Works as advertised",
      "text": "The router I got works very nicely. The signal is much stronger than our old router and everyone feels a much faster network. Three rooms away and one floor down, we still get 2-3 bars on wireless. Pretty amazing. The setup is very straightforward. I simply followed the instruction and I don't have to do any thing since then. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "CHIH-HAO LI",
      "helpful_votes": 0,
      "publication_date": 20130701
    },
    {
      "title": "Not sure what to say, Product died out after 1 month!",
      "text": "Had high expectations for this product. Reviews were great, when i bought, it worked ok for about a month then no more internet at all. Completely dead! Before dying, I would rate 4 stars for performance.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Hsu",
      "helpful_votes": 0,
      "publication_date": 20130205
    },
    {
      "title": "Good product but it required taking time to set up",
      "text": "Good product but it required taking time to set up. The website should make it easier for customers.",
      "rating": 4.0,
      "verified": true,
      "author": "Henry Nguyen",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Solid router",
      "text": "Works well but I question how much range extension it really provides compared to other routers. Never have issues that require rebooting.",
      "rating": 4.0,
      "verified": true,
      "author": "Adam Barnard",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "works great",
      "text": "Awsome!! bought for our church to extend WI FI and it works, need to get a repeater for sanctuary. area is to large for one router.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "Very happy with the ease of setup and quality of signal ...",
      "text": "Very happy with the ease of setup and quality of signal strength throughout the house. I would have no issues buying or recommending this to a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Maxwell",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "good purchase",
      "text": "The only thing that coud be better: My D-link that I replaced was able to limit internet access by computer (IP or Mac Address). The Amped does not do this.",
      "rating": 4.0,
      "verified": true,
      "author": "Titan",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Excellent increase in range",
      "text": "I needed to get my wifi about 250 feet down to another building. Combines with an Edimax range extender, this did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Ozark Cragsman",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "All up!",
      "text": "I replaced a two year old wireless router that continually dropped internet connection with this puppy. We are alive and well and our WiFi works wonderfully as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Scorpionkiller",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "Works good when it works",
      "text": "BVut I had 4 does out on me within 2 years. 3 of them from the Amazon warehouse.",
      "rating": 2.0,
      "verified": true,
      "author": "SW",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Poor range, disconnects",
      "text": "I replaced a Linksys WRT54G hoping to get increased range. Instead I get less than half the range. It doesn't even cover a ~1200sf single level home. On top of that are the frequent disconnects. Being a Unix Systems Engineer I using ssh/sscp a lot. My sessions keep getting reset because of the disconnects even if I'm only 5 feet away from the router. I am not at all impressed.",
      "rating": 1.0,
      "verified": true,
      "author": "Duane D",
      "helpful_votes": 0,
      "publication_date": 20130716
    },
    {
      "title": "Awesome tech support experience",
      "text": "Great job Gio! Outstanding support . I can't believe the quality and range of signal from your products. Thanks for the advice. I'm sold on Amped.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Power",
      "helpful_votes": 0,
      "publication_date": 20140421
    },
    {
      "title": "So so",
      "text": "Only about 2/3 as strong of a signal as my airport extreme. But it did come with some cool software and had a WPS button i needed to add the washer and dryer to the network.",
      "rating": 3.0,
      "verified": true,
      "author": "JjFuTx",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Enough router for the whole house",
      "text": "No dead spots or slowing down issues, I can currently stream Netflix on 2 devices while operating 3 laptops and one gaming PC with no issues. The user interface is easy to use and it makes setup a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20130328
    },
    {
      "title": "Great customer support",
      "text": "This router works well. Had a little trouble understanding some of the configuration options and called support. They were very helpful with resolving all my questions. They called me back several times to finish our work as every time we re-loaded the router would reset my IP phone and disconnect us. Couldn't have had a better rep than Sam. Thanks....",
      "rating": 5.0,
      "verified": true,
      "author": "Russell W Revis",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "Only lasted one year. We had to uograde bc ...",
      "text": "Only lasted one year. We had to uograde bc we were losing internet signal more and more often.",
      "rating": 2.0,
      "verified": true,
      "author": "vicky llanes",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Very poor performance!!!",
      "text": "I thought I did a thorough review of 600N series products and choose this item which persumably would have increased the reception area and overall coverage and will replace my old Netgeat 802.11g series. The reception and coverage is exactly the same as is with my low cost 802.11g series. If I can I will replace this product and get 100% refund in a heartbeat. I spent more than $120 for this which gives same result as a low cost $29 device. I just can't believe I selected this unit!",
      "rating": 1.0,
      "verified": true,
      "author": "BluePlanet",
      "helpful_votes": 0,
      "publication_date": 20130531
    },
    {
      "title": "Very poor coverage.  About half the distance of 7 year old router it was replacing.  Returned",
      "text": "Very poor coverage. About half the distance of 7 year old router it was replacing. Returned",
      "rating": 1.0,
      "verified": true,
      "author": "J. Nickey",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Great product",
      "text": "Simply does what it says it does. There are no longer \"dead spots\" in my home where my connection fades or drops completely. Sets up easily and quickly. I couldn't ask for anything else from a router.",
      "rating": 5.0,
      "verified": true,
      "author": "jwincrawfordCo",
      "helpful_votes": 0,
      "publication_date": 20130203
    },
    {
      "title": "great value!",
      "text": "Bought this unit to replace my old WAP54G/Linksys router. Easy to set-up using just the instructions that came with the unit. Automatic configuration done in 15-20 min. Used the same SSID and was surprised to find that all laptops, phones, Wii etc connected as though I hadn't changed anything. Now able to fully exploit the benefits of streaming using Roku etc. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130317
    },
    {
      "title": "Amped Router",
      "text": "Works Great! , Range is good, only cons I have is it's slow to reboot when changes are applied, even with the latest firmware. It could be a little more affordable.",
      "rating": 4.0,
      "verified": true,
      "author": "Big Fish63",
      "helpful_votes": 0,
      "publication_date": 20130819
    },
    {
      "title": "great range, but if you needed more than 1, it does not work",
      "text": "This is the first wifi I know of where wds is not available. I have been playing with wifi since the 802.11a days, and this is a first. Not only is it unable to work with wds, if you set it with the same ssid with existing, it actually crashes out the other ap.",
      "rating": 1.0,
      "verified": true,
      "author": "Tom M Wong",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "Not as great as they say it is",
      "text": "I'm in the kitchen and the router is 15 feet away and the signal strength is only half way. When I take my laptop to within 5 feet then it gets full strength.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20130602
    },
    {
      "title": "Great Experience",
      "text": "I bought a R20000G and had problems with the setup. My knowledge is very low when it comes to networking. I spoke with Sam, in customer support, he was knowledgeable, courteous and had me up and running in no time at all. Great customer support. With this router I am able to reach my office in the next building and that was why I bought it. Great product and great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "John kenneth Holland",
      "helpful_votes": 0,
      "publication_date": 20130913
    },
    {
      "title": "great service",
      "text": "the setup was not as easy as stated, however once connected with customer service at Amped the service was great. Andrew #108 was outstanding with his knowledge and ability to hook up my new high power wi-fi router. After is was connected the coverage is great in and outside of my home. I would recommend this product to all who needs a good router with great coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Shaheen",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Returned it.",
      "text": "Eh. I returned it. I now have an Asus RT-N56U which is great.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "One Star",
      "text": "Wifi cuts in and out constantly, had to wire my game systems to work correctly.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Works well and is very sensitive to network changes",
      "text": "Unless you are very adept at network configuration, I recommend you use the default settings for this router. However, if you do tweak, and screw it up, Ampedwireless truly does have the greatest tech support I've ever encountered. Kudos to David - Concierge #144!",
      "rating": 4.0,
      "verified": true,
      "author": "D. Callahan",
      "helpful_votes": 0,
      "publication_date": 20140309
    },
    {
      "title": "Three Stars",
      "text": "For the money, not much more powerful than the one it replaced.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "Works well easy to setup, does not provide coverage as advertised",
      "text": "The wireless router did not provide significantly better coverage as claimed on their website. I ended up buying a Amped Wireless range extender and that improved coverage.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Raheem",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Happy coustomer",
      "text": "Thank you for a wonderful well thought out product. It has shown me a greater range then my previous Router.",
      "rating": 5.0,
      "verified": true,
      "author": "Chef-Frankie",
      "helpful_votes": 0,
      "publication_date": 20120719
    }
  ],
  "product_meta": {
    "title": "Amped Wireless High Power Wireless-N 600mW Gigabit Dual Band Router (R20000G)",
    "description": "The Amped Wireless High Power Wireless-N 600mW Gigabit Dual Band Router provides long range, high performance wireless Internet access over extreme distances. The R20000G is equipped with advanced dual band 600mW wireless amplifiers and 5dBi detachable high gain antennas to provide up to 10,000 sq ft of high performance Wi-Fi coverage. The High Power Router features a powerful 620MHz internal processor, five gigabit networking ports for blazing fast wired connections and simultaneous dual band Wi-Fi technology for an interference free Wi-Fi experience. The High Power Router is great connecting PCs, HD TVs, iPads, smartphones and more in large homes (and backyards), and multi-floor offices or warehouses.\n\nAMAZON.COM\n\n\n\n\nFROM THE MANUFACTURER\n\n\nHow the High Power Wireless-N 600mW Gigabit Dual Band Router Works. View larger\nThe Smart Setup Wizard will automatically configure your Internet connection and customize your wireless network.\nConnectors and Ports for the R20000G.\nView larger\nShare your USB Storage. View larger The Amped Wireless High Power Wireless-N 600mW Gigabit Dual Band Router provides long range, high performance wireless Internet access over extreme distances. The R20000G is equipped with advanced dual band 600mW wireless amplifiers and 5dBi detachable high gain antennas to provide up to 10,000 sq ft (2.4GHz only, 5.0GHz coverage will be less) of high performance Wi-Fi coverage. The High Power Router features a powerful 620MHz internal processor, five Gigabit networking ports for blazing fast wired connections and simultaneous dual band Wi-Fi technology for an interference-free Wi-Fi experience. The High Power Router is great for connecting PCs, HD TVs, iPads, smartphones and more in large homes (and backyards), and multi-floor offices or warehouses.\n\nEXTREME RANGE DUAL BAND WI-FI COVERAGE\nAdd long range wireless Internet access to your home or office. Dual 2.4GHz 600mW high power amplifiers, dual 5.0GHz high power amplifiers and dual 5dBi high gain dual band antennas provide the power to add up to 10,000 square feet (2.4GHz only, 5.0GHz coverage will be less) of amplified dual band wireless coverage.\n\nDOUBLE THE BANDWIDTH WITH SIMULTANEOUS DUAL BAND TECHNOLOGY\nThe High Power Dual Band Router doubles your bandwidth by creating a 2.4GHz Wi-Fi network with long range access and a 5.0GHz Wi-Fi network with less interference--great for lag-free HD media streaming. Both networks run simultaneously to provide maximum throughput with minimal interference.\n\nHigh Power 600mW Wireless Amplifiers and 5dBi High Gain Dual Band Antennas provide up to 10,000 sq ft* of coverage. View larger\nRange comparison to standard Wi-Fi routers.\nView larger PENETRATE WALLS AND ELIMINATE DEAD SPOTS\nFour high power amplifiers, four low noise amplifiers and two high power dual band antennas provide powerful Wi-Fi coverage that easily penetrates walls and Wi-Fi obstructions to provide Wi-Fi coverage in hard to reach areas.\n\nGIGABIT NETWORKING\nThe High Power Dual Band Router provides up to four 10/100/1000M network ports for connecting additional wired computers, A/V devices and other network devices at ultra-fast wired speeds.\n\nPOWERFUL PROCESSOR\nThe High Power Dual Band Router features a powerful 620MHz internal processor for computing networking commands at blazing speeds which results in faster wired and wireless speeds.\n\nUSB STORAGE SUPPORT\nAttach a USB storage device, such as an external hard drive or flash drive, to share at home or in the office with other networked computers. Shared files can also be access remotely, over the Internet using a FTP client.\n\nSMART SECURITY FEATURES\nYou're in control. Smart security features allow you to restrict access to specific users, set a daily time schedule for when the wireless network is available and when it is not and control how far your wireless network coverage reaches through wireless output power adjustments. The High Power Dual Band Router also supports secure, push button setup for WPS enabled devices.\n\nWEBSITE BLOCKING AND SPI FIREWALL PROTECTION\nBlock access to specific websites and protect your network from outside intruders with an advanced SPI firewall.\n\nGUEST NETWORKS\nCreate additional wireless networks for guests or conference rooms with access to the Internet only. Protect your local computers and servers from access by guest users.\n\nSMART, SIMPLE SETUP\nThe Smart Setup Wizard walks you through the simple setup process and automatically configures the settings of your Internet provider.\n\nGREAT FOR LARGE HOMES AND OFFICES\nThe high power Wi-Fi capabilities of the High Power Dual Band Router is great for providing powerful wireless coverage for larger homes, backyards, offices and warehouses.\n\nWHAT'S IN THE BOX?\nHigh Power Wireless-N 600mW Gigabit Dual Band Router, detachable high gain 5dbi dual band antennas, power adapter (switching, 100-240v), RJ-45 Ethernet cable, setup guide, CD with user's guide and installation video, stand for vertical mounting.\n\nIndustry leading technical support and customer service\n\n\nIncludes Free Wi-Fi Analytics Tool Android App to help optimize and analyze Wi-Fi networks\nSatisfaction guaranteed with the Amped Wireless Range Increase Guarantee TECHNICAL SPECIFICATIONS\n * Model: R20000G\n * Technology: Wireless-600N\n * Bands: Simultaneous 2.4/5.0GHz, 802.11a/b/g/n\n * Wireless Speed: 2.4GHz: 300Mbps (Rx), 300Mbps (Tx); 5.0GHz: 300Mbps (Rx), 300Mbps (Tx)\n * Antennas: 2 x High Gain 5dBi Dual Band Antennas, 2 x Reverse SMA Connectors\n * Ethernet Ports x Speed: 1 x RJ-45 10/100/1000M WAN, 4 x RJ-45 10/100/1000M LAN, 1 x USB 2.0\n * Amplifiers: Dual 2.4GHz 600mW amplifiers, dual 5.0GHz amplifiers, dual low-noise amplifiers\n * OS Compatibility: Works with all OS, including Windows and Mac\n\nSETUP REQUIREMENTS\n * Broadband (cable/DSL) modem with Ethernet port\n * Computer with wired (RJ-45) or wireless (802.11a/b/g/n) adapter\n\nAMPED WIRELESS REPEATER/ RANGE EXTENDER COMPARISON\nStandard Router R10000 R10000G R20000G Speed / Standard Wireless-G Wireless-300N Wireless-300N Wireless-600N Frequency 2.4GHz,\n802.11b/g/n 2.4GHz,\n802.11b/g/n 2.4GHz,\n802.11b/g/n Simultaneous\n2.4/5.0GHz,\n802.11a/b/g/n Output Power 50mW 600mW 600mW 600mW Dual Band Wireless Range* Up to 1,000 sq ft Up to 10,000 sq ft Up to 10,000 sq ft 2.4GHz: Up to 10,000 sq ft\n5.0GHz: Up to 5,000 sq ft Antenna Type Internal External, Upgradeable External, Upgradeable External, Dual Band Antenna Gain 0dBi 2 x High Gain 5dBi\nOmni-Directional 2 x High Gain 5dBi\nOmni-Directional 2 x High Gain 5dBi\nOmni-Directional Ports 1 Modem\n4 LAN 1 Modem\n4 LAN 1 Gigabit Modem\n4 Gigabit LAN 1 Gigabit Modem\n4 Gigabit LAN Smart Features Smart Security Features Supports WEP, WPA2, WPS Guest Wi-Fi Networks Bandwidth Management Wi-Fi Access Management Smart Setup Wizard Adjustable Wi-Fi Coverage Website Blocking Smart Firewall Gigabit Ports Power Processor Dual Band Interference Free USB Storage File Sharing Other Features Indoor Stand Vertical Vertical Vertical Mounting Options Wall, Desktop Wall, Desktop Wall, Desktop Range Increase Guarantee Included Accessories 2 x Network Cable 2 x Network Cable 2 x Network Cable Free Wi-Fi Analytics Mobile App 1 Year Warranty Specifications are subject to change without notice.\n*Range specifications are based on performance test results. Actual performance may vary due to differences in operating environments, building materials and wireless obstructions. Performance may increase or decrease over the stated specification. Wireless coverage claims are used only as a reference and are not guaranteed as each wireless network is uniquely different. 600mW amplifier ratings are for the 2.4GHz wireless band.\n\n\n\nSee more",
    "rating": 3.6,
    "feature_bullets": [
      "Extreme Dual Band Range - Provide interference free dual band wireless Internet coverage over large areas (up to 10,000 sq ft)",
      "Ultra Powerful - High Power 2.4GHz/5.0GHz Amplifiers & High Gain 5dBi Antennas penetrate walls and eliminate dead spots",
      "New firmware updates available to increase range and connections at longer ranges (please check the Amped Wireless support website for details)",
      "Wi-Fi Coverage and Security - Adjust the amount of Wi-Fi coverage available Supports WPS One-Touch Setup, WPA, WPA2",
      "Parental/Security Features - Block websites, set schedules for wireless access and grant access to specific users",
      "USB Storage Support - Share local files or access files remotely by adding a USB storage device (USB Storage device not included)",
      "Gigabit Networking - Connect additional wired devices at blazing gigabit (1000M) speeds",
      "Powerful Processor - Faster wired and wireless networking"
    ],
    "specifications": {
      "Wireless Type": "802.11a/b/g/n",
      "Brand": "Amped Wireless",
      "Series": "R20000G",
      "Item model number": "R20000G",
      "Item Weight": "1.55 pounds",
      "Product Dimensions": "8.5 x 10.75 x 3 inches",
      "Item Dimensions  LxWxH": "8.5 x 10.75 x 3 inches",
      "Color": "Black",
      "Voltage": "240 Volts",
      "Manufacturer": "Amped Wireless",
      "ASIN": "B007M8SGW2",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 16, 2012",
      "Customer Reviews": "3.6 out of 5 stars294 ratings3.6 out of 5 stars"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Routers",
      "Networking Products"
    ],
    "price": 45.0
  }
}