{
  "website_summaries": [
    {
      "verdict": "A comfortable harness that won't let your kitty slip out. Plus it's easy to put on.",
      "pros": [
        "Easy to secure your cat in the harness thanks to two simple closures",
        "Also dye-free so even cats with allergies can wear it"
      ],
      "cons": [
        "Does not include a leash",
        "Sometimes cat's paws get stuck in the neck hole"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cat loves it",
      "text": "I didn't know how my indoor cat was going to react when I put him in this thing... Day 1-3 he was just a statue outside ha ha.. After I would bring him in I gave him treats By Day 4 he walked like he didn't even have the vest on... He chased another cat by day 7 with me behind him embarrassed as hell. So yes 5 stars fits good, I don't think he can wiggle out of it. My cat LOVES it and actually throws a temper tantrum after I bring him in and remove the vest, it's insane...",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.mr",
      "helpful_votes": 495,
      "publication_date": 20131022
    },
    {
      "title": "Great Cat Harness for my large cats",
      "text": "Wanted to take my two large indoor spoiled cats outside and these harnesses work great. I purchased several sizes and find the medium/large one fits the best on both, although it is a little tight on my slightly larger cat of about 18-20 lbs. I tried the XL holster on him which is more comfortable, but when he freaks out he can get himself out of it, only because it is slightly too big for him. I still use it. Velcro strong but my cats really don 't pull or do too much when they go outside. They mostly squat and look around.",
      "rating": 5.0,
      "verified": true,
      "author": "sunshinecracker",
      "helpful_votes": 73,
      "publication_date": 20161115
    },
    {
      "title": "Waste of cash.",
      "text": "My 13 lb Maine coon can get out of this harness within seconds and she does. Also, the velcro attaches underneath and is very difficult to get on. And finally, her long fur gets caught in the velcro which adds to the difficulty of putting it on but, interestingly, doesn't bother her a whit extricating herself from it. This is the 3rd harness I've tried...it's no better than much cheaper ones. Don't waste your money unless you have a really passive cat.",
      "rating": 1.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 56,
      "publication_date": 20160620
    },
    {
      "title": "Houdini Cat can't escape from Kitty Holster",
      "text": "My 20 lb. orange cat hates harnesses and can usually escape in seconds.Kitty Holster is the exception - not only is our cat unable to escape, he actually doesn't mind wearing the Kitty Holster. With other harnesses, he would fling himself on the ground and refuse to walk; with Kitty Holster, he prances around on leash as though he is wearing nothing. The extra-large size is a little bit snug, but I can fasten the Velcro with no problem and it stays put. We are very pleased with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 22,
      "publication_date": 20170427
    },
    {
      "title": "Flimsy, doesn't feel secure.",
      "text": "This harness doesn't seem to be very durable. It's very thin with two velcro straps, and nothing more to keep it on the cat. If my cat got his back foot on the velcro strap, he'd rip the velcro right off. It just doesn't feel safe and secure, at all. So, these are being returned. I found the absolute best harness for my cats. If you click on my name, you can find it in my reviews. I reviewed it right before this review. So, it should be easy to find.",
      "rating": 1.0,
      "verified": true,
      "author": "TMooreKajiwara",
      "helpful_votes": 11,
      "publication_date": 20171023
    },
    {
      "title": "Not Secure By Itself",
      "text": "My cat has got out of this harness every time by walking backwards and pulled till it comes off. We still use it with him tethered to a yard stake while we are out with him but put a strap harness over top of the kitty holster and this has kept him from getting out of it, so on it`s own it did not keep him from getting loose. When I am just walking him on his leash and he wears just the kitty holster no problem at all/",
      "rating": 3.0,
      "verified": true,
      "author": "L. Hagelstien",
      "helpful_votes": 4,
      "publication_date": 20190502
    },
    {
      "title": "A slippery subject but satisfied owner",
      "text": "My cat is a punk, he is usually known as \"that cat\" due to being a punk. This holster is much easier and quicker to get on him that a standard harness. He has adjusted to the little jacket very well and he has very quickly realized his escape acts will be much harder to pull off while wearing this product.",
      "rating": 5.0,
      "verified": true,
      "author": "akamaikiwi",
      "helpful_votes": 12,
      "publication_date": 20170416
    },
    {
      "title": "Great product. Our cat concurs!",
      "text": "We have tried several harnesses for our very large (20 lb) cat. None quite fit correctly. This holster is the exception! Great fit and nice, strong velcro. Our indoor cat has come to enjoy \"being holstered\" and adventuring outside with us. We introduced him to the holster gradually, first placing by his food dish for a few days. We progressed slowly through trying it on for a few moments up to short visits outside. Now he goes out for more extended periods and explores contentedly within the boundary of his leash. Great product. Thank you! Arrived promptly and well packaged.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayk J.",
      "helpful_votes": 3,
      "publication_date": 20170619
    },
    {
      "title": "Seems to be secure and comfy",
      "text": "He won’t tell me if it is comfortable, but my 15.5 lb. ‘adventure kitty in training’ doesn’t seem to mind it, except for the loud Velcro noise when removing it. Seems secure and his movement does not seem to be impeded. He looks dapper in the black and gray that matches his stripes. This is the first cat harness he’s had, and at first he did the normal thing cats do when you put anything on them (dropping to the ground like you just put a lead weight on him and refusing to move), but he got used to it and safely enjoyed the great outdoors (i.e. my backyard)",
      "rating": 5.0,
      "verified": true,
      "author": "HK",
      "helpful_votes": 2,
      "publication_date": 20190413
    },
    {
      "title": "Did not work for my cat.",
      "text": "My cat immediately figured out how to get out of it. He took time to warm up wearing it. Then the first time we took him out he ran around a bush full speed got it caught and walked backwards right out. Now he knows to do this immediately. Luckily we leave the door wide open just in case and he runs right back into the house once hes loose. I thought I put the harness on too loose. Second time I made sure it was on much tighter. Nope, ran around a poll and walked backwards right out again.",
      "rating": 2.0,
      "verified": true,
      "author": "A. DeWitt",
      "helpful_votes": 5,
      "publication_date": 20170409
    },
    {
      "title": "Cat escaped within 10 minutes",
      "text": "Strap around neck is too wide, puts the cat's head in a upright position (think neck brace). Also, cat was able to escape from the harness in less than 10 minutes. Looked like a winner, results however, were most disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Brian Brown",
      "helpful_votes": 4,
      "publication_date": 20191207
    },
    {
      "title": "Great for cat that thinks he's a dog.",
      "text": "I have a weird cat who really likes to walk on a leash (he was raised with dogs, and thinks he is one, my guess.) I've tried other cat or dog harnesses and they usually don't fit right, or pull in the wrong place, or his arms slide out. This fit's perfect because the wide velcro strips at neck and belly allow for a custom fit, and the arm holes are right for cats. Wee Thomas likes his vest, doesn't try to wiggle out or flop over on his side. It seems more comfortable to him than anything else we've tried. The material is light weight enough and seems like it will wash well.",
      "rating": 5.0,
      "verified": true,
      "author": "Hell Scent Aromatherapy",
      "helpful_votes": 14,
      "publication_date": 20160126
    },
    {
      "title": "Great harness, not foolproof but pretty close.",
      "text": "My kitty is half maine coon by genes, all by heart. He loves running around outside/hunting/climbing/etc. This harness keeps him reined in pretty well. A cat can certainly back out of it, but only if you give them tension on the leash. We've had the harness for 4+ months now and use it every day. Very well made. We trust this harness enough that we've taken him camping with us in it, and we didn't lose him.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 27,
      "publication_date": 20160519
    },
    {
      "title": "Poor fit",
      "text": "While the product seems well made the dimensions are bad. The neck part is so thick our cat could not put his head down. He caught with it the whole time and we tried it several times. Also, when putting it on our cat attacks us. I will stick with a regular harness as he lays down and lets me put it on him.",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 4,
      "publication_date": 20180811
    },
    {
      "title": "Steppin' out!",
      "text": "We have tried other harnesses and have the scars to prove it - this one works like magic. Easy for both feline and human. Kitteh loves it - pic is worth a thousand words. Thanks Crazy K!",
      "rating": 5.0,
      "verified": true,
      "author": "sirdontmixalot",
      "helpful_votes": 47,
      "publication_date": 20150222
    },
    {
      "title": "Would buy again",
      "text": "I ordered an extra small black harness for my kitten. He is 5 pounds and still growing. The harness comes with a booklet on introducing the harness to your cat. The harness has velcros that are surprisingly sturdy. My only negative issue with the harness is it collects a lot of fur and the Velcro (being sturdy) is a bit hard to remove. I'll definitely buy it again if my cat grows out of this extra small vest. I also plan on putting patches on the vest for decorative purposes!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 8,
      "publication_date": 20170513
    },
    {
      "title": "I got this for a friend. Her kitty was ...",
      "text": "I got this for a friend. Her kitty was already trained to walk with a harness. After a few times with this new harness her kitty got used to it. UPDATE: My friend says her kitty will no longer tolerate the noise the velcro makes when removing the harness. She has been bitten several times while removing it. (This kitty is normally very, very gentle and loving.) She had to quit using the harness.",
      "rating": 4.0,
      "verified": true,
      "author": "Abby Marie",
      "helpful_votes": 3,
      "publication_date": 20170929
    },
    {
      "title": "Extremely overpriced with regards with quality",
      "text": "Our cat chewed through this within the first 5 minutes. Extremely thin fabric, this should be priced under $10. I imagine this costs no more than $1 to make...so a great profit margin for the manufacturer!",
      "rating": 1.0,
      "verified": true,
      "author": "Z. Wolf",
      "helpful_votes": 3,
      "publication_date": 20190928
    },
    {
      "title": "This is more like a straight jacket than a harness",
      "text": "This is more like a straight jacket than a harness. The cat was miserable and cried until I took it off him. The part that goes around the neck is WAY too wide. I should have went with a traditional strap harness.",
      "rating": 1.0,
      "verified": true,
      "author": "gary",
      "helpful_votes": 7,
      "publication_date": 20170929
    },
    {
      "title": "Feline Houdini beware",
      "text": "After trying two other brands of cat harnesses which our furball managed to escape from (are cats double jointed or something?) we decide to try one more. So far this has been a keeper, the fabric covers quite a bit of area but is lightweight and breathable. The holster attaches under the neck and under the belly. The neck seems to come up rather high but there is plenty of room for him to move his head. The belly area is very secure. In fact, the velcro is almost a little challenging to unwrap. Most importantly though, he's not been able to escape. Our kitty is a long and lanky 9lbs and the XS size fit him just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee N",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Can't get out of it, but....",
      "text": "Yes, it's very snug and the cat can't wiggle out of it but, the neck piece is way too wide. It covers his chin up to his mouth and there's no way pull it farther down. If they combined the sturdy body section with a small strap for the neck area it would work so much better. It's unusable as is. I've never seen a cat with a long neck where this would work.",
      "rating": 1.0,
      "verified": true,
      "author": "Melinda White",
      "helpful_votes": 2,
      "publication_date": 20190613
    },
    {
      "title": "Great design, well made, and good fit",
      "text": "I’ve bought numerous cat holsters trying to find one that fit my cat well and was easy to put on him. This one is the best, it’s well designed to comfortably fit a cat’s body type, easy to put on, and stays on. It’s very lightweight so my cat doesn’t mind that it’s on. My primary use for it is that I’m planning a move and need to add extra protection for safety. He’s used to going outside some so at the new location he’ll be allowed to go outside a little with the holster and a leash. I’m so glad I found this one and I’m confident it’s going to work well. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Smith",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "My Kitty Loves It ♡",
      "text": "My Kitty was not sure about this at first but once i worked with her with treats & she realized she gets to go for walks. She likes it much better. As long as i have the treat bag near by to distract her while putting it on she's very still & doesn't mind cuz she know she's going outside. I would buy it again i bought the XS & the Velcro is extremely strong but wont hurt ure pet & wont wear out, its just loud coming off. Hav treats near by.",
      "rating": 5.0,
      "verified": true,
      "author": "Hayley Shook",
      "helpful_votes": 7,
      "publication_date": 20150120
    },
    {
      "title": "This harness seems to run a bit large",
      "text": "The quality and security features were good on this harness, however for my 9 lb. Bengal kitty was a bit large, she slipped out of it quite easily and the fit was a bit off.The quality and security features were good on this harness, however for my 9 lb. Bengal kitty was a bit large, she slipped out of it quite easily and the fit was a bit off.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann Aldrich",
      "helpful_votes": 2,
      "publication_date": 20190809
    },
    {
      "title": "Easy to get on cat",
      "text": "I had to buy another kitty harness after Mr. Felix very easily wiggled himself out of the Good2go harness that I got for him at PetCo. This holster is much MUCH easier to get on. I like how you don’t have to put it over his head, which makes him freak out. Very easy to get on and off with the Velcro. Unfortunately, Mr. Felix the Houdini still managed to free himself from this on the very first try.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiptoeing_Tulip",
      "helpful_votes": 2,
      "publication_date": 20190206
    },
    {
      "title": "I Love this Kitty Harness!",
      "text": "Well made kitty harness that is easy to put on and take off. Velcro is strong and will stand up to kitty making a flying run at things in the environment. My cat was easily trained to wearing the harness using the enclosed training suggestions. He did roll around on his back the first time I put it on but some chicken got him up on his feet and willing to try an indoor walk. S/M fits my 12.5 cat perfectly and he is amazingly cute in it. Would definitely recommend to a friend. Very pleased with seller and product.",
      "rating": 5.0,
      "verified": true,
      "author": "keeper02",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "This is perfect! I have a senior long-term foster cat who ...",
      "text": "This is perfect! I have a senior long-term foster cat who was a feral outside cat until the local rescue shelter took him in. He has arthritis and due to a damaged ear drum he has balance issues. We thought it might help for him to walk outside, for physical and psychological reasons. I researched many harnesses and I am so glad I picked this one. Fits perfectly and the Velcro is very strong. Definitely 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "LoveCats&Books",
      "helpful_votes": 18,
      "publication_date": 20140718
    },
    {
      "title": "My Cats Hates The Velcro",
      "text": "I bought this to replace a strappy style harness that my cat loved. Unfortunately, one of the pieces that held the straps in place broke and he almost got out of it while out on a walk. I decided to buy this particular harness because it seemed safer but my cat absolutely hates it. He runs and hides whenever he hears me open up the velcro and then immediately runs back into the house and tries to get it off. It might work for other but it has completely undone all the work I did training my cat to love going on walks.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley Rose",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "It fit my 21 pound fat cat and was easy to get on",
      "text": "It fit my 21 pound fat cat and was easy to get on. He tolerated it very well. He was used to a harness and going out, but he out grew his other one. Nothing locally bought would fit him.",
      "rating": 5.0,
      "verified": true,
      "author": "LF",
      "helpful_votes": 40,
      "publication_date": 20160501
    },
    {
      "title": "Love it and the cat loves to be outside!",
      "text": "One of our cats loves to be outside! However, she could slip out if other harnesses. It took her a bit to get used to the fuller coverage of this one, but she waits by the door for me to put her harness on. Now, she can enjoy the great outdoors watching the birds! However, she can’t kill native wildlife and native wildlife can’t kill her. Side note: our other cat HATES the harness, but doesn’t like to go outside (so she doesn’t need to like it). I think some cats will adapt to it and others won’t.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom101",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "FINALLY something that fits my chonky cat",
      "text": "I have a 21 pound tuxedo cat that think's he's a dog. He loves car rides and tagging along wherever we go outside. He outgrew his last harness and we've been trying various ones but nothing fits well... until this! The XL fits him perfectly. Pros: Looks good, soft, FITS! Cons: - the neck and belly closures are pretty wide, but not 100% sure he won't be able to break the velcro open if he sets his mind to it. Some of the ones he outgrew also had a small buckle.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Troyer",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "This is the first harness that my cat has ever ...",
      "text": "This is the first harness that my cat has ever walked with, all the others I have bought he just would turn to a limp wet noodle. This one he was very unsure of but yet still was taking small slow steps in so to me that's a positive. I bought the small because I measured his chest at 14 in and don't know if he is all the way full grown yet, but it's a bit big on him.",
      "rating": 4.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 5,
      "publication_date": 20170605
    },
    {
      "title": "Great harness and fit!",
      "text": "My cat is 14 pounds so the harnesses at local pet stores didn't fit (snug behind his front legs and shoulder blades). Training him in the harness wasn't too difficult - lots of treats and positive reinforcement. He now associates the harness with outdoor time and is not as reluctant to allow me to put the harness on him. The harness seems well made. It has two Velcro flaps to secure your cat. I keep the front flaps always closed - it's easier to slip it over my cat's head for each use. The Velcro is rather sturdy and wide. I would recommend this harness to anyone looking to take their cat safely outdoors.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 5,
      "publication_date": 20150307
    },
    {
      "title": "The Only Wriggle-Proof Solution, Comfortable and Quick On-And-Off....",
      "text": "This is the only one he hasn't been able to wriggle out of. It's comfortable, and easy to make it fit just right. The Velcro is sufficient and sturdy. It's also easy to get it on and off quickly, which is important when kitties aren't the most patient critters in the world... I keep his leash attached to it and just pop it on and off... Then he can't take off on me once I've put it on him, and I don't have to try to get him to hold still in order to attach a lead, when once he's wearing it, he is ready to go, go, go ...",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 2,
      "publication_date": 20170702
    },
    {
      "title": "not as good as I'd hoped",
      "text": "This kitty holster looked so cite in the photos and had such great reviews that I had high hopes for it. However, it did not fit at all well; too large at the neck/front and too tight in the middle. It was very stiff and clearly uncomfortable. My cat walks fine in her old harness, but not this one.",
      "rating": 3.0,
      "verified": true,
      "author": "ejr",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Perfect for cat wrangling",
      "text": "For some reason, I assumed my cat would automatically be able to go on long walks just like my dog if he wears this. I was so wrong. We got to my front porch and I kicked ONE leaf. He lost his mind and looked like the main star in a pinball machine! I could only watch in horror as he clawed his way up my body to the safety of my head. This kitty holster did not budge once (even in midair)!! I'm so happy he didn't escape! Buy this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 7,
      "publication_date": 20161116
    },
    {
      "title": "Humane cat harness",
      "text": "Well constructed cat harness and my cat loves it. One drawback is the velcro closure gets filled with cat hair and is not easy to clean. It is a very humane way to control a cat in the outside environment. My cat begs to go outside now and trots along so proudly when I take him out for a walk.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Putnam",
      "helpful_votes": 4,
      "publication_date": 20170518
    },
    {
      "title": "sort of works but our cat fights it.",
      "text": "Our cat is big (about 17 pounds), strong, smart, and independent (about 12 years old). We bought the harness because we moved to a condo that wants all pets on a leash. We can get the XL harness on the cat without too much trouble and it seems to be comfortable for the cat but he resists being led around. Even when we cinch it up he manages to get out of it as soon as we turn him loose. I think if you have a cat that is less independent or that was harnessed when it was young this might work quite well.",
      "rating": 4.0,
      "verified": true,
      "author": "Fat Bamboo",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Helps with cat anxiety too!",
      "text": "My cat and I are all about this cat harness!! Daphne is 9lbs and lanky so we opted for the S/M in purple. The Velcro is strong enough that even when spooked she hasn't been able to break free and cannot back out of it either. It took us about a month and lots of treats to comfortably walk outside. She also LOVES the harness for car rides and thunderstorms, it helps calm her down immensely! Previously, 20 minutes into a car ride in a carrier she would have an accident, but with the harness on we made a 3 hour road trip without any accidents or crying!! AMAZING",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20170905
    },
    {
      "title": "No escape, but for cats who already know how to walk on a leash",
      "text": "I got an X-Small harness for my 8 lb kitty. For one, the neck was too long for her, and she seemed uncomfortable. For another, the way the velcro is put on (hook side facing out and exposed unless your cat is the perfect size) caused her to repeatedly get stuck to the carpet while trying to train her. It would probably be fine for outdoors - I just need to train her with something else first. Otherwise, it did indeed seem impossible to escape from!",
      "rating": 3.0,
      "verified": true,
      "author": "Xyrana",
      "helpful_votes": 3,
      "publication_date": 20161228
    },
    {
      "title": "Well made",
      "text": "This harness fits very well , is lined, which was a surprise, and has very strong Velcro. My Houdinis have tried, but have not been successful in removing themselves from its grasp. They look so cute in the tiger harnesses. One kitty felt comfortable immediately, the other laid down like a drama queen, but is getting better. I highly recommend this harness.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "Smaller cat becomes organ grinder monkey!",
      "text": "My kitten was 6 months when I got this for her. I agree with the other reviewers about the over abundance of velcro around the neck- strong enough for a lion cub. Altho it makes a kitten look like an organ grinder monkey in a ridiculous vest this doesn't seem to bother mine. Works great, she is comfortable and easier to control then other harnesses. Now if they could manage to develop a tin cup holder for the back maybe we could make some dough....",
      "rating": 4.0,
      "verified": true,
      "author": "Maebelle",
      "helpful_votes": 18,
      "publication_date": 20130309
    },
    {
      "title": "Buy Puppia instead.",
      "text": "This cat harness was good to train my kittens to walk, but is honestly a huge pain and they did get used to it, but it took awhile. I bought Puppia harnesses and they seem SO much more comfortable and happy on our walks (with no pulling or escaping).",
      "rating": 3.0,
      "verified": true,
      "author": "TLynnTop Contributor: Makeup",
      "helpful_votes": 4,
      "publication_date": 20170530
    },
    {
      "title": "Good overall cat harness",
      "text": "My kitteh is more than just a little overweight, so her original holster no longer fits. This size fit her well with one small glitch: the neck harness was too wide for a comfortable fit. It forced her neck up way too high to drink, eat or even lay properly with no optional fit. I solved the problem by folding the velcroed portions of the neck pieces in half and then twisting one side before closing it so that it couldn't ride back up to the full width again. I will end up sewing the neck portions into that position permanently. Otherwise, a good item for the price and I will buy from this company again when the need arises.",
      "rating": 4.0,
      "verified": true,
      "author": "Dotti Roth",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "I can't be happier with my purchase",
      "text": "I can't be happier with my purchase. My cat likes it too! Check him out! I added his name and a patch with iron-on material.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Hall",
      "helpful_votes": 24,
      "publication_date": 20150508
    },
    {
      "title": "Comfort?  I don't speak Cat, but he doesn't really like it.",
      "text": "Our cats are indoor cats but we have devised various ways of letting them enjoy some outdoor time. One is to use these harnesses with a long lead tied to a milk crate full of rocks (too bad I don't have some pics so you could have a good laugh!) I rated it 5 stars on stretch because it does not stretch, and unless you want your little escape artist to slither out of the vest, not stretching is a good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Cookie Monster",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great Cat Harness",
      "text": "I donated this cat harness to a friend as a \"Thank You\" for all that she does in helping cats & kittens. She is involved in all aspects of cat rescue from TNR (trap, neuter, return), to fostering, to finding wonderful homes for kittens & cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Leigh Too",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Sturdy cat harness",
      "text": "This is a very good harness to use if you want to take your cat outside on a leash. As long as you follow the directions & be sure to stay behind your cat while walking, your cat cannot escape from the harness. The Velcro is very strong. My cat will just stand there frozen when I first put the harness on her, but as soon as she's outside she seems to forget she's wearing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Seemingly the best cat harness (holster) on the market.",
      "text": "Got my feline overlord a tiger print kitty holster, and took her out for a \"walk\", she seems to quickly take to it, in the past, the most she would do is take 2 steps and flop over on her side. In the kitty holster, she started walking around, awkwardly, but progress is progress!! Very happy with my purchase. It does indeed seem to be an excellent, escape resistant cat harness.",
      "rating": 5.0,
      "verified": true,
      "author": "Felinious Monk",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Cats Will Complain Like Babies at First",
      "text": "I've trained both of my cats to wear these harnesses and elastic leashes since they were kittens. It works very well, but (as with anything) cats can wriggle out of this harness if you hold the leash taut. Also your cat will complain like a baby when first wearing the harness--staggering around and pretending like they can't walk. Once they actually want to go outside they'll forget about the harness.",
      "rating": 5.0,
      "verified": true,
      "author": "Ramenhotep",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "My cat got out and ran away",
      "text": "My cat ran away because of you people. My buddy of 10 years is now missing because he backed out of it. It was tight. I did what you said and now hes gone",
      "rating": 1.0,
      "verified": true,
      "author": "Meehan Ahearn",
      "helpful_votes": 3,
      "publication_date": 20190807
    },
    {
      "title": "the neck part of this fits great. It was a tight squeeze on the part ...",
      "text": "my boy is a big (not fat) 18lb kitty. his chest measured 16\" and his neck 9\". the neck part of this fits great. It was a tight squeeze on the part that hooks under the belly, but it does barely fit him. it definitely feels secure when he has it on, and i put it on him several times on a recent road trip when i had to stop and clean out his crate (because he poos when he's scared). i felt like he was completely under my control with the vest on and a leash. my boy hates it, but at least it keeps him safe.",
      "rating": 5.0,
      "verified": true,
      "author": "BellaGrace",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Not 'escape-proof' as advertised",
      "text": "Our 16 pound cat fit perfectly into the holster/harness and we had it secured very snuggly with the velcro closures. She escaped from it within 20 seconds. Also, this unit came without a leash. Granted, a leash was not part of the description, but most of the others just like this one on the web site came complete with a leash.",
      "rating": 1.0,
      "verified": true,
      "author": "Flower",
      "helpful_votes": 2,
      "publication_date": 20181210
    },
    {
      "title": "There's no escaping from this!",
      "text": "I have a male cat that is 14 lbs and is very long. I was VERY skeptical of getting him a S/M, but based on other reviews I did it anyways. It fits him wonderfully. With other harnesses, my cat escaped as soon as he got to the end of the leash. With this one that's not the case. He has a much harder time escaping from it. I will be getting rid of all my other cat harnesses. Aesthetically, my cat is striped and the tiger print on the vest is super cute on him :)",
      "rating": 5.0,
      "verified": true,
      "author": "Ben L",
      "helpful_votes": 0,
      "publication_date": 20170613
    },
    {
      "title": "Disappointed",
      "text": "I really had high hopes for this! It seemed pretty comfy to our 13 lb kitty and he was doing really well in it until something spooked him on our walk the other night. I had him very tightly (safely) wrapped up in this thing and he had lots of practice already but managed to squeeze out of it! Luckily my partner was with us and was able to catch him before he ran away but I just can’t trust it now. I’m pretty disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "Andrew Robinson",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Secure vest style harness",
      "text": "Small fit perfectly on my cat who is 10ish lbs. It is very secure and looks similar in design to a thunder jacket so I wonder if its calming to the cat. She might be able to slip out if I left her unattended and tied up but it seems pretty impossible when we are walking, even if we disagree on direction. One of the trade offs about the increased security is the heat factor, she gets too hot pretty fast during hotter days. Benefits are that it doesn't require going over the cats head which she hates",
      "rating": 5.0,
      "verified": true,
      "author": "starvingcollegestudent",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "My inside cat is now an inside/outside cat, thanks to this wonderful Harness",
      "text": "I love this harness. He loves going outside and laying under the tree, chasing buttterflies and just being a happy cat. I'm so paranoid if I were to just let him go \"out\", he'd go over the fence, maybe get chased by a dog, hit by a car, or god knows something awful could happen. But with his harness and a 50 foot leash, he has the run of the entire yard, and I still know he's safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda S. Abramson",
      "helpful_votes": 66,
      "publication_date": 20120717
    },
    {
      "title": "First time cat owner",
      "text": "Yes, I love it. However, it scared my cat to death and she would not speak to me for a week! I am a first-time cat owner and I thought I would have no problems teaching her, however, I was wrong. If it were possible to send it back without all the tags and wrappings I would. Perhaps when I have had the cat longer, and she trusts me, I will try and put it on her again and teach her. It fits her perfectly she weighs 8 pounds 6 oz. and was born 07-06-15 and has been living in a shelter. I just adopted her and given her a forever home. She is very insecure.",
      "rating": 5.0,
      "verified": true,
      "author": "dori",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "A great choice for a kitty harness!",
      "text": "This is great! We had a lot of trouble using a traditional harness because it stressed him out when trying to get it over his head. But I’m able to easily just Velcro this on him and he heads straight for the door! It’s also proved to be very sturdy because he’s gotten startled a few times but it showed no signs of give to where I was able to pick him up without him pulling or slipping out of it. Great buy! He’s only about 10lbs and kinda slender so the S/M fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Thea S.",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Excellent Cat Harness",
      "text": "Sturdy, lightweight design. The wide, heavy duty Velcro closures hold firmly, resisting escape attempts. Two separate closures means that you're not trying to slip it over a squirming cat's head. Amazingly, my cat accepted it the first time and even walked me on the leash. The large size fits my 15 pound cat snugly, which is a good thing. The toughest part is undoing the heavy velcro and the noise that it makes. This one is a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "I'm Bookish",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "The harness seems pretty good: strong",
      "text": "The harness seems pretty good: strong, well-designed--but definitely not wriggleproof. They don't claim it is, either, so that's not exactly a complaint. I'm trying to teach my cat to tolerate this, as we're moving a long way and she's going to have to become a traveler, but I am not sure this is going to work. She can squirm out of it even when there's no leash attached. Her tendency is to back up, and that's the best way to escape from it. Short of epoxying it to her fur, I suspect this is going to fail.",
      "rating": 3.0,
      "verified": true,
      "author": "Helen Irene",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "A good idea, but..",
      "text": "Someone didn’t think this product through all the way. The wide Velcro is poorly placed, and absolute murder to get undone, even on a cat who’s normally tolerant of most things. Also, and most importantly- the nylon strip on the back where the ring is to hook your leash is AWFUL! There’s absolutely zero padding under or around the metal ring—and VERY PAINFUL for my cat! It hurt her, and she wanted out of it immediately—and escaped out of the neck. I doubt any cat harness is really ‘escape proof’—but this product needs some serious re-design. Mainly for the Velcro placement, and particularly the metal ring on the back.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Good harness, but.....",
      "text": "When I put it on my cat, he acts like he's waiting to be put to sleep.",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel C. Morrissey",
      "helpful_votes": 3,
      "publication_date": 20190519
    },
    {
      "title": "Nice harness despite a poor fit for my cat.",
      "text": "Not sure if I bought the wrong size or my cat is odd size. The S and the S/M both cover his neck and chest measurement. I bought the S/M thinking he is still growing. The S/M is a bit long in the neck making it bunch up around his cheeks and or ears. I'll either buy the S and save the S/M for later or have a friend trim and hem the upper neck portion of this harness. I thought I seen a sizing chart that said S/M was for longer backed cats. Which my Bengal cat certainly is. If you're unsure you might buy both especially if your cat isn't fully grown.",
      "rating": 3.0,
      "verified": true,
      "author": "Gary M. Atchley",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "My cat HATED this",
      "text": "I tried to put my cat in this holster and he hated it. It is rather tough to put on and he seems uncomfortable. He is a long haired maine coon so maybe this would work better for short haired cats.",
      "rating": 2.0,
      "verified": true,
      "author": "Hamzah1024",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "AMAZINGG!!!!!",
      "text": "This Holster is absolutely amazing, my cat loves this, thing! She took a bit to get used to walking in it, but she never tried to get out of it! I also use it for when I travel, it seems to also help her with the traveling restlessness. I put it on her the first time on the plane and wow, she immediately calmed down and sat on my lap the entire 4 hour flight! Now to outdoor adventures!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ogyson",
      "helpful_votes": 2,
      "publication_date": 20181217
    },
    {
      "title": "Good product for small cats",
      "text": "After extensive use, we are happy with the product. Cat has only completely escaped twice, and has stayed put in most circumstances, including during overly enthusiastic chipmunk chasing! She seems comfortable while wearing it, though obviously she would prefer to be without any kind of harness at all. The Velcro has started coming loose at some of the seams, but harness has been used heavily and has been washed several times. Overall a good value for the price, and fits our small cat well.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria Trudeau",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Escape proof cat harness",
      "text": "This was just perfect for my cat. I didn't know exactly what size to get so this Medium/Large was the perfect size for my 12 pound cat. It's easy to put it on and to take off of him. He also can't wriggle out of it like the last one I had. It doesn't come with a leash so you need to get one if you already don't have one at home. It also comes with instructions of how to walk your cat. It's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "A really good cat harness",
      "text": "I took my cat, who cannot be outside in our retirement community without a harness, a while to get used to this. He gets especially upset when I undo the velcro since it makes a loud noise. However, it has allowed him time outside without worry that he'll escape and rocket up and down the backyards. His old harness allowed that if I didn't watch carefully. This is not to be used to leave a cat outside unattended. He now really looks forward to taking me for a walk. He is a cat after all with a mind of his own.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice'sThoughts",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "This was a tough sell for my cat and she ...",
      "text": "This was a tough sell for my cat and she still fights me with it, but doesn't mind much when I finally get it on her and she's playing. I have never even been able to put a collar on her so this was a success. The top collar is a little too thick and I can hear it restrict her breathing when she tries to hold her head down. I had to order two of these, the first is in my ceiling somewhere because she figured out how to ditch it in restrcited spaces. Don't ask me how my cat got in the ceiling.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Johnson",
      "helpful_votes": 0,
      "publication_date": 20180418
    },
    {
      "title": "Love it!",
      "text": "This is easy to get on and off and much better than the harnesses with no jacket part. Both cats fit in it even though they are different shapes and sizes, and they get really excited when they see me get it out even! One cat gets surprisingly docile when I put it on, I think it works a bit like a Thundershirt for him which is a nice perk.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica S.",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Fantastic item, well worth the price",
      "text": "We originally ordered the size suggested by our cat’s measurements but it was too large. We returned it and ordered the next size smaller and it has worked out well. Our cat spends most of the day outdoors when we’re home, so we needed a way to allow her to spend time outside when traveling in our motor home. She looks forward to our walks and stands patiently when we put the holster on. It has made our travels eitj our cat enjoyable!",
      "rating": 5.0,
      "verified": true,
      "author": "Cate E.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Good product! Be sure to get one size larger than what you think",
      "text": "My cat is one of those felines that hates confinement in any manner. It was worth a try and it works great as a thunder shirt! It is easy to put on with the velcro fasteners on the neck and stomach. Although she is a smaller cat she has a big stomach which would require me to get the largest size next time I decide to buy.",
      "rating": 4.0,
      "verified": true,
      "author": "B.P.K.",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Best harness for cat!",
      "text": "I bought the same harness and lease one year ago. However, during went for walk, my cat entered into small barn with stacked items to trace wild cat girl and cat harness, his harness and lease were tangeled with stacked items. My cat took off his harness and lease to go out, so we lost them. This time I bought both harness and lease with more thick one. I think this cat harness is the best one ever i bought as it can be permeable to air and cool with long time wearing. I recommend this one so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Helenseoul",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "It fits",
      "text": "This fits my 8.5 lb cat very nicely. I don't think she can get out of it, which will be perfect for when I take her traveling with me soon. She also doesn't seem to mind the harness, and the velcro doesn't scare her at all. But, she's a pretty chill cat to begin with, so maybe that's just her personality.",
      "rating": 5.0,
      "verified": true,
      "author": "S. E. Hood",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Kitty Holster makes my cat the belle of the trailer park.",
      "text": "I ordered this about 6 months ago when my kitty was smaller. She goes out everyday in her Kitty Holster. She walks on a leash and spends time on the porch wearing it. She thinks it is comfy, secure and stylish. It is made of sturdy cotton and holds on with Velcro.Bizzie has grown quite a bit and needs a larger size. So I am shopping for a new one hoping to get a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Taylor",
      "helpful_votes": 0,
      "publication_date": 20170717
    },
    {
      "title": "After one year, still sturdy and like new.",
      "text": "As advertised it's well made and escape proof if pulling on the leash in the right direction. We used on both cats no problems. After one year of abuse (rolling, climbing, scratching on all kind of outdoor surfaces) both still looked like new except the velcro are not clean but still very strong. Although this harness is more expensive but it is worth it given it's well made and great to protect the cats. I just ordered another one size up after one of our cats (now 11.5 lbs) has outgrown the XS.",
      "rating": 5.0,
      "verified": true,
      "author": "Yl123",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Cat Daddy recommends this one",
      "text": "I think this is the brand that Cat Daddy recommends, and if it isn't? it is darn close. My \"grandcat\" is indoor cat but my daughter wants to walk him outdoors and this does the trick, as that cat did wriggle free of all other types of vests, etc, that we tried. Cat stays in this one. Honestly, he has not even tried to get out of this vest yet, but so far, we can walk cat outdoors in this vest.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer33333",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "She LOVES it",
      "text": "She looks absolutely ridiculous in a harness, but she is also so happy on her walks! The harness is durable, the velcro is strong, very easy to get on/remove, and I can't imagine how a cat could possibly escape from it. We have washed it twice now, and it did shrink a little after we put it in the dryer so I recommend air-drying it. Remember if you decide to walk your cats using any kind of harness that you don't walk your cat, your cat walks you!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Duarte",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Love This",
      "text": "My little girl Missy loved to go outside in the backyard. She learned what this harness was for and she adapted to it so quickly. We went out every day, she would meow until I took her out, I loved doing it too. Unfortunately my little girl died of liver cancer in September of 2017. She was 14 years old. I will miss her forever, but I would recommend this harness. The only thing is, do not pull from the front,they can slip out very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "MissyCat",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Perfect for my cats going cross country",
      "text": "Both of my cats wore this harness as we traveled across the country—twice in one year! This harness excels over others I have used as others with straps across the chest my cats will stick their paws into to try to pry off, and end up getting stuck in them. This style and fit allows for comfort and security with it being positioned higher up on the cats. For our 21 hour plus car rides, these harnesses never caused discomfort, they never got stuck in them, and they always maintained flexibility. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "KJohnson",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Well made and about as escape proof as you can get.",
      "text": "This is clearly made for a cat. I used a large on a 12 lb oriental shorthair (he was tall and long - not fat!) and the velcro made it possible for this to fit his body so he couldn't slip out, which is hard to do on an OSH. He did not fall over like some cats do, and actually learned fast that putting it on meant he got to go out on the porch, albeit on a leash.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Locheiven",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great harness!",
      "text": "Fabulous harness! This is my second one. I got a new kitty and he is doing very well with harness training! Wish they had more colors in this size but its not a bad color. Its a darker denim blue color. Both of my cats like these harnesses. With others they just plop over like a sack of bricks. But in these they are playing and running around having fun. Highly recommend them! Just read through the pamphlet and check out their website for training properly and it should work out excellently!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171207
    },
    {
      "title": "Good luck",
      "text": "The item is as described, however the intended use case is unrealistic. Cats hate wearing these, mine just rolls around trying to get it off, eventually laying down despondant and refusing to move until it's off. Have tried training the cat to wear it by offering treats for putting it on, but have not made any progress. It does fit securely and your cat will probably not escape, but also probably will not want to live while it's on.",
      "rating": 2.0,
      "verified": true,
      "author": "Man of Matters",
      "helpful_votes": 2,
      "publication_date": 20161129
    },
    {
      "title": "best harness made",
      "text": "Best harness made - hands down. Cats are very secure inti and wont slip or wiggle out of it and began walking in it right away. won't buy any other brand now.",
      "rating": 5.0,
      "verified": true,
      "author": "music mom",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Best kitty harness out there!",
      "text": "This is sooo easy to get on the cat. By far the least stressful of all harnesses (and I've tried them all). Simply plop on top of your cat and secure the Velcro. No trying to shove a head or legs through. So easy! It's super secure so I don't worry about him slipping out. My cat doesn't fight me or freak out when I put it on and has gotten used to walking around comfortably with it on. Can't recommend enough!",
      "rating": 5.0,
      "verified": true,
      "author": "A. drake",
      "helpful_votes": 2,
      "publication_date": 20170630
    },
    {
      "title": "Great idea, needs a little refinement",
      "text": "Echoing some of the other reviews here, the harness works well, but the neck flap is too wide and may be a little uncomfortable for my little furry friend. He does wear it without complaining. I am careful to not fasten it too tight. I am thinking that perhaps a similar design with a narrower neck flap, and the velcro on the back of the harness, might be even better. With the velcro on the back, escape would be even more difficult as the pressure on it would be less. Then again, my little fur baby is easy to put a harness on.",
      "rating": 4.0,
      "verified": true,
      "author": "Wallace Trust",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Great Product",
      "text": "This is a great harness for my F-2 Savannah with her long neck and long legs. It holds her securely and I can even air-lift her without hurting her at all. I got the m/l and it is a tad too big, but I found heavy duty velcro at Home Depot which exactly matches and with a bit more velcro to secure her, I would trust the harness for a good day hike in the woods. She is 10 years old and has not done much walking with leash and harness; the biggest problem is with panic over automobiles. This harness will keep her from harm. Thank You!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Shaffer",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "the Velcro is of good quality and holds him well",
      "text": "My cat loves his harness. Kylo weighs 17 pounds and this harness holds him perfectly. I was hesitant about using Velcro to take him outside and on trips but that was unfounded, the Velcro is of good quality and holds him well. Make sure you place this snuggly like any other cat harness so they don't pull back out of it, other than that it's a perfect thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Crow's Roots",
      "helpful_votes": 4,
      "publication_date": 20161103
    },
    {
      "title": "Cats are still getting used to it-but it fits great and seems to be secure",
      "text": "Cats are still getting used to it-but it fits great and seems to be secure. They need to be distracted while wearing it still but have not managed to get it off when they have tried. Bought S/M for a 11 something pound very long haired cat.",
      "rating": 5.0,
      "verified": true,
      "author": "aero",
      "helpful_votes": 11,
      "publication_date": 20160304
    },
    {
      "title": "I have tried other harnesses and this is by far the best.",
      "text": "The harness fits snugly and the Velcro holds well. We are doing pretty good orienting our 1 year old kitty to he harness. I a, rating a 4 because the neck strap was far to wide for our kitten. I trimmed down the neck strap to half the size and it still holds well but fits her better. She is a rescue kitty that is obsiously part main coon with long hair and a small head. I have tried other harnesses and this is by far the best.",
      "rating": 4.0,
      "verified": true,
      "author": "SMil",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Not escape proof",
      "text": "The harness was adjusted to my cat, and still have her comfortable. She wiggled out of it within minutes. Re-adjusted - same thing. To put it on any tighter would have hurt her. If you do use this, don't trust it completely that your cat will still be there when you get back.",
      "rating": 3.0,
      "verified": true,
      "author": "roses",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Comfortable and secure fit.",
      "text": "The company which makes this product has been around for quite some time already and over the years we have purchased multiple harnesses from them. It is a great product. Easy to put on the cat and easy to take off again. The two Velcro flaps are large enough to make it a very secure and also comfortable fit. Can highly recommend this harness.",
      "rating": 5.0,
      "verified": true,
      "author": "P Corsius",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Cute kitty vest",
      "text": "This vest is easy to put on quickly. Kitty stays in it snugly. I just wished that I got the smaller size. If your cat is in between small/med and med/large, I'd go with the smaller size. It'll be a better fit for kitty.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreamko",
      "helpful_votes": 25,
      "publication_date": 20121010
    },
    {
      "title": "Takes a bit of adjusting, but seems very secure",
      "text": "My cat tolerates clothes (bandannas, harnesses, costumes) really well, but the first few days with this got a big reaction from him. I think it's the snug fit to his body, but he would just collapse on his side. He's since gotten used to it, and now seems totally fine. We go out for walks and rides in the backpack, and no problem with security, but I never let him pull backwards on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Andrews",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Big hit with our mini Panther",
      "text": "We bought this harness for a trip across country with our skittish black cat. We followed instructions and since he always wants to go outside even the 1st attempt was mostly successful. Now we’re on day 3 of the road trip and he loves stops when he can take a walk. He’s much more content and rests well. We look forward to letting him explore our new unfenced acre when we arrive at our new home. It takes time but very worth trying this with your kitty.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer S",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Breathable material, secure hold!",
      "text": "It's a great harness!! I think my kitty has a short neck because it kind of comes up too far for him. But I think that's a him thing I'll just have to adjust it to. The quality is great and seems to be very breathable so he doesn't get super hot. The leash link is very durable and resilient. We've had a few attempted run offs, but it's withstood all of them. I feel a lot more calm about taking my guy outside, which in turn is helping him to feel more calm as well.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Sherman 42 Wallaby Way",
      "helpful_votes": 0,
      "publication_date": 20180512
    },
    {
      "title": "the holster looks nice and it's sturdy",
      "text": "the holster looks nice and it's sturdy, with strong velcro closures. i like that it is made of cotton. It is easy to put on, even on a wild punk cat like mine. However, she hates it. It is very stiff at the top and she looks (and moves) as if wearing a turtleneck corset. I'm keeping it because i only need it for clearing airport security with minimal flight risk, although she already wriggled out of it once. I would not use it for walking her around. My cat is 4kg/9lb and an S/M fits well, on the roomy side.",
      "rating": 3.0,
      "verified": true,
      "author": "laura",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Very Pleased with this Purchase",
      "text": "I bought the Kitty Holster so I could safely take Charlie on a car trip. Charlie was not happy at first, but after figuring out that he could not roll out of it, he decided it wasn't that bad. I was walking him around the inside of the house a short time later. This is a photo of Charlie relaxing in his vest and watching the birds after his first walking session. Very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann D.",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Happy cat",
      "text": "Kitty, who hates her traditional harness, seems to love this vest. She even enjoys walking around wearing it indoors. No problem getting it on her and the Velcro noise when taking it off isn't a problem. She hasn't yet bucked out of it like she did all the time with her harness. Medium fits our 12 pound cat snug but well. Taking her for walk is now a pleasure instead of a chore.",
      "rating": 5.0,
      "verified": true,
      "author": "ehm1217",
      "helpful_votes": 0,
      "publication_date": 20180424
    }
  ],
  "product_meta": {
    "title": "Kitty Holster Cat Harness",
    "rating": 4.3,
    "feature_bullets": [
      "Ultra-lightweight and comfortable for cats to wear",
      "Undyed cotton lining that is gentle on cats delicate hair and delicate skin",
      "No nylon, thin straps or plastic clips that can cause uncomfortable pressure points and/or skin abrasion",
      "No harsh webbing to break or abrade hair",
      "No difficult-to-fasten, hard-to-fit snaps"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "9 x 0.25 x 16.5 inches; 3.21 Ounces",
      "Item model number": "KHBLACKML",
      "Date First Available": "March 14, 2012",
      "Manufacturer": "Crazy K Farm Pet and Poultry Products",
      "ASIN": "B007KAWSU8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Collars, Harnesses & Leashes",
      "Harnesses",
      "Pet Supplies",
      "Cats"
    ],
    "price": 24.95
  }
}