{
  "website_summaries": [
    {
      "verdict": "A solid steel hatchet that can handle heavy jobs.",
      "pros": [
        "One solid piece of steel",
        "Leather grip",
        "Works great as a camp ax or on a construction site",
        "Hammerhead pounds stakes efficiently",
        "Easy to sharpen",
        "A very handy tool"
      ],
      "cons": [
        "Does not come with a sheath or cover, and you will want one for the sharp blade"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great hatchet! Wrong photo in the listing",
      "text": "This is a great hatchet! American made, \"full tang\" the grip is perfect, and after chopping into some unknown, hard, dried up tree I didn't feel any fatigue or excessive shock. Fit into my lightweight, small, nearly empty backpack without being too cumbersome or throwing the weight off balance as I walked. The photos on the listings of this product and the rigger's axe are mixed up, the carpenter's hatchet is all steel with blue on the handle only, while the riggers has blue paint up the neck of it. Riggers axe is longer and has a waffle face in the hammer while this Carpenter's Hatchet is a smooth face. All in all great product and maintains it's edge!",
      "rating": 5.0,
      "verified": true,
      "author": "Danny",
      "helpful_votes": 3,
      "publication_date": 20190610
    },
    {
      "title": "Perfect for throwing",
      "text": "I didn't buy this to use for chopping wood or cutting kindling. I purchased it specifically to throw at a bullseye type target as used in WATL. It is perfect for doing this, at least in this novice axe throwers opinion. It is well balanced, a good weight, solid and the rubber handle provides good grip. Being a solid, single piece axe means I will never have to worry about the head coming loose or falling off.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20200629
    },
    {
      "title": "Stacked leather handle carpenter's hatchet:",
      "text": "Pros: Classic design, Proven Staying Power Cons: none Best Uses: Shaping wood and framing work: My father had an Estwing stacked leather handle hatchet. I always liked the design and the way it worked. I needed a hammer and, on looking around, found that the Estwing design, from 1923 is still being manufactured. Naturally I bought one, and was so taken with the idea of owning something of such classic and proven design that now I own practically a complete set of Estwing leather handled tools. You can't buy an American made \"Perfect Handle\" wrench or screwdriver anymore, but Estwing keeps right on making their striking tools to the same standard as when they designed their original 90 years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray E. Dryden",
      "helpful_votes": 12,
      "publication_date": 20130128
    },
    {
      "title": "Good tool",
      "text": "Great little hatchet. Must have for camping or that truck tool box. Good wight and balance. Grind and finish are not top shelf, but great for the price point. Keep in mind it does not come with a sheath/edge protector and it really needs one. Obtain one, it’s a sharp blade and needs it.",
      "rating": 5.0,
      "verified": true,
      "author": "oscardad",
      "helpful_votes": 4,
      "publication_date": 20170817
    },
    {
      "title": "Estwing’s E2H carpenter’s hatchet is a great tool!",
      "text": "I have loved the feel of the leather grip, and the solid build of my Dad’s Estwing hammer. This E2H hatchet has all the same great Estwing qualities, plus the curved leather handle which feels just right when you are swinging it. One very solid forged steel tool, with the leather grip, makes for a heirloom quality tool you can pass on to the next generation...",
      "rating": 5.0,
      "verified": true,
      "author": "Double Nickel",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Nice tool",
      "text": "Can't go wrong with Estwing tools. Nice weight and comfortable grip. I sharpen mine with 320 grit on my vertical belt sander. Super sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "No one",
      "helpful_votes": 2,
      "publication_date": 20190210
    },
    {
      "title": "Terrible Craftsmanship",
      "text": "I tried twice to get one that had quality machining without luck. The lines on the hatchet head were irregular and both sides looked and felt different. I bought a camper's axe, prospector's hammer, and claw hammer that were what I expected (the camper's axe twice). I bought them because I liked the old-school stacked leather handles and polished steel look they have. I thought they were beautiful. I have the camper's axe and prospector's pick displayed on my wall. I'd be embarrassed to display this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg in Idaho",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Just what I needed",
      "text": "My husband had this hatchet for many years. After using it almost daily at work it finally broke. He's looked for a new one just like it for a few weeks at our local hardware and home improvement stores with no luck. He was very happy to see it available on Amazon and is pleased to have it back in his work van.",
      "rating": 5.0,
      "verified": true,
      "author": "C. ROCK",
      "helpful_votes": 3,
      "publication_date": 20161115
    },
    {
      "title": "Sharp right out the box",
      "text": "Great hatchet.sharp right out the box.bought for someone as a gift. They love it",
      "rating": 5.0,
      "verified": true,
      "author": "Big worm ",
      "helpful_votes": 2,
      "publication_date": 20190321
    },
    {
      "title": "STOP abusing your knife and get one of these to split camp wood",
      "text": "I love the Estwing line of tools and this hatchet is no exception. No, it doesn't come with a sheath / cover but with a little modification you can adapt a cover purchased separately to work well for this hand ax. Around camp, this is a truly multi-use tool.... It splits wood, hammers stakes, pulls some stakes or nails with the little notch under the blade, it cracks nuts....It slices, it dices, it.....oops Anyway, seeing some of the u-tube videos of idiots splitting wood with their knives and then bitc...umm, complaining when said knife breaks because of ABUSE just makes me shake my old head and wonder why they don't buy one of these well made hatchets.",
      "rating": 5.0,
      "verified": true,
      "author": "Cloyd R.",
      "helpful_votes": 9,
      "publication_date": 20160614
    },
    {
      "title": "Estwing Quality",
      "text": "Feels good in my hand. Does the job well. A tool you never worry about.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Goodson",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Very good.",
      "text": "I have several of these and I’m very happy with them. They work well and are sturdy enough to handle a lot of abuse.",
      "rating": 5.0,
      "verified": true,
      "author": "zach s.",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Classic excellent tool",
      "text": "An absolute classic. Great quality, and Estwing's classic leather grip. I wish they made a belt sheath, or any sheath, as I use this for general camping, not especially for carpentry.",
      "rating": 5.0,
      "verified": true,
      "author": "Lawrence Whitehead",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "if you need a tough as nails hatchet you could not buy a better",
      "text": "I literally use these for chopping the lines off of the road ... for years .... all the time chopping the pavement .I have never broken one and a little time on a grinder and they sharpen right up ,if you need a tough as nails hatchet you could not buy a better one",
      "rating": 5.0,
      "verified": true,
      "author": "greg moore",
      "helpful_votes": 4,
      "publication_date": 20170311
    },
    {
      "title": "Itrs an Estwing so what else needs to be said ...",
      "text": "Itrs an Estwing so what else needs to be said ? The reason it gets 4 stars instead of 5 is it comes with no sheath, nothing to protect the blade from you or you from the blade, what the H was estwing thinking ?",
      "rating": 4.0,
      "verified": true,
      "author": "RLF",
      "helpful_votes": 4,
      "publication_date": 20150802
    },
    {
      "title": "Great item and a campers must have",
      "text": "Camping season is just around the corner and last year my old one of 20 years was stolen so I had to get another one. This is you hammer for tent spike and an axe for making fire wood starter size pieces of wood. In the past I have used this to cut up large fish (shark) when camping on the beach.",
      "rating": 5.0,
      "verified": true,
      "author": "John P. Fortunato",
      "helpful_votes": 7,
      "publication_date": 20100214
    },
    {
      "title": "Top of the Line Hatchet!",
      "text": "Estwing Quality goes without saying! I have owned an Estwing hammer since 1989 and it is still in great condition!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Great camp hatchet",
      "text": "Great camp hatchet. Unlike the leather handled one by the same manufacturer this one you can actually use for pounding tent stakes without the hatchet deforming.",
      "rating": 5.0,
      "verified": true,
      "author": "G Bubba",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Another Fine Estwing Product",
      "text": "What can you say, it's a hatchet. Another fine Estwing product, bought it for camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Five Stars",
      "text": "Gotta love Estwing quality, and made in the USA! You'll like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Westbrook",
      "helpful_votes": 2,
      "publication_date": 20150614
    },
    {
      "title": "Fine Hatchet could use a sheath",
      "text": "Nice tool especially if you need to split pieces of 2x wood for kindling",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 2,
      "publication_date": 20150411
    },
    {
      "title": "Great product just not what I was looking for",
      "text": "Great product just not what I was looking for. Returned for credit and purchased the right one. the return process and refund has been great thus far!",
      "rating": 4.0,
      "verified": true,
      "author": "jillian",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Another great Estwing product!",
      "text": "What can I say....it's an Estwing! Solid, sharp and powerful!",
      "rating": 5.0,
      "verified": true,
      "author": "Dose Of Reality",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Good product",
      "text": "Nothing less to be expected from an Eastwing product. The only thing is that there was a nick on the blade. Nothing that a little sharpening will take out.",
      "rating": 4.0,
      "verified": true,
      "author": "Booey",
      "helpful_votes": 2,
      "publication_date": 20131027
    },
    {
      "title": "One of the most useful tools on the farm with the extra weight this ...",
      "text": "One of the most useful tools on the farm with the extra weight this thing will drive steeples better than any hammer.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra Wheeler",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Five Stars",
      "text": "Does exactly what we need it to do when a windy storm brings down tree limbs and brush.",
      "rating": 5.0,
      "verified": true,
      "author": "Maureen D'Arcy",
      "helpful_votes": 2,
      "publication_date": 20150814
    },
    {
      "title": "Four Stars",
      "text": "Very nice hatchet but arrived with a small ding in the blade.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Hyde",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Sharp but crooked. My handle is not straight, ...",
      "text": "Sharp but crooked. My handle is not straight, but it does a well enough job of notching logs and removing branches that the $40 isn't a total loss.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Hachet is 5 stars...but NO SHEATH!",
      "text": "the Hatchet is Estwing....what else can you say about that.....solid piece of quality steel from end to end with a beautiful leather grip.....i give it 5 stars......but there is no sheath with this product!!!! i realize there isnt one in the product description but i just assumed there would be since Estwing has a leather sheath on all of their cutting edge products!!!! If there had been a sheath with this like there was supposed to be, it would have been 5 stars!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 5,
      "publication_date": 20140126
    },
    {
      "title": "love it",
      "text": "quality sharp as advertised love it a little heavy for a pack but Im sure I can make it work only complaint I wish it came with a sheath",
      "rating": 5.0,
      "verified": true,
      "author": "PAUL",
      "helpful_votes": 0,
      "publication_date": 20131216
    },
    {
      "title": "Estwing carpenters hatchet",
      "text": "This was just what I was looking for. It will do the job I need it for also.A required tool for doing wooden shakes..",
      "rating": 5.0,
      "verified": true,
      "author": "Rick R",
      "helpful_votes": 2,
      "publication_date": 20130402
    },
    {
      "title": "the best hatchet",
      "text": "Great hatchet I've ever used, my husband liked it so much he purchase one for himself and his friend we all do construction work.",
      "rating": 5.0,
      "verified": true,
      "author": "itabonita",
      "helpful_votes": 2,
      "publication_date": 20120318
    },
    {
      "title": "Another great product",
      "text": "This hatchet has lived up to its expectations. Very pleased with its quality and expect many long years of reliable use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20131021
    },
    {
      "title": "Great product",
      "text": "Love it. Just what I was looking for. Just wished I could find a sheath for it.",
      "rating": 5.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Five Stars",
      "text": "Great for when we are changing target in the woods",
      "rating": 5.0,
      "verified": true,
      "author": "Geoffrey Calvert",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Carpenters Hatchet",
      "text": "I bought this as a camping/bugout bag ax. I haven't tried it out yet, but it is an Estwing and I'm sure it will out-perform as most of their products do.",
      "rating": 5.0,
      "verified": true,
      "author": "PJSolarz",
      "helpful_votes": 0,
      "publication_date": 20130325
    }
  ],
  "product_meta": {
    "title": "Estwing Carpenter's Hatchet - 13\" Half Axe with Smooth Face & Shock Reduction Grip - E3-2H",
    "description": "Estwing's Solid Steel Carpenters Hatchet have bonded and molded Shock Reduction Grip which offers the utmost in both comfort and durability, while reducing vibrations caused by impact. Estwing hammers are the only hammers that can make this claim. The head and handles are fully polished and are forged in one piece. Made in the USA using the finest American tool steel.",
    "rating": 4.6,
    "feature_bullets": [
      "FORGED IN ONE PIECE – The most durable, longest lasting striking tools available",
      "GENUINE LEATHER GRIP – Hand sanded and lacquered for a durable yet comfortable finish",
      "MADE IN THE USA – Our tools are proudly crafted in Rockford, IL using the finest American steel",
      "VERSATILITY ON THE JOB – Suitable for all types of job, from traditional woodworking to heavy duty construction",
      "BUILT FOR THE PRO – Woodworkers, Log Builders, framers, roofers, carpenters, contractors, tradesman & serious DIYers"
    ],
    "specifications": {
      "Manufacturer": "Estwing",
      "Part Number": "E3-2H",
      "Item Weight": "7 ounces",
      "Product Dimensions": "13 x 6.25 x 1.25 inches",
      "Item model number": "E32H",
      "Is Discontinued By Manufacturer": "No",
      "Style": "Manual",
      "Material": "Synthetic",
      "Item Package Quantity": "1",
      "Included Components": "Carpenters Hatchet",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Manufacturer Warranty",
      "National Stock Number": "5110-01-473-9400",
      "ASIN": "B007OM9IHS",
      "Customer Reviews": "4.6 out of 5 stars70 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#107,203 in Tools & Home Improvement",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "Date First Available": "January 16, 2007"
    },
    "categories": [
      "Hand Tools",
      "Hammers",
      "Tools & Home Improvement",
      "Shingle Hammers",
      "Power & Hand Tools"
    ],
    "price": 40.35
  }
}