{
  "website_summaries": [
    {
      "verdict": "High-quality lens that outperforms most zoom models in image quality. Quiet auto-focus mechanism.",
      "pros": [
        "Fast auto-focus mechanism runs quietly",
        "Works in many situations",
        "Small size for a zoom lens",
        "One of the best zoom lenses available for a Canon camera in terms of image sharpness"
      ],
      "cons": [
        "Price point is well above average",
        "The f/2.8 maximum aperture won't fit some needs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wow. Just wow.",
      "text": "I'm blown away by the quality of photographs this lens helps create. Back in 2011 I purchased the first version of this lens and used it faithfully as my work horse. Now that this version two dropped in price from the original introduction price, I finally decided to make the upgrade and boy if I only knew what I was missing all this time! The image are tack sharp, autofocus is extremely fast, and the bokeh is so smooth. This lens is hands down the best lens I have ever used. If you're looking for a perfect all around lens, this is the one for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 27,
      "publication_date": 20161126
    },
    {
      "title": "Wonderful lens!",
      "text": "Holy cow, this lens is good! Admittedly this is my very first \"L\" glass, so I may be overly enthusiastic. Compared to the (very good) kit lens, I get way more perfectly focused photos -- hardly any rejects for focus problems. Not super wide, or much telephoto, but on my Canon 70D (crop sensor) it is great for the people photo shoots I've done. All other aspects of my photos are just plain better. This makes my camera better, which is my highest complement.",
      "rating": 5.0,
      "verified": true,
      "author": "BillyJCO",
      "helpful_votes": 11,
      "publication_date": 20170910
    },
    {
      "title": "Catches great 50 Megapixel images",
      "text": "No image stabilization, but WOW, what a great lens. Coupled with my new Canon 5Ds, this F2.8 lens rocks!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 4,
      "publication_date": 20191014
    },
    {
      "title": "Just brought my photography to a new level.",
      "text": "Doesn’t get any better than this. Colors, contrast, are superb and sharp af. No IS but haven’t had any issues in low light getting sharp images but you definitely need good technique. Why they didn’t add image stabilizer is beyond me. But you don’t have worry about turning it off when you have it on a tripod. Honestly though I couldn’t be happier. It really is a superb lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Aquila",
      "helpful_votes": 5,
      "publication_date": 20190302
    },
    {
      "title": "Excellent quality product!",
      "text": "This item is durable! Feels excellent when holding it. A little on the heavy side but is as expected. Liked how it was shipped the lens was protected in case of a drop. Would recommend buying from here",
      "rating": 5.0,
      "verified": true,
      "author": "Erick S.",
      "helpful_votes": 4,
      "publication_date": 20171222
    },
    {
      "title": "The first lens you should buy",
      "text": "I have spent a fortune on prime lenses. If I had purchased this lens first, I would have not purchased several of them. This astro shot was taken by combining many 70mm images into one. Shot at 2.8. with a little imagination, this is a very versatile lens.",
      "rating": 5.0,
      "verified": true,
      "author": "J. G.",
      "helpful_votes": 25,
      "publication_date": 20170826
    },
    {
      "title": "Phenomenal Lens",
      "text": "This lens is absolutely phenomenal. The images are incredibly sharp and the bokeh is great. I have used it in many different situations, portraits, landscapes, etc and it has not let me down. It is expensive but it is well worth the cost. If you are debating on getting a new camera body or this lens, get this lens first, it will make a huge difference.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Lyles",
      "helpful_votes": 8,
      "publication_date": 20160125
    },
    {
      "title": "Used quality - meh. Lens? It’s growing on me.",
      "text": "This lens took a while to get used to as I primarily shoot with 50mm and tighter. The depth of field dramatically reduces when you get wider. But, for weddings, it is great for low light and a great range. I was a bit disappointed by the quality advertised in the “very good” condition from Michigan Camera as mine had significant warping on the front ring, and a scratch on the lens (not visible in photos). Unfortunately I didn’t see it in time to return so I’ll have to deal with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Reed",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Sharp, sharp, sharp",
      "text": "This lens is unbelievably sharp. I took a shot of a bush and cropped it down to a close-up of a bee. The second photo is the half way cropped. I wish I'd keep the original. The bush filled the frame. Note the texture of the wings. Just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 16,
      "publication_date": 20170513
    },
    {
      "title": "Perfect range for portraits and wide enough at 24mm for ...",
      "text": "What can you say about this lens that has not already been said? Perfect range for portraits and wide enough at 24mm for most landscapes. Even handheld at f/2.8 I get really sharp shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Dent.Arthur.PTop Contributor: Photography",
      "helpful_votes": 5,
      "publication_date": 20170408
    },
    {
      "title": "Best multipurpose Lens.. Hands down.",
      "text": "Absolutely the best lens I've ever used. Thing is super fast and clear and I love the fact that I can use it in a Gym and actually capture Volleyball action pics at a very low ISO. If you are looking at this lens compared to an off brand I'd recommend this one every time..",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 5,
      "publication_date": 20160620
    },
    {
      "title": "Sharp, fast, lighter than expected",
      "text": "Have used this just a few times with my 70D, but the images are sharp and beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew J. Glover",
      "helpful_votes": 7,
      "publication_date": 20160823
    },
    {
      "title": "Excellent lens",
      "text": "In any photography, it is the lens that matter. And this is the best investment in lens that I have made. The lens has a very nice range 24- to take wide angle photos in a reasonably small room and 70 for moderate zoom. It performs very well for this entire range and I have nothing but great pictures. I am very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Anomaly",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Tack sharp",
      "text": "Using a Canon Mark III, I used the Tamron 28-75 for years. I upgraded to this one and am amazed by the clarity and quality difference. I was spoiled with the Canon 70-200M 2.8 L-lens, where eyelashes and everything are crisp and and in focus, and I wanted a high quality everyday lens that could match the quality. This did not disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 7,
      "publication_date": 20160225
    },
    {
      "title": "Best lens for Canon shooters!!",
      "text": "Other than not having image stabilization. This lens is amazing! This is definitely my number one go to Lens!! I had purchased two by accident but wish I could have kept both!! I use Canon EOS R and if this is this good I couldn't imagine using the RF glass! AMAZING non the less",
      "rating": 5.0,
      "verified": true,
      "author": "Dion White",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great lens.",
      "text": "It’s obviously great. You can use it for so many things.",
      "rating": 5.0,
      "verified": true,
      "author": "Shevy A",
      "helpful_votes": 2,
      "publication_date": 20190303
    },
    {
      "title": "A solid workhorse lense.",
      "text": "I love this lens. It is fast. The f2.8 is a great help and as someone who uses primarily prime lenses, the zoom feature on this lens is very useful when shooting wedding and fluid events. Images are sharp and crisp, focusing is fast and quiet. I really enjoy using the 24mm length for wide angle and dramatic shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Foster",
      "helpful_votes": 5,
      "publication_date": 20151027
    },
    {
      "title": "Had the I and II Version",
      "text": "I had the 24-70mm f2.8L and it was lost in s stupid situation. I was heartbroken. It was an amazing lens. I replaced it in short order, expecting the same performance. I was wrong. This updated version of the lens is much sharper, faster, has a zoom lock and feels like the build quality is just tighter. This is an upgrade from the original. You must use both to understand. The II is leaps and bounds ahead of the original in my opinion. Pair this with the 5DM3 and you have a great combo.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeDaytona675",
      "helpful_votes": 6,
      "publication_date": 20130930
    },
    {
      "title": "Great pictures quality",
      "text": "A great lens, fast, silent and great quality pictures. I miss the IS, you loose a couple of stops",
      "rating": 5.0,
      "verified": true,
      "author": "jose zablah hasbun",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Upgraded from 24-70mm f/2.8 version 1",
      "text": "My wife and I operate a photo/video business. We originally owned the 24-70 version 1, but found we never used it in professional scenarios due to lackluster sharpness when comparing to our primes. We sold it, and were dithering about which prime lens to buy next when this lens was released. After some initial reviews (and with Amazon Prime's excellent return policy) we decided to take a chance on this lens. WOW, what a difference! It holds its own against our prime lenses. The sharpness and color saturation is just amazing. This has become our go-to lens, not just for a great walk-around lens, but in most professional scenarios as well.",
      "rating": 5.0,
      "verified": true,
      "author": "George B. Powell",
      "helpful_votes": 23,
      "publication_date": 20131013
    },
    {
      "title": "Wow! Super fast Shipping and product is perfect",
      "text": "I was not expecting this item until October 8th but it arrived today and looks brand new! I took a few test pictures and so far everything looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Excellent zoom lens",
      "text": "I'm not a pro photog and I don't make money from my images. I do, however, love to take photos and have a blast doing so. My images are used in marketing collateral and make the rounds on social media. For my needs, this lens is fantastic - it's an ideal walk-around lens that is both fast and easy to use. While I do prefer my 50-1.2L prime, this zoom is often friendlier to use.",
      "rating": 5.0,
      "verified": true,
      "author": "I.B. Miller",
      "helpful_votes": 3,
      "publication_date": 20150607
    },
    {
      "title": "A Great Canon Lens!",
      "text": "Produces excellent photos at various focal lengths with almost \"prime lens\" quality! It is also much lighter than the equivalent Nikon lens and includes image stabilization.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel F. Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Excellent Lens at All Focal Lengths",
      "text": "This is an excellent lens with extremely good edge-to-edge sharpness at seemingly all focal lengths. I am very happy with the image quality the lens has produced thus far. The lens is much sharper than the lens I replaced with this one, my Canon EF 24-105 f/4 L IS USM. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "MHSvz32",
      "helpful_votes": 3,
      "publication_date": 20151207
    },
    {
      "title": "Wow",
      "text": "This is my most used lens. I have several others, but the F stop on this makes my Canon 5DSR more usable in lower light situations. LOVE it!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Allen",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Great lens, but the price...",
      "text": "Except for the price, this is a wonderful lens. I have been shooting basketball games, and I need the low F value, and the mid range zoom when players drive to the basket.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg Hooten",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "Great lens",
      "text": "Got this for my 5D IV so I can have a lighter kit to travel with. I love it. Hasn’t come off my camera since I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Awesomeness!",
      "text": "Pros: GREAT COLORS! VERY sharp at all but 70mm, even then it's still really good, just not AS good. Fast. Great build quality Cons: None. I don't regret this lens in the slightest. I just wanted to add my two cents. This is a great lens and I use as my go-to indoor lens. It took the place of my 35mm f/2.0 and 85mm f/1.8 for everything except the darkest of situations. Paired with my 5D mkIII it performs superbly. I can definetly recommend this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "twgomez",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Sharpest Images of Any Lens I Own!",
      "text": "Only my Canon 70-200L f/2.8 IS II is sharper! Clean and sharp corner to corner. Crazy color rendition! One of my most-used lenses. I do wish it had Image Stabilazition, other than that it's 5 stars every time!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Holland",
      "helpful_votes": 6,
      "publication_date": 20150116
    },
    {
      "title": "Great",
      "text": "Arguably the best 24-70 2.8 out there save for the RF 24-70 2.8 with IS.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary S.",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Excellent product!",
      "text": "Excellent product. Fit my needs for nature and wildlife photography.",
      "rating": 5.0,
      "verified": true,
      "author": "kcyu",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Lens of the Decade",
      "text": "We love this lens. It does it all. Close up, far away, and in between. It is pricey but you see the difference in images. It's great for photographing kids and they are constantly running away and coming in way close and this lens can handle all those situations.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Gilbert",
      "helpful_votes": 5,
      "publication_date": 20150414
    },
    {
      "title": "Excellent",
      "text": "I'm pretty happy with this lens. This is my go to lens now. Great delivery time..etc. All was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Artsy Chick Photography and Art - Maribel Salcido",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "A powerful lens at every angle!",
      "text": "I always appreciate product developers who think and study how to add and improve a product instead of cost savings. What I appreciate and like on this lens, is the \"Lock\" aside from its superior performance. Karl Dancik",
      "rating": 5.0,
      "verified": true,
      "author": "Karl J. Dancik",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Lives up to its reputation",
      "text": "I use this lens for indoor gymnastics, which are very challenging conditions for a photographer (terrible lighting, far away, not allowed to use flash, constant zooming, moving subject). The lens is very fast, and auto-focuses quickly. The focal length range works for most gymnastics events that I can physically walk up to. For events farther away, I use the 70-200mm f/2.8. Both lenses are crazy expensive, but it's like packing several prime lenses into one zoom. Well worth the cost. This is amazing glass, and kicks booty on video as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Builder Boy",
      "helpful_votes": 5,
      "publication_date": 20170131
    },
    {
      "title": "Amazing!",
      "text": "Love this lens. The images are nice and crisp and the build quality is exceptional. It's my lens of choice for when I need a good all-around zoom. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "bargain shopper",
      "helpful_votes": 4,
      "publication_date": 20140618
    },
    {
      "title": "Canon EF 24-70mm F/2.8 L II USM",
      "text": "The lens is very solid. Good material and built nicely. Comes with Lens Hood and Bag. I don't keep the lens in the bag, but it is nice to have. It is very sharp and the f/2.8 is exactly what I wanted for low light. I took some casual pictures around the house and they all turned out beautifully. The price is a bit high for this lens especially without IS. But the quality is worth it. I had been debating for weeks about buying this lens and the price was the only debate.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Sellars",
      "helpful_votes": 2,
      "publication_date": 20130529
    },
    {
      "title": "Bar none the SHARPEST wide to mid range canon zoom ever made",
      "text": "I have used many different L lenses over the years. And this new 24-70L is for the first time a lens I am absolutely satisfied with. The image quality, sharpness, details, lens flare control. TOP NOTCH. If you do not have to worry about extreme low light shooting, at 24,35,50mm this lens is JUST AS SHARP IF NOT SHARPER than its L prime counterpart. It is expensive. But I have never been more satisfied with an L lens. This is what expensive glass is made to do. It passes every single metric I have for a quality photo. Bravo canon, bravo",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 4,
      "publication_date": 20131017
    },
    {
      "title": "Amazing lens. Version 2 is so much better!",
      "text": "Amazing lens. Great step up from version 1. Totally worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "lastingmemories.byellen",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Great Lens, Zero Complaints",
      "text": "I have had no issues with this lens, and highly recommend it to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane Tkatch",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Worth every penny!",
      "text": "A must have in any photographer’s bag. Excited to use it for my weddings this year!",
      "rating": 5.0,
      "verified": true,
      "author": "brownswimmer",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Five Stars",
      "text": "This is my favorite lens in my pack. Focus is sharp and quick. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Allen",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Awesome all round lens",
      "text": "Awesome all round lens. Pictures are stunning when used with a full frame. DIdnt have the same luck using it on a crop sensor camera body.",
      "rating": 5.0,
      "verified": true,
      "author": "avidonlineshopper",
      "helpful_votes": 2,
      "publication_date": 20150709
    },
    {
      "title": "Much better sharpness and clarity",
      "text": "Much more crisp the the 1st version of this lens. Not nearly as impressive visually as the old version with the huge canon looking lens hood. Much better sharpness and clarity. I ead a Ken Rockwell review which convinced me to upgrade. It's on par with the 70-200mm f/2.8L ll",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Five Stars",
      "text": "I love this as much as I do the 70-200mm f/2.8L. They are my go to lenses.",
      "rating": 5.0,
      "verified": true,
      "author": "Tonya M Brill",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "high recommended!",
      "text": "Wow! great lens, added to my L series line up. (16-35 2.8 and 70-200 2.8). Solid build, never missed focus. love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon G",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "This is by far the best lens I have ever owned",
      "text": "I have 3 other L lenses: 100-400 IS II, 16-35 f/2.8L, 100mm f/2.8L Macro. This is by far the best lens I have ever owned. The legends are true. It is worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Karl H Schmitz II",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "A perfect portrait",
      "text": "The picture is sharp and crisp. A perfect portrait lens",
      "rating": 5.0,
      "verified": true,
      "author": "William Reed",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "Fantastic Lens For All Styles Of Shots",
      "text": "I have been using this lens for the last couple weeks in varying situations on my 5D Mk III - still, action, wide-angle, zoom, etc. The lens is crystal clear and has been my go to for all shots not requiring.....a bit more zoom (200mm+). You cannot go wrong with this lens, whether it be the first version or 2nd, everyone should carry this in their bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas M Outzen",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Expensive. Exceptional.",
      "text": "Amazing lens. Astounding price. My most used lens. It took a lot for me to drop 2 G's on a lens with no IS. But I do love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pratt",
      "helpful_votes": 2,
      "publication_date": 20150625
    },
    {
      "title": "Very Very Happy!!!!!!!!",
      "text": "I was very confused whether to spend $2000 {i had a 7D with kit lens} but was having confidence on amazon that they will take it back within 30days on no question return policy if i didnt like it. I liked it very very much and will never regret buying it.... Also thought about IS...well we dont need IS and am pretty sure now... Try it...there is no competition...this one is THE THE BEST....",
      "rating": 5.0,
      "verified": true,
      "author": "Maru",
      "helpful_votes": 0,
      "publication_date": 20130521
    },
    {
      "title": "Five Stars",
      "text": "Awesome!. Bought for photography business -works great with cannon Mark 5Diii JaneB",
      "rating": 5.0,
      "verified": true,
      "author": "KSchmidt",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Best Lens I Own",
      "text": "Pricey but flexible making stunning photos! Great glass, great technique, great subject matter equals memorable photos (I'm still working on the technique!) A must have lens for those investing in L lenses! I cannot compare with equivalent prime lenses but I'd suspect one would be hard pressed to see differences! There is convenience, quality and flexibility in this lens that can handle low light situations like a champ. I've not noticed any issues with its lack of image stabilization which I have on other L glass lenses. The short focal length and relative light weight may be the reason. I do not typically use this lens on a tri or mono pod save in studio situations.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin L. Keith",
      "helpful_votes": 2,
      "publication_date": 20130522
    },
    {
      "title": "This lens is simply amazing. f2",
      "text": "This lens is simply amazing. f2.8 is scary fast. If you shoot under less than normal conditions and need quality, this lens is it.",
      "rating": 5.0,
      "verified": true,
      "author": "sfopsgt",
      "helpful_votes": 3,
      "publication_date": 20140714
    },
    {
      "title": "Recommended",
      "text": "Fantastic. Usual high quality lens from Canon. I just wish it had IS and a lower price",
      "rating": 5.0,
      "verified": true,
      "author": "Sparky",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Outstanding product",
      "text": "Canon EF 23/70mm is a very nice and photos are outstanding. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Necessity",
      "text": "My go to lens when shooting a wedding or family portraits! Couldn't live without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa R.",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Sharp and very good. Much better than the old version.",
      "text": "I replaced an old 24-70 2.8 with this and man is this a much nicer lens. So much sharper and easier to handle. Highly recommend the upgrade.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Morgan",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Excellent Lens",
      "text": "One one Canon's best Mark II lenses. Fast, outstanding build quality, excellent lens",
      "rating": 5.0,
      "verified": true,
      "author": "Jarvis",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Fantastic! Worth every penny if you want a sharp ...",
      "text": "Fantastic! Worth every penny if you want a sharp well constructed lens",
      "rating": 5.0,
      "verified": true,
      "author": "Owen1484",
      "helpful_votes": 0,
      "publication_date": 20151215
    },
    {
      "title": "New improved go-to standard lens.",
      "text": "Lighter smaller sharper. Leaps small photos in a single bound. Expensive but if its yr go-to lens then its clearly worth every single penny. Much lighter. You won't want to take it off.",
      "rating": 5.0,
      "verified": true,
      "author": "Canonista",
      "helpful_votes": 0,
      "publication_date": 20131018
    },
    {
      "title": "Canon's most amazing zoom yet!",
      "text": "This lens had a lot of hype when I finally purchased it... and I have to say it lived up to every bit! This lens is insanely sharp and quick. The size is just right. I love the locking hood and I also love that I can lock it so it won't zoom when I'm putting it away or just need to keep it from zooming for other reasons. Wonderful Canon L quality as I've come to know and love and this is my go to lens for martial arts action photos at the dojo now. I also shoot weddings and plan to give this lens a whirl on my next wedding.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat Gurinsky",
      "helpful_votes": 3,
      "publication_date": 20130423
    },
    {
      "title": "Love it!",
      "text": "It's my go to lens when I'm shooting 35 mm. Sharp, versatile and gives an air of professionalism. Great contrast and color. You won't leave home without it!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Lott",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Simply amazing.",
      "text": "If your are thinking about buying it you dont need this review. You know what you are getting. Simply amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "KTR",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "Lightweight and the sharpest lens I own",
      "text": "Second copy was a charm. Some of the images from the Canon 5D Mark III are so sharp at f/2.8, you simply can't believe your eyes. The lens is wonderfully light weight (without feeling cheap) and incredibly ergonomic to use. Focus is as fast as the Canon 70-200mm f/2.8.",
      "rating": 5.0,
      "verified": true,
      "author": "Silver",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "Excellent lens.",
      "text": "I had the prior version before getting this one. This is very good in terms of sharpness and focusing speed. Lighter than prior version but as well constructed. I like the smaller hood - much easier to carry than the prior version. I found the zoom a bit on the stiff side but hopefully it will improve with usage. 1 star off for the significant increase in price over the prior version!",
      "rating": 4.0,
      "verified": true,
      "author": "Heart Doc",
      "helpful_votes": 7,
      "publication_date": 20130902
    },
    {
      "title": "Expensive, but worth it.",
      "text": "Super expensive, but the quality is amazing. It is the lens I use the most due it wide range. The bokeh is superb and I can shoot with the sun directly in the view and I have no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "FANTASTIC new lens!",
      "text": "This is a fantastic replacement to the 24-70 v1. Crisp and lovely, this lens is a workhorse which rocks at 24 and 70mm and everything in between.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn",
      "helpful_votes": 0,
      "publication_date": 20131203
    },
    {
      "title": "Worth every penny",
      "text": "If you are looking for the best f/2.8 zoom lens money can buy, this is it. Color, contrast, and sharpness are all out of this world.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary H",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Love",
      "text": "Favorite lens I own. Thuis guy does it all (almost) and is my go to lens. It almost never leaves my camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20150925
    },
    {
      "title": "Awesome clarity, and my main lens for landscape and ...",
      "text": "Awesome clarity, and my main lens for landscape and macro. The clarity to the edges and at a high f/stop number makes this lens the perfect prime substitute for the high resolution Canon 5D SR.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Roos",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Five Stars",
      "text": "Best lens I own - crisp clear images- never fails to focus- a bit heavy",
      "rating": 5.0,
      "verified": true,
      "author": "Magdalena Photography",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Much better than version 1",
      "text": "If you are a Canon shooter, you know the problems with slow focusing. This lens seems to be much faster in isolating the subject for a quick shot. Images are tack sharp and the colors are beautiful. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "HZ",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "Sharp and clear",
      "text": "I used a Canon 24-70 v1 lens for the last 15 years, and this v2 model is far superior. Where I noticed it first was in the out-of-focus regions. There was much less \"nervousness\" in the bokeh. It's not as smooth/buttery as a prime lens but far better than the bokeh of its predecessor. At f8 & f11 I get tack sharp results across the image plane (as expected for the price). If you want only one lens, and can afford it, this is the lens to have.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Brown",
      "helpful_votes": 2,
      "publication_date": 20130615
    },
    {
      "title": "Five Stars",
      "text": "Wow! Wish I'd gotten this when I got the camera. What a difference.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacque",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "Sharpest Lens I Own",
      "text": "The sharpest lens I own now. Much better then my canon 70-200 2.8 IS, 100L Macro, and24-105 4.0. Bought from KEH Camera as used and this bad boy looks brand new. Shoots like a dream, focuses faster then you can imagine and just took my photography to the next level. If you are serious about photography, this is a MUST HAVE lens in your arsenal. It is versatile and can be used in so many different situations. If you love to change lenses nonstop, then go after those sharp prime lenses - but if you need a wide range, then pairing this with the 70-200 is an ideal situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg P.",
      "helpful_votes": 2,
      "publication_date": 20160506
    },
    {
      "title": "Purely Professional Lens",
      "text": "As a professional photographer, there are two must have lenses: This one and the 70-200. Wouldn't be able to do my job without.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130522
    },
    {
      "title": "Nice lens, definitely meets expectations",
      "text": "Super sharp, not too heavy. Only thing missing is IS and anyone who buys this goes in with eyes open, so there's really not much to complain about.",
      "rating": 5.0,
      "verified": true,
      "author": "RAS",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "I used to love my 70-200mm f/4 but for portraits and child photography",
      "text": "I always wanted this lens. I have waited for quite a long time to own this.. It's very sharp and hardly noise first thing I noticed using it on night time...I used to love my 70-200mm f/4 but for portraits and child photography...having this lens is my to go lens. it's been on my camera since I got it... I am in love!!",
      "rating": 5.0,
      "verified": true,
      "author": "William Deere",
      "helpful_votes": 5,
      "publication_date": 20170405
    },
    {
      "title": "Great professional linse",
      "text": "Its really a great linse. My pictures went from ok to professionel;)",
      "rating": 5.0,
      "verified": true,
      "author": "mille sjøgren",
      "helpful_votes": 0,
      "publication_date": 20180314
    },
    {
      "title": "Five Stars!!!",
      "text": "Very sharp and fast. The best standard zoom lens for my Canon 5D Mark IV.",
      "rating": 5.0,
      "verified": true,
      "author": "Rommel C.",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Love it.",
      "text": "I cannot sing enough praise for this lens. I'm so happy i took the plunge with the L-series",
      "rating": 5.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "and I love it.",
      "text": "This is my walk around lense, and I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Motownrick",
      "helpful_votes": 0,
      "publication_date": 20150111
    },
    {
      "title": "My new favourite walk-around lens",
      "text": "I have a very good copy of the 24-105. I used to think that's one of the sharpest and finest lenses available (it definitely is, make no mistake). After I received the 24-70 and tested it for over 10 days, I've got to admit I was totally amazed by its performance. This new toy of mine is tack sharp! The IQ it produces is awesome. The bokeh is very nice. I'm using it with a 5D Mark III and this combo is marvellous. I still cherish very much my 24-105, but the 24-70 has become my new favourite, especially in low light situations.",
      "rating": 5.0,
      "verified": true,
      "author": "David Miko",
      "helpful_votes": 3,
      "publication_date": 20131008
    },
    {
      "title": "Love it!",
      "text": "Very sharp! The only con of this lens that I have found since owning it is that it's a bit on the heavy side. You can't go wrong with it!",
      "rating": 5.0,
      "verified": true,
      "author": "JenH",
      "helpful_votes": 0,
      "publication_date": 20150409
    },
    {
      "title": "An icon",
      "text": "This is an iconic lens, there are lots of reviews out there. Be careful with buying a filter as they don't all fit and can scratch the lens, which bulges out in front. I bought a B+W thin clear protective filter but am scared to put it on because it looks like contact will occur.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan J. Churchill",
      "helpful_votes": 5,
      "publication_date": 20140819
    },
    {
      "title": "Qulity pictures.",
      "text": "It takes absolutely quality pictures. See \"DP review .com\" site for MTF graphs. Use the lens accordingly to the MTF graph . Without that you can find some spots that is not like a prime lens. But other wise as sharp as a good prime lens. Update: at 70mm at the edges not as sharp as on the 24mm and 35 mm range. Noticeable difference. Maybe a bad copy?",
      "rating": 4.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 2,
      "publication_date": 20140226
    },
    {
      "title": "Are you sure this is not a Leica lens?",
      "text": "Astonishing clarity, focus, brilliance and maybe, maybe, better than their 16-35mm, f2.8, L series lens! Amazon demands five more words and any additional superlatives would be superfluous, don't you think... C'mon, Amazon...",
      "rating": 5.0,
      "verified": true,
      "author": "John Kosboth",
      "helpful_votes": 0,
      "publication_date": 20130426
    },
    {
      "title": "not recommended if you don't intend to step up to FF ...",
      "text": "Versatility and sharpness is spot on. Use it as my general all purpose lens on full frame camera. not recommended if you don't intend to step up to FF at some point. for crop sensor based bodies, there are better options available.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 4,
      "publication_date": 20160318
    },
    {
      "title": "Great lens",
      "text": "Very sharp, and that's exactly what I was looking for. I really do not miss the IS on this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Smith",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Great lens. Extremely sharp works very well on my ...",
      "text": "Great lens. Extremely sharp works very well on my Canon 7D Mark II camera!",
      "rating": 5.0,
      "verified": true,
      "author": "David J. Gershon",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Great purchase!",
      "text": "Bought a camera lens from this seller. It was described as \"Like New, in mint condition\", and I have not been disappointed. Works perfectly. Would definitely buy from this seller again. Great service and shipped super quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Trish",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "First lens you should have",
      "text": "I have not removed this from my camera since I got it. This is the lens to have. Then you can think about the rest. Yes it is pricey however if you are going to do serious photography this should be the lens to get. Followed by the 70-200mm.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos Mencia",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "If you own this lens then you understand.",
      "text": "This lens should be in the bag of every single working photographer. I only use L series lenses and I must say that this is my second sharpest zoom next to my 70-200 f2.8 is. By all means if you have the cash to spend then buy this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Castellucci",
      "helpful_votes": 3,
      "publication_date": 20140423
    },
    {
      "title": "The lens is as good as described",
      "text": "The lens is as good as described. I have used every available lens for a Canon DSLR camera body and this lens is tied with only one other lens for being the sharpest lens available in my experience. But that other lens is only available for crop sensor camera bodies. I know the price is high but if you want to produce the best images, this lens will help you make them. If you are fine with less, there are certainly other nice options out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Best lens ever.",
      "text": "I'm still working with this lens, but the build quality and advancements over the 'mark 1' version of this lens (that I also had in the past) has so far been worth every penny. I especially love the 'lock' switch that prevents the lens from 'falling' out when walking (huge problem with the mark 1).",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey G. Fanelli",
      "helpful_votes": 0,
      "publication_date": 20130119
    },
    {
      "title": "wonderful",
      "text": "very versatile lens, very bright and thoroughly recommended as, I love it, y you want only one, 24-70 is the lens",
      "rating": 5.0,
      "verified": true,
      "author": "eloisamazon",
      "helpful_votes": 0,
      "publication_date": 20130330
    },
    {
      "title": "Just perfect",
      "text": "The best lens i've every bought, really sharp, almost no distortion and almost no color aberration, along with my 70-200 2.8L is my work horse for weddings.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan Carlos Saltos",
      "helpful_votes": 0,
      "publication_date": 20130815
    },
    {
      "title": "love this lens",
      "text": "the best investment i have ever done, works great really fast with my 5D mark iii, best lens ever and the fastest, = to my 70-200mm 2.8 II",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammad Alwazzan",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Awesome lens",
      "text": "Its the best there is for day to day photography. If you are not going to buy a prime lens and want to buy ONE lens. This is it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sai Karthik Madabhushi",
      "helpful_votes": 0,
      "publication_date": 20130814
    }
  ],
  "product_meta": {
    "title": "Canon EF 24-70mm f/2.8L II USM Standard Zoom Lens",
    "description": "Style:Lens OnlyMeeting the ever-increasing demands on image quality that digital photography brings, the redesigned EF 24-70mm f/2.8L II USM is the latest update to the acclaimed L-Series of EF optics, re-establishing a new standard for superb optics, high-end durable construction and performance in professional zoom lenses. A standard focal length zoom lens, it features a large aperture throughout its focal length. Filter size: 82 mm, Closest Focusing Distance: 1.25 feet. Maximum magnification (x) - 0.21(at 70mm).",
    "rating": 4.8,
    "feature_bullets": [
      "24 70 millimetre focal length, 38.4 112 millimetre equivalent focal length on Canon APS C cameras",
      "F2.8 constant maximum aperture; F22 minimum, Ring type ultrasonic type AF motor with full time manual focusing",
      "Purchase this product between May 1, 2016 and July 30, 2016 and get 13 months of free damage protection from Canon. The product must be registered within 30 days of the purchase date to be eligible",
      "82 millimetre filters, closest focusing distance: 0.38 meter/1.25 feet",
      "Image Stabilization : No. Focus Adjustment Inner focusing with USM. Diagonal Angle of View 84° 34°. Weight 1.7 pound"
    ],
    "specifications": {
      "Product Dimensions": "4.45 x 3.5 x 3.5 inches",
      "Item Weight": "1.77 pounds",
      "ASIN": "B0076BNK30",
      "Item model number": "5175B002",
      "Customer Reviews": "4.8 out of 5 stars500 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#45 in SLR Camera Lenses",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 6, 2012",
      "Manufacturer": "Canon"
    },
    "categories": [
      "SLR Camera Lenses",
      "Electronics",
      "Lenses",
      "Camera & Photo",
      "Camera Lenses"
    ],
    "price": 1699.0
  }
}