{
  "website_summaries": [
    {
      "verdict": "These top-rated shoes got that way largely due to their durability and comfort, although some may find the fit a bit too narrow.",
      "pros": [
        "Lightweight and durable, these shoes get high marks in terms of comfort",
        "They are a particularly good fit for those with narrow feet"
      ],
      "cons": [
        "Some may find that the shoes are too tight, while the high arches within may put off others"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I have severe plantar fasciitis in one foot. These ...",
      "text": "I have severe plantar fasciitis in one foot. These shoes are the only ones (and Ive tried them ALL) that relieve the pain. Granted, it depends on yoir arch shape and your individual physiology, but these shoes are a God send. They're all I buy. They outlast all my other shoes; Asics, Merrell, Nike, Brooks, and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 9,
      "publication_date": 20170524
    },
    {
      "title": "Great Shoes",
      "text": "Great shoes. I have worn Nike Shox for years since they have good arch support. I have owned some original Reebok Zigs for years and they have always been comfortable and very light. The arch support on these is a lot better than the ones I purchased a couple years back and I like them so much I just bought 2 more pair. Even better than the new Nike Shox. If you have high arches and want shoes with good support that are light and breathable these are very hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "JDS II",
      "helpful_votes": 7,
      "publication_date": 20171011
    },
    {
      "title": "Reebok has done it again with these new Zigwild TR ...",
      "text": "Reebok has done it again with these new Zigwild TR 2 running shoes. This shoes fit as expected maybe run a little narrow. Not only are these shoes stylish as I have received numerous comments on them while wearing them, but they are comfy to wear as well. Only downside to me is the price but what do you expect from a big corporate shoe company. Overall 5 Stars",
      "rating": 5.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 6,
      "publication_date": 20161002
    },
    {
      "title": "Sharp looking shoes that wont hurt your feet!",
      "text": "I love these shoes! I get compliments on them weekly based on their appearance. They are also comfortable and seem to be holding up well to daily wear and tear. I wear these shoes primarily to work where I stand on hard floors for long periods of time. My feet never hurt after a day of work or a long hike. They clean off surprisingly well. Mud wipes off no problem. Occasionally rocks or pieces of bark-dust get stuck in the bottom of the shoe but this is a negligible problem for me.",
      "rating": 5.0,
      "verified": true,
      "author": "PyroSwardsman",
      "helpful_votes": 5,
      "publication_date": 20170712
    },
    {
      "title": "Inflamed my Feet until Washed",
      "text": "After I started running in these shoes, my feet became itchy and inflamed. I couldn't figure out what was causing this. Then I remembered that they could have been treated with Formaldehyde. Once before I bought a wearable product that I wore before washing and I had the same exact problem, Formaldehyde. After I put these shoes in the washing machine the itching and inflamation cleared up. If Reebok uses Formaldehyde to hold them in shape, I strongly suggest they switch to spray starch or something else to perform this function. Other than having this surprising experience, the shoes work perfectly well as a running shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "-tg",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "I buy Reeboks because my feet are pretty narrow, and I like the arch support",
      "text": "I buy Reeboks because my feet are pretty narrow, and I like the arch support. However, I had no idea that there is an entire sub-culture devoted to high-end Reeboks. I thought that shoe cults were limited to Air Jordans and checkered Vans, but I've come to find that ZigTech Reeboks hold the same status. I was walking a casino on Southern Oregon (please don't ask me what I was doing in Southern Oregon) and no less than three guys gave me that knowing nod as if to say \"I see you, I see your shoes, you're one of us.\" It was affirming, a little creepy, and made be feel like one of the cool kids in junior high.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Ricker",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Great shoes, exactly what I've been looking for",
      "text": "Great shoes, exactly what I've been looking for. On my feet all day long on concrete floors, get home and my feet and legs just hurt. With these that's all gone. I've had great luck with Reeboks and these are the best of the best. The shoes seem to mitigate the impact not just on your foot as a whole but separates and lessens that impact on the heel \"and\" the front of the foot. I will be buying these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney",
      "helpful_votes": 5,
      "publication_date": 20170107
    },
    {
      "title": "Most comfortable shoe for 260 lb man",
      "text": "I think my feet were designed to carry 150 lbs but I make them carry 260 so they often complain. I bought these to run in so they really take a beating. I now have bought several pairs, 1 for the gym and running the street, 1 for the yard and the other for when I am casual in Jeans. They won't win a beauty contest but if you want to be on your feet, run or walk through disneyland all day, you will be thankful for the comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Would be great shoe, great cushion sole looks good made good ...",
      "text": "Would be great shoe, great cushion sole looks good made good for regular width feet. Folks with 2E fat feet don't even bother because the shoe is so sharp you will try to make them fit and get stuck with a small shoe. FOR DUCK FEET BUY Reebok Men's ZIGEVOLUTION 2E Running Shoes - YOU'LL LOVE THEM! THE RIDE IS GREAT! 30 MILES A WEEK. WILL BUY THEM AGAIN.",
      "rating": 2.0,
      "verified": true,
      "author": "Ralphy",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Best Reebock trail runner",
      "text": "Have been wearing and re-ordering this same model for several years, mainly for excellent traction and shock absorption on all types of surfaces. Added a premium high-arch insole for additional shock absorption and comfort. The only down side for me is fast wear at the heel from running on the street. Reebock, more carbon-fiber reinforcement would reduce premature wear at the heel and would be appreciated, if you are listening.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Clunky and uncomfortable",
      "text": "These shoes are well constructed. However, I found them to not breathe well and therefore are very hot to wear. Additionally, I found them to be very clunky. They also have a heel part that sticks out the back which for me continuously gets caught on things like stair rises while going down stairs. I consider this to be dangerous. I love other Reebok shoes like the Nano line. I don't like these.",
      "rating": 1.0,
      "verified": true,
      "author": "glenno",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Husbands favorite shoes and we have ordered many over the years",
      "text": "Husbands favorite shoes and we have ordered many over the years. He works for 8 hours a day on his week 5 days a week. He is not sore when he comes home and no more tired than he should be after being on his feet for that long.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Great shoes!",
      "text": "Great comfy light shoes but I live in Seattle and we have lots of rain + leaves and I find myself slipping all over the place! Any recommendations for something with more traction on wet surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "frantz",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Holly cow these things are about the best dang pair of sneakers I've EVER worn",
      "text": "Holly cow these things are about the best dang pair of sneakers I've EVER worn! Super comfortable with a medium width heel and arc, hit my arch perfectly, and the toe box feels so flexible it even feels like its a bit wider. Cadillac of sneakers! I have to buy a second pair diff color.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr.",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Super comfy!",
      "text": "Love these shoes. I was disappointed with the durability of my last pair of Asics. I had enjoyed a previous pair of Reebok Zigs, so I decided to give them another shot. Loving these so far - they seem to be more durable on the tread than the Asics; time will tell!",
      "rating": 5.0,
      "verified": true,
      "author": "jman251",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "I think these are the most comfortable shoes I have ever worn",
      "text": "I use these to referee club soccer matches. I think these are the most comfortable shoes I have ever worn. I referee anywhere from 3 to 5 matches a day on the weekends and my feet used to ache at the end of the day. Now I feel much better at the end of the day! What a difference. They also offer great traction and cushioning. I hope that they hold up as good as they feel.",
      "rating": 5.0,
      "verified": true,
      "author": "REG",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Soooooo comfortable",
      "text": "I bartend and these stay comfortable after 8 hours on cement floors. They're not slip resistant but you can still move around with some confidence. Just pay attention to where you're walking and you won't fall",
      "rating": 5.0,
      "verified": true,
      "author": "Dimartini",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "these Reeboks are by far the most comfortable shoes that I believe that I have ever had",
      "text": "I have had many different brands of tennis shoes over the years, Nike, Reebok, Under Armor, etc., but, these Reeboks are by far the most comfortable shoes that I believe that I have ever had. They fit perfect right out of the box based on the size that I normally wear. They look awesome and the shipping was very fast. I will definitely get this style again, when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Nothing better for active Big & Tall men",
      "text": "my 2nd pair of this exact pair of shoes. I asked Reebok Customer support, and they indicated these will go back into production. Hope that is true and this is the best pairs of tennis shoes I have owned for all around everything. exercise, work, play, just top notch support and quality for my frame. (6'4\" 316lbs)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160208
    },
    {
      "title": "Great shoe. Good for my knees/feet. Kinda skinny and not much sidewall support.",
      "text": "All around this is a great shoe. They make every surface I walk on feel soft. They are great for impact reduction. I do have one complaint and it's been the same for all zigtech shoes is they aren't good at changing directions, the foot tends to slide off the sole onto the side of the shoe. So I would suggest these for sports like basketball or walking on hillsides. These are also relatively skinny shoes so if you have a wide foot these probably aren't for you.",
      "rating": 5.0,
      "verified": true,
      "author": "TON O'CLAY",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "i have loved these shoes since i found them in 2009 or ...",
      "text": "tiny bit too big but still amazeballs! i have loved these shoes since i found them in 2009 or 2010! still 8 years later the original ones i had finally just ripped apart.",
      "rating": 5.0,
      "verified": true,
      "author": "bored so its fun",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Great support and long lasting",
      "text": "I have had heel spurs in the past, which no longer cause me pain because of regular stretching of the tendons, however, I like a running shoe that has lots of support for the soles of my feet. I have been very pleased with the upper end Reebok running shoes like this one. This is the third pair that I have owned, and I have found them to provide very good support for my feet and to last longer than any other running shoe that I have owned.",
      "rating": 5.0,
      "verified": true,
      "author": "MorrissH77840",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "This is a very good shoe. Very comfortable and is holding up well ...",
      "text": "This is a very good shoe. Very comfortable and is holding up well under my larger-than-usual size. I really like that Reebok added some little spikes between the zigs on the bottom. This keeps small rocks from being wedged in-between and following me into the house. I also like that they are non-symmetrical. I have no idea why, but it makes them a little different from everyone else's shoe. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Fantastic shoes!",
      "text": "Fantastic shoes!! Fit like a glove and arch support is unmatched. My last pair of ZigTechs lasted 10 years. Gives me a bounce in my step, energy return per stride is great. Solid base and breathable top. Hope they last as long as my previous pair. Reebok continues to deliver with the ZigTech line of shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Zych",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "Nice Shoes but not for everyday running",
      "text": "I used them for long walks and they are fine, also to play drums, But not for an everyday runner",
      "rating": 5.0,
      "verified": true,
      "author": "Baker",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Secon pair",
      "text": "Perfect fit and very comfortable. Its kind difficult to find a shoe that holds a 270 lb guy. These do just fine. I am a nurse so always on my feet. Can't complain and looks very good. Highly recommended if you are heavy or on your feet for long periods.",
      "rating": 5.0,
      "verified": true,
      "author": "Godwin",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Great shoe/service. Read on.",
      "text": "Loved the shoe. Light with a soft but stable sole. I need these for my knees. Unfortunately I hopefully received a defective pair because the sole came loose within a week. No problem returning them at all through amazon. Repurchased in person at a reebok store.",
      "rating": 4.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Comfortable but peeling",
      "text": "The most comfortable shoes I ever worn. Mind you I sit most of the day as an engineer, but the rubber in between are peeling off already. Would not be surprised after 2 years it falls apart completely.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy T Hall",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "As well as a very comfortable shoe to wear walking around in",
      "text": "This particular shoe can really take a beating running on various type of terrain around the world; snow, ice, rock, hills, mud, and etc. As well as a very comfortable shoe to wear walking around in. I like running in these so much that this is my second pair and I now use the first pair for normal very day use. Oh and they wash easily, simply take out the insert and toss them in with your load of laundry, air dry, and they come out looking like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "Comfortable!",
      "text": "This is about my 5th pair of Reebok Zigs (many different incarnations through the years) and I still do not care for the looks. However, they are still the most comfortable shoes for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Geezer Squid",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Great shoe!",
      "text": "Best running shoe I’ve ever owned. I’m on my 3rd pair. Durable, comfortable and nice looking.",
      "rating": 5.0,
      "verified": true,
      "author": "craig h. sjoerdsma",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Toe box is too narrow.",
      "text": "Quality materials, but too narrow around the little toe. They also feel heavy and the soles are full of cavities which likely can quickly get filled with stones and dirt making them substantially heavier. I'm sending mine back.",
      "rating": 2.0,
      "verified": true,
      "author": "THMAS",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Super shoe for knee and ankle pains from standing and walking",
      "text": "Runs about a half size small. Wonderful shoe. Very comfy. Has really helped with relief to bad knees.",
      "rating": 5.0,
      "verified": true,
      "author": "tm",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "propels you forward",
      "text": "Once your feet get adjusted to the different feel of wearing this design I honestly think they improve you agility. My feet did hurt for the first few days of wearing them and I did have reeboks before them also.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Chase",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Completely Pleased!",
      "text": "These may be the most comfortable running shoes I have purchased to date. The sole looks cool as hell to boot! I am extremely pleased with this purchase, and would buy them again in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "P. Revier",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Heavy for running",
      "text": "They are bulky and Too heavy. I can't imagine running more than a mile with this pair of Tanks",
      "rating": 3.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Lovely design and pretty aesthetics",
      "text": "Best running shoes ever. I just love em. It fits snugly and is very comfortable. Good balance and bounce. Very pretty aesthetics so it can be worn almost anywhere. I will buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Perfect fit, perfect style!",
      "text": "Super cool shoes! Comfortable, light weight, cushioned perfectly and awesome style! I have the women's version and got my husband these black ones. He's super obsessed. Less is more with Reebok, i love their simple taste in shoes!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Five Stars",
      "text": "Great shoe. Very comfortable and fit exactly the way you would expect. I would definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Floyd",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Well worth the investment",
      "text": "All Zigs run small compared to standard US sizes of competitors brands such as Nike and New Balance. This is likely due to the 'narrowness' of the shoe, as they are not available in wide widths. For other brands, i typically were 10.5 or 11 wide... of Zigs, i go to a straight 11.5 and it fits fine. High quality product",
      "rating": 5.0,
      "verified": true,
      "author": "Larry K",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Great shoes!",
      "text": "I bought them for my son. He wears them all day, everyday and even wears them to work out at the gym. They hold up really well. The last pair lasted over a year.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Dieu",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Better than Nike",
      "text": "I always loved the zig zag style of reebok. I think they are the best running shoe I ever bought. I always get my best run times wearing them on a run.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin F. Mitchell Jr.",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "My spouse LOVES these shoes.",
      "text": "These are my spouse's favorite shoes. They've lasted a year of almost daily wear (and are still wearable) and have really held up well. They're lightweight and feel really great, so I'll keep buying them as long as I can!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "Great shoe",
      "text": "Fit great an feels great. Love the tread pattern and for running some back roads is great traction in grass and gravel. Only thing that would make these better would be a mid top shoe for a little more ankle support.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Fowler",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "I am a big fan of zigs, especially since ...",
      "text": "I am a big fan of zigs, especially since I started working long hours on reinforced concrete floors. Most mornings I would wake up to incredibly sore legs and knees that would pop at every twist and turn, until I started wearing zigs.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20160619
    },
    {
      "title": "... pairs of these and they are by far the best shoes for work",
      "text": "I own a few pairs of these and they are by far the best shoes for work, training, and quality hands down. I own 20 pairs of zags only bc they are the most comfortable shoes in the shoe game. They are made with quality. I will buy another 2 pairs asap. If you do not get theses and pay 200 plus dollars on cheap nikes then your going to feel nothing but pain in your feet. It's not the cost. It's the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Andre Elektro Morales",
      "helpful_votes": 9,
      "publication_date": 20160622
    },
    {
      "title": "A really good sneaker. The overall fit is actaully good but ...",
      "text": "A really good sneaker. The overall fit is actaully good but my feet are on the wide side. It would have been nice if a slightly wider size were available.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "By far the most comfortable sneakers I have worn",
      "text": "By far the most comfortable sneakers I have worn. I work 13 hour days and never even feel achy. This is my second pair and love them to death. Will bemail buying more in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Orange",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Most comfortable pair of shoes I've ever worn.",
      "text": "I've owned several pairs of these and have no complaints. I work 13 hour shifts and these get me through.",
      "rating": 5.0,
      "verified": true,
      "author": "Abe",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Four Stars",
      "text": "The shoes are good, but they lack support around the toes.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos C. Moreno",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Better than average shoe with decent support",
      "text": "Good shoes. I bought these as I got some zigtech Reebok a few years ago and love them. These are almost as good. Just a little wider and arch support isn't quite as good. One key to these is to throw away the old laces and use lock laces.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "14 days in",
      "text": "I haven't wore them much. For the times I have they were comfortable. My wife has a much smaller foot, put them on, and fell in love with them..",
      "rating": 4.0,
      "verified": true,
      "author": "Scotty George",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Perfect fit for the flat foot",
      "text": "I bought this for my 14 year old son, he has flat feet. He had already been wearing the same exact shoe we just needed a size up without the hassle of shopping.",
      "rating": 5.0,
      "verified": true,
      "author": "chillaxin",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Good trail shoes and comfortable",
      "text": "Good trail shoes and comfortable. They are a bit narrow for my feet but not painful. They are shock absorbent but not the most shock absorbent I've owned. Can't tell you how robust they are yet, only time will tell.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Not durable rubber but love how the shoes fits",
      "text": "Love the shoe but the rubber sign of the Reebok peeled off within the first month.",
      "rating": 1.0,
      "verified": true,
      "author": "KCo",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "I like this design",
      "text": "Love ZigTech design, even my last one was same, though in red :) The comfort it provides is something I have not seen in any other style.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunil",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Husband loves these shoes",
      "text": "Bought for husband and he loves them! Says these will be the ones he buys over and over again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Roston",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Good looking. Slippery on wet tile",
      "text": "Light weight. Good looking. Slippery on wet tile. Very comfortable!!",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "It's one of the best to have",
      "text": "Kick ass shoe, must buy blind folded. It's one of the best to have. Hopefully it'll last long. Great material and very, very comfortable!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "odai",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "But they are very comfortable to run in",
      "text": "They fit as expected because i order them a size large, because they didn't have wide available. But they are very comfortable to run in.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Murray",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Five Stars",
      "text": "These are excellent for running and they are also a very nice looking shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher W. Cook",
      "helpful_votes": 0,
      "publication_date": 20180110
    },
    {
      "title": "Went running in them this morning and my feet feel great. These are \"can't loose",
      "text": "Trustworthy zigtech. Went running in them this morning and my feet feel great. These are \"can't loose, shoes\"",
      "rating": 5.0,
      "verified": true,
      "author": "Trever Sherman",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Comfortable",
      "text": "Great shoe, fits as expected and very comfortable. Would buy more if cheaper",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "I need the support of a thick sole for my ...",
      "text": "I need the support of a thick sole for my back. the new micro soles are a killer and the Zig is just the right amount of cushion. Only problem I have is Having bought 3 Zigs before this one the size 9.5 is a bit large.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "These shoes are very comfortable. Lots of",
      "text": "I referee about 100 games a year. These shoes are very comfortable. Lots of cushion",
      "rating": 5.0,
      "verified": true,
      "author": "DAN",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "My favorite sneaker",
      "text": "Bought these after having the same ones for about 2 years. I love them! They are so supportive! Great look and feel to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Ema",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "I wanted all black but seems like they don't have and the size is too big ...",
      "text": "I wanted all black but seems like they don't have and the size is too big but over not bad",
      "rating": 2.0,
      "verified": true,
      "author": " Ryan , ",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Feels good. I highly recommend using Balega blister free socks ...",
      "text": "Feels good. I highly recommend using Balega blister free socks with these for 5K distance or more. Also the climbing grip is OK.",
      "rating": 4.0,
      "verified": true,
      "author": "A-Jay",
      "helpful_votes": 0,
      "publication_date": 20180503
    },
    {
      "title": "Decent shoe",
      "text": "Great build quality. Great support overall. Not super happy with the heal cup fit in the right - side shoe. It's too loose. Left side is fantastic. Overall I will be happy as long as they hold up.",
      "rating": 3.0,
      "verified": true,
      "author": "SWoody",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Reebok has a winner!",
      "text": "Best shoes I've ever purchased! Immediate comfort after putting them on! Truly like walking on cushions! Well worth the money! I'm going to buy a 2nd pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Gannon",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Too narrow and not comfortable, while wearing it",
      "text": "Guys , honestly, don't buy these shoes. Too narrow and not comfortable, while wearing it . You won't feel your feet , cushioned and supportive . Laces are huge turn off.. Instead , would recommend, Brooks trail and running shoes or Reebok Zigtech ..",
      "rating": 1.0,
      "verified": true,
      "author": "AMIT AGNIHOTRI",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Tenny shoes",
      "text": "Great Fit you can literally walk in the shoes all day",
      "rating": 5.0,
      "verified": true,
      "author": "LORENA",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "I love Zigs",
      "text": "I'm sad that Reebok is doing away with the traditional zigs. They have been the best shoes I've owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Fehrle",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Great shoes!!",
      "text": "Great fit. Ordered half size bigger and fits perfectly. Look awesome and hope for long mileage on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Comfortable and athletic",
      "text": "I'm really happy with these shoes (got black) not only are they cushioned well, but they are very comfortable to wear in general.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Lablaiks",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Great shoes! Thay do run a little long i ...",
      "text": "Great shoes! Thay do run a little long i suggest ordering a half size smaller than what you usually wear. But im still satisfied",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "I love these shoes",
      "text": "I love these shoes! I weigh 200 lbs and hike with a 50lbs vest and these shoes still feel awesome and grip the dirt extremely well!",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Great Runnin Shoe",
      "text": "We require a higher arch but the shoe does provide a lot of interior padding which is great for comfort! The back is high enough to insert the arch supports and still keep his heal in the shoe - prevents foot from coming out while walking.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Weisenberger",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "AWESOME SHOES!!!",
      "text": "AWESOME SHOES!!! Fit is soo soo comfortable and very well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Sal",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Best athletic shoe I ever own",
      "text": "Best athletic shoe I ever own. Bought over a yr ago and it's still feels great. It's also incredibly awesome as a walking shoe. Not sure why Rebook keep trying to screw up a good design in an attempt to compete with new designers",
      "rating": 5.0,
      "verified": true,
      "author": "hasan bakane",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Ok shoes.",
      "text": "They are fine but heavier than most of my other running shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "DRZ",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Great shoes!",
      "text": "Very light and comfortable shoes, I bought these because of low back, and sciatic issues. These seem to give enough cushion and support, and are very light shoes!",
      "rating": 4.0,
      "verified": true,
      "author": "Nick S",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "Best shoe ever!!",
      "text": "Love these shoes!! I plan on buying many more pair because reebok no longer makes these shoes!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Blackwelder",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Great feeling and fitting shoe on the right foot",
      "text": "Great feeling and fitting shoe on the right foot. After 2 separate pairs, I gave up on the left foot inner arch. Both pairs had the same defect, Returned",
      "rating": 2.0,
      "verified": true,
      "author": "Jack Peavy",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Au-some purchase for this Tiger's feet. WDE!",
      "text": "These shoes are awesome! Honestly my first pair of Reeboks ever but certainly not my last. I had shin splints before, but I haven't had this issue since buying my Zigs. Not to mention compliments I get on the sleek style. Great shoe very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Riley Mobley",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Good buy, good fit and comfy",
      "text": "Ordered for husband as he wore his other Zig Wild ones out. Good buy, good fit and comfy. He is very happy",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Love these shoes",
      "text": "Most of the time Reebok shoes fit to small if you get the wrong ones. I have done a few custom shoes and it is safe to say for me anyway.. that this is one of the better fitting reebok shoes. Well made actually was impressed with high expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicolas Vankeuren",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Reebok Men's ZigWild TR 2-M Running Shoes",
      "text": "Shoes fit great and have good arch support. If they were lighter in weight the would be perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "R Molaison",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "They fit his feet perfectly and he says they are the most comfortable running shoes he has ever had",
      "text": "Bought these shoes for my husband. He absolutely loves them!!! They fit his feet perfectly and he says they are the most comfortable running shoes he has ever had",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Colton",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Five Stars",
      "text": "I ordered extras of these so that wear out, I have a spare pair. They last forever too.",
      "rating": 5.0,
      "verified": true,
      "author": "aqjones",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Five Stars",
      "text": "Best shoe Reebok ever made. Wish they still made them.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Clark",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Amazing shoe!!",
      "text": "Excellent ankle and heel support. We went on vacation immediately after I purchased them for my husband. We walked 30 miles in 1 week and of all the other shoes he brought these were the only ones that he wore the entire time. We will purchase these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison S.",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "One of the most comfortable pair of shoes I have ever bought",
      "text": "One of the most comfortable pair of shoes I have ever bought. Love them. Will buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie S.",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Fantastic shoe!!!",
      "text": "Great shoe fir perfectly. Long lasting quality and comfortable all the way through.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Fit like my old ones!",
      "text": "Fit is exactly like my old ones! Perfect. I would buy these again!",
      "rating": 5.0,
      "verified": true,
      "author": "HG77",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "They feel like you are walking on air",
      "text": "For the price, these are worth every penny. They feel like you are walking on air. My brother asked me about them and I told him how much I loved these shoes and he bought them too! Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Excellent shoe",
      "text": "This is a excellent show for all day movement. I was given my first pair as a gift and was very pleased and surprised at how good they were",
      "rating": 5.0,
      "verified": true,
      "author": "jeff buffa",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "Great comfort and support",
      "text": "They are very comfortable and provide great support as I am very flat footed",
      "rating": 5.0,
      "verified": true,
      "author": "BobH",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Five Stars",
      "text": "Perfect fit and absolutely the most comfortable shoes on the planet",
      "rating": 5.0,
      "verified": true,
      "author": "Chap1299",
      "helpful_votes": 5,
      "publication_date": 20161006
    },
    {
      "title": "Super comfortable and worth every penny.",
      "text": "Color was decent but other than that... it was Awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "sahil",
      "helpful_votes": 0,
      "publication_date": 20170326
    }
  ],
  "product_meta": {
    "title": "Reebok Men's ZigWild TR 2-M Running Shoes",
    "rating": 4.6,
    "feature_bullets": [
      "100% Mesh",
      "Rubber sole",
      "ZigTech Technology provides responsive cushioning",
      "Forefoot flex grooves add flexibility",
      "SmoothFit seaming",
      "StableFit technology with removable PU sockliner"
    ],
    "categories": [
      "Men",
      "Athletic",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Running",
      "Road Running"
    ],
    "price": "",
    "specifications": {}
  }
}