{
  "website_summaries": [
    {
      "verdict": "One of Shure's first open-back designs, the SRH1840 headphones are comfortable and light, and the sound will surely thrill demanding audiophiles.",
      "pros": [
        "The lightweight design and extra-comfy earpads of the Shure SRH1840 Professional Open Back Headphones ensure high comfort over long listening sessions",
        "These ruggedly built headphones also come with an extra set of detachable cables and replacement earpads"
      ],
      "cons": [
        "These are expensive, stay-at-home or studio headphones"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Value": 7.0
      },
      "publication_date": 20120614,
      "rating": 7.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent Sound, Comfort and Quality",
      "text": "I've owned a number of headphones over the past 50 years. A few I've owned: Koss Pro 4AAA Sennheiser HD 650 and Momentum Beyer T90 and DT 880 AKG 601 The Shures are the best of all. Beautifully detailed sound with a solid low end and a smooth high end. Never fatiguing. I listen to Classical mostly and these headphones render the soundstage, imaging and frequency response ideal for that type of music. I also use them for monitoring when recording. No need to spend more. I also own the Shure 1540 Closed Back and they are equally as good. Excellent quality and performance.",
      "rating": 5.0,
      "verified": true,
      "author": "loves music and books",
      "helpful_votes": 5,
      "publication_date": 20200219
    },
    {
      "title": "Really excellent headphones.",
      "text": "I had bought a pair of these phone on ebay for a huge discount- less than 1/2 price. I spent a lot of time and money trying t get the headphones to perform but never could. I recently bought the full priced Shure SRH1840 headphones on Amazon and what a difference, WOW! The old headphone were identical in construction but they were clearly seconds or knockoffs. The new Shure SRH1840's were exceptional in every way and compared well to any headphones I have under $1500 ( I have many). They are dynamic and sound great with all genre's of music. Comfortable and simply a pleasure to listen to. Expensive, yes but well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas S",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Wasn't Impressed",
      "text": "These headphones are very light on bass and very heavy on treble. Super clear quality but, I think, they give a slanted view of the material. Returned.",
      "rating": 3.0,
      "verified": true,
      "author": "NikNo",
      "helpful_votes": 4,
      "publication_date": 20181208
    },
    {
      "title": "Very very comfortable",
      "text": "I have these headsets paired up with a Focusrite Scarlett 2i4 amplifier, and it sounds amazing. I'm an avid PC gamer, and you'll have no problem hearing your enemies with these. Music sounds absolutely amazing. Not only do they sound good, they are also very comfortable. You can wear them all day every day and never feel discomfort. I've been using these for 3 years now, and they are still holding up flawlessly. Highly recommended and would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Karter",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "👍🏼 They make making music SO much better!",
      "text": "Great sound! Total quality. I don't regret getting these at all. I would buy these again every time if I had the choice. I expect to use them for the rest of my life as my main headphones! These make making music on my computer SO much better. Every composer should have a pair of really nice headphones like these. It makes such a difference!",
      "rating": 5.0,
      "verified": true,
      "author": "Brendon Mezzetti",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "Sweet sound!",
      "text": "This headphone has very sweet sound. Soft and wet. I prefer it over the HD650 for vocal. This headphone can run on anything. You don't need additional amp for it to sound good. Update 5/9/2018 Still using this headphones and the sound is still awsome. I smile every time i put it on. Background, I used to own the hd598 and hd650. I love the hd598 but the sound is not clear. This is better than both Update 7/14/2018 Im using it with the schiit lyr and bifrost dac. The sound is so much better now. Its incredible. Make sure you get a strong amp and a good dac to take full advantage of the headphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 8,
      "publication_date": 20140207
    },
    {
      "title": "Best for classical",
      "text": "I am listening to Haydn 19th Symphony as I write this. The horns have chemistry like magic. Have had these for 5 years and the musical experience is new again every time I use them. Gosh, just wow. They deliver magic all genres. Life is to short without these.",
      "rating": 5.0,
      "verified": true,
      "author": "David Roy",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "They sound fantastic on my Meridian Explorer USB DAC",
      "text": "I was surprised how good they sounded right out of the box. The bass is a little weak, but that is to be expected from an open-back design. After a few weeks I tested them on a Meridian Prime headphone amp and compared them to the Audeze LCD-2 and was shocked at how well they stacked up. On several songs I preferred the Shures from a sonic standpoint and on EVERY song I preferred them from a comfort standpoint. These are great if you will be wearing them for an extended period of time. Very highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Brown",
      "helpful_votes": 7,
      "publication_date": 20140218
    },
    {
      "title": "fantastic cans!",
      "text": "Fantastic headphones! I wanted an upgrade to my DT-770, which sounded muddy to me. I mix music with my DT-880's so I wanted something I could use for casual listening and occ mixing duties. The sound is much fuller and richer than either Beyerdynamic, with a really musical quality. I also have Focal Alpha 80's which I use for occ mixing, casual listening and movies. Worth every penny. really a bargain; I would place the price around $700 or so. They are super comfortable as well- been listening to music for several hrs a day since they came in 4 days ago. It's like breathing new life into old songs. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Undergrad Review",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Amazing Earcups.  Terrible headband.  Hard to power.",
      "text": "Comfiest ear cups I’ve ever tested, but that’s where the good stops. The head band literally hurts after a short while of use. These things must take one hell of an amp to power sufficiently. I tried 3 different headphone amps and wasn’t able to get enough juice out of these without killing the SNR and inducing hum. The sound quality was phenomenal however, just quiet. Comes in a nice hard case with extra wiring. I’d probably have better things to say if I could’ve powered them enough. Headband is still terrible though!",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Schultz",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "like little pillows on my ear",
      "text": "they sound great, they came in a great package with a nice case to protect them. they're lightweight and very comfortable. my new favorite headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Very useable sounds and great feel.",
      "text": "I use these for mixing when I'm traveling or not in my studio and so far the mixes have translated very well. The open back design does feel better for long sessions and it doesn't have that muffled feel that the closed back designs have.",
      "rating": 5.0,
      "verified": true,
      "author": "Axeslinger98",
      "helpful_votes": 6,
      "publication_date": 20140721
    },
    {
      "title": "Four Stars",
      "text": "good, but needs to be plugged to very powerful gears to get to its high potential...",
      "rating": 4.0,
      "verified": true,
      "author": "MANOEL JUNIOR",
      "helpful_votes": 3,
      "publication_date": 20151107
    },
    {
      "title": "Perfection in audio",
      "text": "Heavily used as communications listening headset, this headset gets more use than almost anything else I own. I use this for all VoIP calls, and also to listen to music. The sound is beautiful compared to gaming headsets, and the level of clarity is unbeatable.",
      "rating": 5.0,
      "verified": true,
      "author": "Rutice",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "the best!",
      "text": "I have SRH1440 and this is my second Shure headphones. It has a amazing sound and much better than SRH1440. I'd like to say SRH1840 is better than HD 600 even the HD650, better than the ATH-AD2000x, better than the AKG K701 and K702 And the box of the headphones is soooooooooooooooooooooooo big!",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Zhang",
      "helpful_votes": 7,
      "publication_date": 20140122
    },
    {
      "title": "Best",
      "text": "Best head phones ever. Clear professional sound thats is worth getting them. If your looking fo a lot if base this is not the kind you will like to get but its a good rich clear quality sound",
      "rating": 5.0,
      "verified": true,
      "author": "Enrique",
      "helpful_votes": 4,
      "publication_date": 20130121
    },
    {
      "title": "very good.",
      "text": "audiophile headphone indeed. good comfort. but measured not so great.",
      "rating": 4.0,
      "verified": true,
      "author": "Eyal S.",
      "helpful_votes": 2,
      "publication_date": 20141227
    },
    {
      "title": "Fantastic Headphones",
      "text": "I'm not a hardcore audio expert. I normally use a pair of Sony MDR-V6 which are pretty standard and work for me just great. But when I listened through these I was blown away by how clear, balanced, and immersive the sound was and knew I had to get a pair. Yes v expensive but I look at them as a long-term investment that will continue to bring me real pleasure. I don't regret buying them for a second, they are amazing, and I'm grateful for them almost every day.",
      "rating": 5.0,
      "verified": false,
      "author": "Martin Giles",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Really nice headphones",
      "text": "I'm no headphone connoisseur, but these are the best 'phones I've owned. (Previous cans I've owned have been Koss, AKG, Sony, and Shure SRH840. I've also heard Grados and been underwhelmed my them.) They are a bit bright, but my speakers are Klipsch Forte IIs (horn loaded), so that's kinda what I was looking for. High-quality construction. Sound is quite transparent and revealing. Very lightweight and comfortable; three or four hours of listening create no fatigue. As others have noted, they do benefit from 100 hours or so of burn-in, mostly in the bass response. If open-back headphones meet your needs, I recommend these.",
      "rating": 5.0,
      "verified": false,
      "author": "stephen h.",
      "helpful_votes": 3,
      "publication_date": 20150708
    },
    {
      "title": "Great, articulate headphone",
      "text": "Great, articulate headphone. Love it! I've recently upgraded to Neumann 310s as my main mixing speakers. Fabulous, truthful speakers. And I went to upgrade my headphones to these 1840 Shures as well. Amazing how similar they are to my 310s in that they don't hype the bass or high end- things sound tight, crisp, smooth- representative of the actual mix- you can really hear the reverb tails, etc. Really good clarity for a 500.00 headphone. Highly recommended.",
      "rating": 5.0,
      "verified": false,
      "author": "awesomepiano",
      "helpful_votes": 3,
      "publication_date": 20140719
    },
    {
      "title": "Tried several phones but this is a game ender......",
      "text": "This one coupled with a decent amp is a game ender, clearly prefer it to my other combo formed by V200 + HD800. It definitely demands good amplification as sensitivity is only 96mW which translates into 102 dB/Vmrs that has an HD800.",
      "rating": 5.0,
      "verified": false,
      "author": "Brixen",
      "helpful_votes": 6,
      "publication_date": 20161115
    },
    {
      "title": "the truest headphones on the planet !!",
      "text": "these cans are the flattest, purest and the most true for mastering and mixing !! Great job shure..",
      "rating": 5.0,
      "verified": false,
      "author": "SUB",
      "helpful_votes": 5,
      "publication_date": 20150105
    }
  ],
  "product_meta": {
    "title": "Shure SRH1840 Professional Open Back Headphones (Black)",
    "description": "The flagship headphone from Shure, the SRH1840 Professional Open Back Headphones feature individually matched drivers for unparalleled acoustic performance with smooth, extended highs and accurate bass. Developed with premium materials and precision engineering, the customcrafted design is extremely lightweight and durable. A replacement set of velour earpads, and an additional cable ensure years of uninterrupted listening enjoyment.",
    "rating": 4.3,
    "feature_bullets": [
      "Individually matched 40 mm neodymium drivers for unparalleled acoustic performance with smooth, extended high-end and accurate bass",
      "Open-back, circumaural design for exceptionally natural sound, wide stereo image, and increased depth of field",
      "Lightweight construction featuring aircraft-grade aluminum alloy yoke and stainless steel grilles for enhanced durability",
      "Steel driver frame with vented center pole piece improves linearity and eliminates internal resonance for consistent performance at all listening levels",
      "Ergonomic dual-frame, padded headband is lightweight and fully adjustable for hours of listening comfort"
    ],
    "specifications": {
      "Item Weight": "9.5 ounces",
      "Product Dimensions": "10.5 x 6.5 x 11.25 inches",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping. Learn More",
      "ASIN": "B0073A4FM4",
      "Item model number": "SRH1840",
      "Batteries": "1 A batteries required.",
      "Customer Reviews": "4.3 out of 5 stars126 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#14,440 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 31, 2012",
      "Color Name": "Black"
    },
    "categories": [
      "Headphone & In-Ear Audio Monitors",
      "Studio Recording Equipment",
      "Musical Instruments",
      "Headphones"
    ],
    "price": 499.0
  }
}