{
  "website_summaries": [
    {
      "verdict": "While not as powerful as other solar ovens, this option stands out for extras such as an optional high performance reflector and a Water Pasteurization Indicator.",
      "pros": [
        "Made from sturdy recycled plastic",
        "Weighs 9 lbs",
        "Includes 2, 3-quart GraniteWare pots with lids, as well as an oven thermometer, high performance reflector, and a Water Pasteurization Indicator",
        "Works well for both summer and winter cooking",
        "Comes with a rugged carry case"
      ],
      "cons": [
        "Has sharp edges that can easily cut you or a child when using it",
        "Temperatures don't get as hot as other options, adding to cooking times"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cheap & falling apart",
      "text": "Please save your money. This is a piece of junk. Even the paint peeled off. Total rip off. Make your own.",
      "rating": 1.0,
      "verified": true,
      "author": "sylvia wilson",
      "helpful_votes": 4,
      "publication_date": 20190623
    },
    {
      "title": "Worth it ! Carribean heat will work wonders",
      "text": "Received product and was hyped to see what's inside box ! I didn't even notice that it came w pots and thermometer ! We live in Puerto Rico and we can't wait to start using it. Very big size and good thing to hear I can dry fruits ! We even planning to buy another one !",
      "rating": 5.0,
      "verified": true,
      "author": "Lara",
      "helpful_votes": 6,
      "publication_date": 20170315
    },
    {
      "title": "LOVE this oven!",
      "text": "We live off grid in the middle of nowhere and I have been wanting a solar oven forever. I finally did it and I LOVE it. Everything that I have cooked in it so far has turned out awesome. My husband has been amazed! Everything that I go to cook in it he says “if it cooks that I will be a believer”. It has cooked everything so far from beans, rice, chicken, potatoes to sole fish. He now wants to use it instead of ho-humming at it. This has been fun. My only complaint is that it only has room for two pots, I need four. Haha!",
      "rating": 5.0,
      "verified": true,
      "author": "Southland mom",
      "helpful_votes": 2,
      "publication_date": 20180531
    },
    {
      "title": "Solavore solar oven is the BEST",
      "text": "We have been extremely happy with our Solavore Solar Oven. We have cooked pork roasts, corn on the cob, hard boiled eggs in the cardboard carton, country style pork ribs, baked potatoes, and even rice! And meatloaf. With this oven it is not necessary to continually focus on the sun. The average temperature is 225 degrees. And we have reduced the need for air conditioning because the cooking is outside!! It's great! Would highly recommend this product for every household. The unit is so sturdy that you never need to worry about wind, either.",
      "rating": 5.0,
      "verified": true,
      "author": "solardrawn",
      "helpful_votes": 5,
      "publication_date": 20160623
    },
    {
      "title": "I am pleased with what I have cooked in the oven and ...",
      "text": "I am pleased with what I have cooked in the oven and am still in the process of learning how to use it. It appears to be fabrication of the oven could be improved. The inside panels to not appear to have been precisely cut to make a perfect interior. Perhaps, a self molded interior might work better. If anyone is crafty they could create a similar oven. Oven is cumbersome to carry in and out of the house each time you use. I now want an outdoor kitchen, with counter top, and storage area for oven Overall I 'm delighted to have it.",
      "rating": 4.0,
      "verified": true,
      "author": "Harmon the Elf",
      "helpful_votes": 2,
      "publication_date": 20170907
    },
    {
      "title": "Poor quality control...",
      "text": "While oven was well packaged the edge of the lexan top was a very rough cut with a chip knocked out at one point and a crack propogating from it. Plus, the housing/package did not include the lid hold down clips which are absolutely necessary to hold the lid on in a wind, especially with the reflector mounted. Living in the windy north where the reflector is needed this makes the unit essentially unusable.",
      "rating": 2.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 9,
      "publication_date": 20160805
    },
    {
      "title": "It is nice to have a hot meal at lunch at the ...",
      "text": "This oven is a quality product. Very versatile. Cooks a lot of food. It is nice to have a hot meal at lunch at the ski resort when it is sunny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170316
    },
    {
      "title": "Highly recommended, except for spare part",
      "text": "Been solar cooking for several years with the Solavore. It is getting old now, but still working. Wish I could order the top transparent part, but company does not answer. Highly recommended, except for spare part ordering",
      "rating": 5.0,
      "verified": true,
      "author": "Marc De Puy",
      "helpful_votes": 8,
      "publication_date": 20160911
    },
    {
      "title": "I like it alot",
      "text": "I like it alot, but not as much as the ultimate all-american sun oven. I do like that it came with two pans and a pasturizer gizmo. I plan to bake bread and try making beef jerky with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Diana Blanke",
      "helpful_votes": 3,
      "publication_date": 20160812
    },
    {
      "title": "Works great!",
      "text": "I cook all sorts of stuff in my solar oven. I am really happy with this purchase. I even bought one for my sister who likewise loves hers. Great way to cook for free. Every home should have one of these and save electricity or gas. I mean the suns right there - Its free for us to use so why not!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve L.",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Happy as a Lark",
      "text": "No batteries. No electric cords. These things will cook anything. I even found a way to pop popcorn online with one. It takes about 90 minutes to get them hot enough to cook on, but that's all just part of the joy of living off-grid. Light and portable, is easy to throw in the back of the truck on a getaway. This is a hard-asset investment that's worth its weight in gold!",
      "rating": 5.0,
      "verified": true,
      "author": "DianaS",
      "helpful_votes": 4,
      "publication_date": 20130619
    },
    {
      "title": "perfect for bees wax",
      "text": "perfect for bees wax. hasn't burnt anything we've cooked. makes frozen foods very well. we enjoy it a great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jello",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Cooked ribs perfectly.",
      "text": "Cooked ribs perfectly. This thing is not cheap but it's kind of amazing. You got the temperatures upward means to be and I didn't worry about anything burning.",
      "rating": 5.0,
      "verified": true,
      "author": "M Peters",
      "helpful_votes": 2,
      "publication_date": 20150806
    },
    {
      "title": "Quality Solar Oven on a budget",
      "text": "I researched a solar oven for my emergency preparedness. I have been buying a food supply but I like the idea of not needing fire or some type of fuel to heat my food. I think $200 is a great investment because the only thing you need to prepare all this freeze dried food is hot water. I also liked the fact that it comes with 2 pots and the new metal reflector. Nothing to break or wear out.",
      "rating": 5.0,
      "verified": true,
      "author": "steve austin",
      "helpful_votes": 3,
      "publication_date": 20130805
    },
    {
      "title": "Great as Prepper tool and we will use it for ...",
      "text": "First meal was beef stew. Cooked at 250 degrees without reflector. Great as Prepper tool and we will use it for regular cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "darryl tisherman",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Just Add Sun!",
      "text": "Works as advertized. Just add sun! Make sure you use the reflector for maximum heat. Have only used it once to make sure I know how and now I do.",
      "rating": 5.0,
      "verified": true,
      "author": "TT",
      "helpful_votes": 2,
      "publication_date": 20130227
    },
    {
      "title": "Weather for picnic uncooperative but still got good results.",
      "text": "I had a solar picnic on Labor Day. The weather was not cooperating. But I got good results with the chilli and solar hotdogs. The reflector was great. The pots were the right size for a large number of people. The thermometer verified that we were getting some good results despite rainclouds. ( I can't wait to try the WAPI.)",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen",
      "helpful_votes": 3,
      "publication_date": 20130919
    },
    {
      "title": "Works just like it says.",
      "text": "The solar oven works great. Have not been disappointed with any thing I have cooked in it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jbear",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Great results",
      "text": "I highly recommend this oven. It is simply to operate and I got superior results. I could not be happier!",
      "rating": 5.0,
      "verified": true,
      "author": "Myrna Crittenden",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Totally Fun",
      "text": "If you can Crock Pot it you can Solar it.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Graff",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Five Stars",
      "text": "I love my Solavore, I use mine on the tailgate while fishing",
      "rating": 5.0,
      "verified": true,
      "author": "Delilah Jews",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Sunny delight!",
      "text": "I have used it several times under various conditions and it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Byron L. Anderson",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "It works as advertised.",
      "text": "I find it to be cheaply made. It works great but I am concerned as to how well it will hold up over time. I guess time will tell.",
      "rating": 3.0,
      "verified": true,
      "author": "Hermit",
      "helpful_votes": 0,
      "publication_date": 20131005
    },
    {
      "title": "Great energy Saver",
      "text": "I live in Texas where we get sun most of the year. Therefore, the solar oven is very practical here. The energy source is free, and cooking outside doesn't heat up the kitchen. My solar oven will cook two big pots of stew in about two to three hours or a whole chicken in about the same amount of time without the reflectors.",
      "rating": 5.0,
      "verified": true,
      "author": "T. A. Bacon",
      "helpful_votes": 5,
      "publication_date": 20130402
    },
    {
      "title": "Great Cooker",
      "text": "Solar oven works as advertised as long as you give your food enough time to cook. Good way to avoid heating the house during the summer.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Suggs",
      "helpful_votes": 20,
      "publication_date": 20120718
    },
    {
      "title": "Use Camping",
      "text": "We use this camping and love it. Mostly have just made stews and brownies. Tried cooking an egg in it's shell to see what happened and well it exploded so don't try that. Have used it at home also for cobbler type desserts and stews.",
      "rating": 5.0,
      "verified": true,
      "author": "Okie",
      "helpful_votes": 4,
      "publication_date": 20140226
    },
    {
      "title": "Super SOS",
      "text": "I purchased the SOS for a demonstration for our church kids. The hot dogs and cinnamon rolls were a big hit. Great product. Tom",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20130726
    },
    {
      "title": "Very very very very good item",
      "text": "I am a teacher of Science from Saudi Arabia and the fact that this product was great and I used it with my students and cooked at school .It was a lesson on natural resources and of course all the students and teachers Taste the food which was very tasty .Thank you every body",
      "rating": 5.0,
      "verified": true,
      "author": "S.H",
      "helpful_votes": 12,
      "publication_date": 20130528
    },
    {
      "title": "I love this thing",
      "text": "I live in the Seattle area, so we don't have A/C. And for those few weeks when the temp. is way too high to use the stove in my kitchen, this oven works like a charm. The pans are large enough to feed a family of 4. I overcooked the chicken and the rice the first time I used it, but it really rocks. Haven't used the reflectors, because I only use the oven on very hot (80degree) days I just want to harness the free energy when I can get it. It really tickles me to do that.",
      "rating": 5.0,
      "verified": true,
      "author": "Gr8 shopper",
      "helpful_votes": 2,
      "publication_date": 20131219
    },
    {
      "title": "Works well. full video review coming",
      "text": "We have used it several times to cook in. These were all summer cooking a cooked chicken and some other stuff I can't remember what want to try in the winter time and see how well it does.",
      "rating": 4.0,
      "verified": true,
      "author": "racrdug",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Buy this cooker",
      "text": "i have 2 of these. cooked everything. oh and ribs, FALL OFF THE BONE, carrots, potatoes, cauliflower, cakes, pork loins, well everything, it all cooks up freaking awesome, all had more flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "New Cook in our Household",
      "text": "MY HUSBAND, WHO DOES NOT DO THE COOKING IN OUR HOUSEHOLD, LOVES COOKING IN HIS SOS SOLAR OVEN. It pretty much matched his expectations and he feels the food cooked in the solar oven has more flavor than conventional cooking equipment would provide.",
      "rating": 4.0,
      "verified": true,
      "author": "Jjoan Brownfield",
      "helpful_votes": 7,
      "publication_date": 20130403
    },
    {
      "title": "Strongly Do not recommend this product",
      "text": "1) Not safe for children to handle this as the products has very very sharp edges that are difficult to avoid during usage. Both myself and our daughter have deep cuts to our hands. 2) Product quality is very low. The latches are extremely difficult to use. 3) Temperature does not go high enough compared to other products; Example: will not cook rice. Look for cheaper alternatives or try to make one at home.",
      "rating": 1.0,
      "verified": true,
      "author": "Satheesh A. Donthy",
      "helpful_votes": 12,
      "publication_date": 20170715
    },
    {
      "title": "Good oven",
      "text": "My first meal came out very tasty and it required no experience to use it or set ii up for good results.",
      "rating": 4.0,
      "verified": true,
      "author": "danad",
      "helpful_votes": 2,
      "publication_date": 20130726
    },
    {
      "title": "Preheat, preheat, preheat",
      "text": "Honestly, this is not a bad product, but with one caveat, or two maybe. Preheat, and make sure there's plenty of sun on the day of cooking. I cooked a camper's stew as my first attempt, and it was tasty, but the veggies were underdone. Second attempt, chili. It clouded up and the temp fell to 150 in the oven. I got the runs. Also, the cookbook that came with the oven could have included more recipes. You can find those online though. If you like alternative cooking and energy savings, by all means buy it. If you're overly cautious, don't.",
      "rating": 3.0,
      "verified": true,
      "author": "Brady Shoemaker",
      "helpful_votes": 30,
      "publication_date": 20120828
    },
    {
      "title": "Love The Sun, Love The Solavore Sport Solar Oven",
      "text": "I am so glad that I purchased this solar oven. I did a lot of research before choosing the Solavore Sport Solar Oven and I made the right decision based on my cooking needs. I was like a kid in a candy store setting up the oven. My first cooking was pretty simple, corn bread. It didn't last long in the house and smelled so good. I waited for my grandkids to be here because I want them to know about solar cooking. Plus, you get excellent customer service from the company. I contacted them several times before and after the purchase and they were so helpful, they want you to succeed. Buy it, you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Gram To 6",
      "helpful_votes": 4,
      "publication_date": 20160425
    },
    {
      "title": "Everything is quality",
      "text": "This is a quality unit. I have not used it yet but wanted to comment on the quality of materials and construction...they are great. There are many other reviews on how this unit cooks that are more eloquant than I can write. I just wanted to add my comments on quality and the deserved five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "The Cheif",
      "helpful_votes": 8,
      "publication_date": 20120910
    }
  ],
  "product_meta": {
    "title": "Solavore Sport Solar Oven - Portable Solar Cooking Package Complete with All Season Solar Reflectors, 2 Granite Ware Pots, Oven Thermometer, and Water Pasteurization Tool",
    "rating": 4,
    "specifications": {
      "Product Dimensions": "27.25 x 12.25 x 17 inches",
      "Item Weight": "8.8 pounds",
      "Manufacturer": "Solavore",
      "ASIN": "B007VTLMU0",
      "Item model number": "Sport-105",
      "Customer Reviews": "4.0 out of 5 stars104 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#326,570 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Grills & Outdoor Cooking",
      "Garden & Outdoor"
    ],
    "price": ""
  }
}