{
  "website_summaries": [
    {
      "verdict": "Outstanding hairdressing scissors that prove you can get a great cut from an affordable tool.",
      "pros": [
        "Crafted of strong stainless steel with a stylish black colour and ergonomic structure",
        "Tension screw is easy to adjust",
        "Nice overall quality, especially when you consider the affordable price point"
      ],
      "cons": [
        "Some inconsistencies in quality, as most scissors have very sharp blades while a few were quite blunt"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "best shears and super sharp",
      "text": "Best haircutting shears I have even owned except for very expensive ones from Germany. I am a retired hairdresser and needed some new shears for my own hair and family haircuts. I didn't want to spend hundreds of dollars on home haircutting tools, these got good reviews, so I bought them. I have never bought shears sight unseen before. They are wonderful. Super sharp -- I have cut into my fingers a few times proving just how dull my old shears really were! These are truly right OR left hand scissors and work just as well either way.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyLynnea",
      "helpful_votes": 14,
      "publication_date": 20170207
    },
    {
      "title": "Scissors are great for the purpose I bought them for which is ...",
      "text": "Scissors are great for the purpose I bought them for which is keeping the hair around my little dogs eyes clear of build up. Also works great on the back end too to keep the hair clear there. They are sharp, easy to handle. Length of scissor could be a little longer for better manipulation.",
      "rating": 4.0,
      "verified": true,
      "author": "Caryle",
      "helpful_votes": 4,
      "publication_date": 20170809
    },
    {
      "title": "Amazing",
      "text": "I did a lot of researching for good scissors because I’m not a hair stylist or know brands, etc. And I’m glad I went with these ones! Smooth cutting and the feel of the scissors themself are nice and heavy, and high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Niki",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "Well made scissors",
      "text": "This scissors is of pure quality. You can tell that great craftsmanship was put into making it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jèan R.",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Cuts fine hair well",
      "text": "Comments went to seller's page. I commented on ordering on March 23rd. So now I am updating my comment: I received the scissors! This product took a long time to get to me. Good grip for small and medium sized hands/fingers. The scissors cut fine hair very well and evenly.",
      "rating": 4.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good buy!",
      "text": "I'll start with - I'm not a professional. Lol. But, to me, these are nice. Especially for the price! I love them. I also really like the case they came with.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Smooth Cut",
      "text": "Oohhh, very high quality, smooth cutting motion and just the right size. Really excellent pair of scissors! I plan to buy another pair.",
      "rating": 5.0,
      "verified": true,
      "author": "\"Raven\"",
      "helpful_votes": 3,
      "publication_date": 20160906
    },
    {
      "title": "I'm an amateur, they seem quality",
      "text": "got to trim own hair and pleased they seem heavy duty, sharp and comforatable. havent used but expect they work great",
      "rating": 5.0,
      "verified": true,
      "author": "Raguel",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Classy Sharp Shears",
      "text": "Arrived in a handsome magnetic clasp velvet lined case.Very sharp. Perfect for trimming fast growing bangs. Paid for themselves already.",
      "rating": 5.0,
      "verified": true,
      "author": "Peachey",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Heavy duty",
      "text": "I am not a professional, so spending a lot would not make sense. These scissors I would consider professional grade and a great buy for their quality.",
      "rating": 5.0,
      "verified": true,
      "author": "James Morrison",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Three Stars",
      "text": "Small finger holes, going to try and use. Will see.",
      "rating": 3.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Super sharp. The best hairdressing scissors I've tried",
      "text": "Super sharp. The best hairdressing scissors I've tried. I cut all my family member's hair with them and they've lasted really well. Would purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Cassidy",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Easy to Cut Hair",
      "text": "The scissors brand new, sharp blade cut hair easily. The small size made it the scissors easy to control.",
      "rating": 5.0,
      "verified": true,
      "author": "History Buff",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Two Stars",
      "text": "Finger holes much too small for my hands that aren't that big.",
      "rating": 2.0,
      "verified": true,
      "author": "Andy Friedlander",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "High quality",
      "text": "Excellent quality. Excellent feel to the cutting action. Very smooth movement. Very sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Great for the price!",
      "text": "Worked like a charm! Nice case it comes in. Pleasing appearance.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Five Stars",
      "text": "So far so good. Very comfortable scissors and they are sharp. How long will they last? We shall see.",
      "rating": 5.0,
      "verified": true,
      "author": "Joy F V",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "A Cut Above!",
      "text": "These shears are truly professional quality. Razor sharp and they look like they'll stay that way.",
      "rating": 4.0,
      "verified": true,
      "author": "Atheniakid",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "These sheers are AMAZING! They are very sharp",
      "text": "These sheers are AMAZING! They are very sharp , adjustable, and great quality especially for the price. My clients love the way I cut there hair with them and how clean there hairstyle looks after I trim/cut/layer their hair. Definitely worth the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "desiree Christian",
      "helpful_votes": 3,
      "publication_date": 20151005
    },
    {
      "title": "Very satisfied. Good deal",
      "text": "They're everything they're cracked up to be. Very satisfied. Good deal, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Like it a lot.",
      "text": "I ordered this for trimming. Basically to get rid of the split ends and stangled hair. Not for professional use. I am impressed by how sharp it is. Basically, it touches my hair without any pressure it make the cut. I am very satisfied with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "tong wu",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Five Stars",
      "text": "very high quality and reasonably priced, so sharp i cut my fingers.. be careful with this one !!",
      "rating": 5.0,
      "verified": true,
      "author": "Alper",
      "helpful_votes": 3,
      "publication_date": 20140930
    },
    {
      "title": "Nice short scissors",
      "text": "Good quality scissors. A bit shorter than needed (6.5\" would have been better) but they work well and my misjudging length need is on me, not Sanguine.",
      "rating": 5.0,
      "verified": true,
      "author": "NHM",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Stylish, sleek, sharp",
      "text": "I love these shears! They are stylish, sleek, and very sharp. The black finish is gorgeous and the case is very nice. I use them to cut my pixie at home. No complaints, would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "MJ723",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "These are great scissors❤️",
      "text": "Love these scissors! I'm not a professional, but I can cut hair nicely. These are very sharp and cuts my husbands hair so well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sweet Caroline",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "great",
      "text": "Use for cutting families hair --a useful and easy to use tool",
      "rating": 5.0,
      "verified": true,
      "author": "tony porto",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "EXTREMELY SHARP!",
      "text": "EXTREMELY SHARP!! You have to be really careful with them! But they cut great! Hair seems to build up on the scissors if the hair is wet. Very easy to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "mmbbdd",
      "helpful_votes": 3,
      "publication_date": 20160810
    },
    {
      "title": "Amazing value - professional quality!",
      "text": "Fantastic scissors for the price - even for a pro!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Gibbs",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Professional Barber Shears",
      "text": "Super quick delivery. Item as described and what I wanted. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Ozgard",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Good steel scissors",
      "text": "Very nice barber scissors, made of real steel not stainless, so they stay sharp longer.",
      "rating": 4.0,
      "verified": true,
      "author": "D JANES",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "High Quality Scissors",
      "text": "These are the sharpest high precision sciroors. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "jes",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Great value, Very high quality! Buy em, thank me later!",
      "text": "Buy these, very sharp. Easy to get in to that one long strand on your eyebrows (hint guys, unless you want all the ladies chasing a well groomed man).",
      "rating": 5.0,
      "verified": true,
      "author": "C David Deweese",
      "helpful_votes": 2,
      "publication_date": 20160223
    },
    {
      "title": "You get what you pay for",
      "text": "Good professional shears are expensive, very expensive. These shears are quite inexpensive, but functional. They aren't properly balanced, so if you don't use them just right they will fold rather than cut hair. The screw can't remedy the lack of proper balancing. If you tighten it enough to keep the shears from folding the hair, the action is like kitchen shears. They work ok, and are adequately sharp. I definitely got my moneys worth.",
      "rating": 3.0,
      "verified": true,
      "author": "Quinault",
      "helpful_votes": 5,
      "publication_date": 20170812
    },
    {
      "title": "Sucks! This product came from London",
      "text": "This shears does not fit my fingers. I wanted to return,but have to pay for the return myself. The money that i will pay for return is higher than the money i paid for shears. So i will not return ,but i can't use this shears. Sucks ! This product came from London, GB.",
      "rating": 1.0,
      "verified": true,
      "author": "T C",
      "helpful_votes": 0,
      "publication_date": 20160922
    }
  ],
  "product_meta": {
    "title": "Sanguine Professional Hairdressing Scissors, 5.5 inch, 14 cm, Deep Black",
    "description": "Professional barber shears, hair cutting shears, black, 5.5 inch long. These hair scissors are really great for detailed work.",
    "rating": 4.7,
    "feature_bullets": [
      "Professional Barber Shears, Hairdressing Scissors - 5.5 inch (14cm), Black",
      "Extremely sharp blades for clean cut, will not damage or split hair ends",
      "Hand crafted, made from Japanese steel (J2) will stay sharper much longer",
      "Round, smooth tension screw system gives a greater required tuning",
      "Remove-able finger rest. Please note: these scissors don't come with old black case anymore!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.39 x 7.48 x 3.15 inches; 4.23 Ounces",
      "Item model number": "JAG-55Black",
      "Manufacturer": "Sanguine Scissors Ltd",
      "ASIN": "B007ZKE1M6",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hair Cutting Tools",
      "Hair Care",
      "Shears",
      "Beauty & Personal Care"
    ],
    "price": 24.06
  }
}