{
  "website_summaries": [
    {
      "verdict": "Simple collar that has a reasonable price point versus other personalized collars.",
      "pros": [
        "Owners can slightly adjust the fit to ensure it's snug enough to remain in place",
        "Pick up to 25 characters to add to the dog collar, allowing room for a name and phone number",
        "Five nylon collar colors and 14 thread colors available"
      ],
      "cons": [
        "Has a plastic closure buckle that's easy to use, but it may not last under stress"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I HATE IT - TAKE OUT THE STUPID LOGO",
      "text": "Very dissatisfied. The logo placement means that the name and number is placed in the middle to end of the collar where the adjustment band is located. Defeats the whole purpose of putting the telephone number on the collar. Picture attached with number blurred. Fortunately I can somewhat place the adjustment band to a point where most of the numbers are seen, but it means the collar is somewhat loose. HEY GOTAGS - PUT THE LOGO ON THE INSIDE OR THE OTHER SIDE!! I was not going to review until I got an annoying unsolicited email from the stupid company asking me to review the product.",
      "rating": 1.0,
      "verified": true,
      "author": "SD GUY",
      "helpful_votes": 229,
      "publication_date": 20180520
    },
    {
      "title": "Not happy with fit",
      "text": "Collar was beautiful BUT in order to see the embroidery cannot make the collar smaller than 13 inches. This is much too large for my dog. Embroidery is placed in such a way that it requires you to leave it as a larger collar. Not happy at all!",
      "rating": 1.0,
      "verified": true,
      "author": "Regina Sabia",
      "helpful_votes": 48,
      "publication_date": 20171028
    },
    {
      "title": "Nice quality, quick to arrive",
      "text": "The sizing on these collars is inaccurate! The company has their logo sewn on where the dog's name/phone number belongs. Therefore, when trying to size this collar to actually fit my dog's neck it covers up most of the phone number! Sadly, I purchased 3 of them for our dogs. I really wish I had read the other reviews stating the same exact problem.",
      "rating": 1.0,
      "verified": true,
      "author": "D Alen",
      "helpful_votes": 31,
      "publication_date": 20180320
    },
    {
      "title": "BECAUSE OF THIS CHEAPY THIN BAD DESIGN LOCKING MECHANISM",
      "text": "PLASTIC LOCKING PART IS THIN.... MY DOG RAN AWAY AND ALMOST HIT BY CAR. BECAUSE OF THIS CHEAPY THIN BAD DESIGN LOCKING MECHANISM. PLSTIC PIECE CAN BE BEND INWARD WHEN MY DOG PULLING HARD. WHICH MEANS COLLAR CAN BE UNLOCK. VERY DANGERIOUS COLLAR. DO NOT BUY!!",
      "rating": 1.0,
      "verified": true,
      "author": "Lexen",
      "helpful_votes": 26,
      "publication_date": 20161026
    },
    {
      "title": "This is not a good collar. I was surprised because of the positive ...",
      "text": "This is not a good collar. I was surprised because of the positive reviews. Now, I will say, my dog does swim, but even so, within two weeks of putting it on her, it started to fray, both the collar and lettering. And now it's curling up as well. For a collar that is just a few weeks old, it looks like she's worn it for a year. I've never had a collar wear out so quickly and I've had many dogs for many year. I just reordered her a new collar from another site. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "CA Mom",
      "helpful_votes": 13,
      "publication_date": 20170719
    },
    {
      "title": "A very nice collar I would like to order one for my ...",
      "text": "A very nice collar I would like to order one for my other two cats . The only problems are It does not have a break away clasp and the lettering needs to start a little closer to the tag ring because for a small neck the adjustment buckle covers part of the print.",
      "rating": 4.0,
      "verified": true,
      "author": "SJM",
      "helpful_votes": 28,
      "publication_date": 20160105
    },
    {
      "title": "Exceeded Expectations...",
      "text": "My puppy is very active and tends to destroy or loose dog tags with ease. I bought two of these collars thinking that if they were cheaply made, I'd have ready backup. That was unnecessary as these collars are made well. They're fully adjustable, the embroidered print is easily readable, and the clasps are sturdy... If you run or hike out in open spaces, this is the collar for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 26,
      "publication_date": 20160105
    },
    {
      "title": "Not pleased AT ALL",
      "text": "Not a good product. The slider on the collar covers up part of my number due to odd placement/size of the font. In order for someone to get the info from the collar they would have to actually take the collar off of my dog and any dog owner knows that is not a good idea for a dog who has gotten lost. My dog would probably immediately run away and then be without his collar! This company wants me to pay to send this now useless collar back to them. The collar will just be thrown away as it can't be used with my info on it. Not pleased at all and I really just want my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "bashly13",
      "helpful_votes": 11,
      "publication_date": 20160106
    },
    {
      "title": "Do not depend on this latch....",
      "text": "Latch fails after two tangs take a set and no longer latch securely. I asked for a replacement and its the same junk. Glad I did not attach his leash to this, first tug and collar separates and there goes my dog, and he's a runner. One has to force the tangs together to insert it in latch therefore two tangs take a \"squeezed\" set and no longer latch. I love the idea so I need to find the same product with a good secure latch. Vendor probably saved a few cents on the mis-matched latch.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick L",
      "helpful_votes": 3,
      "publication_date": 20190604
    },
    {
      "title": "Collar Does Not Stay Adjusted",
      "text": "I ordered this adjustable collar for my 95 lb. Labrador Retriever. I had ordered an adjustable collar from another company, but the material allows the collar to easily slide and become too big to stay on. The reason that I ordered this collar was because the material appeared to be heavier. Unfortunately it is the same horrible material as the other collar and slides out of adjustment easily. Therefore, does not stay to the appropriate size with no more than a slight tug of my hands.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Klocek",
      "helpful_votes": 5,
      "publication_date": 20180813
    },
    {
      "title": "Safety Concern",
      "text": "Received Item on-time and \"Appeared\" to be of quality. Fitted it on our 12 week old Bull Terrier Pup for the first time for an outside walk and 3 adults couldn't get the plastic snap buckle (depressing the side tabs with all our might) to release, it was locked for good. We had to slowly loosen the webbing through the plastic loops until it could be removed over his Egg Head. After that experience we though what if it had been a real emergency and needed immediate removal....... Contacted the Seller and they promptly issued a refund, although shipping > $5.00 at our expense..........",
      "rating": 1.0,
      "verified": true,
      "author": "Moser",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Deceptive product description",
      "text": "There is a GoTAGS embroidered logo on the collar (not pictured and not wanted) that causes the letters on the small collar to be covered by the buckle (also not pictured), and the fabric is narrow and stiff compared to the Orvis collar. To get a refund I have to return the collar at my expense, which I won't do because my phone number is permanently attached. Lesson learned.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Byerly",
      "helpful_votes": 8,
      "publication_date": 20161120
    },
    {
      "title": "BIG PROBLEM WITH PRODUCT DESIGN-see review",
      "text": "Big problem: I’ll try my best to describe problem so hang in there. Product allows a finite number of letters and numbers so I put name and phone number. When I got collars and had to adjust them smaller some of the phone numbers ended up being under the plastic connectors where they can’t be read. The name and numbers were embroidered in a certain direction so that when adjusted the plastic hardware covers the phone number. So if your dog was loose the “catcher” would have to remove the dog’s collar and undo the adjustment plastic pieces to read the number while your dog now runs away totally freaked and without a collar and tags.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "DO NOT ORDER",
      "text": "Love the concept but not happy that I am paying to advertise a logo. My dog's identification would be more visible if the logo was located elsewhere. I have removed the logo so it backfired. Although I love the product and feel it's a quality product, I don't like the dishonesty behind the placement of the logo. It's not indicated in the pictures that way and I truly didn't expect my dog's information not to be visible. Shame on GoTags for putting greed before the well being of an animal.",
      "rating": 1.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 2,
      "publication_date": 20190412
    },
    {
      "title": "... ordered several of these in large and they were great, ordered a tiny one and was not happy ...",
      "text": "I ordered several of these in large and they were great, ordered a tiny one and was not happy with the material, it was hard and I would not want it around my neck. Was not the nice soft material the first few were. Loved the bigger ones hated the small one. for the size and material the small should of been half the price",
      "rating": 1.0,
      "verified": true,
      "author": "K9saver",
      "helpful_votes": 9,
      "publication_date": 20160709
    },
    {
      "title": "GREAT PRODUCT - GREAT VENDOR!",
      "text": "I liked the wide assortment of available colors for the collars AND embroidered characters. These collars are durable & adjustable. One reviewer suggests to order a size larger to allow space for text or it will be obscured by the adjustment buckle. Both of my 65 lb, 11 month old choc. lab pups have 5 letter names & then my 10 digit phone number which fits just fine/unobstructed on a medium collar for a 16\" neck... per vendors sizing instructions. Measure correctly!! The collars don't have much (if any) stretch and are very durable. This vendor has great customer skills & wants you to be happy with your purchase. I recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Not a good choice for small dogs.",
      "text": "The one good thing I will say is that it arrived very fast. When I ordered embroidered collars in the past, they ask what size it will be adjusted to - which allows proper placement of the name/number. This one did not, therefore part of the number is blocked. I am also unable to adjust completely to the correct size due to the embroidery. I am disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia R.",
      "helpful_votes": 3,
      "publication_date": 20190621
    },
    {
      "title": "Collars are good.  Customer service is excellent",
      "text": "The first set came in a timely manner but were way too big despite measuring both dogs. I was so upset because there was no way to make them work and I couldn’t afford to just throw my money away. I emailed the company and they were wonderful. They worked with me to send the extra smalls. Turns out they fit the bigger do right at the top of the adjustment and the smaller dog at the smallest adjustment. My poochies are at odd sizes. But the company definitely treated me right and everything was done quickly. I really appreciate it so much! The collars are great and easy to read. Thanks again for great service!",
      "rating": 5.0,
      "verified": true,
      "author": "D. Kauble",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "One Star",
      "text": "two of the three collars collars plastic lock assembly broke with in 2 days. need metal hardware.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Day",
      "helpful_votes": 7,
      "publication_date": 20180424
    },
    {
      "title": "My phone # is embroidered into the nylon",
      "text": "Bought these for my 2 lab-mix dogs who lie down in every pond or puddle they encounter. They are country dogs so they encounter many and have returned home with their tags missing from their collars. They are both chipped but if lost would need to be taken to a shelter or vet to find who their people are. These collars have our phone # embroidered into the nylon along with the dog’s name, so if the tags go missing it’s no big deal. They are adjustable for a perfect fit and are made of thick nylon with heavy plastic hardware. The bright colors are nice looking on my pups and should hold up for years through their daily swims.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Green",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "No phone number and terrible product support.",
      "text": "I was very excited about ordering and receiving the collars, but they arrived without our telephone number. I went to their website and tried calling, but was told to contact them by e-mail. I'm not thrilled to return the product was its very time consuming for two dog collars. The whole return process is challenging for $40 worth of dog collars. The product is beautiful, but not worth anything without a phone number. Customer service really stinks.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael A. Lynch",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Number covered",
      "text": "I returned because I didn’t like the phone number covered up by a buckle. I wanted the whole number visible.",
      "rating": 1.0,
      "verified": true,
      "author": "Lb",
      "helpful_votes": 7,
      "publication_date": 20180506
    },
    {
      "title": "Love these collars!",
      "text": "I bought one for each of my two dogs and they look great and were very reasonably priced. I read that the sizing slide covered the numbers on the phone number, so I added the dog name last. I think the phone number is more important than the dog's name. It does cover up some of the name, but the number is clear and easy to read this way. They are thin, but seem strong and light weight is good. I got two of the same size, but they were a bit different. Luckily I was able to adjust them to fit fine. I would recommend these pretty and bright colored collars and would purchase them again.",
      "rating": 5.0,
      "verified": true,
      "author": "kelleyskloset",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "information",
      "text": "the rating is for the collar, but I'm glad I waited to comment. the previous supplier could of been new, poor research lead to poor design and with little feedback, may continue to make the same cxxp. But what drove this review was the inability to reorder, try it some time if the order When I wanted to reorder, I couldn't even see which size I ordered and because the collar was still going strong I'm ordering because I lost the original, so my next order will be a guess, thanks AMAZON please fix this, and hopefully with most of my orders Painfully Disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "haguet1",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Poor quality.",
      "text": "I received this collar and was looking forward to trying it out. BUT the first I noticed that the collar is very thin, the text was partly hidden under a very flimsy clip. This collar is suppose to help identify your pet to others, but cannot read text and collar is not secure.",
      "rating": 1.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20190616
    },
    {
      "title": "Slider for size adjustment covers name or number",
      "text": "Depending on how much you will need to adjust the collar to fit, the slider will cover the dogs name, or worse, parts of your phone number. The information should be placed close to the buckle so the slider would be less likely to cover it. Had I known this I would have gotten a collar with a steel or brass plate with the information on it rather than this collar.",
      "rating": 3.0,
      "verified": true,
      "author": "Edwin Barkdoll",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Adjusting to make smaller makes telephone number hard to read",
      "text": "If the collar was a plain collar ( no writing), it could easily be adjusted with the plastic clip. However, since this has her name and number spaced out on the middle of the collar, when you use the plastic adjustable clip to tighten, the black plastic clip winds up over the numbers of the telephone number and makes it almost impossible to be read easily. The spacing of the letters doesn't account for adjusting the collar to size it down. The smaller size (xs) will be too small. We were very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "pittsburghIsGreat",
      "helpful_votes": 7,
      "publication_date": 20160128
    },
    {
      "title": "Bright and easy to read",
      "text": "My two boys sometimes run off. It scares me to death that I won't find them. Now that I have them both with collars with the phone number big and easy to read, I have a little more peace of mind. The colors are also pretty. Each collar has their names and the phone number that is really easy to read. Try to get a size as close to your dog's neck size. My smaller dog, I bought for him a large collar, and it would have been better to get him the medium. When you \"take in\" the collar to make it fit better, it will cover up the name or phone number. My bad.",
      "rating": 5.0,
      "verified": true,
      "author": "J. P.",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "We love it!!!",
      "text": "I got the pink collar with teal blue because that’s what colors my spoiled fur baby likes. I am so pleased with the colors and well made collar and my fur baby girl was so happy when I showed her the new collar she would now be wearing. Only drawback is the sizing. I purchased this because her old collar was too small/tight and she was uncomfortable. She is 87-90 lbs and has a 24” neck. (German Shepherd/Berniese Bull Dog mix). I bought the suggested size but it is a little bit too big. After the adjustments, it covers some of her name and phone number.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Yelyn",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Stitching is low quality and uneven. Not as depicted in advert",
      "text": "Just see the picture. The stitching in the advertisement is perfect, even and high quality. What you get is in the picture I uploaded. I contacted the company and they would not fix this collar. They said since it is legible that is good enough. They did agree to replace a second collar I order that was actually worse! Amazon does not back this purchase either as it is third party.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike M",
      "helpful_votes": 2,
      "publication_date": 20190522
    },
    {
      "title": "It's Cheap and Not Well Made",
      "text": "I purchased this collar less than 6 months ago. My dog has worn the collar less than fifteen times. The threads are fraying and the collar is disintegrating. I was initially disappointed in the item because the way the embroidery is stitched into the collar prevents someone from reading the full telephone number when it is sized correctly for my dog's neck. The company offered a to let me return the item, but the inconvenience wasn't worth it. Now I'm sorry I didn't return the item because it's so poorly made.",
      "rating": 1.0,
      "verified": true,
      "author": "Milo's Mom",
      "helpful_votes": 3,
      "publication_date": 20180905
    },
    {
      "title": "Good Company",
      "text": "When I first got the collar to adjust to the right fit the buckle covered the embroidery and I wasn't too happy about that. I wrote the company and they were very nice about wanting to make me happy with my purchase. But I thought since it was custom, I really didn't feel right about returning. But because they were so nice, I was going to change my 2-star review to a 3star because of their customer service. However as I was looking for my review, I came across another review that suggested adjusting the buckle the other direction. Anyhow, I was able to readjust and the print now is not covered and it fits just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Theo L.",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great Identification for you 4-legged child!",
      "text": "I love my collar! If there was anything to complain about, it would be the adjustable strap. If you get a collar that is too big (or at the lower end of the size range) you have to adjust the collar which puts the holder over part of the text. My advice is to pick a size that is exactly the size of your dog's neck. I picked the next range up that still covered his neck size but I had to tighten it up to fit him. I ended up cutting it to fit and gluing it with fabric adhesive and now it's absolutely perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "I have ordered more than one from GoTags over the years",
      "text": "I think the first collar I ordered from GoTags was maybe 5 or 10 years ago. I have ordered more than a few times. Most recently I re-ordered one for my dog. The original she had been wearing for maybe 4 or 5 years; I only re-ordered because we got a new pup and he chewed her collar up. Other than that, the collar was in excellent shape. Not only are the collars durable and of good construction; the stitching is also done very well. I would definitely recommend a GoTag if you are looking for something like this.",
      "rating": 5.0,
      "verified": true,
      "author": "websterrjr",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Waste of money, does not clearly display the text- obstruction from the adjuster",
      "text": "This was a waste of my money. Sizing is off as you adjust the size to fit your dog, the cellphone number is blocked by the rectangle part. Find yourself another option. I am so incredibly disappointed. I bet a lot of these reviews are fake or bought.",
      "rating": 1.0,
      "verified": true,
      "author": "Zhao",
      "helpful_votes": 3,
      "publication_date": 20181229
    },
    {
      "title": "Check size carefully",
      "text": "The quality of this embroidered collar is great, no issues. We have a 20lb mini schnauzer so I ordered a small. It's way too big and we had to adjust it so much, the name and number are now hidden under the plastic buckle/adj parts. I wanted to get this same 5/8 collar in XS but the seller replied the XS comes in the 3/8 size, which I already knew and didn't need a reminder, I just assumed they could make a 5/8 collar shorter than what I had but obviously not. Oh well, moving on.",
      "rating": 4.0,
      "verified": true,
      "author": "Prime addict :)",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Excellent collar, be careful of size",
      "text": "These collars may run a bit larger than expected. I ordered this collar, embroidered with my dog's name and my phone number, after another prominent seller of outdoor equipment sent a wildly incorrect collar, incorrectly embroidered. This present collar came quickly, looks very good, and works as it should. I took off a star for size though - my dog's neck is 20 inches, and the \"correct\" size Large collar is actually far too big. I was able to make it work by adjusting it so that part of the name is obscured. It's not perfect, but it will work just fine. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Hansen",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Very thin",
      "text": "First, the positives-the collar came quickly. The stitching on the personalized details is very good. Negative-the collar is extremely thin. Looks weird on a 79 lb dog. I wish it was at least twice as thick and twice as wide in order to look good. It just looks wimpy on my big guy. There is no stretch to the collar, not that there should be but I am addressing it because it was a specific question above in the rate the product features section. Overall I like it, but the proportions look wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "Farmer chick",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "I really like this collar!",
      "text": "Other collars I purchased for my dog required that I put a dog tag on to identify him. There is peace of mind knowing that if my dog gets out, there is a way to indicate my phone number and his name, so our fur baby can be returned to us! I am hoping to later add a follow up when some time has gone by to show the durability of the actual embroidery work (ie can he scratch it off?). I got the black collar with blue print because I wanted it visible if necessary but not the main color seen. It worked well. Hope this helps!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "love the look",
      "text": "i have for years bought collars that had my number and the dogs name on it. this actually saved the life of one of my babies who was being boarded and got out with the collar on and was found by a good person who called and informed me of the situation. what i like alot about this collar is i was able to get the stitching a contrast color to the color that really stands out where some other sites it just black and if your collar is dark you cant read it. not a problem here. would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "ch",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Great collar and does the job",
      "text": "I have to agree with some of the other reviewers. In order for the buckles to not hide any of the information printed then buy the largest size and then you can pull it smaller. Otherwise, some of the name or phone number is hidden. I love that the pet's name and number is printed directly on the collar so nothing is hanging to get lost or jingle. One thing I would like to see is the buckle to be something other than plastic. On our old collar that is what broke.",
      "rating": 4.0,
      "verified": true,
      "author": "bookwormTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Love this collar!",
      "text": "When we ordered this collar, we were between a small and a medium, but since it said it was adjustable, we ordered the medium. When we received it, and adjusted it to fit, the phone number was covered up. We considered returning it, but love the collar and didn't want to wait for a new one. The writing is large enough you can read it from quite a ways away... We had ordered blue with white letters. I just cut off a little from the end and re sewed it. It is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "butch russell",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "The clasp is cheap plastic and broke two weeks after we got it.",
      "text": "I ordered black, I got blue. No the end of the world so I let it go. The clasp broke after less than two weeks of use on a smallish 60 lb dog. I wrote to the seller and asked for a replacement and got no response. Eventually I took it apart, replaced the clasp myself but....way too much hassle. It an $18 dog collar after all....not $10! Customer service is non-existent!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary C. Frances",
      "helpful_votes": 3,
      "publication_date": 20181007
    },
    {
      "title": "Great find!",
      "text": "We have 4 dogs and finding the right collar can be frustrating. This particular one was purchased for our large dog. I ordered the large size, orange collar with neon yellow print. The collar is perfect! Size is easily adjustable, but does not slip while walking. We also use a harness so the leash is attached to harness and collar, works great! The quality of the collar is sturdy, but comfortable. The print is nice size and easy to see and read. Very happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Designing in Texas",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Perfect!  Safer, now that my dog has his name and phone on his collar !",
      "text": "Really liked the fact that Kona's name is stitched into the fabric of the collar! He hated the dandling of identity tags and it is very comfortable and truly adjustable. He's on the small side for a lab but got him the size large because of the width. It's as short as it will go but measures 18 inches which is just what it needs to be . Has a very sturdy clip and is very comfortable on his neck. The one he use to have was narrower and he use to scratch all the time it was on. He doesn't do that any longer with this collar. We are very pleased with our purchase! Thanks :) 🐾🐾",
      "rating": 5.0,
      "verified": true,
      "author": "Gail A",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great quality, fast shipping",
      "text": "This is the 3rd collar I buy from this seller. Unfortunately my puppy outgrew his first one so I had to buy him a bigger one, and although it's wider it is a beautiful as the first. For reference I first bought him the xs and he was 7 lbs at the time and outgrew it at about 20 lbs and is now wearing the small which fits great with room to grow. He is a cavalier king Charles spaniel. My 15 female is still wearing the xsmall but it is almost all the way opened",
      "rating": 5.0,
      "verified": true,
      "author": "Imagin1000",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Nice, but the brand logo needs to be elsewhere",
      "text": "It came fast and the customer service was on point. I had made an error when ordering (ordered black letters on a black collar when I had meant to get white letters). They sent me an email almost immediately and corrected my error. It came on time, was easy to adjust and looks nice. My only complaint is that the brand logo on the collar makes it so that the collar would need to be removed if someone was trying to read the information on the collar. Because of needing to size these to fit my cats, the adjustment buckle covers part of my phone number. Otherwise it's just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "GORGEOUS!!!!!",
      "text": "I have been buying dog tags for quite a bit with two large dogs, they seem to constantly break off. My husband and I recently rescued a dog that had this type of COLLAR on him. We called the # and within 20 min. the dog had been picked up. I thought the COLLAR was genius as again I go through many dog tags. They arrived yesterday and the are GORGEOUS!! I am not kidding, the price is incredible for the quality and the craftsmanship of this collar. No going back to tags for personal information but they still keep their City tags on and are chipped. THANK YOU FOR THIS SERVICE!",
      "rating": 5.0,
      "verified": true,
      "author": "steven",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Solved the never ending lost tag problem",
      "text": "My boys like to remove each other’s collars and take off the tags. We have lost so many collars and sets of tags! We had their names and our number embroidered on them and it seems these keep collars have solved this problem. It’s been about a month and so far they both still have them on! Without the dangling tags they seem to be less fun to play with. My dogs are goldendoodles at 95lbs and 65 lbs, ordered a large and a medium and both fit well.",
      "rating": 5.0,
      "verified": true,
      "author": "Keri W.",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Very nice collar",
      "text": "This is the second GoTags collar that I've purchased and I'm impressed with the durability. My only complaint is that the way the collar is designed there is a plastic piece that covers part of the printing. The whole reason that I buy these collars is to have my phone number easily accessible in the event my dog is lost. If that happened, a person that finds my dog could eventually get the phone number but they would have to move that plastic piece around to read the whole number.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue W",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "A good buy for the money with nice stitching",
      "text": "This was a great buy for the price, I was worried that the stitching wouldn't be good quality or that materials were going to be poor - I was happily surprised on both fronts; excellent materials and good clean stitching. The colors I chose look really nice and I would most definitely buy this again if needed (though I would be pretty pissy if my current one came apart! I feel more peace of mind with our dog's name and a contact number on the collar.",
      "rating": 5.0,
      "verified": true,
      "author": "WASTELAND RAVENTop Contributor: Board Games",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "hidden lettering",
      "text": "As many other reviews have stated, If the collar is adjusted to a smaller size than maximum, the custom lettering will possibly not remain in full view. This could be avoided if \"gotags\" would relocate the lettering, and or their \"gotag\" label. I do not understand why this has not been corrected after so many complaints. Being warned, I put my phone number without my dogs name on the collar. After adjustment, the last digit of the number almost got obscured.",
      "rating": 1.0,
      "verified": true,
      "author": "George Fuller",
      "helpful_votes": 3,
      "publication_date": 20190123
    },
    {
      "title": "Does Not Fit",
      "text": "The first time I ordered the collar it got lost in the mail. They quickly responded and sent me another one. I love the colors and the lettering unfortunately it does not fit it is way too big. I think that the logo is too big which does not allow you to adjust it to a smaller size. Soooo disappointed after the long wait. I would not recommend because if you read the reviews this seems to be a common occurrence.",
      "rating": 1.0,
      "verified": true,
      "author": "Becky G.",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Some of the Embroidery Is Covered Up",
      "text": "I did experience what several other reviewers mentioned. My dog is still pretty small and so we have to make the collar tight. This does obscure some of the embroidery of our phone number because of the black clasp. I really like that she can't mess with it (like she did with a regular ID tag), so I'm hoping that she'll get a little bigger and the numbers will then be visible. It's a well-made product, just a little frustrating that you can't actually see all of the embroidery!",
      "rating": 3.0,
      "verified": true,
      "author": "Erin Konrad",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Durable and helpful phone number on collar",
      "text": "We got this almost a year ago. It has been perfect. Chinook is a Siberian husky Bull terrier mix and has been very difficult to keep a collar on. We have had no trouble with this one. It even saved her at least once. A contractor came in our yard to do an estimate and didn't fasten the gate. Since she is fearful of strangers the large print on her collar made it possible for a neighbor to call me. We just ordered another for our new little doggo.",
      "rating": 5.0,
      "verified": true,
      "author": "Melba",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Good collar, inconvenient customization",
      "text": "I think I'm right there with everyone else. This is a nice collar overall but the brand logo and fixed buckle piece really obscure the actual important information. It's a shame that there isn't better guidance on how they could have included the customization. Something like a picture with a dead zone or spacing around the middle range where the buckle is. I don't know. I had higher hopes for this one and it's a bit of a disappointment",
      "rating": 2.0,
      "verified": true,
      "author": "Nick S",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Good Quality And Value",
      "text": "Overall, the product is exactly as promised. Quite please about the durability, the color of the color and the the text of the name and phone number. I thought the the small would be too small for Lilee who is a German & Aussie Shepherd, and chose the medium. However, the medium is a little big, meaning it works because I could reduce it to the last number of the phone number and it doesn't slip over her head. She weighs about 45 lbs. The collar arrived early. I am pleased and would suggest giving this company a go.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Birch",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Very well made",
      "text": "Earlier this year I bought 2 leather collars for our dogs - same kind of design with their names and my phone # - didn't take long before the leather around their names and phone # started flaking and peeling - then one collar started cracking near a rivot - So I decided to try the GoTags nylon collars - they look great - the embroidered names and numbers are clear and big - easily adjustable - and they seem very strong and sturdy",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Awesome collar",
      "text": "Love the quality love that it’s stitched and not vinyl colors are spot on to pictured list. It washes well which is a plus to any dog owner who has a water dog and mud roller. The stitching is easily read from a distance and great option over noisy name tags. I wish it came in 1.5-2” options since my boy is legitimately a “giant” schnauzer and the appearance of a larger collar looks better but that’s a personal opinion. We’ll be buying more when the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaaaaa",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Screw Up",
      "text": "The results were just as I predicted to myself when the order for the purple collars could not be processed (no purple collars). I cancelled the order and ordered a red collar with black lettering (same names and phone numbers). Lo and behold I got four collars; two with the names in black, two with the names in white. I think I can create new name plates and cover the existing names with those of my other dogs. Fortunately, I can sew; however, it is extra work. Bye-the-bye the collars are great ... good craftsmanship, seem like they will hold up to dachshunds. But you need to work on you customer service and maybe read the e-mails sent to you.",
      "rating": 3.0,
      "verified": true,
      "author": "KMT",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "We got lucky w/ placement of embroidery",
      "text": "The collar I ordered worked perfectly. It is nicely made and fits well. That being said, we got lucky. Our dogs neck size when combined w/ the size of collar (he is on the larger size of what fits this collar) I ordered means that all of the embroidered text appears without being covered by the sizing buckle. If my dog had been on the smaller size that fits the collar, the buckle would have to slide into the text to make the collar fit him right.",
      "rating": 4.0,
      "verified": true,
      "author": "elaY",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Great collar",
      "text": "The amount of time and thought that went into selecting a collar for my dog was extreme. I admit this freely. You want to make a good decision here. My dog, who is awesome, but also disgusting, ate her identifying name medallion. As in not chewed it up, but literally ate it. Ergo, I needed an collar that stayed in the same position (didn't slip in size, giving access to medallions) and that my dog couldn't possibly eat. This collar meets both those needs. It's cute, it's sassy and it gets the job done.",
      "rating": 5.0,
      "verified": true,
      "author": "Skippy McPeanuts",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "I feel better now if my dog gets out of the yard.",
      "text": "It is a great idea, wish I would have thought of it. My dog shys away from his feed bowl when tags hit it, so with this I can take his ID tag off. If we need to show his shot records, I can supply them. However how much I like it, it does not fit my dog as well as I had hoped. In order to get it tight enough, I had to slide the clips between the phone numbers. I wish there were more than what is essentially S/M/L sizes.",
      "rating": 4.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Easy to read, comfortable collar, great quality",
      "text": "Charlie, my golden retriever, needed a new collar and I looked at lots of options on Amazon. This one stood out from the crowd and I am glad I ordered it. We have been using it for several weeks now so I have had a chance to test it out. It washes well (no fading or shrinking). It feels comfortable to my touch. It holds up just fine on walks attached to a leash. Charlie seems to like it. And it seems well made. I got the orane with navy blue writing. It's easy to read and looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney J. Corda",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Fine craftsman—sturdy and strong",
      "text": "My dog is a VERY active Australian Shepard. We hike and he goes deep into woods. I love this collar. I bought a large, probably should have gotten a medium but it’s fine since I don’t like his collars too tight. The name and embroidery are still perfect after months of continuous use. Additionally, there was room left over to write a 2nd # with indelible ink. Great craftsmanship—I will definitely buy this collar again!",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly F. Schlegel",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Recommend",
      "text": "I received this product a day before it was supposed to arrive according to Amazon. I really appreciated that! I also did not anticipate that it would be as thin (width) as it is (see picture). I guess I should have read the product description, but I would definitely purchase this again because the idea of putting my dog's name on the collar is genius. His little ID and tags would fall off frequently and I am just tired of it. He also ran away this past Fourth of July so now I really want to make sure he can be returned home if he runs away again.",
      "rating": 4.0,
      "verified": true,
      "author": "Helen Tam",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Excellent quality but No stretch so order right size and check for typos before submitting order",
      "text": "Quality is very good and customer service I received excellent because when I had a typo for the embroidered phone # and they sent me a replacement anyways with correct info. I put no stretch because collar is adjustable but not stretchy so make sure you get right size as there’s only so much adjusting on collar without covering up embroidery. I expect these collars to last years as the quality is top notch",
      "rating": 5.0,
      "verified": true,
      "author": "candy",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Would give this collar a 5.0 except for one thing . . .",
      "text": "This collar looks great and I'm grateful for the ID in case my dog were to get lost. There's only one drawback (and the reason for 4 stars instead of 5). When I adjust the collar to fit, part of my phone number is obscured. My dog's collar size is 13\" so the extra-small is too small, but the small had to be made considerably smaller than its full size. I hope (and assume) that anyone who found him would recognize the problem and adjust the collar to see the entire phone number. But it would be nice if the collar could be sized to avoid this issue altogether.",
      "rating": 4.0,
      "verified": true,
      "author": "alliecat",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Love it!!",
      "text": "At first I thought this isn’t going to work, because of the logo, the buckle would cover the phone number. So I contacted the seller, they were very prompt and excellent offering suggestions. After reading the email, I began to play with the adjustment of the collar, and it’s perfect!! I love it! I have a shih tzu with a 13” neck and ordered small. You just adjust the strap in the center between the buckle and slider. It took a few try’s but it worked. I’m very happy with this and the seller!",
      "rating": 5.0,
      "verified": true,
      "author": "bertthetroll",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Not too bad, not the best quality though",
      "text": "It works for what I needed it to be but im concerned that over time it might unravel or just not hold up as I need it to. Sizing wise, it’s good. I don’t like that where I needed it to be tightened, it covers the phone number lettering that I requested on there. I don’t use a collar to walk my dog, I use a harness so it’s fine but if I needed to walk her without a harness I wouldn’t want to use the collar.",
      "rating": 3.0,
      "verified": true,
      "author": "Meaghan",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Now I have wasted around $40",
      "text": "On June 29th, I purchased a large (18-24 inches) because my Boston Terrier is 21 inches around the neck. The collar was big enough to fit my Rough Collie's neck. I then purchased a medium and that collar is still loose on his neck! Now I have wasted around $40.00 on 2 collars that NO ONE can use.",
      "rating": 1.0,
      "verified": true,
      "author": "Ann",
      "helpful_votes": 4,
      "publication_date": 20170712
    },
    {
      "title": "Great Product",
      "text": "This is the third collar I've purchased from this seller-- I've bought them in a small, medium, and large as our dog has grown. What I like is that there is no small metal tag that might fall off if my dog is lost. The collars have proven to be durable and well-made. We have a GSP that gets pretty muddy and I just throw his collar in the washer with the jeans. The medium collar fits our 60-pound dog the best, but it's only 3/4\". I like the 1\" wide collar now. It's a little big but I've been able to adjust it down to fit his neck pretty well.",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Collar is way to small/thing.",
      "text": "Hi y purchase this for my labradoodle but the collar is way to thing for him. You could barely see with all his fur. It kinda sucks that it’s so tiny on him but I was in a bind and needed a collar. Will probably shop for another one at a regular store. The item is very cute but not at all a good fit for him.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Vera",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Outstanding company to deal with",
      "text": "This company got the product out in 1/3 the estimated time. Then when contacted because of a Post Office screw up, they got the replacement out immediately. I've not often seen such great customer service. The collar itself is beautiful with vivid colors which is what I was looking for so it could be easily seen. Overall in spite of the Post Office problem it has been a satisfactory purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "James May",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Fast Delivery of a Quality Product",
      "text": "I received this product in less than a week even though I was only promised a 1 to 2 week delivery. That is nice, but the quality of the collar is even nicer. The lettering is easy to read and people at the beach now know the dog's name. The collar is well made of durable materials and it seems like it will last a long time (I have only had it two weeks, so time will tell). As previous reviewer's note, the company logo on the collar is rather large, but the dog's name and phone number are still quite readable. I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Vlbiv",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "No more loud tags",
      "text": "Bought two of these for my two dogs and they look nice. The size I ordered was the same size as their old collars but I can’t make it any tighter without covering up their name/phone number so I’m not 100% happy. Maybe an error measuring on my part or bad design, but it seems it should be adjustable and not cover the name and phone number. I recommend a dark collar with light thread for name/number; really pops.",
      "rating": 4.0,
      "verified": true,
      "author": "AZ shopper",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Great Product. Great Value",
      "text": "This is my third collar from this seller (3 different dogs), so I'm obviously super pleased with the durability and look. More importantly, my phone number is very visible and easy to read -- unlike the small print on tags that can also get worn easily -- in case my dogs happen to get away (one is a Houdini). Plus, no tags to get stuck in the a/c vents! Each purchase was delivered quickly and as expected. Very highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Nunya Bidness",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "really like it",
      "text": "i needed collars for my dogs for when im not with them. My puppy has taking a liking to running away but will go after any small tag i attach to her collar so this was perfect side note, when my puppy had her head out of the window while i was driving, someone random person looked at her collar and yelled her name causing her to want to jump out. my dog is very reactive so i suggest if yours is as well do not put this on them while driving",
      "rating": 5.0,
      "verified": true,
      "author": "Mgrvy",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Just what we were looking for!",
      "text": "We really like these collars - our neighbor's dog has gotten out twice and while she was wearing a collar, her name and number were not on it, nor were there any ID Tags. It got to me - we don't keep collars on our dogs because we hate the sound of the tags always clanging while they play or even move a little bit. So I searched out a product that could ID our dogs, provide a contact # and I can fasten their tags to when we go out or on walks. This first the bill perfectly!! Thank you so much for a high quality product that is specialized just for each customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Treasa",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Great product overall",
      "text": "The stitching is of high quality (no loose threads sticking out, and very even). I ordered the XS size (8-12\"), orange stitching on blue collar. The name (5 characters) + phone number take a good part of the whole collar, and look absolutely beautiful. The clip (snaps shut quite well) and hook are small and well adapted to the size of the collar. I don't have the dog yet (he is only 7 days today!), so cannot tell how it will last in the long run, but I anticipate very easy maintenance and cleaning. My order arrived early on in the time frame that had been mentioned.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurence L.",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Great Collar",
      "text": "Received this collar for my new pup. Got a medium and it was a little big but I adjusted it as small as I could get it and it is working. It can't slip off and he can't get his mouth on it to chew it up. Not sure how big he is going to get so he has plenty of room to grow into this collar. Lettering is big and clear so he won't get lost. Sturdy material and should last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Boyd",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Pretty good dog collar",
      "text": "I have one really passive 12lbs female terrier mix rescue (which I ordered the Small for but I think I should have got the XS) and one 15lbs male terrier mix rescue (which the Small fits great) that likes to try and strangle himself on the leash. Both collars and hardware seem like they're going to last a really long time. I even put them through a hand-wash in the sink and they cleaned up nicely with regular soap and water.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "If they'd just switch the placement of their logo...",
      "text": "As nearly every review has stated, the entire point of the collar is to show the name and number for the dog yet the logo placement forces the information toward the end with the adjustment. If I was to buy this again, I'd size down as she was at the cusp of either size and I'd not have to worry about adjusting it over the wording. Otherwise, this is a nice, well made collar - it's just not convenient when you can't see the number because of the adjustment.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl O",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "great idea and product",
      "text": "I ordered 2 collars (well, 3 in the end) and they turned out great. I only wish the smaller collars were a little thicker. Pay attention to sizing. I put my dogs names on the collars with my phone number- which limited how tight I could make them without covering up the information. I cautiously bought the larger size for each of my dogs (110lbs, 55lbs). The \"size range\" was fine, but I couldn't tighten all the way- so I suggest buying the smaller size if your dog is in between two.",
      "rating": 5.0,
      "verified": true,
      "author": "Bmfiore",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Recommend, but one weakness",
      "text": "Overall, I recommend this collar. It is generally well-made, and the name and number as ordered were accurate. It also arrived more quickly than I expected. My only criticism is that the plastic buckle is not the best quality; it is somewhat thin and is noticeable less sturdy than the $5 collar this replaces (which is otherwise identical, except for the embroidered ID of course). Still, the peace of mind at having the dog's ID so obvious and secure should someone find him is worth a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Petersburgh",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Perfect once altered!",
      "text": "It’s important to say I bought this with full intention of altering it. I have a 72lb dog with a thick neck. I knew a large would be big enough but I knew the sizing buckle would cover the text/numbers. I cut the inner loop, burned the frayed edge with a lighter, removed about two inches, then looped it back through and stitched it. Make sure to stitch in a square and ‘x’ shape so it’s sturdy. The way it sits makes it so no rough edges touch my dog. That part is in between layers. It looks awesome. This is honestly the best looking collar he’s ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Cari Williams",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "So necessary!",
      "text": "I have run across dogs running free and in need. Many lose their tags. Trying to get them back to their homes is often such a difficult challenge. These collars are really important. Just this week, I spent the day taking a dog to a shelter to see if it was chipped. Fortunately it was and I then was able to leave it there for the owners to pick it up. Took hours. A simple collar with a name and phone number would have been far easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Topangawriter",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "no more TAGS!!",
      "text": "Product arrive ahead of schedule We have two dogs, one weighs 35 lbs and the medium collar fits PERFECT with slight adjustment. The other weighs 30 lbs and the medium had to be adjusted so much that its difficult to read the phone number without taking collar off dog. The small would have been to tight and the Mediums is too large hopefully soon there might be an in between size but there errorr mine not this company. They met my expectations, our dogs are constantly losing there tags and this gives us peace of mind. I truly hope we never \"need\" another person to have to use that information.. I will buy this product again . Thank you much",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy",
      "helpful_votes": 0,
      "publication_date": 20180401
    },
    {
      "title": "Bold, Strong, & Helpful",
      "text": "We have a huge black lab that appears to be allergic to metal, so the heavy plastic clasps on this one should help! The collar is strong & a good width. We got the “Large” size & it fits well around his large neck w/out being too tight. Our dog has just started wandering, so having his name & our phone # sewn into the collar will help keep up with him. We have only had the collar a little over a week, so I cannot speak to durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Padgett",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "No more worries if my dog gets away!",
      "text": "Great collar. Only downfall is the last 2 numbers of my phone number are covered because of making the collar smaller. The logo could be placed differently on the collar. Otherwise I am happy with it. I chose the 1\" because I have a golden retriever and the 3/4\" collar, I felt that it would not have looked right. However, the 3/4\" would have shown the entire phone number because I am sure the collar would not have had to be made smaller and the logo would have not affected it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Good product at good price",
      "text": "The collars were exactly as described. They are sturdy and well-embroidered. The name and phone number are easy to read. The colors are excellent. I would not hesitate to order collars from Go Tags again. I do not use these collars for the dogs' leashes. I have other adjustable collars for the leashes, which we put on the dogs only when we're going for walks or other outings. The Go Tag collars are used only for identification, the rabies tag, and the dog license tag.",
      "rating": 5.0,
      "verified": true,
      "author": "Greatdanes",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "I wanted to love these",
      "text": "Like many others say, the clip when adjusted to your pet's neck covers part of the phone number. I ordered a size down hoping that would solve the problem however it didn't. Too expensive to keep trying different sizes and I have 6 dogs. I really wanted to love this product and get one for each of my dogs. Too bad...",
      "rating": 1.0,
      "verified": true,
      "author": "BJ ArruBenn",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Excellent value and product highly recomend",
      "text": "I chose the re in med. size with fluorescent yellow thread.The product came much sooner than expected and I am very pleased with it.I wanted a collar that the I d would jump out and be obvious to someone should my dog become lost and that combo of colors will do it.The quality of the collar itself was as good or better than you will find in any well stocked petstore and the fact that you don't have tags dangling which annoys my dog is great. I will probably order a few more at this price because my dog loves mud and then I can have outdoor and indoor collars.",
      "rating": 5.0,
      "verified": true,
      "author": "Troutbum",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Best training collar....",
      "text": "...that I have ever used on a dog. Once my most recent dog has learned how to walk properly (without pulling) I usually pass the Halti on to another dog lover that wants to train their dog to walk. Halti gently turns your dog's head slightly to the side when he/she runs out of leash, and since they like to lead with their nose, they quickly learn not to pull.",
      "rating": 5.0,
      "verified": true,
      "author": "Phu Cat",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Excellent quality!",
      "text": "I found this collar to wonderful for my girl. The lettering is very professional and bright! My Staffy runs like a mad woman through the woods and gets into all kinds of bushes and dead trees and has never lost her collar. She's an avid swimmer and not an ounce of fading of the colors. The letters are big enough to be able to read if she's ever lost and someone doesn't want to get close enough to her to put a leash on it. Great product, will purchase again should it fade.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Sizing is off for the embroidery",
      "text": "The collars look nice and the clasp works well. I purchased 2 medium collars, which are supposed to be for necks 14-20 inches. My dogs have around 15-16 inch necks, and as you can see from the picture, adjusting the collar to fit blocks part of the phone number from being viewable. (they had the phone number on correctly, I covered up part of the phone number to avoid nuisance phone calls)",
      "rating": 3.0,
      "verified": true,
      "author": "PJF",
      "helpful_votes": 5,
      "publication_date": 20160930
    },
    {
      "title": "Company logo causes part of Ginger's name to be covered up by buckle",
      "text": "I chose the red collar with white lettering. This is a pretty, well made collar. My only gripe is because the company has their logo prominent on the collar any adjustment in fit causes information to be covered by the adjustable buckle. I'm ticked because part of my dogs name is under the buckle. The collar appears to read GIGER instead of GINGER because the N is covered up. It was my choice to keep it rather than be bothered to box it up and return it but others might consider this possibility when choosing which brand of collar to purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Rosa",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "collar runs big",
      "text": "I was sooo excited to get this for my 11lb Yorkie, I custom ordered the size Medium and its TOO BIG. It looks like it can fit a Pitt Bull or Golden Retriever. Definitely do your measurements before you order this. The product is made really well. I would have given this a 5 star if the size was right. In fact I will order again. The sewing/ stiching is done very well and durable. Its not cheap looking at all. I decided to use the too big collar as a luggage tag because it has my phone# on it lol.",
      "rating": 2.0,
      "verified": true,
      "author": "Amanda Martinez",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Love these collars",
      "text": "For years we have used these collars for our dogs. There is no need for dangly tags, they are attractive and well made. The shipping is great and arrives quickly. Have the name and phone number on the collar is great if the dog gets lost. You don't have to try to catch the dog and read the tiny writing on tags. Update: This is a great company to deal with. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "MBMJ",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "LOOKS GREAT ON MY DOGS!",
      "text": "I was concerned when I read the reviews that some of the phone number was covered up when they adjusted the collar. Well, mine is too, but it is not important to me. If someone is trying to locate me, I would assume they would look at the covered part of the number. The collar itself looks well made and sturdy and the lettering is beautiful. I got the black with hot pink lettering. Would definitely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Boo's Mom",
      "helpful_votes": 0,
      "publication_date": 20190416
    }
  ],
  "product_meta": {
    "title": "GoTags Personalized Dog Collar, Custom Embroidered with Pet Name and Phone Number in Blue, Black, Pink, Red and Orange, for Boy and Girl Dogs, 4 Adjustable Sizes, XSmall, Small, Medium, and Large",
    "description": "Our personalized dog collars are made and shipped from the USA in 1-2 business days after an order is placed. Our shop is in Washington state. Don’t choose a collar from China that ships slowly overseas.\n\nDurably made with comfort and function in mind, our long-lasting dog ID collar has: \nsmooth, tapered edges for a comfortable fit \nstrong, non-corrosive stainless steel D-ring for attaching tags and leash \nhigh quality and secure side-release buckle for easy one handed release\n5 collar colors to choose from: Blue, Black, Orange, Pink, and Red \n\nPersonalized Embroidery: \nembroidery is permanently stitched through the collar for strength and long-lasting identification \n15 embroidery thread color options to choose from for your personalized text \npersonalized text (e.g., dog name & phone number) limited to 25 characters maximum, including spaces \ncollars are personalized using all CAPITAL letters for legibility \n\nCollar Sizing and Fit:\nTo determine the correct collar size for your dog, use a soft tape measure or piece of string and wrap it snugly around the base of your dog’s neck – snug enough so that you cannot fit any fingers under the measuring tape. Your pet’s measured neck size must fit within the collar’s adjustable length range. For instance, if your dog’s neck measures 13” inches order an 11”-16” inch adjustable collar. \n4 adjustable collar sizes: \n- XSmall (3/8” inch wide by 8”-12” inches in adjustable length) \n- Small (5/8” inch wide by 11”-16” inches in adjustable length) \n- Medium (3/4” inch wide by 14”-20” inches in adjustable length) \n- Large (1” inch wide by 18”-26” inches in adjustable length) \nplease note: in some cases, when sizing the collar down there is a possibility that the adjustable slider could rest over some of the custom embroidery\n\nEnglish alphabet characters only.",
    "rating": 4.7,
    "feature_bullets": [
      "GREAT IDENTIFICATION FOR YOUR DOG. Our strong nylon dog collar comes personalized with your dog's name and phone number permanently stitched into the collar for long lasting identification. To see all our pet ID products, click on our brand name GOTAGS above the product listing title.",
      "DURABLY MADE WITH COMFORT IN MIND. Made of high-quality nylon webbing, a stainless steel D-ring for tag and leash attachment, and a secure plastic side release buckle for easy one handed quick release. The nylon has smooth, tapered edges for a comfortable fit.",
      "5 COLLAR COLORS and 15 EMBROIDERY THREAD COLOR OPTIONS",
      "AVAILABLE IN 4 ADJUSTABLE SIZES: XSmall (3/8\" wide by 8\"-12\" adjustable length); Small (5/8\" wide by 11\"-16\" adjustable length); Medium (3/4\" wide by 14\"-20\" adjustable length); and Large (1\" inch wide by 18\"-26\" adjustable length).",
      "TO ORDER CLICK CUSTOMIZE NOW and enter: (1) COLLAR COLOR: Blue, Black, Orange, Pink, or Red; (2) THREAD COLOR: White, Black, Navy Blue, Neon Pink, Baby Pink, Sky Blue, Purple, Neon Yellow, Neon Green, Neon Orange, Red, Gold, Turquoise, Cotton Candy, or Jolly Rancher; (3) COLLAR SIZE: XSmall, Small, Medium, or Large; (4) COLLAR TEXT: Pet Name and Phone Number - 25 characters maximum. When finished customizing collar, click Add to Cart."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 1, 2012",
      "Manufacturer": "GoTags",
      "ASIN": "B0075RW2KC",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Pet Supplies",
      "Basic Collars",
      "Collars, Harnesses & Leashes",
      "Collars"
    ],
    "price": 18.95
  }
}