{
  "website_summaries": [
    {
      "verdict": "This martingale-style collar is unique with its tail-feather pattern and is just as sturdy as it is beautiful.",
      "pros": [
        "Constructed of sturdy webbing and high-quality hardware, it withstands rough canine treatment as well as machine washing",
        "Includes two D-rings: one for tags and another for the lead",
        "Reasonably priced",
        "Lifetime warranty – seller will replace it even if it gets chewed up"
      ],
      "cons": [
        "If the dog is out in the sun often, the color can fade after a year",
        "Material can be a bit stiff at first",
        "No buckle – has to be slipped over the dog's head"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not my first Lupine and certainly not my last",
      "text": "I've been sold on Lupine collars for years. They are pretty to look at and of excellent quality. They last longer than any others. They also stand behind them and will replace them if the dog chews them up. Mine have done that a few times and I did replace a couple with the warranty. But when the collar or leash has had a long life and meets its end in a dog's mouth, I just let it go. I highly recommend their collars and leashes.",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Perfect for my Rotweiler",
      "text": "So much nicer than the martingales with the chain. I have always joked that using a leash and collar on my girl was just for show; she could step out of it if she so desired and occasionally at the farmers market I have looked down to find myself holding a leash and collar with no dog attached! Properly adjusted, this collar is loose around her neck, but tightens if she tries her slippery escape trick while I am not paying attention. I believe this should be much safer than a choke collar and more comfortable than a harness. Heck it looks beautiful too! 5 stars with no hesitation.",
      "rating": 5.0,
      "verified": true,
      "author": "Sundog",
      "helpful_votes": 2,
      "publication_date": 20140312
    },
    {
      "title": "Great Collar - the brightest color out there!",
      "text": "Lupine makes the best collars around, and the colors are so vivid and bright. I wash my collars in the washing machine, and they are definitely color-fast and do not lose their luster. The great thing about Lupine is that they guarantee their products for life, even if chewed. I do have a preference for the 1\" collars, as I like the thick and sturdy look of these. Also, if you have a dog that is stubborn or had a narrow head (like a Basset Hound) then the \"combo\" collar is for you! It allows for the collar to be loose on the neck but tighten when you need it most.",
      "rating": 5.0,
      "verified": true,
      "author": "A.C.E.",
      "helpful_votes": 0,
      "publication_date": 20121020
    },
    {
      "title": "Cute collar that stays on my dog",
      "text": "This collar is well made. I love Lupine martingales. My coonhound/pointer mix has to have a martingale style collar or they will slip off. I have tried on other brands but they seemed to pinch too much when set so they would stay around the wide part of her neck. This collar is perfect. It constricts just enough that it won't come off when we are walking but not to choke her.",
      "rating": 5.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Great collars",
      "text": "Lupine collars have been a mainstay since I first discovered them several years ago. They have the best warranty, sturdy products (my 7 year old Lab mix still has her original collar and is in great shape) and the price is right for the level of quality offered. This collar fits my largest dog easily, with plenty of room for expansion. He is a 100+ pound field Lab that looks like a Great Dane wannabe in size--small pony comes to mind.... Love Lupine--thanks for having this product on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Holly E",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "Beautiful and perfect",
      "text": "Colors are beautiful and I love the lifetime warranty. Do be warned if you are getting for a gift it comes in a package that reads LUPINE PETS so you can’t be sneaky about purchasing one :)",
      "rating": 5.0,
      "verified": true,
      "author": "Abby",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Perfect collar and super cute.",
      "text": "I only buy Lupine collars for my dogs. After having several store brand collars break or get chewed up, these are worth the money, even though it isn't all that much more. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennadu",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Well-made and beautiful",
      "text": "So well-made and beautiful; love that it has a textured/woven/embroidered look and not a cheap-looking print. Martingale does the job really well and I’ve hosed my dog down multiple times with this on and it hasn’t rusted whatsoever. I’ve gotten so many compliments on the pattern!",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Highly recommend this.",
      "text": "This collar is as vibrant as the photo. So cute! And this is not ribbon covering the nylon collar - those get destroyed the first couple times my dog gets an itch on her neck. Rather, this design is the. Nylon webbing. And the design is not painted on the nylon either - it is made using different nylon threads - which means the color and design will last. Stitching and metal/plastic are all substantial and strong. Highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Lancaster active family",
      "helpful_votes": 0,
      "publication_date": 20140914
    },
    {
      "title": "Love this collar.",
      "text": "Love this collar. First its very colorful and have had for six months on a very active (ie dirty and wet often) dog, and still looks great. I have one for a pit bull and one for a great dane, and its the only collar I can use to walk them.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele S",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Beautiful colors",
      "text": "Can not beat Lupine for value. The color stays true for a very long time and they wash well without fading. I find it hard to find a collar that is not too feminine for my boy, but this looks great against his black coat",
      "rating": 5.0,
      "verified": true,
      "author": "Snowflakeofme",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Really pretty and well made!",
      "text": "Love this collar. Great quality and colors are bright & vibrant--just like the photo. I first ordered the same item in a smaller size then ordered this larger 1\" size for when our fast-growing puppy reaches her full size and strength. Looks nice with her solid royal blue leash and the Martingale style works quite well for control without tremendous pressure on her throat. NOTE: It is a bit stiff at first, but you can throw it in the washer (I use a mesh laundry bag), and it softens nicely. Comes out beautiful and bright. We get a surprising number of compliments from people when we're out walking.",
      "rating": 5.0,
      "verified": true,
      "author": "A E Millen",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "Exactly as advertised",
      "text": "My dog has been wearing this for about two months now and the colors are as vibrant as the day I got it. Works very well as a martingale collar, great to be able to adjust the size and much better than chain-collar combos which can be slipped out of. Definitely would purchase again, but it doesn't look like I'll need to for a long while, well worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Kris",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Lovely",
      "text": "This is a sturdy nylon collar with a bright cheery print. It is not just a cover, but printed on the nylon. My only complaint is that it is rather stiff so it pulls more against the dogs throat rather than closing easily all around as a Martingale collar should. Since this is a dog that rarely pulls, it isn't too much of a problem. A good, durable and pretty collar.",
      "rating": 4.0,
      "verified": true,
      "author": "P. H.",
      "helpful_votes": 0,
      "publication_date": 20130328
    },
    {
      "title": "Excellent and Attractive Product",
      "text": "Very good quality, works as advertised, very attractive product, looks good on my female dog. Excellent warranty, too. I have a 70# female German Shepard and the large size fits her just fine. I like the separate loop for the dog tags and the leash, nice addition.",
      "rating": 5.0,
      "verified": true,
      "author": "Datindy",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "Fantastic Durable Dog Collars",
      "text": "This is the second Lupine collar I buy my dog and love it as much as the first. My dog constantly decides to go for impromptu \"swims\" and romps in the woods and the collar has held up fantastically. The only reason we got a new one was because it was high time he got a \"big boy\" collar. The colors on this one are extremely rich and vibrant. My mother saw it and decided to get one for her dog as well, it's that pretty. Definitely recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamarah",
      "helpful_votes": 0,
      "publication_date": 20120730
    },
    {
      "title": "High Quality",
      "text": "Love Lupine collars! They are well made and last forever plus I like the variety of colors and designs. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Beachbound",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Beautiful Colors",
      "text": "I bought this collar for a 70 lb. dog. The size and strength seems good, and the colors are absolutely beautiful. The only thing that would prevent me from giving it five stars is that the material seems very stiff. I am hoping that it will soften up with time, because I don't see how this could be that comfortable. I don't know that I would purchase it for a dog any larger than that either, as it is a little on the thin side.",
      "rating": 4.0,
      "verified": true,
      "author": "Celtic Chick",
      "helpful_votes": 3,
      "publication_date": 20121225
    },
    {
      "title": "Beautiful colors that hold up",
      "text": "It's been 6 months & the colors of this collar are as bright & brilliant as they were at purchase. Complimented on the collar again just yesterday. Because of double D rings, I have had to educate folks on where to hook leash - use wrong D ring & lose your dog!",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole Jacobson",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "Best Dog Collar!",
      "text": "These are the only collars that we can use for our Shiba Inu because the breeds head is smaller than their necks and the want to s;ip their collars and take a vacation on their own. They protect from back out and are sturdy. Our first one lasted 5 years and many machine washing. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith A.Slote",
      "helpful_votes": 0,
      "publication_date": 20141020
    },
    {
      "title": "Love these collars!",
      "text": "These are fantastic. None of my dogs go outside the fence without one of these type collars on. There is no way they can pull out of them, so there is no worry about them slipping their collar & running after a tempting squirrel!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Hiller",
      "helpful_votes": 5,
      "publication_date": 20130204
    },
    {
      "title": "Very nice collar, people compliment design often",
      "text": "Very nice collar, people compliment design often. Nice quality. Only criticism would be that they should have sewn the foldover seam to be on the OUTside instead of folding it under, against the skin. Greyhound owners almost exclusively use martingale collars, and greyhounds have such fine thin hair that those pointy edges would be better on the outside instead of rubbing against the neck.",
      "rating": 4.0,
      "verified": true,
      "author": "ELiza",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Poor quality",
      "text": "Poor quality. After a couple months, the black clasp broke and now the collar essentially slips over his head and doesn't stay on. They say there is a guarantee but there is no way to contact them.",
      "rating": 2.0,
      "verified": true,
      "author": "Grandma from CT",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "Five Stars",
      "text": "Best quality, color and functionality. Great price. Looks great on my pup.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Nice collar",
      "text": "This is my dog's permanent collar and I'm very happy with it. The quality is excellent and the colors are bright and beautiful. He can't back out of the collar when something scares him on a walk anymore. I also bought the matching leads and harness and he looks very elegant and stylish.",
      "rating": 5.0,
      "verified": true,
      "author": "Candice",
      "helpful_votes": 0,
      "publication_date": 20150826
    },
    {
      "title": "It's working great and we're very satisfied with Lupine products",
      "text": "Shipped fast, is guaranteed even if chewed and is a martingale type which we couldn't find locally... It's working great and we're very satisfied with Lupine products.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold J. Pydo",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Great no slip",
      "text": "My meathead bulldog needs a no slip collar and this one works great. We bought another for our greyhound and neither one can get out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Lewis",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Best collar ever!",
      "text": "Love the quality and attractive style of this collar. The fact that you can use it as a slip or regular collar is a great feature. I also appreciate the fact that, although very sturdy, it is light weight and comfortable for my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiger8linny",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Great price and love the colors",
      "text": "I have received several compliments on this collar. I love the martingale types of collars. I think this will last, too. My dog has allergies so is scratching at her ears, etc a lot and has destroyed her last 2 collars doing this. I think this one will stand up though.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Well made",
      "text": "I’ve been using their collar and leashes for over 20 years. I’ve never been disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "KR",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "A great collar",
      "text": "The prettiest collar I have ever seen. Very high quality. Design is great as it allows a loose comfortable everyday fit but tightens on a walk when your dog pulls against the leash. I highly recommend Lupine collars. Excellent value for the price",
      "rating": 5.0,
      "verified": true,
      "author": "A. Moore",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "Five Stars",
      "text": "Love the colors!! My red brindle greyhound looks handsome....I like the two clips, easy to adjust..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Happy black labs",
      "text": "These collars are thicker than I expected. I like the separate metal loops for ID tags and leash. Well worth the price. My dog trainer identified the brand of collar at first glance, she spoke very highly of the company. I am very confident in my decision to purchase two of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Midge",
      "helpful_votes": 2,
      "publication_date": 20130527
    },
    {
      "title": "So much prettier in person!!",
      "text": "The pictures don't do this collar justice! It is so vibrant in person. Lupine makes amazing products. I bought 3 - one for each of my dogs and they look so adorable matchting! And I like the colors and pattern can be for male or female!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn in Southbury",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "Bella Loves her new Collar!",
      "text": "This collar is GORGEOUS. It was shipped super fast and made it within 2 days for Christmas. Looks fabulous on our dog. Very sturdy clip. Lots of adjustment room. Hearty D rings for tags. Very VERY nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L. Lapointe",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Lupine's products always comes through for our needs. I ...",
      "text": "Lupine's products always comes through for our needs. I only wished that they have a larger size for our growing puppy to grow into, of the Martingale style collar.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara Cain",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "Very pretty and rich colors",
      "text": "Very pretty and rich colors. I like how you can adjust it so even when it tightens, it is not going to choke your dog, just redirect them. I only use it for training, and would not leave it on her unsupervised.",
      "rating": 4.0,
      "verified": true,
      "author": "Jo R.",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "Love this collar",
      "text": "1. the company has a chew guarantee so you can return it if another dog chews through it. 2. It has 2 loops to attach a leash to 3. Love the martingale feature 4. Tons of pretty patterns",
      "rating": 5.0,
      "verified": true,
      "author": "kmik",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "Great colors and patterns",
      "text": "Great colors and patterns. I have this one on my black cocker spaniel and it show's very well. I saw this same collar on a Boxer that is in the same RV resort we are in and it looks great on that dog as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Schulze",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Very well-made and sturdy. Looks good on my one dog and holds up well to his tugging at the leash.",
      "text": "Very well-made and sturdy. My puppy seems to have no issues with this collar, and it's a breeze to adjust as needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Greg A.",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Beautiful collar",
      "text": "This collar is not only the prettiest one I've ever seen but very well made. Great price and works great! Really like the way it can just be slipped over my dog's head without having to work a clasp.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Safe and easy to use collar",
      "text": "This is a great collar for control with a strong dog. Also, the dog can't back up and get out of it, when the leash is clipped on the proper dee loop.",
      "rating": 5.0,
      "verified": true,
      "author": "Kihea",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "Well made but a little too stiff",
      "text": "Love the colors on this design. I found the collars to be a little too stiff and hope they will soften up. I thought that the design would tighten on the dog faster for better containment but hopefully it will when the webbing softens up. Main theme: stiff.",
      "rating": 3.0,
      "verified": true,
      "author": "animal lover",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "Lupine is fantastic!",
      "text": "This is my first Lupine purchase, and I don't regret the money I spent on this collar. The colors are vibrant and the construction is sturdy. I like the additional D-ring for ID that is separate from the one where the leash can be hooked. The Lupine brand will now be my go-to brand- I already have one picked out for our new puppy!",
      "rating": 5.0,
      "verified": true,
      "author": "E. Cooley",
      "helpful_votes": 0,
      "publication_date": 20130820
    },
    {
      "title": "Five Stars",
      "text": "looks gorgeous on my yellow lab, and works as intended.",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "The colors are great - very vibrant",
      "text": "The colors are great - very vibrant, and the quality of the collar is good too, Out dogs play hard and get dirty, and the collar stands up to washings.",
      "rating": 5.0,
      "verified": true,
      "author": "LD",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Perfect for that girly tomboy pup!!",
      "text": "Love this collar!! So bright and vibrant! My girl is not a pink kinda girl so this is perfect!! Girly and finally no pink!! Strong, love the two D ring loops so you can use as martingale or a regular collar!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna R.",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "I love Lupine collars",
      "text": "I love Lupine collars. I've puchaced other brands, but Lupine last longest and exchange the collar with no hassle if it wears out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Love this, got it for our female dog",
      "text": "Love this, got it for our female dog. Was concerned the material would be stiff, but is fairly soft, and doesn't bother her throat at all. Once we used the collar for a month or so, I ordered the matching leash!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine D Turner",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Five Stars",
      "text": "Great collar! Not too stiff and has not faded like many others I have bought in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah M. Bond",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "No better quality or",
      "text": "Second purchase of a different pattern. No better quality or warranty",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Beautiful Collar!",
      "text": "I purchased this collar for my beautiful red and white Siberian Husky that I am currently fostering. I wanted her to have something as striking as she is to wear, and this collar fit the bill! She knows she looks good, as she prances around when I put it on her! I highly recommend this product, as Lupine products are extremely durable and their guarantees can't be beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlton",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "This coller pervents my rat terriers from backing out of ...",
      "text": "This coller pervents my rat terriers from backing out of the coller when frightened. This was a problem with other collers.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Sherrod",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Lupine always offers a good product.",
      "text": "This collar is very colorful and looks just as shown. I'm still getting used to the Martingale feature but so far I like how the collar works for my dog. I have always liked Lupine products and this one stands up to what I have come to expect from Lupine.",
      "rating": 4.0,
      "verified": true,
      "author": "Charisa Liotta",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "Super training aid",
      "text": "Excellent for a little bit more control when out for walks and peace of mind if you think your dog might slip his/her collar. Matches our Lupine Tail Feathers collar and lead.",
      "rating": 5.0,
      "verified": true,
      "author": "GenoChemist",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "It's beautiful and I'm going to order a matching leash if ...",
      "text": "It's beautiful and I'm going to order a matching leash if I can. Not sure how well it will hold up- we will see. The sizing seems right on target.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol McMorris",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Love!",
      "text": "Love this collar as I do all Lupine products! The collars are brights and it really stands out in all the fur on my Elkhound!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Anne Zilney",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Five Stars",
      "text": "My dog Bella loves showing off her new stylish collar.",
      "rating": 5.0,
      "verified": true,
      "author": "brenda bartkus",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Nice Martingale collar",
      "text": "i have a 60 lb boxer pup and this collar gives me a little extra control and i can leave the tags on. There are a variety of patterns and colors to chose from too.",
      "rating": 4.0,
      "verified": true,
      "author": "Nancy E Bahls",
      "helpful_votes": 0,
      "publication_date": 20130723
    },
    {
      "title": "Colors are very vibrant and it looks great on my Penny (red pitbull)",
      "text": "The collar is a little stiff. But seems very well made. Colors are very vibrant and it looks great on my Penny (red pitbull).",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Armington",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Makes my dog look regal",
      "text": "Love this collar! So bright and beautiful. The colors are very intense. It just makes my dog look new and fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Love Lupine Pet",
      "text": "My dog looks SO handsome in his peacocks! Love Lupine Pet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat John",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Peacock print dog collar.",
      "text": "Well made and looks great on my senior Plott hound!",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Jo",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "Great!",
      "text": "These collars and leashes are great. We have on dog that loves to chew on leashes and our other dog's collar. He has ruined 4 leashes and 1 collar. If you ship the damaged item back, Lupine will ship a new one no charge! THAT is customer service!",
      "rating": 5.0,
      "verified": true,
      "author": "JB2831",
      "helpful_votes": 0,
      "publication_date": 20130627
    },
    {
      "title": "vibrant colors woven into sturdy collar",
      "text": "Unlike many collars with fancy designs that fray easily, the design of this collar is woven into a sturdy collar that will stand up to hard use by a large and active dog. It has one loop for tags and another one for a leash. The martingale loop is large enough for a good handle on the dog but not so large that it droops down and allows a clever dog to remove it. The colors are like the illustration. I will return for this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Crowe",
      "helpful_votes": 0,
      "publication_date": 20131223
    },
    {
      "title": "Vibrant and durable collar!",
      "text": "Tail Feathers is such a pretty and eye-catching pattern. Martingale collar gives added security that the dog won't slip out of it, and the collar is very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Marie",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Absolutely LOVE it. Very well constructed and my dog loves ...",
      "text": "Absolutely LOVE it. Very well constructed and my dog loves it too!",
      "rating": 5.0,
      "verified": true,
      "author": "beachstringer",
      "helpful_votes": 0,
      "publication_date": 20150606
    },
    {
      "title": "Very nice quality",
      "text": "Nice collar. Only issue would be that it's a little stiff and may not be as comfortable as a dog might like.",
      "rating": 5.0,
      "verified": true,
      "author": "DSG",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "Five Stars",
      "text": "Beautiful collar on my black greyhound! Would've bought it in a wider size if available.",
      "rating": 5.0,
      "verified": true,
      "author": "Desperate in Denver",
      "helpful_votes": 0,
      "publication_date": 20140723
    },
    {
      "title": "Five Stars",
      "text": "Looks good and I'm sure it will last a long time just like the old one is.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Quindlen",
      "helpful_votes": 0,
      "publication_date": 20140823
    },
    {
      "title": "collars are great,",
      "text": "I love the lupine products. They really replace for free if the dog eats the leash! The new patterns are so beautiful. McGee is a white basset and he looks spectacular in his peacock feathers!",
      "rating": 5.0,
      "verified": true,
      "author": "Glenda Parks",
      "helpful_votes": 0,
      "publication_date": 20121112
    }
  ],
  "product_meta": {
    "title": "Lupine 1 Inch Tail Feathers Martingale Combo Collar",
    "description": "Size:1\"W; 19-27\" NeckAll Lupine products are proudly built in Conway, New Hampshire and GUARANTEED (Even if Chewed). 1” wide Combo collars are suitable for medium and larger dogs. A limited-slip martingale-style collar for walking and training. It should not be left on an unattended or unleashed dog. Features strong bar-tack stitching and welded D-rings. Slips on over the head. To determine collar size, measure around the middle of the dog’s neck, AND around the widest aspect of the head. Allow an extra 5% to the longer measurement for a comfortable fit. Lupine products are not recommended for tie-out. Machine wash, warm water, mild soap (no bleach or bleach alternative). Air dry.",
    "rating": 4.7,
    "feature_bullets": [
      "Limited-slip martingale action prevents a dog from backing out of its collar",
      "1 Inch wide, appropriate for medium and larger dogs",
      "For leash-walking and training",
      "Proudly built in Conway, New Hampshire",
      "guaranteed (Even if Chewed)"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "13 x 1.25 x 1 inches; 3.04 Ounces",
      "Item model number": "32656",
      "Date First Available": "March 22, 2012",
      "Manufacturer": "Lupine, Inc.",
      "ASIN": "B007TRINAG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Collars",
      "Dogs",
      "Collars, Harnesses & Leashes",
      "Pet Supplies"
    ],
    "price": 16.44
  }
}