{
  "website_summaries": [
    {
      "verdict": "Those looking for an incredibly lightweight inflatable sleeping pad should check out this  popular model.",
      "pros": [
        "Overall 18.5 ounces of weight for lighter design",
        "Constructed with a V-chamber design to keep air movement limited for heightened warmth",
        "Comes with a patch kit"
      ],
      "cons": [
        "Ground must be protected when using for this product, in order to help it last for years"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Didn't work at all.",
      "text": "I thought this product would be good. But it simply did not hold air. I went on a 21 day annual training for the military, blew it up and put it on my cot, but by the end of the night it was completely flat. I ended up just throwing it away. Would not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "Zachary",
      "helpful_votes": 48,
      "publication_date": 20181126
    },
    {
      "title": "Did not last",
      "text": "Purchased 2 of these pads for backpacking trips. I had high hopes after reading all of the positive reviews. Unfortunately we did not try them out before the trip and one of the pads would not stay inflated through the night. It had a slow leak. After requesting a return for 1 pad we went on another trip and the 2nd pad by the 3rd night had the same issue. Returning both.",
      "rating": 1.0,
      "verified": true,
      "author": "R.M.G",
      "helpful_votes": 40,
      "publication_date": 20180828
    },
    {
      "title": "Leak air the second time we took it camping .",
      "text": "Purchased in December 2017 for grand son . Went camping grandson slept on it tonight and we put it away . Went to glacier national Park second time he used it would not hold air . Very disappointed in the quality . Actually ended up using one that we purchased from the Goodwill that was self inflating and it was fine . I see were not the only one that had the problem with using it the second or third time and having the product fail",
      "rating": 1.0,
      "verified": true,
      "author": "JACKIE WILLIAMS",
      "helpful_votes": 24,
      "publication_date": 20180828
    },
    {
      "title": "would be great if it stayed inflated",
      "text": "Brand new, first use... and slowly deflated during the night. had to blow it up three times, and woke up on a deflated cushion in the morning. It seems like a good, lightweight design, and comfortable when inflated, but I think the valve may be faulty.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave R",
      "helpful_votes": 14,
      "publication_date": 20180830
    },
    {
      "title": "When we inflated it at home to test it out we thought it was very comfortable. It was easy to deflate and roll up ...",
      "text": "The valve broke when inflating it for the second time. It literely exploded into several pieces. We were able to duct tape it for the weekend and it kinda held air, but it would be a miserable experience if this happened and it could not be fixed. When we inflated it at home to test it out we thought it was very comfortable. It was easy to deflate and roll up to the size of a coke can. We really wanted to love these camping mats! The valve design could use improvement...or just remember your duct tape.",
      "rating": 1.0,
      "verified": true,
      "author": "bethany",
      "helpful_votes": 21,
      "publication_date": 20160925
    },
    {
      "title": "Flat",
      "text": "Hit or miss I guess. Mine only holds air for an hour. Still trying to find the source of the leak. I might have to submerge the whole mattress to find it. Of course the 30 day return window is closed. Jeffy B got me again.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. M",
      "helpful_votes": 6,
      "publication_date": 20190311
    },
    {
      "title": "Very disappointing! Kept deflating!",
      "text": "Finally got to use it and it's worthless. It kept deflating the entire night. Incredibly uncomfortable. Very disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "Elmo Lover",
      "helpful_votes": 6,
      "publication_date": 20190218
    },
    {
      "title": "Tiny and great for side sleeper",
      "text": "For reference, I've been backpacking with a decades-old self-inflating Kelty ridgeway that probably weighs close to 10 pounds and has to be strapped on the outside of my pack. First, the size/weight is amazing. They're not joking when they compare the packed size to a 1L bottle- if the mouth was wider, it would fit in a Nalgene. I recently took it on an overnight car camping trip, and was very comfortable. I'm a side/stomach sleeper (5'4\" 125lb), and I never woke up because my hip was numb. My back and neck felt totally normal in the morning, just like sleeping in my own bed at home.",
      "rating": 5.0,
      "verified": true,
      "author": "fedx8Top Contributor: Pets",
      "helpful_votes": 20,
      "publication_date": 20170106
    },
    {
      "title": "Wasted $$",
      "text": "Extremely uncomfortable. I understand it's not a bed but tried to get used to it. Now past the return window, so just a waste of $$",
      "rating": 1.0,
      "verified": true,
      "author": "JRH",
      "helpful_votes": 6,
      "publication_date": 20181112
    },
    {
      "title": "Not good if you are somewhere cold. Good if backpacking somewhere warm.",
      "text": "When we flew into the wilderness of Wrangell-St. Elias National Park in August, the weather got very cold at night and this R1 level pad left me shivering all night, I could feel the cold coming up from the ground. But clearly if you are trying to carry less weight in a warmer place, this pad is one of the lightest - just keep in mind the conditions you may find yourself in.",
      "rating": 3.0,
      "verified": true,
      "author": "Alice Friedemann",
      "helpful_votes": 4,
      "publication_date": 20180905
    },
    {
      "title": "Review from a big guy",
      "text": "So I took my new girlfriend out camping and gave her my super comfy Outdoor Vitals sleeping pad and picked up this Klymit pad for myself. I have several of their v-seats and other smaller inflatables that have done well for me. This pad inflated quickly, valve was solid and I didn't have any noticeable air bleed overnight. I am 6.3 and 330lbs and had no issues overnight. The pad was comfortable for me as a side sleeper and long enough to keep my feet off the ground. I would highly recommend this Static V to anyone looking for an inexpensive sleeping pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Shivors",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Defective, leak.",
      "text": "I bought four Klymit Static V sleeping pads for a family camping trip. Two of the pads didn’t stay inflated through the night despite checking the air ports. Because I’m in the military and stationed internationally, shipment takes a longer time. So I’m outside the window of time to return to Amazon. Klymit won’t recognize warranty/repair if purchased through Amazon. I would not purchase this product. They are defective. And not comfortable anyway. If you do purchase these, do it directly from the Klymit website not through Amazon in case you need to return or repair it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tired Camper ",
      "helpful_votes": 5,
      "publication_date": 20181104
    },
    {
      "title": "Never held air over night",
      "text": "Tried it for the first time on a trip and it deflated. Though I screwed up something so I tried again the rest of the trip. It lost air every night. Kept messing with it and never could get it to hold air through a night. It was comfortable until it lost its air.",
      "rating": 1.0,
      "verified": true,
      "author": "SuperBad",
      "helpful_votes": 6,
      "publication_date": 20190119
    },
    {
      "title": "Get a GREEN ONE for its more generous stuff sack",
      "text": "We got 1 red and 1 green. The valves are slightly different, neither of which are the easiest to roll up. Here's the rub - they function pretty much the same, but the stuff sack for the red one is MUCH smaller than for the green one, making packing it up a pain in the butt. If you are good at rolling gear and want everything to be as tiny and tight as possible, then by all means get a red one, but I prefer a generous stuff sack, so I recommend the green one.",
      "rating": 4.0,
      "verified": true,
      "author": "mr. brown shoes",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Great product and durability.",
      "text": "I took this to the boundary waters. On the first day we placed our tent in a lower spot and of course it downpoured the entire day. Everything was drenched and the only thing you could do was stay in your tent. Even though we had a tarp under the tent water still got in. I was very lucky to have this sleeping pad because it kept my high and dry. The bottom of the pad got wet but didn’t allow any water to touch my sleeping bag so I stayed dry the entire day/night. It was super durable and allowed for any position of sleeping whether it be back, side, or stomach. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "mike ",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great all around sleeping pad",
      "text": "My wife and I both got one of these each. We slept on them for a trip that lasted about 4 months and they were great value for the money. However, the valve stopped working on mine so I had to sleep directly on the ground. I was traveling in Asia and had no option to try and make a claim. My wife's is still going strong with no problem. I was disappointed that mine stopped working after about 3 months but I would still recommend it as a great sleeping pad option.",
      "rating": 4.0,
      "verified": true,
      "author": "Billy Thomas",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Poor craftmanship",
      "text": "Would say they work great. Nice .convenient and affortable..... yet I purchased 3 went camping for a week and 2 of the 3 leak.. literally before the end of the night your on the ground. I'm very disappointed bc I had high Hope's after researching and trying to get both a good product and a good deal yet not happy",
      "rating": 1.0,
      "verified": true,
      "author": "angela",
      "helpful_votes": 4,
      "publication_date": 20180821
    },
    {
      "title": "Deflates overnight",
      "text": "First of all, I ordered an orange mat and got a red one, but whatever. The Static V mat deflates by at least half its volume overnight under my 280-lb husband. I purchased a V2 for myself and had no problems, but the valve is different and likely of a better quality. Literally just missed the return window while we were out backpacking with these mats for the first time. I have contacted Klymit through their customer service portal and will attempt to exchange his for a V2. I would suggest spending the extra $ on the V2, or expect to wake up uncomfortable if you're over 250lbs.",
      "rating": 2.0,
      "verified": true,
      "author": "Pam Enlow",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Try out your product right away (sleep on it a full night).",
      "text": "Did not have the opportunity to try this out right away(can't return it) and then took it camping for the first time. The first night, I had woke up once and had to re-inflate, then the next night had to re-inflate twice (see a pattern?). I seem to just be unlucky as my wife had no problems with hers.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam Cox",
      "helpful_votes": 7,
      "publication_date": 20170726
    },
    {
      "title": "Lemon, Deflated Overnight",
      "text": "Bought in Aug 2018 and didn't use for a few months, by which time it was too late to return. (This is why I should only by camping gear from REI). Used on a one-night (thankfully) trip and woke up with it deflated. Used it again for a second time thinking maybe I didn't close the valve correctly, etc. Same result. Complete waste of material and my money. Klymit, if you're there, would it be possible to get a refund or exchange?",
      "rating": 1.0,
      "verified": true,
      "author": "Huy T.",
      "helpful_votes": 4,
      "publication_date": 20190421
    },
    {
      "title": "Great Sleeping Pad - Quick to inflate and deflate",
      "text": "This is a light, cool and efficient sleeping pad. Works great for me while camping (tent or cabin). Its really easy to inflate in <2m and takes about 2-3 mins to inflate and fold up nicely. It worked well for a 200lb - 6'1\" male. The product is a bit on the pricier side but the quality is rock solid. I ended up purchasing an extra one for my older son too. We both really like it. It also comes with an extra piece of material incase there is a hole and apparently the company has a great customer support warranty too. Thank you KLYMIT.",
      "rating": 5.0,
      "verified": true,
      "author": "Rushna",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Small and convenient but not that great",
      "text": "The product is made well and it was easy to inflate and deflate. I am 6'1 and 200lbs and the size was sufficient....however, it didn't work as well as I'd hoped. Better than not having anything under your sleeping bag but my back was sore and very uncomfortable. My wife is very small and she hated it. Probably better off with egg crates or something else.",
      "rating": 3.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Doesn’t hold air.",
      "text": "Product leaked almost all air with the very first use. Was sleeping on the ground after a few hours. I’m 5’7” and 125lbs. I can’t hear the air escaping when it’s full so it has to be a slow leak. Was definitely very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Chae",
      "helpful_votes": 5,
      "publication_date": 20190215
    },
    {
      "title": "Worked as advertised",
      "text": "Took this dry camping to a mountain top that didn't offer a comfortable place to sleep without rocks and within the 8-10 breaths to blow this up was able to have the mattress ready for use. There were multiple 1\" rocks poking up from the ground below and I didn't feel them through the night. At 180lbs / 6 ft I was happy with how this mat worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich M (Washington)",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Game changer for me",
      "text": "For me, sleeping on a pad is the difference between getting quality sleep and getting no sleep when camping. This one is light, packs up easily and small, and is easy to inflate. Have done many desert camping trips with it and no punctures. Does include a little patch kit if you do happen to get one. Great deal, especially at this price point.",
      "rating": 5.0,
      "verified": true,
      "author": "bklyn74",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Fantastic!",
      "text": "Took this on a recent camping trip in Washington, and this is, by far, the absolute BEST sleeping pad I've ever owned! Had an incredible night's sleep with this, and a High-Tec Elevation sleeping bag. This thing packs up small and is light, too. Fits in my camping gear backpack easy. Inflates easy too. Top notch piece of gear.",
      "rating": 5.0,
      "verified": true,
      "author": "FortuneHunter",
      "helpful_votes": 5,
      "publication_date": 20170724
    },
    {
      "title": "Works great and comfortable!",
      "text": "Was looking to reduce gear carry size. Had a self inflating mattress but packed up was 30\" X 8\". Right off of the bat, liked that this was much, much smaller packed up. Used it on a recent campout. While there were no sticks/rocks underneath, the ground wasn't exactly soft due to summer dryness. Inflated it, and didn't feel the ground at all. After the campout, packing it away again was easy to fit in the bag it came with. Will probably get the insulated version for when winter camping. The fifth star would have been if it was self-inflating, but this is definitely a good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Luis",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Seem already came apart",
      "text": "The product seemed durable. Once I let the air out and started to roll up the pad, I noticed already that the seem had already came apart. This was a huge let down. Luckily I tried the product before I went on my trip. Not satisfied.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Morales",
      "helpful_votes": 4,
      "publication_date": 20180815
    },
    {
      "title": "Excellent, unique design. So lightweight and compact!",
      "text": "I bought this in the summer to go backpacking with friends in Virginia. I needed a sleeping pad that wouldn’t break the bank but would be an investment. This was definitely it! It is highly rated on backpacking forums, and I can see why. Expertly designed to roll up tight and small while still provided adequate comfort and elevation from the ground when inflated. I may be dense, but it was a tad tricky to figure out inflating at first, so don’t wait to do it on the trail. I’m very happy with this purchase and look forward to future trips using it!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Miller",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Leaking nosel",
      "text": "I bought 2 of these and they worked well enough. But, the nosel leaked leaving me and my father in the ground by the end of the night. If we could get a trade in that would be great!",
      "rating": 1.0,
      "verified": true,
      "author": "NJMomof4 Customer",
      "helpful_votes": 4,
      "publication_date": 20180813
    },
    {
      "title": "Order in Advance and Test it.",
      "text": "The replacement product functioned as described. I am only giving this three stars because the initial product that we received did not work. The valve was stuck (could not be twisted). I have another model of the same type so I am positive it was a product defect and not user error. Amazon did exchange the product, but due to the short time frame involved I had to pay for expedited shipping. My advice if you are going to order you own would be to get it a least a week in advance and be sure to test it out immediately. If there is an issue the additional time will give you the opportunity to get a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas C.",
      "helpful_votes": 6,
      "publication_date": 20151005
    },
    {
      "title": "Durable, Lightweight, and Comfortable",
      "text": "I’m in the US Army and I spend a significant amount of time in the field / outside. I am generally careful where I put this, but sometimes you can’t see in the middle of the night and I just plop it on top of whatever is there. This product is durable, reliable, lightweight, compact, and most of all, comfortable. It won’t replace your bed, but I have never been able to comfortably sleep on my side while training for almost 9 years now until I used this. One of the best investments that I have made in my military career.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry G.",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Great for backpacking",
      "text": "This sleep pad is easy to inflate/deflate and it great for backpacking. It packs down small, about the size of a tallboy beer. It was surprisingly comfy to sleep on and stayed inflated for two night without having to add any air in the Colorado temperature swings of the day. I was skeptical about the quality due to the price and size but it's great. It is quite long, I'm only 5'2\" and it's much too long for me.",
      "rating": 5.0,
      "verified": true,
      "author": "pcaboicu",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Wonderfully unexpected!",
      "text": "Purchased based on some other people’s review. I have to say I was surprised! I’m 6,4” and weigh plenty. I have used all sorts of mats and items but I wanted to have a compact setup for my overland build out. I was so comfortable on this! I am a big guy and it’s rare I’m comfortable in a tent and bag. Would recommend to anyone! Try it what else you got to loose! You’ll be happy you can feel your arms and shoulders the next morning lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian R",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Perfect even for heavier campers",
      "text": "I'm 250 lbs and a side sleeper. I had doubts as to how well this was going to work for me, but it's fantastic. A big step up from the foam pad I was using before. I sleep fine, I don't have any soreness in the morning, and it's super easy to inflate and deflate. I've slept on it for three trips now and for warmer weather camping it's ideal. If I could make one change it would be that the surface have a rougher texture. I had hoped to be able to stack on a reflective foam pad for when it got really cold, but doing so just results in sliding off.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Light weight sleeping pad",
      "text": "I have used this sleeping pad on multiple overnight hikes and it's extremely light weight and doesn't take up much space at all in your pack. I was able to carry multiple since I had my 3 year old hiking with me for this one. We both slept great on them which is saying something! I normally don't like sleeping pads/ air mattresses as I always wake up with them deflated or never have a good sleep on them at all. These weren't like other sleeping pads or air mattresses, these provided a decent sleep, as decent as you can get outdoors in a tent I suppose!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Neilson",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "High tech, more effective and smaller footprint than old-school mats",
      "text": "Got a couple of these to replace my old-school foam mats, as they took up too much space. These new high tech mats pack down tiny - smaller than a propane bottle, and super lightweight. Once inflated they are also more comfortable than foam. Only takes about a minute to inflate. However, the downside is you have to deal with potential leaks. These seem sturdy enough, but one of them lost some air overnight. I had to exchange it for a new one. So far, no issues. I recommend these (and they are much less expensive than the high end sleeping pads out there), but test them out after purchasing to make sure there are no leaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Y.",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Great for business class flatbed seats",
      "text": "I used it on a flat bed business class airline seat. Awesome. Folds pretty small in the bag on the left side of the photo. It was not difficult to fit back in the bag. Also had to use it on a rock hard mattress in Ghana. Bring a sheet if you're lucky enough to have a business class flat bed because the material isn't comfortable on your skin. The rolled up mattress fits in the \"under the seat\" bag. The sheet and mattress only took up about 25% of that bag. Takes 15 breaths to fill up. Never lost air in the ten times I used it. Letting out the air and rolling it up takes three minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "SunscreenAl",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Burst open under force of breath",
      "text": "I thought it was a great economic choice, but after ~12 trips it began to slowly deflate over night,. I was confused because I use ultralight equipment and I'm am delicate with my camping gear. I suspected the valve was leaking, and so I decided to do a soap bubble test to find the leak source. While forcefully inflating the pad using my breath for a bubble trace, it burst open. Yes, failed under the force of human breath.",
      "rating": 2.0,
      "verified": true,
      "author": "Sangfroidgnome",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "BEWARE: It WILL deflate due to faulty design",
      "text": "This pad is NOT the original. It has a different flawed valve design that leaks. I purchased two of these and they both leaked right away. I'm still a happy user of the true original Klymit pad",
      "rating": 1.0,
      "verified": true,
      "author": "MY3IKA",
      "helpful_votes": 5,
      "publication_date": 20180828
    },
    {
      "title": "Very compact and extremely comfortable sleeping pad",
      "text": "So impressed with this sleeping pad. I blew it up when I received it and it took about 15 to 20 breaths and it was fully inflated. I left it blown up for a few days to see if it would lose air and it was perfectly fine after 2 to 3 days so I was convinced to try it on my next overnight camping trip. I took it with me to elevations high and low, grounds that were soft and hard, cold and warm and this sleeping pad has really proven itself to me!! I would definitely purchase again but I expect this will be lasting me a while. It’s very comfortable and packs super light for backpacking trips",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Miller",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Like sleeping on the ground.",
      "text": "Im a big guy, 6'4\" 250, and this pad did not measure up. They claim it works for side sleepers, which I am, and I can tell you this is not suitable for sleep. I put a big name foam pad underneath too and sleep was stil unattainable. I tried my GFs thicker more expensive inflatable pad from a competitor and it was great. I wish I had that pad and will never take the static v out again.",
      "rating": 3.0,
      "verified": true,
      "author": "John G",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "does not work as advertised",
      "text": "So I have used this product 16 times over the course of the last year and it does not support the weight of a person over 150lb. My kids use them and the sleeping pad works just fine in temps down to the 40 degrees. It does not work for adults in that temperature range. The Klymit Static V is lightweight but again does not support weight over 150lb. I bought this as I am a side sleeper... My hips end up on the ground in an hour's time. We bought two at the same time so this is not just a one product issue. Spend a little extra and get something that will hold up.",
      "rating": 1.0,
      "verified": true,
      "author": "TC",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Sometimes Supplemented",
      "text": "I really like this sleeping pad. I am mostly a side sleeper, and it provides me plenty of cushion while being very easy to blow up. Additionally it takes up little space in my bicycle panniers. On very cold nights (below freezing), I have supplemented the pad with an inexpensive emergency space blanket between it and my sleeping bag and I haven't felt the cold. There is enough room in the stuff bag that is provided to simply roll up both the space blanket and the sleeping pad together. I would certainly recommend this to anyone looking for a lightweight sleeping pad.",
      "rating": 5.0,
      "verified": true,
      "author": "R Hale",
      "helpful_votes": 3,
      "publication_date": 20170511
    },
    {
      "title": "Works Well, great company",
      "text": "We use it for backpacking. It packs down very small and is very lightweight. Not the most comfortable inflatable pad out there, but for the money and its size it is great. The company is also great, the pad was leaking after two trips, out we thought it was from the filler piece, we contacted the company, sent it to them, they fixed it and sent it back all for free. Would recommend buying from Klymit.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Should have got this sooner",
      "text": "I had been using an old thermarest and never slept well on it - hips would always hit the ground and just enough cushion. I finally purchased this and it made all the difference. Sleeping on my side is totally fine now. My only complaint is that it's a bugger to get all the air out and pack back in the bag it comes with. If you had to move out of camp quickly I wouldn't bother putting it back into the bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim R. Galliver",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Noisy",
      "text": "We've used many sleeping pads and pillows. Inflatable or foam. If you're car camping and you have space, its probably better to get a similarly priced foam pad. If you're backpacking often, it's probably better to splurge on something nicer. Pros: • These are a great price for what it is. Cons: • Makes too much noise when you move around on them. This can disrupt everyone's sleeping • Not particularly compact or light relative to more expensive options (duh)",
      "rating": 4.0,
      "verified": true,
      "author": "TV Quest",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Valve could be better",
      "text": "This is my second one of these and the inflation valve style was updated, and the earlier version was much easier to operate. I didn't tighten it enough and when I laid on it the valve blew open and I had to re-inflate at 2am after a day of campfire libations. The next morning it took some fiddling and a lot more hand-strength to close than the previous valve style. So it works great but I never had any issues with the older valve style.",
      "rating": 4.0,
      "verified": true,
      "author": "nathan jacobs",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Dont think I'll keep it",
      "text": "Inflator/deflator mechanism is unique. I found it difficult to place cap on to inflation port after inflated. Sleeping on is fine so long as you are a back sleeper. If you lay on your side, you'll feel the ground below you. I needed a foam pad below this to avoid discomfort",
      "rating": 2.0,
      "verified": true,
      "author": "SFL LIFE",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Didn't even know I was sleeping on a tree root",
      "text": "I bought this for camping because I decided I was done with waking up sore all over. I threw it in my bag and barely noticed the difference weight-wise. I blew it up once we set up our tent (may have taken closer to 20 breaths, but still better than needing a pump) and went to sleep. When I was packing up (super easy to pack!), I realized I had been sleeping directly on top of a tree root and didn't even notice.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190904
    },
    {
      "title": "Leaked AGAIN after using the included patch kit",
      "text": "Ya know, i really REALLY wanted to like this sleeping pad. I used it on a weekend camping trip, friday night worked AWESOME! super comfortable, slept like a rock. Second night i woke up around 4am because my butt started touching the cold ground beneath me. I used some water and soap to find the tiny leak and patched it (not my first rodeo with sleeping pad repairs) the following friday I attempted to use it and the same exact thing happened. needless to say i'll most likely be using an ultralight closed cell foam pad after this whole ordeal.",
      "rating": 2.0,
      "verified": true,
      "author": "Justin Lareau",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Light weight, small, kind of delicate",
      "text": "This pad would get a 5 star overall if they could find a way to make it more puncture resistant. I've patched these quite a few times, so I appreciate that they include a patch with each pad. I always use a tarp under my tent, as well as a blanket under my pad, and they still puncture eventually and leak down over a couple of hours. They're easy to inflate though, and nice and small, so I keep patching them.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Very durable & comfortable, LOVE IT",
      "text": "I recommend this mat to everyone. Great comfort, great durability, a pain to find leaks with all those channels but that is what makes it so comfy. I have hip issues, a side sleeper, and have been sleeping on this almost daily since maybe Nov & it’s now May. I’m nomadic. My dog sleeps/lays on it in the car during the day, and fights me for it at night. I wrap it in a sheet & he finally got it off & made a tiny puncture in March. Patch kit works great.",
      "rating": 5.0,
      "verified": true,
      "author": "FP",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Not for side sleepers beware.",
      "text": "Very light and seems well made. My only issue with it is the ribbing shape. I feel it through my sleeping bag and it drives me nuts. Also for us side sleepers, my arms were going numb all night. (That is from a 160 LBS male.) Update: Really wanted to love this. I saw all of the reviews and was excited. I was contacted by customer service reference this product. They are second to none! They are working will me to remedy my issues! Great job Klymit customer service!",
      "rating": 2.0,
      "verified": true,
      "author": "pressm4n",
      "helpful_votes": 3,
      "publication_date": 20160907
    },
    {
      "title": "love it!",
      "text": "Cheap... check. Lightweight... check. Compact...check. I love this pad of car camping or backpacking. Probably not the most lightweight for the ounce counting type (I am not), but it is great. comfortable for side and belly sleepers like myself. Blows up in 10- 12 full breaths. I like the v shape for side sleeping and the raised edge for keeping me on the pad at night. Quick to deflate and roll up, easily fits back into provided pouch. seems durable enough have not had any holes in it even after I saw my cat lying on it. A great addition to your camping gear if you need a solid pad to sleep on",
      "rating": 5.0,
      "verified": true,
      "author": "Mikey Friedman",
      "helpful_votes": 3,
      "publication_date": 20160603
    },
    {
      "title": "Quality control issues make this a hard pass",
      "text": "You get what you pay for. I've had three of these and the defect rate is 2/3. I'm an average sized person and two of these came with slow leaks that forced me to wake up in the middle of the night to re-inflate the mattress. When fully inflated its pretty comfortable, but depending on your body shape the pattern may have gaps in places like your hips. They are super light and portable, no argument there, but if you're out on multi day hikes you just can't have malfunctions like this.",
      "rating": 2.0,
      "verified": true,
      "author": "ntnm",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "DEFLATION + FRUSTRATION = DISSATISFACTION",
      "text": "First time I used it, it failed and deflated within an hour of laying on it and I weigh 180lb. Will not purchase again. My friend also has the same one and his deflated as well. Won’t buy sleeping pads from this brand ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Saul",
      "helpful_votes": 5,
      "publication_date": 20180227
    },
    {
      "title": "Good quality product.",
      "text": "I have a hard time sleeping on the ground. This gives me a good night sleep and it hasn't lost air at night. I weigh 240 lbs and sometimes sleep on my side. This mat has been working fine for every weekend this entire summer. I could use a bit wider one but I will be backpacking with is soon and I won't miss any extra weight.",
      "rating": 5.0,
      "verified": true,
      "author": "phydeaux",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Does not blow up manually with a couple of puffs",
      "text": "I brought a motorized pump to blow these up and it was relatively old and it died I'm in the middle of blowing up the the mattress. The instructions say that you can blow it up manually with a few puffs and I strongly disagree ended up not being able to blow it up because it just did not blow up in a couple of puffs and you know had a horrible night sleep for the entire camping trip and really regret it the purchase",
      "rating": 1.0,
      "verified": true,
      "author": "sugarmaghippiemama",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "kick ass sleeping pad",
      "text": "i've never owned my own sleeping pad, i've always borrowed from friends - because of that, i've tried quite a few. i bought a klymit because it is the best i've pad i've used. it airs up really quickly, it's surprisingly thick and the material feels very durable. make sure to fold it the same way it comes from the factory and it will be easy to get the air out and back into the bag. i've seen complaints that it's narrow... this is designed for lightweight, solo backpacking what the heck do you expect? i don't know what else you'd want from a sleeping pad, it's one of those rare products that actually delivers.",
      "rating": 5.0,
      "verified": true,
      "author": "Erk",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "I have severe back problems but still love to hike and camp",
      "text": "I have severe back problems but still love to hike and camp. This camp pad is incredible. Weighs next to nothing, blows up easy and feels like I'm on a regular mattress at home. I get seasick on inflatable mattress pads and this one doesn't do that for me. My hips don't hurt when I sleep on my side either. I wish I would have bought more for the whole family when they were on sale. I'm going to keep my eyes open for the next sale. Truly the best camp pad I've ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Highly reccomend.",
      "text": "Some of the best nights sleep I’ve ever had has come from this and the rest of my sleeping kit. It’s compact, light, easy to inflate, durable. I put this in the middle of the sleeping bag and roll it all together as one, with the tarp on the outside to keep it all dry. I’m 5’5” 130lbs and I got the tall one because I like the extra comfort. The half pad would be a little lighter and also super comfy if you’re doing some serious hiking where every oz. counts.",
      "rating": 5.0,
      "verified": true,
      "author": "Hlm",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Comfortable, packs small, & easy to inflate/deflate",
      "text": "It only takes a few breaths to blow this up, and it is very comfortable to lie on. I have back problems, but this is a great option for me. It also deflates down to the original size without finagling, so it fits in the bag it comes with without trouble. The 'lots of pockets of air' design is very well-executed and the ridges haven't come apart with time. I'd recommend this to anyone who wants to haul a comfortable bed around with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Saucier",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Light and convenient; happy with this product.",
      "text": "I've been really happy with this sleep mat. It's light weight and packs up small. It seems pretty durable so far. The grooves let my pack loft quite a bit even beneath me so I stay plenty warm on cool nights. I'll update this review once I get some good cold weather camping in. I'm going to try using this in a hammock next week and I'll update the review based on that experience as well. All in all, I'm quite pleased so far. UPDATE: This sleeping pad was excellent for hammock sleeping. The V shape and deep grooves allows your sleeping bag to loft underneath you allowing you to get the most out of the bag's insulating properties.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Patrick Caldwell",
      "helpful_votes": 0,
      "publication_date": 20160911
    },
    {
      "title": "Does not stay inflated through the night",
      "text": "Used in two different trips 1) 3 night camping(used it on top of a cot) 2) overnight hike (Appalachian trail) . Dissapointed.does not stay inflated through the night.",
      "rating": 1.0,
      "verified": true,
      "author": "Green Light...Go!",
      "helpful_votes": 4,
      "publication_date": 20181009
    },
    {
      "title": "Love, Love, Love. I don't like camping due to the hard ground...",
      "text": "I purchased this for a scout overnight indoors on hard museum floors. How comfy was I?! This is an excellent value, excellent comfort. I am not a small stature person and it kept me very comfortable as a SIDE SLEEPER. I look forward to adding more for the family and going outdoors with it!. Just FYI, I slid it INSIDE my sleeping bag/ with a sheet on it so I would not slide around. I was very pleased with the end result. It only takes a few breaths- very manageable.",
      "rating": 5.0,
      "verified": true,
      "author": "pmp1974",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Didn't last very long.",
      "text": "Pros: comfortable and easy to inflate. Cons: fragile. I slept on this for about 20 nights total. Then it developed a small leak - it was good for about 4 hours before it got too flat to sleep on It was not at all abused - I was careful. It was nice that they included a patch kit, but the adhesive wasn't good enough to seal it, so I threw it away.",
      "rating": 3.0,
      "verified": true,
      "author": "FXDF",
      "helpful_votes": 2,
      "publication_date": 20171029
    },
    {
      "title": "Don’t break the bank on an expensive pad.",
      "text": "What an exhausting search for a comfortable pad that’s light weight and not expensive. Review after review and I even stopped at REI to try out some of the more expensive pads... I was content on taking my chances and settled on this. After a camping weekend and using this I have to say I am happy with my purchase. I was very comfortable and I have no idea why someone would decide to pay 100+ more than this pad. There are cheaper options and I can’t wait to take this on my backpacking trip in September.",
      "rating": 4.0,
      "verified": true,
      "author": "Nautus",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Rolls up very small in your pack",
      "text": "This is the second inflatable pad I’ve bought and the first one was so large, I never used it. This one is great. It takes about ten breaths to inflate, but those are hard breaths, so I would blow into it, close the valve, collect myself and then blow again. 3 day trip and it never needed more air. I would buy again and may buy a second for my wife who still trusts her roll up mat when we camp together.",
      "rating": 5.0,
      "verified": true,
      "author": "S.Davis",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "It's amazing! I felt like I was being cradled by ...",
      "text": "5'03\" and 105lbs. I picked this up because I was tired of sleeping on my family's hardwood when I came over. It's amazing! I felt like I was being cradled by a cloud. The sleeping pad packs down to a ridiculously small size. Maybe a little bigger than a water bottle and much lighter. The material feels sturdy. If you aren't stomping over it while it's inflated or dragging it around, I feel like it'll be dependable and if it isn't, it comes with a patch kit in the pocket of the stuff sack. I'll be updating as soon as I test it out on the trail.",
      "rating": 4.0,
      "verified": true,
      "author": "Priscilla",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Lightweight, easy to carry & use",
      "text": "A friend recommended this brand, & I’m really happy I listened. Even though they are thin, both my husband (180 lbs) and I (125 lbs) were fully supported laying on our backs or sides. We also got the Klymit inflatable pillows too. These will both work well for camping, or an emergency evacuation situation.",
      "rating": 5.0,
      "verified": true,
      "author": "Lina Metz",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Comfortable",
      "text": "Although I have not had the occasion to go camping with this mattress yet, I imagine it will make a great ground pad as comfortable as it can get. However, I have used it on the floor for sleepover kids, and no complaints. It is even comfortable on my old hips on the floor. It can even be used as a fitness pad. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "ertingstrom",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Easy to inflate, very comfortable and convenient",
      "text": "We were moving and used these to sleep in the house after the furniture was moved out. Huge difference in quality of sleep and so lightweight that I was doubtful that it would be comfortable. I was very comfortable and I am not a skinny gurl. Super easy to inflate also it took me less than 5 minutes to set it up. It took me longer to fold it up into its tiny bag to put it away than to inflate it 😂I would definetly purchase theae again if I need more, for now I have 3 for camping!",
      "rating": 5.0,
      "verified": true,
      "author": "KINDNESS",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "I used the pad twice and it deflated during the night",
      "text": "I used the pad twice and it deflated during the night. The pad is okay but it's not easy to deflate and store in the portable bag: the V-shape design has the air trapped in some of the sections. I wish it had a better design and I hope next time I'll use it, it will not loose air on me during the sleep, as it happened the second time I used it.. If I could go back in time I would never buy it and it seems that I cannot return it either.",
      "rating": 2.0,
      "verified": true,
      "author": "RF",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "This is the best sleeping pad I have ever had",
      "text": "This is the best sleeping pad I have ever had. We just got back from a three week trip to Thailand and Laos. My husband suggested I get this because I have a bad back and I am very prone to problems if the bed isn't comfortable. When I got this I was amazed it was so small it easily fit into my suitcase. It inflated quickly and made all the beds, soft and too hard perfectly comfortable. My husband was so impressed he is ordering one to use for motorcycle camping. Also it was very very hot and the pad under the sheet was not hot. I am going to give this pad as a gift this year.",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina",
      "helpful_votes": 2,
      "publication_date": 20160319
    },
    {
      "title": "So far so good",
      "text": "Maybe I'm a bit wimpy, but it took me more than 15 breaths to get it inflated. I'd say it closer to 30 breaths. Still only took a couple minutes though. I tried it out in the backyard and it worked great. It's not squeaky if you toss and turn. It gives enough support that I didn't feel any lumps and it was still fully inflated the next morning. I can't wait to try it for an actual camping weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Green",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Love this sleeping pad",
      "text": "Used my BF’s for camping once and loved it so I bought one of my own for backpacking in Tahoe. Stayed strong for 3 days backpacking and we had a dog with us. Only used once so far but will be using again this weekend. Great if you’re a side sleeper. Keeps heat well for like 45 degrees + but then starts to not perform as well any colder than that.",
      "rating": 4.0,
      "verified": true,
      "author": "Allyson Salvucci",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Does not stay inflated",
      "text": "The first pad that I got worked for one night, and on the second night it deflated. I exchanged it for a new one, and the second one did not even stay inflated for one night. Not a good product.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron Garrido",
      "helpful_votes": 4,
      "publication_date": 20181002
    },
    {
      "title": "Lightweight and easy to inflate!",
      "text": "Super easy to inflate/deflate. It's compact and light and seems very durable. If it had snaps along the edges to fit multiples together it would be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh W.",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Great value & comfort, tricky to roll up",
      "text": "I bought two, one for myself (5’5” 150lb) & one for my boyfriend (5’11” 180lb). We’ve used them for camping a bunch this summer and we love them! Both side sleepers, shoulders and hips stay off the ground and they are very comfortable, although the make a lot of noise (squeaking against tent floor) when you roll around. They don’t lose any air overnight. It takes more than the 10 breaths people talk about to inflate and they are a bit of a pain to roll back into their tiny stuff sacks, but once you get the hang of it the compact size when rolled and comfort when inflated is totally worth it. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "R.R.L.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "GREAT QUALITY",
      "text": "I have used this so many times in the last year and love it. I’m a 6foot tall xl woman with back problems. I have used this in the back seat of my suv, the floor of a friends house, an extra layer on the couch. The bed of my truck during a 48 hour running race. And every time I wake up happy and ache free! It folds so tiny I can pack it for any event. I’m thrilled with the quality",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Good for camping",
      "text": "I bought mine from the Treasure Truck, and it has a different inflation method than the one in the picture. While it's easy to inflate my version, it's a challenge to seal properly (causing it to deflate the first night). The second night it stayed inflated just fine. It folds up very easily and transports in its own travel bag. Still, I'm glad that I made the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Gil Barragan",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Good Sleeping Pad!",
      "text": "These sleeping pads are very lightweight, easy to blow up, and simple to break down. The only reason I rated them 4 stars is because I wouldn't say they're the most comfortable sleeping pad I've ever used. However, I still think that if you set your expectations right for what you're looking for in a sleeping pad, this is by far one of the best buys you can get. It's not expensive and can drastically reduce the amount of weight and space taken up in a backpacking trip.",
      "rating": 4.0,
      "verified": true,
      "author": "Sbrace",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Comfortable for a side sleeper",
      "text": "I bought this to get a more compact sleeping pad for backpacking trips. I upgraded from a thermarest inflatable that rolled up pretty huge (took up 1/3 of my 60L bag). I've taken this on several car camping trips already and it's more comfortable given the V design and so far no holes. It stays inflated throughout the night. It also packs into about the size of a water bottle, which is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "We both love them! Seriously",
      "text": "I bought two - one for me and one for my husband (6'3\"). We both love them! Seriously, I think this may be the best and most comfortable sleeping pad in production. I've taken them on a dozen camping trips (since October 2014) and they are still working perfectly. They're easy to inflate. They hold their air throughout the night (unlike air mattresses). They're easy and quick to deflate and pack away. They're rugged, but they do come with a couple of patches and glue just in case. I don't know about using these in a cold climate without some additional product like a space blanket though (which I think is called \"R value\"). I don't have any complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Agatha Venters",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Packs tiny",
      "text": "This packs really tiny, and works well in summer/indoors situations. Now, this pad may not be the most convenient to sleep on, or the strongest, and it is definitely not the warmest, but this is how you get something that packs so small and light. For that, it's unbeatable, basically. My only complaint is that the valve needs to be handled with care, or it would fall apart (but many much fancier and more expensive mattresses have much suckier valves: therm-a-rest, I'm looking at ya)",
      "rating": 5.0,
      "verified": true,
      "author": "some guy",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Deflates easily",
      "text": "I bought this several months back and have been waiting to camp overnight with it. Basically, my review boils down to the fact that it doesn't stay inflated. By the time I woke up in the morning all of the air leaked out and I was left sleeping on the hard ground. I checked for any signs of leaks thoroughly, but there were none. Just not a good product for sleeping air mattress.",
      "rating": 1.0,
      "verified": true,
      "author": "LinaHugh",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Super light and easy!",
      "text": "This pad is great I am planning on using this quite a bit in my hammock hoping it stands up. Can't beat weight cost bulk and ease of inflation now it just needs to hold up on my trip. Update i have been sleeping on this 60 percent of my days now on the road camping and in my converted camp hhr.. thos thing is awesome!! Inflates and deflates quick and easy no pump required and is thin but my 5\"8 stocky 225 doesn't feel the ground at all and i have had no deflate issues in middle of night! Wualoty product.",
      "rating": 5.0,
      "verified": true,
      "author": "joel a geist",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Much better than foam.",
      "text": "This pad was a heck of a lot better than the half inch foam pads I was used to! Night and day difference. Its not a pillowtop mattress, but if that's what you're looking for, check into a nice hotel instead of camping. Bought 3 pads for 2 people so we'd have a spare in case one leaked, but never had to use it. (Still probably a good idea, judging from other reviews.)",
      "rating": 5.0,
      "verified": true,
      "author": "jolene fischer",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Comfortable and great for backpacking",
      "text": "This sleeping pad is exactly as described. Just used it for the first time over the weekend and was blown away with how comfortable it was! It has more support than other pads so you can have a better nights sleep, unlike others that are as hard as the ground. It packs down very small, its extremely light weight, blows up to the 2.5 inches it claims to be and the material is great quality. There is even a backup patch kit just in case! Very pleased with the product and would highly recommend it if your in the market for a comfortable lightweight sleeping pad.",
      "rating": 5.0,
      "verified": true,
      "author": "happicamper88",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Comfortable and Compact",
      "text": "I go on mission trips to Mexico with my church from time to time. Typically our team stays in group housing with bunk beds. On the last trip, the alleged mattresses on the bunks felt like they were made of granite, and I had great difficulty sleeping. I got this air sleeping pad to bring along on the next trip. I have tried this out at home and it is quite comfortable. When deflated and stored, it is very compact and easily fits in my small duffel bag along with an inflatable pillow. I look forward to trying it out on my next trip.",
      "rating": 5.0,
      "verified": true,
      "author": "Voiceguy",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "Great product! Maybe buy slightly larger though.",
      "text": "I really like the durability and how well it compacts. My r rating isn't the highest but still works well with a high end sleeping bag. I should have gone with the wider or 2 person size. I'm 5'10 190lbs. It handles my weight and is even more comfortable sleeping on my side which is really cool. I just should've gone with the wider version. Hope this review helps! -Reed",
      "rating": 5.0,
      "verified": true,
      "author": "Reed Page",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "MUST HAVE. PLEASE BUY.",
      "text": "THIS IS AN ABSOLUTE MUST HAVE. This is 20x better than any fold up sleeping pad. this thing packs away to the size of a hammock bag. Weighs nothing. STURDY. COMFORTABLE. TOUGH. You could sleep with keys or anything in your pockets and you wouldn't worry about this thing popping. INFLATES IN NO TIME AT ALL. Easy to DEFLATE as well.. I was warm and comfortable every single night in the backcountry of Montana.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddy",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Deflated After 1 Trip",
      "text": "Liked the price. Had a friend who had a Klymit pad who loved it. The one I received worked for about 2 nights backpacking and then would deflate throughout the night. No noticible tears/holes. I can't even patch it because I can't find where to patch. seems like a couple really tiny holes or defective seams. Super disappointed overall. good design, terrible manufacturing and lack of care",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "too much to pay for what it is.",
      "text": "At first I liked it, but after using them in the very hard grand canyon, I realized my hips are too bony and \"fall\" through the cracks. Unless you are pressed for space, stick with a therma rest. $50 is WAY too much to pay for a glorified pool float. It WAS easy to blow up and get the air out of, and it IS small, so if those things are important, then buy it. I let my kids use this and went back to my therma-rest.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 5,
      "publication_date": 20150815
    },
    {
      "title": "Love this",
      "text": "This mat blows up easily with just a few breaths, and it is so comfortable. I have a herniated disc and symphysis pubis dysfunction, and sleeping on the ground is out of the question. Air mattresses go flat, and they are so bulky. Plus, they're impractical for any kind of hike to the campsite. Foam rolls don't give enough support, and they're still a bit bulky. This mat solved all my problems. It is lightweight and compact enough to carry any distance really. Plus, I slept soundly and woke up without much pain (a little bit comes with the territory). Love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Very unimpressive, leaking by 2nd night",
      "text": "Bought 2 of these Both have crapped out on the second night I am not little (210lbs) but not enormous either Both pads were leaking air by the second night of use, had to wake up and reinflate a couple of times each night",
      "rating": 1.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Great For Side Sleeping",
      "text": "This is the third pad I have used while camping, the second I have bought, and it is my favorite so far. The V shape of the pad contoured to my body much better than the flat pads I had used previously. I am 5' 10\" 150lbs, and sleep on my side most of the night. The pad itself is also much smaller when deflated than I expected. You can compress to its smallest size and put it in your pack, or roll it up and strap it to the outside. Either way it is very light, and unobtrusive.",
      "rating": 5.0,
      "verified": true,
      "author": "JRC",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "A comfortable sleeping pad with poor quality control.",
      "text": "A comfortable sleeping pad with poor quality control. One of the 2 pads we purchased has a slow leak - we didn't notice it at first, but after a few hours of sleep, it deflated to the point of being completely useless. The sleeping pad malfunction threw a wrench in our 4 day camping trip.",
      "rating": 1.0,
      "verified": true,
      "author": "cal95",
      "helpful_votes": 4,
      "publication_date": 20180811
    },
    {
      "title": "Compact and comfortable!",
      "text": "I got this on a lightning deal for about $29. I've paid $36 for this on another website and was also very pleased at that price. This is a super compact, lightweight, and comfortable pad. Feels fairly rugged and comes with a patch kit. Apparently this one isn't very insulated. However I've tested this in the winter with a 0° bag in low 20° F temps and I was perfectly warm.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty504",
      "helpful_votes": 0,
      "publication_date": 20190102
    }
  ],
  "product_meta": {
    "title": "KLYMIT STATIC V Sleeping Pad, Lightweight, Outdoor Sleep Comfort Best for Backpacking, Camping, and Hiking, Inflatable Camp Sleep Pad",
    "description": "No one actually sleeps without moving, and it's never fun to wake up on the cold and uncomfortable ground, so get some shuteye on the Klymit Static V Sleeping Pad. It's nearly two feet wide, so you have some room to wiggle, and it features dynamic side rails to keep you from rolling off the pad while you dream about doing the worm. The V-chamber design is optimized to keep you comfortable and warm with the minimum amount of material, too, so the Static V weighs just about one pound and compresses to the size of a water bottle for easy packing.",
    "rating": 4.4,
    "feature_bullets": [
      "SLEEP COMFORT ALL NIGHT: Affordable lightweight camping pad with V-chamber design to limit air movement and heat loss for better support and comfort",
      "EASY-TO-USE valve allows for quick inflation and deflation of the Static V sleeping pad",
      "INCREDIBLY LIGHTWEIGHT: Packed Weight: 18. 6 Ounces; Packed Size: 3 x 8 Inches; Made of durable and rugged 75D polyester fabric",
      "INFLATED SIZE: 72 x 23 x 2. 5 Inches; 10-15 breaths",
      "INCLUDES: Stuff Sack and patch included"
    ],
    "specifications": {
      "Product Dimensions": "9 x 4 x 3 inches; 1.22 Pounds",
      "Item model number": "Klymit",
      "Date First Available": "January 20, 2016",
      "Manufacturer": "Klymit",
      "ASIN": "B0897Y7NXN",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Sleeping Pads",
      "Outdoor Recreation",
      "Self-Inflating Pads",
      "Sports & Outdoors",
      "Sleeping Bags & Camp Bedding",
      "Camping & Hiking"
    ],
    "price": 49.99
  }
}