{
  "website_summaries": [
    {
      "verdict": "One of the better value options for a car monitor that includes a colorful display for easy use.",
      "pros": [
        "Car monitor works straight out of the box once plugged into any OBD2 port",
        "Can be used to set and reset various settings in the car",
        "Monitors important stats"
      ],
      "cons": [
        "The length of the cord is short, making the monitor difficult to use in some cars"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product",
      "text": "I used it to diagnose the problems on my daughters Nissan Maxima. It showed two codes. One for a bad camshaft position sensor and one for a misfire on cylinder 3. I replaced the sensor and the #3 cylinder coil pack. Car runs great now. It's very simple to operate. It's worth every penny. I also bought the five foot extension cable for it. I can stand up outside of the car and run scans.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Hanshaw",
      "helpful_votes": 307,
      "publication_date": 20160917
    },
    {
      "title": "I knew I found a good mechanic.",
      "text": "Has worked well when the check engine light comes on. I had an issue with my coolant thermostat and was able to diagnose it before visiting the mechanic through the web with the code I got and the symptoms I had. I wanted to see if the new mechanic place was going to be honest (I just moved to a new state), so I didn't say anything about it except the check engine light went on. The mechanic told me that was the issue and nothing else, I knew I found a good mechanic.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Rivera",
      "helpful_votes": 131,
      "publication_date": 20170213
    },
    {
      "title": "Does not work for all vehicles",
      "text": "I purchased this unit to read \"check engine\" codes for my 2006 Silverado 2500HD diesel truck. The reader did not work correctly, so I contacted Autel for tech support. I was informed that the AL319 will not work on HD trucks over 1/2ton rating, although they do have a model that does. I did not see that caution called out in the ad. My rating is due to the sellers ad not disclosing this detail.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 59,
      "publication_date": 20181012
    },
    {
      "title": "Cheap product",
      "text": "Buyer beware it worked once for me then it stopped working. If you purchase your talking a chance.",
      "rating": 1.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 21,
      "publication_date": 20180711
    },
    {
      "title": "Absolute Garbage and Nonexistent Support",
      "text": "After doing the update to the device, the display only shows dots instead of words, rendering the device useless. Autel support by chat or phone is not available and no one gets back to you. You can't access customer forums unless you register the device, but you need the serial number to register the device. Guess how you get the serial number... That's right, by accessing the screen on the device! If the screen doesn't work, I can't get the number! This company is run by thieves. Don't waste your time or money on this trash!",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 10,
      "publication_date": 20190416
    },
    {
      "title": "This doesn't work at all!",
      "text": "This is a piece of crap. It did nothing on my 2003 Honda & my 2005 Mercedes though it says on the package \"The Most Advanced Next Generation Code Reader to Diagnose All 1996 & Newer OBD II Compliant Vehicles!\" I waited too long before using it so I was unable to return it. I bought another unit for about $100 that did a fine job.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Simon",
      "helpful_votes": 15,
      "publication_date": 20180413
    },
    {
      "title": "Per Autel, only for vehicles older than 2014 and not updateable!",
      "text": "Out of the box, was trying to ensure I had the latest updates loaded but couldn't get a working downloaded update. Tried to register the unit but the online registration instructions asked for a \"Register Password\" that was supposed to be available on the unit, but it wasn't there next to the unit serial number. Called Autel technical support and was told the AL319 is useable right out of the box, needn't (and CANNOT) be updated, and works only on vehicles 2013 and older - - didn't notice any of that in any of the product description or anywhere in the AL319 user's manual!",
      "rating": 2.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 13,
      "publication_date": 20180720
    },
    {
      "title": "DON'T BUY!!!  Does not show proper codes and ZERO tech support from company!",
      "text": "I plugged this into my 2015 Buick Lacrosse. Received two codes, $7EB and $7EF. Nowhere is there any info on what those codes are and the scanner is worthless for providing any detailed info. I googled the codes and all I found was that there is a longer code, usually beginning with a \"P\" that should be designated by the OBD. Nope...doesn't do that. Checked the live data and still am not getting any meaningful info. Tech support is a joke...saw they were reading my live chat on the site but did not respond (I was just requesting help), and called and no one answered. DON'T WASTE YOUR MONEY!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle E",
      "helpful_votes": 6,
      "publication_date": 20190826
    },
    {
      "title": "All Around Awesome",
      "text": "Excellent small code scanner. I reset BOTH of the annoying check engine lights on my 2011 Wrangler and my wife's 2012 Liberty cause by the gas caps being loose. It not only gives you the code, but it has the description of what the issue is given right under the code and adds \"very small leak\" to indicate the level of seriousness. It also reminds you to turn off the engine in order to reset the check engine light. All around awesome tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 40,
      "publication_date": 20161009
    },
    {
      "title": "Great little scanner",
      "text": "Great little scanner. We are an auto repair shop and got this to complement our larger more comprehensive scanners. It is our go to scanner to get a quick read on codes and data. It includes a fair number of manufacturers and models so it goes beyond simple OBDII scanners. It also very quickly flags whether sufficient Drive Cycle tests have completed for emission inspection purposes.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 20,
      "publication_date": 20170406
    },
    {
      "title": "OK, but not great",
      "text": "It's simple to use and understand. As an OBDII scanner, it works fine. In fact, the user interface is really simple and straightforward. The issues come in with updating. First, OS X users beware - the update tool only runs on Windows. And so far as Windows goes, I can't get the usb to recognize the scanner on either Win 8.1 or Win 10. So the upshot is it's not updatable. I'm likely to return it and try something else that will update as advertised.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190713
    },
    {
      "title": "Should be updated out of the box and more user friendly.",
      "text": "Doesn't work out of the box. Need to update and read the 40 page instructions. Should be updated out of the box and more user friendly.",
      "rating": 2.0,
      "verified": true,
      "author": "SupJoe",
      "helpful_votes": 8,
      "publication_date": 20180622
    },
    {
      "title": "great product",
      "text": "Was looking for a compact reader to keep in my car. This was exactly what i was looking for and at a great price too. I have another autel code reader that is way larger and more expensive so i am familiar with this brand. I like how fast it turns on and reads codes, unlike my other unit. It even has a green checkmark that lights up showing you everything is good. Very simple to use. Easy to configure. Best of all its updateable. The screen is bright and clear so no worries about not being able to read a small screen. Glad I got it",
      "rating": 5.0,
      "verified": true,
      "author": "truitt trash service",
      "helpful_votes": 3,
      "publication_date": 20201009
    },
    {
      "title": "works really well",
      "text": "The instructions were very simple and I followed everything step by step. I first found the plug in my car. I had trouble seeing where the pins were but after using my phones camera, I was able to plug it in correctly. Once it was plugged, It turned on and there were four main options available. They were all very straight forward and you do not need a manual to figure out how to check your car's maintenance features. Just download the codes online from their sight to decipher what they mean. It was very simple to use. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Alphastorm",
      "helpful_votes": 2,
      "publication_date": 20190424
    },
    {
      "title": "good little scanner",
      "text": "scanner works great---a little hard to use at first as instructions are basically non-existent--had to go on-line---Product support stinks--sent 2 e-mails--nothing---called for \"chat\" assistance--worthless---was told to call a phone #----no answer--had to figure out usage by myself----background---I work for a large dealership and \"emission\"10-15 cars /day---I've done a lot of drive cycles in 9 years--so machine is pretty good, the back-up sucks---also ,have been using \"Launch\" products and like them too---I still have some questions about the Autel, but gave up trying for answers",
      "rating": 3.0,
      "verified": true,
      "author": "Charles W. J",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "Works as intended",
      "text": "Works great does what it is supposed to do. I tripped an check engine light after unplugging the mass air flow to clean it, only to forget to plug it back in after cleaning and reinstall. As previous reviewers stated the \"Auto parts\" stores​ will not scan or erase a code even if you know what it is, they state it is a specialty service that only shops or dealers have to erase the codes. Not true",
      "rating": 5.0,
      "verified": true,
      "author": "Cpa",
      "helpful_votes": 6,
      "publication_date": 20170422
    },
    {
      "title": "Saved me Hundreds of dollars",
      "text": "Great code reader. Our 2004 Toyota Sequoia showed check engine light and VSC/Trac warning lights. I bought he reader based on feedback and my son used it to diagnose a bad upstream oxygen sensor. He replaced the sensor and used the code reader to reset the lights. By buying the code reader and installing the oxygen sensor ourselves we saved hundreds of dollars over what a dealer or garage would have charged us. If you work on cars or have any mechanical experience, buy this code reader and save yourselves the high cost of dealer/garage repair costs",
      "rating": 5.0,
      "verified": true,
      "author": "Scubadave",
      "helpful_votes": 3,
      "publication_date": 20171123
    },
    {
      "title": "Be warned",
      "text": "Eh , it certainly erased the codes immediately. But the underlying problem still remains and the state smog computers pick right up on it and your back to square one , In fact they can tell that you got in there because the car computer needs to be driven many miles in order for it to be reset and by that time the check engine light comes on again .. it’s ridiculous. It all smoke n mirrors . Buyer beware . The item itself is very easy and friendly interface .",
      "rating": 1.0,
      "verified": true,
      "author": "SacTownCorey ",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Easy to use for me so will be easier for many people",
      "text": "If you own something like this baby going to dealer for service will definetly save you great money i need it for my engine lite turn on i reset it but something else mademit go back on anyway when i went to my dealer i told them what was going on by the way first time lite on was for gas cap so that alone saved me couple hundred and than telling service you know what need to be done saves you so much money",
      "rating": 5.0,
      "verified": true,
      "author": "Leonardo Garofalo",
      "helpful_votes": 4,
      "publication_date": 20180118
    },
    {
      "title": "No manual included",
      "text": "I bought this unit in response to a recommendation on Youtube that showed the unit packaged with a printed out manual and a disk with software. Neither was included in the package I received. The unit works fine and I would have given it five stars if I had received the printed out manual with it. I did go on-line and downloaded the manual and printed it out (loose 8.5\" x 11\" pages) but this is a poor substitute for a bound and stapled manual which I wish to keep with the unit in the car. I feel cheated. A product is not complete without decent documentation.",
      "rating": 3.0,
      "verified": true,
      "author": "James S.",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Easy and inexpensive",
      "text": "You plug it in, it gives you the error code, you fix whats wrong, save a ton of money, and pass your emissions inspection. I just look the codes up on the internet. The user interface is fairly simple if you take a quick look at the instructions. I'm a rank amateur mechanic and this gizmo has saved me a ton of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Hiker",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "Great Value Code Reader!",
      "text": "I am a DIY car enthusiast who needed a way to read and clear codes on the vehicles I work on. This scanner does exactly that and has performed well so far. The color screen is clear and easy to use. The amount of live data the scanner can read is impressive! The emissions testing function is nice but I haven’t used it since my state doesn’t have emissions testing. Lastly you can’t beat the value you get for this price point!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Rockwell",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "May not work for all?",
      "text": "I bought the device to check on my check engine light coming on repeatedly. I have had it with Dodge so this looked like at least a way to find out what was wrong without having to go through them, at least for a diagnosis. My Dodge is a '99 Dakota 5.2 4WD and the unit never could connect/link to the truck. Tried all the troubleshooting ideas and nothing. Perhaps the truck is too old? Anyway, I'm sure the device will work fine for other vehicles but I'm disappointed and I still don't know what wrong with my truck.",
      "rating": 1.0,
      "verified": true,
      "author": "JOHN W KNOX",
      "helpful_votes": 3,
      "publication_date": 20191124
    },
    {
      "title": "Don't waste your money",
      "text": "Don't waste your money. The thing is not worthless, the live data is pretty cool but it missed some important codes that were tripped. Such as, bad oil sensor and incorrect gear ratio. Just spend an extra 40 or $50 and get a real code reader. Note to seller: The product description sounds like it was written by a 3rd grader. Does anyone proofread this information that is representing your company worldwide?",
      "rating": 2.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 3,
      "publication_date": 20180505
    },
    {
      "title": "Terrible product!!! Screen unreadable after update.",
      "text": "I saw all the positive reviews and thought it might be a good product for it the price. The first thing I did was connected the device to my computer to update. Screen turned on and everything was readable. The problem was after the update I went to use the scanner and what do you know? Just a bunch of scribbles across the screen (picture shown of said scribbles). Thought maybe if I powered it off it would reset itself, but nope same blank screen with scribbles. Returning asap!",
      "rating": 1.0,
      "verified": true,
      "author": "JayTech",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Great tool.",
      "text": "There are cheaper units out there, but I don't know if they provide the same level of utility as this one does. This works like a charm and I feel that it's well worth the extra money spent. I've used it on three different vehicles so far and one of them has been analyzed by a pro and this showed the same results as the pro's equipment did. It doesn't do what professional equipment does, but it does reveal the same basic information the pro equipment does then it's a simple matter to go online to find out what the code actually means. This is a great tool for a do-it-yourselfer.",
      "rating": 5.0,
      "verified": true,
      "author": "Katrael",
      "helpful_votes": 4,
      "publication_date": 20170115
    },
    {
      "title": "Very easy to diagnose engine light faults.",
      "text": "2004 Toyota Tundras' engine light has been coming on recently driving from New Hampshire to Florida. Used the AutoLink AL319 to diagnose the code(miss fire) and cancelled the code. Engine light since then has not gone on. Instead of going to an auto shop and waiting for a tech to read fault codes, I can now do the same in my own driveway, saving time and money for gas driving. I keep the scanner right in my glove compartment just in case a check engine light goes on again.",
      "rating": 5.0,
      "verified": true,
      "author": "big steve",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Works great on my Subaru Forester 2003!",
      "text": "Works great on my Subaru Forester 2003. It’s very common for Subis to run into knock sensors and O2 sensor issues. I need to replace them and I want to know I did it right. I bought all the replacement parts before getting this sensor — but I bought the this for my sanity check. Like I suspected the code shows Knock Sensor and Catalytic converter issue. It is a nifty too to have to troubleshoot why the “Check Engine” light is on. This could mean many reasons and this cheap tool helps narrow it down. I’m going to keep it in my dashboard. Definitely one of the tool I didn’t think I need but I’m glad to now have.",
      "rating": 5.0,
      "verified": true,
      "author": "TheCabinCoder",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "would make a PERFECT GIFT",
      "text": "i had an emergency - Amazon delivered the next day. [it's cheaper on ebay but i was in a hurry] I plugged my new widget into my car's outlet and voila! i had an instant answer and something i could tell my mechanic about without stammering or guessing. This Autel product has a ton more features, but much of the manual's lingo is over my head -- that's why i didn't award 5 stars. It IS good to know it has capabilities that may be handy in the future. I may pack it in my car's emergency kit. i think the AL319 is going to save me a lot of $$$ in the future. Don't hesitate -- get one!",
      "rating": 5.0,
      "verified": true,
      "author": "chacha",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Unable to download/read the manual.",
      "text": "Im returning it because 1) after downloading the \"manual\" on both my smart phone and then my computer, the manual cannot be opened with, Word, WordPerfect, Internet Explorer, MSN, PDF, Excel, Chrome, Google Docs, MS-DOS, all of which I have tried since I received it Thursday. Its also encrypted and will not do me any good. Im not a computer geek just an ordinary person trying to find out what's wrong with my car. 2) So, Im going to buy a book from Auto Zone and search for my answer on You Tube. April Mathis",
      "rating": 1.0,
      "verified": true,
      "author": "April D. Mathis",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "works well",
      "text": "for the price it is hard to beat this scanner. It does everything you need it to do at the amateur skill level for diagnosing auto problems. Before taking your car to a mechanic if you have a check engine light, plug this in and follow the appropriate instructions and you will know if the mechanic is feeding you a line of crap. If your buying a used car, take this with you. Sales people will crap their pants when you take readings. They hate that, hard for them to tell you the car they insist is in good shape and has been serviced , blah blah blah Bad for them....good for you.",
      "rating": 5.0,
      "verified": true,
      "author": "don smith",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "NOT for Audi A4",
      "text": "Misleading description and reviews. Bought this to reset the \"service due\" message for an Audi A4 2013. Once I read through the rather obtuse instruction manual, I connected to the car and looked for an option to reset the service message (or ANY message for that matter). There was absolutely NO ability to see or change any non-diagnostic code data. Complete waste of time. Also, some very odd software update procedures. Really not ready for prime time. Very surprised at all the positive reviews. Buy the Carista OBD2 blue-tooth device; it WORKS like a charm.",
      "rating": 1.0,
      "verified": true,
      "author": "TJD",
      "helpful_votes": 10,
      "publication_date": 20180615
    },
    {
      "title": "Great unit. Shows live info",
      "text": "Great unit. The ability to track your vehicles live info is a big plus. Plugged it in and pulled the codes in a few seconds. This does much more than similarly priced units. Saved me a lot of time. Paid for its self on first use. Update : This unit is awesome. Save me over $400 because all my symptoms pointed to a clogged catalytic converter and the scanner showed misfire in #2 cylinder. $60 for a new Distributorless Coil one hour later purring like a kitten. I’ve already use this on three different cars with no issues the live feed from the car’s computer is a great tool other units at this price don’t have.",
      "rating": 5.0,
      "verified": true,
      "author": "TN Titans ",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Dont buy this one for beginner use",
      "text": "Very dissatisfied with this ''computer diagnostic\" item. Kept getting the same info on every car I put it on, but still no resolution to any of the car issues. Tried tech support with no help. Wish I had just paid more and got one that actually did what I needed. Now it's just another worthless gadget in my drawer.",
      "rating": 1.0,
      "verified": true,
      "author": "angie rowe",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "Worth the money",
      "text": "It pulled the code so I could make the necessary repair and pass my emissions test. It also allows you to reset the trouble codes, which many parts stores won't do. I needed to do a reset because there were 3 possible sensors and 1 solenoid that could have caused the fault I was getting, so I needed to do a reset to see if I replaced the right sensor. Otherwise, I would have to drive around and wait for the OBD to clear the fault. The ODB scanner was definitely worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimi",
      "helpful_votes": 2,
      "publication_date": 20181108
    },
    {
      "title": "Works as advertised!",
      "text": "I bought this scanner to inspect and reset the check engine light on my 2004 Subaru Outback. Turns out it is an emissions code and it comes on due to Subaru's ridiculous emissions standards. The car passes smog just fine. I was tired of taking the car in every time the light came on. I would have just left it on or put a piece of tape over the light, but it shuts off my cruise control. This scanner not only id's the code but resets it quickly and easily. I now get asked by all my friends to check their cars. I really love this tool. Would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "PsychTech PC",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "website to update the device is HORRIBLE",
      "text": "The website will not let me download the update software, but the update ,bin file. Chat doesn't answer and now it looks like I'm stuck with an old version. It will not let me register the device as it says that the serial number doesn't match, but this is the first time I am putting it in. HORRIBLE! If it doesn't work tomorrow I'll look for a refund. How did it get so many good reviews is beyond me!",
      "rating": 2.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Worked like a charm!",
      "text": "Works great with my 2013 Mazda CX-9. Check engine light came on, no indication of what the issue was. Wanted to avoid a trip to the service shop and a diagnostics fee. Ordered this scanner, arrived 2 days later. Plugged in the OBDII scanner into the vehicle, pulled the code \"P0455 Evap System Large Leak Detected\". Did a quick google search and found the common issue was a loose gas cap. Checked the cap and sure enough it wasn't closed tight. Tightened the cap, cleared the code with the scanner. Engine light is gone and were good to go! Well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "NO DRIVE for Windows 8 - can't use it",
      "text": "They don't have a driver for Windows 8, so the software they provide does not recognize that the AL319 is connected to the computer. Therefore you can not update unless you have a computer using Windows 10. Needs to be returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Greyhound Express",
      "helpful_votes": 4,
      "publication_date": 20180713
    },
    {
      "title": "Waste of money. Doesn't work",
      "text": "I have a 2001 Dodge v8. I plug this into the OBD Port turn my key over ran the check engine test and all I got was errors from the machine follow the instructions and I still got errors what a worthless pile of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason ",
      "helpful_votes": 2,
      "publication_date": 20200218
    },
    {
      "title": "WORKS ON MERCEDES BENZ",
      "text": "Easily connected to my 2000 Mercedes SLK230 where my Innova 3030b would not. Looked at other tools in the same price range that did not guarantee would read the OBD for Mercedes vehicles but this one did. Cleared several MILs stored in the car's computer and in addition to giving the error codes also described the problem. The reader has a nice well lit \"multi-colour\" screen and navigating through the various menus is quite easy. Includes a CD with Maxi-Link II software, DTC library, USB drivers for tool updates, etc. Well worth the price I paid for sure.",
      "rating": 4.0,
      "verified": true,
      "author": "Wado",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "A++",
      "text": "Very affordable and effective tool. I was tired of having to go to the parts store and use theirs, of course with a vehicle that was having problems. This scanner tells you, in understandable terms, where the problem is. I have used this on 3 vehicles and it has not led me in the wrong direction yet. Updating the software has shown to be a little challenging because there is no software to use it's all online. I was surprised by the speed of delivery and the cost, I will recommend this product to friends and family.",
      "rating": 4.0,
      "verified": true,
      "author": "LauraMs",
      "helpful_votes": 5,
      "publication_date": 20161130
    },
    {
      "title": "Outdated",
      "text": "I purchased an AL319 in 2016 for application to a 2001 Lexus ES300. Following the user manual process instructions was impossible. Updating the software and diagnostic codes from the tech support web site was fruitless as the AL319 model is outdated - expired Oct 2015 - and not supported. Furthermore the scanner connector is not compatible with my vehicle's diagnostic connector so its useless for me.. I'll return my purchase for full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Nolls",
      "helpful_votes": 5,
      "publication_date": 20160807
    },
    {
      "title": "Value.",
      "text": "Helped me troubleshoot and fix vacuum leaks....... know what it’s reading by looking up abbreviations on google if you don’t know. Easy code scanner, easy code eraser, Remember if you erase codes car will need to be put through drive cycle. Also look up how many faults you can have in sensor readings in your states emissions test. You can set that number in the settings. Driving with unit on will allow you to watch sensor readings from emissions/ rpm/ mph/ fuel trim/ O2 sensors/ Mass airflow/ etc...",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great! Very ease to use.",
      "text": "I am not into cars at all, but have an old car where the catalytic converter code keeps coming up and I wanted to be able to reset it. It is easy and intuitive to use, even for someone who knows almost nothing about cars. I have loaned it to my co-worker who is an expert mechanic, and he is very impressed with it too. I guess it has all these features that are very helpful, more than the one he currently has. He is going to buy one himself, maybe an upgraded version. I highly recommend this scanner.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonbuyer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Poor Support, website isn't helpful and no support...",
      "text": "Firmware update took two hours due to failures to load correctly. Don't expect to get customer support - It doesn't exist... I will not recommend to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim B Sisson",
      "helpful_votes": 5,
      "publication_date": 20180212
    },
    {
      "title": "Must have for any driver",
      "text": "Great value. Easy to read interface. Can clear codes. The only thing that may stump someone who isn’t familiar with code readers is how to get it to turn onThe instructions aren’t that clear. They don’t tell you should you plug it in before or after you put your key in the ignition and then to accessories. I recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Benoit Mizelle",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "Just what I needed for my old car",
      "text": "California is very strict about smog checks :(. After replacing my faulty starter motor, the computer's settings all got reset. But I needed to pass this test soon! I traipsed back to the smog place 3 times before I decided to buy this OBD scanner (my car's service shop recommended it highly). I discovered immediately that my catalytic converter was the culprit. I drove around some more until the scan tool showed all green and then was able to complete the smog test. I really like this little device!",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Maffeo",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "did the job nicely",
      "text": "I got this to see why my Check Engine light had come on. (It went off by itself in the 48 hours that it took to get this device, of course). But, it did exactly what I wanted from it: it showed that there was a code recorded, and gave the code # and description, and showed that everything was currently OK. (It turns out that my gas cap had been leaking a little air, but it resealed correctly when I had refilled the tank). So for the price, this is a great device. Good display, easy operation. I can't give a more extensive evaluation.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Knittel",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Easy to understand and use",
      "text": "I was having problems getting my car to pass the required smog test. Three sensors weren't reading and the smog guy told me to do a drive test. After putting 50 miles on the car still two sensors weren't reading. After 3 trips to the smog place at $17 each, I found this tester and it worked great. I still had to drive more but at least I could check for myself if the sensors were reading, and didn't have to take the car back until I was certain all sensor were operating.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Rogers",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "As advertised",
      "text": "Took about one minute to find that the throttle position sensor on my Ranger was bad. cleared code, replaced sensor save a hundred dollars. A great tool to have in the box. Buy it now, before your vehicle breaks down. Local parts stores don't read codes any longer due to the Corona virus.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Emmett",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Basic yet useful scanner.",
      "text": "This is a basic yet functional scanner. It was able to read the faulty code that activated the check engine light. You will need to lookup that code either online or install the software that comes on the CD with the device. The software will also allow you to keep the device up to date. The scanner could also erase the code from the car's computer, The readiness screen (displayed on the stack image) let me know when the car's computer collected enough information and was ready for emission inspection after erasing the code. I would recommend this scanner to troubleshoot check engine light issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheldon",
      "helpful_votes": 2,
      "publication_date": 20180628
    },
    {
      "title": "Good bang for the buck",
      "text": "After getting burned by trying to buy a different code reader I decided to get this one. It arrived on time and worked as promised. The only knock I would have against it is the default setting has it that with every button pushed there was an annoying chime. However having said that you can go into the main menu and set it to not have that chime and the annoyance goes away.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Simpson",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Excellent for a Rookie",
      "text": "Just changed my spark plugs on 2011 Ford F-150, took on highway for test drive and got check engine warning. Found this tester and got it within couple days. I'm no where close to being a \"mechanic\", however, opened package and immediately plugged in and gave me a \"spark #3\" error, was able to also clear the engine light. Gives realtime information when car is running/driving. Nice color screen. I see it comes with a CD for your computer...haven't gotten that far yet. Overall, very pleased with the product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 31,
      "publication_date": 20160421
    },
    {
      "title": "SIMPLE TO USE, SAVES YOU $$$$!",
      "text": "Simple, easy to use interface. Gives detailed info of identified trouble codes, which you can then use to do research on to find out exact problem with car: saves you +/- $100.00 in \"diagnostic costs\" from a repair shop. Used this to isolate and successfully fix a problem after a Check Engine Light (CEL) went off on my son's Audi - a cracked vacuum line needed to be replaced ($10.00 fix). Best of all, if another problem shows up on any of our other vehicles, this tool will save me another costly \"diagnostic\".",
      "rating": 5.0,
      "verified": true,
      "author": "V. Redd",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Good one...",
      "text": "Being from the 60's car era, I don't understand a lot about the new technology in today's cars. I just bought a 2019 Daytona 392 and started reading up on it. My check engine light went on after I changed the thermostat to a colder rated one (suggested easy mod in the forums). This device took care of it. It just basically erased the code and extinguished the light. I hasn't come on again but users say it might due to the non-OEM thermostat. I'm happy with this gizmo.",
      "rating": 4.0,
      "verified": true,
      "author": "Ray Maramara",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Amazing Product!",
      "text": "This product is amazing! So simple and worked like a charm. I used it for my 2004 Jeep Grand Cherokee and got all the codes I needed. Had the issue fixed and boom my Jeep is running great. I literally just opened the package plugged it into my Jeep and the codes came right up. Highly recommend this product and will purchase again if needed. Great price, great product and super happy customer. A++",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "more like",
      "text": "Id got my hand on this obd 2 reader. The interface is not good the lack of arrows buttons makes it difficult to navigate and it doesnt give you enough info. This is as basic as you can get. I will look at others more affordable obd 2.",
      "rating": 1.0,
      "verified": true,
      "author": "Jackoutofthebox",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Inexpensive, Effective and Reliable",
      "text": "This simple and affordable scan tool does most of what you need for a do-it-yourself car tech. It works quickly, is compact, easy to use and intuitive and will read and clear codes. It doesn't have any in-depth diagnostics or reprogramming functions, but at this price and for most home-use applications, it's perfect. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "CC Rider",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Link error to car",
      "text": "It's not working for me, it says link error and it wont contact to my car or my gf car. I did what it said turn the car off unplug or make sure its conected and try again in 10 seconds. I tried to put the CD in my computer and do a update and see if that worked but I guess it's not compatible with my computer because it says window 7, xp or vista and I have a windows 10. I guess if I cant it to work I'll have to send it back. A real shame I was excited for price and to just own one.",
      "rating": 1.0,
      "verified": true,
      "author": "Kert",
      "helpful_votes": 2,
      "publication_date": 20190324
    },
    {
      "title": "Great value! Easy to use!",
      "text": "Easy to use diagnostic code reader. I have their cheaper version which works great for codes and IM readiness. I bought this one for the Live data because I wanted to see my coolant temperature. I was happy that it does show coolant temperature, you can find it under ECT (engine coolant temperature) and the data is listed in Celsius by default. To change units of measure go to Setup, select Unit of Measure, and change as desired.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chavez",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Like a professional tool - well built, short learning curve.",
      "text": "Has been a time saver on two different cars, enclosed instructions could be a little more user friendly, but a few times using and I found it provides a lot more information than I will ever need. A very professional tool. They even include a usb cable to update the database if ever needed, and their website provides a lot of information regarding advanced operation and describes the many readings available.",
      "rating": 5.0,
      "verified": true,
      "author": "John M. Rollison",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Can't beat the price",
      "text": "Been meaning to get an obd2 scanner for a while now since I do a lot of work on my car myself, have been jumping between a Bluetooth dingle and wired units and I'm glad this is offered on Amazon at such a great price. Unit is great, provides everything needed, has a clear, backlit screen, is updatable.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex S.",
      "helpful_votes": 6,
      "publication_date": 20160811
    },
    {
      "title": "Arrived timely but updating software is confusing",
      "text": "Arrived on time but I am having issues updating the software before using it out of the package. Make sure to update immediately upon arrival to be within return time frame",
      "rating": 3.0,
      "verified": true,
      "author": "Rudy",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Wouldn't buy it again",
      "text": "Haven't been able to use the product. Initial set up requires a software update from the internet, and part of the process is to provide the product serial number which doesn't appear anywhere on the unit or the packaging..",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Earwood",
      "helpful_votes": 2,
      "publication_date": 20200101
    },
    {
      "title": "Diagnosed and cleared a likely gas cap generated engine light code",
      "text": "This cost effective device made it easy to read the code on two mazda 3's my kids have that had engine light on. Each codes were indicative of the common problem when the gas cap is loose. I was able to check the error codes on line and got explanation that it is often a gas cap issue. Cleared the codes and they have not returned. If they return or other engine light issues arise I can not check them before seeking the help of a auto shop.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Moore",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Perfect - much easier than driving down to the autoparts store to get a code read",
      "text": "Perfect - much easier than driving down to the autoparts store to get a code read There are only two butttons - so simple to use. Plug it in, turn on the key and boom - press the button and boom you have the code. Generally it's best to write the code down and do a quick google search, but the tool does tell some minor information about what's up. You can clear codes to reset the fault.",
      "rating": 5.0,
      "verified": true,
      "author": "JP Vic",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Code Reader",
      "text": "Hooked it up to my 1998 Accord it gave me a code for my transmission and it was the proper diagnosis went straight to the shop and the same codes popped up. Got it fixed I highly recommend this device it was on point. You have a happy customer 😁",
      "rating": 5.0,
      "verified": true,
      "author": "Renita",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "Didn't work on my 2015 Volkswagen Tiguan",
      "text": "Despite the packaging saying it works on all foreign and domestic cars, it kept giving me \"Try Again\" message. I tried 3 different times and it still didn't work. I later noticed on YouTube others had the same problem with their cars.",
      "rating": 1.0,
      "verified": true,
      "author": "Dee-Lated",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Great code scanner",
      "text": "Works great as expected, no issues. Among other things it provides access to stored codes, pending codes, monitor status, and live data while your engine is running. It also has a quick access button to quickly verify all systems are running correctly and monitors are ready. This is great if you are in a state where emissions tests are needed. After a code reset this page will show you if you monitors have completed so that you will be able to potentially pass. Power is provided from the connector so no batteries are used.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 3,
      "publication_date": 20160601
    },
    {
      "title": "Terrific",
      "text": "Can’t be beat for the price. Just diagnosed a bad upstream o2 sensor for my neighbor with this using the live data even though his truck wasn’t throwing a code. Watched the im monitors evap, cat and 02 sensors go from red to green while driving the truck Reads all live data such as 02 voltage. Fuel trim intake temp coolant temp tps map pressure closed/open loop etc. great little device",
      "rating": 5.0,
      "verified": true,
      "author": "realist",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "I updated the database pretty easily by downloading the update files to my computer",
      "text": "Does what it's supposed to do! I updated the database pretty easily by downloading the update files to my computer, then updating the scanner. I've used it on my 2001 Toyota Echo and 2003 Nissan Frontier to check engine codes and clear them; much easier than hoping the guys at Auto Zone will pity me and clear the codes themselves. A nice touch is the current parameters option, where it shows what your vehicle is doing real-time, like throttle percent, rpm, etc. This is a definite must-buy for any shade tree mechanic like myself who wants to see what triggers a \"check engine\" light and fix it themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Mister K",
      "helpful_votes": 3,
      "publication_date": 20160309
    },
    {
      "title": "Easy to Use! Will save you money!",
      "text": "For under 40 bucks this tool does the trick. No external power supply...it turns on when connected to the car and when the car is on. Helped me read a Low Fuel Pressure fault code which lead me to google the possible problem. I was able to find the part i needed (Fuel Rail and sensor assembly for 2017 Chrysler Pacifica) which was only 35 bucks. This tool saved me the hassle of taking it to the dealership and saved me money!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Easy and functional",
      "text": "I bought this having no idea what I needed, based on a recommendation to get the least expensive model. Clearly that was good advice. I purchased this because of a need to clear the engine light due to letting the chassis battery get low n my motor home and using the “house battery” to start it. Works like a charm. The codes are clear. Easy for a novice to understand.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter P.",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Works well, saved me a mechanics trip",
      "text": "Bought this after being charged like $140 at mechanic who had to do a smoke test or something to find a (very small) leak as the sensor indicated. he found nothing and cleared the code, then a month or two later it pops up again and this time it's the same damn code but now I had bought this tool to tell me. So i just saved $$$ cause of this. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Z1.amzn",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "works great for checkin codes",
      "text": "I've used a few OBD2 readers before and have tried some of the wireless ones. Those may seem to be good but I seldom want to leave one plugged into the car while I drive around. This Autel code reader had a nice simple interface and it's pretty straight forward to setup and use. You plug it in, scan for codes, and look for what it means. Overall, I think this is a great OBD2 code reader.",
      "rating": 5.0,
      "verified": true,
      "author": "Consumerist",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Not worth it",
      "text": "Not what I expected and doesn't clear the codes find a better one !!!",
      "rating": 1.0,
      "verified": true,
      "author": "D.H.",
      "helpful_votes": 5,
      "publication_date": 20180507
    },
    {
      "title": "Worked for my motorcycle!",
      "text": "Worked perfectly. I have a 2018 YZF-R1. Replaced the front wheel but I put it on backwards. Needless to say the electronics were not picking up the speed sensor so it threw an abs and check engine light. On ‘17 and newer R1 they eliminated the ability to access the diag mode from the menu. I hooked this up with the 4 pin Yamaha adapter and easily read and cleared the code in minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "A perfect tool for the shade tree mechanic!",
      "text": "This is a life saver for those of you out there looking to diagnose trouble codes when that light comes on on your dash. Gives you far more information than devices costing twice of not three times as much as this. The only thing I would suggest when buying this device is to go to their website and download the update and update the device. It is quick, easy and free and is done with the included cable. Very satisfied with this device!",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Kelly",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Dead simple, get your cars detailed error code",
      "text": "I used this to debug a light on my 2015 Honda CR-V. The ODB port is located on the drivers side under the steering wheel to the right, it took me a bit to find that but once the device is connected and you go through the menu all of the error information is displayed on the screen. I actually had a bluetooth ODB reader but I can't get it to pair with my phone anymore so I think its actually better to get an all-in-one device now.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon412",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "This would be great to have if you’re buying a used car from ...",
      "text": "No more going to the mechanic to clear codes since I’m my own mechanic! This lovely gadget will tell me weather my car will pass inspection before I take it in. This would be great to have if you’re buying a used car from someone you don’t know. It tells you what codes your engine has thrown so you know what’s wrong. And once you have fixed the issue, you can clear the code (s)! And if you don’t feel comfortable fixing whatever the code says it is, then you can take it to the mechanic. All for this low price. I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Beaut",
      "text": "It really is a little beaut, super easy to use and durable as heck. Love it! Needed it to diagnose a code, because unlike this product, Hyundai builds trash quality cars that fall apart two months after the warranty runs out. But don’t worry, you can buy this amazing tool that will help you pinpoint the many ailments your vehicle may have and then you can fix them! Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Saintfu",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Better be able to figure out how to use it! Not",
      "text": "Can not understand the instructions from the start. Should not have to scan to get to the web site. Then when you get there is not a product list never got past that. Make the instructions so anyone without use knowledge can use the damn thing",
      "rating": 1.0,
      "verified": true,
      "author": "Marlene",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Sometimes it's mechanical",
      "text": "If your engine light is not on it will not find an error code. Sometimes the error code you are getting isn't exactly the problem and you should still see a mechanic. I have used this on early model Honda's and Toyota's.",
      "rating": 5.0,
      "verified": true,
      "author": "Jhess Curtis",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Buy this, you don’t need the $100 one!!!",
      "text": "Works great! I almost bought the $100 Bluetooth scanner, but this is all I really needed. To be honest it does even more than I need. -it gives you the code, so you can look it up and find out what’s wrong. -it clears the codes. -it can give you live readings, on some sensors so that you can diagnose exactly where a potential problem could be.",
      "rating": 5.0,
      "verified": true,
      "author": "JoshuaM",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Vacuum leak was visually found in an elbow and easily replaced. This tool is powered by the OBD2 ...",
      "text": "Ford expedition trouble. This little tool pulled both codes on vehicle. Reset the sensors. Cleared the Engine light. Codes were lean engine bank 1 and 2. Vacuum leak was visually found in an elbow and easily replaced. This tool is powered by the OBD2 port which means no dead battery. This tool was the cheapest best made on I found that actually CLEARED codes instead of just reading them and then you have to take it somewhere to get it cleared. Got it on PRIME DAY for a song and it was worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Regan",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Used on Honda Accord 1998",
      "text": "My car is old and tired, or so I thought. My favorite Honda mechanic moved to Arizona after working on my Honda’s for more than ten years. So I bought this when my car was running terrible. Turned out to need a new MAP sensor which I bought for $10.00 and replaced myself. Unbelievable difference in performance, like a whole different car. Best vehicle investment I have ever made was this gadget. Highly recommend buying one and plugging in to get a quick scan before going to any mechanic (except my favorite one in Arizon)",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Harley",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Nice and simple way of making sure you don’t get ...",
      "text": "Nice and simple way of making sure you don’t get ripped off. Had 8 plugs and coils replaced on one of my fleet trucks. Got it back running horribly still. Plugged this in and it showed misfires on 4 of the 8 they replaced! Was able to get on my mechanics butt with more info than just a “something isn’t working right” statement. I wasn’t going to let them get away with that. Great little tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Z",
      "helpful_votes": 3,
      "publication_date": 20180320
    },
    {
      "title": "Great tool air duct tape n super glue gotta have get one",
      "text": "Used this product at work for 3-4 years 5-6 times a week saw this listed super easy tool that works great reading codes clearing codes and ready to state inspect check mark great tool very reliable plus it does read live data pending codes and stored codes just rember screen size is like bussiness card size ten stars👍",
      "rating": 5.0,
      "verified": true,
      "author": "Windy city now durham nc",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Doesn't Work with 1999 Jeep TJ",
      "text": "It wouldn't communicate with my 1999 Jeep TJ, so it was no use at all. Am going to buy a Foxwell, and will hopefully have better luck. It did work on a Ford truck, so I don't think it is defective - it just doesn't work with the vehicle that I need it to work on. So of no use at all, and a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "StanF",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Super easy to use.",
      "text": "Very pleased with the code scanner. Easy to use and the problem was identified as a temp sensor. Last fall my check engine light came on. A local shop identified it as a MAPS sensor and charged me $440 to screw in a $40 part. This time I purchased your code scanner, bought the part and saved over $300. Replaced other parts while I was under the hood and figure I saved $1000 total. Best day ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Ranger",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "works, kinda.  updates impossible!",
      "text": "Worked fine out of the box for my 2006 Dodge, but refused to \"connect\" to my wife's 2005 Mercedes. I just spent an hour trying to download software updates, can't find the @#$% files that it refers me to select. I'm pretty computer savvy, but the manual/support for this is terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200628
    },
    {
      "title": "Helped me save hundreds.",
      "text": "Diagnosis of a misfire gave me the thing to search the internet for common problems with my car. Upon asking an expert about what price point to purchase (they go from $20 up to more than a thousand, he reported that I should stick with a simple one and then google the results for my car. That sound advice gave me a code that was easily researched and repaired using utube video as a guide and I have saved hundreds already.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven A. West",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Must have device",
      "text": "I had a engine check light oon my car, mentioned it to my friend at his house. And he pulls out one of your devices. I read my car but did not clear the code. I took a picture of the device. Before the end of the day I had ordered my own device. It was here the next day. This time I read it and cleared it, 3 weeks the error has not returned. This has already saved me 300-400 dollars. False emissions leak.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Microbe",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Easy to Use",
      "text": "What a great investment. I have two older cars that are getting up there in years so when I start having an issue, I hook up the scanner and within minutes I have a code for what's ailing my vehicle. the Autolink is easy to connect and pretty easy to navigate. I may not know much about cars, but having a code to reference online when I search for auto issues makes my life easier. Great tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Lord Humongous",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Handy Diagnostic Tool",
      "text": "My check engine light activated during a brief period of extremely cold temperatures. The Autel ODB2 scanner diagnosed the problem, providing the code as well as a brief explanation. In this case, it was merely \"Coolant Temperature Below Thermostat Regulating Temperature,\" a problem that solved itself when our weather returned to normal. Glad I did not waste time and money taking my car to the shop for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip P. Giunta",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Autel does what it is supposed to do.",
      "text": "Pros: Easy to hook up. Easy to clear fault / check engine light Easy to use to read fault codes. Cons: It could use an application to enter multiple codes and come up with the most likely problem, or a list of potential problems. You have to search the internet for possible issues and there doesn't appear to be list of related codes with potential issues in order of most likely to least likely that I could locate.",
      "rating": 5.0,
      "verified": true,
      "author": "Y",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Easy as 1-2-3",
      "text": "Not even a mechanic and this thing is beginner friendly. Although I wouldn't consider myself in need of a book called \"cars for dummies\" since I know my way around an engine I was still worried this was going to be an engineer's play thing.... it wasn't and I'm thankful for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Dezarn",
      "helpful_votes": 5,
      "publication_date": 20160825
    },
    {
      "title": "Great tool for the lay person",
      "text": "A great tool that is easy to use and as a lay person, helped me understand the need for work on an older car I have. I was able to leave a garage and go to another one since I already knew what was essentially wrong with this scanner. Helps keeps everyone honest, I highly recommend it even if you aren't a do it yourselfer, it may save you bigger money in the end.",
      "rating": 5.0,
      "verified": true,
      "author": "JR Chicago",
      "helpful_votes": 5,
      "publication_date": 20160307
    },
    {
      "title": "Affordable,  feature rich scanner",
      "text": "Fairly easy to use and loaded with lots of features. Easy to read screen and compatibility with ISO 9141-2 protocol. A lot of similar, but cheaper scanners will not communicate with ISO 9141-2.",
      "rating": 5.0,
      "verified": true,
      "author": "MacGyver Jr.Top Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20190922
    }
  ],
  "product_meta": {
    "title": "Autel AutoLink AL319 OBD2 Scanner Automotive Engine Fault Code Reader CAN Scan Tool",
    "rating": 4.6,
    "feature_bullets": [
      "For End User & DIYERS: This error code reader is ‘plug and play’ and comes with an easy interface. Even if you’re not familiar with vehicle repair, you can quickly take control of this code reader, and get the information you want",
      "Turn Off CEL: This car diagnostic tool supports reading DTCs, displaying Live Data, Freeze Frame & I/M Readiness etc to figure out the root cause of the Check Engine Light (CEL) and turning it off to help you detect any potential problems",
      "Patent Guarantee: AL319 Code Reader features a patented One-Click I/M Readiness Key for quick State Emissions readiness check and drive cycle verification. No batteries are needed as it will get the power directly from the OBDII Data Link Connector in your vehicle",
      "User-Friendly Design: This check engine code reader equipped with TFT color display which shows DTC definitions more clearly, built-in speaker provide audible indication, LED Indicator etc. 2. 5 feet long cable is long enough without getting in the way",
      "Extensive Application: Compatible with 7 languages and various post-1996 OBD II protocol vehicles, this OBD2 scanner provides accurate and fast diagnosis for worldwide car owners. 12 months warranty from the date of purchase and lifetime free update are offered by this Automobile OBDII scan tool"
    ],
    "specifications": {
      "Manufacturer": "Autel",
      "Brand": "Autel",
      "Model": "AutoLink AL319",
      "Item Weight": "6.2 ounces",
      "Product Dimensions": "62.99 x 17.72 x 92.52 inches",
      "Item model number": "AL319",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "AL319",
      "OEM Part Number": "AL319",
      "Folding": "No",
      "Cover Included": "Autel AutoLink AL319",
      "Special Features": "One-Click I/M Readiness Key for quick State Emissions readiness check",
      "Vehicle Service Type": "All of the above",
      "Voltage": "12 Volts",
      "ASIN": "B007XE8C74",
      "Customer Reviews": "4.6 out of 5 stars6,245 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#402 in Automotive",
      "Date First Available": "July 27, 2012"
    },
    "categories": [
      "Code Readers & Scan Tools",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Diagnostic, Test & Measurement Tools",
      "Automotive"
    ],
    "price": 35.98
  }
}