{
  "website_summaries": [
    {
      "verdict": "If you need a post-mounted mailbox that is secure, you simply can't go wrong with this one. The best on the market.",
      "pros": [
        "Tough as nails!",
        "Resists vandalism and thwarts theft",
        "Can accept small packages (like boxes of checkbooks) but designed to prevent anyone from reaching in and grabbing mail"
      ],
      "cons": [
        "Post-mount only",
        "Can't hold larger packages"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It looks sturdy, and installation is easy enough",
      "text": "I bought this about a month ago after my correspondence was stolen. It looks sturdy, and installation is easy enough. The lower door, which I open to pick mail, is indeed hard to pry open. The top door, used by the mailman to drop mail, does not \"prevent leveraged entry\" as they claim. This morning I woke up to a broken mail box. They shoved a crowbar on the top slot and bent the front of the box. The result was a gaping hole they used to pick my mail.",
      "rating": 2.0,
      "verified": true,
      "author": "Ivan F.",
      "helpful_votes": 236,
      "publication_date": 20171127
    },
    {
      "title": "Bad Design",
      "text": "I had high hopes for this mailbox and it seemed to work quite well when other conventional mailboxes in the row down on the street were robbed several times since I'd installed it in June 2016. However, a few nights ago it fell victim to someone with a pry bar. The \"wings\" the design includes apparently meant for appearance and weather protection ended making a perfect fulcrum for prying the door open. Luckily, all we've been receiving is junk mail. Will probably go with a P.O. Box now.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob V",
      "helpful_votes": 283,
      "publication_date": 20170129
    },
    {
      "title": "This item is NOT the \"Mail Boss\" as stated.",
      "text": "The item is listed as \"Mail Boss\" it is NOT. It is the \"Mail Manager\" mailbox. It DOES NOT have 12-& 14-Gauge electrogalvanized welded steel as listed. It has 14-gauge and 16-gauge galvanized welded steel. The size and weight in the description IS correct HOWEVER that is not the size and weight of a Mail Boss mailbox. The Mail Manager is $60 cheaper than the Mail Boss. This price is NOT for the Mail Boss mailbox! On the Inside of the mailbox slot the mailbox clearly states \"Mail Manager\". Do NOT be deceived, I was.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas E Stutson",
      "helpful_votes": 73,
      "publication_date": 20171208
    },
    {
      "title": "Stylish yet functional",
      "text": "We love our new mailbox and so does our mail lady. It’s stylish yet functional. We have gotten many compliments from our neighbors. The mail box is on the heavy side so make sure you have a solid post to place it on!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri G.",
      "helpful_votes": 17,
      "publication_date": 20190724
    },
    {
      "title": "Looks nice but not secure",
      "text": "From a security stand point this didn't make the cut. 4th mailbox attempt and bought this because of the reviews :(",
      "rating": 2.0,
      "verified": true,
      "author": "Crimson",
      "helpful_votes": 37,
      "publication_date": 20170530
    },
    {
      "title": "Sleek, modern yet retro looking",
      "text": "Finally a mailbox that matches my mid-century home’s feel! Large & sturdy, no porch pirates are getting in this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda Lacewell",
      "helpful_votes": 12,
      "publication_date": 20190906
    },
    {
      "title": "This mailbox LEAKS!",
      "text": "We purchased this mailbox and it was under a wood covered roof for a while, there didnt seem to be any issues with it. We had to move it to its own post and it LEAKS through the front whenever it rains! My mail is constantly wet! For a $100 mailbox this should not be happening! I am not please with this purchase and would not recommend it!",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer Clark",
      "helpful_votes": 19,
      "publication_date": 20181227
    },
    {
      "title": "Heavy Duty Mailbox",
      "text": "Best mailbox I've ever owned. Looks great too. I can now go out of town without having someone come by and pick up my mail. Mail stays safe and dry. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 9,
      "publication_date": 20191211
    },
    {
      "title": "Very nice locking mailbox!",
      "text": "This is a very nice mailbox and looks just like it shows!",
      "rating": 5.0,
      "verified": true,
      "author": "BRENDA E. LEWIS",
      "helpful_votes": 10,
      "publication_date": 20190425
    },
    {
      "title": "Great locking mailbox",
      "text": "Having worked in the stamped steel industry for the past 32 years, I can say this product is one of the most well-built locking mailboxes on the market. No edge seems to fail & rust, heavy gauge steel, and powder coated finish. The only problem is installing the lag bolts. It's easier to install the lags if you have a ratcheted wrench given you have to turn it within the mailbox. I was hoping to use my drill with a socket bit, but it would not work given the height of the box. Make sure your holes are drilled deep enough to install. Love the box, four neighbors ordering the same to resolve mail theft, a huge problem today.",
      "rating": 5.0,
      "verified": true,
      "author": "robert t",
      "helpful_votes": 4,
      "publication_date": 20190329
    },
    {
      "title": "Very strong, heavy, high quality, and attractive",
      "text": "This mailbox is so strong and attractive, about 5 neighbors have already purchased the same. The mail slot is magnetic and has a clip so that you can leave outgoing mail without the mailman needing to unlock anything. Installation was easy. They provide 4 screws and a drilling bit. Amazon had the best price, about 30 - 40% less than two local stores that had it in stock. The mailbox withstood the wettest California rainy season on record, without letting a single drop in. During the winter, I place a battery-operated, motion-activated light inside so I can see the mail better. The neighbors love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Picky",
      "helpful_votes": 11,
      "publication_date": 20161112
    },
    {
      "title": "Great quality and price",
      "text": "After some recent mail theft in the neighborhood we decided on buying a locking mailbox. We are so happy with this purchase- easy to install, looks great and is Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "SoFloBimini",
      "helpful_votes": 6,
      "publication_date": 20191212
    },
    {
      "title": "Love It!",
      "text": "I would have given this mailbox 5 stars if it didn’t arrive slightly bent on the right corner. I had my uncle bend it back and you can’t tell but that definitely means that the packaging should probably include more cushion/styrofoam. That was my only complaint. It’s sturdy, exactly as pictured, colors are spot on, locks and unlocks smoothly! I will upload a photo. Update: When I want to mail OUT something there’s no place to place the out going mail so I guess I have to purchase the attached piece for the newspapers which is inconvenient. Still 4 stars..😏",
      "rating": 4.0,
      "verified": true,
      "author": "Sapphire",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "DO NOT ORDER !!",
      "text": "Do not order this mailbox. It’s great during summer when there’s no rain or heavy fog. All of my mail is ruined all of the time. My Christmas cards have to go in the trash. NOT HAPPY and NO customer service whatsoever. It’s garbage!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jen KC",
      "helpful_votes": 6,
      "publication_date": 20180501
    },
    {
      "title": "Overall a good product",
      "text": "This mailbox looks great and so far has worked well. The top, sides and front are very sturdy - locking mechanism is smooth and feels secure. The only quibble is that the bottom panel does not seem as stable as the sides. Installation was relatively easy using the template provided. Be aware that this mailbox is heavy - so the post and the installer need to be strong! All in all, I would recommend this product.",
      "rating": 4.0,
      "verified": true,
      "author": "SLP",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Poor quality",
      "text": "Mailbox ok. Lock frozen after 2months. Key flimsy and broke off in lock. Not appropriate for rural areas with weather other than sunshine. Poor quality lock/key",
      "rating": 1.0,
      "verified": true,
      "author": "D Doran",
      "helpful_votes": 18,
      "publication_date": 20170116
    },
    {
      "title": "Solid construction keeps your mail safe.",
      "text": "This mailbox is solid. I've had it installed for over two years in the Pacific Northwest and it has endured heavy rain and snow. The keys have always worked and never stuck. The pressure-treated post it was mounted on failed at the base and the entire mailbox and post fell down, but the mailbox didn't have a scratch on it. The post failed because I didn't keep soil away from the base, causing fungus to propagate and deteriorate the wood. Upon remounting the mailbox, I noticed some rust on the threads of the lag screws. I don't remember if they were galvanized or not. I replaced them with galvanized lag screws. Overall, a very sturdy mailbox.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great, but small outgoing mail space",
      "text": "This is a great mailbox except for the fact that outgoing mail isn't very well accommodated. Only a normal sized envelope will fit into the small space so you're not going to be putting any kind of greeting card or the like to be picked up. And that was very disappointing. Other than that, it is really good looking and has gotten us several compliments.",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "A SAFE FOR YOUR MAIL (and Ray liked it)",
      "text": "My granddaughter had a check stolen from her rural type mail box and the company that issued it said it was in error and they want her to repay them. Someone had cashed it. I got this to help avoid any future thefts. My pal Ray installed it for her - it took a while and he is good at things like this. The box is heavy and seems secure. A neighbor came out to see what they were doing and he said he thinks he will order one. Ray said he will install it if he needs help. Sad that their are mail thieves - shameful actually.",
      "rating": 5.0,
      "verified": true,
      "author": "Dog Mom",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Sturdy mailbox and looks great.",
      "text": "I am very happy with how this box looks in front of my home. I take comfort in knowing that it will deter theft of my mail (in a suburban area with low risk but occasionally have random weirdos walking the street.) It was pretty easy to install into a block wall. The size of the locking door opening was large enough to fit my hand and a socket wrench to quickly tighten down the 4 lag bolts. About a week after putting mine up, my next door neighbors went and got themselves the same box. Definite trendsetter.",
      "rating": 5.0,
      "verified": true,
      "author": "SMD",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Works great for securing letters, not so much for packages.",
      "text": "In retrospect, I wish I had not bought this mailbox, but I can't return it now. The reason? You can't put small packages in it, only letters and small padded envelopes. The design has a huge amount of interior space, but a small door for USPS to load the box. Useless for small packages, so that means trips to the post office. On the plus side, it is attractive and very well made, very sturdy.",
      "rating": 3.0,
      "verified": true,
      "author": "IWX",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Amazing",
      "text": "Love Love Love it! We live in a rural area with lots of thieving addicts. Got tired of worring about our mail being stolen. This purchase has taken all that worry & anxiety away. I no longer run to the mailbox. Infact, it's so secure, I go days without picking up the mail. Holds small small packages. I.E. small padded envelopes. Small clip on the insert flap for mail to be picked up. No idea how it handles a baseball bat lol Quick Tip : Hubby used the plastic piece on the bottom in the inside of the box to stop our mail from getting wet.",
      "rating": 5.0,
      "verified": true,
      "author": "D Johnston",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Poor quality, and poorly packed.",
      "text": "This mailbox came poorly packed, and the very thin styrofoam was already broken into pieces when I opened the box. I also kept finding broken-off pieces of the mailbox as I tried to assemble it. The final straw was when I tried the key in it, and it barely worked. I can't imagine having to struggle to make the key fit every time I want to collect my mail. It was also very heavy. I returned it to Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Lane",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Postmaster wrote me up :(",
      "text": "This product is the mail manager and not the mailboss. I thought I was getting the mailboss as stated in the title of the item, but I got the mail manager instead. When I got the mail manager, I wanted to give it a shot even though it's much smaller than my anticipated purchase. My fears came true when my postmaster told me the door is too small.",
      "rating": 1.0,
      "verified": true,
      "author": "Jomama",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Peace of Mind",
      "text": "After having my mail stolen and dumped on the side of the road (a passerby turned it into the police) I felt it necessary to purchase a locking mailbox. I purchased this mailbox seven months ago and wanted to wait before reviewing. With my son's help, we were able to install the mailbox on an existing post (with a little modification for sturdiness) in less than an hour. My neighbor, whom I share the post with, purchased the same mailbox after she saw mine installed and liked the idea of their mail being secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanie J",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Better than expected",
      "text": "If you need a locking mailbox, this is the one to get! It is well made and very sturdy. It even comes with a lifetime warranty. The lock is very secure and the cylinder is a special type which is very hard to pick. In addition to the fact that the mailbox is well made, they provide other things which add to make this a very good purchase, such as: - Three keys are provided, not just two; - A drill bit is provided which is sized for the lag bolts which are also provided; - A corrugated plastic insert so that if water ever gets in your box, the mail will not be sitting in the water.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Easy to use, hard to steal mail.",
      "text": "We suspected that some of our mail was missing so we got a lockable mailbox. It a very strong deterrent for thief's. I spoke with mailman and he highly recommends something like this. It comes with a few keys and its easy to unlock and get mail. It will fit small packages and does have a clip for outgoing mail in the pull down area that mailman accesses. Its big enough for a few letters or Netflix DVDs. The outgoing mail is not visible unless you interact with it. I am very satisfied with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharlene Hilliard",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Great locking mailbox",
      "text": "Just what we were looking for. And easy to install - though we had asked a \"handy\" friend of ours to help (since we are hopelessly NOT handy), it turned out that the bracket fit exactly as the prior mailbox had fit on the 4X4 post we have. VERY sturdy, and fairly spacious - though larger packages will not fit through the opening. Feeling MUCH more relaxed about mail security - we have previously had a Netflix movie stolen. Since we do very little mailing out, it is not an issue that we can't do it from this mailbox - though some may be able to work with their mail delivery to provide a key to the mailperson.",
      "rating": 5.0,
      "verified": true,
      "author": "DanaM",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "I did it it was easy, you can do it too!!!",
      "text": "If I can do it... so can you! I thought it would be tough... it wasn’t... tough... it wasn’t... I was freaking out a little mentally... I took one look at the packaging, it comes with a map-it whole setup-maker and different installation options for both metal pole and wood... multiple boxes too. I did a great job. Easy. Super cute and sturdy. I cut down the wood old mailbox pole about 6”... and used same one that was there after removing all the extra pieces that were needed for old regular mailbox.",
      "rating": 5.0,
      "verified": true,
      "author": "South Country Li",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Box ok but need better way to attach to post",
      "text": "So the box it's self is ok. To bad it's very easy to have my whole box stolen! Fastened to new post in cement. Box installed per instructions. Whole box was removed from post and stolen.",
      "rating": 2.0,
      "verified": true,
      "author": "Pretty.Penny",
      "helpful_votes": 2,
      "publication_date": 20200412
    },
    {
      "title": "Does the job",
      "text": "After having mail stolen several times we purchased this. We haven't had any negative issues, other than the mail carrier trying to shove too much in at a time and getting stuff torn and wrinkled. I do feel that our mail is safer than it was in an ordinary box. Although this one is quite large, it still seems at times that the carrier will not take the time to make sure the mail drops all the way in. So anyone could open it and take what is sticking out. That bothers me. But I don't see a way around it. It was hit by someone backing out of the driveway and didn't have a mark or dent on it!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet S",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Very pleased with the mailbox !",
      "text": "I live in a rural area and we've had problems with mail bandits as well as kids shooting and bashing mailboxes. This is about as sturdy as I can get since I can't put up a brick enclosed box because of large farm equipment that uses our road. I'm a 60+ female and installed the mailbox myself. It does take a sturdy post, since it is pretty heavy. Other members of my family that live in my area plan to put up the same box after seeing mine.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Dixon",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Very good quality",
      "text": "Bought this after my mail was stolen. This mailbox seems very well built so far. The only complaint is that on the bottom the spacing for screws is pretty specific. This is usually not a huge issue but my mailbox is one in a row of mail boxes, so I can't really change the set up, and the of the two wooden blocks makes it so I can't screw them in with the large bolts. There are fortunately smaller holes as well but it would have been better if the holes all can fit large bolts so this wouldn't be an issue. Nevertheless, the mail box is pretty solid and the key turn is very smooth.",
      "rating": 4.0,
      "verified": true,
      "author": "Nonsequitor",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Made well, sturdy.",
      "text": "Excellent design, made well and sturdy. The product has several pre-drilled installation holes at the bottom for different patterns of mounting. It comes with a plastic shield for the inside bottom, but it is still wise to plug or seal the unused installation holes to prevent water from entering from the bottom. The lock came with three keys with an identification number in case you lose them and you'll be able to reorder the exact keys . Very happy with this product and I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "TCCanlas",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Nice mail box",
      "text": "Very well made. Like the fact that when the top lip is open it covers the opening and hard for thief to put hand inside to grab mail. They give you three keys. The keys will not come out of lid until you have re-locked lid to box; this is a nice safety feature for ensuring you have locked box after getting your mail and you have key in your possession. We have a vinyl post that the mailbox sits on. Had no problem mounting to the vinyl material. My neighbor also purchased one. I would recommend this item.",
      "rating": 5.0,
      "verified": true,
      "author": "osboc012",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Easy Install, Secure",
      "text": "I installed this mailbox about 3 months ago. Installation was easy using the post from my old mailbox. The lock is secure. One thing I was very concerned about was whether small packages would fit. Since I've had several small packages delivered without any issues. Some packages that would have been placed in my mailbox before are too big and have to be brought to my doorstep. But overall, most small packages will fit. I like the mailbox a lot and I would recommend it to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Noah Green",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "My New Locking Mailbox",
      "text": "I had a professional installer install my new mailbox. He made sure to put cement around the bottom of the pole. It looks very nice. Have had a lot of compliments on it. I love it because it keeps my mail safe. Love it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bettye Isbell",
      "helpful_votes": 2,
      "publication_date": 20191022
    },
    {
      "title": "Sturdy, stylish Mailbox",
      "text": "Was pleased with the sturdiness and weight of the mailbox. Installation was fairly easy but including an installation bracket would have been nice. Initially the keys were difficult to insert but a little wirebrushing of the keys eased the function.",
      "rating": 5.0,
      "verified": true,
      "author": "Maui No Ka Oi",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Stronger than My Old Mailbox",
      "text": "The mailbox installs directly on top of the post. I bought the matching metal post and am glad I did because the mailbox weighs 23 pounds. This model does not include the plate to slide the mailbox into as illustrated by a Youtube installation video. The mail box does include the drill bit if you’re using a wooden post. Amazon's home service contractor Graham & Sons installed the post with no issues and the installer did an excellent job. Overall, I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "the \"Cat Lady\"",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "This is the one--works great",
      "text": "So far, so good. Magazines, letters, and padded mailing envelopes that are less than 1.5 inches thick are fitting inside the mailbox just fine. The mail carrier has left something sticking out partially maybe once. Mailbox is attached to a wooden post out by the street and seems sturdy. I had a friend do the installation. It rains a lot here, but no rusting or leaking yet; I've been using the mailbox for about a month. I shopped around a lot and read a ton of reviews, and every security mailbox seemed to have a ton of faults. I chose this one because a friend has it, and she likes hers too--she's had it about 6 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Public",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "Solid & secure.",
      "text": "The door on my old traditional mailbox broke off, so mail was no only visible to anyone passing by, but also exposed to the elements. Since I've decided to do away with my PO Box, I figured I should get a more secure mailbox and bought this beauty (along with the metal mounting post). Money well spent. I've had this for a few years now, and it has been great. Comes with 2 keys (might be 3, I don't recall since I only ever carry one on me). Solid, sturdy and secure mailbox that I believe will last many years. Highly recommend. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Very secure, though not perfect.",
      "text": "Pros: Innovative design features enhance the security of this box: Heavy gauge sheet metal construction. Anti-pry latch mechanism (grips tighter when thieves try to pry it open). Relatively inexpensive. Beats similarity priced \"inserts\" hands down. Cons: It big, almost too big. Despite this, the incoming mail bin does not hold as much as you would think. Other: Probably the best locking mailbox in the $100 price category. Security is easily adequate for my suburban neighborhood. If you live in a rural area (where thieves can take more time), you might want to upgrade to a heavier unit.such as the Fort Knox brand. Update: We recently had several days of very intense rain without any water problems whatsoever!",
      "rating": 4.0,
      "verified": true,
      "author": "LESchwartz",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "High Quality Mailbox",
      "text": "Nice construction and quality. All parts well made and good instructions. I would recommend this unit. I did buy the “frequently purchased together” mailbox, post and base. The post, however, was for in-ground install and base was for surface mounting. I ended up keeping the post and burying it in cement. It would have been way too high to use with surface base, which I returned for a refund. Be careful what combination you order! Surface base would work well on a deck or wooden stairs, and they have a shorter post to work with it.",
      "rating": 5.0,
      "verified": true,
      "author": "George Fordes",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Nice mailbox but missing hardwear",
      "text": "Missing everything except keys and they were locked inside the mailbox. Was able to get them out but no mounting screws, pilot drill or floor liner. Sorry tried to contact you before my review to se about getting missing parts.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Hennessy",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "The keys are all of a sudden not working ...",
      "text": "The keys are all of a sudden not working well in the lock, though we've only had it a few months... Can't find a replacement lock except for on the Mail Boss website where it costs $36 for a replacement lock and 3 keys. Absurd. Checking to see if they'll replace the lock for free..will update later.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20171123
    },
    {
      "title": "Very heavy, nice looking mailbox that did not work for me",
      "text": "I ended up returning the mailbox because it was too heavy for my use that required mounting to a movable, horizontal pipe. However, I really wished it would have worked for me as it was a nice looking mailbox with pretty good features. I think it is ideal for a vertical post mount as is most common. Unclear how water tight it might be but on par with other larger mailboxes.",
      "rating": 4.0,
      "verified": true,
      "author": "JCS",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Returned",
      "text": "For the price it was not great. Came dinged up and was huge like the size of microwave",
      "rating": 2.0,
      "verified": true,
      "author": "shan",
      "helpful_votes": 2,
      "publication_date": 20200805
    },
    {
      "title": "Very nicely constructed mailbox",
      "text": "Heavily built, very nicely painted and finished, high quality lock, and a door that admits larger sized packages than expected. I have read reviews where people have reported that their's was broken into, but given the amount of effort that I think would be required to do so and the fact that my street has a fairly regular amount of traffic I'm not worried about this happening. That said, even though I think this will deter the vast majority of the sorry, no-good humans that steal other folks mail, there are always the determined scumbags that can break into anything if they are desperate enough!",
      "rating": 5.0,
      "verified": true,
      "author": "cw",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Great product",
      "text": "This is my second Mail Boss box (mounted beside the first for a second residence) and I couldn't be more pleased with it. My neighborhood has a high level of mail theft and this put a stop to it. The thieves actually tore the first box off the post and tried to dump mail out of it. The box was relatively undamaged and I just remounted it. It was my fault for putting relatively short lag bolts into the end grain of my post which has now been remedied. It has been several years since my last theft and I consider this box the solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Hericks",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "This is the one.",
      "text": "Very well made. Drop slot is large enough for small packages, yet impossible to reach through to get to stored mail. Plenty of room for storage of delivered mail. Quality of metal and paint excellent. Easy to securely screw to a standard wooden mailbox post. Liked it so much that I immediately bought a second one for a future house.",
      "rating": 5.0,
      "verified": true,
      "author": "RoadWearier",
      "helpful_votes": 63,
      "publication_date": 20151002
    },
    {
      "title": "This mailbox is bullet proof!!",
      "text": "Bought this because we were having trouble with mailbox pickers. The install was very easy. We had the typical pressure treated mailbox post which we cut down. We used a mailbox post which slipped right over the old pressure treated post and was secured by a few lag bolts. The mailbox bolts right to the post top. The mailbox is about bullet proof and and keeps your mail secure. Mailman puts the mail in and it drops to a protected lower level.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene T. Lovett",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Pure junk unless you like soaking wet mail",
      "text": "I wish I could give this mailbox 0 stars. It’s a horrible piece of crap. If you ever get rain and like to be able to read your mail, this mailbox isn’t for you. Our mail constantly gets wet to the point that it isn’t readable. I’m not talking damp or slightly wet, rather soaked. The company that makes makes this piece of junk must be having their employees write the reviews. Trust me, it’s a horrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "andrew",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great sturdy, strong, easy to install.",
      "text": "Great mail box. We live in an average suburban neighborhood that recently has started experiencing problems with mail theft and Some of our mail was stolen. We are the first on the block to replace our mail box. It is sturdy, looks nice, very secure for what we needed. It was recommended by the mail man and he was pleased to see we installed the box. It was relatively easy to install. You do need the right tools. Although it does not look like the other white round mail boxes, it is assuring to know our mail is secure now. I would recommend it for anyone who is experiencing a problem with mail theft.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice L Dunlap",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Heavy duty mailbox",
      "text": "Super heavy duty, strong and sturdy. This mailbox is perfect for holding mail when you go away for a weekend and forget to hold the mail. It was easy to install and looks great! I’m very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine Lopez",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "This Mail Boss delivered.",
      "text": "We wanted a simple but heavy duty mail box and also different from the others on our street. This Mail Boss delivered. It’s large, built to last and matched our home. Also buying the matching post made for an easy install.",
      "rating": 5.0,
      "verified": true,
      "author": "BillyNTX",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "You've got mail",
      "text": "The best thing is you can feel secure that your mail won't be the subject of theft. You can walk to your mailbox knowing that whatever was dropped off will be waiting for you, even if it is just junk mail that will be quickly deposited into your recycle. Easy to install. Easy to use once installed. Big enough to fit small packages in. Standard black with a red \"flag\". Though I am unsure how the mail person would get the mail should I had any to leave. Maybe a little on the big side, but that is me reaching for something to complain about.",
      "rating": 5.0,
      "verified": true,
      "author": "Erick Martin",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great investment",
      "text": "This is the best mailbox I have ever invested in. I was concerned it would appear a little too large in front of the residental yard, but it blends in just fine. The best part is when I'm out of town or just not able to collect my mail or small packages after delievery I no longer worry about anything disappearing. The locking box gives me a peace of mind I haven't had in years. I suggest anyone replacing their mailbox to make the investment in qaulity and probably the last box you will ever have to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Duskofday",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great secure Mailbox",
      "text": "Mailbox arrived as promised originally, in good packaging with accessories for mounting on a wood post. If you plan to mount on a steel post, make sure you get Boss plate or Boss steel post that come with fitting screws. Mailbox is very sturdy, with lock that provides mail security and adequate space for mail, magazines and small to medium packages. Very pleased with quality and workmanship.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Deters criminals enough to go for your neighbors mail...",
      "text": "I live down a country road and all my neighbors have locking mailboxes because we had such a theft problem. Happy to say mine hasn't been messed with whereas my other neighbors have a different brand and have been messed with. Only thing I would change is make the receptcal deeper to fit more nail. Maybe they make one and I just dont know or this one was cheaper. All I can say it, this is sturdy and heavy duty and it has deterred criminals enough to try the other locking mailboxes right next to it. So bravo mail boss",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Russo Baca",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Very sturdy.",
      "text": "This is a very sturdy and well made mailbox. The only 2 minor complaints I have are: 1. The screws are difficult to access when attaching this box to the top of a post since you have to reach inside the box to tighten them (although it's not really a big deal and I'm not sure how you would get around that and still maintain the security). 2. Water gets inside the mailbox when it rains and the water pools on the top then sometimes drops into the interior when the mail slot is opened so the mail gets wet. The top could have been sloped towards the back to avoid this.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay Mundy",
      "helpful_votes": 2,
      "publication_date": 20170224
    },
    {
      "title": "Beast",
      "text": "This thing is solid and heavy. I was worried it would look too bulky for the post I got, but I think it looks good. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Some dude",
      "helpful_votes": 10,
      "publication_date": 20161001
    },
    {
      "title": "Great safe way to hold mail",
      "text": "We travel a lot and got tired of stopping and restarting our mail. This easily solved the issue. With 3 keys I was able to give one to my daughter to check if we are gone for more than a week. Sturdy and love the ease of locking it up and with USPS daily notifications we know what will be in our box if we are expecting something expensive or medication we can have it picked up and not be concerned",
      "rating": 5.0,
      "verified": true,
      "author": "Lori J",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "This is what you are looking for",
      "text": "We installed this mail box , and absolutely love it! Super sturdy, I was concerned about that since the other boxes, where priced around 200.00 plus.. our neighbors complement it all the time has a MCM look which we love",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Need a Secure Mailbox?",
      "text": "After having our mail taken by someone else, we searched for a locking mailbox. There are a number of manufacturers, but this one does not need any additional parts to be purchased as others noted. Our existing post was firmly in place; I did add a short 2x6\" board as a platform, but that's just me as I try to be overly-cautious.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Slavin",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Feeling more secure with this mailbox",
      "text": "Love this new mailbox. It arrived on time and in perfect condition. Quick and easy to install on existing wood post that was used for previous standard black mailbox. Nice that all hardware needed was included (I originally purchased another brand and it did NOT have any hardware). Box is heavy and substantial, so make sure your post is secured in concrete. Key is a little tight in the lock, but that is a good thing for security reasons. Have been able to receive small packages with no issues. Would definitely purchase again, but I don't think I will ever have to!",
      "rating": 5.0,
      "verified": true,
      "author": "ladybug359",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Not the bestimate mail box.",
      "text": "Long envelopes won't fit well for the mail man. The bend just inside of the box is too close to the door or flap.",
      "rating": 2.0,
      "verified": true,
      "author": "Smiling",
      "helpful_votes": 2,
      "publication_date": 20200117
    },
    {
      "title": "Sturdy and secure mailbox",
      "text": "We live in a rural area and we'd had many packages stolen from our old mailbox, so decided to get a lockable one. We encouraged our two neighbors to join us, so got a bank of three Mail Boss 7507 mailboxes complete with post and spreader. The installation was done by a friend in the construction field, and the end product looks good, is solid, and we've had no more packages stolen. Highly recommend the Mail Boss 7507.",
      "rating": 5.0,
      "verified": true,
      "author": "SJR",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Good solid mailbox.",
      "text": "Great mailbox for the price. I did have to modify and drill some new holes in the box so that I could mount it on the post I purchased. The size is great but the mail slot is a little small. The mail person can force a few soft packages in but otherwise has to put most box packages on my porch.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe A",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Nice looking and well built Mail Box",
      "text": "Just got my new Mail Box completed. It seems to be well built and mostly thought out but read some reviews of them getting broke into by prying near the bottom of door using the side as the \" fulcrum point\". I have my own solution for this but I thought I would \" Roll the dice\" and see if I experience any trouble first. I made my own mounting post and concrete base. I made numbers out of reflective tape and put some on the sides too sincemy street has a slight curve and sometime people get close .",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony S. King",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Very Sturdy Mailbox. Love the locking feature.",
      "text": "Very nice mailbox except for 1 feature. If you live in an area that you put your mail out for pickup the spot designed for mail to be picked up by the postal worker is tiny at best. You will have to bend your envelopes to fit into that small \"clip \" that they have in the top slot. If you are sending out greeting cards forget it, the card will have to be bent to get it to work. So what is the point of that? Really like the mailbox, like I said except for that one feature. Maybe a redesign or an additional slot would work better?",
      "rating": 4.0,
      "verified": true,
      "author": "Centaur1127",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Well built as far as strength",
      "text": "Its solid and very heavy. The \"inbox\" part where the letter carrier drops incoming mail gets jammed up because theres only enough room for a few standard envelopes to fit. Mail must be fed in a few at a time so I guess we need to retrain our letter carrier. Also, the mounting holes in the bottom don't match the two different brand bases I had, youre going to need to drill holes in this to mount it.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Kelley",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "It looks good and was easy to install with a socket wrench",
      "text": "Mail theft is common in my neighborhood. Most of my neighbors have the same mailbox, so I bought it too. It looks good and was easy to install with a socket wrench. The case design allows you to bolt the box in a number of different ways depending on your post configuration. The manual specifies a wide clearance, but I found I was able to install it with only about 1/2\" on each side of the box's actual width. I don't know how well it would withstand a serious attack, but in an urban setting I think the security level is probably sufficient.",
      "rating": 5.0,
      "verified": true,
      "author": "z",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "Beautiful functional mailbox that stops the mail theft!",
      "text": "This is a very well made beautiful mailbox. We went from having the plain old white box to this. We bought solid brass numbers and mounted them with 3M tape. We've now got the nicest mailbox in the area. A couple of notes: some people say theirs leak - I don't know how unless they are mounted with the front high. We're in Washinton, plenty of rain and not a drop inside. The delivery people like it because it will take small packages. It is heavy so your mount has to be sturdy. Stealing mail out of here would be almost impossible.",
      "rating": 5.0,
      "verified": true,
      "author": "Choglidite",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Easy to Install and Very Sturdy",
      "text": "I was concerned about putting four bolts into the 4 x 4 post but that turned out to be easy as long as you have a ratchet wrench. The clip for outgoing mail is well designed. It is easy to put mail under the clip and it holds it well. The lock works very well. I think it is a well designed and safe mailbox.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich B",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Off white.",
      "text": "Mailbox is great and secure. I usually only check my mailbox once weekly and this mailbox has plenty of room for it. I had a little trouble with the install, since I didn’t have the appropriate tool but managed to get it done. My only complaint is the “white” mailbox isn’t the white I was looking for- it was more of an off white? Stars 3 out of 5 for color.",
      "rating": 4.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Sturdy Mail box",
      "text": "this is our second purchase of this product. we sold our house and left the mail box. Oh, well. New home, new mail box. We travel so having a secure mail box is important to us. the box is well built and large enough for mail to accumulate a few days before picking up. i beefed up the mailbox stand because of the weight issues. worth the money, me thinks.",
      "rating": 5.0,
      "verified": true,
      "author": "I.B. Brad",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Sturdy",
      "text": "This is very sturdy. My husband installed it and it was pretty easy (he made the post). It has been pouring non stop for about a month, but our mail is always dry. It holds a lot of mail so if I miss picking it up for a few days it’s fine. It’s easy to put a letter in for the postal carrier to pick up.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama2five",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Sturdy but not perfect",
      "text": "Very attractive and sturdy. Outgoing mail is secured with a tight awkward clip that makes it difficult to attach birthday card size envelopes. Outgoing mail could still be stolen (less likely than standard box) so I mail sensitive items from the post office. Carrier reports that delivery opening is tight so small packages that used to fit the old mailbox now have to be delivered to our door.",
      "rating": 4.0,
      "verified": true,
      "author": "Carolyn Ferrell",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Failed lock",
      "text": "Purchased this mailbox in September 2015 and loved it until the lock mechanism failed. At first I thought mail was blocking the lock, but after reading similar reviews I realize it is the lock itself. Frustrating because I have to now rip the box, pole, and buried block out of the ground to replace. Buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "Marge",
      "helpful_votes": 9,
      "publication_date": 20160318
    },
    {
      "title": "High End look",
      "text": "Love this mailbox. Nice amount of space, very good price for the quality. Don't think I'll need to ever buy another mailbox. It's good to see some things are still made well. You can get a matching wood-grain pole (though from a different company). Also was easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "✨ Marriana Maloney ✨",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Im so glad to have something that is built well.",
      "text": "Its heavy and super sturdy. The keys are small but more than just a regular tumbler lock. From the looks of the keys there is at least 2 types of security measures within the lock. I didn't have my key with me but I wanted to check to see if there was mail, so I openeed the slot and tried to peek in, still wasnt able to see the bottom, so that is a deterrent to thieves as well. White color is nice and clean. Stands out in the dark as well so people don't run into it.",
      "rating": 5.0,
      "verified": true,
      "author": "caleb boyd",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Sturdy, intimidating, and easy to install.",
      "text": "It arrived really fast (the very next morning)! It seems very sturdy. I like the slick powder coating they used. It makes the house numbers pop. Installation was a breeze. It was harder to remove my regular old mailbox than it was to install the new Mail Boss. It bolted down tightly and I feel it will last a long time. Hopefully this will stop our local thieves.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "This is the one!!",
      "text": "I have used a lesser-quality locking mailbox before only to have a thief reach in and steal my mail. I don't think that is going to happen with this one. The design is such that when the top is opened, the inner panel swivels up, making it virtually impossible for a person to get an arm inside the box to grab your mail. This is VERY well constructed. Solid. I also appreciate that it was easy to install. It mounts DIRECTLY to the optional metal post with the hardware provided. If you want to mount it on a 4x4, use the optional bracket (I didn't need it). An excellent product and highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "CB FAN",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Easy to install, stable and strong for my need",
      "text": "A crow bar could damage it, but I do not expect anything to stand for those who are determined to steal. This should deter most of the attempts. I will put a mailbox chime/ sensor in it so that I get mobile notification when the mail arrives or someone tinkers with the mailbox!",
      "rating": 5.0,
      "verified": true,
      "author": "HeavyAmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Secure mail box",
      "text": "I bought this over 3 years ago and am only now reviewing it. This has been sturdy, secure, and still works as well as the day we bought it. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Ewan Gillespie",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "nice. and sturdy",
      "text": "This thing is great!. Looks fantastic. It's solidly built. It was easy to install. The lock is solid. there's a clip in the door for outgoing mail. I don't feel like i need to run out and get the mail so postal thieves don't get there first. yeah..that is a thing sadly.",
      "rating": 5.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Compliments from neighbors",
      "text": "Headline says it all. I recently had a fence completely ripped out and replaced. I asked the builder to rip out the old mailbox post as well. I replaced my old basic mailbox with this and bought some vinyl letters to stick on it. It looks really nice and increased my home curb appeal by a bunch. Very happy with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Deveraux",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Large capacity mail box",
      "text": "This box is big and secure. The only complaint is the bottom has several set of holes for different measurement installation. If it comes with some additional plastic cover plugs to cover the unused holes, it will be much better than leave them open.",
      "rating": 5.0,
      "verified": true,
      "author": "LASF",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great mailbox that is well built",
      "text": "Great mailbox that is well built. This size was perfect for our location of installation. We had a height limit of 12 inches due to wood trim surrounding the box. The only issue with this wood trim is the outgoing mail flag would not flip up because of the wood trim above so I removed the bolts securing the flag and rotated it 180 degrees. The flag and now points straight down when not needed or flipped forward straight out when needed and works perfectly. Hopefully that will help others with the same constraints. Do a video search on locking mailbox theft before you make your final purchase. We chose this one for its appeal, feature and security.",
      "rating": 5.0,
      "verified": true,
      "author": "Tech Junkie",
      "helpful_votes": 2,
      "publication_date": 20160112
    },
    {
      "title": "simple to install, looks like it will outlast me",
      "text": "Still thinking maybe I should have gone for the larger version. This one is built to last and was simple to unbolt the old mailbox and install this one in the same holes. Could not have been easier. Now maybe I need a sturdier pole for this beast?",
      "rating": 5.0,
      "verified": true,
      "author": "Go Big Bob",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "This Mailbox is Heavy To Me",
      "text": "Mailbox is huge and heavy but maybe cause it needs room for packages and the heavy weight because it is made from heavy duty material. My HOA may not improve of it because she thought it was going to be smaller but she approved of it, base on the picture size so I hope I get to keep it because it is very nice looking and the quality is great. I am going through Amazon Home Services, to have a professional replace my old mailbox with this one because it is too heavy for me to do it.",
      "rating": 4.0,
      "verified": true,
      "author": "bobbie13",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Tested by theives...and the mailbox won",
      "text": "Someone went down our street prying open the locking mailboxes and stealing the mail. They got to this mailbox and it wouldn't budge. They even lost their tool, since it got stuck in the side of the box (but the box wasn't damaged). Quality matters.",
      "rating": 5.0,
      "verified": true,
      "author": "Innominata",
      "helpful_votes": 5,
      "publication_date": 20170317
    },
    {
      "title": "Heavy duty, great buy!",
      "text": "When an auto destroyed my mailbox one Saturday night in the wee hours, they definitely hurt their auto so when they filed that auto on their insurance they could also have filed my destroyed mailbox then came back and apologized or just left a note----What, am I crazy...??? Anyway that was a $100 mailbox, similar to this one but this one is more heavy duty and cost less! Very pleased with box. But the real topper was that when you lose mailbox, you need it back pronto. These people sent it out immediately. Thank you, Thank you, Thank you. Great job guys!!!",
      "rating": 5.0,
      "verified": true,
      "author": "tealeaf",
      "helpful_votes": 2,
      "publication_date": 20151230
    },
    {
      "title": "Great box with EVERYTHING you need",
      "text": "They actually include the appropriate lag screws and a really high end drill bit! And the inside base cover is ingenious. Of course the box is really sturdy and the mechanism seems quality and like it'll lay for years. I'm just surprised by the \"extras\" that they include.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Scott",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Don't Like KEY",
      "text": "The black plastic head on the key is to thick and does not easily fit on a key chain. It would be far better if it was just the key and not the black plastic head. The Box is great, and this is my second purchase for a different property.",
      "rating": 4.0,
      "verified": true,
      "author": "Buck",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Won’t unlock",
      "text": "We have had this mailbox for less than a year and it will not unlock. We have sprayed the lock several times with grease and it still will not unlock. Do not purchase!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa Witt",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Mailbox",
      "text": "So nice!! I love this locking mailbox. I feel so much safer now. Before ours did not lock and I always worried about my mail. My post lady also likes this bee mailbox. She has stated that many people on her route are now installing them.",
      "rating": 5.0,
      "verified": true,
      "author": "Cedric Daniels",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "5 stars",
      "text": "Super awesome. Little bithe of work mounting it with a socket wrench...smaller arms the better. No mail stolen since and no vandalism against the box. Local police just arrested 5 suspects in a ring for mail theft, identity fraud, etc. It happens, even in good neighborhood's so dobt hesitate to give yourself a little peace of mind while at work. Only drawback is my mail box looks like an armored bank truck next to the old junky aluminum boxes my neighbors have....but I guess that's the point, to not be weakest link.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Clark",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "It's a mailbox",
      "text": "If mailboxes excited me, this would be the one? It is very solid and simple to install. It is not the \"big\" one...but a lot bigger than I thought it would be...1.5 x's larger than a traditional mailbox. The lock is smooth and the finish seems extremely durable.",
      "rating": 5.0,
      "verified": true,
      "author": "SommerKelly",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Peace of mind",
      "text": "This mailbox came packaged really well and in perfect condition. I compared this box to a neighbor's that he purchased at a specialty store in town and thought that this one had a sturdier locking mechanism at half the price of his. Installation is simple, though it really depends on what post you're mounting it to. One thing to keep in mind is that you're existing post may need to be shortened in order to meet the max height requirements. The mail slot is higher up on the box than a traditional non-locking mail box. Check your local codes and be prepared to cut or put in a new post.",
      "rating": 5.0,
      "verified": true,
      "author": "David Carver",
      "helpful_votes": 0,
      "publication_date": 20160514
    }
  ],
  "product_meta": {
    "title": "Mail Boss 7506 Mail Manager Curbside Locking Security Mailbox, Black,Large",
    "description": "Color Name:Black| Pattern Name:MailboxProvides ultimate mail security, and keeps you safe from mail identity theft. An exclusive patented anti-pry latch locking mechanism prevents leveraged entry. Features 14-gauge to 16-gauge electrogalvanized welded steel, high security lock, 3 keys, and package bin mailer. Full service, large capacity curbside locking security mailbox. Locking access door with commercial grade high security wafer lock. U. S. Post Master Approved. Durable powder-coated finish. 1. 9\" H incoming mail slot accepts a box of checks. Limited lifetime . Dimensions: 21\" D x 12\" H x 10. 6\" W. Black.\n\nFROM THE MANUFACTURER\nThe Mail Manager locking security mailbox by Mail Boss is USPS Approved for residential use, and protects against mail theft and vandalism. Its innovative design accepts mail bundles and small packages, yet deters fishing. Made of heavy-gauge galvanized steel, Mail Manager includes a patented anti-pry latch locking mechanism to prevent leveraged entry, and a high-security 12-disc wafer lock with 3 laser cut keys. Never worry about your mail being stolen again, with the Mail Manager secure lockable mailbox.",
    "rating": 4.8,
    "feature_bullets": [
      "USPS Approved full-service residential locking security mailbox prevents mail-identity theft; Stainless steel hinges for ease of use",
      "QUALITY: 14- and 16-gauge galvanized welded steel construction defends against vandalism",
      "SECURITY: Innovative baffle door accepts small parcels, packages, and a box of checks and also deters fishing. Does not include or require Mounting Plate",
      "PATENTED: Includes patented Anti-Pry latch lock mechanism to prevent leveraged entry with a screwdriver & high security anti-drill, anti-pick 12-disc wafer lock",
      "ACCESSORIES: Includes concealed outgoing mail clip, 3 keys, and required installation hardware"
    ],
    "specifications": {
      "Manufacturer": "Mail Boss",
      "Part Number": "7506",
      "Item Weight": "22 pounds",
      "Product Dimensions": "21 x 10 x 11 inches",
      "Item model number": "7506",
      "Is Discontinued By Manufacturer": "No",
      "Size": "Large",
      "Color": "Black",
      "Style": "Curbside",
      "Finish": "Powder-Coated",
      "Material": "Galvanized Steel",
      "Pattern": "Mailbox",
      "Item Package Quantity": "1",
      "Number Of Pieces": "1",
      "Coverage": "Manufacturer's Defects",
      "Included Components": "Hardware; Mailboxes;security-mailboxes",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Warranty Description": "Limited Lifetime",
      "ASIN": "B008HVH502",
      "Customer Reviews": "4.8 out of 5 stars2,392 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#2,359 in Tools & Home Improvement",
      "Date First Available": "April 4, 2004"
    },
    "categories": [
      "Mailboxes & Accessories",
      "Tools & Home Improvement",
      "Hardware",
      "Post-Mount Mailboxes"
    ],
    "price": 97.98
  }
}