{
  "website_summaries": [
    {
      "verdict": "A refractometer designed for use with juices fermenting during the wine-making process.",
      "pros": [
        "Can be used for measuring sugar content during the wine production process",
        "Uses a couple of drops to accurately determine how the juice’s consistency is in order to make adjustments"
      ],
      "cons": [
        "Brix-only",
        "Some refractometers lack English instructions to follow when learning to use the device"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Ade Advanced Optics Brix Refractometer review 9-2015",
      "text": "Ade Advanced Optics Brix Refractometer RF15. I have used this oftem for the last year. I test various fruits and veg for their BRIX. I believe that the higher BRIX food is healthier, and gives you more nutrition for the dollar. Most used for measuring wines, I use it on all my fresh foods. Test my own garden food to see if the soil is good or poor. It's easy to use, and a great tool for anyone health-conscious, or just making some homemade wine!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20150911
    },
    {
      "title": "Nice Instrument, No Hard Case Though...",
      "text": "While it did not come with the hard case as advertised, the refractometer did come with all of the other components as advertised. Instead, it came with a soft case that does fit all of the additional components nicely. It would appear that the instructions were originally written in another language and then translated into English, making them a little hard to figure out at first. While I did not get the chance to test the unit out with a known standard yet, I was able to easily calibrate it with distilled water using the screw at the top of the instrument. I look forward to being able to use this on an upcoming batch of wine must.",
      "rating": 4.0,
      "verified": true,
      "author": "G P",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Just, OK",
      "text": "The first time I used it, the indicator in the lens was straight across. Now its at an angle after a few uses. I calibrate it before each use and I attempted to contact the manufacturer for some clarification but, no response. I have no idea if this thing is faulty or not. It'd be nice if someone actually provided some descent customer service. I had to stop using it for a product I know works.",
      "rating": 2.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Great deal!",
      "text": "It is just as described. Came with the refractometer, instruction sheet (with a few typos, but no big deal), a dropper/pipette, calibration screwdriver, and a hard case. Yes, a hard case. So, either they have gone back to including a hard case because of the complaints, or it is just sometimes included depending on what they happen to have. I calibrated it easily and tested it out on some Vernor's ginger ale. Worked great and it is easy to read as well. Looking forward to using it on my next brew day to check out the SG of wort as it comes out of the mash tun. With this, I'll be prepared to do a patrigyle brewday sometime soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Fun for science projects and home growers alike!",
      "text": "Bought this for a science project and it worked just fine. I had difficulty reading the numbers but my daughter had no problem. As a family we are excited to have this now. We grow a garden and have already learned why our carrots taste so much better - they are 85% sugar! We plan to use this often to compare homegrown vs. store bought food, as well as to compare different varieties of veggies.",
      "rating": 4.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 2,
      "publication_date": 20160411
    },
    {
      "title": "Pretty much what you'd expect, but this comes with a soft bag, not the hard case.",
      "text": "It's a refractometer. It works, nothing particularly special about it. A point to clarify- this is Brix only, not dual scale. That's alright, you can convert it easily with an online calculator. The description states it comes in a clear case, which historically has been a hardcase with a nice fitted foam insert. Mine came in a loose cheaply made zipper bag not too different from your typical kids pencil case. Not particularly thrilled about that. Would have been nice if it had some elastic or velcro that kept it from bouncing around in that bag or something.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 3,
      "publication_date": 20150112
    },
    {
      "title": "not accurate nor repeatable",
      "text": "highly variable readings which also grossly disagree with my hydrometer (and reason). I used it for beer making and readings were 4x high despite multiple recalibrations.",
      "rating": 1.0,
      "verified": true,
      "author": "Bronk",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "It works, very happy",
      "text": "I measured using a hydrometer and it matched the Brix scale on it, Some adjustment was needed with plain water when I started, very easy to move with the supplied screwdriver, will buy again if I need a new one.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Smith",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "FOR SAP NOT MAPLE SYRUP!!!!",
      "text": "I would say works well for SAP not syrup, you need a refractometer with a higher brix scale for maple syrup, dont want anyone else to make the same mistake i did, but still good to know what your sugar content of the sap is and when the season is over for the noobs it actually works for syrup if you dilute it in a 2-1 ratio water to syrup, you would be looking for 22-23% 2 teaspoons of water to 1 teaspoon of maple syrup",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20150410
    },
    {
      "title": "Seems like reported measurements vary between back to back samples more ...",
      "text": "Seems like reported measurements vary between back to back samples more than expected. Need to test a sample multiple times and see where things average out. That is, fill up the pipet, put a couple drop on window, record measurement, clean window, place a couple more drops from pipet, measure, and so on until your have three or four measurements. Maybe this is just a characteristic of all of these types of refractors. Haven't used any but this one. All and all happy with product and price.",
      "rating": 4.0,
      "verified": true,
      "author": "CAP",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Very nice, very useful",
      "text": "Really easy to use and very clearly marked. I don't know why I went only with Brix marking and not specific gravity, but that's my fault. I knocked off one star as the instructions are not very complete. It also would have been nice if they'd included a reference chart of, say, plato, brix, and specific gravity conversions, though I understand those markings are available via the different models. I only say that as the granularity/degree of the markings is much finer with a single scale present and having the conversions handy would be nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Monkey's Daddy",
      "helpful_votes": 0,
      "publication_date": 20130520
    },
    {
      "title": "Handy dandy refractometer",
      "text": "Some years ago, I paid 10 times the amount for my first refractometer and it was not as good as this one. Use it for my demos now. Superior in information given to the digital ones.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Breech",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Sweet bargain here on Amazon",
      "text": "I use this in my viticulture class at Napa Valley College. It works quite well for the price and is the exact same model as the one my professor allows the students to borrow during lab. He claimed they were very expensive so when I told him how much I'd paid, he was jealous that I'd gotten a bargain an he'd paid full-price (whatever that was.)",
      "rating": 5.0,
      "verified": true,
      "author": "R. B. E.",
      "helpful_votes": 2,
      "publication_date": 20151009
    },
    {
      "title": "Help!!! I can’t figure out how to read the brix level",
      "text": "I have read the instructions and I see the blue grid when I hold it up to the light, I used the screwdriver but no matter what sugary solution I put on it I don’t see a difference on the grid it always stays blue?? What am I doing wrong?",
      "rating": 1.0,
      "verified": true,
      "author": "ANNIE",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Not as pictured... No hard case.",
      "text": "While I imagine it will do just fine, I chose this model instead of the 0-10% model because this model appeared to come with a plastic case. It doesn't. It comes with the same pouch as the 0-10% unit. I wish there was a 0-15% as that is the best range for what I want to do (CNC Coolant).",
      "rating": 2.0,
      "verified": true,
      "author": "A Person",
      "helpful_votes": 2,
      "publication_date": 20150910
    },
    {
      "title": "great meter !",
      "text": "this is the second meter I have bought, (first one is still working great) the reading are exact and easy to read, just make sure you point it into a good light source when reading it , make it show up very clear. almost 1.5 years and the first one is still reading exact with no calibration needed. it comes calibrated but i still bounce it off others to verify, but they both came good to go out of the box!",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 0,
      "publication_date": 20150820
    },
    {
      "title": "No more guessing!!",
      "text": "Just finally found out amazon has home brewing equipment. The price is defiantly right on this site. It's great to finally be able to check the gravity instantly and at any temperature. Instead of having to use a hydrometer and adjusting the reading to the temperature of the beer. This thing is super accur Keep in mind, you will need to convert the reading (in brix) to specific gravity. There is a tool on the northernbrewer website and also in beersmith. You will also need to calibrate it every once and a while using distilled water. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy LaDucer",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Worth it for gardeners.",
      "text": "It's easy to use and gives you objective feedback on your vegetables/fruit. I've been using it on tomatoes and I think it seems to be accurate. My good tasting cherry tomatoes register about an 8, and my sour and bland big tomatoes are a 5. Doesn't take much change in brix to make a difference, so having this is helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Conure fan",
      "helpful_votes": 2,
      "publication_date": 20150822
    },
    {
      "title": "Not a marine refractometer",
      "text": "It's just fine but I made the mistake of buying this without looking thinking it's suitable for use in a marine aquarium. This isn't the droid you're looking for! It can, however, be calibrated with 35ppt salinity standard if you've accidentally done the same thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jordan Z",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Tested the product and foud it very easy to use",
      "text": "Tested the product and foud it very easy to use. All of the readings are in BRIX.and requires a table, easily acquired on the internet, for translation from BRIX to Specific Gravity. Would like to have known what the primary direct reading values were. I am very satisfied with the hardware and it will accomplish the job for which I purchased it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Gilbert R Mesec",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "... so finding a temperature-compensated refractometer for only $35 sounded like a gamble",
      "text": "Normally I'd expect to pay over $100 for one of these - so finding a temperature-compensated refractometer for only $35 sounded like a gamble, but one worth taking. It came correctly calibrated, and measures sugar level in our Italian Ice & gelato mixes.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Britton Pann",
      "helpful_votes": 3,
      "publication_date": 20141229
    },
    {
      "title": "Wonderful REFRACTOMETER",
      "text": "This is a REFRACTOMETER, not the temp thing in the description. Refractometers rest the nutritional value in foods. It works great for comparing some fruits.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy H.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Very handy",
      "text": "I'll admit, it's a little tricky to calibrate and then I have to convert it to specific gravity to match all the beer brewing recipes that I use, but otherwise, I rally like it and the fact that a very small sample is all I need verses the amount a hydrometer requires. I only wish I had known that for a small difference in price I could have purchased a unit with both scales.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff & June",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Works well. I'd recommend it.",
      "text": "This thing is super cool. I've been using it to perfect sorbet and ice cream recipes and make sure they have a consistent, proper sugar content and come out with the proper texture.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Horowitz",
      "helpful_votes": 0,
      "publication_date": 20180411
    },
    {
      "title": "Very accurate and good quality.",
      "text": "Works great, much better than a hydrometer. Seems very well built, and has a nice carrying case. It is very easy to read and calibrate, mine came perfect out of the box. Just be sure that you order the correct type for your application, as I needed mine to check the salinity of my salt water for my reef tank, and accidentally ordered one that measures \"Brix\" instead of SG the first time. Completely my fault but just something to check before you purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "ZiLBeRTRoN",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "My Chemisty professor hubby loved it!",
      "text": "I looked at a few of these for my husband. He has been homebrewing for almost 20 years and always just took specific gravity. He is a chemistry professor so I thought he might like something a little more scientific for his brewing. I was right. He nerded right out and started checking sugars on everything. He said it was calibrated right on, right out of the box",
      "rating": 5.0,
      "verified": true,
      "author": "karin artisbeautydotnet",
      "helpful_votes": 2,
      "publication_date": 20160120
    },
    {
      "title": "Works great with machine coolant",
      "text": "Calibrated it to my water then used it to mix 55 gallons of machine coolant for my new mill. You will need to know your BRIX ratio to get an accurate percentage but your coolant supplier / manufacturer has this available. I used Qualichem xtreme-cut 250c. Outstanding stuff. Recommended for coolant testing.",
      "rating": 5.0,
      "verified": true,
      "author": "James D. Holbrook",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "Works well- build quality is a bit plasticky but the ...",
      "text": "Works well- build quality is a bit plasticky but the price is a fraction of the cost of it's full metal counterparts",
      "rating": 4.0,
      "verified": true,
      "author": "Tarek Abdel-Baset",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "This is a great little tool",
      "text": "This is a great little tool. The price point is amazing, and honestly, it works just as well as the 100 dollar, marked up, price gouging version.",
      "rating": 5.0,
      "verified": true,
      "author": "S Khan",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "This refractometer was listed to be used for a marine ...",
      "text": "This refractometer was listed to be used for a marine aquarium. However the scale is in Brix and there is no paperwork to show a conversion from Brix to SG or salinity.",
      "rating": 2.0,
      "verified": true,
      "author": "once upon a time",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "VERY HELPFUL",
      "text": "Easy to use, I got the vegetable chart from the internet. Interesting in comparing produce between stores, and between frozen and fresh. Haven't changed much in the way of purchases, just better informed as to what I am getting for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "john s. crouch",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "This is a must for home brewers",
      "text": "This device is perfect for home brewers and beats the crap out of hydrometers. Buy it and never look back",
      "rating": 5.0,
      "verified": true,
      "author": "Ian H",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Forget the hydrometer (at least initially)",
      "text": "Good price. Easy to use and calibrate. Saves an enormous amount of time and effort when determining gravity and trying to hit targets while brewing beer.",
      "rating": 5.0,
      "verified": true,
      "author": "William J. Boyle",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Easy to measuring Brix (Plato)",
      "text": "Easy to use refractometer to use during brewing or wine making. I use this unit to test my wort during mashing runs and before pitching my yeast. Gives consistent results to determine your Original and final gravity, once you convert the BRIX number to a specific gravity reading conversion. Great way to determine if you've mashed your grains effectively and also to confirm your alcohol by volume readings in your final product. I recommend, for a no mess, ease of use, product. A must have for any quality home brewery.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Geary",
      "helpful_votes": 0,
      "publication_date": 20140606
    },
    {
      "title": "Stopped working",
      "text": "Doesn't stay at zero after calibration! I only used it maybe 15 times! And I have been very very careful with it. Now it broke. But it worked very well until it didnt anymore. And I do need it for checking the treatment for my dogs hydration because of kidney stones. Very frustrating.",
      "rating": 2.0,
      "verified": true,
      "author": "Matt C Simpson",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "Works Perfectly",
      "text": "Really like this for use with home brewing. Much easier to use than the traditional hydrometer setup. Did not need to adjust calibration either. This will not work to take Final Gravity (after fermentation) readings, due to the presence of alcohol.. However, there are websites that can convert \"post-fermentation Brix\" into approximate gravity readings.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Brix meter",
      "text": "This thing has been more fun than a basket of eggs. Use it to find out what your food is like in quality, and then train your taste buds and brain with a numerical reading. Buy some lab squirt bottles for cleaning in the field.",
      "rating": 5.0,
      "verified": true,
      "author": "Puppy",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Added this one to my bag of tools",
      "text": "I added this one to my bag of tools. I followed the instructions and calibrated with distilled water. This really helps me in my brewing process because I do not have to discard lard samples anymore. For the price I would recommend this to any home brewer.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve of PA",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "You can't go wrong with this product..,",
      "text": "I wish I had time to share more information about the quality and positive results from this product. You won't go wrong by purchasing this and other products from this company. Stan - West Columbia, Texas",
      "rating": 5.0,
      "verified": true,
      "author": "Stan Wiggins",
      "helpful_votes": 0,
      "publication_date": 20151126
    },
    {
      "title": "Five Stars",
      "text": "Great optics. Solid built. Accurate adjustments. Great buy. Sentences hard.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy T",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Checking soil health with vegetables",
      "text": "We are using this to test our soil health by using our vegetable juices. It was calibrated correct out of the box, it was perfect and we do enjoy using it. It told us we are on the right track but have lots more room to improve. Can't wait until we hit the top of the Reams scale.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Good product",
      "text": "Feels cheap but works fine. Pretty accurate and comparable to hydrometer readings",
      "rating": 5.0,
      "verified": true,
      "author": "Jorjon",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Broken?",
      "text": "I returned this after adding nearly a quart of salt to get salinity to 1.018 in a 1 gallon tank. Maybe it was just a dud. Yes I calibrated it before use.",
      "rating": 2.0,
      "verified": true,
      "author": "Dutchunter",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "Just right.",
      "text": "I had no idea what I was buying. I keep bees and had a lot of honey I turned into mead. In order to measure the sugar content, I read I should get one. I thought it was going to be like my PPM meter, or acid meter for canning. I was wrong! Its vey easy to use and calibrate. Now I can check the content of sugars in my home brews, vinegars and ferments.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachelle",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "easy to use and read",
      "text": "Very lightweight, easy to use and read. Nice price as well. Comes in a nice box too.",
      "rating": 5.0,
      "verified": true,
      "author": "gogetter",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Great fun, great way to get the kids excited ...",
      "text": "I should have bought one of these years ago! My kids and I eagerly tested its calibration, and after zeroing it according to the instructions, it checked out when we made an 11% sugar solution. Then we tested tomato juice from some fresh tomatoes, and some raspberry juice. Great fun, great way to get the kids excited about science, and useful for everything from maple syrup to home brewing to tomato season.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Birchmeier",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Works well",
      "text": "I work in a machine shop and use this to check our coolant levels. This one works as well as the more expensive one that was dropped and broke. I would recommend this refractometer.",
      "rating": 5.0,
      "verified": true,
      "author": "byrdman",
      "helpful_votes": 3,
      "publication_date": 20141027
    },
    {
      "title": "Not happy.",
      "text": "Malfunctioned on the very first batch of homebrew. Blue line completely disappeared, making it impossible to calculate fermentable sugars and effectively ruining an entire batch of beer. Not happy.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander Detroit",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Five Stars",
      "text": "Seems to work great. I wish it was dual scale, but i knew that when I purchased it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronno",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Broke on second use; I would not recommend to anyone.",
      "text": "The optical element became unglued after just two uses. I was able to re-glue it myself. On the up-side, this is the same model sold by many home brew supply shops for nearly double the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeff Rooks",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "Good low cost refractometer",
      "text": "Pretty good for the price. This refractometer gets the job done if you are comparing sugar concentrations in solution for cooking, sugaring, or brewing. No frill model and as the cost suggests it's not the most rugged construction. With care I hope it will last me many years.",
      "rating": 4.0,
      "verified": true,
      "author": "Candy Lover",
      "helpful_votes": 0,
      "publication_date": 20130512
    },
    {
      "title": "I just wish it had OG/SG readings but there are ...",
      "text": "I just wish it had OG/SG readings but there are sites with the conversion on it. The case feels cheap and I needed to adjust the calibration. The instructions are hidden inside the case under the molded material that holds the refractometer.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Oatman",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Good Refractometer",
      "text": "This thing does the job. I bought this to do all-grain beer brewing, and it's great for measuring the hot wort at different stages of the mash/lauter. It works at any temperature and accurately gives a gravity in brix. Especially for the price, I'm very impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "saseith",
      "helpful_votes": 0,
      "publication_date": 20131102
    },
    {
      "title": "Works great was helpful for checking sugar in sap from maple trees",
      "text": "This was an inexpensive item compared with similar items. It is easy to use and seemed very accurate and will be using to check brix in vegetable garden this year.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Schwarz",
      "helpful_votes": 2,
      "publication_date": 20140507
    },
    {
      "title": "Great instrument !!",
      "text": "Item arrived in two days. The calibration was right on. It was really useful in the our garden vineyard. We were able to test our grapes for sugar % and determine when to harvest. We also used it during our fermentation. Didn't have to deal with the wine thief and hydrometer until the reading got down to around 5. Then we used our hydrometer. Very satisfied with the refractometer and would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward G. Welch",
      "helpful_votes": 0,
      "publication_date": 20130820
    },
    {
      "title": "Very happy with this.",
      "text": "I have used refractometers before in my former line of work (retired now) and I must say this surpassed my expectations. I did not expect to get a unit that worked as well as this for so little money.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie",
      "helpful_votes": 0,
      "publication_date": 20131108
    },
    {
      "title": "The refractometer works fine, I'm just not convinced this is a big ...",
      "text": "The refractometer works fine, I'm just not convinced this is a big improvement on a hydrometer for beer brewing. It takes so much work to calibrate the thing effectively, I think I'm going to go back to the tried and true.",
      "rating": 3.0,
      "verified": true,
      "author": "Aerel",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "This is a great price for the quality",
      "text": "This refractometer is very accurate for measuring the brix of my garden fruit and veggies. This is a great price for the quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Elbereth",
      "helpful_votes": 3,
      "publication_date": 20141114
    },
    {
      "title": "Great Tool",
      "text": "This tool comes in handy when trying to determine the density of the food you have grown in your garden. It's great for comparing the junk you buy in the grocery store as well",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth J Campbell",
      "helpful_votes": 2,
      "publication_date": 20140606
    },
    {
      "title": "Great for Homebrewers",
      "text": "I was a tad skeptical of this as it was much less expensive than other refractometers on the market. I was wrong! This is a great tool for homebrewers, as you do not need to waste a lot of your wort for taking a Hydrometer test. I recommend this to anyone in the hobby!",
      "rating": 4.0,
      "verified": true,
      "author": "Captain Llama",
      "helpful_votes": 0,
      "publication_date": 20130814
    },
    {
      "title": "Not that big of a deal as I waste so much less beer using this over the hydrometer",
      "text": "For some reason I thought it had two scales, but alas, only has the brix. Not that big of a deal as I waste so much less beer using this over the hydrometer, and conversion tables are easy to get. I did need to calibrate it first, no big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "Great product.",
      "text": "Using it to check the fruits that I grow at home. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hiking Viking",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Love that I only have to get a drop of ...",
      "text": "Got this for testing homebrew brixs. Love that I only have to get a drop of liquid to test. It was also great when I was making some rootbeer with my little brother that I could show him some science.",
      "rating": 5.0,
      "verified": true,
      "author": "scofflaw",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "What a terrific company! Ordered 24 of these and they were ...",
      "text": "What a terrific company! Ordered 24 of these and they were delivered and shipped. Simple to use and very reasonably priced. Would order again!",
      "rating": 5.0,
      "verified": true,
      "author": "cwhite",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Great tool for the homebrewer!",
      "text": "First time owning a Refractometer. using it for brewing beer. Not an exact substitute for a hydrometer, but it is easier to use and waste a lot less beer. For my normal homebrewing i'm perfectly happy using this Refractometer.",
      "rating": 4.0,
      "verified": true,
      "author": "MikeGainesville",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "ATC BRIX Refractometer",
      "text": "I have not used it as of today, but it is the high quality that I expected and see in others that I use in other applications. Looking forward to using it soon.",
      "rating": 5.0,
      "verified": true,
      "author": "john15016",
      "helpful_votes": 0,
      "publication_date": 20160110
    },
    {
      "title": "Works great.",
      "text": "I test my coolant every day with it. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "It's works perfect. And for the money it's just as good ...",
      "text": "I use this to measure my haas CNc machine coolant percentage. It's works perfect. And for the money it's just as good as the high dollar ones for sale here.",
      "rating": 5.0,
      "verified": true,
      "author": "Fox",
      "helpful_votes": 0,
      "publication_date": 20160516
    },
    {
      "title": "Does what it should",
      "text": "This refractometer works great for brewing beer and checking your glycol concentrations if you are using it in a brewery environment. It is quick and easy to see where you are at during the run to the kettle and kettle full. It make life much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "PBR Man",
      "helpful_votes": 0,
      "publication_date": 20130224
    },
    {
      "title": "I love this little device",
      "text": "This little device makes it so much easier to check the brix - I was using a hydrometer before - now 1 drop gives me the information that used to take an hour or 2 of effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Kane",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "Required calibration. Prior to that things seemed way off ...",
      "text": "Required calibration. Prior to that things seemed way off, but I went and bought a gallon of distilled water, adjusted, and now the meter matches manual hydrometer readings.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn R",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "grape sugar measurer",
      "text": "I'm using the refractometer to measure sugar content in grapes to help me determine when they're ready to harvest. It's easy to use and agrees well with measurements taken with a hydrometer.",
      "rating": 5.0,
      "verified": true,
      "author": "plmdlong",
      "helpful_votes": 10,
      "publication_date": 20110913
    },
    {
      "title": "Very easy to use and works great",
      "text": "Very easy to use and works great. I wish this product was still packages in the hard case though, instead of the thin bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Fast prompt and accuate",
      "text": "Great price point, all items were as advertised and 40-60% cheaper than an impulse buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "... test the sugars in veggies and fruits for the best money spent on produce",
      "text": "This is an expensive tool to use for learning how to test the sugars in veggies and fruits for the best money spent on produce. DG",
      "rating": 5.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 0,
      "publication_date": 20150623
    },
    {
      "title": "Great product for checking the gravity of worts",
      "text": "Great product for checking the gravity of worts. I've compared the Brix reading of the refractometer to the specific gravity of the hydrometer and they are always spot on with each other. Great price too.",
      "rating": 5.0,
      "verified": true,
      "author": "steph",
      "helpful_votes": 0,
      "publication_date": 20141022
    },
    {
      "title": "Does the job!",
      "text": "**IMPORTANT NOTE** This SAME EXACT refractometer is sold on NorthernBrewer.com for $56.99, and that's without shipping included! Buy this one and and maybe we can discourage these ridiculous prices. I bought this for beer brewing, and it works just fine. Pros: very nicely built. All very high quality machined aluminum. Comes with a dropper, instructions, and a small clothe for cleaning the lens. Tested accurately against my hydrometer. Cons: my dropper has a hole in it, rendering it useless. This is not a huge deal as I was not aware that it even included a dropper. Brix readings, must be converted to specific gravity, if used for brewing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 18,
      "publication_date": 20130309
    },
    {
      "title": "Great instrument",
      "text": "I am very happy with refractometer RF15. Its ease of use and accuracy make it a joy to use. I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Vmosco",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Good tool",
      "text": "Affordable meter for my marine aquariums. Works as expected. I would purchase another one. Feels like good quality material. Thanks! Update: Make sure to calibrate at least once per month. It comes with solution to calibrate, so not a hassle.",
      "rating": 5.0,
      "verified": true,
      "author": "Danimal43",
      "helpful_votes": 0,
      "publication_date": 20120818
    },
    {
      "title": "Five Stars",
      "text": "Works Great for what its used for. Would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "EvilDeadGuy8",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "hard to read exact number.",
      "text": "I have never used a different refractometer but I find this one to be too fuzzy on its reading. I end up ball parking most every number to a half increment 8 or 8.5 instead of 8.3 etc which is to large a difference.",
      "rating": 3.0,
      "verified": true,
      "author": "Cory Mathews",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "It works great...in the right hands.",
      "text": "I bought this for a pastry cook to check for sorbet texture. She hardly used it because she sucked.",
      "rating": 4.0,
      "verified": true,
      "author": "Monica/Eugene",
      "helpful_votes": 0,
      "publication_date": 20161007
    },
    {
      "title": "Good deal on testing equipment.",
      "text": "A basic tool. But works well and accurately as far as I can tell. Am I wrong that the numbers on the scale are labeled differently than what I expected?",
      "rating": 4.0,
      "verified": true,
      "author": "Kyle J. Von Bose",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Cool",
      "text": "Have had this for 2 years for a machine shop. Serves its purpose well.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20160326
    },
    {
      "title": "Refractometer",
      "text": "I purchased this refractometer so I can monitor gravity levels while brewing beer. Nothing fancy here folks, just a refractometer and it works. I have read the complaints and, yes, it gives you a reading in Brix. But look anywhere on this handy thing called the internet and you can find brix to gravity calculators, charts, etc. For me, it was worth it so I didnt have to pull readings into a hyrdometer tube throughout the brewing process to ensure I was on track for my specified gravity.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan A Dort",
      "helpful_votes": 0,
      "publication_date": 20130418
    },
    {
      "title": "Great value refractometer",
      "text": "Seems to work flawlessly, great value and seems well made. Readings are accurate and easy to view. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Anderson",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Great tool to moniter plant photosynthesis!",
      "text": "Such a useful tool to check on plant health. Accurate and easy to use. I frequently use it to feed my curiosity about plant and soil balance a and health. And a great price!",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Very happy. Using it for home brewing and winemaking",
      "text": "Very happy. Using it for home brewing and winemaking. Much more convenient for checking pre-ferment gravities than using the hydrometer. Accuracy seemed right on out of the box when I checked it. And the price was just a little over half what the home brew shop charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Outstanding tool.",
      "text": "Used this for the first time today. So easy to use. Very clear and easy to read the results. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "A great little brewing tool for the money",
      "text": "A great little brewing tool for the money. Would be 5 stars but the resolutions makes it a little difficult to fractions",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "No English instructions...Argh!",
      "text": "Did not come with instructions in english. I got a small pamphlet with chinese characters. I'll find how to use it on the internet, but this is an inconvience.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "Great tool for the homebrewer",
      "text": "If you are an all grain home brewer or of you make your own mead, wine or hard cider then this is a tool that you should have. Ignore the bad ratings for people who didn't know this is a Brix only refractometer. There are plenty of brewing calculators (all decent brewing software packages have them) available for Windows/Mac/Linux/iPhone/iPad/iPod/Android that will quickly convert Brix to SG. Using this refractometer is a simple way to check your running and avoid over sparging. This is of course only accurate BEFORE fermentation. Alcohol will skew the reading. While there are calculators to compensate for it after fermentation a hydrometer is the best tool for that job.",
      "rating": 5.0,
      "verified": true,
      "author": "Ric West",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Works great at a great price",
      "text": "Didn't realize it was Brix only at first, but not a big deal, that's why they have calculators... Works great at a great price!",
      "rating": 4.0,
      "verified": true,
      "author": "Neil Froelich",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Very easy to use and keep clean",
      "text": "Very easy to use and keep clean! Use it on the family farm to check quality of colostrum in dairy cow milk; would recommend this to other dairy farmers for same purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "Five Stars",
      "text": "we use them to check our starch solids as we cook it. works excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Elphendorf",
      "helpful_votes": 0,
      "publication_date": 20151002
    },
    {
      "title": "Awesome time saver",
      "text": "It arrived very quickly and exactly as described. It came with a nice padded case and very clear instructions. I used it yesterday for the first time and it couldn't be any easier to use. I ordered it knowing it only had the BRIX scale, for a future model, it would be nice if they added a SG scale on one side. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "Indispensable!",
      "text": "Can't believe I brewed for years without this accessory. Be sure to get the dual scale version, however. Easily track mash progress with just a drop of wort. Can be used in conjunction with BeerSmiths Refractometer tool to check the fermenting wort as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20140314
    },
    {
      "title": "Built better than expected for the price",
      "text": "Heavier than I expected (good thing). Decent case construction. I will probably buy more for gifts. I accidentally purchased 2 of this item but a friend of mine saw it and instantly wanted to buy the other one from me.",
      "rating": 4.0,
      "verified": true,
      "author": "larry r",
      "helpful_votes": 0,
      "publication_date": 20121214
    },
    {
      "title": "Brix Meter",
      "text": "Works perfectly for my need to monitor the level of sugar in my sorghum crop before I harvest. Easy to use in the field. Instructions were more complicated than they needed to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20131022
    },
    {
      "title": "Does not measure in SG units.",
      "text": "Item does not read in SG despite saying so in the description. Get ready to convert every reading you take from Brix.",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan Fritts",
      "helpful_votes": 0,
      "publication_date": 20171212
    }
  ],
  "product_meta": {
    "title": "Automatic Temperature Compensation 0-32% Brix Refractometer Beer Wine CNC Fruit by Ade Advanced Optics",
    "description": "Sugar refractometer 0-32% Brix. This refractometer only measures Brix Levels (Sugar Levels) and does not measure Specific Gravity. You can use any number of websites to calculate your specific gravity by entering your Brix reading.",
    "rating": 4.2,
    "feature_bullets": [
      "All metal construction with premium optical lens",
      "Provides accurate and repeatable measurements on easy to read scale",
      "Requires only 2 or 3 drops of solution",
      "The prism and lens with a simple focus adjustment",
      "Complete with case, calibration screwdriver and plastic pipette"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.99 x 3.31 x 2.28 inches; 4.96 Ounces",
      "Item model number": "5422",
      "Department": "Womens",
      "Date First Available": "April 14, 2010",
      "Manufacturer": "Ade Advanced Optics",
      "ASIN": "B008562GD0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "804879245315 , 885179675958 , 704405061351 , 656103022977 , 885360030665 , 789164217317"
    },
    "categories": [
      "Refractometers",
      "Industrial & Scientific",
      "Substance Analysis Instrumentation",
      "Test, Measure & Inspect"
    ],
    "price": 22.99
  }
}