{
  "website_summaries": [
    {
      "verdict": "A cream concealer that's a firm favorite. Works especially well on dark spots and discoloration.",
      "pros": [
        "Super easy to apply and blend",
        "Contains lemon peel extract aimed at diminishing dark blemishes over time",
        "Non-sticky formula and natural, so can be worn alone as a blemish touch up if going without foundation",
        "SPF 20"
      ],
      "cons": [
        "Does not work as well to cover redness and rosacea",
        "Some found it difficult to find a good color match"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "USED product showed up!",
      "text": "I've read about the kind of reviews where used/empty product shows up and can say now that I've experienced it myself. This case... it's pretty gross...used makeup. The order was LATE and then showed up in this condition. Blame the seller for thinking this is ok. I am a working mom so have gravitated to doing a lot of shopping via Amazon for the convenience factor. This is the first and last time for makeup product.",
      "rating": 1.0,
      "verified": true,
      "author": "adrienne grzeskiewicz",
      "helpful_votes": 25,
      "publication_date": 20190427
    },
    {
      "title": "Great with middle age oily skin.",
      "text": "If you're a Bare Minerals fan, terrific add on. It blends easily with everything and coverage is subtle. No problems with breakouts or anything yet. (Late 40s w/oily still adolescent facial skin). The only makeup I use on my face (except for aging treatments). No toners just serums after washing. Don't use concealer often but I'm happy and it goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "JustBeachy",
      "helpful_votes": 16,
      "publication_date": 20180121
    },
    {
      "title": "Not so great. Colourpop is better/cheaper",
      "text": "For me this is too oily and doesn’t set right. It settles into my crease and finds any subtle wrinkle to collect in making me look older (I’m 31 and don’t have crows feet). The color and coverage is good but it doesn’t last or set. I’d recommend colourpop concealer actually. It’s only $6.50 and sets really well.. again, just speaking for my skin (dry/oily combination - olive complexion).",
      "rating": 2.0,
      "verified": true,
      "author": "Alisan H.",
      "helpful_votes": 5,
      "publication_date": 20190427
    },
    {
      "title": "Best concealer I've ever used",
      "text": "I've loved every BareMinerals product I've purchased and this is no exception. Covers my rosacea nicely, looks natural and you use very very little to obtain coverage. It also doesn't cause my rosacea to flare up as some other products have done",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 16,
      "publication_date": 20161006
    },
    {
      "title": "Concealer",
      "text": "This is a great concealer..light yet it covers blemishes and irregularities on your face. Works well with bare minerals powder over it. I'm 58 yrs old and always looking for good coverage. Glad they came out with a cream, the powder did not do the trick!",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 46,
      "publication_date": 20130617
    },
    {
      "title": "Too small,  too smelly",
      "text": "Super disappointed as the brand is good but I have the feeling these sat in a warehouse for years!!!! The smell of it is horrible, it has the old smell as if it isn't a fresh product and it made me breakout all over bt face. The price for the small size isn't worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Momof2",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Disappointed",
      "text": "So I did a lot of research before I bought this concealer for under my eyes. I was looking for a creamy concealer for a very long time and after lots of research I chose this one because it received great reviews online and it was economic. The problem is that it doesn’t really cover my dark circles and it wears off fairly quickly. I sometimes wear this over a color corrector Under my eyes but still I don’t get the same affect as I would from a good concealer. It’s too bad because I like the creaminess of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Rose",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Good product",
      "text": "This is a great product. Goes on smooth, hasn’t creased. I am a 52 year old with the expected skin issues and intermittent dark circles. I apply this around my eyes. I do not wear shadow, but some liner and mascara. I am pleased. Much nicer than the elf eye primer- it is thicker. It is a bit pricier, but not a deal breaker. This is comparable to an Avon product I love, but has been unavailable so many times I gave up. Love Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Sugarfoot",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Get A Shade Darker",
      "text": "I have somewhat tan skin and needed a shade darker--always easier up spread out and make lighter than to do the opposite.",
      "rating": 4.0,
      "verified": true,
      "author": "Erwin Hero",
      "helpful_votes": 5,
      "publication_date": 20181230
    },
    {
      "title": "Great concealer",
      "text": "Great concealer. I use it around the eyes. It does tend to wear off a bit during day, but easy to carry and reapply since it is such a small container",
      "rating": 4.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 5,
      "publication_date": 20170309
    },
    {
      "title": "Wong orders",
      "text": "Wrong color ,I ask for bare Minerals correcting concealer broad spectrum 20 in tan ,I was sent medium 2 )price around $14. 00 which is ok but it not my color and to add to this complaint ,I also revived another package of the same products same small size right color tan 1 )but price way to high $41.54 order ID:114-87457529393834 . Will you please straighten out this mixup? I don’t have a printer to print return labels. I wish to credit these money back to my account and I will continue shopping for the right product at the price That I’ll be happy with. Please text me tell me what can be done, Thank you.",
      "rating": 1.0,
      "verified": true,
      "author": "betty stigler",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Love Bare Minerals",
      "text": "I have crepey under eyes and concealers normally clump up. But with this if I just pat it lightly with my finger it goes on well and lightens up the dark circles. Dont rub it in, pat it on with your finger tip then after you apply foundation to the rest of your face, patt setting powder lightly over concealer. Dont use foundation under the eyes just the concealer :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Carr",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "My new go to!",
      "text": "Used for clearing up under eye tired eye look. Great coverage that lasts along with spf 20! Not too sheer but also not too thick &buildable. The package is small but fair in price considering better ingredients than most. May look almost greasy in container but really not greasy. Has just enough moisture for helping any fine wrinkles but not dry. Also came safely & perfectly packaged. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Calor_de_Cali",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Kinda disappointed because this is a no return policy",
      "text": "I wasn’t a big fan of this product. A little greasy and didn’t last all day. I accidentally touched the quick order button and was surprised to see this in my doorstep. Kinda disappointed because this is a no return policy. I definitely deleted all of those stupid buttons so this can’t happen again.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne Leddy",
      "helpful_votes": 2,
      "publication_date": 20180615
    },
    {
      "title": "Not the coverage I was looking for",
      "text": "I don’t know if I would buy this product again. I have semi dark circles under my eyes and it did not give me the coverage I need. I will stick with my Tarte concealer, even if it is pricier",
      "rating": 3.0,
      "verified": true,
      "author": "abi",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Love bareminerals!",
      "text": "Bareminerals makes a great product for concealing my under eye circles and fine lines. It helps soften my fine lines to make them less noticeable. Really love their products!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle T",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "My favorite concealer",
      "text": "I love this product, and a little bit goes a long way!! All you people on here complaining about the size of it... it's meant to be a spot/under eye concealer not something for your entire face! I had mine for 2 months before I needed to reorder, so stop giving bad reviews because you're not using it properly. Ugh, seriously people... This concealer is awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniloo",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "True Savings!",
      "text": "So far so great.....this is the true artifact! Thanks for the savings Amazon. I tried two others prior and.......BARE MINERALS, they were NOT!!! Not even close!!",
      "rating": 5.0,
      "verified": true,
      "author": "\"Beezer\"",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Great coverage, at least for my undereyes!",
      "text": "I have really dark circles under my eyes due to poor sleep. This provides great coverage under my eyes, blends really well, and holds up decently throughout the day! (I bake using pressed powder after applying to set it.) It feels really light & not cakey at all. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Chrystal",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "I like it",
      "text": "It’s a good concealer. It’s not high coverage but does good enough to where under loose mineral foundation.",
      "rating": 3.0,
      "verified": true,
      "author": "Crys",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Light and breathable on your face.",
      "text": "Great product!! It really works to correct and redness or blemish marks.",
      "rating": 4.0,
      "verified": true,
      "author": "Darcy Jackson",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "A concealer that corrects",
      "text": "A cream concealer that is best used sparingly. I use a small brush to apply under eyes, red spots, and the howdy doody lines. Blend it in and apply foundation and powder. Covers and wears well.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Steckline",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Too light-weight. Doesn't do the job.",
      "text": "Too light weight, so it doesn't conceal in any way. Waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Betsyi",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Works great for covering up red lines",
      "text": "It's very light I. Need to go one darker this time",
      "rating": 4.0,
      "verified": true,
      "author": "Gazell42",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Good brand works good",
      "text": "Works nice. Small little container but goes far. I like the brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Redwood",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Don't buy this product",
      "text": "You cannot open the little compact without breaking a nail. Then once you get it open, it does nothing. They will not accept returns if you don't like it either. You must get a pair of pliers to open it. I think they should pay for repairing my nails.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Schneider",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "The Best",
      "text": "I have tried all kinds of concealers and have never been as satisfied as I am with this product. I cannot use powered products because of my very dry skn ,,, so I was surprised to find Bare Minerals with a cream based concealer. Really glad that I tried it. I use Light 1 and it completely covers dark circles, red and brown spots and looks completely natural.",
      "rating": 5.0,
      "verified": true,
      "author": "TM Ohio",
      "helpful_votes": 2,
      "publication_date": 20140304
    },
    {
      "title": "great product",
      "text": "I like to put a thin line under my outer arch of my brows. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Mc",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great concealer small amount",
      "text": "I love this concealer there just isn’t much of it.",
      "rating": 5.0,
      "verified": true,
      "author": "nikki baker",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Great coverage",
      "text": "Very happy with this product. Good coverage, goes on creamy and smooth",
      "rating": 5.0,
      "verified": true,
      "author": "Kay D Homan",
      "helpful_votes": 3,
      "publication_date": 20170227
    },
    {
      "title": "Does not do the job",
      "text": "I thought this was going to be a powder like one I had bought before. It turned out to be a cake type that is rubbed on. I like this company's product so I thought I would try it. For a cover up, it didn't.",
      "rating": 2.0,
      "verified": true,
      "author": "Debbie Carpenter",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "mediocre",
      "text": "The concealer is fairly light, but that means that, under the eyes, it sits in the wrinkles under my eye and for covering a dark spot or blemish, it's just not that effective. Returning to Nars.",
      "rating": 3.0,
      "verified": true,
      "author": "Mo-shop",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Worst product",
      "text": "This product I extremely low quality and tiny size. Not recommended at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Ruma",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great",
      "text": "Great product! Lasts a long time. I apply with a flat brush. Great for pale skin. Blends great and helps if the area is a little dry...wont make it look worse like powder.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca G.",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Nice Concealer",
      "text": "Excellent concealer. Very smooth and easy to apply. Blends very nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria M. Campbell",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Five Stars",
      "text": "Only products I use and great full that I can purchase at a better price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Best I have found for a cream concealer",
      "text": "Best I have found for a cream concealer. needs very little to work on the under eye area. The light works well as a highlighter.",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Must have!!",
      "text": "Really like this concealer. I have dry skin and this product goes on easily and lasts long. Definitely worth buying.",
      "rating": 5.0,
      "verified": true,
      "author": "G Garcia",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Weightless face powder",
      "text": "I like the weightlessness of this powder. It evens out my skin tone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen A. Miller",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Expired makeup",
      "text": "I would have given this a 5 star but the package that arrived today has an expiration date on it that is this month! This obviously has been laying around the warehouse and now I have to return it. I won’t wear old makeup.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenifer Hordych",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "The best concealer you will ever buy!",
      "text": "Its the best concealer and i would not use anything else. Love that it has a mirror inside too!!",
      "rating": 5.0,
      "verified": true,
      "author": "kristy",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Good item!",
      "text": "Good item and mailed very quickly. I always love bare minerals!",
      "rating": 4.0,
      "verified": true,
      "author": "Kaysea",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "This covers well and stays on pretty well...",
      "text": "This is a great cover up and has sunscreen too!",
      "rating": 5.0,
      "verified": true,
      "author": "mary lanser",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Coverage not as expected, especially for the price",
      "text": "This seems to work well for dark shadows under the eyes, but I have a dark spot on my cheek that it doesn't cover very well. I did give it three stars because it does cover better than anything else I have found. But for the price I expected more.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim B",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Five Stars",
      "text": "Blends well and covers nicely. Feels light, yet you don't need much. This little thing lasts for months!",
      "rating": 5.0,
      "verified": true,
      "author": "Peni V.",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Nice All Around",
      "text": "Nice texture and color match-easy to integrate on face and feels light.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally A. Schwartz",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Bad return policy",
      "text": "Doesn't conceal and doesn't last. Worst part is it's non returnable. Will not be ordering from this seller again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "I would be lost without this!",
      "text": "I love this concealer! I have 4 young children and I probably don't get as much sleep as one person should, yet I always look refreshed and it's thanks to this concealer. Without it I would look like a raged zombie while grabbing my Tiramisu Latte and attending to my mom duties.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniella Moore",
      "helpful_votes": 0,
      "publication_date": 20150709
    },
    {
      "title": "Great concealer",
      "text": "I've been using this concealer for years. Love it and love that I can have it delivered to my door.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary T.",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Easy on",
      "text": "Easy on n off. Stays on for a good while.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Moultrie",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "It make your face look fresh all day.",
      "text": "I love this concealed. I used it for the hold face.it helps my makeup stay all day fresh. Love love love it.I bought 2 time .I am going to buy another one soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great Concealer",
      "text": "I have been using this for years. It's creamy and offers good coverage yet lightweight. Lasts pretty much all day if set with powder.",
      "rating": 5.0,
      "verified": true,
      "author": "SChin",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "Great traveler as well",
      "text": "I've used this product for years. It is part of the daily routine. Great traveler as well. Never disappoints. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie_in_Ojai",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Can't do without this",
      "text": "This is another of those products that I cannot do without. I use it as an eyelid primer and also for a cover for small imperfections. It stays on forever. Love it! Use it every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Gini Johnson",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Amazing under-eye concealer!",
      "text": "Amazing concealer! My BE foundation color is \"fairly light\" and this concealer in light 1 fits perfectly. It actually melt & blended like a 2nd layer of skin. My dark circle is almost invisible. Totally agree with another reviewer that pick the right color is key. Use this product as the final step to conceal.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy L.",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Great Concealer",
      "text": "This concealer works great for me! I have awful under eye circles and this has worked wonders covering them up. It lasts a while, I buy one about once every 3 months. So, very worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenico.Wil",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "Not what I expected",
      "text": "It wasn't what I was expecting at all. It was very very small",
      "rating": 2.0,
      "verified": true,
      "author": "jackie",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Four Stars",
      "text": "Great for blending. Very light weight coverage, perhaps too sheer",
      "rating": 4.0,
      "verified": true,
      "author": "Emily Fisher",
      "helpful_votes": 2,
      "publication_date": 20160207
    },
    {
      "title": "100% coverage",
      "text": "100% coverage for me. Love it and very light weight too. Will totally buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Four Stars",
      "text": "Smaller package than expected but LOVE the coverage of the makeup",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa A Terrill",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Smooth",
      "text": "Just applying a little bit, makes the skin looks smooth and It gives a natural look.",
      "rating": 5.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "So So",
      "text": "Alright, was hoping for a little more coverage, and to last a little longer.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles w",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "I'm pretty sure this is counterfeit",
      "text": "The packaging and color are subtly different than the bareMinerals concealer I was trying to replace from Sephora. I don't believe that this is the real bareMinerals brand.",
      "rating": 1.0,
      "verified": true,
      "author": "M2",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great product!",
      "text": "Love this concealer! Definitely works like magic. Leaves your face looking smooth and free of marks. I will always use this product for quick touchups and for concealing blemishes! Works GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Segura",
      "helpful_votes": 0,
      "publication_date": 20140812
    },
    {
      "title": "Perfect Concealer",
      "text": "I have used this concealer for several years now, and it's my favorite. It is easy to apply with a brush or your fingers and feels good on my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Lovechunk",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "works well, but has a long list of potentially toxic ingredients.",
      "text": "this product works very well... I just wish they had better ingredients. there is a lot of crap in here that I don't want to put on my skin every day...",
      "rating": 4.0,
      "verified": true,
      "author": "Evan J Duda",
      "helpful_votes": 2,
      "publication_date": 20160104
    },
    {
      "title": "no no no in my (beyonce voice)",
      "text": "its to small and not enough but i still love baremenarals",
      "rating": 1.0,
      "verified": true,
      "author": "DeWayne",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Wonderful flaw cover up.",
      "text": "It was lighter than I thought but worked even better. It covers my red discolorations and age spots and the slightly lighter color makes the color very uniform once the foundation is applied over the concealer. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazing",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "Really happy with the smooth application",
      "text": "I've been using this product for several years. Really happy with the smooth application",
      "rating": 5.0,
      "verified": true,
      "author": "smiley",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "BEST CONCEALER",
      "text": "This is my 3rd purchase of this product. I have EXTREMELY fair and sensitive skin. This is by far the best concealer I have ever used. Never cakey.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Parker",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "It works great for me as usual",
      "text": "It works great for me as usual. I like it because it stays moist on my dry skin and coverage is good.",
      "rating": 5.0,
      "verified": true,
      "author": "Sortofa Handyman",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Does the job.",
      "text": "Same as if I were to buy it at department store. Difference is cost less than department store.",
      "rating": 5.0,
      "verified": true,
      "author": "SKK",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "good quality. I have used this product before",
      "text": "good quality. I have used this product before. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Extremely happy with this product",
      "text": "Extremely happy with this product, matches my tan skin perfectly. I already own the light one. Price is also great!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Patrick Murphy",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Three Stars",
      "text": "This product is OK, but does not seem to stay throughout the day.",
      "rating": 3.0,
      "verified": true,
      "author": "Gail W",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "but best cover. Love it",
      "text": "I've tried roll-ons, liquids, etc. in concealers. This is the easiest, least noticeable, but best cover. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Pettifur Jean",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "effective and is smooth and helps the complexion look really nice. I love",
      "text": "this concealer is lightweight, effective and is smooth and helps the complexion look really nice. I love .Bare Escentuals products as they6 are non-perfumed and a fabulous product and with a reaonable price for such a great quality product,",
      "rating": 5.0,
      "verified": true,
      "author": "BM",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "I love it!",
      "text": "I tend to get concealers that are too light. This one blends so well with my skin tone and hides my dark circles under my eyes! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Gina G",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Not what I expected",
      "text": "To light for My skin tone a little to thick",
      "rating": 2.0,
      "verified": true,
      "author": "Lyndsey",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "A little light and somewhat greasy - otherwise for a ...",
      "text": "A little light and somewhat greasy - otherwise for a little coverage, it works. I need more coverage because of blemishes.",
      "rating": 3.0,
      "verified": true,
      "author": "hopechest",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Amazon has a great price and the delivery was quick",
      "text": "This works very well to help conceal my Rosecea. Amazon has a great price and the delivery was quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Memaw",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Good product",
      "text": "I usually buy light 2 but since i dont have a tan yet i went with light 1. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Five Stars",
      "text": "Good cover up, buildable, stays in place pretty well on my combo skin with powder over",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Lanfri",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Pretty Good, Needs a Brush",
      "text": "The only reason I did not give this 5 stars is that it doesn't come with a brush, nor does the product description and customer reviews say you need a brush to apply it. Yes, you can use your index finger, but it makes too deep a mark in the concealer cake and does not go on smoothly. You need a brush to use this!",
      "rating": 4.0,
      "verified": true,
      "author": "Ann W. Turner",
      "helpful_votes": 3,
      "publication_date": 20171009
    },
    {
      "title": "Three Stars",
      "text": "Bought on recommendation from a coworker. For me, doesn't stay even when set with powder",
      "rating": 3.0,
      "verified": true,
      "author": "ck",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Not enough coverage",
      "text": "Does not cover my under eye circles. Ordered the light color but it is more medium beige. Goes on translucent.",
      "rating": 3.0,
      "verified": true,
      "author": "Beverly Alt",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "... then I thought it would be - but a great concealer",
      "text": "This was smaller then I thought it would be - but a great concealer",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141230
    },
    {
      "title": "Two Stars",
      "text": "I am unable to use this product as it is darker than expected.",
      "rating": 2.0,
      "verified": true,
      "author": "Marison",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "If u want to buy plastic and no product, purchase. Not happy",
      "text": "Rip off, no product just plastic, will not order again.",
      "rating": 1.0,
      "verified": true,
      "author": "Danica",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "BareMinerals Concealer",
      "text": "This was my second purchase of the Bare Minerals concealer. I apply the \"Medium 2\" with a brush after using SPF 30 Complexion Rescue tinted moisturizer \"Natural\". Both are good color matches for me (no yellow or orange). I apply the SPF 20 concealer over brown spots which lightens them, then add a second layer over the darker ones, still a bit visible, but an improvement. The concealer never hardens in the container as a different brand has done. And the container has never broken as many make-up products can. No problems with breakouts or clogged pores. Always cleanse before bedtime! I also enjoy using BareMinerals lipsticks and glosses, blushes (Beauty and Lovely), lip liners (Electrified and Revved), and powders.",
      "rating": 4.0,
      "verified": true,
      "author": "Lin",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Real nice product & came quickly",
      "text": "Received it quickly & it was perfect. Goes on nicely too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kara Emmons",
      "helpful_votes": 0,
      "publication_date": 20141209
    },
    {
      "title": "I just love the",
      "text": "Matched my skin tone exactly. Goes on very smooth. I just love the product",
      "rating": 5.0,
      "verified": true,
      "author": "connie brock",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "I have rosacea and this concealer is excellent at demenishing the red down to barely there",
      "text": "I have rosacea and this concealer is excellent at demenishing the red down to barely there. This is before makeup. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Shier",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Alright",
      "text": "I'm giving theee stars because you can spend the same amount of money at the bare minerals store and get a larger product. This is about the size of a quarter. Granted, you don't need much and the makeup itself is great for coverage and what you would expect from bare minerals, it's just smaller than I thought. I but a lighter color and use it under. My eyes to give a \"glow\" and appearance I'm not tired so I don't need much and this will last me. But be aware.",
      "rating": 3.0,
      "verified": true,
      "author": "ChrisTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Happy customer",
      "text": "\"How did this item meet your expectations?\" It didn't meet my expectations but my wife was very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Metz",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "and was very pleased it was exactly the product it says it was",
      "text": "Received item sooner then expected , and was very pleased it was exactly the product it says it was",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "love it",
      "text": "I only use Bare Minerals because of my sensitive skin. finding a concealer that doesnt have that harsh Oil is next to imposible. this concealer is amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "One Star",
      "text": "I liked the powder concealer better. Didn't like the cream one at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl Holmes",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Just okay",
      "text": "A little too heavy and dry for mature skin. Works well if you want to conceal just a blemish or brown spot.",
      "rating": 3.0,
      "verified": true,
      "author": "RMR",
      "helpful_votes": 0,
      "publication_date": 20150320
    },
    {
      "title": "Correcting concealer.",
      "text": "Best correcting consealer for me. Spreads on evenly and lasts all day",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20140829
    }
  ],
  "product_meta": {
    "title": "bareMinerals Correcting Concealer SPF 20, Light 1, 0.07 Ounce",
    "description": "Color:LightCorrecting Concealer SPF 20 provides lightweight coverage, helping to decrease the appearance of dark spots and discolorations for a radiant, even-toned complexion. Using a powerful botanical brightener plus broad spectrum SPF 20, this creamy concealer for acne works to visibly brighten skin while providing medium-to-full coverage. Formulated without parabens, synthetic fragrances or artificial oils, it blends seamlessly to conceal blemishes, dark under eye circles and other skin imperfections all day long.",
    "rating": 4.5,
    "feature_bullets": [
      "This is a aluminizing pen that brings light and radiance to the skin",
      "Immediately erases any signs of fatigue",
      "It brightens the complexion",
      "Free from parabens, synthetic fragrances and artificial oils"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 4 inches; 0.16 Ounces",
      "Item model number": "59664",
      "UPC": "885316888142 885475397929 637686334053 098132253555 699107497525 885699837072 098132253630 799289429175 149818937020 798813161857 794437102429 637688435086 637685282119 785927551094 637685421570 885692387574",
      "Manufacturer": "bareMinerals",
      "ASIN": "B008XCNH0W",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Concealers & Neutralizers",
      "Face",
      "Beauty & Personal Care"
    ],
    "price": 15.14
  }
}