{
  "website_summaries": [
    {
      "verdict": "A popular fragrance that has a candied floral scent, a neutral appeal, and a good value for its cost.",
      "pros": [
        "Users rave about the classy, beautiful scent and notion that the size you receive is a good value",
        "It is a bit lighter and more neutral than some of the other versions, making it very versatile"
      ],
      "cons": [
        "A few felt that the spice note was a bit too strong"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not the same as the picture, BEWARE",
      "text": "I was so excited to find my FAVORITE scent on here, as it is hard to come by nowadays. It is NOT it. Although it is Burberry, and smells nice, it is NOT the original scent that I have been wearing the last 7 years. Super bummed. I tried to return it and it was an item that is unable to be returned? I contacted customer support because it is pretty spendy for something I do not want... they refunded me.",
      "rating": 3.0,
      "verified": true,
      "author": "Normandy Bernard",
      "helpful_votes": 8,
      "publication_date": 20200108
    },
    {
      "title": "Buyer Beware!",
      "text": "Do not purchase. Not authentic and there is no refund for this $75.00 knock off. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "DBell",
      "helpful_votes": 10,
      "publication_date": 20190220
    },
    {
      "title": "NOT the same as picture!",
      "text": "I guess it's a new look but what comes is NOT what is pictured! This has been my favorite perfume for years and this one does NOT smell the same. Disappointed. Since I can't return it I guess I'll try it out.",
      "rating": 1.0,
      "verified": true,
      "author": "SonoMom",
      "helpful_votes": 4,
      "publication_date": 20200105
    },
    {
      "title": "Not pictured",
      "text": "FYI the picture showed isn’t the product that ships! Annoyed...",
      "rating": 1.0,
      "verified": true,
      "author": "Sami",
      "helpful_votes": 4,
      "publication_date": 20191221
    },
    {
      "title": "Ordered Burberry HER got Burberry Brit for Her WRONG",
      "text": "I did not receive what I ordered I some of the words were not visible so it appeared the right one. Anyway gave it to someone for xmas wrong perfume and now cant exchange for the correct Burberry perfume and it smells so strong and not something I could wear",
      "rating": 1.0,
      "verified": true,
      "author": "Tammy",
      "helpful_votes": 2,
      "publication_date": 20190121
    },
    {
      "title": "Exactly what I wanted",
      "text": "I like the smell. It is subtle and doesn't overtake but lasts awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "LG",
      "helpful_votes": 4,
      "publication_date": 20190829
    },
    {
      "title": "Perfect",
      "text": "I have been looking for a perfume that both me and my husband like on me. I love it. I bet I wear this for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Kelly",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Love this smell!!!",
      "text": "This has beenybgo to scent for 10+ years. Smells amazing and I never get tired of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Favorite perfume ever!!",
      "text": "My favorite perfume ever! Was so excited to have it delivered. The price was what I normally pay for a slightly larger bottle everywhere else, but it was nice to just have it sent right to my doorstep for once.",
      "rating": 5.0,
      "verified": true,
      "author": "LJ",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "I love the product",
      "text": "I love the product, have been wearing for years. However the bottle clearly says 1.6 oz and they're selling it as 1.7 oz. a minor correction is needed.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Love it",
      "text": "I had been looking for this for a long time I love it. It is light and refreshing and the size is just right",
      "rating": 5.0,
      "verified": true,
      "author": "NRC",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Wonderful all around",
      "text": "Cant beat the price anywhere online and retail, made for a perfect Christmas Present...will be coming back for future purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Church",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "The Best fragrance Ever!",
      "text": "My husband gave this to me for Christmas. He made the purchase based on people's comments on line!!! It is my most favorite perfume ever!!! The bottle will not last long. The packaging and bottle is lovely.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Farber",
      "helpful_votes": 3,
      "publication_date": 20140218
    },
    {
      "title": "I like it very much",
      "text": "Although not the fragrance I thought I was ordering, I like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "SWEETWATER",
      "helpful_votes": 3,
      "publication_date": 20160722
    },
    {
      "title": "I thought I remembered her saying that she loved this scent",
      "text": "Went on a limb to get this for my girlfriend for Christmas, I thought I remembered her saying that she loved this scent. I wasn't dissapointed and to my relief, she absolutely loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dakota Woodie",
      "helpful_votes": 3,
      "publication_date": 20170108
    },
    {
      "title": "Five Stars",
      "text": "I love this perfume!! I got a lot of compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Reina",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Very Unsatisfied",
      "text": "Bought a larger bottle last year and was cheaper if not the same price and it wasn't even the same Burberry I thought I was ordering, decided to go to my regular perfume place in the mall and bought a larger bottle for 60.00 dollars. Very unhappy and wont be buying it online ever again",
      "rating": 1.0,
      "verified": true,
      "author": "Arline Warren",
      "helpful_votes": 5,
      "publication_date": 20140117
    },
    {
      "title": "Very metrosexual",
      "text": "I generally don't like strong fragrances - light and clean/crisp is what I tend to buy. This, however, was a pleasant surprise. It is more musky than I usually wear, but I've gotten compliments every time I've worn it. I do like that in a fragrance. I think it's a bit strong when I first apply it, but that goes away fairly quickly without losing the fragrance by the end of the day. I'd like my DSU (darling spousal unit) to try it sometime - see how it wears and my reaction to it.",
      "rating": 4.0,
      "verified": false,
      "author": "PJ Coldren",
      "helpful_votes": 0,
      "publication_date": 20140704
    },
    {
      "title": "My Women Friends Do Not Much Care for this Cologne",
      "text": "I asked four women to try this cologne. Three out of four did not care for it. One found it loud, another found it harsh and the third found it had the smell of what she called \"old lady powder.\" The other woman was quite pleased with it. I realize, however, that four votes are not a statistically valid sample and that taste for perfume is very, very subjective. Perhaps other women will find the cologne to their liking. Everyone agreed that the cologne is very well packaged.",
      "rating": 3.0,
      "verified": false,
      "author": "Foster Corbin",
      "helpful_votes": 0,
      "publication_date": 20140716
    },
    {
      "title": "Daughter and I are fighting over this bottle!!!",
      "text": "Both my daughter (19) and I LOVE this scent. It is very light, not overwhelming as some fragrances are, flowery, sweet, spicy.....I'm not good at picking out exact scents, but this one is very pleasant. One little squirt and you're set for the entire day. Many perfumes give me a headache or make me sneeze, not this one. The bottle is beautiful as well! I would definitely recommend this, would make a lovely gift.",
      "rating": 5.0,
      "verified": false,
      "author": "Lauri",
      "helpful_votes": 8,
      "publication_date": 20140707
    },
    {
      "title": "Beautiful scent",
      "text": "I purchased one of the sample-sized mini bottles (which I can't find the listing for but are absolutely adorable and the same scent anyways) and this is currently my favorite scent out of my whole collection. It's the right strength but a light scent. It neither that chemical-ish alcohol smell that I despise with fragrances (yet seems all too common), nor the sneeze-inflicting powder smell of overly-floral frangrances. This is a great daytime scent for going to work or just to feel pretty ;) It's not your grandmother's perfume, so to my fellow young adults, don't fear! It's a great addition to your collection and a great staple in your routine.",
      "rating": 5.0,
      "verified": false,
      "author": "L. Keller",
      "helpful_votes": 5,
      "publication_date": 20131127
    },
    {
      "title": "Nice Perfume",
      "text": "I really liked this perfume. My biggest problem with Burberry is that a lot of their scents are cloying and flat, often with a chemical tang that I can't stand. However, this scent is really nice. It's a little bit spicy, and to me smells sweet without being childish. I think it's a nice, professional scent. Its a little bit stronger than I usually like, but Brit makes it work.",
      "rating": 4.0,
      "verified": false,
      "author": "Aperson Smith",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "great 'classic' scent",
      "text": "if you're tired of perfumes that have that same overpowering flower-y scent, this Burberry Brit is a pretty good choice. not too overpowering for sensitive noses, and not so weak that you feel you're not wearing any perfume at all. good choice for any situation. :)",
      "rating": 5.0,
      "verified": false,
      "author": "bOoKwOrM",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "Bottle design looks masculine..perfume feminine!",
      "text": "Design is something I don't understand..the name either..Brit? The fragrance its self is pretty luscious to me. Flowery but not overwhelmingly so..peony, pear, lime..vanilla + amber..a little woody, earthy even. This is the lighter version of the actual perfume but it does last several hours. Nice size bottle for the price. Made in France :)",
      "rating": 5.0,
      "verified": false,
      "author": "lizardwitch",
      "helpful_votes": 0,
      "publication_date": 20140713
    },
    {
      "title": "Great Refreshing Scent for Any Age Woman",
      "text": "Burberry Brit Eau de Toilette (for women) has a subtle scent that's very refreshing. It's not flowery, musky, or \"perfumey.\" In fact, it's more like vanilla with some floral undertones. It could be worn by a young or mature woman; it's not age-defining. I would say it makes an excellent gift for any woman.",
      "rating": 5.0,
      "verified": false,
      "author": "Eric K.",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Very nice light fragrance",
      "text": "Very nice light fragrance! It smells great on my wife. The sugar/spice scent is very pleasing. I would buy this again.",
      "rating": 4.0,
      "verified": false,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20140703
    },
    {
      "title": "Smells great, I think, WEAK",
      "text": "It is SO weak I can barely tell what it smells like. I think it smells great, but I'm not sure.",
      "rating": 3.0,
      "verified": false,
      "author": "B. Dunn",
      "helpful_votes": 0,
      "publication_date": 20140621
    }
  ],
  "product_meta": {
    "title": "Burberry Brit For Her Eau de Toilette Spray",
    "description": "Style:Burberry Brit For Her Eau de Toilette Spray, 3.3 Fl Oz| Size:3.3 Fl OzBurberry Brit Eau de Parfum is a green oriental fragrance with an unexpected blend of sugar and spice. The scent features fresh and playful top notes with Italian lime, icy pear and crisp green almond. Soft floral heart notes of lush white peony are sweetened with sugared almond. Warming amber and mahogany are calmed with sensual notes of vanilla and tonka beans. Presented in a check glass bottle.\n\nBRAND STORY\nFounded in 1856, Burberry is led by principles of design, innovation and expert craftsmanship. Our signature fragrances are presented in crafted glass bottles, with scents inspired by music and fashion, London and British icons.",
    "rating": 4.3,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.88 x 2.91 x 1.61 inches; 10.58 Ounces",
      "Item model number": "BURBRIF0110002",
      "Department": "Womens",
      "UPC": "545493535368 882985091194",
      "Manufacturer": "BURBERRY",
      "ASIN": "B0080GL19K",
      "Amazon Best Sellers Rank": "#65,201 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Eau de Toilette",
      "Women's",
      "Fragrance",
      "Beauty & Personal Care"
    ],
    "price": 98.0
  }
}