{
  "website_summaries": [
    {
      "verdict": "FIFA Soccer 13 on the Wii U might lack some of the series' latest tweaks, but it still plays an enjoyable and thoroughly rewarding game of football.",
      "pros": [
        "Exciting and satisfying matchesTouch-screen management controls are a great addition, particularly in co-opExcellent presentation"
      ],
      "cons": [
        "No EA Sports Football Club or Ultimate Team modesOlder physics engine causes some odd player interactionTouch-screen controls for passing and shooting interfere with the flow"
      ],
      "aspects": {},
      "publication_date": 20121201,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Probably one of the best multiplayer games on Wii U",
      "text": "My two boys and I have thoroughly enjoyed FS13 for Wii U. It is no doubt one of the best games on the Wii, especially that allows multiplayer. I like how neat the commentators make it all sound so real. It is practically spot on on many levels. I also love how they fashioned the players to mimic the actual players. Eg. Drogba has better dribbling skills than other players. But he also falls too often - just like the real thing. More importantly, I like how the game makes my kids want to go out and play the game outside like Messi! They asked me to paint our lawn like a football pitch.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20130806
    },
    {
      "title": "This plays just like any other",
      "text": "FIFA is FIFA. This plays just like any other. I thought the gamepad features were interesting in theory but they are very hard to incorporate into my style of play which is fast paced and eyes on the TV alone! Still gets played once in awhile and is in the upper half of Wii u games that I like",
      "rating": 4.0,
      "verified": true,
      "author": "Isaiah S.",
      "helpful_votes": 0,
      "publication_date": 20160323
    },
    {
      "title": "Bought it for the kids... they love playing it",
      "text": "Order this, along with the new Donkey Kong(for my 5 year old), and 007(for my 14 year old). Both seem to mainly only play FIFA 13! Could have something to do with them finishing up their first year of team soccer. I've played a few times with them. The game has the 4 player option, so I've whooped them in a couple exhibition games, me vs them. Graphics look pretty good! And the price is right!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Malo",
      "helpful_votes": 3,
      "publication_date": 20140520
    },
    {
      "title": "Son Plays It All The Time",
      "text": "My son has played football for years. This game has gotten him so interested in soccer that I belive he might change his primary sport of choice next year. He loves Real - Salt Lake and plays as that team on this game. He created a player that looks very much like him, gave him a number and plays as that character in all the games. It keeps his stats just like it does for all the players on team. This is truely an enjoyable game for my son. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney S. Putnam",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "An awesome game",
      "text": "I don't think people understand how much better this game looks on the Wii U than it does on the 360 or PS3. The graphics in this game are really quite incredible. I would say it's closer to the PS4 version than it is to the last gen consoles. Great gameplay, lots of fun, and really cheap. Who cares that it's a year old? Getting people to buy a new sports game every year when it has barely changed is nothing but a scam. (Granted there is no FIFA 14 for Wii U). Either way, get this game.",
      "rating": 5.0,
      "verified": true,
      "author": "TechGeek",
      "helpful_votes": 0,
      "publication_date": 20140106
    },
    {
      "title": "Good sports title for Wii U",
      "text": "I started playing soccer in a city league so I started to really get into watching soccer on TV and I even picked this game up. I heard its basically like FIFA 12 in terms of gameplay and graphics. Regardless I think the game is pretty good. There is an online community here for the FIFA Wii U owners so thats a plus. The gamepad can be used here for switching up formations and subbing players. You can even play with just the gamepad too.",
      "rating": 4.0,
      "verified": true,
      "author": "KaTzPJamas",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Bargain price at 12 dollars",
      "text": "Very fun with friends. The game pad dynamic is terrible. You touch screen to score and it is garbage. The developers where slacking on this one. Seems rushed. With the pro controller it is very fun. I have only seen the game on the Wii before and this is a million times better. I expected more out of the Wii U. The graphics could be much better. Not nearly as good graphics as NEW 2K. For the money it's a bargain, like most Wii U games.",
      "rating": 3.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Fun at a bargain.",
      "text": "This game has some unique features for the Wii U and the core experience of the Fifa series, its a shame they didn't release fifa 14 but it still brings hours of fun and enjoyment with friends, by yourself or online, the game runs smooth and for the price I definitely recommend it, besides its the only soccer game for wii u and its very good.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos Aguirre",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Great for Wii U owners.",
      "text": "While an older game for the Wii U, it's a great game. Does a good job to include the unique Wiii U controller in a smart way.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Blast",
      "text": "It took awhile to manage the controls but once we did, it was a blast - BLAST!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Waycoldness907",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Good Game, but...",
      "text": "My son likes this game. However, it is a bit glitchy, and while I'm sure the newer versions are better (2014 and 2015), they are alas not being produced for the WiiU. Honestly, I think it's a bad decision by the company.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly D.",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Satisfactory delivery of the product.",
      "text": "Satisfactory delivery of the product. The product was received in a span chord and in good physical condition, I express my satisfacccion with the quality of this product. It is a commonly used product and provides comfort. Sincerely, Jose Flores",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Flores",
      "helpful_votes": 0,
      "publication_date": 20140215
    },
    {
      "title": "Five Stars",
      "text": "Great game as always expensive if you buy the great players look out for that$$$$$!",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro V. Moreno",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Good, but outdated rosters at this point",
      "text": "It would be nice if there was a newer version available for Wii-U, but there isn't. At least FIFA 13 still has the Brazilian teams in it. (The new FIFA 15 available for other systems does not).",
      "rating": 4.0,
      "verified": true,
      "author": "boonboonpow",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "My son loves this game",
      "text": "He is constantly playing this game, it has a lot of options and levels. The graphics are great. Would recommend it for any kid who doesn't keep up with who is on what team, a bargain compared to this years version.",
      "rating": 5.0,
      "verified": true,
      "author": "James Wohler",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "My nephew loves this!",
      "text": "This was one of my nephew's top Christmas gifts and I was delighted to be able to give it to him! I was really impressed with how realistic it seems - I didn't play it, but he really loves it...so that's good enough for me :-).",
      "rating": 5.0,
      "verified": true,
      "author": "EmmaMom",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "Price Can't Be Beat",
      "text": "I was able to purchase this game for about 1/3 the cost of my local big box store. I have played it many times and from the graphics to the multi player options, this game rocks!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20140507
    },
    {
      "title": "fun game for all to play",
      "text": "We've had the game for 2 weeks but my 9 year old son enjoys playing the game and seeing his controlling his favorite players passing, shooting and scoring. This is our 1st soccer video game so I don't have others to compare it.",
      "rating": 4.0,
      "verified": true,
      "author": "P. Ackerman",
      "helpful_votes": 0,
      "publication_date": 20130214
    },
    {
      "title": "FIFA 13",
      "text": "I bought this game for my 12 year old daughter and it's a pretty fun game... not the greatest, but still fun.",
      "rating": 4.0,
      "verified": true,
      "author": "AutyB87",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "LOVE THIS GAME!",
      "text": "My kids and husband love this game. Great effects and commentators make it all seem so real and interactive. If you love soccer you will not be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "Good graphics and controlling",
      "text": "Surprisingly good graphics and plays just like other FIFA versions on the Xbox or PlayStation, minus the graphics obviously.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Good product at a great price.",
      "text": "Liked the game and the qualityyis excellent on the WiiU. First time with a FIFA game and it's more complicated for my kids than I imagined it would be. Will take lots of practice to master",
      "rating": 4.0,
      "verified": true,
      "author": "FranTheMan",
      "helpful_votes": 0,
      "publication_date": 20140401
    },
    {
      "title": "you said is very good condition.",
      "text": "It was not working....you said is very good condition...I received it bad condition...👎🏻",
      "rating": 1.0,
      "verified": true,
      "author": "Fatma",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "I thought there would be so I was greatly disappointed. Otherwise",
      "text": "There is NO ultimate team. I thought there would be so I was greatly disappointed. Otherwise, Its FIFA and FIFA hasn't changed much since 09",
      "rating": 2.0,
      "verified": true,
      "author": "John J. Dover",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Got this for my son. He isn't too fond ...",
      "text": "Got this for my son. He isn't too fond of how long it took for everything to load. Says it does it everytime so I've never seen him on it since.",
      "rating": 2.0,
      "verified": true,
      "author": "C Tew",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "fifa",
      "text": "fifa are one of the must great game, my kids love this game i recommended you'll to take the chance a buy it",
      "rating": 5.0,
      "verified": true,
      "author": "Elvys",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Good Game",
      "text": "I like this game because the graphics are good, compared to the previous version of the Wii. I recommend buying this product and the price is very attractive",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Recomended",
      "text": "Excelent game love it. you will love spending time playing this game a nice one to share with the kids and friends",
      "rating": 5.0,
      "verified": true,
      "author": "Yohel C Villarreal G PTY 11558",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "Great Wii game",
      "text": "Bought this for my grandson. He really enjoys playing it. It seems realistic and as if you are playing in a real soccer stadium.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 0,
      "publication_date": 20140618
    },
    {
      "title": "Great product, lousy company.",
      "text": "Though this probably the wrong outlet for my gripe against EA, they have managed to muscle out PES out of the market and crafted the definitive console football experience.",
      "rating": 4.0,
      "verified": true,
      "author": "Andres G.",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "Great Game",
      "text": "Fun game. Lots of fun to play with friends or by yourself. I would recommend this too anyone with a Wii U.",
      "rating": 4.0,
      "verified": true,
      "author": "blapierre",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Four Stars",
      "text": "A little old for this generation but i like fut ball games.",
      "rating": 4.0,
      "verified": true,
      "author": "julio berducido",
      "helpful_votes": 0,
      "publication_date": 20140918
    },
    {
      "title": "Four Stars",
      "text": "I have had some problems with the disk. Sometimes the game stop and I need to reset the play.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricio Ancavil",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "Great Game!",
      "text": "Fun multiplayer game on the wii U. If you've played any of the other FIfas then you'll like the one for Wii U. it doesnt dissapoint",
      "rating": 5.0,
      "verified": true,
      "author": "Gabi",
      "helpful_votes": 0,
      "publication_date": 20131017
    },
    {
      "title": "To the pitch we go.",
      "text": "EA sucks but this is a WII U game and it is a game I have played with my bro many times.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony L. ",
      "helpful_votes": 0,
      "publication_date": 20140421
    },
    {
      "title": "good game",
      "text": "this game haves a good input with the gamepad useing the touch to shoot and pass plus you can play on the gamepad overall its a good game",
      "rating": 3.0,
      "verified": true,
      "author": "Dennis l Harris",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "Five Stars",
      "text": "Relatively inexpensive and the only decent soccer game on the Wii U platform.",
      "rating": 5.0,
      "verified": true,
      "author": "Giorgio G.",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "Five Stars",
      "text": "very pleased with What do I got the delivery was also very fast I was very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "fernando costa",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Five Stars",
      "text": "My son and I have had some fun with this one. Good game and controls",
      "rating": 5.0,
      "verified": true,
      "author": "JM",
      "helpful_votes": 0,
      "publication_date": 20140926
    },
    {
      "title": "Wish WiiU still had this franchise!",
      "text": "Great game and perfect with the wii pro controller. EA Sports needs to bring FIFA back to WiiU. I would buy this game every year.",
      "rating": 5.0,
      "verified": true,
      "author": "TV",
      "helpful_votes": 0,
      "publication_date": 20140821
    },
    {
      "title": "Great!",
      "text": "My 13 year old son LOVES this game. Totally worth it for the soccer lover.",
      "rating": 5.0,
      "verified": true,
      "author": "GoofyMamma",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "pretty cool",
      "text": "I got this for my brothers and they seem to enjoy it. It's a fun game and nothing to complain about it.",
      "rating": 4.0,
      "verified": true,
      "author": "nayeli",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Fun so far",
      "text": "Bought it for my dad, he seems into it. It's about what I expected based on what I've read about the game.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin Bourguignon",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Its good",
      "text": "I played it before, had fun, but wasn't going to pay top dollar for it. There are FEW, and I like to stress FEW, games that are worth paying $50.",
      "rating": 4.0,
      "verified": true,
      "author": "EZ like All Day Sunday",
      "helpful_votes": 0,
      "publication_date": 20130906
    },
    {
      "title": "if wiu is your only console and you like soccer games go ahead and get it( this is ...",
      "text": "if wiu is your only console and you like soccer games go ahead and get it( this is the soccer available atm). The price is right. but if you have other gaming options skip it an get 14 or 15",
      "rating": 3.0,
      "verified": true,
      "author": "Athan",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "... present for my son but i no he would love it",
      "text": "Its a present for my son but i no he would love it",
      "rating": 4.0,
      "verified": true,
      "author": "caribbean",
      "helpful_votes": 0,
      "publication_date": 20141120
    },
    {
      "title": "Love it",
      "text": "My son and I love it, glat to get these games for Wii U. I would recomend it to my friends",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan Lake",
      "helpful_votes": 0,
      "publication_date": 20140307
    },
    {
      "title": "fifa 2013 wii u",
      "text": "It's the best game and on the best game console. It's innovative, not boring same olé same olé system with new hardware but just a new way to play. Sony and microcrap would be lost without nintendo!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CG",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "fifa 2013 for wii u",
      "text": "excellent game thanks i recommend this game for any one who ownes the wii u yeah lets play fifa 2013",
      "rating": 5.0,
      "verified": true,
      "author": "ULTIMO GUERRERO",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Good game.",
      "text": "Good,efficient delivery as always. An excellent present for a soccer mad family.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Elizabeth J. Wilson",
      "helpful_votes": 0,
      "publication_date": 20161222
    },
    {
      "title": "Great!",
      "text": "I purchased this for my hubby and the image quality is simply astounding. The songs are truly good, too, since I have to listen to them while he's playing, and so far... just great! He's in love with this game, so much so that he ignored all the other games I offered him.",
      "rating": 5.0,
      "verified": true,
      "author": "CLOVIS",
      "helpful_votes": 5,
      "publication_date": 20130310
    },
    {
      "title": "FIFA Fun",
      "text": "This game is much better than I anticipated. It has many game modes to check out and has a good level of customization. With so much to do, it's hard to be bored. It makes great use of the WiiU's gamepad and has great controls. I see why the FIFA games have been around so long.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared Hay",
      "helpful_votes": 3,
      "publication_date": 20130202
    },
    {
      "title": "Great",
      "text": "This game is great and everything i asked for. However, when ever you look at the gamepad and all the options are on the side, you can't see the action on the tv. Overall, I recommend it to anyone looking into buying it!",
      "rating": 5.0,
      "verified": true,
      "author": "James Malson",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "Great Soccer Game.",
      "text": "Multi Screen Technology has arrived and this game shows it off very well. if you love soccer games its a great game to buy. You get a surround sound effect with the Wii U Game Pad and your tv playing audio and video at the same time. Sometimes I watch the game on the gamepad, sometimes I watch it on the TV. the announcers are excellent and the reviews for this game are terrible online. Don't believe everything you hear.",
      "rating": 5.0,
      "verified": true,
      "author": "Cal Runimok",
      "helpful_votes": 4,
      "publication_date": 20130321
    },
    {
      "title": "ok game",
      "text": "i liked paling the game but i don't think it was one of my favorite games on the wii u",
      "rating": 4.0,
      "verified": true,
      "author": "adrian adrian",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "Fifaaaa",
      "text": "Great game to spend time with your friends. Still more to do on EA's side to take advantage of the WiiU's new control.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlos R. Badilla Mejia",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "great price",
      "text": "My son was excited to get this game and he loves it. He has played it every day. great price",
      "rating": 5.0,
      "verified": true,
      "author": "janice smith",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "Best, soccer",
      "text": "The soccer is the beautiful game par excellence worldwide, and this game is for fans to it. The game scenarios and functionality are excellent. Highly recommended playing it, do it. And long live the soccer!!",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Huapaya",
      "helpful_votes": 3,
      "publication_date": 20130320
    },
    {
      "title": "Great game",
      "text": "Best soccer game I have ever played. Also I must say the graphics are pretty impressive for Nintendo!!! Keep it up Wii U.",
      "rating": 4.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 4,
      "publication_date": 20131231
    },
    {
      "title": "FIFA for the U",
      "text": "Fifa for the WII u is great. I have not played much online but I rarely do with sports games. Otherwise, the graphics, gameplay (especially with the gamepad), are all top notch. Love ti.",
      "rating": 5.0,
      "verified": true,
      "author": "Hustles",
      "helpful_votes": 3,
      "publication_date": 20130228
    },
    {
      "title": "fantastic for fifa lovers",
      "text": "i think its really great i say its the best football game in the world yes it has great graphics ya.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Amlap",
      "helpful_votes": 0,
      "publication_date": 20130831
    },
    {
      "title": "Excellent!",
      "text": "It is an excellent game, it's a shame that EA did not make FIFA 14 for WiiU, because I was waiting for it",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Jimenez Salas",
      "helpful_votes": 0,
      "publication_date": 20131125
    },
    {
      "title": "Black Prada33",
      "text": "Good game my kids like it. It's the type of game my kids will play more than once. I love amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelica Denise Godboltangelicagodbolt",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Special moves",
      "text": "It's a great game just need a little more graphics and I think star players should have their signature move",
      "rating": 4.0,
      "verified": true,
      "author": "Marvin Lawrence",
      "helpful_votes": 0,
      "publication_date": 20131213
    },
    {
      "title": "Realistic and entertaining",
      "text": "I'll preface this by saying I'm far from a soccer fan, in fact I mostly cannot stomach the sport, but after my 6 y/o son showed interest I purchased it for us. We play it often and haven't been disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Okay",
      "text": "It is okay figure I would try it out since it is so popular just guess I am just not a sports game type.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicholas Cook",
      "helpful_votes": 2,
      "publication_date": 20140415
    },
    {
      "title": "fifa wiiu game is fun needs ULtimate team",
      "text": "love the game sad that online play is missing love playing while watching tv and also like all the options so far need more updates EA needs more fifa on wiiIU",
      "rating": 5.0,
      "verified": true,
      "author": "MROD",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "Fascinate",
      "text": "These game is really entertainment for the family is very funny when then talk is impressionist at the moment it's play",
      "rating": 5.0,
      "verified": true,
      "author": "Arnulfo Ramos",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "Awesome",
      "text": "I bought this for my boyfriend's birthday. He loves it. I even play it with him. Great Purchase. So much fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Baihley",
      "helpful_votes": 0,
      "publication_date": 20130409
    },
    {
      "title": "Great Value for the Price",
      "text": "Great value for the price. If you have a Wii U then add this to your collection! My three boys 15, 9 & 7 all enjoy playing together.",
      "rating": 5.0,
      "verified": true,
      "author": "HowzitUSA",
      "helpful_votes": 0,
      "publication_date": 20141021
    },
    {
      "title": "Okay game.  review by Dr. Anastasios Pappas",
      "text": "Great price Overall Gameplay is good I guess I am not that into sports games",
      "rating": 3.0,
      "verified": true,
      "author": "tasso pappas",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "Update",
      "text": "The game needs to update its squads and player stats. The winter transfers must be done. Needs better goal celebrations.",
      "rating": 3.0,
      "verified": true,
      "author": "Sergio",
      "helpful_votes": 0,
      "publication_date": 20130407
    },
    {
      "title": "Soccer game",
      "text": "My child is a great fan of ball sports and he loves this game",
      "rating": 5.0,
      "verified": true,
      "author": "Goldenlady2",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Total HIT!",
      "text": "Our 10 yr old LOVED his new Wii U and all five games we purchased for him! We recommend the new console!",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie Q",
      "helpful_votes": 3,
      "publication_date": 20130113
    },
    {
      "title": "Very fun game",
      "text": "This is a very fun game with great graphics. The announcers seem to say the right thing at the right time making the game play realistic",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Emge",
      "helpful_votes": 0,
      "publication_date": 20140216
    },
    {
      "title": "Two Stars",
      "text": "It was a little hard for my 8 year old.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina Michaels",
      "helpful_votes": 0,
      "publication_date": 20150310
    },
    {
      "title": "It's a broken game!",
      "text": "This is one of the worst games I ever played. It's unplayable since it freezes a lot and I have to turn off my wii U pressing the bottom for few seconds. Have clitches. It's a broken game I really don't recommend you.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20141024
    },
    {
      "title": "Good game",
      "text": "It's a good game but doesn't have anything extraordinary, it really doesn't deserve the purchased, better to buy the ps3 or 360 version.",
      "rating": 3.0,
      "verified": true,
      "author": "Leonardo Solano Haeusler",
      "helpful_votes": 0,
      "publication_date": 20131019
    },
    {
      "title": "Empty case...great Christmas gift.",
      "text": "Imagine how disappointed I was when my son opened this game on Christmas Eve. He was so excited to play it, but when we opened it up the case was empty.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "GREAT",
      "text": "It was an amazing game. Totally worth it! Great multiplayer and controls. Definitely get it. Buy it you won't regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Nicolas",
      "helpful_votes": 0,
      "publication_date": 20140628
    },
    {
      "title": "EA SUCKS!!!",
      "text": "EA is trash. This version is so stripped down it's insulting. I love my wii u, mediocre companies like this do not cater to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Victor Mejia",
      "helpful_votes": 7,
      "publication_date": 20131231
    },
    {
      "title": "No EA",
      "text": "How can EA sale a game as this one?. In EA want that I buy all they have but, as a gamer I need more quality, I don't need EA tell me what I have to buy, if they want to sale me a game, they have to make something worthwhile...",
      "rating": 1.0,
      "verified": true,
      "author": "Adelson",
      "helpful_votes": 0,
      "publication_date": 20140616
    },
    {
      "title": "misleading title",
      "text": "The name is misleading. Apparently there is a difference between wii and wii (u). It was not clear and as a result my grandchildren were very disappointed at Christmas. The game would not work on a regular wii controller. It was not worth the difficulty of returning the game. I will chalk it up to experience but will not ever purchase another nintendo product.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20140114
    }
  ],
  "product_meta": {
    "title": "FIFA Soccer 13 - Nintendo Wii U",
    "description": "Platform:Nintendo Wii UEA SPORTS delivers its best soccer game ever on a Nintendo console with award-winning gameplay and revolutionary new ways to play that bring players of all abilities together, making this the most accessible FIFA console game ever made. Innovations that utilize the Wii U GamePad put you on the pitch and immerse you in the action. Lift and look through the GamePad touch screen to aim the ball on set pieces and penalty kicks, then put the perfect curve on your shot and let it fly. Shake the GamePad to activate Touch Screen Shooting, removing the element of 'hit and hope' and allowing for pinpoint accuracy. Plus, connect and interact with friends like no other FIFA title.",
    "rating": 4.3,
    "feature_bullets": [
      "Award-winning Gameplay: Enjoy the award-winning FIFA franchise gameplay, optimized for Wii-U.",
      "Lift and Look: See the game from the player's on-field perspective and enjoy creative new ways to take free kicks and penalties.",
      "Shake and Shoot: Enjoy complete control of shooting - the most rewarding part of the game.",
      "Tap and Tackle: Take control of a specific defender by tapping on the player using the touch screen, taking all the guess work out of auto switching.",
      "Complete Control: Full Team Management Control on the GamePad lets you change formations, make subs, switch player positions, change every facet of a team's tactics, and even set man markers all without interrupting the game."
    ],
    "specifications": {
      "ASIN": "B008UQGHTE",
      "Release date": "November 13, 2012",
      "Customer Reviews": "4.3 out of 5 stars188 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#30,418 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "7.5 x 5.3 x 0.6 inches; 2.4 Ounces",
      "Binding": "Video Game",
      "Rated": "Everyone",
      "Item model number": "19761",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "2.4 ounces",
      "Manufacturer": "EA Sports",
      "Date First Available": "July 15, 2009"
    },
    "categories": [
      "Wii U",
      "Legacy Systems",
      "Video Games"
    ],
    "price": 56.99
  }
}