{
  "website_summaries": [
    {
      "verdict": "This shaker features a convenient built-in agitator and works well for both creamy and thin dressings.",
      "pros": [
        "2 cup capacity",
        "Salad dressing shaker with agitator for all-in-one mixing, pouring, and storing",
        "Features wide pour spout for creamy dressings",
        "Gliding paddle wheel mixes and emulsifies when shaken",
        "Silicone seal for mess free storage and transportation",
        "Dishwasher safe",
        "BPA free",
        "Built-in mixer is useful when ingredients have resettled"
      ],
      "cons": [
        "May not be as dishwasher safe as expected",
        "Consider hand washing"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not dishwasher safe",
      "text": "I bought this because I thought it would be an easy way to store homemade dressing. I could throw it in the dishwasher every few days, easy peasy. The description says it’s dishwasher safe... but when taking it out, the bottle was completely shrunken and disfigured. Would not buy from this company again... why lie?",
      "rating": 1.0,
      "verified": true,
      "author": "RKatt",
      "helpful_votes": 7,
      "publication_date": 20180508
    },
    {
      "title": "Love !!!",
      "text": "Who gets excited over a salad dressing mixer?? ME !!! This thing is fantastic. Quality product made from strong plastic. Measurement markers on the side of the container are great, Spout is secure and pours onto salad well. No leaking when I shake the bottle. And, my favorite part is the mixer. I have a couple recipes that call for honey, which tends to drop to the bottom. The mixer blends all the ingredients to perfection. In fact, I like it so much, that I just ordered a second one. Love it. 👍👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "smores",
      "helpful_votes": 3,
      "publication_date": 20170423
    },
    {
      "title": "Not for thick dressing",
      "text": "This seems to be decently made but it's really not meant for anything like a thicker ranch or caeser dressing. The mixer in the middle doesn't have enough mass to move on its on without extremely vigorous shaking. The other issues are related to the pour spout: Namely that it doesn't pour anything thick very well. It is hydorphobic but unless it's an oil/vinegar based dressing all of it will never run back down into the bottle and you'll have residue stuck in the hinge mechanism which leads to all sorts of issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth King",
      "helpful_votes": 3,
      "publication_date": 20181125
    },
    {
      "title": "Not Good for Ranch Dressing",
      "text": "I got this to mix ranch dressing. It mixes the ingredients well, but it's nearly impossible to pour without a vigorous shaking, which inevitably leads to a huge mess. I'm sure it would work much better for Italian or thin mixes.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Rich",
      "helpful_votes": 8,
      "publication_date": 20170323
    },
    {
      "title": "great at emulsing, if that's a word",
      "text": "I like a number of things about this shaker: I like the 'measuring cup' lines on the sides (one less item to wash); I like that there is a lid; I like that it saves a step and more dishes by doing the emulsion step that some dressings require. the only thing I dislike is that the dressing often drips down the side of the lid/bottle when finished pouring; also, when I accidentally put it into a sinkful of greasy water, I just couldn't seem to get the grease off the in- or outside of the bottle. since most or all dressings contain some sort of oil, I hope this won't be a continuing problem.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Gold",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Love it!",
      "text": "Love this thing! I use it to mix baby formula. It's just the right size to mix up formula for a partially formula fed baby for a whole day. Bigger than a bottle but smaller than a giant formula pitcher for fully formula fed babies. Doesn't leak, just a bit of shaking with that thing inside mixes everything up nicely without excess froth and no formula clumps, pour spout is very nice, washes easy without weird areas of gunk forming. Love that it measures in ounces, mL's and cups! Can't say enough good stuff about this thing! Works perfect for what I needed it for!",
      "rating": 5.0,
      "verified": true,
      "author": "Hale",
      "helpful_votes": 3,
      "publication_date": 20150703
    },
    {
      "title": "Melts In Dishwasher Although It States Dishwasher Safe!!!",
      "text": "Loved This Salad Dressing Container For The Short Time I Had It ... It Says It's Dish Washer Safe - But Melted The 2nd Time Being Washed!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ali",
      "helpful_votes": 8,
      "publication_date": 20151005
    },
    {
      "title": "Best salad dressing holder I've ever had.",
      "text": "Excellent product. This is a great bottle! It does NOT leak. It feels good in my hand. It pours cleanly. The mixer thingy in it is pure genius! Love it. I had been using the \"free with Italian dressing packet\" bottle for decades. That bottle was awful, leaked everywhere. So glad I found this one. Plus I love that it holds 2 cups of liquid.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Holds plenty, mixes well",
      "text": "I like the inside agitator and the capacity. Way better than a cheap cruet. Holds up fine in the dishwasher (turn the dryer off or put on top shelf - it is plastic after all) But - it leaks when you shake it. No a lot, but enough to be annoying. Thus 4 instead of 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "echo21",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "It DOES hold dressing",
      "text": "I had high hopes for this dressing container. It does its duty but unfortunately gets messy. The container top gets hooped up with oily dressing after being shaken and it's difficult to clean. The top has to be washed open and closed in order to get all the dressing off.",
      "rating": 3.0,
      "verified": true,
      "author": "Diana S.",
      "helpful_votes": 5,
      "publication_date": 20150610
    },
    {
      "title": "I especially like the pour spout",
      "text": "I have been impressed with this container. It works well. I especially like the pour spout. I thought it was going to be too wide and that it would be hard to control the flow of dressing, but it works very well. You can easily control how much dressing goes onto your salad. Also, I thought I was going to have to wipe the spout before closing it. However, the dressing slides back down the spout and it is not too messy at all. I've not tried creamy dressings in it yet, but this it true for the olive oil dressings I've made in it.",
      "rating": 5.0,
      "verified": true,
      "author": "SER",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Highly recommended!",
      "text": "I bought this after my Pampered Chef shaker shattered when I dropped it on the floor. I have to say, as much as I loved thePC one, I love this even more. The wide-mouthed pouring spout makes it great for creamy dressings. You don't have to pump the handle up and down to mix--just shake. The seal is tight and nothing leaks. I don't even buy bottled/packaged dressings anymore. Just make your, avoid all the chemicals and use healthier oils! Also great for pouring sauces over desserts (though not exactly classy-looking. But no one at work cares!).",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri Hurd",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Ranch goo and measurements wore off",
      "text": "Edited (1 star) to add: I always washed it by hand to avoid losing the measurement marks in the dishwasher, even though it says dishwasher safe but the marks came off anyway (see my first review, below) so tonight i put it on the TOP rack of my dishwasher and it melted like a shrinky dink! Total waste of money. Previous rating: (3 stars) Mixes but the ranch dressing makes nasty gunk in the top/pour spout and the measuring numbers wore off after only a couple of months.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 2,
      "publication_date": 20180522
    },
    {
      "title": "Great product",
      "text": "This has been th best way to make my dressings for my family. I not only have one I got last I have two and I plan on keeping home made ranch and a vinaigrette dressing at all times. Not to mention it makes fast marinades. Every pleased and highly recommend it is plastic but until my kids are grown I can't have my glass or I would be broke. It is BPA free!! There is a little down side the pour spout does get a little messy but I just wipe and close and put away!",
      "rating": 5.0,
      "verified": true,
      "author": "tna7477",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "So far, so good.",
      "text": "Ive only used it for one dressing that had way to much mustard so its thicker than it should be, but I really love the product. Its easy to handle, mixes well, and its dishwasher safe(which is so important to me) I'm hoping it holds up and I'm looking forward to making more dressings.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Not a tight seal",
      "text": "This dressing mixer worked pretty well. I held the pour spout closed while I shook it and could still feel a few drops eek out, so it's definitely not a tight seal.",
      "rating": 3.0,
      "verified": true,
      "author": "srenee",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Really love this salad dressing shaker",
      "text": "Really love this salad dressing shaker. I just wish there was a alternate top so you could use less without it all pouring out.",
      "rating": 4.0,
      "verified": true,
      "author": "CiaoNJ",
      "helpful_votes": 2,
      "publication_date": 20161128
    },
    {
      "title": "Great For Making Salad Dressing",
      "text": "This made it so easy to make ranch dressing. Didn't have to dirty measuring cup, whisk, spatula, bowl and something else to put it in! It was all done in one simple container!!! I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry S.",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Advertises that it works well for creamy dressings, but ...",
      "text": "Advertises that it works well for creamy dressings, but the mixer spinner just gets stuck in anything thicker than a vinaigrette.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica H.",
      "helpful_votes": 3,
      "publication_date": 20170517
    },
    {
      "title": "Perfect for Homemade Ranch",
      "text": "Not only does this container/mixer do everything advertised very well, it also has the hidden benefit that the swiveling silicone lid/pourer makes pouring salad dressing very easy and accurate. The \"hydrophobic\" nature of the silicone causes the dressing to naturally \"retract\" from the pourer back into the container. I'm going to buy a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Coleman",
      "helpful_votes": 27,
      "publication_date": 20140205
    },
    {
      "title": "LOVE this!",
      "text": "Just received this bottle today and made some poppyseed dressing. The mixer inside the bottle is genius and works amazingly well. The spout feels secure and there is no leaking even when vigorously shaking. Also, looks so pretty in my fridge! I didn't even know I needed one of these until I got it but I love it. Watch the price, I was able to snag it for 8 dollars.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy Runyan Svacina",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Four Stars",
      "text": "I like this little thing for homemade dressings. So far it's holding up in the dishwasher.",
      "rating": 4.0,
      "verified": true,
      "author": "C.S.",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Three Stars",
      "text": "Great idea, but definitely does not work for creamier dressings. I was disappointed, so back it goes.",
      "rating": 3.0,
      "verified": true,
      "author": "loveshoes",
      "helpful_votes": 3,
      "publication_date": 20160517
    },
    {
      "title": "great shaker if you don't mind cleaning the dispenser after each use",
      "text": "works as described, have to clean out dispenser after each use or dressing dries on.",
      "rating": 4.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 2,
      "publication_date": 20161118
    },
    {
      "title": "design fault",
      "text": "The product is ok to use. However, after the first time making dressing, I cannot and nobody around me could help open the lid of this bottle, so I have to throw it away then buy another design. the manufacture needs to fix this problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Hui C.",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Pretty good, small leak",
      "text": "It does have a tendency to leak out of the spout section, but not terribly bad. Be careful adding sugar to your dressings, as this can cause the cap to lock up and takes the strength of a God to open up.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael C.",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great Value",
      "text": "My father needed a replacement for his trusty old salad dressing container which finally fell apart. He loves this. Our homemade dressing does separate and the mixing element on this shaker is perfect!. Mixes things up and gets the job done. I will be buying more",
      "rating": 5.0,
      "verified": true,
      "author": "WSC",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "This thing is awesome, we make home made dressing all the time ...",
      "text": "This thing is awesome, we make home made dressing all the time and this works great. If the dressing separates a quick shake and it is ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "2j",
      "helpful_votes": 2,
      "publication_date": 20151021
    },
    {
      "title": "Five Stars",
      "text": "Great jar for making homemade dressings, which are so easy and much healthier than store bought dressings.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard G Fields",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "great just shake it and it mixes the dressing",
      "text": "great just shake it and it mixes the dressing. Watch out the pour spout is large, lots can come out - usually after one time overdoing it though you won't again, that is only a small issue for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ on the Cape",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "Great dressing holder",
      "text": "Wish it was a bit thinner. Thought fit in fridge door. 1/4 inch thinner would fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Larry S",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Amazing",
      "text": "This is the best dressing mixer I've ever used. It is beautiful and useful. The wide mouth makes it practical for making Ranches and thick dressings. The only issue I've encountered is small amount of leakage when closing the mouth.",
      "rating": 5.0,
      "verified": true,
      "author": "J Peter Jones",
      "helpful_votes": 0,
      "publication_date": 20150928
    },
    {
      "title": "The one thing that I don't like is that it pours out way too much",
      "text": "Mixes your homemade dressings really well, and doesn't leak. The one thing that I don't like is that it pours out way too much.....it needs a smaller spout for pouring.",
      "rating": 4.0,
      "verified": true,
      "author": "PookersMom",
      "helpful_votes": 0,
      "publication_date": 20151113
    },
    {
      "title": "No leaks when mixing",
      "text": "Mixes extremely well, no leaks at all (just hold your thumb over the spout when mixing, for extra peace of mind). Just what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "bflo.expat",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "LOVE!!!",
      "text": "Our family has salad every night of the week and this offers great variety to or different salad dressing makings !",
      "rating": 5.0,
      "verified": true,
      "author": "DorPiz",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "This a great salad dressing shaker",
      "text": "This a great salad dressing shaker. I like that it is large enough for me to make a big batch of dressing, store it in the fridge and pack lunches through the week. The spout does not spill and it is easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Mo B",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Great for making ranch that requires 1 cup Milk and ...",
      "text": "Great for making ranch that requires 1 cup Milk and 1 Cup mayo and seasoning mix. You have to give it a little shake to get the ranch to come out but its the best one I've found and I have tried 4 or 5 different salad dressing shakers.",
      "rating": 5.0,
      "verified": true,
      "author": "MommyMB",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Love It",
      "text": "I bought these to make my own salad dressings and they work well. I haven't had any issues and they mix everything well.",
      "rating": 5.0,
      "verified": true,
      "author": "tomosia",
      "helpful_votes": 0,
      "publication_date": 20160807
    },
    {
      "title": "I love this shaker salad dressing mixer bottle",
      "text": "I love this shaker salad dressing mixer bottle!! I've always loved homemade salad dressing but hated to deal with the leaky shakers and uneven mixing. This bottle NEVER leaks and I've used it dozens of times in the 6 months I've had it. A best buy in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "kimberlychem",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Perfect Size!",
      "text": "We love our salad shaker. Great for my home-made ranch dressing! Easy open & easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany H.",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Leaks!",
      "text": "Leaks! It does not appear defective. Tried cleaning and inspected. Can not find anything wrong, just Leaks!",
      "rating": 2.0,
      "verified": true,
      "author": "beargracieabby",
      "helpful_votes": 2,
      "publication_date": 20150701
    },
    {
      "title": "So far no leaks",
      "text": "Working well so far...no leaks and I love the pour spout.",
      "rating": 5.0,
      "verified": true,
      "author": "luv2cruise",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Great!",
      "text": "I really like this for salad dressing. Perfect size, easy to mix, easy to pour, easy to clean! Great quality and well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexa E",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Love it.",
      "text": "Really simple design, emulsifies well, large pour spout, easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "TresGatitos",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Like!",
      "text": "I really like this Salad Shaker - it's easy to use and cleans up easily. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "dogsmom",
      "helpful_votes": 0,
      "publication_date": 20160524
    },
    {
      "title": "Dressing Salad Shaker",
      "text": "This tool is fantastic! I have tried other \"dressing shakers\" before, but they have not had the mixer like this. I have absolutely loved how well it works! Never a problem getting a well blended dressing!!",
      "rating": 5.0,
      "verified": true,
      "author": "Summer McDaniel",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Progressive International SAL-102 2-Cup Dressing Salad.Shaker..",
      "text": "no muss, no fuss; just add ingredients and shake; the canister does the rest and will keep it when stored in the refrigerator..",
      "rating": 5.0,
      "verified": true,
      "author": "DJBRUCEK",
      "helpful_votes": 0,
      "publication_date": 20141018
    },
    {
      "title": "Five Stars",
      "text": "I love this! I make my own salad dressing and this is great to store it",
      "rating": 5.0,
      "verified": true,
      "author": "laurenrenee",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Homemade dressings!!",
      "text": "I love this container! I've seen other dressing containers but this one is made of a thick plastic and is sturdy and the lettering on it is clear and easy to read.",
      "rating": 4.0,
      "verified": true,
      "author": "Kittypots",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "but still very satisfied.",
      "text": "Works as advertised. A little more effort to clean in the nooks and crannies, but still very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W Boilini",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Five Stars",
      "text": "Gave this as a mother's day gift and she uses it all the time. Loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah M",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "A little messy",
      "text": "Works great but gets a little messy after using it a few times.",
      "rating": 4.0,
      "verified": true,
      "author": "jregb",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Perfect!",
      "text": "This is wonderful for making home made salad dressings. I holds a lot, is easy to fill and pour and easy to take apart for cleaning. The emulsifier really does mix the oil into the dressing!",
      "rating": 5.0,
      "verified": true,
      "author": "jkskillo",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Five Stars",
      "text": "I love my salad mixer. It blends the dressing so good and it is so easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Great little kitchen helper!",
      "text": "Super - helps make and store salad dressings like no other container! Liked it so much, I bought a second one for different dressing.",
      "rating": 5.0,
      "verified": true,
      "author": "FaithfulAmazonCustomer",
      "helpful_votes": 0,
      "publication_date": 20131221
    },
    {
      "title": "Five Stars",
      "text": "Love it! When the contents are shaken they really stay together rather than separating.",
      "rating": 5.0,
      "verified": true,
      "author": "Monte",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Just what I wanted.",
      "text": "Perfect for dressings that need to be emulsified. The measurements on the side let you make dressing right in the container and the container doesn't leak as long as you hold it upright when you shake it (don't point the top upside down). And it's dishwasher safe. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "MMBurns",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Really like the fold down spout - I had other brand ...",
      "text": "Really like the fold down spout - I had other brand with removable spout that was always getting lost!",
      "rating": 4.0,
      "verified": true,
      "author": "DISAPPOINTED",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "I never write reviews but I LOVE THIS salad shaker",
      "text": "I never write reviews but I LOVE THIS salad shaker! The neat spinning piece makes it so easy to blend the balsamic and olive oil that I don't have to spend extra time vigorously shaking it. I also like the large spout.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim T.",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Works great! No leakage",
      "text": "Works great! No leakage. I wanted to have something I could bring to work for my salads. This product was the perfect solution. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "neilly",
      "helpful_votes": 0,
      "publication_date": 20160212
    },
    {
      "title": "Wife Likes",
      "text": "The wife really likes it. Easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "LandDog49",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Five Stars",
      "text": "Awesome mixer, i make ranch with the packets and this works awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Banana",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Nice salad dressing container.",
      "text": "Nice salad dressing container, looks better than the older style containers.",
      "rating": 5.0,
      "verified": true,
      "author": "David L",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Very handy",
      "text": "This is a very handy little bottle. Since I started making my own dressings, I had trouble finding a decent bottle to put them in, and this works great. I like being able to thoroughly shake it up before every use. And though the bottle doesn't dribble down the front when you pour, it does kind of gum up around the rim. It's not a big deal, I can just wipe it off, but it's a touch messy. Still, I'd rather have that than have it dribble and make a mess on my table. I'm glad I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "fourleafclover23",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Good replacement for Seasons",
      "text": "My wife loved it and replace the Good Seasons Cruet",
      "rating": 5.0,
      "verified": true,
      "author": "Eduardo Hernandez",
      "helpful_votes": 0,
      "publication_date": 20151004
    },
    {
      "title": "Easy to use.",
      "text": "But not so easy to clean.I have bought three now and gave one to my son who likes it, too. Easy to mix a dressing. The problem is getting it well cleaned. The dishwasher does not get to all its nooks and crannies.",
      "rating": 4.0,
      "verified": true,
      "author": "Elliott Bird",
      "helpful_votes": 15,
      "publication_date": 20130402
    },
    {
      "title": "Five Stars",
      "text": "I love this but it's too big family. I wish they also had a smaller size.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Leaks",
      "text": "I bought this several months ago and loved it at first - the large opening made adding ingredients easy and the wand emulsified easily. But it recently started leaking out of the spout when shaking, and I have to hold a cloth over it every time I shake. Very irritating",
      "rating": 2.0,
      "verified": true,
      "author": "Terasa Cooley",
      "helpful_votes": 3,
      "publication_date": 20141115
    },
    {
      "title": "No complaints.",
      "text": "Sturdy. Well marked. Large poor spout is good for thicker dressings and it churns throiugh thicker dressings, such as blue cheese, well. Seal when the pour spout is closed is pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 3,
      "publication_date": 20130318
    },
    {
      "title": "Works great. No leaks around lid when you shake it",
      "text": "Works great. No leaks around lid when you shake it.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "Five Stars",
      "text": "Works just like I thought it would, very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "G.Goodman",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Works",
      "text": "No hits, no runs, no one left on base. No leaks either. Works really well.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Ierien",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "I gave it a 1 star only because it does ...",
      "text": "I gave it a 1 star only because it does not work for homemade ranch dressing,,, that's why I bought it. The dressing is much to thick to pour out of the spout. I'm sure it works well with oil and vinager or italian dressings,",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle G.",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "healthier dresings",
      "text": "It is great to make your own dressings with no additives and chemicals. Mix olive oil, balsamic vinegar, dijon mustard and a little brown sugar to get a delicious dressing.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130521
    },
    {
      "title": "Very disappointed",
      "text": "Not sure what the green 'mixer' in the bottle was supposed to do. Didn't move, turn whatever. Wanted it for ranch, the pouring was not any more efficient than others I have tried. Forgot dishwashing warnings so it melted. That was the end of that.",
      "rating": 1.0,
      "verified": true,
      "author": "Ms. B",
      "helpful_votes": 3,
      "publication_date": 20140107
    },
    {
      "title": "Salad dressing shaker",
      "text": "I have not used mine as yet but I am sure it will work great ..Wanted it for our summer salads..look forward to some homemade dressings :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Elaine C. Harris",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "Makes it so easy to make homemade salad dressings -- with no clean-up of another bowl!",
      "text": "I already own the, so wasn't sure if I needed this, but I'm so glad I got it. You can dump all the dressing ingredients right into it, and then shake it to mix everything up. So far I've used it for vinaigrettes and for thick dressings, and it has worked well for both. The seal also keeps things fresh, and it's nice to have the mixer attached since you can shake it up again after your dressing has been sitting in the fridge for a few days. It's a great little kitchen gadget that makes eating homemade dressings a lot easier!",
      "rating": 5.0,
      "verified": true,
      "author": "LeanneTop Contributor: Cooking",
      "helpful_votes": 6,
      "publication_date": 20171228
    },
    {
      "title": "Ergonomic, functional, and utilitarian salad dressing container mixer",
      "text": "Purchase this product if you need an ergonomic, functional, utilitarian salad dressing container/server for vinaigrette or creamy salad dressings. The width of the bottle enables a comfortable grip. The internal agitator effectively mixes your dressing. The spout is wide and does not drip. Measures are clearly marked on the exterior The Prepworks compares favorably with OXO brand similar products.",
      "rating": 5.0,
      "verified": true,
      "author": "Bikerguy",
      "helpful_votes": 8,
      "publication_date": 20150821
    },
    {
      "title": "I loved this when I bought it",
      "text": "I loved this when I bought it!!! Absolutely loved it!! It was everything I wanted it to be. Now, after a few months, it leaks so terribly bad that I don't want to use it anymore. I have followed the directions for washing, I just don't understand why it leaks so badly now. I cannot shake it up without spreading salad dressing everywhere! Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "tommy barbour",
      "helpful_votes": 3,
      "publication_date": 20170913
    },
    {
      "title": "Great for homemade salad dressings. Works well and looks nice.",
      "text": "Bought one last year and it's under constant use. Decided to purchase my second one so I can have more than one homemade salad dressing at a time. I have bought other salad shaker containers from Amazon, and I am much happier with this one. Not nearly as messy on the lid (leave it open for a minute to let the dressing go back into container) and the lid didn't crack within a few months of use as it did on another brand. It is holding up well. Washes easily also. Attractive and easy to store. Satisfied buyer!",
      "rating": 5.0,
      "verified": true,
      "author": "Carl and Phyllis Avrit",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "as expected and easy to use, lid is hard to clean.",
      "text": "Easy easy easy- perfect for whatever and I love it! I make pesto, cilantro lime sauce, salsa, dressings, and so on and it is perfect for what I need! -the kid is tougher to clean, I suggest rinsing it immediately after use (if you’re going to store extras in the fridge, consider moving it to another container, or rinse the lid and dry it before replacing it). Other than that, it’s everything I wanted!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Perfect for any home made dressings",
      "text": "This is a great salad dressing shaker. I have used several different ones in the past and always had trouble with dripping. This one has really eliminated that problem! I use it non-stop and make the best dressings. I love that the measurements are listed on the side of the bottle to make for easy measuring. It's heavy weight plastic and the lid screws on tightly too. Dressing mixes very well in this bottle and it fits easily in my refrigerator door. So glad I got this!",
      "rating": 5.0,
      "verified": true,
      "author": "Deann Oliver",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Would be 5 stars if ...",
      "text": "I'd totally give it 5 stars if it didn't slop out the wide mouth. While it cleans up easily in the dishwasher, when you use some dressing and then put it back, there is always some dressing running down the spout in some weird fashion. Otherwise, we love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Crunch",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "My top choice.",
      "text": "I purchased two salad shakers, each different, and I like this one a lot better. The pour spout opens and shuts easily, the screw off lid has a wide enough opening that it's easy to fill. And the little shaker insert definitely does a better job of blending the ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Faith B",
      "helpful_votes": 2,
      "publication_date": 20161202
    },
    {
      "title": "Quality, well designed",
      "text": "Ok, they want feed back on the shaker. I just received it in a timely manner, well packed, etc. I have not used it yet, but am very happy with the product. I did take it apart to clean it and I would say it is very well built and I would expect it to do the job nicely!",
      "rating": 5.0,
      "verified": true,
      "author": "Yes, I really bought it!",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Works great! I love to make the hidden valley ranch ...",
      "text": "Works great! I love to make the hidden valley ranch dressing with the packets and this works great for it. I love that the measurements are on the bottle and it pours. I was worried shaking would make a mess but none came out. It works great. First time I used it I used a spatula to make sure it got everything off the side but there is no need to do that.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia V",
      "helpful_votes": 2,
      "publication_date": 20151022
    },
    {
      "title": "Three Stars",
      "text": "its good but the pour mouth is to wide/big i am looking for something to help with portion control",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Brown",
      "helpful_votes": 3,
      "publication_date": 20170815
    },
    {
      "title": "Not Dishwasher Safe. Melted/Deformed on first dishwashing",
      "text": "Tried it out and worked great for a thick Russian dressing. Then when running it through the dishwasher, on the top rack (almost always recommended for plastics) the body shrank and deformed. Now the top will not screw on and the stirrer will not slide the distance of its spindle. Returning for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Colin C",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Like it",
      "text": "It works great! Every now and then when I'm shaking it it seems like some stuff will come out of the top portion but I'm thinking it's because I haven't typed it completely. Other than that I'm very happy with it. I tend to swirl it as opposed to shake it up and down now to avoid losing any salad dressing.",
      "rating": 4.0,
      "verified": true,
      "author": "10isaddict",
      "helpful_votes": 3,
      "publication_date": 20170310
    },
    {
      "title": "Thick dressings are hard tp poor, oil based dressings come out too fast",
      "text": "Thick dressings are hard tp poor, oil based dressings come out too fast. Spout get too messy!! Dressing sticks to it. Gross!!",
      "rating": 1.0,
      "verified": true,
      "author": "Cujo's mom",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Works well",
      "text": "I make up my own apple cider vinaigrette but the oil and vinegar separates between meals. This is one of the few containers I saw that would hold a large amount of liquid and do a good job mixing it. I also like the pour spout feature to get a more even coverage of dressing. I've been using this for several months now and still very happy with it. I can shake it up really well and not worry about the oils leaking out at all.",
      "rating": 5.0,
      "verified": true,
      "author": "txgirl",
      "helpful_votes": 0,
      "publication_date": 20141113
    },
    {
      "title": "So I found this not just useful for salad but also to mix the flour and ...",
      "text": "So I found this not just useful for salad but also to mix the flour and water when I make gravy. Its just a really good quick mixer. I was able to put it in the dishwasher for cleaning with no problems which I liked a lot too.",
      "rating": 5.0,
      "verified": true,
      "author": "RoseAlba",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "So sad, it's bad",
      "text": "Ok I wanted to rate this higher. It has a wide opening and a unique pouring lip. It had an interesting approach to mixing the ingredients --it's attractive and fun to use--except when I shook it, which is how it was designed to mix the dressing, the liquid escaped from the lid. I am not sending it back and will try it with a thicker dressing--but for now I will keep using a glass jar!",
      "rating": 1.0,
      "verified": true,
      "author": "Chica",
      "helpful_votes": 5,
      "publication_date": 20140424
    },
    {
      "title": "Love it! We enjoy making our own vinagerette dressings ...",
      "text": "Love it! We enjoy making our own vinagerette dressings and this container works great. The inside wand does a good job blending and the pouring spout does not drip. We enjoyed it enough we purchased a second one.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Myrosh",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Do Not Recommend",
      "text": "Worked well for several months; now after months of use, the top leaks whenever I shake dressing in it. Could be made to last longer, as I'm already shopping for a new salad dressing bottle. Would not buy again, do not recommend unless you want to buy another after 4 months.",
      "rating": 2.0,
      "verified": true,
      "author": "bluenewlondon",
      "helpful_votes": 2,
      "publication_date": 20160818
    },
    {
      "title": "Good for mixing e-juice",
      "text": "Excellent shaker. Bought it to mix up e-juice for vaping and it works wonderfully. Makes the juice frothy with bubbles which is what you want. The popping (cavitation) of the bubbles speeds up the steeping process. Very pleased with it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Robbins",
      "helpful_votes": 2,
      "publication_date": 20150203
    },
    {
      "title": "GREAT item!!!!!",
      "text": "This is a terrific salad dressing shaker. I use it for my homemade ranch dressing and it works perfectly. Could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Kfcarter",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Nice Salad Shaker",
      "text": "Love this for making homemade dressings. It is a good size and emulsifies oil and vinegar easily. My only reason for not giving 5 stars is that after pouring dressing I find a little always seems to dribble down the outside of shaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Camelot",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "This works perfectly for those Ranch dressing packets.",
      "text": "No more mixing with a measuring cup and pouring into another container. The measurements on this are easy to read and shaking it mixes everything together. Thicker dressings pour without issue and it cleans easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Awesome",
      "text": "Had to replace my 30 year old dressing mixer and this is an amazing find! I love the way it mixes every use and it’s easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Carissa",
      "helpful_votes": 0,
      "publication_date": 20190418
    }
  ],
  "product_meta": {
    "title": "Prepworks by Progressive Dressing Salad Shaker - 2 Cup",
    "description": "Progressive International is your source for the widest range of functional, inventive and fun kitchen tools and great ideas put into practice. Our functional gadgets, tools, food-prep items and household products make cooking and meal preparation more efficient and fun. At Progressive, passion and creativity unite to create the right balance of form and function for today's cooks. Our in-house designers spend hours in the kitchen coming up with ways to improve on a variety of traditional tasks and tools. Established in 1973, our commitment to quality and service allows us to offer a broad selection of quality kitchenware and other household products. Mix, pour and store. With the Progressive Dressing Shaker you can do it all. Make perfect salad dressings and marinades every time by simply adding ingredients and shaking. The gliding paddle wheel of the Dressing Shaker will whirl and swirl completely mixing and emulsifying dressings and marinades and the helpful measurement markings save time. Designed with a large spout to easily pour thick dressings or sauces containing herbs and chopped food. As an added bonus, the Progressive Dressing Shaker won't break, making it great for parties, picnics, camping and boating.",
    "rating": 4.2,
    "feature_bullets": [
      "Salad dressing shaker with agitator ; mix, pour and store dressings all in one",
      "To use: add ingredients, shake and pour; features wide pour spout for creamy dressings",
      "Gliding paddle wheel mixes and emulsifies when shaken; mixes all types of dressings quickly and easily;",
      "Measures up to 2 cups or 500 ml; silicone seal for mess free storage and transportation",
      "Dishwasher safe; BPA free tested"
    ],
    "specifications": {
      "Product Dimensions": "3.25 x 3.25 x 8 inches",
      "Item Weight": "5.6 ounces",
      "Manufacturer": "PREPWORKS",
      "ASIN": "B008D89X5Y",
      "Item model number": "SAL-102",
      "Customer Reviews": "4.2 out of 5 stars227 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#186,934 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 21, 2012"
    },
    "categories": [
      "Salad Shakers",
      "Home & Kitchen",
      "Kitchen Utensils & Gadgets",
      "Kitchen & Dining",
      "Salad Tools & Spinners"
    ],
    "price": ""
  }
}