{
  "website_summaries": [
    {
      "verdict": "Subtle refinements and a great campaign boost WWE '13.",
      "pros": [
        "Improved reversal system makes matches incredibly enjoyableExcellent Attitude Era solo campaignA broad range of customization options"
      ],
      "cons": [
        "Still some minor visual bugs"
      ],
      "aspects": {},
      "publication_date": 20121107,
      "rating": 8.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "N64/Gamecube wrestling fans; it's time to move on to this gem!",
      "text": "Greatest pro wrestling game of all time! Mix the N64, Gamcube, and PS2 wrestling games and you've got this gem! Only beef was that the Attitude Era was censored. You can't even see Litas thong! Also a few notable wrestlers were missing to include but not limited to: Hardy Boyz, Kurt Angle, Chyna, Val Venis among a few others. They got most of it right. Oh yeah, why do they censor Stone Colds middle fingers? WTF? Anyways, get this game if you consider yourself a true N64/Gamecube pro wrestling fan. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "CollegeStudentJJL",
      "helpful_votes": 2,
      "publication_date": 20170204
    },
    {
      "title": "Great game",
      "text": "Got this game as a gift for my little brother and he likes it. No problems with the game. No scratches, no tears. Boxed up perfectly and the game works great. Graphics are clean and clear. Happy with this purchase :D",
      "rating": 5.0,
      "verified": true,
      "author": "G Ramirez",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Better than anything 2k has made in recent years",
      "text": "Wwe 13 is in my top 5 favorite wrestling games of all time. 1 No mercy. 2 here comes the pain. 3 wrestlemania 19. 4 day of reckoning. 5 wwe 13. It's game play is better than 2k17 and 2k18 in my opinion, because the pin system is easy and and no submission miny game just straight tapping. It's universe mode is awesome you can make wcw nitro or ecw as there own show. Create a wrestler is simple and you can youtube formulas or download characters. In my opinion this game is way funner than 2k18. Go for it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "8 year old son loves this game (and so does my husband)",
      "text": "I chose this from among the many wrestling options out there. This one seems a good mix of realistic graphics, but not too violent, for a young boy (8 years old). My son and my husband love to play this and choose from the real life wrestlers. Doesn't seem too tricky, but has enough complexity to hold their attention. They aren't serious gamers, so I can't speak to that perspective, but for casual players who like wrestling and its real life characters, I think this is a good choice.",
      "rating": 4.0,
      "verified": true,
      "author": "Mimimama",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "Not what I expected",
      "text": "I think a lot of people were expecting the career mode. I, myself, included. Thats were my rating comes from. Graphics are great, game play is a little boring after a while. I stopped playing after about 2 days. I wish I could have returned it. The controls are pretty close to what you're use to, if you've played the series before. All in all, the game isn't terrible. It's just very repetitive and misleading.",
      "rating": 2.0,
      "verified": true,
      "author": "Shayla",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "WHATTT???!! WWE 13 is a great Wrestling Game?? WHATT???!! IT IS!! Because Stone Cold said so and that the bottom line.",
      "text": "I picked this game up as a joke.... and now I am a wrestling fan. They really did a job of the attitude era mode. It was a blast to learn the history and recreate the matches. As a child of the 90s my parents wouldn't let me watch the WWF because of all the attitude. I'm glad this game exists to show me what all the kids on the playground were talking about. Now I went back and purchased WWF No Mercy, WWF Warzone, and WWF Smackdown 2 Know Your Role. This game may have some hit detection issues and may not be the best looking game out there, but damn, it has spirit.",
      "rating": 5.0,
      "verified": true,
      "author": "Arcanefury",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "👍🏾",
      "text": "Didn’t come in its original case but it’s an old game so that’s understandable. No scratches. Plays like new. Bought this for my brother and he loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacia J",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Great Game",
      "text": "Husband got this game-his review on the game \"The reversal moves make the game more unpredictable & exciting. Customizing characters has the expanded name options (stage names). You can still add music. The attitude era mode makes you feel like your living the greatest era in sports entertainment. I've played it on both old style TV & works fine but is way better on a flat screen. \"",
      "rating": 5.0,
      "verified": true,
      "author": "Renee_Ginger D",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "A Great Game.",
      "text": "Each year they came out with a new Wrestling Game and they try to make the game better. This year they got the game right. I have not enjoyed a wrestling game like this one in a long time. There are some small things they could add to the game or allow a user to change. But this game is fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Bstone18",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Great gift",
      "text": "I got this as a gift for my little cousin that adores wrestling and he absolutely loves this game. He plays it as often as his Mom will allow him to and it arrived within a few days of ordering it. I definitely recommend this game for those die hard WWF/WWE wrestling fans.",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel",
      "helpful_votes": 0,
      "publication_date": 20121231
    },
    {
      "title": "Awesome Gift!",
      "text": "This was a Christmas gift for my children! I thought that we were in the stadium when they opened it!! Christmas is made here today!!! Came faster than expected and protected very well in shipping!!",
      "rating": 5.0,
      "verified": true,
      "author": "kimberly kirk",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "best in the series",
      "text": "This one has been better then last years but just like any game that comes out every year you would hope that its better then the years past. with that being said im sure when 14 comes out the review will be the same but being a fan and enjoying the games i will be one of the many waiting for my copy.",
      "rating": 5.0,
      "verified": true,
      "author": "jasons review",
      "helpful_votes": 0,
      "publication_date": 20121212
    },
    {
      "title": "Christmas gift",
      "text": "I got this for my god bro as a Christmas gift and he loves it. He is in love with wrestling and has to have almost every game they come out with. He is even trying to teach me how to play the games with him. Great game at a great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Hnrbabyt",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "Boring",
      "text": "It gets boring after a couple of weeks to be honest I guess little kids would like it Im a teen and im more of a tna guy since wwe is really kid friendly for god knows what reason so eh its whatever if you got the money spend it",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20130405
    },
    {
      "title": "LOVE LOVE LOVE THE GAME!!!",
      "text": "This game gets a big ole thumbs up!!! The graphics and wrestling moves are awesome! My grandson requested this game for Christmas, he already has WWE12 and is a big time wrestling fanatic. He is really enjoying it and so does his friends when they come over for the weekends to play.",
      "rating": 5.0,
      "verified": true,
      "author": "Cannonballz",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "Great game compared to 12",
      "text": "A significant step up, The Attitude Era Mode is amazing. Great nostalgia feel to it and it also brings current era too, so you can do Punk vs. Austin, Rock vs. Cena, Billy Gunn vs. Ziggler, and the list goes on. I also loved the create an arena mode, It was very in tune with what the people wanted. That was the ability to make what they want and not be held down by restrictions. This game definitely gets five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "lilrick110",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "Two Stars",
      "text": "Servers are down and you can't get the DLC's or anything that used to be available.",
      "rating": 2.0,
      "verified": true,
      "author": "Diego Andrés Cortés",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "Pretty Fun",
      "text": "Great game and I love all the game options. I hate the interface though for selection of games and options. It's a redundant process and take some time to actually get the game going. Other wise this is a buy or a minimum a rent.",
      "rating": 4.0,
      "verified": true,
      "author": "Bobby Marquez",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "A Great WWE Game",
      "text": "If you like WWE games, especially the ones from the good old days, then you'll probably like WWE '13. WWE '13 has great gameplay, and one of the best rosters ever. There are plenty of game modes, though I feel like GM mode or other modes should have been in the game. The Attitude Era story is great for any WWE fan.",
      "rating": 4.0,
      "verified": true,
      "author": "Cool Lime",
      "helpful_votes": 0,
      "publication_date": 20140630
    },
    {
      "title": "Meh...",
      "text": "Got this based off reviews that '14 wasn't much of an upgrade but I still wanted a newer WWE game. There's not a career or campaign mode which I think would be fun to play. Gameplay is OK...a lot of button mashing so far.",
      "rating": 3.0,
      "verified": true,
      "author": "Greg Z.",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "Greatest Game EVER!!!",
      "text": "I gave it 5 stars just because the game itself is awesome i am really enjoying this game although i do recommend you to buy this game new or else you just might be paying extra for online play other then that this is the best wwe game i played",
      "rating": 5.0,
      "verified": true,
      "author": "IamMojoJojo",
      "helpful_votes": 0,
      "publication_date": 20131202
    },
    {
      "title": "seth's dvd's",
      "text": "I really don't know how to rate it since it is not good me, I bought it for me grandson Seth A's his mother doesn't want him to talk to me. Do you see, I don't really know how to rate it, if it arrived, if he was allowed to keep it, if he likes it. I don't know anything about all the dvd's that I buy him.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20140428
    },
    {
      "title": "Good job",
      "text": "The product is good and funny. Now i'm checking the cost benefits against the quality. Of the game The vendor worked strict a head with the Ad details. Arrived in time and for a regular price.",
      "rating": 4.0,
      "verified": true,
      "author": "NDA",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Good Game",
      "text": "I was not a big fan of WWE '12, but have come to enjoy the WWE '13 version. I like that there is room for 100+ wrestlers on the game. The only part I don't like is the fact that you have to spend more money for the add-ons to get the complete game.",
      "rating": 4.0,
      "verified": true,
      "author": "TimQ",
      "helpful_votes": 0,
      "publication_date": 20121223
    },
    {
      "title": "Bought it for a wrestling fan, and he loves it!!!",
      "text": "Thank you Amazon for another swift and smooth purchase! I bought this for my boyfriend for Valentine's Day, and it arrived right on time! He's a big wrestling fan, and he loves it! He gets to play with Stone Cold Steve Austin, and a lot of other famous players from a few years ago. I have no complaints, so I'm giving it a good rating!",
      "rating": 4.0,
      "verified": true,
      "author": "ssmith1534",
      "helpful_votes": 0,
      "publication_date": 20130312
    },
    {
      "title": "Great!",
      "text": "Love this game and got it for a great price. Amazon really is the only place to buy games without breaking the bank. I haven't had a wrestling game in quite a long time and get a little interested in this. By far the most polished I've played.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis E. Corbin",
      "helpful_votes": 0,
      "publication_date": 20130722
    },
    {
      "title": "Great for WWE fans young and old!",
      "text": "This game features things that I loved and miss from WWE! It has a mode called Attitude Era where old WWE( & WCW) fans will be able to relive some of the greatest moments by playing certain matches from the 90s that revolutionized WWE. Also, the Create a Superstar is fun and the Create an Arena is more detailed than last year's. They even brought back old gamemodes like Special Referee and King of the Ring which just adds to the fun. I would definitely recommend this game to any WWE fans!",
      "rating": 5.0,
      "verified": true,
      "author": "Pitbull",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Cool",
      "text": "Fun game. The fact that the story mode is the attitude era is AWESOME considering that was my favorite era of wrestling. Totally worth buying.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen Melvin",
      "helpful_votes": 0,
      "publication_date": 20140311
    },
    {
      "title": "My son loves it!",
      "text": "My son is the finally word on this game for me. He loves it. He says the graphics are amazing and the play options are great. I'm happy thus far with all the XBox games we've bought.",
      "rating": 5.0,
      "verified": true,
      "author": "R.H.",
      "helpful_votes": 0,
      "publication_date": 20130616
    },
    {
      "title": "Nephew likes it!",
      "text": "This was a gift for my 7 year old nephew. He was very excited to get it but I know that he kind of has trouble figuring out all the moves. Might be a little tough to play for someone his age.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Petric",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "Great game for the price",
      "text": "Great game for the price. My 11 yr old son have a feild day playing that game with his brothers and sisters",
      "rating": 4.0,
      "verified": true,
      "author": "Latarsha F",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Full of fun!",
      "text": "My son is a huge wrestling fan and each successive generation of these games has not disappointed yet. Highly recommended for fans young and old.",
      "rating": 5.0,
      "verified": true,
      "author": "lijebeck",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Got the game on time which was great but when trying to enter my redeem code it ...",
      "text": "Got the game on time which was great but when trying to enter my redeem code it says it's invalid. I Calle Microsoft which then told me to call 2ksports , and they no longer have a customer service hotline. Sent them a message and still waiting to see how they can help me with this issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Enrique",
      "helpful_votes": 0,
      "publication_date": 20141108
    },
    {
      "title": "cool game",
      "text": "I bought this game for my 9yr. old nephew and he loves it. The moves, combos & finishers are quick & easy to learn.",
      "rating": 4.0,
      "verified": true,
      "author": "william fernandez",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "WW13",
      "text": "ARTICLE ARRIVED ON TIME IN PERFECT AND MINT CONDITION.MY 9 YR.OLD GRANDSON LOVES THIS GAME SO MUCH THAT HE ACTUALLY SLEPT WITH IT THE FIRST COUPLE OF NIGHTS AFTER RECIEVING THE GAME.I WILL DEFINATELY ORDER FROM THS VENDOR AGAIN.",
      "rating": 5.0,
      "verified": true,
      "author": "Viola W Davis",
      "helpful_votes": 0,
      "publication_date": 20130428
    },
    {
      "title": "Good Game",
      "text": "My brother is a huge WWE fan and he loves the game.",
      "rating": 5.0,
      "verified": true,
      "author": "Uli Duh",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Excellent Game",
      "text": "Both of my Teenage sons deeply enjoy playing this game both alone and against each other especially after watching wrestling on TV.",
      "rating": 4.0,
      "verified": true,
      "author": "Cecelia Alphonso",
      "helpful_votes": 0,
      "publication_date": 20140511
    },
    {
      "title": "Outstanding",
      "text": "The story modes are extraordinary, excellent graphics, leaving almost all wrestlers old and new, I recommend it to everyone who likes the wwe",
      "rating": 5.0,
      "verified": true,
      "author": "London",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "i hear it is a great game to play",
      "text": "bought this for my teenage nephew and I hear he loves it. sister n law says every day after school this is his game of choice",
      "rating": 5.0,
      "verified": true,
      "author": "j&bmullins",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Awesome Game",
      "text": "Love the story mode, but i'm a bit upset with the new control system... still looking forward for the next generation",
      "rating": 5.0,
      "verified": true,
      "author": "Dante",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "Nice Improvement",
      "text": "The last WWE game I played was the dreadful SvR 2009. This game may not have extensive modes to play through and universe may be buggy and uninteresting unless you can find the right settings, but Attitude Era mode more than makes up for THQ's lack of innovaton. I only hope that 2K sports can expand on this experience for WWE 2K14",
      "rating": 4.0,
      "verified": true,
      "author": "Travon333",
      "helpful_votes": 0,
      "publication_date": 20130724
    },
    {
      "title": "lol perfect i collect them all",
      "text": "lol perfect i collect them all.every new one has alittle more to it",
      "rating": 5.0,
      "verified": true,
      "author": "cory",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Great buy",
      "text": "This was a gift for my little cousin and he absolutely loves this game. He said he would recommend this game to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20130330
    },
    {
      "title": "Fun family game",
      "text": "my kids loved this game and still play it today, i join sometimes and have fun!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tammy Baldwin",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Best wrestling game EVER!",
      "text": "This is the best wrestling game since wwf no mercy for the nintendo 64 its story mode is really good especially if you were a fan of the 90's attitude era with the Rock and Stone Cold.There are a pretty good amount of wrestlers to choose from in the game and quite a few more that are dlc.This is how wrestling games should be made from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Shepperd",
      "helpful_votes": 0,
      "publication_date": 20130129
    },
    {
      "title": "Great game",
      "text": "This game is as good as advertised but I was bit disappointed with WWE Universe move especially with the Paul Heyman storylines. They need to play out instead of in random cutscenes plus they need to make you make decisions to determine the paths of Superstars",
      "rating": 5.0,
      "verified": true,
      "author": "Recent purchase",
      "helpful_votes": 0,
      "publication_date": 20130213
    },
    {
      "title": "WWE' 13",
      "text": "My son is eight years old and he loves wrestling and he has the action figures as well as this game. And I can not take him off this game at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Jannie Bailey",
      "helpful_votes": 0,
      "publication_date": 20130727
    },
    {
      "title": "i'm just the grandma",
      "text": "I don't have a clue about these games but I can say my grandson practically did cartwheels when he opened this gift. He played it NON-STOP!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20121204
    },
    {
      "title": "Fan of the attitude era will love this",
      "text": "I got this game just for the attitude era and it is great some great wwe moments relived when wrestling was at it best.",
      "rating": 5.0,
      "verified": true,
      "author": "VM",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Awesome game!",
      "text": "I miss the Attitude Era. This game has it in great detail and hopefully it will make the younger Cena fanboys grow up to hate the PG garbage and hope for another Attitude Era or Ruthless Aggression period. These were, by far, the best years of professional wrestling. The game itself is an improvement from WWE 12. I think it is much easier to reverse on your opponent, and the gameplay seems smoother. The unlocks are great too, as you go through Attitude Era mode.",
      "rating": 5.0,
      "verified": true,
      "author": "pezzy",
      "helpful_votes": 0,
      "publication_date": 20121125
    },
    {
      "title": "Xbox game WWE",
      "text": "The game was not as expected, because there is no career mode and you can't play career mode with your character. Otherwise, it's okay.",
      "rating": 3.0,
      "verified": true,
      "author": "sandyk24",
      "helpful_votes": 0,
      "publication_date": 20130311
    },
    {
      "title": "Excellent game - gift",
      "text": "My nephew was very happy with this Xbox W13, he is now happily playing the game. It is challenging and graphics are good.",
      "rating": 4.0,
      "verified": true,
      "author": "polastre",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Good Item.",
      "text": "This item was bought as a gift and the recipient played it as soon as he got it. It was really authentic and he plays it every day. Great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130106
    },
    {
      "title": "I don't play video games, but my 13 year old loves it!!",
      "text": "My son freaked out when he opened his birthday gift and saw this game. I bought it because he's a WWE fanatic and he loves John Cena and CM Punk. I've heard no complaints yet",
      "rating": 5.0,
      "verified": true,
      "author": "Steffie J",
      "helpful_votes": 0,
      "publication_date": 20121220
    },
    {
      "title": "Good Game",
      "text": "Overall good game. Some of the entrance music was hit and miss. But I would still recommend this game to WWE fans.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Reynolds",
      "helpful_votes": 0,
      "publication_date": 20130126
    },
    {
      "title": "Decent game",
      "text": "The roster is kinda small. It's a pretty fun game though",
      "rating": 3.0,
      "verified": true,
      "author": "Echo",
      "helpful_votes": 0,
      "publication_date": 20150427
    },
    {
      "title": "I love wwe and I love playing games",
      "text": "What can I say? I love wwe and I love playing games.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Perry Mcallister",
      "helpful_votes": 0,
      "publication_date": 20140823
    },
    {
      "title": "Fun/ awesome",
      "text": "This game is a fun wrestling game with awesome character customization. I literally made altaïr from assassins creed, the dragonborn Viking guy from skyrim, corvo from dishonored (sort of), and my friends made hulk, superman, ryu from street fighter, Jackie chan and much more. If your into wrestling games I definitely recommend this game.",
      "rating": 5.0,
      "verified": true,
      "author": "Mason McEntire",
      "helpful_votes": 0,
      "publication_date": 20130215
    },
    {
      "title": "Three Stars",
      "text": "Good game but it wont some time play on Xbox 360",
      "rating": 3.0,
      "verified": true,
      "author": "J.betha,sr",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Its entertaining",
      "text": "Great game, but the modern roster sucks. So if you like current wrestlers like the shield, get wwe 2k15 or 2k14. However, if you love and prefer the Attitude Era, then this is the game for you.",
      "rating": 4.0,
      "verified": true,
      "author": "ceelo tha goon",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "So sweet!",
      "text": "This game is the best. its so addictive. I always wanna play it. if get it and your a wwe lover, you'll be stuck on this game for about a month.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "WWE",
      "text": "Awesome game. I enjoy playing it very much and it would make a great gift for anyone that likes wrestling.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Huggins",
      "helpful_votes": 0,
      "publication_date": 20130320
    },
    {
      "title": "Only works on Xbox Slim",
      "text": "The game is fantastic, a lot better than past wrestling games but if you have one of the old fat xbox 360's then dont even bother buying this. I've tried playing this on 2 separate xboxs and it freezes either before or after a match. Now If you play this on an Xbox slim it works perfectly, havent had any troubles with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Timmy",
      "helpful_votes": 0,
      "publication_date": 20130101
    },
    {
      "title": "Great game",
      "text": "I bought this game to get back into the wwe series. I was surpized at how easy everything was to learn and how enjoyable it is, the attatude era thing leaves room to be desired but overall a great game",
      "rating": 4.0,
      "verified": true,
      "author": "richard",
      "helpful_votes": 0,
      "publication_date": 20150125
    },
    {
      "title": "Well worth the $20",
      "text": "Fun game. Online isn't that good but Attitude Era studio mode and DLC is worth it. Well worth the $20 I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "GREAT GAME",
      "text": "Awesome game, very fun to play, it has every thing you are looking for, i recommend this game to any wwe fan.",
      "rating": 5.0,
      "verified": true,
      "author": "A7X",
      "helpful_votes": 0,
      "publication_date": 20130606
    },
    {
      "title": "WWE 13",
      "text": "The grandson was glad when he opened it up at Christmas, I am sure he will enjoy playing the game",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Akin",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "wwe 13",
      "text": "chose this rating because my son loves the game. would recomend game to all parents looking for a great game for their child",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "2k14 better",
      "text": "fun game if you drunk or a wrestling fan besides that 2k14 better",
      "rating": 4.0,
      "verified": true,
      "author": "michael johnston",
      "helpful_votes": 0,
      "publication_date": 20140714
    },
    {
      "title": "Great!!",
      "text": "It works great!! The only problem I have had is that there are some small glitches but nothing to bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Traci J. Johnson",
      "helpful_votes": 0,
      "publication_date": 20130214
    },
    {
      "title": "Great Deal",
      "text": "Exactly as described, brand -new item, at an awesome price!! Arrived before it was due.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolyna A. Terrell",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Great Buy",
      "text": "Game was delivered in a mere two days, way ahead of schedule, and was in-tact, brand new, and fully functional. The gameplay is another story, but the item itself lived up to all details described in the listing. Will purchase additional titles from retailer again in the future...",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20130331
    },
    {
      "title": "Nice",
      "text": "Got this for my brother. He loved it as he played until he broke it. Will definitely check out more games from this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Am Ama",
      "helpful_votes": 0,
      "publication_date": 20140605
    },
    {
      "title": "game heads",
      "text": "my son play games all day the this games i got was used and it was cheaper my 20%, the game was mailed early with the book and instructions, it was like buying a brand new game.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Green",
      "helpful_votes": 0,
      "publication_date": 20121213
    },
    {
      "title": "WWWE'13",
      "text": "I received this in good condition, i was pleased gave as gift to my grandson he had no complaints, so i assume all is well",
      "rating": 4.0,
      "verified": true,
      "author": "Micky Fichera",
      "helpful_votes": 0,
      "publication_date": 20130217
    },
    {
      "title": "The thing I was off was how the game case look like a messy coffee spill and wasn't even mentioned",
      "text": "Game is gold, game works well, everything was a go. The thing I was off was how the game case look like a messy coffee spill and wasn't even mentioned. Other than that, game itself was in good condition.",
      "rating": 4.0,
      "verified": true,
      "author": "Floyd Harris",
      "helpful_votes": 0,
      "publication_date": 20140721
    },
    {
      "title": "THANKS",
      "text": "MY SON AND HIS FRIENDS HAVE STAYED LOCK IN THE ROOM FOR 3 DAYS THANKS FOR THE BREAK AND PEACE",
      "rating": 5.0,
      "verified": true,
      "author": "Willie Mae Johnson",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "I love this item greatly. thank you and have a blessed.",
      "text": "I play this game everyday other day and I am thank you greatly. I believe this game is the best of them all.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 0,
      "publication_date": 20121201
    },
    {
      "title": "game has a defect",
      "text": "the game has a defect when ever you finish a match the announcers say OK lets show some highlights from the match (and yes i do have the option switched to on) it shows a black screen and then nothing it just ends",
      "rating": 3.0,
      "verified": true,
      "author": "Royale Muzic",
      "helpful_votes": 0,
      "publication_date": 20130310
    },
    {
      "title": "wwe13",
      "text": "I bought this game for my son, who is a big WWE fan for his birthday. It came quickly and in Excellent shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Kel",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Joy Joy",
      "text": "My son absolutely loves this game. He plays it often! Talk about being into wrestling. Great buy and awesome I found it at Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia Fields",
      "helpful_votes": 0,
      "publication_date": 20130817
    },
    {
      "title": "Great Game",
      "text": "Great Game, not as good gameplay as some of the older svr games, but if you love the attitude era and unlocking and playing as those wrestlers you'll love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Best wresting game in a while.",
      "text": "Graphics are great, replay value is high, and it offers challenges to those players of all skill lvls. If you are looking for a wrestling game this is the one to get...",
      "rating": 5.0,
      "verified": true,
      "author": "me, myself and irate",
      "helpful_votes": 0,
      "publication_date": 20130401
    },
    {
      "title": "in great condition and working well",
      "text": "Got it quick, in great condition and working well. Would definitely recommend the people who sold it to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Munroe",
      "helpful_votes": 0,
      "publication_date": 20161010
    },
    {
      "title": "Could've Been Better",
      "text": "The game is okay, but there's a few glitches that hold the game back. There's no 2 count, the AI likes to move outside a lot and isn't as hard that they made it out to be. Cutscenes are few and far between. I think some areas were neglected just to pull off attitude era mode.",
      "rating": 3.0,
      "verified": true,
      "author": "WWEBamaChik",
      "helpful_votes": 0,
      "publication_date": 20121213
    },
    {
      "title": "Best Game Yet...",
      "text": "This game is awesome if u like the attitude era I recommended to you. I Love this game I Got all the achievements for WWE '12 and on my way to finish this one only one achievement left! Guys hope you get the game you would love it but remember wwe 2k14 less than 2 months left!",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20130830
    },
    {
      "title": "WWE '13",
      "text": "Great price , only paid $29 for this and got it in 2 days, my Boys were so excited, and I was to at that price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130208
    },
    {
      "title": "I received what I ordered",
      "text": "I ordered this for my son and we rented it before we actually received it. He loves it and we hope to enjoy it for years to come.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20121208
    },
    {
      "title": "Great addition to the series!",
      "text": "This game has lots of features that allow you to customize your matches and your wrestlers. The huge roster is definitely a huge improvement over previous games. \"Attitude Era\" mode is fun and engaging. One of the best WWE games in years!",
      "rating": 5.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "Awesome fast shipping.",
      "text": "Fun game, gave as a gift and my nephews loved it. Would buy more games from this series... W13 is great",
      "rating": 5.0,
      "verified": true,
      "author": "Frank S",
      "helpful_votes": 0,
      "publication_date": 20130128
    },
    {
      "title": "great",
      "text": "i love the fact that it is selling at an affording price but what i did not mind was the fact that it does not come with the original case but its worth it",
      "rating": 5.0,
      "verified": true,
      "author": "nahom diress",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "GAME",
      "text": "Excellent quality my grandson loves it came way before it said it was coming so great surprise for Christmas as I was a last minute shopper",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Five Stars",
      "text": "Man this game was amazing i wouldn't mind getting it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Ellis",
      "helpful_votes": 0,
      "publication_date": 20150403
    },
    {
      "title": "Real entertainment",
      "text": "Purchased for Christmas for my son. He loves to watch wrestling on tv and says this game is as real as it gets. He is having a lot of fun playing this game.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Henry",
      "helpful_votes": 0,
      "publication_date": 20121228
    },
    {
      "title": "Has had no problems with the game and the price was great.",
      "text": "Bought for my Son. Has had no problems with the game and the price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "LD",
      "helpful_votes": 0,
      "publication_date": 20150228
    },
    {
      "title": "Five Stars",
      "text": "My grandson loves the game. He was waiting for a whole year to get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Green",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "WWE'13",
      "text": "Given as a Christmas gift to my grandson. He loves it and was thrilled with the gift. It is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Salvatore A. Paratore",
      "helpful_votes": 0,
      "publication_date": 20121229
    },
    {
      "title": "maybe 14 will do its justice",
      "text": "awesome attitude era but pointless to play afterwards. Good Graphics. The game needed a story mode and a good one at that",
      "rating": 4.0,
      "verified": true,
      "author": "michael jason halleen",
      "helpful_votes": 0,
      "publication_date": 20130901
    },
    {
      "title": "great game",
      "text": "Just got back into games. If u like wrestling u will love this game. thq server is terrible but overall game is great",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20130127
    },
    {
      "title": "Son loves this",
      "text": "I got this for my 6-year-old for Christmas, and he loves it. Very good purchase for a little boy. Shipping was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen",
      "helpful_votes": 0,
      "publication_date": 20130610
    }
  ],
  "product_meta": {
    "title": "WWE '13",
    "description": "Platform:Xbox 360It takes blood, sweat, and tears to become the best in the world. And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution. Last summer, one man revolutionized the sports entertainment industry. In a legendary moment at the end of Monday Night Raw, CM Punk shook up WWE and a hero was born. Fifteen years ago, the legendary “Stone Cold” Steve Austin revolutionized entertainment, sparking a new generation of supporters with his relentless Attitude. Now, a new crusade is upon us, and it doesn’t start with an iconic WWE Superstar on television, online, or at a live event. WWE ’13 is imminent, and it’s time to Live the Revolution. The WWE videogame franchise returns to provide the most authentic, seamless and passionate experience to date, presented with a grittier Attitude. WWE ’13 will transform WWE gameplay through the introduction of WWE Live, completely changing the videogame’s audio and presentation elements. Predator Technology returns to further implement critical gameplay improvements, while fan favorites in WWE Universe Mode and the franchise’s renowned Creation Suite are poised to offer the utmost in player freedom. Furthermore, WWE ’13 will introduce a groundbreaking, single-player campaign based on the highly influential Attitude Era. Complete with a robust roster – the largest to date in the franchise – along with a host of additional features, WWE ’13 is ready to live a revolution all its own.\n\nAMAZON.COM\n\n\n\n\nLIVE THE REVOLUTION. It takes blood, sweat, and tears to become the best in the world. And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution.\n\n\n\n\n\nWWE LIVE\n\n\n\nRELIVE THE ATTITUDE ERA\n\n\n\nCREATE AND SHARE YOUR WWE\n\nSYNOPSIS\nBring the atmosphere, spectacle, and fervor of a raucous WWE Live event into your living room with awe-inspiring Spectacular Moments and a new audio system that delivers the most authentic and dynamic commentary, sound effects and crowd participation ever in a WWE game.\nIt was a time when Stone Cold Steve Austin battled for supremacy against his maniacal boss, Mr. McMahon. An era where The Rock told opponents to “know your role, and shut your mouth”, where the Undertaker threw Mankind off the top of the Hell in a Cell, and D-Generation X broke all the rules. Now, for the first time, relive this groundbreaking era in an all-new single player campaign mode that will make you experience the Monday Night Wars like never before.\nThe fan-favorite WWE Universe mode returns, giving you more control over WWE than ever before. Your choices determine your destiny as you dynamically shape your schedules, television shows, and rosters, and form alliances and make enemies on your way to the top.\nWith new animations, transitions, and modified controls built on the Predator Technology™ game engine, WWE ’13 will deliver strategic, fluid, and fun WWE action that plays more smoothly than any prior WWE game.\n\n\n\nKEY FEATURES:\n * WWE LIVE\n   \n * RELIVE THE ATTITUDE ERA\n   \n * WWE UNIVERSE 3.0\n   \n * PREDATOR TECHNOLOGY 2.0\n   \n * CREATE AND SHARE YOUR WWE",
    "rating": 4.4,
    "feature_bullets": [
      "WWE LIVE: Experience the atmosphere, spectacle and fervor of a WWE live event through attention-grabbing Spectacular Moments, including ring breaks and barricade crashes, along with a brand new audio system designed to produce the most authentic and vibrant commentary, sound effects and crowd participation levels ever experienced in a WWE videogame.",
      "RELIVE THE ATTITUDE ERA: You have heard the legendary stories and witnessed the history. Now, for the first time, return to an unparalleled and groundbreaking era in WWE history: a time of pure raucousness, grandiose personalities and colossal revolution through a franchise-first single player campaign focused on eight purveyors of attitude during the famed \"Monday Night Wars,\" including WWE Hall of Famer \"Stone Cold\" Steve Austin.",
      "WWE UNIVERSE 3.0: Control the virtual WWE experience like never before in the franchise's popular career-style mode, as individual decisions throughout gameplay will dynamically introduce matches, alliances, rivalries and unpredictable moments along the path toward becoming a WWE champion.",
      "PREDATOR TECHNOLOGY 2.0: Driven by new animations, transitions and modified controls, Predator Technology returns to deliver intelligent, fluid and engaging WWE action, resulting in a smoother gameplay experience than its franchise predecessors.",
      "CREATE AND SHARE YOUR WWE: Utilize the franchise's industry-defining Creation Suite to develop and customize Superstars, arenas, entrances, finishing moves, storylines, and more! Go online and upload your creations to share them with the WWE Universe and download creations from others to add to your own experience."
    ],
    "specifications": {
      "ASIN": "B0085L2T14",
      "Release date": "March 19, 2013",
      "Customer Reviews": "4.4 out of 5 stars348 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#26,983 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "7.6 x 5.3 x 0.5 inches; 1.6 Ounces",
      "Binding": "Video Game",
      "Language:": "English",
      "Rated": "Teen",
      "Item model number": "49274",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "1.6 ounces",
      "Manufacturer": "2K Sports",
      "Date First Available": "May 27, 2012"
    },
    "categories": [
      "Xbox 360",
      "Games",
      "Legacy Systems",
      "Video Games"
    ],
    "price": 24.95
  }
}