{
  "website_summaries": [
    {
      "verdict": "These are high-quality cornhole bags that have the added touch of coming in many colors to match any board or tastes.",
      "pros": [
        "Filled with dried corn for an authentic feel",
        "Durable enough to stand up to repeated use, even when thrown onto concrete",
        "Bags do not emit dust upon landing",
        "Ability to choose your colors to match boards is a nice touch",
        "Comes as set of 8"
      ],
      "cons": [
        "Have to store in a particular way to keep animals away from dried corn"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good bags, great customer service",
      "text": "Ordered a set of the royal blue and gray bags in March an noticed that the gray bags' material seemed a little lighter than the blue. After a couple of months the gray bags began separating at the seams and progressively got worse. In October they finally got to the point the seam was about to burst. I reached out to the seller and explained what happened and they sent a new set of bags without hesitation. The new bags are the expected heavier material so I doubt there will be any issue. Very impressed with the seller. ** Update ** Over a year later and the replacement bags have held up very well and we use them a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Laramie B Guest",
      "helpful_votes": 19,
      "publication_date": 20161118
    },
    {
      "title": "I can say the shipment came super fast but once again the wrong colors",
      "text": "Ordered 2 sets of bags in one week. Ordered yellow and royal blue, received black and yellow. Box even said royal blue and yellow. Ordered another set of yellow and royal blue, I can say the shipment came super fast but once again the wrong colors. Received black and orange this time and again the box indicates they are royal blue and yellow. Unbelievable",
      "rating": 1.0,
      "verified": true,
      "author": "Layna",
      "helpful_votes": 11,
      "publication_date": 20180617
    },
    {
      "title": "They are poor quality and won't work.",
      "text": "We tried these for the first time on 4th of July at a panic at our home and they were terrible! Too light and we couldn't play the game! I would return them if I could. They are terrible, please don't waste your $$$$.",
      "rating": 1.0,
      "verified": true,
      "author": "Joy Conley",
      "helpful_votes": 8,
      "publication_date": 20180705
    },
    {
      "title": "Will order again!",
      "text": "Perfect. I ordered red and white to go with my Detroit Red Wings themed cornhole boards. They've managed to hold up very well, despite the abuse. I will have to order another set, as we got rained on during out last family picnic and continued to play. These will absorb water and swell! By the time we were finished playing, these were almost spherical!",
      "rating": 5.0,
      "verified": true,
      "author": "TimG45Top Contributor: Woodworking",
      "helpful_votes": 7,
      "publication_date": 20170112
    },
    {
      "title": "Great durable bags.",
      "text": "I was very impressed with these, didn't have high hopes for bags ordered from Amazon, but the quality and durability of the bags are 100% as good if not better than the ones I've made myself in the past. Duck cloth is the best for the bags, and that's what these are. Very happy with the purchase, would absolutely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Smith",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "have a weird bag",
      "text": "I ordered 4 maroon and 4 gray. One gray one is very light compared to others. Corn in all others - something weird in the light one - feels like kernel \"shells\" - you can literally feel that it is not corn kernels. Too late to return them - we bought them for a party we were having that was past the deadline of returning them. I have contacted the company who made them and sent them - no response as of yet. I just ask for one gray one with real corn kernels to be sent to me.",
      "rating": 2.0,
      "verified": true,
      "author": "Helen B.",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Produce Dust",
      "text": "The canvas and stitching seem very durable. They seem to have the weight described. Our issue was we decided to play in the house over the carpet and when the bag hits the wood, it poofs out corn dust. In hindsight, we would have gone with a synthetic filling. We were not thinking of letting the kids play inside at that point.",
      "rating": 4.0,
      "verified": true,
      "author": "Doris Herd",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Don't leave them outside",
      "text": "Or the rodents will eat the bag's contents.... These are filled with dried corn kernels. We left these outside and half of them got torn open and eaten...... I'll buy another set of these. Downside to these bags, they're new. They don't feel as good as an old set of sacks. Maybe they just need a break in.",
      "rating": 5.0,
      "verified": true,
      "author": "reneek",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "PERFECT FOR RECREATIONAL USE",
      "text": "I like the feel of them. They form in your hands very well. I built my own board and I haven't put a finish on them yet, but they still slide about the same as finished boards. They are well constructed and they seem pretty durable. I missed the board completely and hit pure concrete on a quite a airmail throws and expected the seams to possibly give but they hung in there. I'd definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "LiteningKid",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Great Quality",
      "text": "We've only used these a handful of times so far but they seem like they are great quality and I think they will last a long time. I love that you're able to pick the colors so I was able to order navy blue and gold to match our boards that we just painted.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Just What I Ordered!",
      "text": "So far all I can review is they were delivered on time and the correct colors. Hubs is putting the finishing touches on the corn hole boards for a Family Christmas Party this weekend. All 8 bags are new and appear to be well made. Thank You, LD",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Dickerson",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Very sturdy and heavy material",
      "text": "These are really nicely made beanbags. We have purchased others in the past and these are by far the best. Colors were bright and true to the picture. Fabric was sturdy. These should last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Lana",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Inconsistent, but it's worth it.",
      "text": "These bags feel great in your hands and are made well. I do have a major issue with the set I received having one of the yellow bags be MUCH LIGHTER than the other 7 bags I have. I'd love a set that is all the same, but I'd bet I just got a bad run.",
      "rating": 4.0,
      "verified": true,
      "author": "AshtonObadiah",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Heavy Duty Corn Hole Bags",
      "text": "Heavy duty fabric, good stitching and has nice weight to it. Update: 5th set of Free Donkey Sports corn hole bag sets for gifts. Great product over others I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 2,
      "publication_date": 20181004
    },
    {
      "title": "Love them!",
      "text": "Thank you for providing a great product! I made black and purple cornhole boards for my fiance for Father's Day. The black and purple bags were the icing on the cake.",
      "rating": 5.0,
      "verified": true,
      "author": "STEPHANIE GIOVANNI",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Worked Great But Eaten By Critters!",
      "text": "We loved using these but be aware they are actually filled with dried corn. I left them in a doubled zip lock bag in our gazebo and the first night animals tore the bag open and ate the corn, made a big mess. Bring them inside at night! Totally our fault but it's the way we always stored our bean bags.",
      "rating": 4.0,
      "verified": true,
      "author": "Dihiers",
      "helpful_votes": 0,
      "publication_date": 20170624
    },
    {
      "title": "So far so good",
      "text": "They've only been used a handful of times so far, but those times they've been the center of attention, and they've held up very well so far. We bought some cloth material of our favorite NFL teams and added a layer to one side to customize them, and they turned out great.",
      "rating": 5.0,
      "verified": true,
      "author": "David Willson",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Nice Bags.",
      "text": "Feel great and soft enough where they don't scratch my boards. Only thing to be concerned with is that they are stuffed with corn so store them where the varmints can't get to them!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "A great match for Cowboy colors",
      "text": "Got these for my Dallas Cowboy Corn Hole Board I made. Great colors and a perfect match for what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "They are OK",
      "text": "They are alright. I made a DIY Cornhole for my family and these bags are alright. They slide good but aren't the best. At least they were cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "Hunter",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Very nice bags",
      "text": "I ordered these to replace my original corn hole bags. The bags are of nice quality and filled with actual corn. The shipping was super fast as well. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Great quality and bright colors",
      "text": "I made an LSU cornhole set for a friend and these bags matched SO perfectly! We played with them for hours and they look and felt great! I will definitely buy this brand again.",
      "rating": 5.0,
      "verified": true,
      "author": "Love It Or Chuck it Reviews",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Real corn not plastic. Great duck cloth material. Fast shipping.",
      "text": "Fast shipping, good quality duck cloth material. Ordered Black and Orange. Good weight and made with real dry corn kernels and not the larger plastic beads.",
      "rating": 5.0,
      "verified": true,
      "author": "LOUDANDLO CUSTOMS",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Best CH Bags!",
      "text": "Did not know what to expect from these bags since there are so many options on Amazon. But if you want high quality bags at a reasonable price, these are it. They feel great, alil stiff but not overfilled. Played a couple of rounds and they feel great. Seem like the will never fall apart lol. Love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Aragones",
      "helpful_votes": 0,
      "publication_date": 20200612
    },
    {
      "title": "Durable and authentic",
      "text": "These are amazing bags! They are super durable, perfect Gator colors, and went well with the cornhole boards I made my husband for his birthday. I'll definitely be ordering more for future boards.",
      "rating": 5.0,
      "verified": true,
      "author": "The Unkommon Homemaker",
      "helpful_votes": 2,
      "publication_date": 20180612
    },
    {
      "title": "Great quality",
      "text": "Great for long lasting use. Doesn't break down like others that we have gotten in the past. Love the color selection for your favorite sports teams",
      "rating": 5.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Ripped during first night",
      "text": "Ripped upon first game played. Was a present for my nephew's wedding. Kind of embarrassing.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaqualope",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Not Good Quality",
      "text": "Bag ripped open during first game. Corn all over. Not well made",
      "rating": 3.0,
      "verified": true,
      "author": "Deb S",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Pretty good!",
      "text": "These are pretty good! They are stuffed with beans so they seem to be a little heavier than most bean bags but it gets the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "Kem",
      "helpful_votes": 2,
      "publication_date": 20180503
    },
    {
      "title": "Durability",
      "text": "These bags have stood the test of time. They haven’t had any problems with the stitching or any of the corn falling out of the bag. Highly recommend this product to anyone looking for new cornhole bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven L.",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Awesome bags",
      "text": "I made a few sets of bag boards, but want going to make the bags for them. Bought 4 sets of these 2 years ago and have held up great, even after getting a little wet a few times. None of the bags have busted open yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Schraufnagel",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Great bags!",
      "text": "Great bags! Dusty at first but honestly that’s what I wanted. I’ve bought handmade bags in the past and bought these and can’t see the difference. Amazing quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph J Brunovsky Jr.",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Awesome Bags that stand the test of time!!",
      "text": "Fought the set for my stepdad. My original set I've had for 6 years and are still going strong. Loooooove these!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Wolfgang",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "excellent",
      "text": "excellent quality, holding up very well with regular use. left out in light rain and didn't mildew. exactly what we expected and wanted. fast shipping. thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "TC_Pug",
      "helpful_votes": 0,
      "publication_date": 20190126
    },
    {
      "title": "Nice durable stitching...great product!",
      "text": "Nice stitch and very durable. Much better than the last set we had. Thank you for such fast shipping also. Great product for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "KS",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Good product",
      "text": "Very nice quality for the price. Good stitching and color. All bags are consistent construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee L.",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Six great bags.. yes six.. now eight",
      "text": "Got a set for my daughter in college. They looked great we made boards for Christmas. Went to play today and realized there was only three of each color. Would love the other two bags but it of return window Update.... they are graciously sendings me the other two bags with no shipping. Now I can rate a five star. Thanks so much",
      "rating": 3.0,
      "verified": true,
      "author": "Darrell J.",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Perfect!",
      "text": "These are incredible. Won't need to buy new for a long time but when I do I know which ones to get!",
      "rating": 5.0,
      "verified": true,
      "author": "MEGAN MORRIS",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Perfect Regulation Cornbags",
      "text": "I bought a set of these things from someone else...I wish I could remember the sellers name, but they sucked. 1 of the 8 bags was regulation weight. The rest were filled with what felt like popcorn. After reading the reviews for these guys, I felt confident I was getting the real deal, and I was. We've been playing with them all summer and they are tough as can be--still holding up. With how strong they seem, I can't imagine I'll need more, but if I do, I'll buy from these guys again.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Kniffel",
      "helpful_votes": 0,
      "publication_date": 20130909
    },
    {
      "title": "Made very well.",
      "text": "These are really made well with thick fabric and quite heavy. Great product and I recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Tough Bags",
      "text": "Very happy with these. They haven't blown apart like others bags I've had.",
      "rating": 5.0,
      "verified": true,
      "author": "DT",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Well Made! Excellent price!",
      "text": "We play cornhole for hours at family parties. These are very well made bags. I'm sure they are going to last a long time. The price is right and much easier than making them myself. A+ on these bad boys.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy V.",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "Great quality bags. Quick shipping.",
      "text": "Very happy with the quality of these bags so far. I was worried they wouldn’t arrive in time for my husbands birthday but they shipped right away and were at my door in 2 days. Impressed. I highly recommend buying these bags from Free Donkey Sports. They did everything right.",
      "rating": 5.0,
      "verified": true,
      "author": "JLF",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "very heavy large beanbags",
      "text": "very heavy and large bean bags. If you ahev a smaller cornhole game these may be too big. Also they had gotten wet in the rain so i hung them out to dry and they developed mold. I am not really sure about care instructions.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Ramos",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Work great and nice quality. Will get some again.",
      "text": "Very good quality. Used them multiple times without them ripping.",
      "rating": 5.0,
      "verified": true,
      "author": "William C.",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Seem incredibly well made",
      "text": "So impressed with the look and feel of these bags. Great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxy",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Good not Great",
      "text": "Bags are good but I like the feel of the traditional corn bags. Quality seems fine but will buy corn ones next time, lets hope mice stay away this time.",
      "rating": 4.0,
      "verified": true,
      "author": "Ruben ",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Buy these!",
      "text": "There are many sellers selling these on Amazon - and I looked at many of them. These have been absolutely perfect - and we have played many games with them. You can't beat the value and workmanship of these. Don't look anywhere else. Buy these!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Dickens",
      "helpful_votes": 3,
      "publication_date": 20150914
    },
    {
      "title": "Love 'em",
      "text": "The first set of bags we ordered (from another supplier) came unfilled and I had to hand-sew them all after filling. My first attempt resulted in a broken seam, so I had to resew them all. When it came time to order a second set, I didn't want the hassle of buying the fill and sewing them again, so I ordered these. They arrived quickly, are very well made and we love the colors.Definitely worth the extra money to avoid having to fill and sew.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa B.",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Great quality bean bags",
      "text": "These are perfect for cornhole. Great quality for the price. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "AY",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Cheap, Fast, and Quality",
      "text": "Like the heading says, I received the 8 bags quickly/safely, they were cheaper than most, and the quality/weight/feel of the bags are spot on. Tossed em' for a few rounds and they stick/slide/fly as they should. Great purchase, I'll use these cats again when we're due in a couple of years. HINT: don't leave your bags where racoons can get them, they love the corn kernels inside...",
      "rating": 5.0,
      "verified": true,
      "author": "Timbo Burrito",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "These are far superior and have lasted an entire football season at tailgate ...",
      "text": "I originally purchased some from Academy and they busted after one day of casual play. These are far superior and have lasted an entire football season at tailgate AND they were cheaper than the ones from Academy. Great value, quality product!",
      "rating": 4.0,
      "verified": true,
      "author": "B_Ross88",
      "helpful_votes": 0,
      "publication_date": 20160903
    },
    {
      "title": "Black Not the Best Color",
      "text": "Difficult to see the black bags at night under lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "built with quality",
      "text": "These bags appear to be built well. They have taken abuse from the kids every day since we bought them. We bought them on Amazon but they were not available for prime shipping. They still arrived within 2 days of purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Perry",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Best bags out there",
      "text": "Needed to replace ones I was missing...ordered these again...NO REGRETS",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Canterbury",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Worth Every Penny - Durable!",
      "text": "These are amazing. Nice weight, no dust flying out and very thick fabric sewn well. We've played quite a few games with them already and they hold up without any issue. I was hesitant on the price but bit the bullet and bought them. It was worth it. These should last a very, very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "If you got'em, toss'em!",
      "text": "Nice heavy duty bags. Past orders seem to be holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "ddenunzio",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "great product, no issues.",
      "text": "material is thick and seems like they should last for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Good stuff",
      "text": "Have ordered from Donkey before and have never been disappointed. Good product s",
      "rating": 5.0,
      "verified": true,
      "author": "DWIGHT  HALL",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Durable",
      "text": "Heavy duty fabric that will last for a long time. I bought the red and yellow- go CHIEFS!",
      "rating": 5.0,
      "verified": true,
      "author": "B.S.",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Great customer service and product!",
      "text": "Wanted to update my review. First day I used these one of the bags split wide open. Not on the seam but just in the middle of fabric. Excellent customer service as they immediately shipped a replacement and the rip was due to a defect in fabric not the actual stitching. No issues with any bags or replacement bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Day",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great Quality",
      "text": "Some of my bags had ripped so decided to order some more. These bags came in quickly and the colors are bright and the bags look amazing. Family loved the new bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Five Stars",
      "text": "These cornhole bags are the best by far!! I have made over 15 cornhole sets and I have tried some from other venders, but these bags are much stronger and way better quality than others out there. I would highly recommend them for anyone looking to by bags. They also ship quickly and have many different combinations of colors to choose from, and also you can make custom sets, as I have a few times! Jim Barba Colebrook, NH",
      "rating": 5.0,
      "verified": true,
      "author": "Great North Woods Jeeper",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "Really nice quality",
      "text": "Very nice bags. Only wish they came with a bag.",
      "rating": 5.0,
      "verified": true,
      "author": "TANIA P.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Will buy only these bags from now on",
      "text": "Great bags. I'd recommend not playing on concrete for any set of Cornhole bags if you want them to last. Overall these have the perfect weight and are stitched well.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey S.",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Bags",
      "text": "These are great. They are heavy and can tell they are made well. Its not like some others that I bought when all the corn pellets would come out after every toss. They are heavier than the cheap ones that usually comes with the set so if you have a plastic board they will bounce. I would only advise if you have a wooden set.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg D",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "Well made",
      "text": "Sturdy. Thick material. Excellent replacement for the thin, popping at the seams bags that came with my corn hole board.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "High quality",
      "text": "Great quality! We’ve had these a month now and they are awesome. Nice thick fabric.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacey Warnick",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Great Cornhole bags",
      "text": "Great Cornhole bags. The colors are just as in the photo (Red and Black) and the weight, size, stitching, and feel are perfect. I would definitely buy again but hopefully I won't have to for many years if these hold up like they have so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry B.",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Great!  But don't leave them outside!",
      "text": "These worked great for the 3 times I used them with my custom made UW Huskies cornhole set. Good weight and size. Unfortunately, just a week later I left them outside overnight and I came home to find that a squirrel or something had torn it apart :( P.S. Manufacturers, is there a way to get just one to match?",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Harding",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "One out of 8 bags couldn’t last 20 games",
      "text": "These bags have been used for ~20 games and one out of 8 bags I ordered has a broken seam big enough for corn to fall out. I hoped for better as I had made a set of bags 13 years ago with cracked corn with no ripped seams.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Thinner bags",
      "text": "the bags are made of the high quality duck canvas, which has held up very well in the past. The big difference is the thickness of the bags. They seem to be the right weight but a lot thinner than traditional corn filled bags. They fill like they are filled with sand. im not saying they are bad, but they do play a little different.",
      "rating": 4.0,
      "verified": true,
      "author": "vol nation",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Perfect",
      "text": "These bags are well made and arrived just in time for our party. I would buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "JHey",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Good purchase",
      "text": "The bags that came with our set were not well made. These replacements are thicker material. I've had to stitch one but they are pretty durable.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Leonard",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "Good quality!",
      "text": "Would definitely order again. My husband loves these - perfect Florida Gator colors!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Excellent Customer Service!",
      "text": "These bags are excellently weighted and feel great to play with. I had an issue and customer service was excellent!!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa Flores",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Christmas Gift",
      "text": "They appeared to be stitched well and fabric was good. Giving them for a Christmas gift",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "A little big, but work just fine",
      "text": "These bags were surprisingly large when we received them. They feel like they have good weight and are sturdy. It feels like they are filled with corn kernels. Delivery was on time with no issues. The bags did arrive just in a box (no plastic around them) so if you order them, make sure you can get them out of the rain right away.",
      "rating": 4.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20150402
    },
    {
      "title": "These are the best Bean Bags!!!!! Buy Them!!!",
      "text": "This is the 2nd time we've purchased these bean bags.... just different colors. We love that they are actually filled with corn! It gives them a better weight, and feel when playing Bags! They are dusty initially but it goes away with use. We DEFINITELY recommend these bags!! They are the only ones we will ever buy when we need replacements. Totally worth the money! We also have heard great things about their customer service, we haven't had to use the customer service but if you do need to, we hear it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "These were perfect for our event",
      "text": "These were perfect for our event. With so many colors to choose from we were able to match the color theme of the group. It was damp and they stood up to the conditions of the night.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy D.",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "A good purchase.",
      "text": "They arrived quickly. Even the ones ordered without 2 day shipping. I've used them multiple times now & have not run into any issues expressed in the negative reviews. Those seem like isolated incidents. They appear to be made of good durable material & quality construction.",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Alspaugh",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Excellent product.",
      "text": "Used these for a customer who ordered a cornhole set from me. Quality and durability have been excellent. Will certainly be purchasing in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Kalyn H.",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Great buy!",
      "text": "These were perfect! Mice had gotten into my other ones and I needed a replacement. I absolutely recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelita Abrams-Rains",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Suspect. Stichimg quality",
      "text": "Had these bags exactly a month and 2 of the bags have blows outs. Unimpressed with quality of stitching.",
      "rating": 2.0,
      "verified": true,
      "author": "CSB7",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Liked them, well made",
      "text": "Liked them, well made, but too large for the Corn Hole game boards that I have. I just did not get around to sending them back. Any chance I could trade them for something else that you carry.? Do I sound like an old gramma, well I am.",
      "rating": 5.0,
      "verified": true,
      "author": "S. M. Evans",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Nice product",
      "text": "Perfect for your diy board. Nice quality and finish with these ones, would absolutely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonCuztomer",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Great bags",
      "text": "I have enjoyed using these bags for corn hole Anna other games",
      "rating": 5.0,
      "verified": true,
      "author": "Not the Mamma",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Nice bags!",
      "text": "The color were truly spot on, very durable and perfect weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Bishop",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Well made and accurate color",
      "text": "Headline says it all gave to father in-law and the colors were Green Bay Packer and when I played with him this last summer they tossed great",
      "rating": 5.0,
      "verified": true,
      "author": "Every day Home owner",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "They are bean bags",
      "text": "Holding up fine so far. Seem well made and I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "SwDeveloper",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "but they look and feel great! Looking forward to warmer weather to try them ...",
      "text": "Have not had a chance to use these yet, but they look and feel great! Looking forward to warmer weather to try them out!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wubbaman",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Great product",
      "text": "Great product and bags are very good quality and exact color I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Don Herbert",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "The fabric seems sturdy but we've only used them a handful of times ...",
      "text": "Item looked as ordered. The fabric seems sturdy but we've only used them a handful of times and 2 of the bags are coming apart at the seams already. My daughter previously made bags of thinner fabric but they held up much longer than these. Not worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "TH",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Good bags",
      "text": "Seem to be good quality bags. Colors match the picture. Nuff said.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Berg",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Can’t go wrong with this item.",
      "text": "Worked great! Would highly recommend for anyone who Is in bed of a backup set or someone looking to replace worn out ones.",
      "rating": 5.0,
      "verified": true,
      "author": "RehabReviews",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "High marks all around",
      "text": "This is my second time purchasing bags from Free Donkey sports. I placed my order on a Saturday Afternoon; they arrived early Monday morning. High quality bags that have held up well in various environments (grass, gravel, asphalt) and playing conditions (rain or shine). Also the most reasonable price I have found in my research. As a recreational cornhole builder and player, I highly recommend these, and will continue to use Free Donkey sports as my bag source.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Dunckel",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Good feel, real corn",
      "text": "I had a rodent eat my last bags, so i bought these to replace them for my FL Gators boxes. These are weighted correctly and feel the way bags are supposed to. They are made from duck cloth and are stuffed with 1lb of corn- I weighed them. They were nearly identical to my last so I would not hesitate to order them.",
      "rating": 5.0,
      "verified": true,
      "author": "Fade 11",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Do Not Buy!",
      "text": "Although, the price may seem great and the color selection is plentiful! DO NOT BUY them. The beads that they are filled with are too large and they burst when tossed at the board creating a powder residue. In addition, the material that is used for the bag itself is not cotton; it is a slippery nylon, polyester that slides like crazy. Buyer beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Ellermets",
      "helpful_votes": 3,
      "publication_date": 20140512
    },
    {
      "title": "Lovely",
      "text": "We haven't used them yet, but they look like the picture and as described. They look well made and are made of duck canvas. We will be using the for our annual Fall Festival the end of next month. I will update as to quality of bags once everyone puts them to the test during back to back games and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Vysiuene",
      "helpful_votes": 0,
      "publication_date": 20130915
    },
    {
      "title": "Five Stars",
      "text": "Perfect bags, well made, love how you can select colors to match your boards.",
      "rating": 5.0,
      "verified": true,
      "author": "wwallen49",
      "helpful_votes": 0,
      "publication_date": 20180717
    }
  ],
  "product_meta": {
    "title": "Free Donkey Sports Regulation Cornhole Bags. Set of 8. Corn-Filled. 25+ Colors",
    "description": "Free Donkey Sports focuses on the construction of high quality, regulation cornhole bags. We make our bags strictly in accordance to ACA regulations.",
    "rating": 4.7,
    "feature_bullets": [
      "High Quality Cornhole Bags",
      "Made according to ACA Regulations",
      "100% Cotton Duck Canvas",
      "6\"x6\" Dimensions",
      "Filled with 15-16oz of whole kernel corn feed"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "20 x 15 x 15 inches; 1 Pounds",
      "Item model number": "CB-5ZDJ-K9XK-P",
      "Date First Available": "April 4, 2013",
      "Manufacturer": "Free Donkey Sports",
      "ASIN": "B00C6U41FW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Cornhole Bags",
      "Toss Games",
      "Sports & Outdoors",
      "Cornhole",
      "Sports & Fitness",
      "Outdoor Games & Activities",
      "Leisure Sports & Game Room"
    ],
    "price": 23.98
  }
}