{
  "website_summaries": [
    {
      "verdict": "Broken modes, both online and off, bring the otherwise enjoyable Sonic  &  All-Stars Racing Transformed to a screeching halt.",
      "pros": [
        "Controlling the crazy vehicles feels greatCreative and varied track design that changes mid-raceTransformed vehicles feel significantly different"
      ],
      "cons": [
        "Certain modes and challenges are completely broken Can feel slow at times when not boostingDanica Patrick is out of place"
      ],
      "aspects": {},
      "publication_date": 20121122,
      "rating": 6.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "The best $12 game ever",
      "text": "I was reading reviews on the latest Sonic racing game on the Switch, and saw a few reviewers that said this game was way better. I've owned a Wii U since it came out and had never heard of this game (which is surprising because the Wii U doesn't have a ton of good games). So far, it has been a blast. The only thing I don't like is that it forces one of the two players onto the Gamepad, it doesn't allow split screen for the 2 players. This is a quite deep game with a lot more variability than Mario Kart. The campaign experience is a major differentiator from that series.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott H.",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Sonic wins another race!!! 🥇",
      "text": "Very much like He did during the Sega Genesis era Sonic is now Giving the Mario Kart genre one heck of a race! I don’t wish to say this was better or worse than any of the Mario Kart games so I’ll say Sonic and All Stars Racing Transformed was as good as the Mario Kart games for the most part cause of the Transformed part and your Kart can go Optimus Prime on you when it matters! It’s Crisply engaging gameplay! Start your engines!",
      "rating": 5.0,
      "verified": true,
      "author": "Rashaud",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Fun!",
      "text": "It's comparable to Mario Kart but very different at the same time. Not all the characters are as iconic as the ones in Mario Kart but many are. This game does have some fun game modes and can keep you busy for a wile.",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Fun 4 Kids",
      "text": "Very Fun Game Me and my 6 year old brother play the game its easy enough for him to play the graphics aren't all of that but its to be expected since this game is run across multiple systems and generations vs Mario Kart 8 which is strictly made for the Wii U It lets you use the pro controller and there's more than just racing there's some events overall i give it a 4",
      "rating": 4.0,
      "verified": true,
      "author": "Mark B.",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "super sonic racing",
      "text": "It's a great game. It is better than the original because you can drive a plane and a motor boat now. It has more characters in it such as wreck it ralph, Alex Kidd, and Danica Patrick. I have a lot of fun playing that game. The disc didn't have sharp edges so it is almost impossible to hurt yourself. Plus you can race in a lot more worlds than you can in the first one. It comes with big packs of weapons you can shoot in the game. I would recommend it to someone who loves racing games.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff K.",
      "helpful_votes": 0,
      "publication_date": 20130706
    },
    {
      "title": "It's not as bad as I thought it would be",
      "text": "Like most Mario Kart rip-offs, something feels off about this game, but it is pretty fun. The most annoying part for me at least was the drifting. It didn't feel as tight as with Mario Kart no matter which car/character combo I was using. I though the game was pretty fun though. Interesting courses, transforming cars and lots of recognizable characters. If you need something to tide you over until the Wii U version of Mario kart and don't want to spend too much, I don't think you can go wrong with this game.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Ramirez",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Made my kids happy..",
      "text": "They love Sonic. We also just went to see the new movie in theaters. Go Sonic Go!",
      "rating": 5.0,
      "verified": true,
      "author": "Rahil Vora",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Good game but freeze after a couple minutes",
      "text": "Fast shipping and overall good game (my 6 year old likes it) but it only worked for 2 weeks and then froze. Every time we try to play it after a minute or two it freezes. I don't plan on spending more money and buying it again.",
      "rating": 3.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 0,
      "publication_date": 20170730
    },
    {
      "title": "Great game for the price",
      "text": "We really like this game as it is a lot of fun to play for parents and kids. The game is also not expensive as it is priced much less than regular WiiU games. This one has an arcade feel and is a little like Mario Kart. Racing is not dififcult so kids can do it without much issue. Graphics seem good to me for this type of game. I recommend this game for anyone who likes fun arcade style racing or is looking for a reasonble priced game for their kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Mindcrime",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Still Better Than MK8",
      "text": "Still better than mk8 you ride,cruise, and fly.In not only that you can charge your all star and there's more weapons. Also the graphics are on point. Okay mk8 isn't a bad game it just take to many elements from other games in combined them together. Like sonic riders zero gravity, crazy taxi,nights into dreams, and last not least Mario kart 7.Do I need to say more i'm still buy the game when it gets dirt cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "Zackariah",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Good couch co-op racing",
      "text": "Fun racing game, the WiiU one is especially neat with supporting 5 players. Transformation mechanics are cool, although the cars are by far the best part. Framerate is pretty good, but suffers a bit when directly compared to Mario Kart. Sonic is definitely the more challenging game, with fewer random and rubber-banding elements compared to Mario Kart.",
      "rating": 4.0,
      "verified": true,
      "author": "Deffie",
      "helpful_votes": 2,
      "publication_date": 20141123
    },
    {
      "title": "Terrible game",
      "text": "So disappointed in this purchase. Bought this game for my 8yr old twins to play since they love Mario Kart. This game doesn’t even compare. Way too difficult to control and follow. My 13yr old even said it was garbage! Wish I was able to get my money back for this one!",
      "rating": 1.0,
      "verified": true,
      "author": "adam sims",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Five Stars",
      "text": "What better way to open door there is the best present waiting on her birthday 3 Sonic games.🤗👏👏",
      "rating": 5.0,
      "verified": true,
      "author": "doris lowrey",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "I would not recommend buying",
      "text": "But please game for my son’s birthday and it doesn’t work proper it shows you the top you and that’s it",
      "rating": 1.0,
      "verified": true,
      "author": "kandygirl",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great buy",
      "text": "Game is fun and extremely addicting! Classic characters, challenging tracks, cool transforming vehicles. Game play is smooth and the driving controls are on point! Awesome seller!! Game came quick and it was shipped in quaity packaging. Looking forward to buying from the seller in the future",
      "rating": 5.0,
      "verified": true,
      "author": "bryce lever",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Fantastic driving game",
      "text": "Very fun game. Baught a long time ago, but my son still enjoys it when playing video games. Loads of fun, action- packed driving action.",
      "rating": 5.0,
      "verified": true,
      "author": "Nutty's Mama",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Awesome Game!",
      "text": "I LOVE this game. It is challenging, even for a skilled player like me, but it is fun! It came a day early, in bad weather conditions, and was undamaged. The bonus edition comes with Metal Sonic Fully upgraded, and Alex the Kid. And, since at the store this game is sixty dollars for the regular version, this is a great deal! Highly recommended for Sonic and racing lovers!",
      "rating": 5.0,
      "verified": true,
      "author": "Conman956",
      "helpful_votes": 0,
      "publication_date": 20140205
    },
    {
      "title": "Christmas present",
      "text": "Bought this for a Christmas present. Just as discribed. Good price",
      "rating": 5.0,
      "verified": true,
      "author": "PrimeUser",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Not Quite Mario Kart, but a Good Runner-Up",
      "text": "I bought this for my son who is a huge Sonic fan. I was skeptical because racing games tend to never truly meet the standards that have been set by the Mario Kart franchise. However, I was pleasantly surprised in the detail and entertainment value that was put into this game and would recommend it to anyone who enjoys Sonic or racing games.",
      "rating": 5.0,
      "verified": true,
      "author": "The_Cooler",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "Not Mario Kart, but a decent option",
      "text": "Beyond its obvious appeal to Sega fans, this is a rich, bold and substantial arcade racer that demands your attention. It might not be quite as finely tuned as Mario Kart, but it’s a good deal more ambitious, and different enough that it deserves a place alongside it in your gaming library.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "My son loves this game. WiiU games are getting ...",
      "text": "My son loves this game. WiiU games are getting more and more difficult to find, and my son has been playing it regularly for a week.",
      "rating": 5.0,
      "verified": true,
      "author": "Yitb1007",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Hours of fun",
      "text": "Our whole family loves this game. Plenty of different experiences including racing, blowing up the big bad tank guy with your team, and time trials. You can drive, fly, jump, and water ride. Different characters handle various ways to win different events. Unlock new characters for a variety.",
      "rating": 5.0,
      "verified": true,
      "author": "H. wilson",
      "helpful_votes": 0,
      "publication_date": 20130526
    },
    {
      "title": "The game wasn't all that fun to play",
      "text": "The game wasn't all that fun to play, especially considering how bad the gameplays are. I prefer Mario Kart 8 over this. It isn't TERRIBLE, but I gave up after a few months and sold it. That's why I give it 2 stars and not 1.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "My kids love this game",
      "text": "My kids love this game! They are aged 10, 6, and 4. They can all play together and remain entertained!",
      "rating": 5.0,
      "verified": true,
      "author": "Lexi Brown",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Great family fun",
      "text": "Great fun racing game. My soon to be 7 year old son will get this for his birthday. He loves it and so do my daughters. I think its fun to play too, but I hardly ever win. Oh well, it's still fun! We like it that we can all play together at the same time on our WiiU.",
      "rating": 5.0,
      "verified": true,
      "author": "Kri Perry",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "Very glad I purchased this.",
      "text": "I recently bought the wii u and was looking into starting my game collection to add to nintendo land and zombie u. This game is fun and a good challenge, definitely entertaining and worth buying specially for under $40. There is plenty to do and unlock. The online multiplayer is pretty good too. Happy there is a decent number of people playing this online.",
      "rating": 4.0,
      "verified": true,
      "author": "Xander 88",
      "helpful_votes": 0,
      "publication_date": 20130103
    },
    {
      "title": "Can't go wronge!!",
      "text": "Having bloth the Vita and the Wii U versions of the game its worth buying twice.. I love mario kart (who dosn't) this takes that consept to the next level , great grafx, control and veriety makes this a must own for any kart racing fan no matter what system you own . At home or on the go Sonic ASRT is the best in its class ..sorry mario",
      "rating": 5.0,
      "verified": true,
      "author": "Hunter ak",
      "helpful_votes": 0,
      "publication_date": 20130108
    },
    {
      "title": "Good racer",
      "text": "I enjoy racing games. This is a good looking, fun game. Has normal racing, drift racing, racing from checkpoint to checkpoint and such with the mario kart type pickups. Switching from car to boat to plane mixes things up as well as the track changes some aspects every lap so it keeps you interested. Good racer at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Guitar  Man",
      "helpful_votes": 0,
      "publication_date": 20130506
    },
    {
      "title": "Wonderful game...",
      "text": "The grandkids love this game and look forward to playing it every time they visit. Great for coordination & challenges their little minds. We monitor their play time and definitely do not allow the games to be used as a baby sitter. That is the biggest defeat of the purpose.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs B",
      "helpful_votes": 3,
      "publication_date": 20130115
    },
    {
      "title": "This game is so fun. Very similar to Mario Kart",
      "text": "This game is so fun. Very similar to Mario Kart, at least as how I remember it from the old days. The only difference is that in each race you turn into a boat or a plane for part of the course. After each race, we say, \"One more!\" The graphics are nice, much like an arcade game. It did crash on me once during a race, but I hope that was just an anomaly.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Rubush",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "Good game.",
      "text": "Sonic makes his debut on the WiiU platform with this game. Plenty of tracks and characters to unlock to keep you busy for awhile. This is a game that's great in off screen mode, but it obviously doesn't look as good as playing on your HD TV.",
      "rating": 4.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Loads of fun",
      "text": "This is a great game if your kids love racing. It's the perfect bridge between Mario Kart Wii and Mario Kart 8 (already ordered). My boys love Sonic and the other characters. You get land and water racing. Easy enough for my 5 year olds to master. I enjoy it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunson Honeydew",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "Fun Racing Game From Sega!!",
      "text": "Sonic & All-Stars Racing Transformed is a wonderful racing game. The characters are from most Sega Games. The game is really fun to play with your friends locally and online and The Wii U version is the best one since it has more features thanks to the Wii U gamepad. If you want a Racing Game in the meantime before Mario Kart U comes out, than look no further getting this game :)",
      "rating": 5.0,
      "verified": true,
      "author": "Andres",
      "helpful_votes": 0,
      "publication_date": 20130517
    },
    {
      "title": "Great game, well worth the price.",
      "text": "One of the hidden gems in the Wii U line up. Kids and I loved the game. It got a bit challenging at times, but we still go back to it 3 months later.",
      "rating": 5.0,
      "verified": true,
      "author": "Jawabba",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Great Game, a lot of content for little Cash",
      "text": "Great Game, a lot of content for little Cash! Its no Mario Kart 8 but the amount of content and game modes makes up for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Federico Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Good game.....",
      "text": "This is a fun multiplayer game, however it's no Mario Kart. New Maro Kart for Wii U doesn't come out until the end of this year. Which is just too long to wait for a multiplayer racing game. (Not that there's not other good ones) This one is fine to play, while you wait for the real deal.",
      "rating": 3.0,
      "verified": true,
      "author": "pugsarehumans2",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "More intense than Mario Kart 8",
      "text": "It is a fun game. It is much more intense than Mario Kart 8 or Littlebigplanet Karting. Reminds me a bit of Diddy Kong Racing back in the 64 days. Get it for the right price.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos C. Sanchez",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Freezes and loud noises",
      "text": "The game is fun if you don't mind having to disconnect your internet from your machine, and not use the Mii that you unlock. If your unaware of this your game will freeze and make a loud continuous noise. No way to fix it other than doing a hard restart on the console. And if on multilayer, one nun chuck will work not 2.",
      "rating": 3.0,
      "verified": true,
      "author": "Sid",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "unexpectedly great sonic game",
      "text": "This game is an amazing cart racer. It is fun to play with friends or alone in the mode where you unlock characters and such. The game is full of sega characters such as nights, crazy joe, aiai, and of course sonic.",
      "rating": 5.0,
      "verified": true,
      "author": "AnthonyW",
      "helpful_votes": 0,
      "publication_date": 20131102
    },
    {
      "title": "No Ryo Hazuki!?",
      "text": "Disappointing graphics and you don't get all the DLC you get in the PC version. Decent game though, Mario Kart needs some ideas from this. Would have got 5 stars if Ryo Hazuki was in this version",
      "rating": 3.0,
      "verified": true,
      "author": "ShenmueFan",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "a really fun game depending on how many people your playing with.",
      "text": "a really fun game, but when playing vs mode with 4 or 5 players the game starts getting glitchy and starts freezing up. but when playing with 1 or 2 players its fine.",
      "rating": 4.0,
      "verified": true,
      "author": "4 Horsemen",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "For racing fan",
      "text": "The sonic and racing fan this is great any how has the Wii U, it has 25 characters, 26 stages and challenges, I had little problem with the game, but the won't stop the fun and the Wii U exclusive multiplayer options, and the DLC is already install in the disc, this game is worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Michi",
      "helpful_votes": 0,
      "publication_date": 20130427
    },
    {
      "title": "to me just as fun as Mario Kart 8",
      "text": "This game is just awesome. The game play reminds me a lot of Mario Kart. Some of the game play here is better than Mario Kart to me n my kids. So I definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dewdog74",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Stupid little game but like it",
      "text": "Stupid little game but like it. By the way I am 80 years old, so although my driving skills are diminished no one gets hurt when I crash. I will bring a smile to anyone's face.",
      "rating": 4.0,
      "verified": true,
      "author": "Roger Sharp",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "Five Stars",
      "text": "I love sega games,they are all so beautiful. Sonic games are so much fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "... for 8 year old's ta 13 my kids don't like it but I do",
      "text": "it's a hard game for 8 year old's ta 13 my kids don't like it but I do",
      "rating": 5.0,
      "verified": true,
      "author": "Donald",
      "helpful_votes": 0,
      "publication_date": 20170525
    },
    {
      "title": "... worth $17 it should be a free game it's fun but just repetitive",
      "text": "Silly game not worth $17 it should be a free game it's fun but just repetitive",
      "rating": 2.0,
      "verified": true,
      "author": "Edge",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "The definitive version",
      "text": "I would recommend anyone who buys this game to get it on the Wii U. It is a lot of fun with the gamepad (and I believe allows 5 players at a time - I could be wrong.)",
      "rating": 5.0,
      "verified": true,
      "author": "HisNameWasSethRich",
      "helpful_votes": 2,
      "publication_date": 20140507
    },
    {
      "title": "Better than the Xbox version",
      "text": "This is so much better on the Wii U with the game pad. My son loves it much more than his Xbox version. It's no MarioKart but it's a nice substitute.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer B",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "There is definite potential and some cool features.",
      "text": "They tried. I added one star for effort. It is NOT Mario Kart ......... needs work. There is definite potential and some cool features.",
      "rating": 4.0,
      "verified": true,
      "author": "DrTim DesertDoc",
      "helpful_votes": 0,
      "publication_date": 20140824
    },
    {
      "title": "One Star",
      "text": "Case was covered in sticky goo and the disc is full of scratches.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley L.",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Love it so much",
      "text": "Love it so much, much more content and features than the first one, and the Wii U version has all the best features, definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Teenkitsune",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Good game",
      "text": "It's a very good game, I tried the demo, and ended up purchasing the game. I don't rate this higher because it's full of glitches, you'll notice them if you're trying to fly weird angles, or try to do weird stunts. With that aside the game is lots of fun.",
      "rating": 3.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Shrug",
      "text": "I basically just bought this because I was desperate for games on the Wii U. Pretty fun racing game but you all know it's gonna be replaced when Mario Kart comes out",
      "rating": 4.0,
      "verified": true,
      "author": "Bea K.",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "My children LOVE this game and play it as often as I ...",
      "text": "My children LOVE this game and play it as often as I let them. It's a good child friendly game!",
      "rating": 5.0,
      "verified": true,
      "author": "Lovetopurchase",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Game is hard to start but fun once it's started!",
      "text": "The menu is very complex. Is always a chore to start a new game.",
      "rating": 3.0,
      "verified": true,
      "author": "R. YOUNG",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Great Game",
      "text": "My daugter and I have had the WiiU for about one year. We have maybe 12 games. This was by far the best one we have purchased. We use it over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "Mob-barley",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "Great racing game",
      "text": "My son and I like this much better than the Mario alternatives (haven't tried Mario Kart-8 yet though)... much better graphics and the transformations are great.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Thomas",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Three Stars",
      "text": "the game get pretty tired fast, no where near as good as Mario Kart",
      "rating": 3.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Very fun, pretty easy and great graphics",
      "text": "This game has been a hit with our kindergartener (new gamer) and with us adults too. The graphics are good, it's pretty easy to navigate and short \"levels\" make for fun play.",
      "rating": 5.0,
      "verified": true,
      "author": "LucyLoo",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "Son loves Sonic",
      "text": "arrives on time and was as expected. Was a great surprise to son for it to be race cars but Sonic",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin Dooley",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "Great game.",
      "text": "I love it. Love the fact that is has extra added features like flying and driving in water. Ive only played the game once to test it but its definitely something i can see myself playing often.",
      "rating": 5.0,
      "verified": true,
      "author": "Kisha.",
      "helpful_votes": 0,
      "publication_date": 20130330
    },
    {
      "title": "Fun",
      "text": "My last review was supposed to be for a different product. I'll try and delete it. Fun game",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie Cripps",
      "helpful_votes": 0,
      "publication_date": 20170806
    },
    {
      "title": "A waste of money",
      "text": "The game would not play! Unfortunately this wasn't a good Christmas gift!!",
      "rating": 1.0,
      "verified": true,
      "author": "Dekeithea Chappell",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "Demo was awesome.",
      "text": "Im really waiting on Mario Kart, but this will have to hold me over until then. Download the demo and try it yourself. Controls felt great and the music and tracks were gorgeous.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Jenkins",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "Kart racing to a different beat",
      "text": "It ain't Mario Kart...it's its own thing. And that's good! It's wild and fun, alone or in a group.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Walsh",
      "helpful_votes": 0,
      "publication_date": 20141201
    },
    {
      "title": "All star in my book",
      "text": "This was a present for a grandson. Fast paced and exciting. Sonic has always been a favorite and this one is no exception",
      "rating": 5.0,
      "verified": true,
      "author": "*",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "My favorite game.....",
      "text": "This game gets the most play on my Wii U. Great graphics and lots of fun. Thought it would hold me over til MarioKart 8, but it's much better than a mere filler game. If you like racing games and you are thinking of getting it, get this...",
      "rating": 5.0,
      "verified": true,
      "author": "TheNardDog",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Happy Grandson!",
      "text": "This was a xmas gift for my grandson and he was thrilled with it. Said it was just what he wanted. Compared price local game store and was happy with the Amazon price.",
      "rating": 5.0,
      "verified": true,
      "author": "grace chessa",
      "helpful_votes": 0,
      "publication_date": 20150209
    },
    {
      "title": "very fun",
      "text": "best kart racing since mario kart series, good selection of lovable characters from really iconic and nostalgic sega universe like alex kid and shenmue.",
      "rating": 5.0,
      "verified": true,
      "author": "Fahd Almohid",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "Better than i thought",
      "text": "I was a little skeptical at first because i didnt really like the first one but for $40 i decided to give it a shot and man was i impressed this game really gives mario kart a run for its money. The graphics are excellent the courses are great and the transforming cars are great fun. Do yourself a favor if you are thinking about getting this dont hesitate its an awesome game",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130202
    },
    {
      "title": "If you like the original you will like this one",
      "text": "Bought for my son. We had the original on our phones and he wanted it for our Wii. Tons of fun and best played with a steering wheel. No complaints here.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Driggs",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "super fun",
      "text": "racing with 5 people is the best thing ever I like that I can also use the gamepad only when I want to do something else",
      "rating": 5.0,
      "verified": true,
      "author": "steven12153",
      "helpful_votes": 0,
      "publication_date": 20130301
    },
    {
      "title": "Pretty buggy on the wii u",
      "text": "Pretty buggy on the wii u, seems to crash every 5th play. Over all the kids enjoyed mario kart more.",
      "rating": 3.0,
      "verified": true,
      "author": "Elvish Legion",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Cool Game",
      "text": "Cons: No Story Frequent glitching when colliding with objects Wii Motion is not Optimized enough Pros: Gamepad (+Dual screen > splitscreen) Smooth gameplay controls After Burner soundtrack >.< Fun Racing game for multiple people",
      "rating": 4.0,
      "verified": true,
      "author": "Hass",
      "helpful_votes": 0,
      "publication_date": 20130422
    },
    {
      "title": "my son love the game",
      "text": "my son loves this game the shipping was fast but the only down side was the game did not come sealed it worked fine and my son is happy i would order from this company again",
      "rating": 4.0,
      "verified": true,
      "author": "mummy242",
      "helpful_votes": 0,
      "publication_date": 20131225
    },
    {
      "title": "Love Sonic",
      "text": "It is Sonic what more can I say. As usual a fun game to play. I loved to play Sonic when it first came out on the Sega Genesis system.",
      "rating": 5.0,
      "verified": true,
      "author": "mrajfura",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "Great Graphics",
      "text": "Lets face it. If you got it for the U you got it because a certain other Kart game is out yet. Graphics look good and its playable.",
      "rating": 4.0,
      "verified": true,
      "author": "pen name here",
      "helpful_votes": 0,
      "publication_date": 20131225
    },
    {
      "title": "Wii U game",
      "text": "Great game, great price. Ordered this game for my nephew and he plays every night. Will be buying this game as a gift for my friend kid. Awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20130227
    },
    {
      "title": "Great game",
      "text": "I really enjoy the game. I bought it yesterday and my brotehr and I had a blast playing it for 5 hours straight. There are very minor glitches, which if you don't pay attention, you would not even notice it. If you have wii U i would definitley buy this game over any other version because of the ability to have 5 people play at once. Very good party game.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "good game",
      "text": "Is a good game for kids. The graphics are good, a lot of characters, many tracks to pick from. My 4 years old boy love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Solvey A. C.",
      "helpful_votes": 0,
      "publication_date": 20130906
    },
    {
      "title": "Gift was well received",
      "text": "My grandson asked for this for Xmas and absolutely loves it! The seller was great and we didn't have any problems whatsoever with the purchase or the game.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "WII U game",
      "text": "Great price for Childrens Game for the WII U that my grandson plays. I will look for more games later.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard E. Ortiz",
      "helpful_votes": 0,
      "publication_date": 20130715
    },
    {
      "title": "Five Stars",
      "text": "This game is awesome. My whole family loves playing and racing against each other. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Dujuan",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Awesome game",
      "text": "I've been an ardent fan of Wii Super Mario Kart online for years. I'm surprised to have found a game I like as much.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte Conrad",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Quick fun game for the family",
      "text": "Wonderful graphics, lots of tracks and cars to race and the transformed part is pretty unique as well, am I flying or driving?",
      "rating": 5.0,
      "verified": true,
      "author": "Loyal Customer",
      "helpful_votes": 0,
      "publication_date": 20130218
    },
    {
      "title": "Good game",
      "text": "Not as good as Mario Kart 8 but easier to play.",
      "rating": 4.0,
      "verified": true,
      "author": "V. CrofootTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "As discribed",
      "text": "The game is great for all ages. Online multiplayer :) , repeated replay value. You can't go wrong buying this game.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Super fun!",
      "text": "Very happy -- fun to play and great for gaming nights. Bought this for a relative for Christmas and they love it! :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Phoenix",
      "helpful_votes": 0,
      "publication_date": 20131220
    },
    {
      "title": "Awesome game with few flaws.",
      "text": "Just an awesome game all around. We have both this and MarioKart and I'd suggest this if you were only buying one. There are die hard Mario fans, they're not going to be converted as the latest Mario is great but it's definitely worth the try. The only downside is my son was having a hard time with the flying and boat controls as they are definitely 'looser' than the car. Not enough to stop him from playing though. If you're on a budget, the first Sonic racing was awesome as well. I'm sure you can pick it up a lot cheaper and it doesn't have the control learning curve with the transforming vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Carr",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "This is truly a top-notch competitor for Mario Kart! ...",
      "text": "This is truly a top-notch competitor for Mario Kart! With gorgeous graphics, a huge roster of beloved characters, and unique, addictive gameplay, you'll find yourself coming back for more again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "fun game",
      "text": "great game nephew loved it i bought this along with Sonic Lost word he actually preferred this to the mario games",
      "rating": 5.0,
      "verified": true,
      "author": "Scratchc",
      "helpful_votes": 2,
      "publication_date": 20140521
    },
    {
      "title": "fun game!",
      "text": "Another great sonic game..and if you love Mario Kart..this is for you too..sooooooooooo much fun with the characters you love!",
      "rating": 5.0,
      "verified": true,
      "author": "Julienne S. Rock",
      "helpful_votes": 0,
      "publication_date": 20140201
    },
    {
      "title": "Four Stars",
      "text": "not a bad game, but Mario kart eight is better.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20140806
    },
    {
      "title": "Fun Game",
      "text": "My son enjoys playing the all racing games so I knew he would want this game for Christmas. Works Perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130123
    },
    {
      "title": "great",
      "text": "great and on time. There were no issues and it worked out well. thank you again for this item. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Shar",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "My son loves this game",
      "text": "Good game with alot of action. Utilizes Wii U gamepad well. fun for the whole family, I like it as well...",
      "rating": 5.0,
      "verified": true,
      "author": "John Mojica",
      "helpful_votes": 0,
      "publication_date": 20130619
    },
    {
      "title": "Fun family racing game!",
      "text": "Good, fun family racing game that fills the void of no MarioKart for the WiiU. It's by no means a knock-off, though. The transformations from land to sea to air are fun and good track design means that we'll still play this even when MarioKart comes out.",
      "rating": 4.0,
      "verified": true,
      "author": "BRR",
      "helpful_votes": 0,
      "publication_date": 20131107
    },
    {
      "title": "FUN for the whole family!",
      "text": "My 4 year old can play this game...and I think that is great! We have a lot of fun playing together when we can't get out of the house. My wife likes it, too. A win for the home team!",
      "rating": 4.0,
      "verified": true,
      "author": "yawansumame",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Fantastic game",
      "text": "I initially wanted to purchase this game just because of it's price point and wanted to have my racing fix on Wii U. After playing, I have to say I was happily surprised. At $40 this game is a steal. Great gameplay, visuals, music, and characters. This is more than just a placeholder until the next Mario Kart, it stands on it's own very well and it won't be put to the side when that next MK does roll out.",
      "rating": 5.0,
      "verified": true,
      "author": "OoAK",
      "helpful_votes": 0,
      "publication_date": 20121225
    }
  ],
  "product_meta": {
    "title": "Sonic & All-Stars Racing Transformed (Nintendo Selects) - Nintendo Wii U",
    "description": "Platform:Nintendo Wii USonic and the All-Stars cast line up on the starting grid once again to battle for supremacy in the ultimate race. Compete across land, water and air in incredible transforming vehicles that change from cars to boats to planes mid-race. Master your driving skills as you drift, barrel roll and boost to overtake your rivals, or use your weapons tactically and unleash your All-Star move to gain the winning advantage. \n\nIt's not just your fellow racers you need to watch out for: as the road falls away beneath you, or the river runs dry, new routes emerge and your vehicle transforms to take advantage of the terrain. Discover alternative routes and short cuts as you perfect the course in this adrenaline fuelled dash to the finish line - racing will never be the same again.",
    "rating": 4.6,
    "feature_bullets": [
      "This is no ordinary race. Each character is equipped with their own unique vehicle that can transform into a car, boat and plane to take advantage of the changing terrains.",
      "Take to land, sea & air as you race through 16 dynamically changing courses inspired by SEGA's illustrious gaming history.",
      "Race as one of the 20+ legendary All-Stars. The starting line-up has been transformed as new iconic characters from the world of SEGA join the race.",
      "Utilize an arsenal of devastating weapons which require skill to aim, shoot, evade and block."
    ],
    "specifications": {
      "ASIN": "B008L1PYGK",
      "Release date": "November 18, 2012",
      "Customer Reviews": "4.6 out of 5 stars437 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#10,498 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "0.5 x 5.3 x 7.4 inches; 4 Ounces",
      "Binding": "Video Game",
      "Rated": "Everyone 10+",
      "Item model number": "67101",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "4 ounces",
      "Manufacturer": "Sega of America, Inc.",
      "Date First Available": "August 24, 2012"
    },
    "categories": [
      "Wii U",
      "Games",
      "Legacy Systems",
      "Video Games"
    ],
    "price": 19.0
  }
}