{
  "website_summaries": [
    {
      "verdict": "The Pentax K-30 is weather sealed D-SLR with a large pentaprism viewfinder. It shoots at 5.2 frames per second, does well in low light, and ships with a sharp kit lens.",
      "pros": [
        "Large pentaprism viewfinder",
        "Weather-sealed body",
        "5.2fps burst shooting",
        "Excellent control layout",
        "Very customizable",
        "Sharp kit lens",
        "In-body shake reduction",
        "Very good high ISO performance"
      ],
      "cons": [
        "Fixed rear LCD",
        "No mic input",
        "Slow to focus when recording video",
        "Standard kit lens is not weather sealed"
      ],
      "aspects": {},
      "publication_date": 20120621,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "A great camera at an incredible price",
      "text": "It's just a k-5 with cheaper case, without the top LCD panel. But it retains its best qualities: an incredible sensor, the weather resistant properties and a fantastic viewfinder. On the plus side, it can be powered with 4 AA batteries with a non included accesory. I bought the Maksina brand one which just does the job. The only flaw I found so far, a minor one, is that the memory card isn't too easy to extract, due to the rubber sealing of its compartment.",
      "rating": 5.0,
      "verified": true,
      "author": "now seriously",
      "helpful_votes": 16,
      "publication_date": 20121210
    },
    {
      "title": "Best value Pentax DSLR",
      "text": "This is a fairly compact camera for a fully featured DSLR with a specification much higher than its price point. It has an excellent 16mpx sensor with good high ISO capability. It is weather sealed and has a large bright viewfinder giving 100% coverage. It has two control wheels and good ergonomics. The controls are configurable and really yield little to its big brothers the K-5II and K-5IIs. It is an ideal camera for still photography. Although it has competent video facilities it is not really designed for the keen videographer as it lacks a dedicated video button and HDMI output.",
      "rating": 5.0,
      "verified": true,
      "author": "Archie",
      "helpful_votes": 0,
      "publication_date": 20130605
    },
    {
      "title": "You will not regret getting one of these!",
      "text": "From what i've read in many known photography websites this baby can beat up alot of the Nikons and Canons that sometimes costs more £100 and now that i have one i must say im more than impressed ! Maybe the best deal of 2012 for me when i purchased it for £369. It has an amazing construction quality and good grip, image quality is one of the best out there at this price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruno Pereira",
      "helpful_votes": 0,
      "publication_date": 20130126
    },
    {
      "title": "Great little camera",
      "text": "I have just upgraded from the K-10 and the first thing you notice is the weight - so much lighter does not feel as solid but still seems quite robust. Performance wise is superior in every way great low light and a nice touch is that with the K-10 the generic lenses did not focus true, with the k-30 the fine adjustment is very easy to use and the lenses focus accurately. I would highly recomend this camera as an upgrade from the K10",
      "rating": 5.0,
      "verified": true,
      "author": "E. Palmer",
      "helpful_votes": 0,
      "publication_date": 20130222
    },
    {
      "title": "... think this camera belongs to me but its so easy to use that the kids are always nicking it",
      "text": "I sometimes think this camera belongs to me but its so easy to use that the kids are always nicking it . This camera and two lenses set is pretty much all you need and is great value for money.",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "K-30 - my camera",
      "text": "I had a Pentax K-30 before but someone stole it so after a year I finally bought another one. Reason is that I can use my old manual lenses from my Pentax ME. I love the shape of the K-30, it lays very comfortably in my hand. The functionality is mostly intuitive and the 16 MP are definitely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Solveig Dittrich-Piva",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Pound for pound THE best entry D-SLR on the market",
      "text": "Pound for pound this is the best entry level digital SLR camera on the market. Since the Pentax brand is not as strong as Canon or Nikon you get much more for your money than you would with these other brands and the quality of the camera is on par with them as well for a relative novice like myself. The look and feel of the camera is really good, quality of pictures excellent, easy to use with a relatively simple user manual. Unless you're going pro right from the start, this is a great camera to start with. One other key advantage is the availability and low price of second-hand Pentax lenses.",
      "rating": 5.0,
      "verified": true,
      "author": "Quincy L",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Good camera",
      "text": "Good entry-level DSLR. The instructions are in FRENCH so it's been pretty much a case of learn-as-you-go and I am sure that there are many functions that we are not taking advantage of because of this. However, as a piece of kit, it's a good camera - just be prepared to invest heavily in French lessons so that you can read about it.",
      "rating": 5.0,
      "verified": true,
      "author": "neil fogarty",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "great dslr 10/10",
      "text": "changed from a digital compact camera difference is night and day got £50 cashback at the time paid quickly by pentax great all round camera and great in the wet / snow",
      "rating": 5.0,
      "verified": true,
      "author": "Davver99",
      "helpful_votes": 0,
      "publication_date": 20130415
    },
    {
      "title": "Very good camera",
      "text": "This was a perfect upgrade for an ageing *istDL. Takes reliably better photos, and it's water resistant - though it's difficult to take good photos if it's raining!",
      "rating": 5.0,
      "verified": true,
      "author": "Vivstop",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "Camera",
      "text": "Very good, efficient service. Have tried out camera in the garden and am very pleased with it. Looking forward to using it more.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean Walker",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Brilliant",
      "text": "Met all expectations.Lots of useful features and easy to understand software . Managed to use all lens from K100 camera so saved a lot of money",
      "rating": 5.0,
      "verified": true,
      "author": "I MACKENZIE",
      "helpful_votes": 0,
      "publication_date": 20130302
    },
    {
      "title": "Five Stars",
      "text": "I like this camera. A lot to learn in terms of settings.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen B.",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "Very Good",
      "text": "I used the camera on a backcountry skiing activity and it performed very well even when sleek was wetting all my equipment",
      "rating": 5.0,
      "verified": true,
      "author": "Jordi Gonzalez",
      "helpful_votes": 0,
      "publication_date": 20130411
    },
    {
      "title": "pentax k-30",
      "text": "I find it easy to use, a great camera for the price & a good lense. The anti shake setting seems to work well which is great in low light levels",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Rhodes",
      "helpful_votes": 0,
      "publication_date": 20130429
    },
    {
      "title": "Great Camera",
      "text": "I bought this to replace my K100D body. It is fantastic in low light situations and very quick with 6fps shooting. Positives: Very little noise in low light, Electronic horizontal/vertical horizon axis to line up your shot, 16 M/pixel, Will run on AA batteries (adapter required), Comfortable grip, Live view on LCD panel. Negative: No top LCD panel to show current settings",
      "rating": 5.0,
      "verified": true,
      "author": "D. Mckie",
      "helpful_votes": 2,
      "publication_date": 20121226
    },
    {
      "title": "Great camera. Stylish. And Amazing Pictures!",
      "text": "Just got my camera yesterday and I am in love!! It is a great camera!! Received the package at night, and went out to take some great night shots!!! Everything is in working order and it is really easy to use. The modes are easy to pick up and the scene mode options are great!! Best mid-range DSLR you could buy on the market right now!!",
      "rating": 5.0,
      "verified": true,
      "author": "Shane",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "Pentax K-30 DSLR Camera Body. Pentax-well done!!!!",
      "text": "I am very happy with this Camera.It takes Nice pictures,very comfortable grip ,not heavy and most of all I don't have to be worried about whether conditions any more with W.R. Zoom Lens attached (which I had to purchase separately,very well packed from Camera Centre).Thanks to Amazon for very good service.",
      "rating": 5.0,
      "verified": true,
      "author": "nikola.",
      "helpful_votes": 0,
      "publication_date": 20130511
    },
    {
      "title": "Very pleased, ordered on the 25th October 2013 and delivered at 1100am on the 26th October 2013,Wounderful service.",
      "text": "Im pleased with this Camera,as my previous was a Pentax Film Camera. I had various Lenses which now fit the K-30 Camera.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Barnard",
      "helpful_votes": 0,
      "publication_date": 20131202
    },
    {
      "title": "Manual in French, product sent from Italy",
      "text": "There is no seller feedback area for me so I guess this has to come via product. This product may, or may not be, good. I can't tell as the manual is written in French yet the seller is based in Italy. This is tedious in the extreme but not the end of the world. I will comment on the camera when I figure it out.",
      "rating": 3.0,
      "verified": true,
      "author": "Julia Lloyd ",
      "helpful_votes": 0,
      "publication_date": 20140503
    },
    {
      "title": "A successful present",
      "text": "Bought as a present for my daughter and after looking at the reviews of many cameras we decided on this one as it performs well, is not too big and it looks different. Camera body is weatherproof.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20130109
    },
    {
      "title": "Fine",
      "text": "Am learning to use this camera at the moment, it was a gift from my wife, to stop me being bored when I retire.",
      "rating": 4.0,
      "verified": true,
      "author": "shelagh",
      "helpful_votes": 0,
      "publication_date": 20130725
    },
    {
      "title": "Not a great experience",
      "text": "I bought this for travelling, as it is weather sealed and is described as light and compact(for a dslr)The camera was certainly light, but the build quality felt really cheap, and in the hand it actually felt quite bulky. For the first couple of shots, the shutter locked open, so I probably had a faulty one, and returned it (Amazon prime, brilliant as ever.)Lack of articulated screen a big disadvantage. Just didn't measure up to my sony A55 (or nex5n come to that)so sticking to them on future journeys.Felt very out of date.",
      "rating": 2.0,
      "verified": true,
      "author": "BWFC77",
      "helpful_votes": 7,
      "publication_date": 20121028
    },
    {
      "title": "Camera arrived with defective LCD",
      "text": "This may be a good camera when it isn't defective, but mine arrived with a rear LCD that had a series of black lines of non-functioning pixels over half the LCD. It wasn't one bad pixel or even one line of bad pixels, but at least 20 lines. Either Pentax quality control is essentially non-existent, or the camera was damaged in transit. After the front focus issues on the K10D and now this I am giving up on Pentax.",
      "rating": 1.0,
      "verified": true,
      "author": "Davide",
      "helpful_votes": 9,
      "publication_date": 20121128
    },
    {
      "title": "Great camera...until it's not!",
      "text": "I agree with every other review with reference to picture quality and weatherproof construction, and I've enjoyed using it for a good few years of sporadic use. However the known issue that causes under exposed shots is just not good enough...especially as it seems to happen just out of the warranty period. Stay away and save up for a K70 or above (as the K50 has the same issues)",
      "rating": 2.0,
      "verified": false,
      "author": "R. Jenkins",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Pentax K-30 Digital SLR Camera",
      "text": "Pentax K-30 Digital SLR Camera: Excellent DSLR camera that delivers a lot of features and performance Pros: Detail-rich images Noise-free images all the way from from ISO 100-1600 100% viewfinder coverage Large, high-res LCD screen Fast 6fps continuous shooting rate Responsive AF system Stabilised sensor HDR mode Weather-sealed body Li-ion or AA batteries Cons: Slow contrast AF system which detracts from using the Live View mode No HDMI out Rating: 4/5",
      "rating": 4.0,
      "verified": false,
      "author": "John Kaiser Calautit",
      "helpful_votes": 5,
      "publication_date": 20130624
    },
    {
      "title": "Still a great camera 3 years after it came out",
      "text": "Still a great camera 3 years after it came out. If you are an outdoorsy type who loves to be out photographing in all weather, especially the wind and rain, then this could well be the camera for you. It certainly looks the part and with it's fully weather sealed body and lens you are going to be able to enjoy every minute of the British weather.",
      "rating": 4.0,
      "verified": false,
      "author": "Jono",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Excellent camera - knocks the spots off rivals",
      "text": "Weather sealed and great build quality. This camera has really pro features and is now (as of Nov.2012) at a bargain price. You will get truly professional results with this camera.",
      "rating": 5.0,
      "verified": false,
      "author": "tigershoot",
      "helpful_votes": 8,
      "publication_date": 20121102
    },
    {
      "title": "first dslr i like it!",
      "text": "fast than i can imagine! 3days from uk to ie. first dslr i like it!",
      "rating": 5.0,
      "verified": false,
      "author": "Dai Qihang",
      "helpful_votes": 0,
      "publication_date": 20141016
    }
  ],
  "product_meta": {
    "title": "Pentax K-30 - Digitalkamera - SLR",
    "description": "K-30 in white + DAL 18-55 mm Lens",
    "rating": 4,
    "specifications": {
      "Product Dimensions": "5.06 x 2.81 x 3.8 inches",
      "Item Weight": "1.3 pounds",
      "Manufacturer": "Pentax",
      "ASIN": "B008384CFA",
      "Item model number": "15678",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.0 out of 5 stars7 ratings4.0 out of 5 stars",
      "Date First Available": "January 24, 2013"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "DSLR Cameras"
    ],
    "price": ""
  }
}