{
  "website_summaries": [
    {
      "verdict": "An affordable case that is designed to protect your DSLR camera against dirt, debris and much more.",
      "pros": [
        "Fits DSLR cameras with a zoom lens attached up to 110 mm",
        "Comes with hook-and-loop straps to help secure your camera in place",
        "Waterproof EVA base offers extra protection against rain, sleet, and other inclement weather conditions",
        "Equipped with a padded adjustable shoulder strap that allows you to wear the case as an over-the-shoulder bag"
      ],
      "cons": [
        "Shoulder strap may rip or tear quickly",
        "Interior pockets provide limited space for cables and other camera accessories"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect for the new Nikon Coolpix P1000 4K 125x Superzoom",
      "text": "I ordered the Nikon holster case for my P1000 over a month ago and it is still back-ordered so I ordered the Amazon holster case and it fits perfect !",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Ogiba",
      "helpful_votes": 33,
      "publication_date": 20180928
    },
    {
      "title": "Bulky and Awkward",
      "text": "The Good: It's inexpenisve and it'll definitely protect your gear. The Bad: It's really bulky. Like, weirdly bulky. I have yet to encounter a scenario in which I want to pack my camera into this beast, sling it over my shoulder and head out; I nearly always just take the camera on it's own, or put it into a much lighter, smaller canvas camera bag. I'll use this if I'm flying someplace, but once I arrive, I switch back to the canvas bag. It's also not great construction; the zipper on the side pouch came off the first time I used it and the shoulder strap is really stiff/bulky/uncomfortable. Not a fan.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 6,
      "publication_date": 20180813
    },
    {
      "title": "Worth every penny!",
      "text": "I could fit my Nikon D5200, a couple rain bags, lens puffer thing, wireless remote, 2 extra batteries, 4 SD cards, lens cleaning wipes, and a long lens in this bag. It is sturdy & definitely well made. I took it on a 2 week backpacking wilderness trip and it worked great! I like that the bottom is solid molded plastic so I didnt have to worry about moisture getting in the bag when I set it down, and that it sits upright nicely without falling over. It’s well padded, and after 2 weeks of being in and out of my backpack it protected my gear perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Aubrey",
      "helpful_votes": 5,
      "publication_date": 20180126
    },
    {
      "title": "Best Amazon Basics Camera Bag",
      "text": "I have a Canon T7i Rebel and went through 5 different camera cases. Each one was either too small or too big and most of them had some design issues. I really should have just bought this amazon basics bag first because it would've saved me some hassle. The bag is small but fits my camera perfectly. The strap has a little shoulder cushion which is great and the bottom even has a hard exterior. The bag did come with some of those little \"hairs\" that people have complained about but they are not human hairs. They thin, hairlike pieces of the bag's fabric. Probably there from manufacturing. Overall, I'm very happy with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Emonkie",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Fantastic product and value",
      "text": "This Amazon basics case is ideal of a larger camera. It is solid, protective and functional. In fact, it is cheaper, slightly larger, has more compartments (5 vs 3), has a solid waterproof base and has a better carrying strap than the comparable Case Logic one. I have both now and the only plus for the Case Logic is that the external fabric seems slightly richer in texture. The Amazon Basics case includes two Velcro-secured small compartments inside the front one and these are perfect for safekeeping your extra SD cards without letting them fall out.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Excellent value",
      "text": "I carry camera gear offroading (GoPro and 4:3 Mirrorless Camera) and my old soft sided case finally gave out. I wanted something that fit between the seats of a Polaris RZR and this looked like it work. And it works perfect. It carries my Olympus camera with ease in the main compartment, GoPro batteries in side panel and GoPro Hero 6 & 8 in front compartment and GoPro Hero 2018 and GoPro Hero 4 in the other side compartment. Zippers seem higher quality than my old case too. Should be water resistant and dust resistant to a point as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh J.",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Better and cheaper than the very similar \"Case Logic SLRC-201 ...",
      "text": "Better and cheaper than the very similar \"Case Logic SLRC-201 SLR Zoom Holster\". At least it works better for my Canon 5DMIII with EF24-105mm (without the hood). You can use the provided dividers to hold the camera by the body in substitution of the CaseLogic's canopy (that canopy is not removable on the CaseLogic, if you don't use it will be in the way all the time and sticking to the camera on every withdraw).",
      "rating": 5.0,
      "verified": true,
      "author": "SirGio",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "A Very Pleasant Surprise.",
      "text": "After reading the product description; I purchased this bag on the chance that it might fit my camera. I was very pleasantly surprised. In the main compartment; I can fit my Canon Rebel T6s with a BG-E18 battery grip attached, hand strap, shoulder strap and an EFS 17-85mm lens with lens shade. In the front pocket a Bonacell E17 dual battery charger, charging cable, and a short USB camera to computer cable. In each of the two side pockets, an extra E-17 battery. This bag will work for anyone with a similar configuration. A great bag for travelling!",
      "rating": 5.0,
      "verified": true,
      "author": "Nelson",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Inexpensive sturdy bag",
      "text": "This is a good bag for the amateur photographer. It holds a DSLR with a physically long lens. It's sturdy and well padded. It's ideal for times when you want to take one lens and some small accessories. It's easy to remove the garish Amazon logo patch with a seam ripper. The contrasting orange stitching is an abomination but it's not a deal breaker. For the price it's excellent.",
      "rating": 4.0,
      "verified": true,
      "author": "Joel FritzTop Contributor: Guitars",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "This is a good, small case for protecting your camera getting to photo events and back home.",
      "text": "The case provides good protection for minor bumps and short drops. It provides just enough room for a medium size lens on the camera, charger and cord, an extra battery, and USB connection cable. Virtually nothing else would fit. Also a Nikon manual fits in the main compartment. I'd prefer a more stable base. A full rubber base might provide more stability. The zippers work well. The handle strap and shoulder strap and fully functional. There are hook and loop dividers to hold the camera in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Masnor",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Very nice product-very good quality.",
      "text": "Very nice product from Amazon family and a must have for anyone who loves a DSLR. This is well fit for a normal DSLR with a moderate zoom lens and has extra pockets for memory cards or chargers or extra batteries in case needed. I use a Nikon D7100 and 18-140 kit lens goes smoothly in the bag with the correct length to close the bag. The bag is very sturdy and can withstand small shocks also. It is water proof for rain, but not sure if underwater proof. Overall I am completely satisfied with the Bag.",
      "rating": 5.0,
      "verified": true,
      "author": "MaheshKrishnan P",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great case.",
      "text": "I used this for my Panasonic Lumix. It fits well and had enough pocket space for my battery charger and spare batteries. Id you pack extra lenses this won’t work. At the bottom of the case there’s two dividers that cradle the camera as you pack it lense down. Works great and protected my camera during a long trip. I didn’t use it when I was out and about as I wanted quick access and it adds quite a bit od bulk. The strap is comfortable and wide unlike the strap on my camera.",
      "rating": 5.0,
      "verified": true,
      "author": "techgeek",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "An okay camera bag for the price",
      "text": "You get what you paid for. It is just an okay carrier bag for ONE camera body with an attached lens and maybe another lens of you can squeeze it in. I don't think it'll take more than that. It certainly cannot take a lense longer than 17 to 70mm. It has 3 side pockets that are almost useless and can't really fit anything other than say an SD card and a very small cable. If you're looking for a cheap bag, definitely go for it. Otherwise save and get something better.",
      "rating": 3.0,
      "verified": true,
      "author": "Bunmi",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Sturdy, Waterproof, Holds everything I need when adventuring",
      "text": "Very sturdy, holds my Kodak PixPro very easily. I don't worry about it when I'm using it. Adjustable pieces inside the main compartment make it easy to form fit your camera and lenses. I'm able to fit an adjustable tripod in the main complartment WITH my camera, and a microfiber cloth to keep the lens clean. The side pockets aren't crazy big, but I find no trouble fitting my misc attachements for my tripod in one, and the charger for my camera in the other. The front pocket has 2 envelope-type pockets inside that close with velcro to hold your extra SD cards.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Martin",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Solid budget bag",
      "text": "Fits my Nikon D5200 with sun guard without issues. Build quality is good, water resistance (not fully tested) seems solid from what its has had to withstand so far, and it DOES hold all my cards and charger but the side pockets are a bit too rigid for my liking. They can only hold a minimal amount of peripherals. I ended up having to put my charger in the primary compartment with the camera because there wasn't any give in the side pockets. Beyond that it's been great, and I certainly can't argue with the price.",
      "rating": 4.0,
      "verified": true,
      "author": "itsMYHotSaUCe",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "ditch the strap and you can't really go wrong with this bag",
      "text": "I don't think you can really go wrong with this $15 Holster bag. It currently is housing my D7200 w/ Battery Grip and 20mm 1.8G lens attached. The cushioning is adequate enough to protect it from the occasional bump, but like any consumer camera bag option, I would have my doubts with drops. The exterior fabric is 'good enough' to withstand some light exposure to rain and wind, but it's definitely not built (seams/zippers) and treated to be an all weather bag. The only knock I would give it are the strap clips. The plastic feels cheap, the assembly flimsy. I swapped mine out with some spare Peak Anchor links and a strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristopher H. Kunisch",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Aside from strap is a fantastic value, great quality.",
      "text": "Long time Lowe user. First buy of this product. The strap should be re-designed/improved- its too rigid.. Quality of actual case is fantastic for the price. Main compartment is adequate for my Nikon P900. Side pockets can fit slim batteries and memory cards but not charger which can fit in the front. Another suggestion is to flip the zipper so its facing away from the body and will be easier to open (though some may prefer it the way it is facing the body and protecting anything accidentally falling out).",
      "rating": 4.0,
      "verified": true,
      "author": "Ash_K",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Nice vacation bag",
      "text": "This is a great size bag for traveling. We have a nice larger backpack style bag that holds a lot more (huge zoom lens, etc). This bag really only holds the DSLR base, charger, and one smaller zoom lens. But, on vacation it's the perfect compromise between having a ton of room and being small enough to carry. I can carry it easily cross-body or over a shoulder. It fits nicely into a suitcase. I wish it had more internal dividers.",
      "rating": 4.0,
      "verified": true,
      "author": "Becky Laswell",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Works great, the flat bottom is the key",
      "text": "Brought this for a Salmon fishing trip in the Puget Sound. Worked great protecting my 77D Canon with 3 attached lens (clipped on strap). With fish flopping on the floor in the dark (4am boat launch) I took 1500+ pictures putting the camera in and out many times. Great for a hike shoot. The hard flat bottom really makes this case different. I have 4 camera bags this one is great for a light pack walk or in the elements.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Awkward shape, falls over easily, but OK for the price",
      "text": "The price is low and this is OK value for the price. However, it doesn't cradle a DSLR very well and is awkward shape. The conical shape falls over on any surface that isn't perfectly flat and level. The interior supports are flimsy and not well designed, and will not hold a DSLR well if you change lenses at all. Without the supports you end up with the camera resting on the lens, which isn't ideal. All in all this is OK but not great.",
      "rating": 3.0,
      "verified": true,
      "author": "Yet another customer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Great find in a DSLR bag!",
      "text": "I needed a new bag to carry around my DSLR, without all the gadget bag stuff. This bag from Amazon Basics fit the bill and the size and price were on target! Only about $14. It has enough room for my Nikon 5300 DSLR and pockets for memory cards and batteries. Well-designed. This is my second Amazon Basics product. Previously, I purchased a backpack for my camera and laptop. Excellent and, again, an appreciated price of under $30. Keep up the good work on very useful and budget-priced products carrying the Amazon Basics brand!",
      "rating": 5.0,
      "verified": true,
      "author": "Wordchipper",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "Worth the price",
      "text": "Nice looking, roomy with strong stitching. Very good quality for the price. I can fit my d7100 with a 55-300 Nikkor lense. With a smaller lense ( 50mm, 35mm, 18-55 i.e. ) you can get even more stuff inside. Has three zippered pockets on either side and front for smaller items like filters, cleaning fluid, Qtips, battery, sd cards etc. Really like it. Nicely constructed. Oh, and it has a nice, sturdy, long strap with padded area for shoulder.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Super small and convenient",
      "text": "This is the best camera case. I can fit a small lens in the bottom and the camera with a lens at the top. If I have to, I can clip my bigger lens to the side with another case I have from Amazon. I would absolutely recommend if you are just an amateur photographer and don't need much for your photos. I hate lugging around my huge camera case and this is a great alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie V.",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "I've been bamboozled",
      "text": "I reveived a \"used\" camera bag. There was someone's tiny little hairs in the cotton like material inside...grrr... I started to return the bag, but for $14 its not worth repackaging and using gas to get to UPS. I spent about 6 minutes using sticky packing tape to remove the hairs. I wiped it down with lysol wipes. Besides that, the camera is a decent bag; a bit bulky, but suffices for my camera.",
      "rating": 2.0,
      "verified": true,
      "author": "Ms. Snazzy",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Great fast camera bag",
      "text": "Was looking for something to tote a large dslr with battery grip, thought I was going to have to spend a lot more money. This is as advertised not as \"flexible\" as some of the brand names but holds this secure and safe. Just what I needed for just the camera. Not a lot of extra space for more than a couple of SD cards or lens cloth, but cannot beat it for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Marshall",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Not what I expected",
      "text": "The material is good but the problem is that you have to put the camera lens pointed down and it takes up all the space. You might want to buy a more practical camera gbag. I was disappointed as it was proposed with the camera. It is not at all useful. Just go to the store and buy a bag you are comfortable with and bring your camera to test it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Great SLR Type Camera Case that Resists Water",
      "text": "My Sony gear is well protected overall. But sometimes I just want to leave the backpack behind and venture out with just the body and the 50mm lens. This bag does the trick and does it well. Fits my Sony A77II with battery base and 50mm lens perfect. It also has pockets for some extra storage. I like the exterior plastic base that keeps the fabric off the ground when you set it down. Very nice top handle also. It's a perfect fit for many SLR type camera's but check your dimensions carefully before ordering. Good job Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Mike",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Great for NIKON D5200 (limited to lens size)",
      "text": "Fits my NIKON d5200 with a 18mm-55mm lens perfectly. Room to spare for my SanDisk extreme portable ssd, along with a rubber lens hood and car battery charging cable (for the charging terminal). Side pockets can hold a battery charging dock depending on the bulk, front pocket can hold extra batteries and SD cards. Very compact for what it is.",
      "rating": 5.0,
      "verified": true,
      "author": "parm",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Perfect Fit",
      "text": "My DSLR with 28-300mm zoom lens fits perfectly with reversed lens hood and lens cap. I lost my original leather case and bought this as a replacement. This material is durable, attractive, and light weight. The case has extra pockets for storing memory cards and extra filters. The base is molded so the case stands when you set it down. It is so much more versatile than my original case. The price is far less than replacing my original.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Clark",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Awesome for the price",
      "text": "Size works well for my Nikon D7500 with a 16-80mm lens (not with a lens hood though). The bag protects my camera and lens well when worn over the shoulder or thrown into a tote or backpack. It has pockets that work well for lend cloths, filters, SD cards, keys, and/or credit cards (but not much else). I especially love the hard bottom surrounding the lens. This is a great bag for the price, but I do wish the pieces securing the camera within were more sturdy than two strips of Velcro. Also, the strap squeaks a little when worn over the shoulder, but a little WD-40 applies with a paper towel solved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Does the job",
      "text": "Does the job. Purchased it with the idea for quick access and put away for the camera but Its larger then expected (purchased it for Canon M50 with tele lens). Will have to add extra separators eventually to create additional pocket which then can be used for batteries and charger and so the camera doesn't fly around. A plus would be a strap that can go around a person in addition to shoulder strap.",
      "rating": 3.0,
      "verified": true,
      "author": "BM",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Holds most everything",
      "text": "This will hold up to the Lumix FZ1000 and FZ1000 II. I would be a really tight for the FZ2500/FZ2000. Room for candy bar in main pocket. Three zippered pockets for filters and memory cards. If you have smaller camera with lenses you may get a couple of lenses in the bottom because your camera can be elevated inside the case; a really nice feature.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCal-G&J",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Excellent pack",
      "text": "If it had molle straps, it would be perfect. because then I could hook it to my belt or pack. Well made and has nice pockets to store accessories. It stands up nicely and the strap is comfortable to wear. Nicely cushioned for my camera. In fact I bought it to be slightly bigger than my camera, and I am fine with that because if I use a bigger lens, then I am okay. The moveable security straps are great because I can securely pack my camera with its carrying strap on it. I am really very happy with this holster camera case.",
      "rating": 5.0,
      "verified": true,
      "author": "EOB",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Perfect bag for minimal space",
      "text": "Perfect bag for minimal space. Fits camera and one medium length lens attached. Has pockets for a lens cap, batteries, extra memory card, etc. but nothing more.Well built and durable. The strap padding is crappy, but works fine. This is my \"I want to take the good camera on vacation, but not take up a lot of room in my suitcase\" bag. I take my Canon 17-55 lens and it covers just about everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Platinum",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Excellent protection, but still fairly compact and lightweight",
      "text": "This camera bag arrived with my camera as scheduled. The camera bag is very sturdy, well padded, fairly light and compact and serves my needs...but has somewhat limited side pocket storage compartments...There is room for the camera body and two lenses...but not much else in the primary compartment. The \"outside\" zippered side pockets can hold a couple of back-up batteries, extra SD cards and lens caps...the front pocket can hold a charger and maybe a cord. You can put the charger in the camera compartment but it will crowd the fragile camera and lenses. There is plenty of room if you are only carrying a single lens and camera body. Overall, I am satisfied with the camera case.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Arvon",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Perfect case for Panasonic Lumix G85 w/ zoom lens",
      "text": "I have been looking for a case that is more compact than my DSLR backpack, but still large enough to carry my Lumix G85 with a decent sized lens installed. This case was inexpensive, fits the camera perfectly, and feels durable. It also has a firm molded bottom that lets it stand upright and protects the camera and fabric from the elements. I highly recommend it and for less than $20, it is less expensive than any of the competition!",
      "rating": 5.0,
      "verified": true,
      "author": "DIY Paul",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Great camera case",
      "text": "Love this case. Perfect for my camera with a decent zoom lens, and has storage on the side. The shoulder strap has a padded area that feels stiff, but I'm hoping that works itself out. Well worth the money. I have the Amazon Basics backpack which holds my camera, several lenses, a flash, etc., but for just taking my camera out for small trips around town or excursions on vacation when you don't need that much gear, this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Dani G",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "Perfect single dslr bag.",
      "text": "Has three side compartments for extra SD, batteries , micro clothes. Only room for one lens but that’s what this bag is for. Perfect option to allow you to protect and carry over the shoulder when you have just the hand strap on your camera. Bag seams to be made well, stitching, zipper, handle etc - would think it would protect well in the rain but haven’t been in inclement weather so i can’t speak to its water resistance",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin R",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Handy but Quality could be better",
      "text": "The bag was really very useful and easy to carry it around, great space and good sections to carry the batteries, charger, etc. Inner material could have been better because it sheds out lot of dust and thread pieces on the camera. Have to clean my camera every time . It's very bad for the camera sensors. Overall a decent bag if you just have one lens and camera body.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "Didn't Fit a Toyota RAV4 2016 Dashboard",
      "text": "This product was recommended to me by a friend who have a Honda CRV. It fit perfectly in her CD slot and dashboard. When I tried to use it on my Toyota RAV4 2016, it didn't clamp onto the dashboard securely. It is a well made product; it just didn't work with my car. Be sure to check what your car's CD slot and dashboard look like before purchasing this.",
      "rating": 1.0,
      "verified": true,
      "author": "Andes Gal",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Great Product",
      "text": "This is a good product. It fits my DSLR Canon Rebel perfectly. I have another main camera backpack but when trying to travel light you need another alternative that can fit in a suit case. This one worked perfectly just for that. My only complaint is that the should pad on the strap is trash. Its stiff and fold around your shoulder comfortably. But don't let that deter you, they have to sacrifice somewhere to still offer a decent product at this price. You can put another strap on if you want.",
      "rating": 4.0,
      "verified": true,
      "author": "Jacob Hood",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Good buy for a good price",
      "text": "I think the name goes for itself, basic. I needed something to hold me over until my Christmas gift from my mother-in-law came in. It held my Nikon D3500 with the 18-55mm lens attached well, and I laid my 70-300mm lens over it. It wasn’t my recommended choice of bags, but if you’re working with a camera and a lens, this is perfect for you. It was durable, lightweight, and held everything I needed. It was cheap, and it made it through the month without any complaints. I can’t rate the water resistance because I don’t quite remember exposing it to the elements. I’ll find further uses for it in the time being.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin Charles",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Super durable, but top heavy, falls over easily and super bulky.",
      "text": "This is a super durable bag, feels like it can last forever. But it is really awkward to cary around because it sticks way out when carrying around using the shoulder straps. Also, when setting it down, it is top heavy and falls over almost every time. Pros and cons. Yes, it will protect your camera but not very convenient to carry around.",
      "rating": 2.0,
      "verified": true,
      "author": "capncraigagain",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Great case for the money",
      "text": "This case fits my 80D and 24-105L very well. The opening is square so it is a little more bulky than I would like. It appears designed to fit a gripped body, and the size of the case seems a little funny if your camera isn't gripped. This alos lacks some of the extra features I had on the loewpro case this is replacing such as waterproof zippers. I will carry a dry bag incase of very hard rain, but should be ok otherwise. Overall I am am happy with the case, but would consider spending more for a better fit and lower profile next time.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Stockbridge",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Compact bag",
      "text": "I love this bag. Compared to my other bag this fits my camera so much more nicely and more snug. I don’t worry about it moving in there and breaking. I like it more compact since I don’t like carrying s lot. I can’t fit my extra leave in there and can only fit extra accessories if they are small. I’m sure there are other bags that will if that is what you are looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "goht",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Is it too late to return it?",
      "text": "I received this product the day before I was traveling. Workmanship and stitching is off base. The amazon logo is crooked and off center. Stitching looks like it was done by a 10th grade home economics student. Need to make a better quality product and sell AMAZON!",
      "rating": 1.0,
      "verified": true,
      "author": "Mashud",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Perfect fit for Coolpix P1000",
      "text": "Just the right size for the P1000. There is a small pocket on the front as well but it doesn't hold much more than a battery or lens cap.",
      "rating": 5.0,
      "verified": true,
      "author": "Rain_in_Winter",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "I would buy again!",
      "text": "Really nice product! I would buy again. If this review was helpful please let me know by clicking the “Helpful” button below the review.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 2,
      "publication_date": 20190815
    },
    {
      "title": "Not really a fan of this",
      "text": "2.5 stars, I rounded up just because it's so inexpensive. It's pretty basic (duh), on the verge of being poorly constructed. My least favorite thing is that the inside isn't a lint-free material like my other cases, but is kind of a soft fuzzy felt-feeling stuff. Which of course probably ends up producing a lot more dust than a smooth surface.",
      "rating": 3.0,
      "verified": true,
      "author": "B.E. Lewis",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Very wide, wider than my DSLR with wide angle lens",
      "text": "It is okay. It is solidly built but is wider than I need, so there is a gap width-wise. I think it will protect my camera well; just don't like that it is flopping around unless I bolster it with the velcro pieces (which camera with lens hood gets caught on going in/out of bag). I have a Canon 40D with a couple of lens I swap between, to include a wide angle 17-55 with lens hood.",
      "rating": 4.0,
      "verified": true,
      "author": "JCw3",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "holds my Pentax K-3 with battery grip attached",
      "text": "Well made roomy bag. Holds the above mentioned camera with battery grip and zoom lens attached. Superior padding all around at a great price. The front pocket will hold spare batteries and the side pockets will be ok for smaller items such as filters usb cable etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Dickinson",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Perfect for my needs",
      "text": "This is the perfect size to hold your camera and small accessories like your charger, cables and memory cards. I wanted something compact that I can throw in my backpack and the padded bottom with the hard plastic bottom really sold me. I can fit my Canon 60D with an Altura strap that has a bottom attachment. Plenty of room. I'm a huge fan of AmazonBasics products bc they are well made and all have a great price point. If you are looking for something that holds a bunch of stuff, this isn't for you. But if you need a compact case with nice padding, pockets for little things and it's well made? Don't hesitate.",
      "rating": 5.0,
      "verified": true,
      "author": "SB310User",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Good quality, best for full body cameras with shorter lenses",
      "text": "Good build quality for such an inexpensive case, but does not fit my Nikon D810 when attached to my most often used 24-70mm zoom... IF a neck strap is attached to the camera. Since mine is always attached for safety (and paranoia) reasons, I need to let the neck strap dangle outside of the case when it's shut, so the zipper is never fully closed and it gets a bit cumbersome to carry around. Best for carrying a camera with a shorter lens, but it's great for a quickie trip when you know you'll only be using one lens.",
      "rating": 4.0,
      "verified": true,
      "author": "Marko RamiusTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Useful case",
      "text": "I use this as a secondary case for my Nikon D3200. I have a case that holds most of my camera gear, but I frequently find mysels using just one lens. This provides plenty of room for the camera body with one lens & a few filters & other accessories. I use it as a supplement to my main bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard McCain",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Excellent physical quality, Holds full size DSLR no problem",
      "text": "This holds my Nikon D300 with battery grip attached and 70-300 lens. The build quality is very good, really like the flat bottom, bag stands up on its own. My only issue is that the side pockets are very tight, they really only would fit SD cards, the front pocket can fit batteries, but not much else.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Fletcher",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Nothing basic about this case.",
      "text": "Beyond amazed with the amazing quality of this bag, definitely nothing basic about it! For the price and quality it really is a steal. The bag is big on the inside and has a hard bottom plastic part so if you decide to put your camera down it protects it from a hard fall or water soaking towards the lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Saira",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Neither fish nor fowl",
      "text": "This doesn't quite qualify as a camera CASE but not as a camera BAG either. As another review put it it doesn't really fit, is too big for my camera but big enough to hold many accessories and I feel was advertised incorrectly. I thought it would fit on my belt, which it doesn't do. Had it not been a \"package\" with a camera I ordered I would have returned it. It was well-made, but again, does not really meet my needs. I feel it was poorly designed. (Maybe that's how it ended up as part of a \"free accessory package!) I had to order another item to replace it.",
      "rating": 2.0,
      "verified": true,
      "author": "R. Slater",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Great small bag for on the go people",
      "text": "This bag is exactly what I need when I just want to carry my Nikon D7200 with an 18-300 lens, an extra battery and cards. (No room for an extra lens or other equipment). The fit is perfect when the camera is fitted lens down. It's well padded. As you can tell from the picture, the bottom is sturdy but the bag can be top heavy and topple over easily. That's the only reason I gave it 4 stars rather than 5. Toppling over hasn't damaged anything since it is well padded, but I'd feel better if it had a wider base.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Claxton",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Great value for a holster bag.",
      "text": "I have become a big fan of Amazonbasics camera gear as it is a great value for the product. The camera bag fits my Nikon d5300 with a large lens mounted easily. The bright orange interior makes finding cap lenses easy as it is not black-on-Black.",
      "rating": 5.0,
      "verified": true,
      "author": "Alper Gunduz",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Overall I thought It would have been more versatile",
      "text": "This is a great bag, if you just want to carry your camera and a kit lens. There is only room for the camera with a kit lens or something of similar size. The pouches with zippers on the size are super thin and could possibly carry your batteries but thats it. I have no place to put anything else like my mic or my battery charger.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua Robling",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Well made but side storage compartments are useless",
      "text": "Well made and holds my Panasonic Lumix Z80 with room to spare. But let's talk about room for other stuff. The side pockets are useless for anything thicker than a memory card. Even my spare batteries will not fit in as the pockets have no excess room and are essentially tight slots with zippers. The front pocket is more useful, but is not very long. The most storage space is in the main compartment under your camera. This piece could be much better with a little more attention to the design.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri M. Sweeney",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Quality bag for a affordable price.",
      "text": "Well made with a padded adjustable strap. Can hold even a telephoto lens. Pockets for extra memory cards & batteries. I will be getting another to hold my other camera with different lens like the pros do so I'm ready for any shot.",
      "rating": 5.0,
      "verified": true,
      "author": "Babe1941 (Auntie B)",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Well done Amazon Basics...Quality & Perfect size!",
      "text": "Well made/looks, feels high quality and comfortable padded shoulder strap! Fits my camera, charger, battery and cords, with room to to hold a smart phone. Prefer this over foam sleeve, due to have shoulder strap vs. Velcro loop... Purchased this after loosing 2 foam sleeves...one stolen off my belt loop in a crowed plaza (held by a Velcro strap) and put the other in my back pocket (either fell out or pickpockets) all happened in Europe.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Williams",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Very good Camera Bag",
      "text": "I bought a few types. some I had to send back they were not big enough or not durable. This brand I found to be excellent. Easy to recommend this one. Lots of room and easy access. Also has a nice comfortable padded carry strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Goldstein",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Fits a larger heavier camera, Sony AIII 7 with lens.  Comfortable to carry",
      "text": "I've been using this camera case for about 5 months now and like it. The camera plus case is a little bulky, but the camera is well protected and the strap helps distribute the weight. Convenient to use, has 2-3 side pockets for accessories.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Block",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Perfect size",
      "text": "I JUST opened this item and I already like it so much that I’m writing a review. It is perfect!!! I have the Nikon D7200 and the 35mm 1.4 lens. I wanted a bag just for these two items because that’s all i really use. There are three pockets and the front one has slots for memory cards. My charger didn’t fit but I carry two batteries so it’s actually okay. It looks super durable, very thick material. If I drop my bag with the camera in it, I won’t panic at all. Overall, definitely recommend this bag!!!",
      "rating": 5.0,
      "verified": true,
      "author": "sandra",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Portable for short term photo work",
      "text": "I have two other camera bags that suffice when traveling, but needed a smaller more portable camera bag for short jaunts from home or on the road. This bag works for me and allows me to attach medium long lenses to my 70D and SL2.",
      "rating": 5.0,
      "verified": true,
      "author": "dpmfoots",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Great value",
      "text": "I was astonished by the quality of this bag at this price. High grade materials, great stitching, well thought out...it's truly amazing. It fits the new Nikon Coolpix P1000 - which is a huge camera. It is also a third of the price of the Nikon model (not yet available) made for this camera. I'm so happy their roll-out was poorly planned.",
      "rating": 5.0,
      "verified": true,
      "author": "pjgraham62",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Excellent camera case",
      "text": "This camera case is unbelieveable for this price. I purchased it for a Fuji Finepix S8200 and it fits perfectly, with room to spare. The additional zip pockets are an even nicer feature for batteries, connection cables, and misc. Also placing the camera lens down offers protection with padding in the case as well as heavy vinyl on the outside.Would recommend this case highly, what a deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Mathews",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Amazing at three times the price",
      "text": "Amazon Basics does it right again; this is an excellent, simple, well-made carrying/protective case for a DSLR; my D750 fits perfectly with its 28-300 zoom attached and lens hood reversed. I'll use it for protection when packing in another case - and probably use it for walking around sometimes when I'm not connected to my Spider Holster.",
      "rating": 5.0,
      "verified": true,
      "author": "Nibrocla",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Great small bag for DSLR",
      "text": "I needed a smaller bag and this fit the bill. The main compartment can hold my DSLR securely with the kit lens and still has more space for my small 50mm lens.The front and side pockets can hold extra batteries and memory cards. I like that the bottom is hard for added protection.",
      "rating": 5.0,
      "verified": true,
      "author": "Nora M.",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Sturdy compact camera case",
      "text": "This carries my LUMIX camera and two lenses easily. It has very few other pockets and won’t be the best option if you have lots of gear that needs to be stored or packed around, but it works great if you just want to hit the road with your camera and a lens and scan disk or two.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Recommend",
      "text": "I took this case on my trip to Yellowstone National Park and it did perfect for size and travel and securing my camera. I never felt like I was worried about losing any of my stuff.but the shoulder strap isn’t the best but I’d recommend this product still.",
      "rating": 4.0,
      "verified": true,
      "author": "Caleb Clegg",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "D750 with 28-300mm lens attached",
      "text": "Got it for my new camera, it fits a Nikon D750 with 28-300mm lens attached with the hood reversed. Great for times one is only bringing the one lens and camera. Has small pockets, maybe batteries and memory cards, not much else.",
      "rating": 5.0,
      "verified": true,
      "author": "Keving81",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "AWESOME. It protects my camera but also makes it ...",
      "text": "AWESOME. It protects my camera but also makes it easily accessible. If I had to change anything, I'd make the pockets a little larger. I'd love to be able to fit my iphone 6 and mini credit card wallet to double as a purse so I can lighten the load for traveling. Outside of that, this is the perfect case so you don't have to take your camera apart everytime. I also saw in the reviews that this doesn't come with a padded strap - mine did come with one. I ordered it earlier this month (October 2017) so it might be an updated strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Plane Ambition",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Perfect!",
      "text": "Exactly what I was looking for. Portable, quick grab bag that holds my camera with the EF-S 18-135mm lense plus extra batteries and SD cards. Happy happy!",
      "rating": 5.0,
      "verified": true,
      "author": "WY Mom",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Camera bag only",
      "text": "I don’t really have a bag is big enough to have everything that I have a nail in it. So I saw this online and I thought I would try it. You can put your camera in the bag with a small wins which I think is perfect. It’s very durable and it protects your camera which is a must with his high price cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbbe",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Excellent quality and value",
      "text": "Very well made. My Panasonic DMC-FZ1000 fits comfortably with the bayonet lens shield reversed and there is just enough room for the charger and a filter My only complaint is that it’s a bit unstable on the small base",
      "rating": 4.0,
      "verified": true,
      "author": "R. D. HoagTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Poor quality",
      "text": "I really liked the product once I saw it, however the stitching unraveled on the shoulder strap the first day I used it. I already ironed on a couple decorative patches so I couldn't return it. Other than the poor quality, and uncomfortable neck strap, I liked the product.",
      "rating": 2.0,
      "verified": true,
      "author": "MLR",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "This is a great camera bag",
      "text": "This is a great camera bag. The reinforced hard bottom was a big factor in my picking this bag. I did end up returning it but only because it was much larger than I anticipated. I was looking for something just big enough for my Nikon D3300 so I wasn't always lugging the massive camera bag around. This wasn't that much smaller then my big bag. If I ever get a larger sized camera I will buy this bag again.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "It's cheap...but broke fast",
      "text": "when I bought this camera, I was impressed at first glance at how thick the bag was considering the price of it. However, although I barely used my camera bag, and have had it for less than a year, the strap's plastic hook has already snapped off and I can no longer use the strap. I'm kinda disappointed especially considering how littles it's been used, at how soon it broke. But if you're looking for a cheap, and ugly bag for only one lens and a body, then this is it. I'm kinda irked at how I have to handhold it everywhere now though.",
      "rating": 3.0,
      "verified": true,
      "author": "Shouwen Z.",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Cheap, so I shouldn't have expected more than what I got",
      "text": "I probably should have not expected so much, but I figured for $20 I couldn't go too far wrong. The only problem is that I'm not using it because it doesn't quite fit as much in it as I had hoped. The shoulder strap doesn't curve/bend all that well to sit well on the shoulder. It's about what you should expect for $20.",
      "rating": 3.0,
      "verified": true,
      "author": "ZZiglar",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Needs A Belt Loop",
      "text": "Overall this is a great case at a great price, but it would be a FANTASTIC case if it had but one additional feature, and that would be a simple verticle loop on the back side so that the case could be worn on the hip by slipping one's belt through the loop. Frankly, I am amazed the designers forgot it. Amazon, if you take my suggestion, how about sending me a freebee.",
      "rating": 4.0,
      "verified": true,
      "author": "Readerbot",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Nicely padded but top heavy and uncomfortable",
      "text": "This bag seems durable and protects your camera and supplies well. My only issues are that it just feels awkward while wearing it and I find when I set it down it wants to fall over since the bottom is small. The plastic base is nice but it feels like putting down an upside down pyramid and expecting it to stay put. I ordered a sling bag to feel more comfortable while wearing it, but this will do as a nice bag to keep the camera protected while I’m not actively using it, especially for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Jocelyn M. Seaman",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Too small for Canon DSLRs",
      "text": "The bag seems fine, but it's too small to fit my dslr. So, if you have a Canon 5D (either the mk 2 or the mk 4, I tried with both), the camera is too wide for the zipper to properly close. Unfortunate, because otherwise this would be a great minimalist carry case.",
      "rating": 3.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Mixed Feelings",
      "text": "I have mixed feelings on this case. It's fine for what it is, but no room for an extra lens or battery charger. So it's not real versatile. It's still too big to then put inside a backpack. Just doesn't fit my needs, but doesn't mean it's bad in any way.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason A. Stackhouse",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Lots of room for a camera and a lense",
      "text": "We have a Panasonic lumix G85 in there and fits pretty well. There is a lot of room in there, maybe to much room, to hold it. It does have room to add maybe another lenses but nothing to really keep it from knocking into each other.",
      "rating": 5.0,
      "verified": true,
      "author": "The Huerta",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Good Compact Size",
      "text": "This came free with my Canon Rebel SL1 camera and I like it. It is a little on the small side but it fits my camera with kit lens, 55mm-250mm zoom lens, macro lens attacent, and tulip lens hood in the main compartment (snuggly). Also has three smaller compartments for batteries, SD cards, etc. The strap adjusts enough that you can carry it across your body like a messenger bag, which I like.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison RM",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Didn't fit my needs but it can fit yours!",
      "text": "<<As a disclaimer I returned this product>> Though it didn't fit my needs it may fit yours! The reason why I didn't like it was because it was a bit bulky for me to put it in my backpack. If you are thinking of storing your camera in your backpack you'd may want to look elsewhere. It did fit My Nikon D3300 well but had a lot of room for play if I remember correctly. Plenty of storage for filters and cards",
      "rating": 3.0,
      "verified": true,
      "author": "The Lapland Dragon",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "First Bag for my First DSLR",
      "text": "Very happy with this case, I was debating between this and the Lowepro Toploader zoom 50 and this. Given, that I was planning to take it day hiking, I really liked the fact that the Lowepro had a built in rail cover! However, I ultimately decided to go with this option as I have had nothing but great experiences with AmazonBasic products in the past and the price was very good at $14. The thing about AmazonBasic's is that you get what is advertised! This is a great first case for my first DSLR, I would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "David Knowlton",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Good Value Camera Case",
      "text": "The D5600 with the 55mm lens attached fits perfectly and straps inside support the camera nicely to eliminate stress on the lens which is pointed down. Nice compartments for small accessories such as memory and batteries, wireless remote etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas P. Henry",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "Great travel bag for the bare basics.",
      "text": "These case has done very well from hiking in the mountains to theme parks and traveling in Europe. Holds my Canon Rebel and bare basics perfectly without being to bulky while walking.",
      "rating": 5.0,
      "verified": true,
      "author": "J Hunter",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "great bang for you buck",
      "text": "great product for its price, it's unbeatable. snug fit for D750 with lens and hood on. but you're still able to put an extra battery in pocket. i had been looking for something like this so i don't have to carry the whole bulky camera nikon bag.",
      "rating": 5.0,
      "verified": true,
      "author": "beeveejay",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great value.",
      "text": "I am very pleased with the quality and design of this case. It easily holds my Nikon D series with 18-140 lens. It has enough storage for the accessories I travel with but is compact enough to fit in the bag I stow underneath the seat when flying.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur G. Gamble",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "it is probably perfect for you",
      "text": "Was much bigger than I expected. I received this in addition to my Canon SL1 and thought it would be really close to the size of my actual camera. It was not. It's definitely is a two hand sized case. It does seem simple and has the right pockets for a small amount of accessories. You could fit a couple SD cards, extra batteries and maybe a charger. If you're looking for a case to carry just the essentials and not be too bulky, it is probably perfect for you. I have a full size 12\" case that carries extra lenses etc. and was really hoping for a smaller case, it just wasn't as small as I wanted.",
      "rating": 3.0,
      "verified": true,
      "author": "A Stan",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "This is a great case for my Nikon D-SLR",
      "text": "This is a great case for my Nikon D-SLR. It holds the camera and my 18-300 mm lens (with Canon 500D) very comfortably and safely. I love the hard nosecone especially because it will cushion shock. I have had several cases over the year, and this is the best one I have found. Would buy again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie315",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Secure Case",
      "text": "I like the case, and it has plenty of room for SD cards, but not much more. I like it because you can sling it over your shoulder and walk on. I give this case 5 Stars, because it does what it is supposed to do. Thumbs up for sure!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Manley",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Minimalist and discreet.",
      "text": "I wanted something to cary my camera to volleyball games and other short events without the all bulk of extra lenses and supplies. This case fits a Nikon D750 and attached Nikkor 24-120mm lens with hood perfectly. It has a couple pockets for an extra battery, memory cars, and lens wipes as well. Just enough for a short event. It is well constructed and subtle enough not to attract attention to you high $$$ equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "B&D",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Works as advertised",
      "text": "Pretty good for the price. It's a little oddly shaped, but I like the adjustable inner supports. It seems to have a lot of pockets, but they are all very small and flush to the bag, so you can only store flat things in them. For instance, the charging device for my camera absolutely does not fit in any pockets. Definitely more of a storage/transit bag and not intended for in-and-out use. Overall, ok buy.",
      "rating": 3.0,
      "verified": true,
      "author": "steel_muffinsTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Compact Case",
      "text": "I use this compact case for my Canon T5 and a few select accessories if needed. You can't really fit anything bulky in the case with the camera but if you want protection for your camera and won't be hauling a bunch of equipment you can rely on this case. If you or your lady has a big purse this can likely fit in it.",
      "rating": 4.0,
      "verified": true,
      "author": "Marco Esquandolas",
      "helpful_votes": 0,
      "publication_date": 20170507
    }
  ],
  "product_meta": {
    "title": "AmazonBasics Non-Contact Infrared Thermometer with Laser Pointer",
    "description": "AmazonBasics SLR Holster Camera Case (Black) An Amazon Brand.",
    "rating": 4.5,
    "feature_bullets": [
      "Compatible with most SLRs with a zoom lens attached (up to 110mm)",
      "External Dimensions: 6.9\" x 6.3\" x 9.0\" (LxWxH)",
      "Internal Dimensions: 6.5\" x 5.9\" x 7.5\" (LxWxH)",
      "Three compartments for accessories, with 2 dedicated slots for SD memory cards",
      "Water-proof EVA base protects your camera and helps it stand"
    ],
    "specifications": {
      "Product Dimensions": "7.8 x 7.25 x 9.75 inches",
      "Item Weight": "14.1 ounces",
      "ASIN": "B008MWBY6W",
      "Item model number": "RFQ468",
      "Customer Reviews": "4.5 out of 5 stars8,204 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#117 in Camera Cases",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 31, 2012",
      "Manufacturer": "AmazonBasics"
    },
    "categories": [
      "Electronics",
      "Camera & Photo",
      "Camera Cases",
      "Bags & Cases"
    ],
    "price": 16.99
  }
}