{
  "website_summaries": [
    {
      "verdict": "An efficient wand with a few known flaws.",
      "pros": [
        "Creates tight ringlets and natural-looking waves"
      ],
      "cons": [
        "Protective glove is flimsy and has been known to melt",
        "No heat gauge",
        "no automatic shutoff"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "A must have!!! Buy it NOW!!!",
      "text": "My hair NEVER holds a curl...no matter the wand or product within hours it falls flat. This wand is hands down the the BEST!!! Not only is it super easy to use, the curls stay even with very little product in your hair. The first time I used it, the curls stayed all day, I slept on them and they still were in the next morning. I'm in love with how easy it is and how great the curls look. I also tried this on my daughter's super stringy, fine hair....it works and stays all day😍 We have never found anything that keeps her hair curled the entire school day. Buy this wand now, you won't be sorry!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MTrampe",
      "helpful_votes": 18,
      "publication_date": 20180914
    },
    {
      "title": "No longer turns on",
      "text": "I have only had this wand for 2 1/2 months. Probably used it about 20 times. This morning i went to use it and it wont turn on. I tried many different outlets in the house and nothing. Very dissapointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20180214
    },
    {
      "title": "The BEST curling wand on the market!",
      "text": "I have tried countless wands and curling irons, curling irons are an ancient tool at this point, compared to how smooth this wand is! I have tried EVERY brand, and most wanda are more tapered than this one, which I hate-cus the tapered ones weren’t making full curls. The size of this one is perfect. I do not suggest getting any wand over an inch (The 1 and 1/2 inch ones don’t hold curls as well. This thing is great! my only complaint is that the heat isn’t adjustable. But this made curling hair easy, and I normally suck at it! This one is the best. Don’t waste your money on L’ANGE, Conair or Hot tools! The search is over!",
      "rating": 5.0,
      "verified": true,
      "author": "macmamma25",
      "helpful_votes": 3,
      "publication_date": 20200429
    },
    {
      "title": "Easy to Use, Great results",
      "text": "I have been reluctant to purchase a wand after being told by my stylist that they are difficult to use on your own hair. This one was easy to use and gave me the waves I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Marie",
      "helpful_votes": 9,
      "publication_date": 20180213
    },
    {
      "title": "Curls that last all day!",
      "text": "This curling wand gets HOT and it gets hot FAST. I've definitely burned myself a time or two. I curl my hair before standing out in the hot sun for hours on end every gameday. And my curls last the whole time— even with the heat and sweat! Pro tip: to make curls last all day, use mousse before drying your hair, and make sure to use hairspray. Sometimes I leave the hairspray out so my curls are less crunchy. Even when they loosen up, they still look effortless and beautiful. This wand is great and for such a great price too. BUY THE 1 INCH PINK WAND!!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 3,
      "publication_date": 20190701
    },
    {
      "title": "Highly, highly recommend from someone whose hair can't hold a curl!",
      "text": "My hair doesn't curl...ever. But when I can get it to resemble something looking like a curl, it lasts may just an hour or so. I had purchased this and I have to say - My curls lasted the entire day and through to the next night. Very impressed. Adding to that, it was FAST! I have very long hair and for loose waves, it takes less than 15 mins from start to finish. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda F.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Doesn't work for my long hair",
      "text": "Does not curl my long hair. Only puts a single crimped bend in the center. I've been doing hair for 40 years but this thing is a mystery. I've watched videos, I've wrapped my hair around it 2 different ways, nothing worked. It only makes that weird bend right in the middle of the section. Awful.",
      "rating": 2.0,
      "verified": true,
      "author": "isaidso",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Not given what was shown",
      "text": "Says it comes with heat protective glove...mine didn’t come with a glove or even directions on how to use it...literally was just the tool in the packaging...slightly disappointing since it was shown with the glove and everything was just expecting more...",
      "rating": 2.0,
      "verified": true,
      "author": "Lifesaver",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Great curling wand.",
      "text": "Great curling wand. Heat up fast, fast shopping and a great price. The little glove that comes with the wand is useless and probably more dangerous using it than not using it. Otherwise, great tool for great beach waves.",
      "rating": 5.0,
      "verified": true,
      "author": "Davia",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great wand curler!!!",
      "text": "Got these to wand curl my wigs! Worked like a charm and",
      "rating": 5.0,
      "verified": true,
      "author": "Marde Walker",
      "helpful_votes": 2,
      "publication_date": 20200206
    },
    {
      "title": "Nice but no Temp Control",
      "text": "I like this. It works well and the curls last even after being slept on overnight. I looked at so many of these curling wand before I bought this one and I think I overlooked that this one did not have the automatic shut off, which I kind of wish it had. My one concern is that it doesn't have a way to control the temperature and it gets really, really hot. I'll have to be careful that I don't burn my hair off when using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Dawn Kardokus",
      "helpful_votes": 4,
      "publication_date": 20160407
    },
    {
      "title": "Curls that last!",
      "text": "I have very straight hair, this gives me curls, waves or whatever I want, and THE CURLS LAST (sometimes for days). Love this item. The heat resistant glove is very important. Just need to let it warm up for a few minutes, not a speedy heat up time.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "LOVE ❤️ IT!",
      "text": "If your looking for a smaller ringlet or curl, have fine or straight hair—You will love this curler. I’ve used this brand for over 9 years any only just had to replace mine (I typically use it 5-7 days a week). If you have a hard time curling your hair—this is the way to go!",
      "rating": 5.0,
      "verified": true,
      "author": "rosealee",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Exactly what I was looking for!!!!",
      "text": "This is just what I was looking for when I was looking to purchase a wand! It's so easy to use and my hair looks great every time!! Highly recommended, and the price was just right.",
      "rating": 5.0,
      "verified": true,
      "author": "Kara H.",
      "helpful_votes": 5,
      "publication_date": 20170525
    },
    {
      "title": "Love, Love, Love!",
      "text": "This is a lower price curling wand so I wasnt sure what I would think..I absolutely love it. It definitely took a little bit to get the hang of but once I did..I love it. My curls stay for at least a few days...Even after sleeping on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Maybe I got a faulty one but this sucks",
      "text": "I like the glove it comes with but hate everything else. It linked my hair and didn’t give me a smooth look at all. Had one of my girlfriends(who does hair) try it on me and she had the same thing happen.",
      "rating": 1.0,
      "verified": true,
      "author": "Mia Mathie",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Perfect curls...",
      "text": "The product works well and gets hot quickly. As for the glove, don't bother. The reason for the glove is so that you don't burn hands or fingers by accidentally touching the wand, however, if the glove touches the hot wand, material from the glove transfers onto the wand and ends up in your hair. Plus, it causes a smell every time you turn the wand on .",
      "rating": 3.0,
      "verified": true,
      "author": "Theresa M.",
      "helpful_votes": 2,
      "publication_date": 20161214
    },
    {
      "title": "Love it!",
      "text": "Got this yesterday and used it before bed! Get super hot fast, and only takes a few seconds to make nice curls! Works great on my short hair! And you can't beat the price! Only thing I would change is to be able to adjust the temp, I probably don't need all the way at 400 for my hair type.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Dutton",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Gets to the perfect hot temperature and you only have to hold hair ...",
      "text": "This curling wand works SO AMAZINGLY WELL!! Gets to the perfect hot temperature and you only have to hold hair wrapped around the barrel for a few seconds and the curls hold. I never use any hair spray. perfect bouncy curly (or wavy, depends on how you want to style it) hair every time. I get so many compliments! However I don't really car for this hot glove. its kinda hard and scratchy. reminds me of a brillo pad haha. I use my other hot glove from a different curling wand I bought that broke since it's a lot softer and more comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20140808
    },
    {
      "title": "Good curling wand for beginner",
      "text": "This is the first curling wand I've ever used and it didn't take long for me to get the hang of it. I like that it came with a protective glove since I still have a hard time knowing what my hands are doing sometimes!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Hard for shorter hair",
      "text": "It works for curling hair but it is hard to use on shorter hair. It still works but it’s hard to get the right angle. Takes a long time to curl the whole head.",
      "rating": 4.0,
      "verified": true,
      "author": "Online shopper",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Very impressed!",
      "text": "Threw out my old curling iron and this was my first time using a wand. Super easy to use, love the wavy curls it gives me. Took like 5 minutes to do my hair! Very impressed!",
      "rating": 5.0,
      "verified": true,
      "author": "Effie Carter",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Good Product, But Produces Beach Waves NOT SPIRAL CURLS",
      "text": "The wand seemed to be of good quality...heated up fast, stayed hot, easy to use. However, it did not produce the spiral curls the description and product photos led me to believe I could get. It made beach-type waves instead, which I was not wanting. So, if that's what you're looking for...I'd recommend this wand.",
      "rating": 3.0,
      "verified": true,
      "author": "Joel D Bailey",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "I love this curling wand",
      "text": "I love this curling wand, it gives me bouncy soft waves or lovely tight curls depending on the style I'm going for. It's really easy to use, but also really easy to burn yourself if you don't keep the rubber tip on the end of the wand (I've lost count of how many times I've burned by scalp, hand and neck because I forgot to put the tip back on). If you're not clumsy and wear the heat resistant glove, you'll be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Lalamablee",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Tight curls",
      "text": "I love the curls with this. They are tighter, and look great after you brush your hair out. My only problem is my hair keeps getting wrapped around the piece that props the iron up. Takes some getting used to.",
      "rating": 4.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Am I glad I did",
      "text": "I have always had a hard time getting my hair to curl but not anymore. I read the reviews for this and thought I would try it. Am I glad I did!!!!!!! Wow the curls I got where amazing, I kid you not!!!! The curling iron is very easy to use if you are already using a regular curling iron. I read a lot of comments on the glove being cheap and allowed the hand to get burned. I did not have that problem. I have not burned myself once. I think if you are just careful and pay attention to what you are doing you should be fine. I highly recommend this!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy M",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "I am happy with the item, happy it came with glove",
      "text": "I am happy with the item. I am relieved it also came with a glove. It is getting use to also. For the cost of the item, Its nice for the first time user.",
      "rating": 5.0,
      "verified": true,
      "author": "Jana J Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Great wand, gets very hot",
      "text": "Gets very hot. Curls holds. Once you get the hang of it it’s wasier than a clamp wand. Be prepared to burn yourself a few times while getting the hang of it. This makes tighter curls, but they look great once relaxed.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Barns",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Good product Good price",
      "text": "I am a hairdresser an bought this just for the price was wanting to use for my daughter I have found I use it as much as her. Very nice product for the price",
      "rating": 5.0,
      "verified": true,
      "author": "Chassity holthouser",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Very easy to use. Happy with this. Bed Head is a great product.",
      "text": "Easy to use, perfect curls. Just watch the amount of time you leave your hair wrapped around it. My hair was thicker and each strand set very quickly. I purchased one for more money at a chain drug store, didn't work very well at all and returned it immediately. Read the reviews and purchased this one with some doubt as to if it would work. But I am very happy and recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "dianap196",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Great curls!",
      "text": "My daughter loves it! Gives your hair great girls! All diff types of style curls you can do with this! Def recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany Christopher ",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Perfect curls.",
      "text": "This curling iron makes the prettiest curls. We’ve used it on thin, thick curly and straight hair. So far it’s been beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "Tia stagg",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Difficult to Use",
      "text": "Very difficult to use. I burned my hand and haven't used it since. There are better options out there.",
      "rating": 3.0,
      "verified": true,
      "author": "Deb440",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Thank you",
      "text": "I'm in love with this my hair has never held a curl until now",
      "rating": 5.0,
      "verified": true,
      "author": "Nicki Brown",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "I love it. The fact that it is tapered allows ...",
      "text": "I have been using this wand for over a year so i figured it was time to give a review. I love it. The fact that it is tapered allows you to control the size of your curls to a degree, and while I don't use the glove anymore, it was helpful in protecting my hand when I was first learning how to use the wand. The only downside is that there is no temperature control, and my hair doesn't need a lot of heat, and this thing gets pretty hot. Not to the point where i'm worried about burning my hair, but still hot. It's a great buy for the price and I definitely recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Works Great!",
      "text": "Great for longer hair, and if you want really loose curls.",
      "rating": 5.0,
      "verified": true,
      "author": "Selena Anderson",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good buy",
      "text": "Great value! It works great on my long, straight hair.",
      "rating": 5.0,
      "verified": true,
      "author": "A Andersen",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Great deal & long lasting waves!",
      "text": "I'm so impressed with the waves and curls this makes for such a great price. I used it for a photoshoot for my company and was so happy with how my hair looked. Usually my waves or curls go straight within a few hours but they don't with this wand!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Very good started want- the glove, not so much.",
      "text": "This wand is great for the beginner. Very simple to use on/off switch and creates wonderful curls. Only issue I had with this set is the glove. Although it does protect your hand, it makes you hair extremely frizzy. The material it's made of is very cheap and adds frizz to each strand you separate. I ended up ditching the glove and using my hand very carefully. Go gloveless or buy a better glove!",
      "rating": 4.0,
      "verified": true,
      "author": "mgrimsley",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "I love how it gives curls that last in my hair ...",
      "text": "This curling wand works as expected. It does not have a temperature control, which is expected for the price you pay. I love how it gives curls that last in my hair for 2 days with minimal touch up. My hair is shoulder length and this gives beautiful curls.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "This is the perfect tool to create a wavy look",
      "text": "This is the perfect tool to create a wavy look. I would recommend to use the glove during the first weeks, until you get used to it. You can get loose waves for a relax look. I am happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Easy to use",
      "text": "I like the ease of use, wish it had more temperature settings than on and off",
      "rating": 4.0,
      "verified": true,
      "author": "CNLR",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Best curling wand ever!",
      "text": "Best curling wand ever! I have very thick, heavy, straight hair that doesn't like to be curled. But this wand does an incredible job of making beautiful, lasting waves. I can even go really curly, and they stay in, too.",
      "rating": 5.0,
      "verified": true,
      "author": "SlagathorTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Perfect curls!",
      "text": "First curling wand I’ve ever owned. I’m so glad I upgraded from an old clamp iron to a wand. This works fantastic and gives you the most beautiful wavy curls! Mine last well into the second day, and probably the 3rd if I didn’t wash my hair. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Great wand, short cord",
      "text": "This wand is awesome! Great quality for the price! I do wish there was a feature to control the temperature & the cord is REALLY short. Other than that - a great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Love this wand",
      "text": "Love this wand! Sucker gets hot! I thought I would always have to have straight hair because curling irons never did a thing for mine except curl it for 5-10 min. This WORKS & the curl actually hold for the next day even!! Super happy & impressed w it.",
      "rating": 5.0,
      "verified": true,
      "author": "KelliSK2",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "Good heat for quick curling",
      "text": "Heats evenly and quickly. You cannot control the heat but I don’t feel the need to change it. Pretty easy to use especially if you use the glove to avoid burning finger tips.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "I simply love it, work really well",
      "text": "I simply love it, work really well, is pretty and the curls that I get last days. The bad side is that you can’t control how hot it gets but it worms up really fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Iara Forte",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Curling iron is great",
      "text": "I love the curling iron, but the glove isn't that heat resistant.",
      "rating": 3.0,
      "verified": true,
      "author": "gmlrusso",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Great curls... heats quickly!!",
      "text": "Was skeptical at first because my hair never holds curl but this is awesome! Heat glove is genius!",
      "rating": 5.0,
      "verified": true,
      "author": "sara longley",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Best Styling Tool Ever!!",
      "text": "The best curling wand on the market! I despise curling my hair but this wand makes it so easy! My hair usually has a hard time holding a curl, but with this wand it holds all day with very little product. It takes a little getting used to (if you are a curling iron person) but by my third time I was a pro! It is seriously user friendly!",
      "rating": 5.0,
      "verified": true,
      "author": "Hank Wisrodt",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Simple and works",
      "text": "Works out great with hair spray. Loose curls with one switch. Great starter iron and haven’t had any issues with it yet!",
      "rating": 5.0,
      "verified": true,
      "author": "SherbearCat",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Good",
      "text": "I am still getting used to this since I never curl my hair but it's a great product so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Creates perfect uniformCurls",
      "text": "Great styling wand at a great price point. Creates perfect uniform Curls",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Fantastic!",
      "text": "I've had a hard to curling my hair for years, either the curls looked bad or they did not last long. Ive used curling irons in the past, but I wanted to try a wand. This is the first one I tried and the last! I love this curling wand! My curls last all day and even into the next day! It's affordable and works great! Definitely worth my money.",
      "rating": 5.0,
      "verified": true,
      "author": "NCH",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "NO GLOVE INCLUDED",
      "text": "I love the truly salon-style curls you get from this wand, BUT was very disappointed to see that I did not receive the glove which is to come with it.",
      "rating": 4.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great curler",
      "text": "Took this on my honeymoon to Greece. Worked perfectly with just a plug converter (the watts or whatever are already compliant with the plus there, so a cheaper little prong converter is all you'd need).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Woman",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Satisfied!",
      "text": "I just received my wand today and tested it on a piece of hair and I'm satisfied thus far! There's only an on and off switch so it's hard to gauge how hot it is but I have thick hair so I usually prefer higher temperatures. It didn't take long to heat up at all either!",
      "rating": 5.0,
      "verified": true,
      "author": "Mia",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Perfect and holds curl for multiple days",
      "text": "I use this almost daily. It gives me perfect curls. It takes a little bit of practice so I would try it out a few times before using it for a night out. My hair doesn't hold curl very well but it stays curly for multiple days without product when using this curling wand. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Chernysh",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "Love it!",
      "text": "Love this! Had my hair done in 15 minutes! Curls hold up too only 1 heat setting so if that's a big deal maybe not for you but works perfect for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Erica",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Excellent Curling wand",
      "text": "I love this wand. I've used a lot of different ones and this one is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn M. Bowie",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Love my curls",
      "text": "This product is great for accomplishing beach curls. I always get a lot of compliments when I use it",
      "rating": 5.0,
      "verified": true,
      "author": "Julia H.",
      "helpful_votes": 3,
      "publication_date": 20171116
    },
    {
      "title": "I love this tool!",
      "text": "This is my first styling wand, but I must say I am super impressed with this tool! It heats up very quickly! The temperature is perfect. I have used it on my bone straight hair as well as my daughter's thick wavy hair and loved the results with both! The glove that comes with it is perfect to protect your hand from the heat of the wand.",
      "rating": 5.0,
      "verified": true,
      "author": "basketkat",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Love it!",
      "text": "This product is great. I loved that it came with the heat protectant glove! The only thing, was the packaging. It was hard to open.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie Beauston",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Noice",
      "text": "Love it. It's effective in giving a lovely curl in a short amount of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith G",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great tool, great price, glad I decided on getting the tool that came with the thermal glove.",
      "text": "Great product, great price. If you are looking at others thinking you don't need the thermal glove, think again.. That glove is absolutely necessary. The tool is perfect, gets the job done and does it beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "Happygirlterri",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Curls like a champ!",
      "text": "I LOVE THIS! The Tyme iron wouldn’t even curl my hair and this does. It’s truly amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael Budnick",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "5 stars",
      "text": "This curling wand is amazing and super easy to use. I was worried the curl wouldn't hold because my hair doesn't curl well with a standard curling iron or flat iron but this wand actually worked! My curls look great and I just wish I would have known about this wand before!",
      "rating": 5.0,
      "verified": true,
      "author": "Kase C",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "This is amazing - I recently cut 8\" off and now have ...",
      "text": "This is amazing - I recently cut 8\" off and now have shoulder length hair and love the Tossled look this gives me. I can't believe I've lived this long without trying a wand!!",
      "rating": 5.0,
      "verified": true,
      "author": "anonymous1",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "👍🏼👍🏼",
      "text": "Super easy to use and you get perfect curls or beachy waves.",
      "rating": 5.0,
      "verified": true,
      "author": "FL Mama ",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "shoulder length or longer",
      "text": "heats up fast, continuous high heat. Need to be very careful of face and neck to avoid burns. This is not a good iron for people who are inexperience doing their hair, or working in the mirror. With a little practice can create so really cool styles - shoulder length or longer hair is best with this iron.",
      "rating": 4.0,
      "verified": true,
      "author": "Mama M.",
      "helpful_votes": 0,
      "publication_date": 20140802
    },
    {
      "title": "The only wand I’ve ever used that works!",
      "text": "I have tried many, many different curlers, wands and products to get a curl in my fine, stick straight hair. This is the only one that has ever created a curl that didn’t drop after 20mins. I’m so glad I purchased, it’s so great to finally find something that works!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly H",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "Amazing worth every penny I love this curling wand",
      "text": "Amazing worth every penny I love this curling wand!!!!! My hair is very thick & difficult, not to mention very long and heavy this had my curls lasting all day and when I woke up I still had nice waves in my hair like I had slept in braids...I don't think I will find anything better!!♡",
      "rating": 5.0,
      "verified": true,
      "author": "Bre",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "Great wand!",
      "text": "Great wand. Easy to use. Love the burn free glove!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Scott",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Curling iron does what it states",
      "text": "Curling iron produces the waves I wanted in my hair which the other ones did not do. It took a short learning curve to do my hair but the results I got was worth spending time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Favorite curling iron I own",
      "text": "Favorite curling iron I own! Very easy to get beachy waves with this curling iron. I found the glove to be uncomfortable so I take my chances without it and just try to be careful. Love the size of this and it does create a perfect curl!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Curls don’t last",
      "text": "It’s a good wand but the curls don’t last a whole day!",
      "rating": 3.0,
      "verified": true,
      "author": "Erika Santos",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Five Stars",
      "text": "Heats up very quickly and extremely hot. Curls last all day.",
      "rating": 5.0,
      "verified": true,
      "author": "GLC.",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "No temperature controls",
      "text": "no temperature gauge, just on and off. otherwise love it",
      "rating": 4.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Not worth the money",
      "text": "Horrible iron stop working after a month. Waste of money very disappointed!!",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Hermonstyne",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "This product is great. The curls look very natural and the curler ...",
      "text": "This product is great. The curls look very natural and the curler is easy to use! I sadly lost my glove but it worked great when I did have it! I now use clean socks over my hand or a thin pair of gloves for winter time.",
      "rating": 5.0,
      "verified": true,
      "author": "NZ",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Gorgeous curls",
      "text": "I love this curling iron. It does take some getting used to, not having a clamp. But the glove does work, as long as you don't touch the iron outright. The curls this iron makes are gorgeous.",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Very very happy with this",
      "text": "Very very happy with this. Used it in Argentina, were electricity is 220v and no problem at all. In fact, my 17-year-old niece kept it there for herself. Will buy another for me. Totally recommend this for travelling women!",
      "rating": 5.0,
      "verified": true,
      "author": "maria v. garcia valdez",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "Awesome!",
      "text": "Makes amazing curls! The design is amazing and creates beautiful curls in no time. Only takes me 15 minutes to do a full head of curls! Heats up quickly. The only drawback is that it only has one temperature, so there is no way to turn it down.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison Mayer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "I'm in love !",
      "text": "It takes a little getting used to but I managed to get beautiful sleek curls with this wonderful curling wand ! I've used it on my hair & also on my weave & it worked perfectly. I do wish the glove was a little bit thicker though because you can still end up burning your hand, but it's a great product. I definitely recommend it !",
      "rating": 5.0,
      "verified": true,
      "author": "Erial Wilson",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Four Stars",
      "text": "Wand works great but the glove is too sheer and your finger tips get burnt still.",
      "rating": 4.0,
      "verified": true,
      "author": "Summer Cahoon",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Good cheap curling iron",
      "text": "Love this! Wasn't too expensive and I use it most days to touch up my curls. Gets really hot, I wish there were actually HEAT settings but it doesn't bother me too much. Also, I never use the glove but that's just me.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "curls curls curls",
      "text": "one of the best curling wands ever you will not be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "Ulysses Rivera",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Love this, I actually like it more than my ...",
      "text": "Love this, I actually like it more than my friend's $160 wand because I prefer the cool tip. Only preference would be the ability to adjust the heat, but it works fantastically, especially for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Marisa Brown",
      "helpful_votes": 0,
      "publication_date": 20151013
    },
    {
      "title": "I really like the way my hair looks when I first use ...",
      "text": "I really like the way my hair looks when I first use this, but I wish it got a little hotter. It does create cool beachy waves, but after several hours I lose a lot of the curl. Still looks good, just not the style I'm going for.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Love it! Works great!",
      "text": "Works great looks great and price is great! Will be ordering other curlers from this brand now. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Excellent wand",
      "text": "Love this wand. It gets really hot! My curls seem to hold for a long time",
      "rating": 5.0,
      "verified": true,
      "author": "sje375",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Great price for a great product",
      "text": "Love this wand! It gives the most perfect curls! I had always used a clip barrel and only my ends would curl but this wand curls the entire strand and stays put even on my thick straight hair.",
      "rating": 5.0,
      "verified": true,
      "author": "R Khan",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Was not disappointed",
      "text": "Better than I expected it to be. Works great with long hair and the curls are beautiful. It's easy to use and I've gotten lots of compliments on my curls since its purchase. I dont really have any cons about the product. Lets just say I was not disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniela J",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Holds the curl!",
      "text": "My hair never holds a curl, but the curls stay and look beautiful!",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "So easy to use!",
      "text": "Gives you the best natural looking waves/curls you could want! Never going back to my old curling iron! Heats up so fast and does not take long at all to use! Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah G",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Good",
      "text": "My first time ever curling my own hair. Was pretty easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber Pearson",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Works great! Made smaller curls than I expected",
      "text": "Works great! Made smaller curls than I expected, but it's because of the size that I ordered, not a default in product.",
      "rating": 5.0,
      "verified": true,
      "author": "ben",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Four Stars",
      "text": "Perfect for travel, however I wish I had chosen a slightly larger barrel.",
      "rating": 4.0,
      "verified": true,
      "author": "jacqueline m trim",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Great",
      "text": "I love this hair iron. It is definitely worth it. Nice curl and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hp",
      "helpful_votes": 0,
      "publication_date": 20190801
    }
  ],
  "product_meta": {
    "title": "Bed Head Curlipops Tapered Curling Wand for Bouncy Natural Curls, 1 Inch (Pack of 1)",
    "description": "NO KINKS ALLOWED, JUST CURLS AND WAVES. This curling wand is all you need to create bouncy curls that last all day, even if your day keeps going all night long. The tapered barrel can be used to create volume up top and tight curls on bottom. High Heat up to 400° F quickly locks in the curl with a clamp-free wrap-and-go design that leaves no creases behind and a natural-looking finish. Tourmaline Ceramic helps to reduce frizz and lock in shine for amazing body. The Bed Head 1\" Tapered Tourmaline Ceramic Styling Iron also comes with a Bonus Heat-protective Glove and a Tangle-Free Swivel Cord that make it easy to style with. HOW TO GET THE LOOK: Take a 1\" section of hair and wrap it around the barrel, with the iron facing downward. Alternate curling each section left then right for a tousled, natural look.",
    "rating": 4.6,
    "feature_bullets": [
      "Tourmaline, Ceramic Technology on Barrel for Reduced Frizz and Massive Shine",
      "1 inches Tapered Barrel for Bouncy Curls. Rapid recovery and cool tip",
      "High Heat of Up to 400 degree Fahrenheit (because we know you like it hot!) & Dual Voltage",
      "BONUS Heat Protective Glove for Worry Free Styling",
      "Tangle Free 6 feet Swivel Cord"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.5 x 2.5 x 5.75 inches; 12 Ounces",
      "Item model number": "BH318C",
      "UPC": "887410839181 741655979241 885177316273 887109838150 881425062565 885124880697 883381022171 630623013189 885503715794 880147588186",
      "Manufacturer": "Bed Head",
      "ASIN": "B008S6INZC",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Styling Tools & Appliances",
      "Hair Care",
      "Beauty & Personal Care",
      "Irons"
    ],
    "price": 23.94
  }
}