{
  "website_summaries": [
    {
      "verdict": "An affordable and adjustable chock that is both solid and easy to bolt down (the recommended installation method).",
      "pros": [
        "This adjustable chock fits most motorcycle wheels",
        "Constructed from heavy-duty formed steel, with a durable powder-coated finish",
        "Easy to install",
        "Holds securely",
        "Heavy, solid construction"
      ],
      "cons": [
        "Works best bolted down to a trailer or other surface",
        "hard to load or unload a bike on it if it is not bolted down",
        "Some reports of this option arriving damaged or used"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A unique design with the limited application of holding the rear wheel of a motorcycle.",
      "pros": [
        "Good, stable design to hold a variety of different motorcycle types",
        "Uses a locking gate to keep the wheel in place while in use",
        "Mounting holes will allow you to fasten the chock down to a trailer or deck"
      ],
      "cons": [
        "Limited use given motorcycle-specific design"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Worked Great on HD 2004 Road King Custom",
      "text": "Worked great on my HD 2004 Road King Custom loaded in a utility trailer. I did adjust the pivot arm to it's lowest setting. Recommend that you power into the chock SLOWLY and watch for clearance around the brake discs and fender. It did hold the bike upright while I was securing it with 4 point ratcheting tie-downs. The chock came with 4 M10 (approximately 7/16\") carriage bolts, washers, and self-locking nuts. I did add my own 7/16\" galvanized fender washers under the nuts since my trailer bed is pressure treated pine. Traveled 1600+ miles round-trip from Atlanta to Key West with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike H",
      "helpful_votes": 38,
      "publication_date": 20170116
    },
    {
      "title": "Worked with my 04 bagger",
      "text": "Installed the maxhaul 70075 on my trailer this weekend, loaded my 2004 ultra without a problem. I did adjust the pivot arm to it lowest setting to be safe. Cleared my fender, no problems. I always strap my front axial, crash bars, and off the crash bars around my bags when transporting. You should not use this wheel chock alone to transport your bike. Giving it four stars because I haven't put it thru its paces yet, have a few trips planned in the next few weeks so we shall see. Update: two long road trips later the chock works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "BeanTown Frank",
      "helpful_votes": 33,
      "publication_date": 20160522
    },
    {
      "title": "Did its job well...",
      "text": "Worked great for my 700lb Yamaha FJR sport touring bike. Bolted it to the wooden deck of my 5'x8' trailer and hauled it at 80mph on a 350mi interstate trip with no problems. Three tie downs on bike and it was very stable for the trip even over rough construction sections.",
      "rating": 5.0,
      "verified": true,
      "author": "Abraham",
      "helpful_votes": 56,
      "publication_date": 20150612
    },
    {
      "title": "Great chock, solid, heavy, good value",
      "text": "I purchased this chock to move a Daytona 600 in an enclosed trailer 6x10 trailer. I put 2 E tracks on the floor and attached E track pieces that hold 2x4. Then I attached pieces of wood to the E track clips and the chock. Used straps on the front and the rear. I drove 85 miles without an issue. The chock is heavy and solid. Great for the mid 30 dollar range. Will unscrew and place in the garage to hold the bike there. Good value shipped fast. The chock comes with 4 long screw with 4 thick rubber washers and 4 nuts. Would recommend. I paid for this product it was not free.",
      "rating": 5.0,
      "verified": true,
      "author": "Priscila P.",
      "helpful_votes": 10,
      "publication_date": 20170605
    },
    {
      "title": "Holds my Harley Softail Perfectly, easy to install.",
      "text": "Great Chock, I have it installed in my enclosed trailer holding my Harley Softail Deluxe along side my wife's Harley 500 Street. And It holds it perfectly. Its well made, looks great and very easy to install. Note: I read a lot of people complaining that it doesn't hold their bikes when transporting, in addition to a chock, all bikes should always be strapped down along with a chock when transporting.",
      "rating": 5.0,
      "verified": true,
      "author": "GaryH",
      "helpful_votes": 13,
      "publication_date": 20160919
    },
    {
      "title": "Good choice.",
      "text": "I purchased this chock to mount in a 5' X 8' ramp gate trailer to transport a Kawasai Coucours 14 (700+ lbs). The manufacturer states that a bike should not be ridden into the chock, i.e., it should be manually pushed into the device. This makes sense because it is not robust enough enough to withstand repeated impacts, even at low speeds, from a motorcycle. However, in my situation it was mounted so that the forward hoop directly bears against a heavy frame member of the trailer so I have no hesitation about slowly and carefully riding the bike up the trailer ramp and directly into the chock.",
      "rating": 5.0,
      "verified": true,
      "author": "Dav Mar",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Solid",
      "text": "I was worried that this chock might not fit the front wheel of my Sportster 48 which has an extra fat front tire. No problem at all, and no worries about hitting the forks. I cranked this part down on to the wood slats on my trailer and then only two good straps are needed to secure the motorcycle. Be sure to check your straps out on the road because they can stretch their tension out somewhat, just be aware in your rear view mirror that the bike is staying straight and not listing to either side. This wheel chock is solid and heavy duty, professional grade part.",
      "rating": 5.0,
      "verified": true,
      "author": "Scotty",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Very east to install, easy to use.",
      "text": "It arrived, came with all the nuts and bolts needed to install. I grabbed a drill, got the right sized bit, had it installed on the trailer in about 30 minutes. I moved it away from the garage door, hooked the trailer up and let the ramp/gate down. Rode the bike right up on the trailer, rolled it into the chock and presto... easy. Got off the bike and she stayed upright, easy to tie down by one person. Perfect, exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer since 2004",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Poor Qualtiy",
      "text": "Had 2 chocks for 6 months and the cradle lock on both units are bending and deformed. Find another brand and style as other brands with same cradle design will doo the same thing. Emailed Maxxhaul with pictures if issue and reply was someone will respond in 1-2 business days. Now day 2 and no response. Must be busy with other Customers with same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave Underwood",
      "helpful_votes": 4,
      "publication_date": 20181031
    },
    {
      "title": "installed in a trailer",
      "text": "We purchased 2 of these to transport our bikes in an enclosed trailer. They were relatively easy to install and work well for us. One thing we did have a little issue with was that the fender on bikes did get stuck, but once adjusted (this item, not the fender), they have been working quite well. We used these quite a bit over the last riding season for long distance travel without any issue. We always have the bikes firmly strapped in also. I would not use just the chocks and neither should you. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Broke it in today",
      "text": "Mounted this on my trailer yesterday, today had to haul 2 bikes from 2 different cities, to my shop for storage. works very well, although I would never try and let the bikes stand on their own without being tied down for any length of time. The only thing I personally would have liked is for the directions to tell you the difference it makes when you make adjustments to one of the three positions. Nothing explained what the different positions changed, fortunately I had an old tire around and I was able to experiment with it. The wheel chock itself works great.",
      "rating": 5.0,
      "verified": true,
      "author": "TjS",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Did Not Fit my Harley Ultra Classic",
      "text": "Looks very well made, very sturdy, at a great price. Unfortunately the flip-up cradle is too tall and interferes with the fender of my 2013 Harley Ultra Classic, so I had to return it. My fender skirt at the back of my front fender is only 7\" above the ground. The flip-up cradle is 9\" above the ground in the UP position, even when set to the lowest bolt position. That small bit of information would have helped me avoid the purchase of this item. Amazon was good about the return, so I am giving 4 stars. Would have been 5, but deducting 1 star because of the lack of that information in the description.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Mills",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Made our trip worry free",
      "text": "I ordered two of these for a motorcycle trip we were going on. We were hauling the bikes several hundred miles. We weren't sure what to expect but when they arrived we were pleasantly surprised. It was heavy duty, sturdy and worked like a dream. We were able to chock the wheels on the bikes and tie them down and they never even moved an inch. Install wasn't difficult, Took about an hour once optimal placement was determined. Best part is they can be removed so the trailer can still function normally when not in bike mode. We left the two we ordered with my dad and plan to order one more for us.",
      "rating": 5.0,
      "verified": true,
      "author": "puzzled91",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Straps are your friend",
      "text": "The chock lock that rolls up behind the tire, doesn’t come up quite high enough on the tire. If you don’t have the front of your bike strapped in tight, you run the risk of the bike backing out. One way to mitigate this, potentially, is to use a rubber tie-down strap to help keep it secured in the up position. Generally, chocks are beneficial in keeping the bike upright, freeing you to strap it down without fear of it falling over. You can’t use too many straps, and make them as tight as possible!",
      "rating": 3.0,
      "verified": true,
      "author": "Scottland Roddy",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Does Not Fit 2016 HD Street Glide",
      "text": "If you have stock front end, this will not fit and will not support the bike without the kickstand up. I believe the folks writing reviews work for the company that sells the product to boost sales. I now have to get the fender repaired as well as the saddlebags and mirror repaired.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Not good for Harley Davidson touring Motorcycles",
      "text": "Purchased to hold my 2012 Street glide and It barely clears the front fender. I’m sure going down the road the fender is hitting against it. If I had not adjusted the mount im sure it would be much worse, but because I adjusted the mount it doesn’t hold the motorcycle as tight as it should. It’s a nice wheel choke it just does not work well with Harley touring bikes.",
      "rating": 2.0,
      "verified": true,
      "author": "NJ",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Excellent Wheel Chocks for Can-Am Spyder",
      "text": "These chocks work great for securing my 2008 Can-Am Spyder to my 7x12 utility trailer. The wheels just barely clear the chock's side tubing so I added a 5/4\" deck board to the top of the base that raises the wheel up enough that it gives them ample clearance. I then attach 2 ratchet straps after rolling into the chocks and I am ready to go (after attaching 2 more ratchet straps to the rear wheel). These photos are of the installation in progress. I will add some more photos later of the finished install.",
      "rating": 5.0,
      "verified": true,
      "author": "dhdallas",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "sturdy with a lot of appilcations",
      "text": "This item is very well constructed and easy to install in a multitude of configurations. Harbor freight has a similar product. I like the fit and finish on this one a little better. This one comes with nylon bushings/spacers where as the HF was metal. That said, if you have Prime and can wait a day or two, I would order this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Trickhorn",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "High quality chock stabilizes your bike on a trailer",
      "text": "I bought a motorcycle several states away, so I bought a landscape trailer and this motorcycle chock, and used it to trailer the motorcycle home. This chock is set up so that if you put the motorcycle in the chock and compress the fork with straps, that alone will pretty much stabilize the bike, but it is worth tying down the back wheel so that it doesn't 'hop' when you go over bumps. I kept this on my trailer, which I will be using to take stuff to the transfer station, etc, but I will always have the capability to trailer my bike when I need to. As far as quality goes, this is very high quality, not cheaply made.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Amazing wheel chock for the price.",
      "text": "I'm actually very surprised at the quality of this for the price. It's extremely solid, holds the wheel perfectly (3-position adjustable rocker). Even without bolting it down, the weight of the bike and the width of the stand will hold the bike up. Bolting it down to your trailer or whatever will obviously add stability. But if you just need to ride into the trailer and get off and have something to hold it until you strap it down, this will do that nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean H.",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "I would highly recommend this Chalk",
      "text": "I brought my 1999 Honda CBR 600 down from Sioux Falls, SD to Denver Colorado with this in the back of my 6' tacoma bed. I didn't even have to bolt it down into the bed... However I had a rubber padding on my bed so that might have also helped. I strapped it down with Canyon ties for the handle bars, and Motorcycle tie in the back and another in the front. Did not have any problems getting it down here, and the chalk helped prevent my motorcycle from smashing into the back of my truck. I would highly recommend this Chalk.",
      "rating": 5.0,
      "verified": true,
      "author": "FANTOM x JAGGER",
      "helpful_votes": 2,
      "publication_date": 20161020
    },
    {
      "title": "Strong and Sturdy",
      "text": "Mounted the motorcycle wheel chock to the floor of my utility trailer to haul a 2018 Honda Rebel CMX300 weighing under 400 pounds. The bottom setting for the wheel cradle is a perfect fit for the factory front wheel. Throw in the necessary ratchet-style tie downs to secure the bike in pace and I'm good to go. So far, I've hauled the bike about 225 miles in this configuration with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale T. Pierce",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Good product....Great price....quality product",
      "text": "Great value on this good product....I bought 3....highly recommend this product! Works as easy as pie....my 500lb sport touring with 120/70-17 front tire fits great in the middle adjustment holes. Holds bike upright and very secure. I drilled a safety pin hole to make it extra secure....Why didnt i buy these years ago?",
      "rating": 5.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Secure, solid, good price",
      "text": "Super secure, mostly easy to install on your trailer and it's a great price, great value. Bought two for our two motorcycles and really appreciate that they hold your front wheels off the ground in a sling. Drove over 1000 miles on rough roads: construction etc.. Held up great!",
      "rating": 5.0,
      "verified": true,
      "author": "Diadem",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Will not fit a 2006 HD Road Glide",
      "text": "The back portion I had to take off because it hit my fender on a 2006 road glide. I will have to strap it down and just put the front wheel in the front portion. If you have a road glide, it would be better to buy the universal. I already have it mounted so I am not taking it out.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Vornberger",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "garbage or defective!!",
      "text": "bought brand new and it folded immediately after put bike in. now have 2 damaged bikes and cant get refund!!! Hope amazon steps it up to refund me or ill have to step it up.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen Johnston",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Fantastic chock! Was extremely simple to install",
      "text": "Fantastic chock! Was extremely simple to install. Had it mounted in my trailer in about 20 minutes. Never even looked at the instructions. Removed the top portion, lined up the base where I wanted it, used a 3/8\" drill bit, finished up the install and put the top portion back on. Love how the top portion is easily removed, making trailer fully available. Holds my 2017 Triumph Bonneville T100 very securely so I can then strap it down. One darn good value on a very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Madcow",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "chocks",
      "text": "Great for the money, very sturdy. Have two and moved them between two different toy haulers and they've worked fantastically so far. Modifying to hopefully give people some answers about tire szie. Used with: Yamaha V-Star 650 100/90-19 tire 19 inch wheel (f I remember correctly, whatever is stock) - fit was beautiful. Victory Judge 130/90 tire 16x3.5 wheel - looks like a tight fit, but not overloaded by any means. 1998 (?) Harley Springer.... not sure, since everything is custom. Assuming 21 inch wheels, no idea what the tire is. Still fits. This one hugs quite close, so I wouldn't leave it in for extended periods of time (like multiple months) to protect the tire.",
      "rating": 5.0,
      "verified": true,
      "author": "Princess",
      "helpful_votes": 2,
      "publication_date": 20130906
    },
    {
      "title": "It worked but I'm not sure how long it will stand up to use",
      "text": "Mounted it in an enclosed trailer to haul my motorcycles. So far I have done one 10 hour trip and it stood up to the job. The only problem is the built quality isn't really that great and without the bike being strapped down the metal flexes a great deal. I wouldn't never use this as a stand alone unit without straps.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay Newb",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Solid well built  and operational",
      "text": "I have not traveled with the wheel chock installed yet but I really like the way it installed in my trailer. Very easy to install in less than 30 minutes with the supplied hardware. Had to install with unit in lowest setting to clear my rotors but worked out fine. Can't beat the price and you can't build it for the price you can buy it for.",
      "rating": 5.0,
      "verified": true,
      "author": "jim ray",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great motorcycle chock",
      "text": "I used this for my trailer which had a wooden deck. I took a trip from Virginia to California. It held out the whole trip and then some with no issues. One of the best purchases I have made. Attaching it was easy, just marked the hole, drilled them and bolted it in. Nothing complicated about it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Solid Chock for the Money",
      "text": "Excellent chock for the money. Easy to install. Key to stability is adjusting the flip-up lock in the correct position. When installing on wooden trailer bed, you may want to go with a larger fender washer, as the ones provided tended to sink into the wood when torqued. A solid unit, well-designed and sturdy. Held the bike firmly at highway speeds with ratcheting straps on the forks and simple stays in the back.",
      "rating": 5.0,
      "verified": true,
      "author": "b2",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Solid and easy.",
      "text": "Just hold my dad's Honda gold wing from Pennsylvania to New York and this worked perfect to help stabilize it. Four cargo straps and this wheel chock on a 5x8' trailer and loading [bike not running] and travelling was great. Very stable.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "A little wide for dirt bike tires",
      "text": "A these are very sturdy wheel chocks. I am using them for dirt bikesand they function bet would be better is ther were a tad narrower. I would have no reservations using them on my Kawasaki Concours 1400. It would be nice if they had a quick disconnect feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Geeltee",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "DONT BUY THIS.",
      "text": "Total POS. First time i used it, the flip up piece to the rear of the wheel bends and in turn bends in my fender and take the paint right off. Now i have to have it straightened out and repainted. Zero structural integrity.",
      "rating": 1.0,
      "verified": true,
      "author": "Zak",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Installation instructions aren't great, not sure if I placed the rubber washers ...",
      "text": "Installation instructions aren't great, not sure if I placed the rubber washers where they are supposed to be. Doesn't really hold the tire tightly. Received two stars because it is useful to have the tire against something when securing the motorcycle, but that's about all it's good for.",
      "rating": 2.0,
      "verified": true,
      "author": "Cam",
      "helpful_votes": 0,
      "publication_date": 20180727
    },
    {
      "title": "Good!",
      "text": "Made a few mods to the width of the bars at center and at top to clear the brake rotors and moved the tipper forward to force the wheel into the rack. mounted on a lift. Also cut off the top of the tilt so it would not hit the tire fender. worked perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Solid and look great",
      "text": "I spent two days cutting and bending a piece of pipe to bolt to my trailer so I could haul my dirtbike around. Then I found these online and felt like an idiot for wasting my time. These chocks are easy to install and hold your bike in place really well. A steal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Don't hesitate to buy.",
      "text": "I bought this for my 14 Ultra Classic. I bolted it to the floor of a self enclosed trailer that had 3/4 flooring. I had no problem loading it but unloading can be tricky. Maybe I just haven't done it enough to have a procedure. It held the bike great on a short trip. I also had it strapped down to floor brackets. The only thing I did because the bolts were long enough was to cut an additional template for under the trailer floor to add to the rigidity. Additionally, I drilled in my garage floor and used red heads to hold it in place.",
      "rating": 5.0,
      "verified": true,
      "author": "KENNETH J ROBERTS",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "These are nicer than the ones you get at Harbor Freight, though they are identical in design.Includes mounting hardware.",
      "text": "These are nicer than the ones you get at Harbor Freight, though they are identical in design. The paint finish is better and it comes with the needed hardware and spacers needed to mount to just about anything. The included bolts are long enough to mount to(or through) a 2 X 6 deck board. A must for anyone looking for chocks for their motorcycles and/or scooters.",
      "rating": 5.0,
      "verified": true,
      "author": "jrjohn77",
      "helpful_votes": 2,
      "publication_date": 20160417
    },
    {
      "title": "Great product!",
      "text": "Easy to install and even easier to use. I have an 800# Gold Wing Aspencade and I'm able to load it and tie it down without any assistance at all. The wheel chock actually holds the bike upright so I can put the handlebar straps on without having someone else there to steady the bike. This wheel chock will work on any trailer, enclosed or open. I also like the ability to remove the chock as I use my enclosed trailer as a work shop when on the road. The black mounting plate stays on the floor, and the yellow rack comes off with 4 bolts. I'd recommend this to anyone with a large road bike.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Ross",
      "helpful_votes": 0,
      "publication_date": 20140402
    },
    {
      "title": "Will not haul a bike without one again",
      "text": "Great product and it works as advertised with my cruiser. I would recommend the wheel chock to anyone hauling any size bike for easy of use, security and peace of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Works, could certainly hold bike on its own.",
      "text": "Doesn’t hold the bike as sturdy as expected. I kept it to continue use as it’s better than nothing however I would get something else next time around that will hold the bike up itself.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike Belanger",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Sturdy And reliable",
      "text": "no extra installation required on receipt. Works out the box. Sturdy and slip proof on concrete or asphalt. I performed full oil services on my bike with this.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonJunkie",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Awesome!!!!",
      "text": "Just made a cross country trip with this on my trailer. Made a world of difference and helped me feel much more confident that my bike was secure. I was also able to load and strap down the bike by myself because this allows the bike to stay upright. Best purchase I’ve made! Do yourself a favor a buy this!",
      "rating": 5.0,
      "verified": true,
      "author": "plucman",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Worked fine!",
      "text": "Easy to install, but since I installed on a wood bed trailer I put larger washers on the nut side. Hauled my 2003 Yamaha 1100 VStar, No issue's with the Brake rotors if centered correctly. Pulled my 6X10 trailer over some rough rural roads and worked great. Was where I put it from the get go.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Great product for the price.",
      "text": "Does exactly what it should do. Nice and adjustable, have used it with both my bikes so far. Left it out on the trailer for a few weeks after use, noticed the hardware was rusting up pretty quick. Next time I go to use it, I'll probably swing by the hardware and pick up some stainless hardware for remounting.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Arnold",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Good for a dirt bike",
      "text": "Bought 3 of these to install in enclosed trailer for dirt bikes. Great product, easy install and comes with good hardware. Fits a Honda Crf230f, crf450x and a crf125fb.",
      "rating": 5.0,
      "verified": true,
      "author": "brian",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Great design.",
      "text": "I only gave four stars because I thought it would be orange. It is yellow. The \"ad\" picture is a little misleading. But that's on me I guess. Other than that it is really a nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Good value",
      "text": "This works OK. I have a motorcycle with a 21\" front wheel and it just barely works with this unit. It's not very heavily built, but seems like it will be adequate. I removed the base plate and screwed the rack down directly to some tee nuts on my trailer and that made it pretty solid while still being easy to remove.",
      "rating": 4.0,
      "verified": true,
      "author": "Wagon Willie",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Excellent product, very inexpensive for what it does.",
      "text": "I purchased this product to use on my trailer. I recently used it to travel from interior Alaska all the way to Georgia. Very good product. Definately serves it's purpose. Extremely easy to use if you have common sense. The instructions were plain but not confusing. Used it in the adjustment it came in and worked perfectly for a 2008 Yamaha R1. Would buy again if I ended up getting a second bike.",
      "rating": 5.0,
      "verified": true,
      "author": "david meneses",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Strong",
      "text": "Used on my motorcycle trailer and it works great. Bike can setup even without someone holding it which makes strapping down the bide for transport a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Sturdy",
      "text": "Great product. I attached it to my 1985 toyota pickup truck and hauled my new Bmw11200r 250 miles through mountain passes and valleys without a care.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Nice solid chock",
      "text": "Very stable and solid chock. Easy to use and install. It does need to be anchored. Can be anchored to the floor or trailer deck. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Johnson",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "A good investment even if you don't use it frequently",
      "text": "Mounted this on a 4x4 sheet of plywood with \"runners\" that engage the longitudinal groves in my pickup truck Pendaflex liner, so I can use it or remove it as needed. Works just as described. It's great to be able to clamp and tie down a cycle by yourself. With the cycle clamped, there's room on both sides for the ramp(s). It helps to have the pickup bed as level as possible, especially for backing out of the clamp.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Menard",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "lasting longer performing better than OEM",
      "text": "My first OEM supplies only lasted a year before turning colour and such...these Id forgot to write a review so its been a while yet there isnt even any distortion of any sort. So Im good with recommending these and these folks as supplier.",
      "rating": 5.0,
      "verified": true,
      "author": "B A Sayer",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Great product for the price!",
      "text": "Bought this used for a hell of a steal. $32 used. It’s not the best chick in the world, bike Has a little wiggle room ( but will not fall over ) while inside of it. Does everything I wanted and expected it to for he price. Hold the bike upright so I can get it strapped into the bed of my truck It will work much better is bolted down, but works fine unbolted as well",
      "rating": 5.0,
      "verified": true,
      "author": "nick",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "This unit works great on my Honda VT1100C2",
      "text": "This unit works great on my Honda VT1100C2. No interference issues at all. And it really does grab and hold the front tire nicely. So much so that it takes two to pull the bike out! I used the middle position of the adjustment for size (this is the way it was shipped). It's possible that one of the other positions would make it easier to remove the bike. In any case, this is a sturdy bargain device if you need to trailer a motorcycle.",
      "rating": 5.0,
      "verified": true,
      "author": "J. P.",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Fit my Drifter 1500 front tire perfectly!",
      "text": "Had 3 rail motorcycle trailer but front channel would not hold the wider Drifter 1500 front tire. Bolted the chock on and tire fit perfect, wheel locking roll on bar worked perfect even with the Indian style front fender. Traveled from South Florida to the Colorado Rockies with no problems. Great Wheel Chock.",
      "rating": 5.0,
      "verified": true,
      "author": "Groovy",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Bang for the buck",
      "text": "I looked and looked for a lock and load type wheel chock for our trailer. The Maxxhaul 70075 preformed like a 200.00 wheel chock.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Burch",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Wheel check, HD approved.",
      "text": "Very good price for a good product mounted to a 4x8 sheet of plywood to move inside moving truck from TX to MI, added some tie-down and all was good! Did remove lower flap on Ultra Classic to keep from hitting but, all was good.",
      "rating": 5.0,
      "verified": true,
      "author": "matkln 31",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Very simple and effective.",
      "text": "It worked perfectly the first time. I secured mine to a piece of 3/4” plywood and then tap con it to the floor.",
      "rating": 4.0,
      "verified": true,
      "author": "LDS",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Solid construction",
      "text": "Installed fairly easily in my trailer. Hardest part was drilling the mounting holes and securing them underneath. Holds my HD bagger securely. With a couple tie downs, I don't worry about the bike moving whatsoever.",
      "rating": 5.0,
      "verified": true,
      "author": "Hal",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "very nice - easy to use",
      "text": "Hauled my bike from A to B w/o any issues - move bike in, secure it and off you go.... very easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "W. T.",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Nice idea but when I put my motorcycle in the ...",
      "text": "Nice idea but when I put my motorcycle in the chock the frame was rubbing on the brake rotor. Couldn't use it, didn't want to take a chance of damaging rotor",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Hackett",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Fit my 2002 Goldwing",
      "text": "At almost 900 pounds this wheel chock is almost not strong enough for a bike this weight. It works, but twists a little while strapping the bike in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Hanson",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Quality product. Proven itself over thousands of miles.",
      "text": "Works great. I was tasked with hauling two 70 year old Harleys in an enclosed trailer. The trailer was rated for a much heavier load, and had a tendency to bounce on the suspension quite a bit. Additional strapping is of course a part of the success of the transport. However, I am super pleased with the performance of these chocks. They hold the bike up alone for you to secure the bike with only one person. You can't go wrong with these, and they are a great price in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "N80",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "If you have a cover over your front wheel this will not workwo",
      "text": "I dislike this item because it is small height wise for my trike due to the cover on my front wheel it hits the cover will knock the cover off if I use it",
      "rating": 1.0,
      "verified": true,
      "author": "Mar Skinner",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "works",
      "text": "great product and design. love the carriage bolts. Easy to tighten product from under trailer. Holds bike great with just few straps. I use in conjunction with Risk Racing mount which eliminates straps all together. I ride a TW200 and holds front wheel good. Put the bike in N and pulling bike back off the chock is not difficult.",
      "rating": 5.0,
      "verified": true,
      "author": "Kassy",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Top notch",
      "text": "These wheelchocks are some of the best I’ve had. I highly recommend these to anyone who has to haul motorcycles. I have had a much more expensive competitors wheelchock and I would recommend these over them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great for the price",
      "text": "The product was easy to assemble and install. Great for the price. I have a heavier bike and it isn't as sturdy as I would like. Works great for what I was looking for.",
      "rating": 4.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Works like a champ",
      "text": "Combined it with some ratchet straps and took my fz07 from Kentucky to Florida with no problem",
      "rating": 5.0,
      "verified": true,
      "author": "Customer 117",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Does the job",
      "text": "Bolted this Baby down in a rented trailer for a cross country move. Zero bike movement. Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Thisguybuysthings",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Not as expected",
      "text": "Hinge system for the part that rotates about 120 degrees, has a locking hinge with no bearing???. Thin sheet metal, doesn't hold my 2001 sv650s on its own, no matter the adjustment holes I used.",
      "rating": 1.0,
      "verified": true,
      "author": "Marco pelayo",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Solid",
      "text": "very impressed, it was quite easy to use and Very stable for the bike, have No worries about sloppy ride on trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Rohr",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Great service and product. Several attempts to buy this but nobody else would deliver.",
      "text": "Great product. After several attempts to purchase this product from others, this was the only company that would deliver to our region. thanks so much. I most definitely will purchase from this company again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob R.",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Good Quality -- Bolt it to the Floor!",
      "text": "Performs as advertised, but it absolutely needs to be bolted to the floor. Don't let the pictures of this unit appearing to free-stand on a driveway fool you. If you attempt to roll your bike into the chalk without it being bolted down, it will slide away. And if you do somehow get your bike into it, when you try to back it out, the unit will roll up with your wheel and possibly damage your fender if you don't hold it down. It's a good chock, just be sure to bolt it to the floor.",
      "rating": 4.0,
      "verified": true,
      "author": "Doug C.",
      "helpful_votes": 0,
      "publication_date": 20140927
    },
    {
      "title": "Mounted this to my 12' flat bed trailer.",
      "text": "Mounted this to my 12' flat bed trailer with wood deck. Works with my 2000 Kawasaki Vulcan 1500 Classic.",
      "rating": 5.0,
      "verified": true,
      "author": "Stark",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "Skinny tires won't stand up on its own.",
      "text": "Decent chock, nice for the price. I've got a time with a 19\" front and it won't stand up on its own. Does make it easier to put on the straps just a lil sketchy. I reckon if ya got a fat front tire it'll work better but....I'll spend more money later on one that'll holds mine up for the garage floor. This is alright for the trailer.",
      "rating": 3.0,
      "verified": true,
      "author": "Bikertrash ftw",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Very good for price",
      "text": "Good for price I make it work. Does it’s job well. Used for a Coleman 200 bike.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Worked as expected",
      "text": "Hauled a motorcycle from MN to AZ using this wheel chock in the back of a full size pick up. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Karla Green",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "box was dented no big deal product was fine easy install had to drill holes in it to ...",
      "text": "bought used , box was dented no big deal product was fine easy install had to drill holes in it to hook a strap over the tire for extra measure and safety hauled the trike all the way from mn to az worked great trip back we opened the door and noticed the strap had slipped off the wheel but the bike stayed put the whole way . It was a 2013 goldwing trike . I would recomend this wheel chock to anybody . Over all its a good product and is built good.",
      "rating": 5.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20150411
    },
    {
      "title": "Used for trailering our new Road King",
      "text": "Regrettfully had to tow our new Road King home from dealer due to the distance and weather last winter. But this wheel chock was wonderful. Very strong and no worries about docking the bike (lashed her down with straps, of course). An excellent purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Indy dreamer",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Worth the $$$",
      "text": "Great wheel chocks..installed 2 of them on my drop tail trailer hauling to harleys..worked like a jem..would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Why pay more for others?",
      "text": "Super easy to install and seems well made. Plenty of bang for your buck",
      "rating": 5.0,
      "verified": true,
      "author": "demo 717",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Very sturdy.",
      "text": "This holds my 2020 cvo just fine. Roll in tie down and go.",
      "rating": 5.0,
      "verified": true,
      "author": "A D J",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Awesome",
      "text": "Great Chock. 97 Heritage with stock wheels. Didn’t have to adjust it at all, moving from NY to aZ and half way through and I’m impressed. Bike hasn’t moved at all. Easy for one person loading too. Mounting was easy, came with everything you will need. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "It's just OK - but assembly was terrible.",
      "text": "I would have rated this a 3 or maybe 4 considering the price - kind of cheaply made, but the price is cheap too. I rated it a 2 because the assembly was horrible. Some of the bolts were obviously cross threaded and ruined. Several of the bolts were not even tightened - not even close. Packaging was not sufficient, the boxes were ripped open and other hardware was missing. Not worth the bother to return it. I will just replace the hardware myself.",
      "rating": 2.0,
      "verified": true,
      "author": "Matty",
      "helpful_votes": 2,
      "publication_date": 20140316
    },
    {
      "title": "Works fine, but don't trust it without some additional tie downs.",
      "text": "Holds the bike, but won't keep it from falling over. If you are using this on a trailer, it works well to keep the bike from moving forward or backward, but on my bike it doesn't keep it upright very well (I have a Triumph Bonneville). It will hold it long enough for me to get the straps on, but I wouldn't use it for maintenance or even a short trip on the trailer without strapping it down. For the money, I am satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Johnson",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "Solid however very wide.",
      "text": "The wheel chock is solid, the package it came in was damaged and ripped up. Luckly the bolts seem to have stayed inside the amazon box. My Yamaha V-star 100 tire fits but is loose. From what i have seen, other styles hold the tire on the front and back more than on the bottom like this one holding the bike upright where mine allows my bike to lean.",
      "rating": 3.0,
      "verified": true,
      "author": "dale syverson",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Bike rolls on easily",
      "text": "Used it for my v strom 650. Worked like a charm..",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Clark",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Miss leading information",
      "text": "Product came yellow when I wanted orange as it was pictured to be sold.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Gillispie",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "Fits good for my sportster 883",
      "text": "Fits good for my sportster 883. I wouldnt park my bike with no kick stand down into it though. Bolts are sturdy. I did go to the hardware storr for larger washers as the smaller ones pushed into the wood too much ane bent. Great overall though.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Worked well, fit my larger cruiser.",
      "text": "Purchased this to move my Yamaha V-Star 950 from Alaska to Colorado. Worked perfectly secured to my trailer. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Smith",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Excellent heavy-duty front wheel mount",
      "text": "Great heavy-duty wheel chock. Mounting to my trailer was straight forward. Fit my Ducati Diavel front wheel perfectly in the default position. Highly recommend this if you are in need of a long distance haul with your motorcycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Color",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Heavy duty",
      "text": "Made for fat tires such as a cruiser. Could probably fit two dirt bike tires in it. Very beefy and nicely constructed. Used some short lag bolts and mounted mine to a sheet of thick plywood. There mounting system requires you to go through the bottom of your trailer deck which isn't always possible.",
      "rating": 4.0,
      "verified": true,
      "author": "JimMortgage",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Nice product",
      "text": "Great mount, very sturdy when bolted down tightly. Only thing i didnt like was the curved edges on the side. Makes it hard to mount to a trailer with an uneven surface for a floor. But overall good product, felt comfortable and safe transporting my Harley.",
      "rating": 4.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Best bang for the buck",
      "text": "I hauled a GSXR 1000 GSXR 600 with these mounts side by side on a small trailer. I straped them to the trailer but I am not 100% sure I needed to. The locking mechanism on these chalks are fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "John O",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Solid bracket, works on 06  zx10r",
      "text": "Works rather well, bolted it into a enclosed trailer for my 06 zx10r and took it 6 hours out. Held well felt a little weak due to the trailers age but Its just needed it to brace the bike upright so it works perfect. Strapped the front and rear after squishing the shocks some and I don't think it even moved on the ride.",
      "rating": 4.0,
      "verified": true,
      "author": "Zx10",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Recieved damaged, used product.",
      "text": "Received used product. Tire marks on inside, chipped paint, chipped metal, multiple deep scratches down to metal, obvious other wear points, poor crftmanship & welds overall. I will be returning this product immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Nwijoe",
      "helpful_votes": 3,
      "publication_date": 20160304
    }
  ],
  "product_meta": {
    "title": "MaxxHaul 70075 Motorcycle Wheel Chock",
    "description": "This Maxxtow wheel chock automatically locks the front wheel into place when rolled into chock. Safely secures motorcycle wheel for transport or storage. Mounts securely to truck bed, trailer or floor. Enables one person to easily load and strap down motorcycle. Fits most standard motorcycles. Material Type: Tubular Steel and Steel Plate. Sturdy one piece upper frame design for stability.",
    "rating": 4.6,
    "feature_bullets": [
      "3-position adjustable holes on wheel base to accomodate various motorcycle wheels",
      "Includes hardware and mounts securely to floor, truck or trailer",
      "Locks your tire as you roll it into your wheel chock; Easy for one person to strap-down a motorcycle",
      "Heavy duty steel construction; Durable powder coat finish to resist rust and corrosion",
      "Overall Dimensions: 24\" L x 9-3/4\" W x 12-7/8\" H; Base Dimensions: 15-5/8\" L x 10-5/8\" W"
    ],
    "specifications": {
      "Manufacturer": "MaxxHaul",
      "Brand": "MAXXHAUL",
      "Model": "70075",
      "Item Weight": "14 pounds",
      "Product Dimensions": "21 x 13 x 11 inches",
      "Item model number": "70075",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "70075",
      "Folding": "No",
      "Cover Included": "70075",
      "ASIN": "B008CE0O8E",
      "Customer Reviews": "4.6 out of 5 stars863 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#3,565 in Automotive",
      "Date First Available": "June 18, 2012"
    },
    "categories": [
      "Wheel Immobilizers & Chocks",
      "Automotive Parts & Accessories",
      "Tools & Equipment",
      "Garage & Shop",
      "Automotive"
    ],
    "price": 33.12
  }
}