{
  "website_summaries": [
    {
      "verdict": "The wee Panasonic FlashXpress Toaster Oven is endearingly quirky and almost surprisingly good at what it does. For a midrange price, you’ll get the functionality of a much more expensive model.",
      "pros": [
        "The Panasonic FlashXpress Toaster Oven employs a double infrared heating system that cooks faster than other toaster ovens",
        "The established presets nearly guarantee well-cooked food"
      ],
      "cons": [
        "The Panasonic is on the small side, so don’t expect it to accommodate a 9-inch pizza",
        "Also, the buttons are fiddly, the temperature setting is calibrated for Celsius, and the timer only goes up to 25 minutes"
      ],
      "aspects": {
        "Performance": 9.0,
        "Usability": 8.0,
        "Features": 7.0,
        "Maintenance": 8.0
      },
      "publication_date": 20130910,
      "rating": 8.1,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Terrible Warranty Service By Panasonic",
      "text": "After less than two months, toaster has malfunctioned, due to bad timer -- it takes two full toasting cycles at \"dark\" for medium toast. Panasonic requires that I pay to ship the item back to them for warranty service. Then two weeks (supposedly) to fix. I can understand that sometimes products malfunction, but this is terrible customer service by Panasonic. Consider before buying.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeffrey Ellis",
      "helpful_votes": 434,
      "publication_date": 20170908
    },
    {
      "title": "When I was happy to use this machine to prepare a cake for ...",
      "text": "When I was happy to use this machine to prepare a cake for my family, when I used it for the second time, the glass in the oven burst and it was too dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "Stefan",
      "helpful_votes": 194,
      "publication_date": 20171116
    },
    {
      "title": "A bachelor's dream",
      "text": "It's weird being excited about a toaster oven, but this thing is LEGIT. I went full nerd and read a bunch of reviews on the WireCutter before deciding on this one, and I couldn't be happier. As a bachelor, it's a pain to fire up the oven every time you want to put down a Hot Pocket. I also didn't have a toaster, so this solved both problems. It does have an interesting design. People will comment on it. I can't quite tell if it looks futuristic or like a fossil from the early 70's. But I like it. And it cooks like a champion.",
      "rating": 5.0,
      "verified": true,
      "author": "Ross G.",
      "helpful_votes": 41,
      "publication_date": 20180707
    },
    {
      "title": "Get a liner for the crappy toaster pan.",
      "text": "I love, love the toaster ...except for the crappy toaster pan. I should have listened and covered it with foil. It has rust all over after less than a year. And EVERYTHING, and I mean Everything, sticks to it. Searched in vain for a replacement pan that would fit. Finally found a set of 9-inch silicon round baking mats that ALMOST cover the entire pan. Bought on amazon.Wish they were square but they work as long as nothing goes to the the edges. I thought about buying an oversize SILpat and cutting it down, but apparently that exposes silicom and metal fibers and is dangerous.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 28,
      "publication_date": 20180401
    },
    {
      "title": "Temperature switch stuck in 3 consecutive ovens.",
      "text": "I have owned 3 these ovens, and all did exactly what is advertised (or else I would not have made repeated purchases) However, each one lasted only 14 to 24 months before the switch to set the temperature refused to work. No matter how hard you press/smusch/etc. you only get the middle temp. Eventually you may get it to work once or twice, but then it goes back to middle temperature. All 3 did this same exact thing.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard Dempsey",
      "helpful_votes": 25,
      "publication_date": 20180621
    },
    {
      "title": "Not a good toaster over.",
      "text": "Product quit working after 4 months. Panasonic will fix or replace only if I send it back and pay shipping. They really do not want people to use the warranty. When working, toasting was only so-so. Would have to toast twice to get it brown enough. Baking time only goes to 25 minutes. Can't bake longer than that.",
      "rating": 1.0,
      "verified": true,
      "author": "Carl J Camp",
      "helpful_votes": 35,
      "publication_date": 20171110
    },
    {
      "title": "Heating lights failed after 5 months light use",
      "text": "After just five months of light use, two of the three heating elements failed. Replacing the bulbs is not easy and both cost around $20.00. This oven cooks the food well, but poor durability earns it a 1-star rating. It is a junker.",
      "rating": 1.0,
      "verified": true,
      "author": "Larccc",
      "helpful_votes": 22,
      "publication_date": 20180117
    },
    {
      "title": "Great for 53 Weeks",
      "text": "This was a great machine for 53 weeks. Then the lower bulb burned out and, according to the Q&A's, can't be replaced. That was 300+ days of lovely toast at about 50 cents a day. I'd buy it again if I could replace the bulb every year but this planned obsolescence is insulting.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20200511
    },
    {
      "title": "A mini-nuclear power plant right on your counter top",
      "text": "If course you cannot let it run wide open for 45 minutes, does anyone remembers Chernobyl? Seriously though, we love this little block of superheated plasma that sits on our counter top so much that it gets used 3 to 4 times a day. Doubles as a tanning bed, room heater, and odd alien looking light if its night time. My only gripe is that we cannot figure out how to turn off the beeps, which makes it hard to conceal my midnight rendezvous with toasted poptarts. Otherwise, we really do use this more than any other kitchen appliance aside from the refrigerator and we really do lite up the kitchen at least 3 or 4 times a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim O'Quinn",
      "helpful_votes": 4,
      "publication_date": 20200920
    },
    {
      "title": "Way too small to be useful",
      "text": "The Double Infrared Heating is simply a gimmick. Radiated heat is radiated heat. To cook differently from regular toaster oven, you need the convection mode (aka air fry), which this model lacks. For a basic toaster oven, I have two requirement: 1) big enough for normal frozen pizza; 2) a deep drip pan that catches most of the run-off. This oven fails on both fronts. It gets three stars because it still has adequate power as well as non-stick coating. The whole thing can also fit into the sink for thorough cleaning.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Wang",
      "helpful_votes": 8,
      "publication_date": 20181028
    },
    {
      "title": "Instant heat and perfect toast",
      "text": "The good stuff I read here before purchasing is true. Instant heat, no more waiting and wasting electricity. The heat spread is perfect, best toast ever, seriously. Multiple preset food type buttons, variable heat and time buttons make for a somewhat intimidating control panel. Experience and keeping the instructions close is key and then it becomes a feature not a bug. Way better than the primitive two knob energy wasters . Once it makes sense you have to get used to food being ready faster than 'usual' and no babysitting to keep from stuff from burning. I'd buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dane",
      "helpful_votes": 5,
      "publication_date": 20181212
    },
    {
      "title": "I believe",
      "text": "Amazing results, the reviews are right, the best toaster I have ever owned: quick, simple to adjust, doesn't dry out the bread too much. If I had my drothers I would update the user interface a little - old red LEDs and wipe clean panel are bit dated. I would also have preferred to buy a proper brushed stainless steel finish so it matches other kitchen appliances (this has more of a silver/grey paint finish, especially the control panel), but all forgivable when the toast is just this good. Plus it does a nice job re-heating pizza, preparing frozen bread rolls, naan breads, and hash browns too.",
      "rating": 5.0,
      "verified": true,
      "author": "Bevmo",
      "helpful_votes": 7,
      "publication_date": 20151224
    },
    {
      "title": "Cord is in the weirdest place!",
      "text": "I think I like this toaster oven. I love the size. The cord is in the weirdest place. It's near the front bottom on the right side (facing the toaster front). I almost returned it for this reason because I couldn't put it where I wanted it. I made it work by putting it where I didn't want it but the cord shows. Why would you ever put a cord at the front? My advice is unless you have a great spot for it on the left side of a plug in, don't buy it.",
      "rating": 3.0,
      "verified": true,
      "author": "Lea ",
      "helpful_votes": 2,
      "publication_date": 20200201
    },
    {
      "title": "Better than expected",
      "text": "Ok, I'll be honest -- I chose this unit because of its design and basic features. It replaces a Breviille unit that is much bigger and better built. I needed a sleek unit that would toast bread, English muffins and similar without taking up a lot of room. The Panasonic does this nicely. Other reviewers speak of the less-than-amazing build quality and i would agree with this -- nothing in the unit inspires confidence in doors closing, buttons pushed and so on. But it fits nicely, does what I need and looks good -- and I am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ed H",
      "helpful_votes": 5,
      "publication_date": 20181209
    },
    {
      "title": "BEST TOASTER EVER",
      "text": "This is the best toaster I have owned or used in the last 15 years. I only use it as a toaster. I have bought expensive $240 commercial toasters, vintage toasters from 1950-1960's, cheap $8 toaster (that caught on fire), $30-$40 Walmart toasters. NOTHING compares to this toaster. This Panasonic toaster makes perfect toast EVERY TIME, and you can stop it if toast is getting too dark. Only negative is that it is like looking at the sun while it is on, and you can't turn off the light (part of the toasting element).",
      "rating": 5.0,
      "verified": true,
      "author": "George Scherer",
      "helpful_votes": 2,
      "publication_date": 20190427
    },
    {
      "title": "Will harm your eyes. Scored a D on Fakespot.com! AVOID THIS AWFUL CONTRAPTION.",
      "text": "It hurt my eyes after using it twice, and I didn't stare at it long at all...because it was so damn bright. Same with my girlfriend. Not sure if mine was just extra bright and harmful to your vision—more than the other units out there, but I had to send it back immediately. I'm going to see an eye doctor tomorrow. Hopefully won't have to contact an attorney. Fakespot.com shows that most of these reviews are fake. Read the large number of 1-star reviews for this pile of aluminum garbage if you seek the truth. Shame on Panasonic...and on ConsumerReports.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt H.",
      "helpful_votes": 2,
      "publication_date": 20191225
    },
    {
      "title": "My second toaster over",
      "text": "I ordered the first one about six months ago, a different brand, and found it clumsy, too big, it wasn't what I wanted. I gave it to a friend. Then I saw this one online and loved the size, the flash express, and I love this toaster oven. It is so fast and convenient and cooks some things better than the oven - like fish sticks, things like that. Toast -- perfect. Highly recommend it. The price is reasonable, good value.",
      "rating": 5.0,
      "verified": true,
      "author": "lightshow",
      "helpful_votes": 3,
      "publication_date": 20181106
    },
    {
      "title": "I've had toaster ovens before and they're surprisingly great to have",
      "text": "This thing is magic. I've had toaster ovens before and they're surprisingly great to have, but the way this thing bakes food has me favoring it over my full size oven. It leaves a crispy carmelized crust on everything, without over-cooking the insides. Just re-heating a slice of pizza somehow turns the pizza up a notch, and cookies fresh out of this oven would make Martha Stewart kick a puppy out of jealous rage. I can't believe whatever wizardry makes this thing work hasn't completely supplanted the nasty old resistive elements in normal electric ovens.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Turpin",
      "helpful_votes": 4,
      "publication_date": 20170913
    },
    {
      "title": "Indespensible....",
      "text": "Can't say enough about this toaster oven. I replaced an identical one that has been going strong for over 20 years....and once I get it cleaned up I'll pass it on to one of my kids. It does everything well....toast, frozen pizza, waffles, pancakes, it bakes as well as my oven (only for smaller portions, though), reheats rolls and even leftovers. It also recrisps leftover fried foods and It does all this without watching. Just set and ignore. Most valued appliance in my kitchen. One son missed it when he moved, found it had been discontinued, so he looked in thrift stores until he found one.",
      "rating": 5.0,
      "verified": true,
      "author": "Older but wiser",
      "helpful_votes": 2,
      "publication_date": 20180623
    },
    {
      "title": "Died after 18 months, and Panasonic is useless",
      "text": "This was a great toaster oven while it lasted, with great features, performance and dimensions. But after 18 months, the top heating element failed. Because it was out of warranty, my options were to ship it to McAllen TX at my expense, where Panasonic might then offer me a replacement unit at an unknown cost, or buy something else, or have it repaired on my own (good luck with that). So I am replacing it with another brand. The good news for me is that I got a full refund because the unit was bought with American Express. So if you have a way to extend the warranty, this may be a good option. Otherwise, caveat emptor.",
      "rating": 1.0,
      "verified": true,
      "author": "Joshua Ostroff",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "The best small toaster oven",
      "text": "I waited almost two years because I wanted to see how it would hold up. It is absolutely the best toaster oven I have ever owned. It's perfect for frozen biscuits, Jiffy corn bread, frozen french fries and warming. It even makes great toast. It does have limits because of the size but it more than makes up for it with performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 7,
      "publication_date": 20170224
    },
    {
      "title": "great toaster oven, terrible feet",
      "text": "I bought this less than a year ago, but I have a specific gripe: About six months ago, two of the feet fell off. There are so many parts and pins to the feet that I was unable to reattach. Spent an hour trying to figure out how to order replacement feet but finally did so, but they did not fit. It also took forever for them to arrive (pre-pandemic). So I figured out a band-aid solution for stabilizing when using. But then last week a third leg fell off. At this point, it's too hard to stabilize safely. Very frustrating because the oven itself works very well.",
      "rating": 3.0,
      "verified": true,
      "author": "soccerposeur",
      "helpful_votes": 2,
      "publication_date": 20200823
    },
    {
      "title": "Needs to be simpler.",
      "text": "Just what I need in size. Over cook few items already because strange temperature set: most of the baking done at 375 F but setting 355 than next 399. Plus timer maxed at 25 min. So if you have baking time 50 you have to catch in time to restart the unit. Preset buttons are pointless - didn't use it. Overall it does job with a little get use to",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20171225
    },
    {
      "title": "Infrared Light Danger",
      "text": "Per the operating manual: “Do not stare at the near infrared ray heater for a long time. It could cause injury to your eyes”. They should have disclosed this on the product page so we knew before buying. Between that and the fact that the light in the toaster is extremely bright and difficult for young children to look away from, we are not happy customers. Returning now.",
      "rating": 1.0,
      "verified": true,
      "author": "MTICoach",
      "helpful_votes": 4,
      "publication_date": 20190104
    },
    {
      "title": "Fantastic for a small family",
      "text": "This puppy is the bomb-diggity if you have a young kid or two. My favorite use case is to whack in a couple servings of tater tots and chicken nuggets; the oven size and no need for preheating means that you'll be feeding your kiddo in a minute or two *less* than it actually says on the package (you're not going to get that from a conventional oven). The controls are a bit wonky but nonetheless would absolutely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Phillips",
      "helpful_votes": 2,
      "publication_date": 20181208
    },
    {
      "title": "The old one is still working but looked like a dog after 10 years of use so we ...",
      "text": "This is our second Panasonic Flash Xpress Toaster Oven. The old one is still working but looked like a dog after 10 years of use so we bought a new one for our new house we moved into. This toaster oven will make a slice of toast in 3 minutes or under depending on what type of bread you use. We love this little oven. The only drawback I can think of is that if you use it to bake something that creates splatter or grease it is not easy to get inside to clean it up. We don't use it for anything except bread, muffins etc because it is so much faster than a regular toaster.",
      "rating": 5.0,
      "verified": true,
      "author": "Fishnlady",
      "helpful_votes": 2,
      "publication_date": 20180606
    },
    {
      "title": "Lots of features and controls yet easy to use - Oh and it toasts bread too!",
      "text": "I'm not really a big fan of toaster overs. Most don't seem to toast very well while trying to be an oven. My wife likes them so we switched when our old toaster stopped working. This one does a decent job of toasting and is fairly even. My only gripe is that the dark setting and the medium setting give the same results. I often find myself toasting things like bagels twice to get the desired darkness I like. The rest of the stuff it's supposed to do like defrosting or cooking other small items or reheating things come out better than out of a microwave.",
      "rating": 4.0,
      "verified": true,
      "author": "MMM",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great Compact Modern Toaster Oven!",
      "text": "Love this compact good looking toaster oven! Modern style and takes up less countertop space than the usual wider oven. Comes w/ a tray that I use lined w/ foil to make grilled sandwiches,reheat foods, etc. Fits a smaller DiGiorno thin crust pizza that will knock your socks off! Toasts and bakes...no need to heat up the kitchen baking in a stove... Beeps when the time is almost done and finishes... The only \"con\" is that the oven does not have an auto turn off for the power... Red power light stays on till turned off manually.",
      "rating": 5.0,
      "verified": true,
      "author": "LAArtistDesigner",
      "helpful_votes": 9,
      "publication_date": 20160331
    },
    {
      "title": "Is that the sun shinning in the kitchen?  No, I'm making some toast.",
      "text": "We like the toaster oven. It seems well made and does a very consistent job (which is important... we had to buy a new toaster oven because our last one (B&D) kept burning our food). The odd things to be aware of: It uses high intensity light to heat the oven. My wife refers to it as an easy back oven. The timer only has 30 second increments.. which seems to work fine... but seems odd to me. The power button ... you turn it on when you want to use it, off when you are done... I get scolded for leaving it on. :)",
      "rating": 4.0,
      "verified": true,
      "author": "GT",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Awesome little toaster for toasting",
      "text": "I need my toaster to make toast, not to make souffles, broil steaks, or enable time travel. So this is perfect: Toasts bread in half the time other toasters takes -- two minutes for a slice! Buttons are also intuitive and easy, not too many confusing dials or options. Plus a front-sliding crumb tray AND a light to watch your toast AND it's very compact, almost cute. It has all the features I need and -- just as importantly -- very few few features I don't.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Schwartzberg",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Crispy Even Toast in 2.5 mins!!",
      "text": "Replaced my $200 Cuisinart Convection oven whose cord melted and we were never happy with.Did all the comparisons and read reviews for our family of 4 that uses toaster oven for pizzas, small appetizers, toast & reheats, we decided to take a chance and try this Panasonic. Although it is oddly shaped, it did an amazingly crisp and even color toast right out of the box. Looking forward to more counter space since it is less bulky than the other and cooking up some other items. So far, so good - will post an update in 3 months!",
      "rating": 4.0,
      "verified": true,
      "author": "golfmom",
      "helpful_votes": 2,
      "publication_date": 20181108
    },
    {
      "title": "Perfect for us!",
      "text": "I purchased a more expensive, supposedly better brand and quality toaster oven prior to this one due to concerns about the quality of this toaster oven. The other toaster oven did not cook food well (food was still cold after cooking it the recommended time/temp) and couldn't even toast bread halfway decent. I returned it and debated getting a plain toaster, but decided to give this a try. I'm glad I gave this a try. It's perfect! Toasts quickly and evenly and bakes well too. It's small, so not for a large family, but it's just the right size for me and my hubby. Very happy with this choice.",
      "rating": 5.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Not suitable for US cooking",
      "text": "While it works great as a toaster, the first time I tried to use the oven feature I realized it's geared to celcius temps. Standard US cooking temps of 350, 375 and 400, for example are not avilable. Instead you get 355 and 395 so cooking is going to involve a lot of guesswork for the timer. Also, max timer setting is 25 moinutes so forget baking a potato unless you want to babysit the oven while it's cooking.",
      "rating": 2.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 4,
      "publication_date": 20190314
    },
    {
      "title": "working very well",
      "text": "We've had this toaster oven for about 4 months now. It has a toaster function that allows you to set how dark you want the toast and it is pretty accurate. Although it is an odd shape in comparison to our previous ovens it works very well. We use it to reheat frozen pizza and vegetables, make toast, toast pine nuts, and even to bake salmon and cookies for the two of us. It has a pullout tray that captures crumbs, making the oven easy to clean. One little glitch is that crumbs also collect on the front lip of the base, but it is pretty easy to wipe those into the pullout tray. So far, very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Gail Harrigan",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Good little toaster",
      "text": "Toaster works well. Very even! Toast comes out perfext. Chicken nuggets and other reheating food is done well. See other pix for relative size as it is small. Works perfect for us because we don’t have a lot of countertop space. Find we use this pretty regularly vs the microwave. Good quality but the pan is garbage. Controls are not totally intuitive but you get used to it.",
      "rating": 4.0,
      "verified": true,
      "author": "Tarek K. Dhanani",
      "helpful_votes": 6,
      "publication_date": 20180401
    },
    {
      "title": "Best toaster oven we have owned",
      "text": "So far so good. Read the reviews that it doesn’t last but this toaster oven is ranked #1 on Consumer Reports so we thought we’d try it. It has been great. We also love the size, so compact and really cute. It is the best toaster oven we have owned. And it actually toasts bread perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Vines",
      "helpful_votes": 3,
      "publication_date": 20181108
    },
    {
      "title": "The toast comes out exactly as I like, toasted on both sides",
      "text": "A very petite toaster oven, fits well in my small space. The toast comes out exactly as I like, toasted on both sides. This is not always the case with other ovens I have tried. My only problem, which is minor, is that I could not find the dimensions on the Amazon site, so was a little surprised when I received the box. However, once set up, the oven is very easy to use, and the size is a plus not a minus. I do not bake in my toaster oven, so am not concerned that the capacity would not allow for a full recipe of muffins. It will be perfect for re-heating most foods, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Deidre",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "This toaster oven completes me",
      "text": "Oh my god. Do you know how many people I’ve gotten to buy this machine? Probably the same amount as a person who got me to buy this machine. Because once you’ve tried it, you’re hooked. You can’t get any other toaster or toaster oven the rest of your life because this is perfection and everything else will seem like garbage. Not one person who has gotten it from my recommendation has disagreed. You can ask them. It’s like having the best toaster and a little baby convection oven in one. Actually that’s exactly what it’s like.",
      "rating": 5.0,
      "verified": true,
      "author": "lindze merritt",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "gets very hot",
      "text": "from a functionality point if view it should be ok but after just a 2.5 min trial tun i noticed that the oven get really hot and the sides and the top because it has no insulation between the oven chamber and the casing. very poor design. Sure in the manual it says you need a lots of space around the oven for that reason. so even it is small you need more space because it gets really hot. almost want to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "erhard",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Good and Bad",
      "text": "When working, this has been our favorite toaster oven. It toasts quickly, reheats pizza wonderfully, etc. I've bought 3 of these over the years as it works really well. However, the buttons eventually don't work. Had the power button go out on one, and membrane buttons stop working on the other two. For the price, I just won't keep buying them any more. Too bad something simple like switches ruins an otherwise wonderful product.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Kelley",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Excellent small appliance",
      "text": "Toaster ovens are everywhere but this one has an unusual size and set of features that work very well for me. This is the third one I've purchased! One is still in my vacation home, the third was getting a bit discolored -- but my son says it still works fine. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "David and Susan",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "Nice rack",
      "text": "The rack extends out when you open the door. The only thing I don't like about it is that you can only set the timer to 25 minutes. Home alone one night I baked myself a potato, which came out absolutely perfect with a nice crunchy skin after an hour. It would be better if I didn't have to keep turning it back on. Be careful not to put anything that can melt or burn on top of this little hottie.",
      "rating": 4.0,
      "verified": true,
      "author": "James J",
      "helpful_votes": 7,
      "publication_date": 20160622
    },
    {
      "title": "DO NOT BUY THIS TOASTER FROM AMAZON WAREHOUSE DEALS",
      "text": "Many of my friends have recommended this toaster. It's cute, quirky and really speedy. I decided to try to save a little money by buying a \"very good\" quality toaster through Amazon Warehouse. Big mistake! The toaster I received looked like it had multiple years of usage and the dripping pan was DISGUSTING. I can't believe I was sent an item in this poor quality. I still have high hopes for this toaster and will be ordering a brand new one but avoid the Amazon Warehouse deals if you can.",
      "rating": 3.0,
      "verified": true,
      "author": "XL",
      "helpful_votes": 8,
      "publication_date": 20180411
    },
    {
      "title": "Little but mighty",
      "text": "I only gave 4 stars for durability because I just received this today. I toasted a slice of bread and loved that it was nice and crunchy. That's my only experience cooking with it. But I wanted to share the outside dimensions: 10.25 inches high, 12 inches deep, (including handle) and 12.5 inches wide. It is practically all oven with little or no insulation. Because it gives off so much heat, instructions say not to set it too close to walls or cabinets. Perfect for me, as I have mine in a corner.",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia B.",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great for Toast and Pizza!",
      "text": "Holy Cow! This thing is awesome! Toast, frozen pizza or left-over pizza, croissants - everything comes out great! It works fast. It's the best toaster oven I've ever had. I bought it because I had a toaster that was awful. In fact, it seems that all toasters made in the last 20 years are awful. So I got this and not only does it make toast better than any toaster, it's faster and toasts bagels, English muffins, etc... better than any toaster. I love this thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Cranky Greg",
      "helpful_votes": 8,
      "publication_date": 20150817
    },
    {
      "title": "great oven missing accessory",
      "text": "The oven itself works great. My old toaster took ages to toast and this one is lightening quick. I've also used the oven function to cook various appetizers and those cook faster than suggested times plus no pre-heat time needed. My problem is the oven arrived missing an accessory which was on the list of items in the description--the insert that looks like a screen, I got the flat pan. I sent in a note to product support but have received no reply. Feeling frustrated!",
      "rating": 4.0,
      "verified": true,
      "author": "Florence",
      "helpful_votes": 6,
      "publication_date": 20170928
    },
    {
      "title": "Toasters for Dummies or Top Chefs alike",
      "text": "I have never thought much about toasters, mainly b/c I never learned how to cook until the last few years, well into my 40s. The factors I considered when buying toasters were limited to cost and size. When my last toaster started to die, I decided to treat myself to a top one (whilst still conscious of cost!). I never knew what I was missing until I started using this toaster! It is super fast and easy to use. I read the instructions in about 15 minutes b/c I am still learning cooking basics, and this makes baking and toasting really easy--gives me confidence to try new things. Worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "sandy wolf",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Some nice features, but quirky.",
      "text": "I am really picky about toaster ovens. This one received high reviews, but has a few quirks. It simply does not top brown or broil. It’s timer is basically a hidden feature that doesn’t exceed 25min. The infrared light goes off and on. The plug attaches to the side the of the oven. They discourage you from baking potatoes. It has other nice features: easy to use the specific buttons, and doesn’t take up much counter space. It’s pricey for it’s limitations.",
      "rating": 4.0,
      "verified": true,
      "author": "DJ2",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "The prior model was much better",
      "text": "This is our second Panasonic IR toaster oven. The first one lasted 10 years (with daily use by a family of six). When it finally gave out, I was happy to buy the next generation model. Unfortunately, the control panel on this model is giving out after a year. (The \"toast\" button doesn't always work.) It is possible that I received a defective unit, however it will be my last Panasonic toaster oven purchase. I have given it two stars as it is compact, fast and easy to use. If it was more durable, I would have given it four stars.",
      "rating": 2.0,
      "verified": true,
      "author": "The Civilized Outdoorsman",
      "helpful_votes": 21,
      "publication_date": 20160530
    },
    {
      "title": "Not good for baking small cakes - all else great!",
      "text": "Every small cake I baked was burnt. I laughed when I realized there were only 8 temperatures allowed: 250F, 285F, 320F, 355F, 390F, 425F, 460F and 500F. No other options for temperatures. I tried baking at 355F. Really bad burnt cake. I tried baking at 320F and leaving it in longer. Less burnt, but burnt. All the frozen and fast food items were cooked fine. Five cake attempts failed miserably.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Force",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "This has changed the way I bake/cook",
      "text": "First I did some research online before buying this toaster oven. Love this little work horse. Never had a toaster oven before because of lack of counter space, this one has a small footprint, I made room for it and now I use it multiple times everyday. It has totally changed the way I cook and bake. I've made corn bread, pizza dough, banana bread, baked chicken, cooked vegetables in this little gem. I was concerned my electrical bill would go up because I use it so often, it has gone up about $5/month; it is well worth it. Now I no longer have to heat the whole kitchen when I want to bake something.",
      "rating": 5.0,
      "verified": true,
      "author": "Still cold",
      "helpful_votes": 5,
      "publication_date": 20170827
    },
    {
      "title": "It's Panasonic!",
      "text": "Why didn't I get Panasonic before? I have had many many Panasonic products in the past. None. Yes NONE have ever broken. Including my 1972 quadraphonic stereo! Toasts fast and even, the light is a revelation, Oh I can see what I'm cooking!!!! It was a little more which previously made me go to a Braun which was pricey too. Toast took forever uneven and it stopped toasting, button wore out in 2 years. I'm so happy now! PS I love the light I can now really see what is going on in there it's like the light went on ,oh it did! Seriously, why don't all ovens have this ?",
      "rating": 5.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Very Nice but not for me...",
      "text": "I like this toaster oven, but it's not for me. Infrared is very different from any other cooking. It makes good toast. Reading the directions, you cannot watch your food cook due to infrared possible damaging your retinas. You cannot broil, everything must be wrapped in foil due to spattering on the bulbs which will damage them. These are a few things to watch for when purchasing. Over all It's compact and very light weight. Just make sure you read all you can about infrared cooking before purchasing.",
      "rating": 4.0,
      "verified": true,
      "author": "No One",
      "helpful_votes": 6,
      "publication_date": 20170514
    },
    {
      "title": "Great product with a flaw depending on color choice",
      "text": "Much better than a microwave and almost as fast. Food comes out wonderfully with a great texture and color that a microwave wont do. It's compact and would be best for familys of 3 or less. This toaster excels at roasting veggies. This is my second one. The power switch failed on the first after about 4 years of moderate to heavy use. The first was grey which made reading the controls difficult. The new white model is much easier to see. Prices fluctuate. I paid $108 on 2/2019, its $125 on 3/2019",
      "rating": 5.0,
      "verified": true,
      "author": "movielurking",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Fantastic little Toaster Oven",
      "text": "I purchased this toaster oven in November 2014, I just went online to see if it comes in a larger size and thought \"I need to leave a review\", so here it is... this little toaster oven is amazing! I 've had it for 3 1/2 years, it still works GREAT and its adorable. Love this little hunk of metal :)",
      "rating": 5.0,
      "verified": true,
      "author": "TeeCee",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "Matsushita rocks!",
      "text": "Been a while since I had a Panasonic toaster oven. Works as advertised - and better. Wish they still made (or brought to the States) the original TOASTEE. Took me years to kill and always gave me exactly the toast I wanted. Looks like this one will turn out to be just as good. Bigger than I usually need. But, spot on predictable.",
      "rating": 5.0,
      "verified": true,
      "author": "eideard",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Great Toast!",
      "text": "Most toaster ovens make O.K. toast slowly. This one makes great toast fast. It's also good for frozen hash browns, french frys etc. It does a credible job on baking frozen pizza and baking potatoes and other small things as well. For me it is the perfect size for a space challenged kitchen. It would not be good for a large household or if you wanted to bake larger things. But, if you want a compact versatile device for making great toast, and baking small snacks you can't go wrong with this.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Singer",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Small Unit , Heating Issues,",
      "text": "We are giving this 3 stars for Temp control for toasting, you have to watch your item (bagel, totast, etc. it will burn, additionally it requires rotating the bread to even toasting. I have the setting on 3 which is the highest light heat, the lower settings are way to low and slow. Overall the unit is easy to use and clean, but I would not purchase as it is smaller than I had thought when purchased and due to the lack of trust in toasting (we use one cut bagel and four garlic breads in it, but the four are tight.",
      "rating": 3.0,
      "verified": true,
      "author": "Goose",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "You need this toaster oven",
      "text": "This small footprint toaster oven is great. Using it instead of our oven for frozen cornmeal pizza first time was perfect and only required pushing one button. In 12 minutes perfect pizza. In our Jenn-Aire oven, 20 minutes to heat and then 15 to bake. Also cooked frozen chicken nuggets in half the bake time of my oven with no need to flip and they were perfect. Expect this oven will cut our utility bills. Very happy to have purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Bridges",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Decent little oven",
      "text": "Genuinely does not require preheating. Use this instead of a microwave. This beats getting cherry angiomas all over your skin and who knows what other genetic damage or illness from microwave leakage. The cooking is fast and uniform. With the quick reheat setting I fully reheated a giant, thick slice of homemade pizza with very little drying or hardening of the crust. Cashews roast perfectly at 285 degrees for 15 minutes (manual setting). My only gripe about this oven is that the timer alarm is too quiet.",
      "rating": 4.0,
      "verified": true,
      "author": "Gentleman of the Road",
      "helpful_votes": 0,
      "publication_date": 20200821
    },
    {
      "title": "Wish I bought it earlier",
      "text": "I wish I bought this toaster oven earlier, much earlier. Not only can you set time and temperature with buttons and have digital display for time, but you can (and I 95% of the time do) use preset buttons for things like toast, hash browns, frozen waffles, etc. On top of this, it has 2 different heating elements, with one producing deeper-reaching IR light heating much faster and deeper. This oven does not require pre-heating and works so much faster than the oven it replaced. The reason I didn't buy it before was I did not like its retro odd look. But we got used to it very quickly and it no longer looks odd to us. Recommend to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Scientist",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Excellent toaster oven",
      "text": "My sister has this unit for years - I used it a few times and the thing I LOVE about it is how fast it is HOT. Toasts bread perfectly in 2.5 minutes - about the time it takes to cook an egg so perfect timing. Also used it for several \"dishes\" and blueberry cobbler - the reheat feature - oven/toaster/toasting frozen bagel - all functions work beautifully!! The one caveat is depending on what you're making, you might rotate the pan/item to ensure fully even brown. No preheat - it's great!",
      "rating": 5.0,
      "verified": true,
      "author": "choc",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Favorite Toaster Oven EVER!",
      "text": "Love love love this for its small footprint and roomy interior (will fit 4 slices of bread, or whole Tortino's pizza.) Have used it to perfectly reheat a wide variety of leftovers and frozen foods, and it really earns it's five stars. The best toaster oven I've ever owned (out of many), and bought it after seriously considering the much bigger and more expensive Breville, which would have been way too big for my cramped kitchen. Don't tell my adult son, but I'm planning to buy him one of these for his birthday!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazoncustomer",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Consistently perfect toast!",
      "text": "This toaster is AWESOME. I did a lot of research trying to find a good toaster. This is as compact as they come for the most part, which I cared a lot about. It gives us evenly toasted toast every time. After reading about all the best options, while it seems tougher than normal to replace the bulbs if they go out in this, the other comparable toasters were more than twice the price of this.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 3,
      "publication_date": 20180608
    },
    {
      "title": "This thing actually works well",
      "text": "I was skeptical that an IR based toaster would be able to toast and bake. It does both easily and incredibly well. I also like the small size. I'd definitely recommend it even though it's somewhat expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Pulliam",
      "helpful_votes": 2,
      "publication_date": 20191125
    },
    {
      "title": "Great little oven",
      "text": "Mostly use this for toast and reheating things. Toasts very well and even on both sides and toast function is very easy - just push 'toast' button. No having to set 3 dials, like our old toaster, to turn on toaster elements. My wife was disappointed that it does not have a 'Broil' button or function. Things get hot quite quickly which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "AAF",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Smaller than an Easy Bake oven",
      "text": "Smaller than an Easy Bake oven. The picture with the pizza is meant to deceive you. I can't even fit two decent sized pieces of bread in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Sisame",
      "helpful_votes": 6,
      "publication_date": 20180402
    },
    {
      "title": "More versatile than a pop-up toaster",
      "text": "I primarily use it for toasting bread, but occasionally for cooking small items such as crab cakes. I've been using it for a year and a half now. With toasting bread I find that it is inconsistent depending the location of the pieces. When fully loaded I find that I have to remove some pieces sooner than others. Fortunately the level of toasting is visible. For cooking other things I always line the pan with aluminum foil because when I didn't the pan acquired permanent stains and impossible to remove. Some material other than aluminum would have been better.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert K. Harvey",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Looks good. Some design flaws.",
      "text": "Overall I'm happy with this. I like the look and the size. For the price, it's the best I could do, I guess. Cons: The rear of the lid rubs against the wall when opened. Over time this will rub away the finish and lead to rusting. Dumb flaw. Also, read the fine print. It isn't meant to be exposed to rain, which is really dumb for a mailbox! I will certainly have to replace it after a year or two. Finally, it would have been nice if they included screws for mounting.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathryn J",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Perfect toast. What's not to like?",
      "text": "My wife and I had one of those cheap Black and Decker toaster ovens for the past 20 years. I can't believe I waited this long to upgrade. The Panasonic has done a fantastic job on everything we've tried in it thus far - toast, frozen pizzas, you name it. It's a little large (compared to what I was used to, not compared to those monster ovens you can get from Breville and the like) but worth the counter space.",
      "rating": 5.0,
      "verified": true,
      "author": "3AM Shopper",
      "helpful_votes": 0,
      "publication_date": 20180627
    },
    {
      "title": "perfect toaster oven",
      "text": "This oven does perfect job of warming all the breads, waffles, pancakes--etc. It takes bread that is a day old and makes it taste like it just came out of the oven. It reheats all the potato pancakes that are frozen and they taste like they were just made. The controls are simple to use. It is inexpensive and lightweight so you can move it anywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "SCB",
      "helpful_votes": 2,
      "publication_date": 20180516
    },
    {
      "title": "Worked great for 6 months",
      "text": "Worked great for 6 months , then the power button started to be an issue. I had to hold it in during the duration of the cooking time or wedge a toothpick in the side of it otherwise it would loose contact and do nothing. I had it looked at and the switch on the circuit board was of poor quality and the contacts burned up. Expected more :-(",
      "rating": 3.0,
      "verified": true,
      "author": "RJ",
      "helpful_votes": 8,
      "publication_date": 20151106
    },
    {
      "title": "You get what you pay for",
      "text": "I've always been a fan of panasonic and own quite a few of their products. This toaster is a total cheap miss :( Albeit its on the more inexpensive range for the oven type toasters, but I've come accustomed to a certain type of build from Panasonic and this lacks that feel. Wound up paying double for a breville and its a night and day difference!",
      "rating": 1.0,
      "verified": true,
      "author": "PiyoPiyo",
      "helpful_votes": 3,
      "publication_date": 20190227
    },
    {
      "title": "Too many idiot buttons, no manual control of heat source",
      "text": "Generally like this toaster oven 60% of the time. But it's annoying that there is no way to manually control the source of the heat (either top, or bottom, or both). You can control the temperature. You can control the length of time. But you can't tell it to heat from the bottom only (like a conventional oven), or from top only (like a broiler), or from both top and bottom (like a toaster). You are left guessing as to what exactly the idiot buttons do. Also annoyed by marketing jargon: \"infrared\" is the technical term for \"heat.\" Don't try to dupe us into thinking that there is some newfangled technology here.",
      "rating": 3.0,
      "verified": true,
      "author": "5Walnut",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Keep looking.",
      "text": "Worked well while it worked. Lasted about 15 months before infrared light failed and now is is slow. Can't find replacement lamp and not sure it is easy to replace. Tried removing faulty lamp and it didn't seem to want to come out. Nothing in manual.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald L Cooper",
      "helpful_votes": 44,
      "publication_date": 20150902
    },
    {
      "title": "Smaller cooking area than I expected.",
      "text": "I did not realize how small the \"baking area\" is.. The shelf is not adjustable. It is easy to operate. I recommend that for baking you may want to use aluminum foil to prevent over cooking tops and edges. Works great on pizza, bagels and toast. It does not require preheating. French fries get a little dark on top, I should probably turn them once during baking. I use a toaster oven to avoid turning on my full size oven in hot weather. The light is on when it is heating. It goes on and off during baking. That is normal, not a flaw. I does have a removable crumb tray. A \"must have\" feature for me.",
      "rating": 4.0,
      "verified": true,
      "author": "REMECCAN",
      "helpful_votes": 2,
      "publication_date": 20160709
    },
    {
      "title": "Odd shape, quick, makes great toast",
      "text": "I had my previous toaster oven for 25 or so years, A Krups. It never made good toast. This one does, and much quicker too!. Crunchy on the outside, soft and not dried out on the inside. Can only handle four slices, but makes up for that in speed. Uses up less counterspace. Very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob R",
      "helpful_votes": 0,
      "publication_date": 20200125
    },
    {
      "title": "Very good toaster oven",
      "text": "This cooks and toasts bread very well. It's very much quicker than other toaster ovens I've had or used. I would have given it five stars except for the fact that it's a little difficult to clean when it's hot from cooking or toasting. This only becomes a problem if a crumb falls and starts to burn on the heating bulb. In this case, you have to clean the crumb off the bulb right away or the smell of burnt bread will penetrate the room. And cleaning right away means protecting your hands from the hot metal with doubled towels or an oven glove.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia T. Bliss",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Light oven shows food being cooked way better than normal toaster oven.",
      "text": "Works just like the old one I had for several years until the lower bulb went out. Can't get a replacement bulb so I tried a normal Toaster Oven for 1/5 the price. The orange glow from the elements are not half as effective as the white light from this oven. That and the easy to use pre-set buttons make this well worth the price. I'll look for an identical replacement years from now when the bulb in this one goes bad.",
      "rating": 5.0,
      "verified": true,
      "author": "FloridaRider",
      "helpful_votes": 7,
      "publication_date": 20161031
    },
    {
      "title": "Like a oven, but easier.",
      "text": "So far works great. My toast (it has a separate button for toast) comes out how I like it. It warmed up pizza, baked my sweet potato, and even charred some hot peppers. I covered the tray with aluminum foil for easy cleaning. Not sure how a pie would do, but so far everything I have tried turned out great. You can even set a baking temp and timer. Which is nice because then I can walk away while my items cook or heat up. My son uses one daily, so after using his, I had to have one.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Karnes",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Lasted 2 years and that just is NOT enough.",
      "text": "After 2 years of making toast every morning, the infrared element stopped working. Replacement is over $50.00 and it is not worth it. Can NO ONE make a toaster that will last for at least 5 years? While it was working, it made toast quickly and efficiently but 2 years is not long enough for any appliance.....",
      "rating": 1.0,
      "verified": true,
      "author": "Turmatic",
      "helpful_votes": 3,
      "publication_date": 20180525
    },
    {
      "title": "Great concept, flimsy housing. But I like it.",
      "text": "The product engineers are probably disappointed that a great concept has been poorly implemented. The sheet metal enclosure is about 30 ga. Similar to a soup can. Very easily dented. My warehouse deal had a dented top, loose screws holding the feet and interior rack disconnected. All simple repairs. The quartz elements and electronic controls produce perfect toast quickly. It's great, just has a flimsy housing. The cord points in the wrong direction but the on/off button is a nice safety feature. I can squeeze a 10-1/4\" correll plate in mine but it's a friction fit. All-in-all I'm quite satisfied with the technology especially since it was a warehouse deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill400",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "More toaster than oven, great performer",
      "text": "What a gem. It toasts perfectly, fast. Holds 4 slices of bread or 2 bagels comfortably. Small footprint. Used it to heat frozen garlic bread, perfect in 2 1/2 minutes, crispy outside and soft inside. I'm excited to use it for my son's pizza bagels. I love this toaster. I hope it lasts.",
      "rating": 5.0,
      "verified": true,
      "author": "Laddy D",
      "helpful_votes": 2,
      "publication_date": 20170913
    },
    {
      "title": "Great features, broke a week after warranty expired",
      "text": "I really like this toaster oven, mainly because of the controls. You can set it to your favorite setting, then just hit start on each use. But just after the warranty expired it stopped toasting on the bottom. I contacted Panasonic to see if they cared -- they don't. I can ship it to Texas (from Indiana) if I want to have it repaired. I want to order another, but I hate the disposable culture mindset and my experience with Panasonic customer support.",
      "rating": 1.0,
      "verified": true,
      "author": "Ray Cashman",
      "helpful_votes": 2,
      "publication_date": 20190308
    },
    {
      "title": "Faulty heating elements",
      "text": "Lost toasting strength after 5 months of use. Would not recommend. Now I have to put it on full strength and it barely toasts bread. Wish this didn’t happen as it was expensive and I thought it would last. Dissapointed",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Synko",
      "helpful_votes": 3,
      "publication_date": 20190526
    },
    {
      "title": "Best footprint!",
      "text": "Just love my silver, 2nd unit. First, (white), still working well after many years, but we just wanted a new one. (Donated 1st unit.) Works so well, looks so nice, easy care, and takes up minimal space—yet fits so much! A very good purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Camille  Fischer",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Not a space hog",
      "text": "Bought this Panasonic Toaster Oven primarily out of frustration with a series of toasters we've had, that either don't toast evenly or need several adjustments every time. We didn't want a big toaster oven that would take up twice the space this one does. We like being able to choose a heat setting for toast and English muffins. Yes it is kind of odd looking compared to other toaster oven brands, but it meets our needs for ease of use, adjustment options and size. We have only had it for 2 months or so, but use it regularly for small frozen pizzas, toast, English muffins, and brownies. No issues so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet S.",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Pricey and no tray included.",
      "text": "This toaster is nice and I like the modern touch that it has to it. The one thing that needs improvement is that it does not bring an inner tray so the crumbs fall to the bottom of the toaster and even the bottom of the toaster has no pull out for cleaning. For the price paid for this of over $100 it should have included a tray.",
      "rating": 4.0,
      "verified": true,
      "author": "Gensy",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "It rocks my socks off.",
      "text": "I have had this for several months and have been too lazy to write a review. Hello So I have put several foods in it and damn is this good. Cooks my wings nice a crispy and other foods I can't remmember. It has a system where you can select different foods and it will cook it based on that food. Increase temp, increase time, change how it will cook. This is actually very good.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "It's OK",
      "text": "The unit is a bit more \"industrial\" looking than I realized, and has some limitations that our old toaster-oven does not have, such as the oven on this has several discreet temperatures and you must use the timer rather than being able to put something at a low temp and being able to leave it for 20 minutes or so. Also it does not shut off automatically...something to watch for.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Buyer",
      "helpful_votes": 3,
      "publication_date": 20170112
    },
    {
      "title": "Power cord should be on the back.  Would prefer better shielding for the eyes from the infrared lights.",
      "text": "I would have loved it but there are 2 issues. For some odd reason, they put the power cord on the right side of the toaster. This makes it not look very nice on the counter when I'm trying to hide all of the cords. Also, the infrared light seems to warm my skin a bit when standing near the door. I also have concerns that the infrared which seems VERY bright can hurt your eyes when near by.",
      "rating": 3.0,
      "verified": true,
      "author": "Danny G. ",
      "helpful_votes": 2,
      "publication_date": 20180310
    },
    {
      "title": "Best countertop oven I’ve ever had",
      "text": "This little toaster oven is quite a bit smaller footprint than my old one, so it takes less counter space. But the best part is the infrared heating. The first time I turned it on I couldn’t believe how quickly it heated up and how bright it is. It toasts or cooks evenly and so fast. This small tech-wonder really packs a punch. If you are tired of the same old toasters that stop working in just a while, buy this one. You will LOVE it!! We have had ours, using it almost everyday for about two years and it is still just like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Fast food in a small package.",
      "text": "Kiddo was moving into her first apartment. Six college girls in one small space! So I was looking for a toaster oven that would fit on the small counter, be really easy to use, and provide good toast as well as some small cooking functionality. This device has made me the hero mom. The girls absolutely love it. It really does cook faster than most. They use it for a variety of easy college food, from frozen quiches to fresh salmon!",
      "rating": 5.0,
      "verified": true,
      "author": "MidCentury Modern",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "does not hold four pieces of large toast.",
      "text": "I like the device, but I bought it because I wanted to toast 4 pieces of large toast at the same time. You can not fit four pieces of large style bread. It can hold two, and I have tried to arrange the other two pieces as best I can, but you always end up with some unevenly toasted toast. If you toast two pieces is makes some of the best toasted bread I have seen, and it is very fast.",
      "rating": 4.0,
      "verified": true,
      "author": "ChirpingBirdy",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Attractive, efficient toast oven",
      "text": "So far I have used the toaster oven to toast bread, bake potatoes, and reheat frozen veggie burgers. It works very well for these tasks. Bread comes out evenly brown and is toasted pretty quickly. My only complaint, which was mentioned by other reviewers, is that when using the baking function, the oven goes off after 30 minutes and you have to reset it. I have not tried baking anything in it that requires a precise temperature so have not had a problem with setting the oven temperature (there is not setting for 350 or 375, only 355 or 390 degrees). The toaster oven is attractive and does not take up too much of my limited counter space.",
      "rating": 4.0,
      "verified": true,
      "author": "Anne S.",
      "helpful_votes": 3,
      "publication_date": 20150808
    },
    {
      "title": "Disappointed - cord access not shown",
      "text": "Not shown is cord coming from side on front end which makes it difficult to keep it away from the oven and the oven gets quite hot on outside - this was a great disappointment. Love the look and controls but too difficult to put into use. :(",
      "rating": 2.0,
      "verified": true,
      "author": "Carol Jacks",
      "helpful_votes": 9,
      "publication_date": 20170914
    },
    {
      "title": "No more burnt toast!",
      "text": "Kind of a retro looking kitchen appliance. My adult daughter's thought it was cute. It looks kind of like an easy bake oven! But it's just the right size for us and it makes perfect toast. Once complaint: the toast fell through once onto the bottom heating element. We unplugged it, but it was near impossible to bet out of the bottom without making a big mess. Also, the cord comes out on the right side of the appliance. It would be nice if it came out of the back.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura Lou Ridgeway",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Too expensive for so little uses - not recommended unless you just want it for toast.",
      "text": "This toaster does appear to heat up quickly but only in flashes and does toast and bagels great but you can’t broil or put anything that might splatter grease in it. It is so shallow in height it is hard to just put a foil wrapped item like a larger chicken leg. I found it couldn’t bake well at all - after an hour of cooking my semi frozen meal, it was barely warmed and ended up having to put it in my regular oven. Unless you just want to toast bread I would not recommend this oven. Too expensive for so little use.",
      "rating": 3.0,
      "verified": true,
      "author": "San Dimas",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "3 years of great performance",
      "text": "Have used this oven for 3 years nearly everyday (since Dec 2015). Thought of buying again but no need at this time. Very reliable, easy to operate unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael T. McIntyre",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "Small but mighty",
      "text": "As the owner's manual advises this is different from previous toaster ovens you may have used. It is well worth the effort to understand how it works and how to use the settings. I particularly like the light weight and small footprint which is ideal for limited counter space. It is much smaller than my previous toaster but has the same interior cooking capacity. It toasts a variety of breads perfectly and has special settings for frozen waffles, French fries, etc. One caveat: when cooking a full oven such as French fries or pizza turning the food front to back will result in more even cooking.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20180621
    }
  ],
  "product_meta": {
    "title": "Panasonic FlashXpress Compact Toaster Oven with Double Infrared Heating, Crumb Tray and 1300 Watts of Cooking Power - 4 Slice Countertop Toaster Oven - NB-G110P (Stainless Steel)",
    "description": "Color:Silver\n\nPanasonic FlashXpress compact toaster oven technology featuring double infrared ray heater for cooking up to 40% faster than conventional toaster ovens, instant heat eliminates preheating, 6 cooking menus with illustrated preset buttons, automatically calculates the cooking time for a variety of foods: bread (toast, waffles, bagels), frozen food (pizza, hash browns) and reheat (rolls, breads, leftovers), digital Timer (up to 25 minutes and temperature settings (250 Degree F to 500 Degree F), square shaped inner tray which is perfect for pizza up to 9-Inch in diameter of 4 slices of bread, removable crumb tray for easy cleaning, reminder beep lets you know when food is done, interior light allows you to view your food while cooking, internally measures 4.1-inch (H) by 10.2-inch (W) by 9.8-Inch (D), 7. 5-Pound, white fire hazard safety warnings do not place any of these materials or foods in this toaster oven, as they can ignite and cause a fire: paper, plastic, cardboard, taco shells, tostada shells, tortilla chips, buttered bread or bread with jam. Raw fish or meat should always be wrapped in foil. Do not put oil in the crumb tray, cook with a dirty crumb tray or cook without the crumb tray in place. Never leave the toaster oven unattended when in use. If food begins to smoke or catch fire, first turn off the oven's power button then disconnect the power Plug. Do not open the oven door until the flame recedes. Always read and follow cooking instructions on all food packaging. The FlashXpress G110P compact toaster oven externally measures 10.2-inch (H) x 13-inch (W) x 12-inch (D). Disclamier: Before using this toaster oven appliance, move it 10 to 15cm (4 to 6 inches) away from wall or any object on the countertop. Remove any object that may have been placed on top of the toaster oven appliance. Do not use on surfaces where heat may cause a problem.",
    "rating": 4.5,
    "feature_bullets": [
      "Double Infrared Heating High Efficiency Quartz and Ceramic Infrared Heating Elements are positioned in the front and back to evenly toast, bake, brown and reheat to perfection",
      "Precise temperature control easily bake piping hot fresh breads and prepared meals, an endless variety of tasty side dishes, home made hors d’oeuvres and more with a convenient manual touch button temperature control sensor",
      "See through glass door the resilient, see through door is connected to the baking rack to smoothly and safely pull the rack toward you as the door is opened",
      "Clean compact design: The FlashXpress toaster oven's compact design accents any kitchen décor or countertop. Power Supply:120V AC, 60 Hertz",
      "Easy to use the flashxpress toaster oven includes a square shape inner tray — a perfect fit for pizza up to 9 inches in diameter or up to four slices of bread — plus baking and removable crumb trays"
    ],
    "specifications": {
      "Product Dimensions": "12 x 13 x 10.25 inches",
      "Item Weight": "7.5 pounds",
      "Manufacturer": "Panasonic",
      "ASIN": "B008C9UFDI",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "NB-G110P",
      "Customer Reviews": "4.5 out of 5 stars3,945 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#2,526 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 3, 2012"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Toaster Ovens",
      "Ovens & Toasters",
      "Kitchen & Dining"
    ],
    "price": 129.99
  }
}