{
  "website_summaries": [
    {
      "verdict": "A simple motivational tool that is preferred by many pros. The best value for the lowest price.",
      "pros": [
        "Large, easy-to-read digital display",
        "Device filters out false positive steps",
        "Auto-sleep improves battery life"
      ],
      "cons": [
        "Bulkier than some other contenders",
        "No USB/web connectivity"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Don't Buy This One",
      "text": "I hate to bad mouth something but this is useless as a pedometer. I counted 2000 steps (keeping track in units of 100), this so called pedometer counted 2796. An error of 39.8 percent. That is totally unacceptable. In an effort to be fair and objective I tried using this again today. I counted 3000 steps using the same method. The pedometer counted 3930 steps. An error of 31 percent this time. I stand by my title \"Don't Buy This One\".",
      "rating": 1.0,
      "verified": true,
      "author": "art",
      "helpful_votes": 8,
      "publication_date": 20170307
    },
    {
      "title": "I'm now batting 0 for 4 on a pedometer that ...",
      "text": "I'm now batting 0 for 4 on a pedometer that will last more than a month. This is my fourth return in six weeks. (Fitbit zip was one of the returns.) The Ozeri won the record for failure rate. It failed about two minutes after taking it out of the box. After pulling out the battery tab, I started the set up process. Just a couple of steps in, the screen started going haywire, with number \"widgets\" flying around the screen. I left it on to run all night, and is was dead this AM. I am starting to believe this whole pedometer industry is just a fraud.",
      "rating": 1.0,
      "verified": true,
      "author": "Backcreek",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "Is Not Consistent!",
      "text": "This pedometer works sometimes recording my steps etc., and sometimes it doesn't record any information whatsoever. I wear it consistently the same way each time when I want to know my distance but most often, I'm disappointed to look at the display and find out it hasn't recorded anything.",
      "rating": 2.0,
      "verified": true,
      "author": "Patience",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "it's okay",
      "text": "I read all of the instrucions before setting up and still couldn't figure out how to personalize (set stride length to my stride). It seems to accurately track the steps. I don't wear it all day and don't utilize the other functions - mostly because I couldn't figure it out. The instruction book wasn't much bigger than the pedemeter itself - get your magnifying glass out!",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "I bought this for my 70 year old mother who ...",
      "text": "I bought this for my 70 year old mother who thinks she walks 10,000 steps a day doing normal things around the house. Seriously doubting that is possible, I decided to purchase this product to prove her wrong. Unfortunately, the device is so complicated to set up properly she and I gave up. Maybe that was her mischievous plan all along... hmm...",
      "rating": 2.0,
      "verified": true,
      "author": "FreelanceLife68",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Good Product. Reasonably Priced. Works as adverstised.",
      "text": "Works exactly as advertised. Step count and distance matches my manual count. It will also count a few steps while riding in the car. There is no off switch so disregard some of the \"steps\" if you drive to your walking area. Overall it is a good product for a reasonable price. My only piece of advice is to use a back-up to the belt clip. The device is so light it could easily slip off without noticing it is gone. You can buy a \"pedometer safety leash\" with a clothing clip and lanyard loop to make sure you don't lose the pedometer. I speak from recent experience. I will be buying another Ozeri and safety leash from Amazon soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Van Schaick",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "A Good Solid Reliable Pedometer.",
      "text": "Very nice machine. I bought one for me, then one for my wife a few months later. They provide good clear image of the time, steps, mileage, etc. and fit nicely in the pocket or one can use the clip which is tight and \"form fitting\" on the little item. Steps are VERY accurate when walking or running. They DO go up on a bumpy road when driving, otherwise car rides don't change things! We have used several OMRONS before, which also worked well, but we do like these the best of any of the simple pedometers. Good value too, I think.",
      "rating": 5.0,
      "verified": true,
      "author": "bryceb444",
      "helpful_votes": 0,
      "publication_date": 20160330
    },
    {
      "title": "Super for the Price",
      "text": "This is great for the price. It will make you want to meet your step goals. I can't bring a fit bit or any bluetooth capable devices into my work so this is the best replacement for a fit bit. Low price, functions well.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Junk!",
      "text": "Threw it away. Instructions are very small - need a microscope to read. Couldn't get the device to do anything. Threw it in the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "Albert J. Begil",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "You have to be careful because the clip makes it very easy to lose",
      "text": "I've owned 2. You have to be careful because the clip makes it very easy to lose. The first one I had I loved. The second one keeps resetting which is very discouraging and I don't like how it keeps cumulative steps over several days when I just want to know how many I did that day. It is a comfortable fit and records most steps (though not as well if you are stepping in place.)",
      "rating": 3.0,
      "verified": true,
      "author": "B. temple",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "Impossible to program",
      "text": "It is impossible to set this pedometer. When a mechanical engineer cannot understand the directions or program it obviously it is not user- friendly. I cannot use it!",
      "rating": 1.0,
      "verified": true,
      "author": "Ziva",
      "helpful_votes": 2,
      "publication_date": 20170225
    },
    {
      "title": "best bang for your buck",
      "text": "You would normally look at the price for this little step counter and think \"it can't work\" but actually it not only works, it's quite sophisticated. However sophisticated as it might be, it's not hard to set-up. Really a great buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Our Town Book Reviews",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Get set-up right before starting a cumulative count.",
      "text": "It seems to be extremely accurate and calculates whether I'm holding it in my hand or if it is in my pocket. As just about all of the reviewers wrote, the set-up isn't so straight forward. I didn't find an online manual for this model, but found one which was close. I never could figure out the 12 hour clock set-up, so went with 24 hours (1PM = 13:00) I recommend getting the set-up done right with your customizations before you start a regimen that really counts for a total number of steps over a period of time. PS - I'm on target to accomplish 1.5 million steps within 8 weeks, WooHoo! 600,000 steps in 3 weeks!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Good Pedometer",
      "text": "I like the slender design and very secure clip. I did not like the instruction booklet's lack of labels of the parts and lack of clarity for setting it up for use, but finally figured it out after multiple attempts.",
      "rating": 5.0,
      "verified": true,
      "author": "D'Ann Loomis",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Very good, basic step counter",
      "text": "I had an iPhone based pedometer, but found out very quickly that it burned through the battery in a hurry. So I looked around for a dedicated step counter. I got this after reading the positive reviews on Amazon. It's easy to set up, just the right size, not to big, not too small. I'm mostly interested to see how many steps I've taken every day, trying to get to 10,000 as often as I can. You can overdo it with fitness devices and forget the most important thing.....get out and exercise!! This step counter is inexpensive, well made, accurate, and gives me the information I need.",
      "rating": 5.0,
      "verified": true,
      "author": "PVL",
      "helpful_votes": 0,
      "publication_date": 20130719
    },
    {
      "title": "Great Pedometer",
      "text": "Great pedometer, very easy to use, though at first I was a little daunted by the instructions. They are not clear at all, in that I wasn't sure what they were trying to get me to do (to what end). But to use for your average purpose, you do not need any instructions. Seems to be very accurate and unobtrusive (so much so that I always leave it attached to what I am wearing that day and have to go back into the hamper to retrieve it every morning).",
      "rating": 4.0,
      "verified": true,
      "author": "WetHam",
      "helpful_votes": 0,
      "publication_date": 20130510
    },
    {
      "title": "This is not what we wanted. Too small to ...",
      "text": "This is not what we wanted. Too small to push the buttons, very hard to set up. Bought it for my Dad who is a senior, and he gave up on it. Even came with a tiny instruction booklet. Not sure if it works accurately or not as it was so hard to set up and figure out.",
      "rating": 1.0,
      "verified": true,
      "author": "K. O. Brien",
      "helpful_votes": 2,
      "publication_date": 20170601
    },
    {
      "title": "Thumbs up",
      "text": "Very good, except that it only remembers the previous 7 days of activity, not 30 days. Also, sometimes when I push the button, it jumps forward 2 screens instead of just 1, so I often have to cycle back around again to see the info I want. Oh, and the tether's clip is a little confusing at first; you have to flip the clips lever UP to make it open and DOWN to make it close, which is the reverse of what I'm used to. And I really had to put some effort into opening it the first time or two....to the point that I was worried I might break it, but it's sturdier than it feels.",
      "rating": 4.0,
      "verified": true,
      "author": "Geobear",
      "helpful_votes": 0,
      "publication_date": 20131118
    },
    {
      "title": "Excellent but vague",
      "text": "I really like my pedometer except that I can only see how many total steps I take because I couldn't figure out how to use the other buttons. I'm not very tech savvy and I found the instructions to be very vague. I even went on line to see if any of the UTube instructions would help. They didn't. I wish the instructions had more pictures. However, I'm happy that I now know how many steps I take a day and hopefully I'll find someone to help me figure out the other stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice",
      "helpful_votes": 0,
      "publication_date": 20140331
    },
    {
      "title": "Good pedometer at good price",
      "text": "Got the pedometer in a timely manner in excellent condition. Relatively easy to set up and have been using it to track my 10K program. Seems to be about as accurate as any pedometer and not as sensitive to position as some. The lanyard has kept it from falling several times as the belt clip can come of during exercise depending on what you have it attached to. I also like the multiple day tracking record for days I don't get my exercise for the day recorded at the end of the day. Overall, very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Cleveland",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "Nice size. Accurate. Easy to setup.",
      "text": "Works great. Nice size and accurate. Easy to set up. I did loose this one. I should have purchased a leash. When I replaced it I purchased a leash and the PD4X3-2 which is smaller and fits in my pocket better.  Both Oteri pedometers are very good, accurate and easy to set up",
      "rating": 5.0,
      "verified": true,
      "author": "RC",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Highly Recommended",
      "text": "This product was just what I was looking for. I read the other reviews and decided to give this product a try. It justly deserves the many high ratings. The read out is large and can be seen without glasses. The unit is easy to set-up and this pedometer is accurate. My thanks to the many previous reviewers who helped me make this choice. My purchase replaced a unit that originally cost $10 more and is junk. Don't waste your money on other units - buy this one first time out and you will be happy! I love that it comes with both the belt clip and a tether.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayne Mae",
      "helpful_votes": 0,
      "publication_date": 20130628
    },
    {
      "title": "Ended up returning it",
      "text": "Not very user friendly, and it didn't always catch my steps. I ended up returning it. I will look for something more advanced that is easier to use. Instructions were in tiny print and unclear. Maybe a fitness band will work better for me.",
      "rating": 2.0,
      "verified": true,
      "author": "The Technologist",
      "helpful_votes": 0,
      "publication_date": 20160731
    },
    {
      "title": "Great Pedometer but Quit Working",
      "text": "I bought two of these, one for me and one for my wife. The one I have is just great; however, the one I gave my wife stopped working properly after only two weeks of use. The bottom half of the screen display quit working making it impossible to program the unit with base line data. I do like the Ozeri concept and motivation this pedometer gives you so I plan to buy my wife another one",
      "rating": 2.0,
      "verified": true,
      "author": "Taltos",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Love this pedometer!",
      "text": "I ordered a fitbit for $89 and I couldn't even get it to work...after I returned it, I researched other pedometers and this one fits the bill perfectly. The only thing this doesn't do that the fitbit does is have an app...but I really could care less about the app. I held this one as I was walking and it is perfectly accurate. It fits in my pocket and I really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "So far so good!!",
      "text": "I've only had this pedometer for one day - well less really, it just came today. However, I can already say that it was super easy to set up and seems to be really accurate. I had it opened and ready to go in about 5 minutes. I like that it has you enter height and weight because I feel this will give me a much better idea of calories burned - my last pedometer did not require specifics which always made me wonder how accurate it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Slothie1",
      "helpful_votes": 0,
      "publication_date": 20130926
    },
    {
      "title": "I can't get it to go to the set-up screen ...",
      "text": "I can't get it to go to the set-up screen. Too complicated. I wanted something simple that I didn't need to use my computer for. May have to return it if I can't find someone to help set it up. Maybe it just doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryn",
      "helpful_votes": 0,
      "publication_date": 20170206
    },
    {
      "title": "Love it, gives me all in information I was ...",
      "text": "Love it, gives me all in information I was looking for. It did get wet but I took it apart and put in in some rice for a couple of days to dry it out. Put it back together and it runs like a champ. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "I am very frustrated with this product and can not recommend it to anyone",
      "text": "THis is not worth the money unless you don't care if it restarts itself. I have had this for over a week and every day it has restarted.The buttons are on the top and any time they are bumped it restarts itself. I am very frustrated with this product and can not recommend it to anyone!",
      "rating": 2.0,
      "verified": true,
      "author": "star",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "and provided a great deal of satisfaction during the three weeks I have ...",
      "text": "Although, I experienced some difficulty programing my Ozeri Pedometer; once programed, it has worked very well , and provided a great deal of satisfaction during the three weeks I have used it . I walk different courses all the time, and always find it interesting to see how far I am walking. Because the \"attachment clip\" is not long enough, the pedometer easily, comes loose from your belt; I would have lost it on several occasions if it were not for safety swag. Aside from the short clip, the design is nice. I would recommend this product , if they lengthened the clip.",
      "rating": 3.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Too hard to set up tracking the steps. Had ...",
      "text": "Too hard to set up tracking the steps. Had easier pedometers earlier. They were lower in cost too. I don't use this model at all. Its not worth the headache trying to set it up to count my steps.",
      "rating": 2.0,
      "verified": true,
      "author": "Shirley L. Johnson",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Impossible instruction manual",
      "text": "The print type size of the instruction manual is so tiny that even with a powerful magnifying glass I was unable to read the setup steps. As a result it never worked. My husband, “Mr. Instruction Manual Reader”, was also stymied. Beware the instruction manual.",
      "rating": 1.0,
      "verified": true,
      "author": "Eleanor Hoague",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Ozeri pedometer",
      "text": "I bought this for my wife. She and I have been walking a lot using pedometers and this one reliably counts her steps regardless of how she carries it. This replaces an Omron 112 (which is what I use). The Omron never seemed to count her steps as accurately as this one does. I use the Omron and it seems to work fine for me as I always carry it in my pocket. But she doesn't always have pockets in her pants. The Ozeri counts her steps accurately wherever she carries it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan McCoy",
      "helpful_votes": 0,
      "publication_date": 20131124
    },
    {
      "title": "It's doing exactly what I expected. I had downloaded ...",
      "text": "It's doing exactly what I expected. I had downloaded a program on to my phone but it didn't seem to be recording my movements well. I've been wearing this pedometer for a week now and comparing it the program on my phone. This is much more accurate. Lower tech than some styles, but it gives me the information I want.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Useless!",
      "text": "It didn't count my steps past a certain amount. Useless!",
      "rating": 1.0,
      "verified": true,
      "author": "JACQUELINE D.",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "I like the pedometer for its size and information it offers",
      "text": "I like the pedometer for its size and information it offers. It was a little difficult setting up. I followed the instructions but couldn't get the pedometer to start tracking my steps. I finally hit the reset button and went thru the instructions again. It seems to be working now. My only complaint is that it doesn't show steps as your are moving.",
      "rating": 4.0,
      "verified": true,
      "author": "judith a goldrick",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "not great",
      "text": "This lasted just a couple months. After two months it started freezing so we replaced the battery, and then a month later again it freezes and does not work. Not a well-made product, even for $20 bucks.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura T",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "It's good",
      "text": "Amazing how the unit works. More details than I care for. I simply wanted to attach it to my belt loop and start walking but the set up functions seemed excessive. Finally got the thing going & still working on the details. It came with a tassel strap (not sure how it attaches) and doesn't seem practical unless you carry it flopping around your wrist. Over all it does the job.",
      "rating": 4.0,
      "verified": true,
      "author": "zzzya",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "Incomprehensible Instructions",
      "text": "Instructions are in tiny booklet that you need a magnifying glass to read. But reading doesn't help as to me they were incomprehensible. I spent about 20 minutes trying to set up, and getting nowhere, I threw it in the trash, where it belongs.",
      "rating": 1.0,
      "verified": true,
      "author": "Leland J.",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Instructions very poor and very tiny.",
      "text": "Instructions are very poor and so small it takes a magnifying lens to read. Still have not been able to program it and can find no decent instructions on internet. I've owned a few pedometers thru the years and have never had this problem. It sits on my dresser waiting for me to try again. Maybe this thing arrived broken - who knows. Waste of money from my stand point.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda B",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Easy to read and use.",
      "text": "Easy to read display. I use this every day when walking the dog. Setup takes a bit. It would be great if this unit could accommodate two users with different stride lengths so it could be shared. Seems to work equally well whether on the wrist or in a pocket.",
      "rating": 4.0,
      "verified": true,
      "author": "Berdley",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Extremely difficult to set up",
      "text": "Have tried many times to set up and it doesn't do what the directions say it should. Did the reset and still nothing. Don't waste money on this!",
      "rating": 1.0,
      "verified": true,
      "author": "milly",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Good product",
      "text": "This works well. It won't be easy to use if you don't read the instructions carefully. Like all these electronic devises you have to poke at buttons searching for modes. But it does work well.",
      "rating": 5.0,
      "verified": true,
      "author": "C. DIPAOLO",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Works well and easy to use.",
      "text": "Purchased one for my wife and she loves it. It has worked well from day one and is accurate and easy to use. If this one dies, we would purchase another one just like it. After 18 months it is still working well; my wife walks 8-10 miles a day and it hasn't missed a beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy",
      "helpful_votes": 0,
      "publication_date": 20140930
    },
    {
      "title": "Accurate",
      "text": "Use it every day and works great. I wear two different trackers and they record the same readings. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "simple is good",
      "text": "great product small enough to put it in my pocket it resets itself every day at midnight not hanging on my wrist or around my neck just counts steps and distance very user friendly",
      "rating": 5.0,
      "verified": true,
      "author": "henry m smith",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "I'm walkin', yessiree!",
      "text": "I'm using the heck out of this thing! I wore out 4 pedometers from my weight loss group, and am depending on this one to go the distance, so to speak. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "As Advertised",
      "text": "Longest memory (30 days) on the market that I have found. Used to have an Omron with a 1 million step trip counter that I really miss...but it's no longer made. While slightly bigger than competitors, still easily fits in the pocket and allows for larger display withich is easier to read. Seems very accurate, definitely better than my wife's two axis, doesn't miss a step.",
      "rating": 4.0,
      "verified": true,
      "author": "Astromann",
      "helpful_votes": 0,
      "publication_date": 20140120
    },
    {
      "title": "Great Device",
      "text": "This has been the best tracker I have ever used! Very impressed with its durability and functionality. Only drawback is the clipbase but the shape and size limit some of the options. Maybe an adjustable carry band as part of the package?",
      "rating": 5.0,
      "verified": true,
      "author": "Racer X",
      "helpful_votes": 0,
      "publication_date": 20140202
    },
    {
      "title": "I cant really complain. I don't understand the different ...",
      "text": "I cant really complain. I don't understand the different step counts but i believe it starts a new when you don't move for a while. I just use \"total steps\". It would help if i didn't throw away the instructions. I haven't cared enough to google it.",
      "rating": 4.0,
      "verified": true,
      "author": "Brooke",
      "helpful_votes": 0,
      "publication_date": 20141108
    },
    {
      "title": "Easy and accurate",
      "text": "This pedometer is Very Nice. I just keep it in my pocket and it does an excellent job recording my steps. Small, lightweight, easy to use - what's not to like?!? I just have to worry that I will forget about it and run the darn thing through the wash!",
      "rating": 5.0,
      "verified": true,
      "author": "Storm",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "ideal for serious walkers/runners",
      "text": "Returned as it doesn't record activity. Great for walkers or runners. Packaging was horrible. Arrived in a bubble pack envelope crushed. Device appears fine but product packaging was also crushed.",
      "rating": 4.0,
      "verified": true,
      "author": "ShelleyW",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Quit after 2 weeks - see updated comments",
      "text": "First, it took several weeks to get the thing programmed correctly and then it only worked for 2 weeks before quitting. Save your money. This from my initial 1 star review. Well, someone actually reads these reviews! The product was replaced and I give Ozeri 5 stars for caring about the customer!",
      "rating": 3.0,
      "verified": true,
      "author": "Becky W.",
      "helpful_votes": 0,
      "publication_date": 20130228
    },
    {
      "title": "Don't Bother",
      "text": "Was never able to figure out how to set-it up. Got tired and repeating the same steps.",
      "rating": 1.0,
      "verified": true,
      "author": "Dedicated Online Shopper",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "but it was easy to setup and use",
      "text": "I had my previous pedometer for well over a year, and lost it one day. It was very disappointing, but it was easy to setup and use, so I wanted to get the same style. I received my first pedometer through my place of employment, for Healthy Team Healthy You, at no charge. I felt your price was fair and comparable to the open market , so I ordered one for myself and one for one of my coworkers. I got it sooner than expected, and have been thrilled with the ease of use. I wear mine everyday and it keeps me motivated to moving more. Thanks again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dona Auer",
      "helpful_votes": 0,
      "publication_date": 20140923
    },
    {
      "title": "Too hard to program",
      "text": "Sorry, but we never could figure out how to program this to get it to work. Not sure if there was something wrong with it or it was just us.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Corso",
      "helpful_votes": 0,
      "publication_date": 20151011
    },
    {
      "title": "Works Well",
      "text": "I like how it seems to be fairly accurate. I have used it on my elliptical and the time spent on my elliptical and the time I start using this on the elliptical always match. I love the digital screen and how easy it is to use.",
      "rating": 4.0,
      "verified": true,
      "author": "alw88",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "Effective pedometer.",
      "text": "This replaced my previous pedometer. My previous pedometer's clip did not keep it securely attached to my belt. This one has a better clip. It is also accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew L. Szekely",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Lasted only 5 weeks",
      "text": "I bought this approximately 5 weeks ago. I changed the battery. I have had to reset the pedometer everyday. Today it stopped working. Not a big fan, wasted $25.",
      "rating": 2.0,
      "verified": true,
      "author": "c. n. white",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "instruction book lacking",
      "text": "I still haven't figured this thing out; could be I'm too dense, but the instruction manual doesn't seem to properly state just how to complete all functions. I have run through what seems the same set of steps to get it to record walking steps, and when it finally does start counting, I have no idea how I \"got there\" it's frustrating. I regret the purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Easy to use, lightweight, good price.",
      "text": "I bought this to replace another pedometer that got broken in a move. I love it. It is simple to use, and fits in my pockets easily. There's a nice clip that seems to stay on well. It's lightweight so sometimes I forget it's on me. It seems to be pretty accurate. I like it that it has a good memory also.",
      "rating": 5.0,
      "verified": true,
      "author": "Terra Jensen",
      "helpful_votes": 0,
      "publication_date": 20130209
    },
    {
      "title": "pedometer",
      "text": "The Ozeri sport pedometer was compact and easy to set up for use. It could be slipped into a small pocket or clipped onto a waist band with ease. It can be set on time spent mode, steps, or mileage. The latter can be displayed in Kilometers as well. I am very pleased with the Ozeri pedometer.",
      "rating": 5.0,
      "verified": true,
      "author": "marsi",
      "helpful_votes": 0,
      "publication_date": 20121227
    },
    {
      "title": "I would recommend this product if you are looking for convenience and ...",
      "text": "This is an accurate Pedometer. I would recommend this product if you are looking for convenience and accuracy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Dufresne",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Difficult to program.",
      "text": "The tracker once programmed does a good job of tracking movements. Still prefer the Sportline tracker however it is no longer available.",
      "rating": 3.0,
      "verified": true,
      "author": "Dorothy Risheberger",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "easy to lose",
      "text": "Accurate measures but easy for the clip to allow pedometer to fall off when leaning over or if wearing on a pocket.",
      "rating": 2.0,
      "verified": true,
      "author": "a j thomas",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Can't remember if instructions came with it, but having ...",
      "text": "Can't remember if instructions came with it, but having problem figuring it out....I will google & see if instructions are online.",
      "rating": 3.0,
      "verified": true,
      "author": "thelmaann1",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Wear daily",
      "text": "Works great. Not connected to the internet and that's a good thing to me. Big numbers. Not backlit if you need that.",
      "rating": 5.0,
      "verified": true,
      "author": "Living Simply",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Save your time from all the confusion",
      "text": "Very complex to get setup and the instructions are not are not helpful. Was never successful. Unclear how to select mileage verses kilos.",
      "rating": 1.0,
      "verified": true,
      "author": "seanut",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "The works very well and I can easily track my daily step count and note how many ...",
      "text": "The works very well and I can easily track my daily step count and note how many there have been over a period of a week or even month if I wish,",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Excellent Product",
      "text": "Excellent product. It's all I ever wanted in an activity tracker. I have only one issue and that is the flimsy clip holder (and I say that loosely). I think the manufacturer can do better. This is not enough for me to lower my five star rating.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "I like it",
      "text": "I was disappointed that it didn't come with a replacement battery, which I thought it would based on the description and other reviews. But I have been using it for 6 weeks now and haven't had a problem with it yet. I do like being able to go back to view previous days' readings in case I've forgotten to record my distance for a given day. All in all, worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130527
    },
    {
      "title": "precise and super convenient to wear",
      "text": "Effective, precise and super convenient to wear. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "lindylou",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Too inaccurate",
      "text": "1. There is no online owner's manual so if you prefer a larger manual, you're out of luck. 2. This has a 20 per cent error factor. I went for a walk and counted my steps until I got to 1000. This pedometer said 1200. 3. Let's say your goal is 12,000 steps. You can't set it for this number. Once it gets to 10,000 steps, the next increment you are able to set is 20,000, 30,000 etc. I",
      "rating": 2.0,
      "verified": true,
      "author": "Fly By Night",
      "helpful_votes": 0,
      "publication_date": 20141122
    },
    {
      "title": "It is terrible while keeping steps",
      "text": "It is terrible while keeping steps, the count was terribly low, less than half of what it should have been. I am really disgusted with it, I will stick with my striiv.",
      "rating": 2.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "The pedometer is easy to use and is perfect for measuring steps and ...",
      "text": "The pedometer is easy to use and is perfect for measuring steps and stairs. If you want simple device this is the answer. It arrived earlier than expected.",
      "rating": 5.0,
      "verified": true,
      "author": "suzanne",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "Best pedometer going",
      "text": "Easy to use, accurate, and it counts your steps regardless of where you carry/clip it. - pocket, armband, clipped to belt. Doesn't accidently reset itself and lose what you've already done. Recommended to everyone. I've told everyone I've senn about this gadget.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcyd",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Great product, unless you get a defective one",
      "text": "My grandma loved this product. She has tried a lot of pedometers and this is her favorite: easy-to-use, accurate, readable display. Very disappointing that the product went defective outside of the return window. Display started going berserk (see attached clip) after 2months of intermittent use.",
      "rating": 2.0,
      "verified": true,
      "author": "The Kentucky Kid",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "Easy to keep in pocket and seems to give very ...",
      "text": "Works exactly as it should. Easy to keep in pocket and seems to give very accurate results.",
      "rating": 5.0,
      "verified": true,
      "author": "arc",
      "helpful_votes": 0,
      "publication_date": 20161111
    },
    {
      "title": "This works great! It counts steps very accurately and goes into ...",
      "text": "This works great! It counts steps very accurately and goes into sleep mode when you are stationary. It wakes itself up after a few steps. It keeps a log of all steps walked and daily steps which automatically reset at midnight. Realy works well",
      "rating": 5.0,
      "verified": true,
      "author": "P. Sieber",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Love this Pedometer",
      "text": "Love this Pedometer. Seems to be accurate and it gives nice details. Small enough that it doesn't take up lots of space in my pocket but large enough that it doesn't get lost!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Murray",
      "helpful_votes": 0,
      "publication_date": 20141120
    },
    {
      "title": "excellent pedometer",
      "text": "I have had 6-7 pedometers before this one. What an improvement! I highly recommend this product. The price is great & it is very easy to use & read. Finally a great product for us lo tech people.",
      "rating": 5.0,
      "verified": true,
      "author": "charlie",
      "helpful_votes": 0,
      "publication_date": 20131022
    },
    {
      "title": "This is a great pedometer. It is easy to set up",
      "text": "This is a great pedometer. It is easy to set up, reliable, and measures the things I want measured. This is my second, the first one got wet and the display was hard to read (but it still worked!), so I immediately ordered the exact same model. Wouldn't change a thing!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "I like it. Last one lasted several years and I ...",
      "text": "works well, I like it. Last one lasted several years and I droped it, bang it, ect.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert G. McFadden",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "The most accurate pedometer ever",
      "text": "The pedometer is great. My only complaint is the clamp broke. So I use the leash, which I had to buy separately. But as far as accuracy, this is the best one ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Susie Davidson",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "pass on this one",
      "text": "Instructions are awful. I would not buy this again as there is no way to program it, by the instructions.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Fast",
      "helpful_votes": 0,
      "publication_date": 20170306
    },
    {
      "title": "Cool pedometer!",
      "text": "I searched for pedometers with the best rating and also had a USB connection or stored memory longer than 7 days. This does 30 days which is perfect. I was able to set me stride and this pedometer works great and highly accurate. A great buy. A+",
      "rating": 5.0,
      "verified": true,
      "author": "coolmr77",
      "helpful_votes": 0,
      "publication_date": 20130731
    },
    {
      "title": "A lighted background would have been nice. Put it on my waistband",
      "text": "Too much info. A lighted background would have been nice. Put it on my waistband, went walking and it fell off. Hope the person who found it has better luck than I did.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "This pedometer fell off and was lost. I couldn't ...",
      "text": "This pedometer fell off and was lost. I couldn't keep the pedometer to stay on the clip. Very disappointing!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Good value",
      "text": "Good value for the price. Durable and. Pretty easy to use. Not 100% accurate, but we expected it to be a close approximation -which it is. I don't believe even the super expensive ones are going to be. Would buy again!",
      "rating": 4.0,
      "verified": true,
      "author": "bichonmom",
      "helpful_votes": 0,
      "publication_date": 20130723
    },
    {
      "title": "Large pocket pedometer",
      "text": "Ordered this for my husband. He likes to keep a pedometer in his pocket through out the day. Unfortunately he thought this was too big to carry around all day so I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "Ozeri pedometer",
      "text": "I have worn this for a week now. It works very well and is more accurate than my last one which was the old pendulum type. I like the 30 day memory, gives me more freedom.",
      "rating": 5.0,
      "verified": true,
      "author": "Duane L. Meyers",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "Works in your pocket",
      "text": "This little pedometer is working well for me. I can keep it in my pocket instead of clipping it to a belt or waistline, making it much more comfortable to carry all day. Far superior to my old pedometer, which didn't even have a way to replace the battery. Worth the few extra dollars to me just for that alone, having more functions is a plus.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Francis",
      "helpful_votes": 0,
      "publication_date": 20130722
    },
    {
      "title": "This pedometer is great with the exception of the clip it's not long ...",
      "text": "This pedometer is great with the exception of the clip it's not long enough and comes loose . Luckily it has a safety clasp. The only other qualm is that the milage isn't accurate. I coordinate the pedometer with Google My Tracks, which uses Google maps to track milage. Google Maps milage reading is a much closer match to the odometer reading in my car.",
      "rating": 4.0,
      "verified": true,
      "author": "Marissa Patton",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Pocket Pedometer",
      "text": "it's great...i just clip it in my pocket and it keeps track of my steps. Very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Lane",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "pedometer",
      "text": "Nice pedometer. Instructions could be a bit easier to decipher; my wife could not figure it out but after a little fussing I got it set up. Otherwise, relatively easy to set up and program to the individual user. Very accurate no matter how it is carried or worn. Easy to read. The only problem was that I paid for one day shipping and it did not arrive on time. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Anderson",
      "helpful_votes": 0,
      "publication_date": 20130506
    },
    {
      "title": "Set-up was easy by following provided instructions",
      "text": "Set-up was easy by following provided instructions. After using several times, I find this pedometer not only gives accurate and precise measurements, but is also extremely easy to operate. I would buy again in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20160604
    },
    {
      "title": "... either so maybe its me - it's a very cool little device",
      "text": "A little hard to learn how to operate but I'm not patient either so maybe its me - it's a very cool little device though",
      "rating": 4.0,
      "verified": true,
      "author": "Caty Penny",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "this works good. I have not found it to be completely ...",
      "text": "Eh. If you're interested in an estimate of your steps, this works good. I have not found it to be completely accurate.",
      "rating": 3.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20150308
    },
    {
      "title": "The operating instructions are impossible to decipher what the numbers ...",
      "text": "The operating instructions are impossible to decipher what the numbers are counting. They are very poorly written. I ordered two and am looking for my invoice for return.",
      "rating": 2.0,
      "verified": true,
      "author": "Kwams",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "Returned it",
      "text": "The read out / display is too small to be useful.",
      "rating": 1.0,
      "verified": true,
      "author": "inayat2012 on youtube",
      "helpful_votes": 0,
      "publication_date": 20170721
    }
  ],
  "product_meta": {
    "title": "Ozeri 4x3sport Tri-Mode Activity Tracker (Walk, Run, & Stair Climb), with Multi-Axis Detection & 30 Day Memory",
    "description": "Color:RedIntroducing the latest edition of the 4x3sport Tri-Mode Activity Tracker and Pedometer by Ozeri. This latest edition features Ozeri's new Tri-Mode technology with separate walking, running and stair-climbing modes for the greatest possible accuracy based on all exercise types, not just walking. It also features MotionLock technology, to prevent unintended exercise tracking - such as can occur with accidental activation when motion is detected while traveling in a vehicle. Unlike conventional activity trackers that require a preferred orientation to work properly, the 4x3sport utilizes the latest generation in 3D acceleration sensor technology to provide superior accuracy in your pocket or purse, and in any position, whether up, down, flat, on its side, or at any angle. Compact, sleek and slim, the 4x3sport Activity Tracker fits is any pocket and is the ultimate personal trainer. Used by professional 100 mile ultra-runners, the 4x3sport is a comprehensive activity tracker that records your steps, stairs climbed, distance, calories burned and time spent exercising, with separate algorithms for walking, running and stair climbing. It counts up to 1 million steps and includes built-in memory that records your daily activity for up to 30 days. The 4x3sport also includes a Steps2Target feature tracks and calculates your steps toward your daily target, and graphical displays your progress on its bright LCD screen. The 4x3sport filters out vibrations and only begins counting after it detects a sequence of continuous steps for greater accuracy. The 4x3sport Activity Tracker ships with a lithium battery, lanyard, belt clip and instruction manual. Your satisfaction is 100% guaranteed.",
    "rating": 3.3,
    "feature_bullets": [
      "New Tri-Mode edition designed for walking, running, and stair-climbing, with multi-axis detection technology for superior accuracy in any position.",
      "Records daily steps, stairs climbed, distance, calories burned, and exercise time, with MotionLock to prevent unintended motion activation - such as when in a vehicle.",
      "Enhanced Steps2Target feature tracks and calculates your steps toward your daily target and graphically displays your progress.",
      "Counts up to 1 million steps with memory for 30 days of activity, and includes a clock, calendar & sports timer.",
      "Boasts a slim pocket design with large easy-to-use buttons; ships with a lithium battery, lanyard, belt clip and instruction manual. 100% Satisfaction Guaranteed."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.06 x 0.5 x 1.38 inches; 1.28 Ounces",
      "Item model number": "PD4X3R-3",
      "Batteries": "1 Lithium Metal batteries required. (included)",
      "Date First Available": "October 29, 2014",
      "Manufacturer": "Ozeri",
      "ASIN": "B00P03P11A",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Pedometers",
      "Sports & Fitness",
      "Fitness Technology",
      "Health, Household & Baby Care"
    ],
    "price": 17.98
  }
}