{
  "website_summaries": [
    {
      "verdict": "A solidly built and attractive bookcase that is part of a collection, in case you're looking to pick up matching pieces.",
      "pros": [
        "A great-looking option that comes in dark tobacco brown or black",
        "Both feature a protective finish",
        "Real wood",
        "Durable construction",
        "Five shelves",
        "Assembles in under an hour",
        "Other pieces of the collection available for purchase"
      ],
      "cons": [
        "Some buyers experienced assembly issues with the pre-drilled holes (that were not pre-drilled, or drilled too small) and screws (screw them in too tight and you risk splitting the wood)"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good quality, nice and sturdy!!",
      "text": "I ordered a new TV and realized I needed new furniture to go with it, since it wouldn't fit on the original cabinet. I got this shelf to keep all my \"stuff\" in one place. Even though the color was different from the Simpli TV cabinet, it matches perfectly. I couldn't be happier with the purchase. Like the TV cabinet, this was easy to put together and is nice and solid. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "ND from NY",
      "helpful_votes": 12,
      "publication_date": 20150417
    },
    {
      "title": "Nice looking shelf though and really sturdy once put together",
      "text": "Took a while to put together. Why? Because I thought I could ignore the directions in the book and did it my way. Ended up assembling it realizing I missed a really important step had to disassemble and reassemble. I took pictures and this and that to show the mistakes I made, but have decided not to post it because I stopped taking pictures once I realized how long it was taking me to put this together. Trust me, you want to read the directions and make sure you have a grasp of what they are saying otherwise could take you a while. Nice looking shelf though and really sturdy once put together.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20151126
    },
    {
      "title": "My wife and I liked a smaller one at an expensive furniture store",
      "text": "My wife and I liked a smaller one at an expensive furniture store, where the price was $350 plus 9% sales tax. When this Simpli Home bookcase arrived, I was impressed that it was a significantly larger size, of all all wood construction, and does a great job holding books and curios. It took a leisurely 2 hours to assemble but I was in no hurry. All parts are very prominently marked for less confusion re assembly details and the manual is very clear. The bookcase is very sturdy and we are simply delighted with it. It cost roughly one-fourth of what the store bookcase did and we felt we got a better bookcase. Highest rating is appropriate.",
      "rating": 5.0,
      "verified": true,
      "author": "ralph glorioso",
      "helpful_votes": 2,
      "publication_date": 20160131
    },
    {
      "title": "Very sturdy, but...",
      "text": "I'm giving this four stars, because while i absolutely love it for its sturdiness, i had issue with a couple of things: 1) holes for the back brackets were not tapped. my poor hands! Honestly, i didn't screw in every single hole for the brackets, nor screw in every bracket because of how difficult it was. 2) Instructions included installing hinges under certain shelves. There were no tapped holes for these hinges, and they were at difficult angles, so forget that! super sturdy regardless. great all wood construction, and could be built by one person.",
      "rating": 4.0,
      "verified": true,
      "author": "omie",
      "helpful_votes": 0,
      "publication_date": 20160928
    },
    {
      "title": "Good Stuff.",
      "text": "I love this company. This bookshelf was a little tedious to assemble, but came out well. The trick is in the cams. Make sure you orient yourself to the direction arrow on the lock and that will make things a lot easier for you. The wood is nice, well finished, well marked. The directions are good and they provide you with lots of spare parts. All in all, I love the finished look of this bookcase AND I like how this company thinks. The bookshelf looks fantastic in my Bonus room holding all my DVDs and some knick knacks. Great piece of furniture for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "GHB",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Buy This Shelf!",
      "text": "So I am extremely skeptical of any piece of furniture I buy...doesn't matter where I buy it from I just assume that unless I'm spending many hundreds of dollars (or thousands), that it's going to be garbage. NOT THIS ONE! For the price, it's more than I expected. Not difficult to put together whatsoever and very sturdy. Packages arrived unharmed and all of the pieces were in great shape for both shelves I purchased. Moreover, because of their quality (seriously shocking to me), I feel like I should've paid more. Happy I didn't have to. Great buy, great seller! I would absolutely recommend these shelves to anyone looking.",
      "rating": 5.0,
      "verified": true,
      "author": "DAGHES",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Sturdy and good looking.",
      "text": "I'm usually not one to purchase ready to assemble furniture but my wife and I could not find anything in this style with the color we needed for our living room so searched Amazon and found this shelf. I'm pleased to say that the quality exceeds what I expected. The unit is solid wood with good quality hardware and easy to follow instructions. It only took my about 30 minutes to assemble and I am pleased with not only the look of it but the sturdy design as well. Great addition to our decor.",
      "rating": 5.0,
      "verified": true,
      "author": "Denver Terry",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Nice and sturdy, looks pretty cool!",
      "text": "I love this...once put together. It it pretty easy to assemble. Had to drill pilot holes for the small shelf support brackets but other than that was pretty easy. I would buy a couple more but I just don't want to assemble them. It takes a while to get all together, but the finished product is sturdy, looks nice, and goes well in my house. The only real complaint were the item-part labels. You know some guy in China said lets use the stickers that are a pain to remove tee hee. Well some goo gone took them off, but that was my only real gripe.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher C",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "They look nice but were difficult to put together",
      "text": "I bought two of these. They look nice but were difficult to put together. The fastening devices did not fit the pre-drilled holes, particularly for the support bars in the back, so it took a lot of time (and wrist-power!) to screw them in. That being said, they are fairly sturdy and look nice for our purposes (storing and viewing completed Lego projects). I would not recommend for storage of heavy books, though.",
      "rating": 3.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 8,
      "publication_date": 20140731
    },
    {
      "title": "Good shelves, good price.",
      "text": "I looked for a long time and even ordered some bookcases from...xxx...and sent them back at my expense. When I ordered these, I was a bit afraid to open the box but when I did, I was pleasantly surprised. These shelves really are wood and not just advertised as wood. They are a bit darker than I wanted but I just moved them into rooms where the darker wood worked. They were easy to build (I did three and my 14 year old did one) and sturdy enough for heavy books.",
      "rating": 4.0,
      "verified": true,
      "author": "Joselle",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "A great addition to any room",
      "text": "Over all this is a lovely shelf and a great addition to my living room. Its very well made and pretty solid. A couple of pre-drilled holes were slightly off but we rearranged two pieces and it is fine. I am so glad that it holds the weight of my 17lb. Salt lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "Josephine Pizzarello",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Fantastic product. I highly recommend it.",
      "text": "This shelf looks great! It is real wood and very, very sturdy(as you'll know upon assembling it). Also, I rarely comment on how an items is packaged but this one stood out--it was very well thought out. Just enough packing to protect the finish on each individual piece of wood', but in the most minimal amount of overall space possible--brilliant job on that.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Fisher",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Looks nice but a pain to put together.",
      "text": "This took me a really long time to put together and I had to use a small electric screwdriver to put it together. I knew that from the other reviews but honestly it was pretty unpleasant putting this together on a hot summer day in a place with no AC. I would probably not order this again unless someone else was putting it together and taking the time to do so. Also one of the screws was missing the other part so my top shelf is kind of loose since I didn't want to go through the hassle of a return. It looks good afterward but I don't put anything on the top shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "Jas",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "THE STICKER!",
      "text": "This sticker here totally drove me crazy. Please consider putting some high quality sticker on your product. Not these \"hard to come off\" stuff",
      "rating": 2.0,
      "verified": true,
      "author": "Leon Chen",
      "helpful_votes": 12,
      "publication_date": 20151218
    },
    {
      "title": "I had purchased 2 of these 3 yrs ago and ...",
      "text": "I had purchased 2 of these 3 yrs ago and they were well made and I had no problems putting them together. This one, not so much. Flaws in the wood, and the screw holes didn't go in together well. But you don't know that until you have almost finished building it. I wasn't going to take it apart and return it. Sigh.",
      "rating": 2.0,
      "verified": true,
      "author": "Notablond",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "Solid piece for the money, beautiful finish!",
      "text": "So pleased with this bookshelf, nice dark finish, well worth the price. Putting it together was pretty straightforward, although four of the holes for the shelf braces were missing, but the material is soft enough to run the screws in by hand without a pilot hole. The very last one I went to install started to splinter one of the shelves but I think that one's on me because I didn't pop a pilot. I recommend this one strongly if you don't want to spend a lot of money but look like maybe you did ;)",
      "rating": 5.0,
      "verified": true,
      "author": "cwrex",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Stands Out !!!!",
      "text": "Very happy with this bookcase. Just love the drama the 'ladder' part of the bookcase adds to my living room. It has a rich dark brown finish that looks rich. The shelves are roomy and the open ends allow all-around vision of' the contents and photos displayed. My husband and I assembled the unit that went together in no time at all with no hitches because no hardware was missing, and all pre-drilled holes were placed correctly. We love it !",
      "rating": 5.0,
      "verified": true,
      "author": "Menob",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "Knocking off 2 stars for the for it not having ...",
      "text": "Knocking off 2 stars for the for it not having predrilled holes on the shelf pieces for the angle brackets, and the holes for same brackets, on the side pieces, did not all line up right. still its a solid unit and looks sharp, just know you may need/want to drill a few pilot holes",
      "rating": 3.0,
      "verified": true,
      "author": "Imp",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "These are a great value for the price",
      "text": "These are a great value for the price. They go together fairly easily (by the fourth one I could do it in my sleep). They are pretty sturdy. I have a lot of fairly heavy books on them. The boards are particle board and the veneer is pretty thin and easily damaged, but they actually look good filled up. I use them for storing my art/photography books and supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "Nightbyrd",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Overall this is a great product for the price",
      "text": "Overall this is a great product for the price. Had it up for a couple weeks and no issues or concerns. Have the middle shelf full of hardback books. Haven't tethered it to the wall and even with 2 cats, we have had no issues. Nothing close to a bobble or we would have tacked it down instantly. Better safe than sorry if you have a large dog that likes to climb or children, but otherwise the shelf seems very sturdy.",
      "rating": 4.0,
      "verified": true,
      "author": "T G",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Looks nice and seems stable",
      "text": "Easy to build, looks good, holds things. Follow the instructions and it is very stable. Matches very well with the same collection media stand.",
      "rating": 5.0,
      "verified": true,
      "author": "PFPulse",
      "helpful_votes": 3,
      "publication_date": 20170115
    },
    {
      "title": "Decorative but not durable",
      "text": "Calling this a bookshelf is being generous. The build is flimsy and it will rock and away with the lightest touch. Absolutely attach this to the wall if you have even modest weight on it. Even then I question it's durability. One if the back beams even cracked during assembly.",
      "rating": 3.0,
      "verified": true,
      "author": "James A. Malerich",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Appearance is as advertised. Just a little trouble putting ...",
      "text": "Appearance is as advertised. Just a little trouble putting it together as the wood slightly split when I screwed in brackets on one shelf. This appears to be a manufacturing issue since I bought 2 of these and had the same problem on the same shelf on both. Otherwise the color is spot on and its solid.",
      "rating": 4.0,
      "verified": true,
      "author": "Heather J",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "it's beautiful! Better than I expected for a very reasonably ...",
      "text": "Omg, it's beautiful! Better than I expected for a very reasonably priced piece of furniture. Real wood and my friend and I put it together in less than 45 minutes with no problems. All pieces were there and well marked. I had no problems at all. Came right on time! Love it. Will definitely order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet L. Martin",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "This actually turned out better than I'd expected",
      "text": "This actually turned out better than I'd expected, and the color was just as described. It was very easy to assemble, but I overturned one of the screws and cracked a shelf. It was a minor crack, and I'm not putting heavy things on the shelves, so I just filled it in with a marker and you'd never see it. I would absolutely recommend it if you're looking for a simple, inexpensive unit for light items.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly in VA",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Great piece, easy to assemble",
      "text": "Great piece, easy to assemble. One person can put this together, but two of us flew through it. Extra hardware included but not needed. Only complaint- massive sticker on one of the slats. We purchased a second shelf as soon as we finished.",
      "rating": 5.0,
      "verified": true,
      "author": "CSp3nce",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Nice Solid Wood and Well Finished",
      "text": "This is truly made of good quality pine and is nicely finished. My only complaint is that they use the cam lock style fittings, like Ikea furniture. And this would be better done just with regular dowels. But otherwise, I got it for about 90 bucks and I'm very please.",
      "rating": 4.0,
      "verified": true,
      "author": "Bradley S.",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Love them for their looks, Took a long time to put together.",
      "text": "I love this shelf so much. I will say putting it together wasn't the best of directions, but since I bought two, I made all the mistakes on the first one so I knew how to do the second one correctly. It does take a bit to put together, and I highly recommend having someone to help you - it took me about an hour on each by myself and without an electric screwdriver.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20140709
    },
    {
      "title": "Great purchase and looks good.",
      "text": "Not much room in my little office area, but this bookcase fits in great. Wasn't sure how sturdy it would be when I unwrapped it, but after putting it together it is pretty sturdy. Easy to put it together by myself. Looks great with my other furniture. Holds a large quantitiy of books and other items. I recommend this to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "WS",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Better than the competition",
      "text": "We bought one ladder book shelf and the cat promptly crashed it (I didn't have it secured to the wall yet). I bought this one to replace it and now I'm glad the cat killed the other one. This bookcase is very well made, has much better bracing and supports than the old one, and was easier to put together since the main structure ships already constructed. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie H.",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "it is VERY easy - the booklet is concise and well put together ...",
      "text": "I bought on amazon of course... I received the items (I bought three of them) on time. The different parts of the shelves were well protected in the packaging - the box was not heavy. It takes about 20 minutes (I took my time) to put a shelve together, it is VERY easy - the booklet is concise and well put together I found. The wood in one shelves split as I was tightening one of the screws, so be very careful.....With that said, this is a VERY good looking piece of furniture that harmonizes very well with other pieces. 4 stars because of the split...",
      "rating": 4.0,
      "verified": true,
      "author": "Jocelyn",
      "helpful_votes": 0,
      "publication_date": 20150803
    },
    {
      "title": "Very please with it.,",
      "text": "Very pleased with this once we figured out we could use an electric drill. Was next to impossible to screw in screws without it. Very nice and strudy. Worked perfectly for what l intended.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle Kresin",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Very Pretty and Unique",
      "text": "Very pretty, nice color, looks exactly how the photo does. It's a unique bookcase and simplistic. Also seems fairly sturdy and of good quality. Only issue is that when screwing the pieces together, some pilot holes were missing. It wasn't a huge issue since the screws went into the wood pretty easily, but I was hesitant to make my own holes, for fear of messing it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "Attractive Bookcase, Unattractive Assembly",
      "text": "The bookcase is beautiful and well (crafted., but what they don't say in the product description is that other than the holes for the cams and screws, little is predrilled or even marked. There are small, L-shaped metal brackets you have to attach to each shelf with screws and six bars across the back--the bars are -pre-drilled, but no markings for where they are to attach. Since downsizing recently, I've bought quite a few wood products requiring assembly and this one has difficult-to-read drawings (thin lines and undersized), too. Although many of my comments are negative, I like the item so much that I'm going to bring in help to get it together.",
      "rating": 3.0,
      "verified": true,
      "author": "Sandra P.",
      "helpful_votes": 0,
      "publication_date": 20160815
    },
    {
      "title": "Looks nice and is sturdy enough",
      "text": "I use it in my living room to hold decorations on top, books and movies on middle, and blankets/pillows on bottom for movie night. It looks really nice and is sturdy enough that I don't use the wall attachment it comes with.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrenaline",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Thie bookshelf is garbage. The wood is nice",
      "text": "Thie bookshelf is garbage. The wood is nice, but the screws and bolts don't hold tight enough to make this bookshelf usable. It literally fell apart after a few days.",
      "rating": 1.0,
      "verified": true,
      "author": "vulture",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "High quality, SOLID wood, Beautiful Bookshelf!!!",
      "text": "HIGH-QUALITY design. Comes with great hardware. Easy to assemble. SOLID WOOD (which is hard to find). Beautiful finish. Great price. I'd be surprised if you found a better bookshelf!! If you're eyeing this item, I would just go for it! It's a great piece of furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "LadyTatian",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Really nice if you can get it together",
      "text": "Fortunately, they send a couple extra locking cams to lock the shelves to the sides. They are pretty cheaply made, and a couple of them snapped as I was tightening them down. The pilot holes were also a little small for the screws holding in the back supports. I stripped a few of the screws during that step. Once it's all together, it actually looks really nice though. The real wood shelves look great. I'd buy another one, but if I do, I'll be more careful with the locking cams and redrill the pilot holes on the back. I'd give it four or five stars if it wasn't for the assembly issues.",
      "rating": 3.0,
      "verified": true,
      "author": "Tony S",
      "helpful_votes": 2,
      "publication_date": 20140417
    },
    {
      "title": "I am using in my pantry to get things up off the floor! Well made for the price, not hard to put together...",
      "text": "I am using in my pantry to get things up off the floor! Well made for the price, not hard to put together. Use caution it is easy to install the shelves backwards.",
      "rating": 5.0,
      "verified": true,
      "author": "MMB IN NJ",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Easy set up",
      "text": "Easy set up and a good price. Just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Beautiful, sturdy shelves",
      "text": "I ordered two of these for our board game collection. They're a lot sturdier than I expected them to be, and are the perfect size for our largest and smallest games. Easy assembly if you're at all familiar with at-home assembly furniture pieces. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Exactly What I Wanted",
      "text": "Everything came nicely packed and all the pieces were there and in excellent condition. It was a little time consuming to assemble but I'm not really too quick with a screw driver either. The best part about assembly was that everything fit where it was supposed to go, lined up correctly, etc. The finished shelf looks great and is very sturdy. I'm very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "sarah w.",
      "helpful_votes": 0,
      "publication_date": 20141007
    },
    {
      "title": "Product is real nice, but had issues!!!!",
      "text": "Nice finish, all wood, sturdy, good size, good price. Everything I expected, but..... had to drill some holes at end of the shelves. Not a big problem for me, being that I have drills, bits, and experience with this type of work. Shldve been fully prepped from factory!",
      "rating": 3.0,
      "verified": true,
      "author": "4go",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Just the Right Size",
      "text": "It arrived in good condition and looks really nice in my living room. I'm using it to display my ceramic bird collection and it's just the right size.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Nice look, a little wobbly",
      "text": "It takes a good amount of time to set up (approximately 1 hour). It isn't difficult; it just has a lot of pieces to be fit together. I felt like I did a careful job with this, but it is still a little wobbly. I have books on two shelves, and various other items. I am sure it is stable enough to hold more weight, but because it isn't totally secure, I keep it at two rows of books. It looks really nice and sleek. It opens up the room, or at least looks less cluttered than a regular book shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20140402
    },
    {
      "title": "Highly recommended",
      "text": "I am very pleased with this purchase! I ordered 2 shelves for front living room and placed them side by side. When they arrived they were very well packed. Very high quality, easy to follow instructions for assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "emily",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "I like these a lot",
      "text": "I like these a lot, very well packed and good quality products. Assembly took a bit because some of the holes didn't seem to line up right but it worked out eventually. My only reason for giving these a 4 and not 5 is because I thought thy would be taller, my fault for not measuring the height before placing the order. Overall, very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "jess",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "sturdy, attractive shelf unit",
      "text": "This shelf unit is just what i was looking for. I bought two units to flank my fireplace and put them together myself in about an hour with just a screwdriver. The hardware was well packaged and organized. The units are quite sturdy and look more expensive than they actually are. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "sturdy, and was easy to assemble",
      "text": "This shelf was just what I was looking for - it is attractive, sturdy, and was easy to assemble. I found the shelf consistent with the photos and description.",
      "rating": 5.0,
      "verified": true,
      "author": "stuff i like, stuff i dont",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Great shelf",
      "text": "I purchased this shelf for my office at work. It is quite sturdy and the shelves are large enough to store many items. The wood color is as described. Looks very nice in my office.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Funk",
      "helpful_votes": 8,
      "publication_date": 20130509
    },
    {
      "title": "Fairly easy to assemble and I like it very much otherwise",
      "text": "Arrived with a scratch on one side but not worth returning. Fairly easy to assemble and I like it very much otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "BrenKay",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Worked great for me",
      "text": "Needed a bookcase that didn't look big and bulky but was big. Being open all around this did the trick. Fits nicely with my other pieces and holds everything I needed it too.",
      "rating": 5.0,
      "verified": true,
      "author": "md",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Great looking bookshelf!",
      "text": "Love this bookshelf! It fits plenty of books, picture frames, and other cute trinkets. The open top allows me to place taller items such as plants; it also creates a much more open and airy feel rather than a boxed off storage space. The open sides and ladder-like structure receives tons of compliments. The dark wood also has a nice finish. Definitely a great addition to any room or library! Only negative was that the wood came off a bit when drilling the nails in--it's still definitely worth the price though since it's pretty inexpensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 3,
      "publication_date": 20130417
    },
    {
      "title": "Definitely worth it.",
      "text": "Loved the overall product. The shipping/packaging was very neat and compact. This allows for little movement within the box, so no scrapping occurred. Also, every piece is wrapped individually. The build quality is worth the price and the overall hardware is quite nice. They even send extra of each piece of hardware which is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip O.",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Solid Ladder Case",
      "text": "This is a pretty good ladder case in the $130 range, especially if you have some bigger items that you want to put on the bottom. I had no problems with assembly but take your time when screwing the shelves onto the support brackets, or you could make a mess out of this shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "sdk",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Shelf was fairly easy to assemble and came with a lot of extra ...",
      "text": "Shelf was fairly easy to assemble and came with a lot of extra parts (screws, etc.). It is very sturdy and well built and I would definitely recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Milton Moon",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "not that disgusting particle board stuff you'd see at Wal-Mart",
      "text": "Absolutely magnificent book case. The wood is truly real wood, not that disgusting particle board stuff you'd see at Wal-Mart. I set it up quite easily--it took maybe 20 minutes by myself. The instructions were clear and the case is very stable. Great purchase for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Royale",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Very nice product that holds all of my books",
      "text": "Very nice product that holds all of my books. Easy to assemble but you should read the all of the instructions before you start. I'm happy with the price and overall quality.",
      "rating": 5.0,
      "verified": true,
      "author": "BronxxGirl",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "Great shelf",
      "text": "This ladder is really nice. It is real wood and is very sturdy. Assembly wasn't too hard, it took me less than an hour. The color I just can't get over, it is really pretty and looks better than the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "High Quality At An Incredible Price",
      "text": "It's amazing how something of such high quality can be so inexpensive. I bought two, and they look modern and beautiful side by side as a display for collectibles. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Truth Seeker",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Nice to look at and no problems with the finish",
      "text": "Nice to look at and no problems with the finish, but it's very lightweight and rickety. I won't return it or get rid of it, but I definitely wouldn't buy it again. It wobbles badly at the slightest touch.",
      "rating": 3.0,
      "verified": true,
      "author": "H. White",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Beautiful piece of furniture",
      "text": "Beautiful piece of furniture. Assembled by my 15 year old daughter. It's sturdy and sleek. Missed one star because one screw was not lining up so it sticks out a bit under the shelf. Otherwise totally love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ricqi",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "High quality, especially for the low price.",
      "text": "Beautiful shelf, high quality for the low price. But follow the instructions carefully, there is a risk that you may damage the shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Hammad",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "They go together well and are very sturdy. Well worth the money",
      "text": "I have two of these. They go together well and are very sturdy. Well worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Feet",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "This has been great for my 12 year old son's room",
      "text": "This has been great for my 12 year old son's room. Holds lots of books and knick knacks. Was easy to assemble. Only thing that would make it better is if it would dust itself....",
      "rating": 5.0,
      "verified": true,
      "author": "Livelovelaugh",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Coloring and quality are really nice. Feels sturdy when put together",
      "text": "Coloring and quality are really nice. Feels sturdy when put together, easy to assemble. Feels a little tippy on high pile carpet, but there is hardwear to secure it to the wall included.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne L.",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Beautiful addition to our home",
      "text": "Well made, does not look cheap. Matches our furniture perfectly. Took 45 minutes to assemble. Slightly challenging to assemble. Beautiful addition to our home. Will order more very soon. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "colette",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Perfect, beautiful wood",
      "text": "I love these, they take a while to put together but look absolutely lovely in my home. I have 4, 2 in my living room and 2 in my study",
      "rating": 5.0,
      "verified": true,
      "author": "Sydney Aiken",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "Great bookshelf. It is very sturdy",
      "text": "Great bookshelf. It is very sturdy, spacious, and really easy to move once assembled. I had some difficulty assembling it so I suggest having some extra tools handy or another person to help out if you're a novice.",
      "rating": 5.0,
      "verified": true,
      "author": "Gonzalo",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Nice bookcase, good value",
      "text": "Nice bookshelf. Decent wood grain, decent finish and easy to assemble. The color is good, rich and dark. Assembly is with screws and locking pins similar to Ikea furniture. It is a nice fit in our house.",
      "rating": 4.0,
      "verified": true,
      "author": "Glenn A. Hendricks",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "You get what you pay for",
      "text": "Ordered 3, only received 2. As for the 2 that did show up, both shipping boxes were damaged, holes are not predrilled in the right places, some of the decorative bars on the back side are longer than others, one whole side of the ladder shelf is cracked, and the fumes from this is overpowering. The other critical remarks and reviews are correct. You get what you pay for. If you are lucky enough to received undamaged items, these could be quite lovely. That unfortunately not my experience. However, Amazon customer service is replacing these items. I hope the second round arrives in good shape.",
      "rating": 1.0,
      "verified": true,
      "author": "LMM",
      "helpful_votes": 3,
      "publication_date": 20150211
    },
    {
      "title": "These bookcases are beautiful. They are pretty simple to put together",
      "text": "These bookcases are beautiful. They are pretty simple to put together. They are a little wobbly, but they do come with wall anchors. Lots of storage space.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "This shelf looks great and holds a lot",
      "text": "This shelf looks great and holds a lot. All 5 shelves are deep enough for books. They assemble easily and quickly and feel sturdy even, before and after being loaded with books.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Very nice looking and solid !",
      "text": "A friend of mine easily put this together for me. Very nice looking and solid ! No wobbles at all. It holds my CD'S, DVD'S, Books and pictures with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Butterbean's Mom",
      "helpful_votes": 0,
      "publication_date": 20160116
    },
    {
      "title": "good materials - all wood, stained",
      "text": "it's a good solid bookshelf. easy to put together. the metal screws are on the week side - I stripped three when the pre-drilled hole was not quite right...but used pliers to finish. But all good. Looks nice. The photo's color is true.",
      "rating": 4.0,
      "verified": true,
      "author": "Marc J. Vandenplas",
      "helpful_votes": 0,
      "publication_date": 20130821
    },
    {
      "title": "Good purchase",
      "text": "Wow, gorgeous shelves! I bought this one because it was 30 inches wide, which was wider than most of the other ladder shelves, so it would hold more of my books. Very happy with this book shelf!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily G.",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Five Stars",
      "text": "Beautiful product and well made. Had to buy two to complete the look!",
      "rating": 5.0,
      "verified": true,
      "author": "Ana R",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Well worth the price.",
      "text": "Great piece of furniture. Real wood! Well made, solid and stable. Adds a unique look to any room. Very functional.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Dolley",
      "helpful_votes": 0,
      "publication_date": 20170208
    },
    {
      "title": "Other than that beautiful shelf with easy instructions",
      "text": "The brackets to add extra support were very difficult to put in at the point the instructions tell you to. ended up cracking the middle shelf because of the angle I had to screw in. Other than that beautiful shelf with easy instructions.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Flowers",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "otherwise very nice product.",
      "text": "a little difficult to put together, otherwise very nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol Loffredo",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Looks great",
      "text": "This ladder bookcase is beautiful. Simple and modern. Easy to assemble. I like how it makes a small bedroom feel 'light', as it's not a lot of furniture.",
      "rating": 5.0,
      "verified": true,
      "author": "vivie",
      "helpful_votes": 0,
      "publication_date": 20150830
    },
    {
      "title": "Very Happy",
      "text": "This shelving unit is the perfect deep dark Brown to complement the nearly vanity. Shelves are sturdy and solid so I do not have to be concerned about what I stack on them. I believe it would be very suitable in a kitchen pantry. Assembly is not complecated but pay attention to the location of the predrilled holes when dry fitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Moosman",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Good but hard to assemble",
      "text": "The shelf itself is good, but it is so frustrating to assemble....when I tried to attach bracket there was just not enough space to screw",
      "rating": 3.0,
      "verified": true,
      "author": "Kiki C",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "The product is great despite minor cosmetic and assembly flaws",
      "text": "The product is great despite minor cosmetic and assembly flaws. It is sturdy enough to hold a bunch of books.",
      "rating": 4.0,
      "verified": true,
      "author": "Sky Walker MS",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Very Well Crafted!!!",
      "text": "WOW! I really expected these to be a cheap wood like material, NOPE! They feel solid wood and seem to have come freshly stained. Both sides of the shelves and stands are finished smooth wood. No exposed MDF! I really love these a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Ochoa",
      "helpful_votes": 10,
      "publication_date": 20150521
    },
    {
      "title": "Nice & Sturdy",
      "text": "Love these in our home office and they are so easy to install. Great quality and price",
      "rating": 5.0,
      "verified": true,
      "author": "KLS",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "I was able to leave off one shelf on one of them for my taller collectibles and it still looks great. The color is nice and asse",
      "text": "I bought two. I was able to leave off one shelf on one of them for my taller collectibles and it still looks great. The color is nice and assembly was easy.",
      "rating": 4.0,
      "verified": true,
      "author": "sandybeliever",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "good product.",
      "text": "i am well please with this. it is sturdy and well made. A little confusing in the directions, but it went together easily with the exception of the final attachments .",
      "rating": 5.0,
      "verified": true,
      "author": "Betty in NC",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Five Stars",
      "text": "love it!. I use it for my kids toys to organize.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Velasco",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Shipped and beautifully packaged. This was very easy to put together ...",
      "text": "Shipped and beautifully packaged. This was very easy to put together and the included wall anchors are great. The wood quality is solid and we're happy with the sturdiness of the piece. We have two next to each other and it looks great. It was a little shorter than I thought by looking at the image...be smart and check the height before you order. Overall, very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "FilmTVTeach",
      "helpful_votes": 0,
      "publication_date": 20151015
    },
    {
      "title": "This is beautiful. Had my super smart 13 year old put ...",
      "text": "This is beautiful. Had my super smart 13 year old put it together... Took him hours...great summer activity! Lol. But the shelves are Gorg!",
      "rating": 5.0,
      "verified": true,
      "author": "Marc J Kobayashi",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Looks great and sturdy ~ about 30 minutes to assemble",
      "text": "Item came well packaged with no damage. Looks great and sturdy ~ about 30 minutes to assemble. I was able to do it on my own. Very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "No idea why this got such good reviews. Impossible to insert cheap screws without stripping ...",
      "text": "No idea why this got such good reviews. Impossible to insert cheap screws without stripping them or drilling a larger hole.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Five Stars",
      "text": "Nice color. Fast shipping. The shelves are necessary for me like a student",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Five Stars",
      "text": "This was easy to put together and is definitely of a better quality than similarly-priced IKEA products.",
      "rating": 5.0,
      "verified": true,
      "author": "IveGotSomethingToSay",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Easy Assembly.",
      "text": "Easy Assembly.. by myself. I purchased (2) very attractive modern look. has a great dark walnut color. Highly Recommend & would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "WendylmR",
      "helpful_votes": 0,
      "publication_date": 20140930
    },
    {
      "title": "Good product, real wood",
      "text": "Good product, real wood. Simple to put together, but plan on spending 30 minutes with a cordless drill. Looks nice too.",
      "rating": 4.0,
      "verified": true,
      "author": "Theo",
      "helpful_votes": 0,
      "publication_date": 20151128
    },
    {
      "title": "Perfect For the Corner",
      "text": "Easy assembly. Fits perfect in the corner where I wanted to place it. Decided to use the shelves for pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "S.M.Morris",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Looks good, but it pretty wobbly",
      "text": "Looks good, but it pretty wobbly. I followed all of the instructions when assembling. It was pretty easy to assemble, but I wouldn't load it up too much with books, I have maybe a handful of books and decor items on it and it's already got it's gangster lean on.",
      "rating": 3.0,
      "verified": true,
      "author": "Alison Z",
      "helpful_votes": 2,
      "publication_date": 20150522
    },
    {
      "title": "I really love this bookcase - holds a ton and looks fabulous",
      "text": "I really love this bookcase - holds a ton and looks fabulous. It's better than most of this style of furniture that you see at (ex) Ikea or other stores of that type - better quality. No regrets!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160827
    }
  ],
  "product_meta": {
    "title": "Simpli Home Acadian SOLID WOOD 63 inch x 30 inch Rustic Ladder Shelf Bookcase, Bookshelf in Tobacco Brown with 5 Shelves, for the Living Room, Study and Office",
    "description": "Color:Rich Tobacco BrownSometimes a room calls for a light and airy touch. The Acadian Ladder Shelf Bookcase is easy to assemble, easy to install and beautiful to behold. The unit can be used alone or in multiples to create a wall storage system. With its four shelves, this ladder shelf is designed to have flexible storage for books, curios, accessories, sculptures or decorative accents. Perfect for living rooms, offices, bedrooms, hallways and family rooms.; Efforts are made to reproduce accurate colors, variations in color may occur due to computer monitor and photography; At Simpli Home we believe in creating excellent, high quality products made from the finest materials at an affordable price. Every one of our products come with a 1-year warranty and easy returns if you are not satisfied",
    "rating": 4.4,
    "feature_bullets": [
      "Handcrafted with care using the finest quality solid wood",
      "Hand-finished with a Dark Tobacco Brown stain and a protective NC lacquer to accentuate and highlight the grain and the uniqueness of each piece of furniture.",
      "Designed with five (5) wide shelves to offer ample room for storage",
      "Created to be used on its own or in multiples to create full wall shelving systems"
    ],
    "specifications": {
      "Product Dimensions": "16 x 30 x 63 inches",
      "Item Weight": "31 pounds",
      "Manufacturer": "CCT Global Sourcing",
      "ASIN": "B00839JIX0",
      "Item model number": "AXSS008KD",
      "Customer Reviews": "4.4 out of 5 stars261 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#206,147 in Home & Kitchen",
      "Finish Types": "Espresso",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "We guarantee this product's workmanship and material quality for 6 months from the date of purchase, assuming normal use. Please contact our customer care center for questions regarding product guarantee.",
      "Number of Shelves": "4",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Kids' Furniture",
      "Bookcases, Cabinets & Shelves",
      "Furniture"
    ],
    "price": ""
  }
}