{
  "website_summaries": [
    {
      "verdict": "Space-saving plyometric box/platform featuring three quick-to-adjust height levels with telescopic legs. Popular choice for home training.",
      "pros": [
        "Legs have non-marking rubber feet to prevent sliding and damage to floors",
        "Landing surface has a full-coverage nonslip covering",
        "Assembly is simple, and it’s easy to adjust springs and bolts to change jump heights"
      ],
      "cons": [
        "Durable design but not intended for outdoor use or storage"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Terrible",
      "text": "This thing is such a headache to put together. The bits only go so far down on the screws making this product very loose and wobbly. I tried contacting the company for help but did not receive a response.",
      "rating": 1.0,
      "verified": true,
      "author": "Manders",
      "helpful_votes": 7,
      "publication_date": 20180208
    },
    {
      "title": "You'll need different locknuts",
      "text": "Honestly I don't understand why they didn't provide correct locknuts with this bench for assembly. They literally don't go all the way down which means the bench is unstable af. Were bigger locknuts a few cents more? Did the company just want to send us on a side quest before we could get a workout in? Who knows. At the end of the day, it's a bit of a pisser.",
      "rating": 1.0,
      "verified": true,
      "author": "Ionsei H.",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Loud clanging metal sounds",
      "text": "If you are planning to do plyo on this, jump up and down on it, you will hear loud clanging metal-like sounds. I tried working out on this even with music on, the clanging sounds as your foot hits the box gets really disturbing and unbearable. I am planning to sell this one so I can get a better plyo box for my workout. I would never recommend this to anyone. It took so long to assemble it but all the time it wasn't worth it, terrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Corazon",
      "helpful_votes": 5,
      "publication_date": 20161207
    },
    {
      "title": "Missing/unusable parts followed by absent customer service.",
      "text": "Assembly instructions leave much to be desired - it is actually just a diagram. Missing a locknut and one of the screws had a distorted head - unable to use. My husband left a telephone message at the company number. I emailed them. We were disappointed that neither of us received any sort of reply & it's been a couple of days. Had to go out and buy the parts that should been included/usable. The unit is OK but the customer service is a big zero.",
      "rating": 3.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 2,
      "publication_date": 20170621
    },
    {
      "title": "Poor quality and the company does not back up their product.",
      "text": "This box is super heavy and hard to move. The craftsmanship is the part of this that is lacking. We bought this for our daughter and she used it a couple of times and then one of the pins in one of the legs broke. There was no way to fix it because it is one of the buttons that pops in to the hole as you love the leg. We contacted customer service and they would not do anything about it. This jump box is unusable due to one of the legs not locking into place. Save yourself time and look for another box jump.",
      "rating": 1.0,
      "verified": true,
      "author": "Chad",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Good, but top is like sandpaper",
      "text": "I like it. It's sturdy, easy to adjust the height, and has a good sized platform so I don't worry about misstepping. The ONLY downside to it is the top surface. It is rough and scratchy like sandpaper and snags my exercise clothes so when I do things like tricep dips I have to be really careful that my clothing doesn't touch it. I wish they had made it a non slip rubber surface on top. Other than that it is a great piece of equipment.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20151020
    },
    {
      "title": "Adjustable for 2 years - - only.",
      "text": "Bought this in 2015; when set up it is \"rock solid\". After 2 years the height adjustment tension springs in the legs are nonfunctional, so no more height adjustment.",
      "rating": 1.0,
      "verified": true,
      "author": "ohul",
      "helpful_votes": 2,
      "publication_date": 20190204
    },
    {
      "title": "SUPER BEEFY construction",
      "text": "SUPER BEEFY construction. Very heavy metal parts. Nice and adjustable. Assembly was cumbersome. Only 4 stars because the finish had several flaws --nothing to return the product over, but it hurt the aesthetics.",
      "rating": 4.0,
      "verified": true,
      "author": "GRG",
      "helpful_votes": 5,
      "publication_date": 20160206
    },
    {
      "title": "Perfect adjustable step! Very sturdy and heavy duty.",
      "text": "Been needing an adjustable step for a good while and finally purchased this one... it is exactly what I needed/expected! It took my husband and our 8yr old son about 20 minutes to put together. Very sturdy and stays in place for all my HIIT and PLYO exercises. It is loud when jumping up on it but that’s expected since it’s adjustable. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Pollock",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Step away from the Pylobox",
      "text": "I read the mixed review on assembly; I was like it is a bunch of screws how hard could it be. Wasted a hour of my life before I boxed it up to return. There must be something to the amount of washers, I guess I was to keep adding to keep adding washers until the screws are flush. Also the directions are useless, basically build a box with what is in the package.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Installation is a pain and the instructions suck. In addition",
      "text": "I typically don't leave reviews, but need to advise others who purchase this. Installation is a pain and the instructions suck. In addition, once all the sides are on, the top holes don't align correctly (so I drilled out one of the holes so one of the top screws would fit). If it didn't take me an hour to put this together, I would take it apart again and return it. Be warned, the nuts are TIGHT when installing, so you definitely need a Phillips head and a socket wrench to assemble. You can not threat the nut on with your fingers I am very disappointed with the installation.",
      "rating": 2.0,
      "verified": true,
      "author": "Sharkman",
      "helpful_votes": 3,
      "publication_date": 20170108
    },
    {
      "title": "One Star",
      "text": "horrible assembly pieces were missing never used it sitting in my backyard in pieces since i got it.",
      "rating": 1.0,
      "verified": true,
      "author": "Margret",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "Great Product",
      "text": "Assembly. Not difficult. Takes only one person. Make you use both wrench and screwdriver. IMPORTANT: 1. Sort out flat head screws to use with top. 2. Don't tight side panels before you align all legs with top screws. Keep them loose. Once you attach top and tight the screws finish side panels.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 7,
      "publication_date": 20150429
    },
    {
      "title": "This product is terrible. Don’t buy!",
      "text": "The provided screws don’t fit the nuts. They are incredibly tight and as a result I stripped them as I attempted to attach the legs to the top. Now it is a worthless piece of junk. Note to manufacturer: next time test your screws!",
      "rating": 1.0,
      "verified": true,
      "author": "Phil Whitney",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Perfect addition for the home gym",
      "text": "A lot better quality than I anticipated. This is heavy duty metal; very sturdy and is quite heavy. Perfect for a box jumps, step ups, Bulgarian split squats. A perfect addition to any home gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Whostine16",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Its cool",
      "text": "I purchased this item. Seems to be built out of strong material. The instructions sucked, but its sturdy",
      "rating": 4.0,
      "verified": true,
      "author": "robert thompson",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "A little noisy",
      "text": "Great, sturdy box, also the scratchy sand paper top doubles as a bonus foot exfoliater.",
      "rating": 5.0,
      "verified": true,
      "author": "Honeybadger",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "The adjustments provide a good range of different heights",
      "text": "This plyo box is well made and heavy! The top is lined with very coarse sandpaper material that makes sure you don't slip when jumping on it. The adjustments provide a good range of different heights.",
      "rating": 5.0,
      "verified": true,
      "author": "Elise Moore",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Assembly is Easy!",
      "text": "It is well put together item and easy to assemble. The instructional picture is worthless. But there are nine parts and about a thousand nuts, washers, and bolts. I'm an idiot and was able to assemble in about an hour. You only need a Phillips screwdriver and metric socket set (instruction manual shows a wrench, but easiest with a socket set). Also have a second person to hold pieces together is helpful. After the first week it is holding up against the pounding well. It should be around for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Great for working out at home",
      "text": "Great for working out in your home. Wasn't too difficult to put together, just follow the instructions. It is heavy to carry though if you're not used to heavy lifting.",
      "rating": 5.0,
      "verified": true,
      "author": "Mercy",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Especially love the 3 height settings",
      "text": "It's exactly what it should be- sturdy and easy to use. I didn't find the assembly that difficult, and even when I made a mistake it was easy to fix. I've used it to work out many times and have found the non-slip top to be highly effective. To be honest, in my small apartment it is pretty large but I have a convenient place for it next to my dresser and can use it as a stool to reach high shelves! So that's a bonus :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Bowe",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "I like it, but there are some cons",
      "text": "Pros: - Rough surface with plenty of friction - Adjustable - Right heights for me - Stable Cons: - The top has an overhang on every side, so, if you're jumping up on it, you might hit your toes on it while coming up - One of the metal pegs that supports it wouldn't pop back out until I lubed it",
      "rating": 4.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Versatile Plyo Box",
      "text": "I love this little compact plyo box. It adjust to three different levels and each leg adjusts separately, so you can do all sorts of cool exercises with it. It comes with an exercise guide. It is a little heavy to move around, but it's very sturdy. I like that I don't have to have three separate plyo boxes in my small workout room.",
      "rating": 5.0,
      "verified": true,
      "author": "Janell32",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "good quality. Easy to put together/takes about 30 minutes",
      "text": "Box works well, good quality. Easy to put together/takes about 30 minutes. Only problem is the pins that they use to adjust the height of the legs don't work well. They do not pop into place like they should. they move around too much. I had to remove them and I replaced with screws that i just pull in and out of the holes.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Very Well Made!",
      "text": "This is a very well put together product. Made with solid metal material. Very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "finally able to use this and the button locks aren't ...",
      "text": "finally able to use this and the button locks aren't safe, they slides in and you have a tendency of falling for getting out of balance when a foot or two slides down or gets knee injury when in 2nd or 3rd level, i'm still going to use this just for the lowest level",
      "rating": 2.0,
      "verified": true,
      "author": "wiz8ser",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Strong, sturdy",
      "text": "Strong, sturdy, very easy to assemble just look for the 4 special screws that go on top. Why only 4 stars? The non-slip material is very rough on clothes and has already ruined one of my crop pants. I use the box to also lacrosse ball my hamstrings, glutes, etc. I guess the makers never thought anything other than shoes would touch it. Honestly, it's the best box.",
      "rating": 4.0,
      "verified": true,
      "author": "Meemo",
      "helpful_votes": 0,
      "publication_date": 20140808
    },
    {
      "title": "Durable",
      "text": "Strong and durable. Was difficult to put together but easier with a drill at a lower speed to really tighten things up.",
      "rating": 4.0,
      "verified": true,
      "author": "Mello",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Five Stars",
      "text": "Great box, very sturdy and heavy. I really love using this thing now.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Okay but needs some QC to get it to elite status.",
      "text": "Feels like it's made of some pretty good stuff. I mean if feels better than most others I've seen. It would have gotten a higher rating (at least 4-stars) but I had to dock a star for sketchy QC (holes not lining up without working them a bit) and another for a bag of rusted screws to put it together.",
      "rating": 3.0,
      "verified": true,
      "author": "That One Dude",
      "helpful_votes": 10,
      "publication_date": 20151006
    },
    {
      "title": "Pretty hard to assemble",
      "text": "Pretty hard to assemble..THANK GOD I have a persistant partner...but once it was assembled i love it! I try not to excercise while drinking wine because the lowest height is still pretty high, but i can feel it in my glutes just by doing \"marches\" in a fast manner..",
      "rating": 5.0,
      "verified": true,
      "author": "LisaLisa1963",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "very versatile and useful piece of equipment!",
      "text": "I have been searching for a long time to find the right size plyometric step. I train clients privately and bring equipment to their homes and buying 3 or four different steps for varying fitness levels just wasn't practical. This step is extremely heavy duty very sturdy, and surprisingly portable at 30 pounds plus. the lowest step is perfect for step ups, and the highest is perfect for box jumps. Very pleased with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "We are glad we bought this",
      "text": "bought this for my daughter for training for volleyball. This thing is rock solid and very heavy. I know it is meant to be jumped on, but i'm impressed by the build quality. We are glad we bought this. And with the weight, I definitely got my money's worth with free prime shipping on this.",
      "rating": 5.0,
      "verified": true,
      "author": "Sid",
      "helpful_votes": 0,
      "publication_date": 20141206
    },
    {
      "title": "I figure it will be an easy fix down the road",
      "text": "Worried about grip tape on top coming off eventually, the edges have came off a little bit as used. But, I figure it will be an easy fix down the road. I use it for drills with performance junior tennis players, great product. (Explosive Impact Resistance) #getofftheground",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Haag",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "Really nice.  Sturdy and flexible in use.",
      "text": "My 13 year old baseball player is in full off-season training mode and this adjustable box is used a few times per week for many different plyo and ballistics work outs. Very sturdy and being able to adjust the height and angles opens up a lot of different training options.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Boyce",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "Great plyo box!",
      "text": "Good quality construction, nice range of adjustable heights. Solid and stable. exactly what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "jdhesso",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "HAVE AN EXTRA SIDE PANEL IF YOU WANT IT!",
      "text": "nice product. i bought it used, like new. baggy with the nuts, screws and washers was open in shipping box, so they were all over the place. i prepared for some to be missing. i was short 2 nuts and 2 washers. didn't have any problems putting it together, after finding missing hardware in my \"private stock.\" i used a screwdriver and ratcheted the bolts--screws did not strip. interesting thing: they sent me an extra side panel. i have 5! look me up if you want it. somebody's got to be missing one!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Howard",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Amazing jump stand for the price",
      "text": "Amazing jump stand for the price. Putting it together is a little rough but after that it's smooth sailing. Very sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "gift for husband",
      "text": "I bought this for my husband for Christmas to add to his home gym. It did need to be assembled but didn't take too much time or too many tools to do so. It is very sturdy and can be adjusted to 3 different levels. We use it for step ups and box jobs and it has been great!",
      "rating": 5.0,
      "verified": true,
      "author": "kblack",
      "helpful_votes": 0,
      "publication_date": 20140126
    },
    {
      "title": "I like the construction and it feels very sturdy when jumping ...",
      "text": "I like the construction and it feels very sturdy when jumping on it. One main problem is the assembly required. This is a two person job and takes a bit of time even with two. The legs could adjust more easily for my taste, but overall is a good adjustable base. If you are buying this for convenience, beware the tedious assembly process.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Durable and flexible",
      "text": "I initially debated about getting a box with adjustable legs, having some concern about durability versus fixed boxes. This box is very well constructed and easy to assemble. The adjustable legs allow for easy change of hight between use by me and my wife. The non-slip surface on top is also a nice addition for safety.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad Anderson",
      "helpful_votes": 2,
      "publication_date": 20141029
    },
    {
      "title": "three stars",
      "text": "Sturdy item. Works well, BUT after 7 months pin broke on one leg that locks leg into desired height. Company would not stand behind product.. Metal pin just snapped , metal fatigue .. Finally Amazon help had to purchase part and Amazon re embursed me",
      "rating": 3.0,
      "verified": true,
      "author": "lf",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Sturdy, Solid.  No Directions",
      "text": "Very sturdy. Simple to extend legs. The only downside is it does not come with assembly instructions. It only has 2 screw types but still, they managed to print a 2 page parts chart but no directions.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul L",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Easily adjustable. The price is awesome",
      "text": "Well built from metal. Easily adjustable. The price is awesome. You would have to buy 3 different boxes costing you triple the price to do what this does.",
      "rating": 5.0,
      "verified": true,
      "author": "Rolland Briggs",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Sturdy- difficult to assemble alone.",
      "text": "Was touch to assemble by myself- but once put together it is super sturdy- and it weighs a ton 😂 but def worth it.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison W",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "But very sturdy construction. The side plates were a little scratched ...",
      "text": "a little bit smaller than I imagined. But very sturdy construction. The side plates were a little scratched up. Also came in dark grey instead of black like pictured here",
      "rating": 4.0,
      "verified": true,
      "author": "Elbert",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "This box is awesome",
      "text": "There is nothing on the market at this price, and the quality is great. Heavy duty, and good friction on the top surface. Building it is a breeze. Very happy with this purchase. I bought it used, but it seemed to be in new condition - even better!",
      "rating": 5.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Solid, durable - very pleased",
      "text": "Constructed of all metal, this is really stable and durable. Putting it together might go faster with 2 people since the pieces are heavy. This was a gift for my husband for the CrossFit box jump exercises he does, and he thinks it's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie C.",
      "helpful_votes": 0,
      "publication_date": 20140823
    },
    {
      "title": "I especially like the rough surface for when I do elevated bridges ...",
      "text": "Rock solid box. I only weigh 155 pounds, but I'm sure any larger person would feel the same. It's very stable! I especially like the rough surface for when I do elevated bridges because it helps to keep my feet in one place.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Poor customer service",
      "text": "Athlete jumped on box to pushpins gave. Filled out warranty paperwork still have not heard back. Multiple phone calls placed as well.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "Fantastic product. Easy to put together even though the ...",
      "text": "Fantastic product. Easy to put together even though the directions don't really help. Great value with the 3 heights and the ability to do side jumps. Way more solid than anything I could have built on my own.",
      "rating": 5.0,
      "verified": true,
      "author": "hey Sacha",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Adjustable box.",
      "text": "Wow! When I lifted the box I was surprised how heavy it was. All parts we there and it went together easily. Rugged,sturdy and adjustable. Very pleased and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "Solid Material",
      "text": "This is perfect for a woman or teenager. Easy to put together and sits solid on the ground.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "but overall this is a great product.",
      "text": "This has really solid build quality. I wish the top corners were machined smother instead of being so pointy and sharp, but overall this is a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151009
    },
    {
      "title": "Five Stars",
      "text": "Very heavy duty! My family will be using this for a while",
      "rating": 5.0,
      "verified": true,
      "author": "Leah1980",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Very Solid",
      "text": "We have been using this product for several weeks, especially my son who plays football and basketball. Very good for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 2,
      "publication_date": 20131028
    },
    {
      "title": "Great product!",
      "text": "This was a Valentine's Day present for the husband. He LOVES it! Sturdy, even, easy to adjust for different movements. Exactly what was described and what was wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "One Star",
      "text": "0ne tab would not stay out, therefore it is not adjustable.",
      "rating": 1.0,
      "verified": true,
      "author": "Roy Murrell",
      "helpful_votes": 2,
      "publication_date": 20171121
    },
    {
      "title": "Good quality and awesome 3 different height design",
      "text": "Bought this for my commercial gym, and the 3 different height settings are great! This gets tons of use, and has held up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "nichole83",
      "helpful_votes": 0,
      "publication_date": 20140922
    },
    {
      "title": "Five Stars",
      "text": "VERY sturdy and heavy. It's a great piece to add to our training equipment",
      "rating": 5.0,
      "verified": true,
      "author": "Vicky",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "amazing",
      "text": "I get asked all the time where I got it. It is way more durable/sturdy than I imagined it would be. Having the 3 different height settings is awesome. Probably one of the best fitness purchase's I've made in a long time",
      "rating": 5.0,
      "verified": true,
      "author": "Bri Guy",
      "helpful_votes": 0,
      "publication_date": 20140528
    },
    {
      "title": "Five Stars",
      "text": "Very easy to adjust. Extremely robust & steady. Great non-slip surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Eike Franz",
      "helpful_votes": 0,
      "publication_date": 20161209
    },
    {
      "title": "Made in China (Translation: Parts Don't Fit)",
      "text": "Made in China. Should have known better than to roll the dice. This might be the greatest plyometric workout product in the world, but you'd never know it -- because all 20 nuts provided by the manufacturer don't fit the bolts that are crucial to assembling the darn thing. Not a single component of this product can be attached to another component. This is beyond bad quality control. It's zero quality control. Time for a trip to the hardware store to buy replacement nuts and bolts.",
      "rating": 1.0,
      "verified": true,
      "author": "DE area resident",
      "helpful_votes": 3,
      "publication_date": 20160605
    },
    {
      "title": "But very sturdy and good product for the price",
      "text": "A bit of a pain to put together. But very sturdy and good product for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Five Stars",
      "text": "Excellent box, never wobbles and the tack for you shoes is great. Isn't too heavy either.",
      "rating": 5.0,
      "verified": true,
      "author": "Lebron0wnage",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "A Couple of Quality Issues But Decent Overall Value",
      "text": "The nuts and bolts that came with it weren't made properly and didn't fit together (the original washers were fine). I eventually had to go to Home Depot and buy replacement ones for under $10. Besides that and assembly instructions that could be much better, it's worked well once assembled.",
      "rating": 3.0,
      "verified": true,
      "author": "E. Bradley",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Very sturdy and easy to adjust",
      "text": "I jump up and down on this all the time. Very sturdy and easy to adjust.",
      "rating": 5.0,
      "verified": true,
      "author": "ashlel",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Ajustable plyometric box a winner !",
      "text": "I bought this adjustable plyometric box so I wouldn't have to drag multiple boxes to practice. Solid build with non-slip feet and surface. Excellent product !",
      "rating": 5.0,
      "verified": true,
      "author": "jimmie  yuen jr.",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "Strong and well made. Super deal",
      "text": "The tasty colors and design belie a very strong, heavy platform. Versatile and functional, this box is a great space saver and useful fitness tool.",
      "rating": 5.0,
      "verified": true,
      "author": "rand camp",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "Five Stars",
      "text": "nice and solid, love the adjustability for me and my wife to share",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Very sturdy. I am 150 pounds and my husband is ...",
      "text": "Very sturdy. I am 150 pounds and my husband is 215. We both feel very comfortable exercising on this platform.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Study / not perfect",
      "text": "Very sturdy - not flimsy at all. Took off a star because the sides did not fit ideally - needed to be pressured into place. Has a little bowing but not much. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicolas Molina",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Four Stars",
      "text": "Love this plyo box! Instructions could have been better. I had to just figure out the steps myself.",
      "rating": 4.0,
      "verified": true,
      "author": "Peaches",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "this thing was sturdy as anything",
      "text": "Hard to assemble. Once built, this thing was sturdy as anything. We tried another brand and will go back to this one given how solid it is",
      "rating": 4.0,
      "verified": true,
      "author": "MTL-DAN",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "Sturdy",
      "text": "sturdy, heavy and no sense of instability. One problem with the leg is that when I put it in my garage it took the paint off the garage floor. not a big deal, I just won't put it there. Or place a mat under the legs if you place on a painted garage floor",
      "rating": 5.0,
      "verified": true,
      "author": "LamFam",
      "helpful_votes": 0,
      "publication_date": 20140524
    },
    {
      "title": "This was GREAT, but I don't like how easily the grip ...",
      "text": "This was GREAT, but I don't like how easily the grip tape on top chips off the corners, & sides.",
      "rating": 5.0,
      "verified": true,
      "author": "Physman",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Super easy to put together! you will be pleased.",
      "text": "Super sturdy. come with a workout poster. Great addition to our gym.",
      "rating": 4.0,
      "verified": true,
      "author": "krenoline",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Would give five but",
      "text": "Great item, package was broken a leg was damaged (pin does not hold leg in place)",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "this is good for the glutes!",
      "text": "The product is great - but the directions aren't clear as to posting the washers on both sides.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Yaffe",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Heavy and sturdy",
      "text": "I liked this item a lot. Despite the weight you know it is not going to give under your weight. I love and continue to use for all types of exercises.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20140402
    },
    {
      "title": "Great Exercise BoX",
      "text": "My son has been using it for a few weeks with no problems. Very sturdy. My husband put it together in 10 minutes with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake's Mom",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Addition to my home gym",
      "text": "This serves the purpose I got it for and is great for my home gym - it is sturdy and a lot easier than building one!",
      "rating": 5.0,
      "verified": true,
      "author": "PIP",
      "helpful_votes": 0,
      "publication_date": 20131223
    },
    {
      "title": "Works just like it should",
      "text": "Was missing a screw, but we just found one in our house. Works just like it should, love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles V. Jones",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "... pain to get together by myself but it works great and I absolutely love it",
      "text": "This thing was a pain to get together by myself but it works great and I absolutely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Mactíre",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "GREAT",
      "text": "arrived on time and in perfect condition. extremely sturdy (i weigh 230lbs and generally use a 40lb vest when using this box). The lateral adjustment (rear legs of box set higher than front two legs of box) is a great option and very sturdy!! I would highly recommend this adjustable plyo box to anyone looking to add a heavy-duty plyo box to their homegym!!",
      "rating": 5.0,
      "verified": true,
      "author": "IBuyWayTooMuchStuff!!",
      "helpful_votes": 7,
      "publication_date": 20130923
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy product for the price. Great quality. No difficulty putting item together as prior reviews reported",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Love it",
      "text": "Fantastic. Don't know why I have waited so long to buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "sh3",
      "helpful_votes": 0,
      "publication_date": 20150825
    },
    {
      "title": "Sturdy, solid",
      "text": "Sturdy, solid. Easy adjustments. Well machined. Don't tighten all of the bolts until you have them all started. Good equipment for the price!!",
      "rating": 5.0,
      "verified": true,
      "author": "jmpml0001",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Five Stars",
      "text": "Love this piyo box heavy, sturdy, perfect 180lbs and holds up perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth danielle pendygraft",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Dangerous!!!!  SECOND Adjustable leg pin broke durinfg use!!!!!",
      "text": "****Update**** June 13, 2016 - since my first review, we had another mishap with the poorly design jump box. Yesterday while using it one of the spring pins broke while in use sending me tumbling to the floor. I seriously want my money back on this amazon. If I sustain any serious injuries using this I will include AMAZON in the lawsuit. Disappointed, while adjusting the legs to a different height one of the spring loaded pins broke off. No way to re-attach it. Do they make a replacement part?",
      "rating": 1.0,
      "verified": true,
      "author": "T. Larson",
      "helpful_votes": 3,
      "publication_date": 20160524
    },
    {
      "title": "Five Stars",
      "text": "Given as a gift to my Husband and he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy McBath-Brown",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Awesome piece of equipment",
      "text": "Easy to put together and easy to use all three levels....a must for home gyms",
      "rating": 5.0,
      "verified": true,
      "author": "Lala",
      "helpful_votes": 0,
      "publication_date": 20161102
    },
    {
      "title": "but works great. I've used it for several months now with ...",
      "text": "This is well constructed and heavy duty. Takes about 30 minutes to assemble, but works great. I've used it for several months now with no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "cwh4",
      "helpful_votes": 0,
      "publication_date": 20150329
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy and easy to use. Exactly what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Hills",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "so good. Works great for my at home workouts",
      "text": "So far, so good. Works great for my at home workouts.",
      "rating": 4.0,
      "verified": true,
      "author": "Tondalea",
      "helpful_votes": 0,
      "publication_date": 20160225
    },
    {
      "title": "Perfect size",
      "text": "THis is durable, great size and my hubby loves it for his workouts. Amazing price compared to other athletic stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "I'd recommended it. It's study and does the job",
      "text": "For the price, I'd recommended it. It's study and does the job. Would Recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "After assembling the box we found that one of the ...",
      "text": "After assembling the box we found that one of the spring pins on the adjustable leg does not function correctly. As a result the leg does not lock in place when you adjust it. VERY dangerous.",
      "rating": 1.0,
      "verified": true,
      "author": "David H",
      "helpful_votes": 14,
      "publication_date": 20170320
    },
    {
      "title": "Volleyball help",
      "text": "These are great! I am using them to increase our vertical jump in volleyball. Assembled with ease, very sturdy, and bottom is well protected to protect floors. They are heavy, be careful when lifting to move.",
      "rating": 4.0,
      "verified": true,
      "author": "Maw Hall",
      "helpful_votes": 2,
      "publication_date": 20140129
    },
    {
      "title": "Great Box!",
      "text": "Little tricky to assemble, but very solid and works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160915
    }
  ],
  "product_meta": {
    "title": "Fuel Pureformance Adjustable Plyometrics Box",
    "description": "The Fuel Pureformance Adjustable Plyometrics Box is a must-have training tool for explosive jumps and speed training. Plyometrics training is great for improving explosiveness, speed and vertical jump. Athletes of all levels use these boxes for forward, lateral, and other plyometric jumping drills. Increase not only in your vertical jumping ability, but also drastically increase foot speed, cardiovascular endurance, overall leg strength and health. The number of exercises you can perform are endless and only limited by your creativity. Ahtletes of all levels can improve performance and increase speed agility and all around fitness levels with plyometric training. This plyo box is adjustable to three heights: 14\", 18\" and 22\". The non slip landing surface is 16\" x 16\". Designed with quick spring button adjustment for easy and fast adjustments. Constructed with non marking rubber feet, powder coat finish and convenient space saving design.",
    "rating": 4,
    "feature_bullets": [
      "CONSTRUCTION: Built with steel and finished in a blue and black powder coat, this plyometrics box is built to withstand explosive jumps and speed training; This is a great tool for cardiovascular endurance speed and agility training, and vertical jumps",
      "MUTLI LEVEL DESIGN: This plyometrics box from Fuel Pureformance adjusts to THREE different heights: 14 inches, 18 inches, and 22 inches; Simply use the quick spring button to adjust the height",
      "NON MARKING FEET: Featuring rubber feet on the bottom, this plyometrics box will not scratch or damage your floors and ensure the box stays in place",
      "NON SLIP SURFACE: The non-slip landing surface ensures your feet will not slip once you have jumped on top of this plyometrics box; The non-slip surface is 16 inches x 16 inches",
      "SPECS: Dimensions are 2. 87 inches length x 20. 87 inches width x 22. 24 inches height; Plyo box weighs 32 pounds; Comes with a 30 day manufacturer’s"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "19 x 17.6 x 4 inches; 33.95 Pounds",
      "Item model number": "FM-FLPLYO",
      "Department": "Unisex-adult",
      "Date First Available": "June 26, 2012",
      "Manufacturer": "CAP Barbell",
      "ASIN": "B008F48BEK",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Accessories",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Step Platforms",
      "Sports & Fitness"
    ],
    "price": 179.99
  }
}