{
  "website_summaries": [
    {
      "verdict": "A bright, fast lens with a high-end build, the Olympus M.Zuiko 75mm f1.8 is a great option for portrait photographers shooting with Micro Four Thirds cameras.",
      "pros": [
        "The Olympus M.Zuiko 75mm f1.8 delivers generally excellent optical performance in a well-constructed lens"
      ],
      "cons": [
        "The manual focus ring feels a little too loose"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 8.0,
        "Image quality": 8.0
      },
      "publication_date": 20120802,
      "rating": 8.0,
      "source": "cnet"
    },
    {
      "verdict": "The Olympus M.Zuiko Digital ED 75mm F1.8 lens is a fast telephoto lens for Micro Four Thirds cameras. It produces extremely sharp images, and the f/1.8 aperture makes it possible to blur the background behind your subject.",
      "pros": [
        "Very sharp",
        "Smooth, creamy bokeh"
      ],
      "cons": [
        "Pricey",
        "Doesn't balance well on small Micro Four Thirds cameras",
        "Hood not included"
      ],
      "aspects": {},
      "publication_date": 20130814,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "This lens keeps me to stay in MFT system.",
      "text": "I have been debating whether to go to FF or APSC sensor size due to DOF and low light performance of them. This lens I bought used through Amazon (seriously like new at 2/3 price). The result I love so much that I am keeping my MFT system. I'm just going to buy other lenses like 17mm f1.2 or even manual lens like Voigtlander 17.5mm f0.95 to work on the low light and DOF performance. Some exerts say this lens is one of the sharpest lens wide open on any system combined.",
      "rating": 5.0,
      "verified": true,
      "author": "Tae K. Nam",
      "helpful_votes": 10,
      "publication_date": 20171114
    },
    {
      "title": "My Benchmark Lens.",
      "text": "I bought this primarily to use as a portrait lens. I have found more uses for it than that. As mentioned, the lens is razor sharp, the AF very fast and accurate on my EP5.The micro contrast makes this lens stand out from my other primes - 25mm, 45mm and better than my 12-40mm.",
      "rating": 5.0,
      "verified": true,
      "author": "1inventorTop Contributor: Photography",
      "helpful_votes": 27,
      "publication_date": 20151003
    },
    {
      "title": "interesting portrait option, well-built",
      "text": "Too pricey to buy new but I found a good one used and it has been great. Given the perspective and the f1.8, it's pretty light and seems to fit the ethos of m43 well. Well-built and super sharp. Mainly I use this when I need some degree of reach, shallow depth of field for a headshot or when I want to create images that have a cinematic feel. Not saying you can't do those things with other lenses and/or formats, but for me, this lens seems to serve those purposes well for this format.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Symonds",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Fantastic portrait lens",
      "text": "WoW this lens looks so good on my Pen F and the images are simply amazing. Best buy on a lens ever. For me this almost exclusively is a portrait lens and it kind of mimics the old 135mm lenses from back in the 35mm camera days. Fantastic Bokeh and with a shallow depth of field when opened to f 1.8 and taking close up head shots and shoulder length etc. Simply perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Breedlove",
      "helpful_votes": 3,
      "publication_date": 20170331
    },
    {
      "title": "Wonderful lens!",
      "text": "You're probably reading this because your pondering the purchase. If you're wondering about image quality and build, stop - it's awesome. It takes amazing pictures, and the construction is top notch. If you're wondering about how it will fit into your current mix of lenses, don't think too hard - it will quickly find it's niche with you. It's a lovely 150mm equivalent portrait lens. If it's the money - well, just don't tell your spouse that you bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ventiphoto",
      "helpful_votes": 24,
      "publication_date": 20131109
    },
    {
      "title": "Great lens",
      "text": "If you buy one used like i did make sure there are pictures of it, the description did not do a good job describing the damage to the body of the lens.",
      "rating": 4.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Wonderful",
      "text": "The sharpest lens I own (including the full-frame 35mm stuff that I sold a year ago), and beautiful bokeh, too. I use it a lot for portraits. The only downside is that, being equivalent to 150mm in full-frame, it's often a bit \"long\" for many uses. That said, I do try extra hard to use it more often, since I am so pleased with the results. Not the first lens I'd get for a Micro 4/3ds system (I think I'd go for the Panasonic 20mm f/1.7, or the Pana-Leica 25mm f/1.4), but well worth having as you expand your system.",
      "rating": 5.0,
      "verified": true,
      "author": "Ski Addict",
      "helpful_votes": 6,
      "publication_date": 20131228
    },
    {
      "title": "Well worth every penny!",
      "text": "To attempt to avoid the normal $899 price on this lens I tried to get by with a Rokinon 85mm Cine T1.5 lens. I liked the Rokinon well enough but stills did not quite match what Robin Wong in Kuala Lumpur shot with the Oly 75mm when Olympus Malaysia loaned him a copy to test out and review on his blog. I've been \"drooling\" over the images he got with it for over a year so I sold the Rokinon and ordered this one. The quality is nothing short of outstanding.",
      "rating": 5.0,
      "verified": true,
      "author": "Bif",
      "helpful_votes": 4,
      "publication_date": 20131011
    },
    {
      "title": "met already high expectations",
      "text": "Nice bokeh, tack sharp wide open, shallow DoF possibilities (I like to stop down a few for shorter distance headshots, f1.8 is too shallow)...previous reviews have pretty much covered it. I also purchased a B+W 58mm 010M UV Haze filter to help protect this fine piece of glass. I've been using this on my Panasonic GF-1 (1st gen m4/3 body). AF is fast, though it does hunt or give up in low light, probably less of a problem on the newer m4/3 bodies.",
      "rating": 5.0,
      "verified": true,
      "author": "32 Win Spl",
      "helpful_votes": 7,
      "publication_date": 20130910
    },
    {
      "title": "A very very good lens.",
      "text": "This lens reminds me of my canon L series lenses. Extremely good quality materials and the picture quality is super good. I would highly recommend for portrait use.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Magical Portrait Lens",
      "text": "I hesitated to buy this lens. I kept telling myself the 45mm was fine. But I had the 45 mm and sold it because I wasn't all that impressed with the images. Now that I'm doing more portrait photography, I was going to buy the 45 again. I'm glad I went with the 75. Even though it's a little awkward for portraits (you have to have some distance), what you get is absolutely gorgeous. Plus, this is a great lens for landscape and even telephoto shots. It's a bit heavy, but the solid construction makes the weight worth it. I love this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Pigott",
      "helpful_votes": 6,
      "publication_date": 20140707
    },
    {
      "title": "Absolute must buy.",
      "text": "I would buy a micro 4/3 camera just to own this lens. It is impressive that such a small lens can render such great images.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr.J",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Good quality lens at a reasonable price.",
      "text": "Easy to carry and able to take all types of pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Miller",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Great Handling, Great Color, Some Work with Focal Length for Local Sports",
      "text": "Of course this lens is sharp. There is also little WB adjustment after (I am surprised that a lens works so well with the camera and under indoor gymnasium lights). F1.8 allows about 1/200 shutter speed and iso about 1250. Great for 7-8 year old wrestling tournament. Even at iso 2500 and NR off, great sharp images....One caveat is the added room needed to maneuver that 150mm FF equivalent. Really satisfied so far...from the perspective of a camera enthusiast who takes many family/kid photos...",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 4,
      "publication_date": 20140202
    },
    {
      "title": "Highly recommended if you like this focal length",
      "text": "A great lens for mid-distance subjects, such as portraits and some sports. Very sharp and fast, yet compact. One caveat: It doesn't focus very closely (0.84m=33\" for maximum image magnification only 0.1x).",
      "rating": 5.0,
      "verified": true,
      "author": "Linux Administrator",
      "helpful_votes": 2,
      "publication_date": 20161029
    },
    {
      "title": "My new go-to lens for pretty much everything",
      "text": "While it is a bit large for my e-pl5, it isn't cumbersome. Takes fantastic pictures. I've got the Olympus 45mm f1.8 and the Panasonic 20mm f1.7. If you've got these three lenses, you've got 75% of your shooting covered. I'm just looking for a fast prime in the 200-300 range and my set will be complete. Of the three, this one is probably my favorite.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Healy",
      "helpful_votes": 3,
      "publication_date": 20121129
    },
    {
      "title": "Absolutely the best m4/3 lens you can buy from Olympus",
      "text": "OMG, what a beautiful lens. The class of the m4/6 line, in my opinion. Well made, beautiful bokeh, with image clarity beyond any other m4/3 lens I've seen. So, so expensive, but it's pro-level glass. The 75mm (150mm eq.) is tight, of course, so it's best for isolating a subject. If you like to shoot that way (i.e., street photography, portraits), this will be your favorite lens.",
      "rating": 5.0,
      "verified": true,
      "author": "sdaniela",
      "helpful_votes": 3,
      "publication_date": 20131104
    },
    {
      "title": "Yes, yes, yes.",
      "text": "Yes, yes, yes. I'm still paying on it, but I like it. It is fast and furious. I am not a professional, but it is good for working indoors in a medium-sized space. You can fill the frame without getting in people's faces.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Brody",
      "helpful_votes": 2,
      "publication_date": 20160501
    },
    {
      "title": "Great lans in small package size",
      "text": "Great lens for getting remote subjects real close, with narrow depth of field or in low light. My only complain is the lack of sun hod protector, and even if i buy one separately, it connects very unnaturally to the lens with the help of a scrow on the hod which locks to the lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Ez",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "This is a recommended lens",
      "text": "If you're into the micro 4/3 format this is a must-have lens. I purchased this lens and love it! it's especially good for low light situations. I would recommend you buy this lens. I also would recommend the Olympus 45 mm the Olympus 12 mm and the Panasonic 8mm fisheye, that gives you a nice see election of primes.",
      "rating": 5.0,
      "verified": true,
      "author": "scallawag",
      "helpful_votes": 0,
      "publication_date": 20131017
    },
    {
      "title": "this lens is amazing. I adore it",
      "text": "Ahhh, this lens is amazing. I adore it. The bokeh is phenomenal. Great wedding lens",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Stunningly sharp",
      "text": "Love this lense ... one of my favorites regardless of system type... so sharp with beautiful bokeh! Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "David Buurma",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Very sharp",
      "text": "Rated as one of the sharpest, if not the sharpest, lens for 4/3 format. Didn't disappoint.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Excellent lens pin sharp and very bright",
      "text": "Excellent lens pin sharp and very bright. Good for so many subjects. Really good in low light A bit on the expensive side but worth every penny. I read the other reviews and mostly they are irght, I would recommend this lens to any Olympus 4/3's user.",
      "rating": 5.0,
      "verified": true,
      "author": "A Gottschald",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "What we were waiting for",
      "text": "After two days, I can confirm that everything they say about this lens is true. Solidly made, quick focusing, sharp as all getout wide open, a bit softer stopped down, but who buys this lens in order to stop it down?",
      "rating": 5.0,
      "verified": true,
      "author": "Magister Ludi",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "Great Lens",
      "text": "The size of this lens is great. It takes very sharp clear pictures. I use it in indoor sports shots and it stops the action perfectly every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Golden Times",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Amazing lens. Perfect for shooting at sports events or ...",
      "text": "Amazing lens. Perfect for shooting at sports events or concerts when you're not too far away from the stage. Beautiful bokeh.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Zehm",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "King of Bokeh",
      "text": "King of portrait, money well spent, you won't be disappointed with this lens.",
      "rating": 5.0,
      "verified": true,
      "author": "dimxum",
      "helpful_votes": 2,
      "publication_date": 20160816
    },
    {
      "title": "Must have for OMD-Em5",
      "text": "Love this lens. Rented it from lensrental and then had to buy it. Great for portraits, super sharp. I'm using it on my OMD-EM5",
      "rating": 5.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Astoundingly sharp lens.",
      "text": "It's all been said before, and it's true. It compares to my Nikkor 70-200 2.8 VR, which says it all (in a much smaller package lol).The only downside is that if you compare it to the other lenses you own, you'll be disappointed in them.",
      "rating": 5.0,
      "verified": true,
      "author": "TravelWriter",
      "helpful_votes": 3,
      "publication_date": 20131229
    },
    {
      "title": "Buy it now!",
      "text": "This is the best portrait prime lens you can buy for the micro 4/3 system. I should have bought this along with the camera a year ago as opposed to separately few months later.",
      "rating": 5.0,
      "verified": true,
      "author": "Krimson",
      "helpful_votes": 2,
      "publication_date": 20151224
    },
    {
      "title": "Highly rated and definitely worth the investment",
      "text": "This is an absolutely fantastic lens. It is tack sharp, heavy and solid. Autofocus is precise and it takes wonderful portraits and pictures. Highly regarded with the F1.8 for lowlight subjects",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis H Linden",
      "helpful_votes": 0,
      "publication_date": 20130321
    },
    {
      "title": "This portrait lens is outstanding",
      "text": "This what my first MFT lens that I bought to go on my Oly M1. The pictures are unreal.",
      "rating": 5.0,
      "verified": true,
      "author": "ftboomer1",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Beautiful lens",
      "text": "The focal length is very specific. Great for portrait or landscape. So, specific use. But, the image quality is second to none. Very beautiful and the rendering is amazing. And I have used some of the best lenses including zeiss 100mm f2, 84mm 1.4, nikon 200mm f2, and nikon 135mm dc all on full frame cameras. This one can compete with those lenses. So, get it if you have MFT camera. This lens is a piece of beauty.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferdi",
      "helpful_votes": 6,
      "publication_date": 20140115
    },
    {
      "title": "Very nice lens",
      "text": "Fantastic little lens. Very small and light as well. The focal length is a little awkward (very long) but this produces some quality images.",
      "rating": 5.0,
      "verified": true,
      "author": "James S. Yelverton",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "Fast and Sharp!",
      "text": "Excellent lens, sharp and fast when used on my E-M1",
      "rating": 5.0,
      "verified": true,
      "author": "Ramachandra Srivatsa",
      "helpful_votes": 3,
      "publication_date": 20160208
    },
    {
      "title": "Awesome lens",
      "text": "This lens is so well constructed, like a tank and it is sharp and has a beautiful bokeh. The focus ring is butterry smooth and just a pleasure to work with. Can't say enough good about this awsome lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Edmond E. Williams",
      "helpful_votes": 0,
      "publication_date": 20130112
    },
    {
      "title": "Love it. Get it. Worth it.",
      "text": "This lens. Probably the best camera acquisition of my short life and I have no regrets in buying what is an expensive but truly exceptional lens. I could complain about how lame it is that it lacks a hood and I've already lost the cap because it is so flimsy but I think about how amazing and how beautiful my shots are and I just stop fussing about things that I have no control of because what I can do with this lens is fun and spectacular.",
      "rating": 5.0,
      "verified": true,
      "author": "JindoJoy",
      "helpful_votes": 6,
      "publication_date": 20140901
    },
    {
      "title": "One of my favorite lenses",
      "text": "This and the 12mm Olympus are my favorite. A close 3rd would be the 12-40/2.8. Crisp images. Great performance in low light.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20140407
    },
    {
      "title": "beautiful bokeh, compact",
      "text": "This lens is sharp as a tack!, beautiful bokeh, compact, fast and of quality guid and feel.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim B",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Easy lens to always have in your bag",
      "text": "Fast, sharp, and relatively small. Easy lens to always have in your bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck on BI",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "It is a great lens by all accounts",
      "text": "It is a great lens by all accounts. I use it with GX8. The only possibly competition for me today is Leica 42.5mm. Not quite the same focal length, but they are surprisingly interchangeable in many occasions. Leica has better warmer color and slightly better micro contrast. Other than that Olympus is absolutely great glass - compact, fast, high imager quality even wide open.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugene Fratkin",
      "helpful_votes": 3,
      "publication_date": 20160227
    },
    {
      "title": "Nice Lens",
      "text": "Very nice lens. I need more practice in using it. Looking forward to spring flowers.",
      "rating": 5.0,
      "verified": true,
      "author": "nckathyb",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Lives up to its reputation",
      "text": "Fabulous lens. Fast, quiet, sharp. As good as its reputation. Great for tight head shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry Monteith",
      "helpful_votes": 0,
      "publication_date": 20141220
    },
    {
      "title": "Five Stars",
      "text": "The sharpest lens I own and I own quite a few!",
      "rating": 5.0,
      "verified": true,
      "author": "Katherine L Haeck",
      "helpful_votes": 2,
      "publication_date": 20141031
    },
    {
      "title": "As good as they say",
      "text": "There is not much I can offer that has not been written. All I can do is join the chorus. Exceptional build. Gorgeous glass. Smooth operation. Tight fit to body. Clear, sharp pics with pleasing color and good contrast. The 1.8 is terrific in low light. Pretty much what most others have said.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 4,
      "publication_date": 20130405
    },
    {
      "title": "Awesome",
      "text": "They need to make more m43 lenses like this one. The weight and feel of the lens is superb, clarity contrast and colours are spectacular. Only downside is that I now don't use many of my other lenses. Buy this over the 60mm macro if you are thinking about this sort of focal length for street candid portraits. The kit 12-50mm has good macro anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Dunning",
      "helpful_votes": 4,
      "publication_date": 20121208
    },
    {
      "title": "Beautiful lens!",
      "text": "A very nice lens! Still learning how to really use it but it takes great quality images.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Vallecillo",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "Sharp and with a very good contrast. Wide open is awesome too",
      "text": "If I could give 6 stars I would do it. This lens is incredible. Sharp and with a very good contrast. Wide open is awesome too. So, it's expensive but it worths every single dollar.",
      "rating": 5.0,
      "verified": true,
      "author": "STorres",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "I wish I could use it as much as my 45mm but even thought I can't I'm so glad its in my",
      "text": "This lens is a jewel , I wish I could use it as much as my 45mm but even thought I can't I'm so glad its in my bag",
      "rating": 5.0,
      "verified": true,
      "author": "Alex C.",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Amazing Lens",
      "text": "Very Sharp. Beautiful Bokeh. Solid Construction. Buy it if you can afford it. It's an investment that you won't regret.",
      "rating": 5.0,
      "verified": true,
      "author": "R. R",
      "helpful_votes": 8,
      "publication_date": 20130214
    },
    {
      "title": "The highest quality MFT format lens available to the public period.",
      "text": "Olympus optical engineers have designed this premier portrait lens to be extremely sharp with a very flat field at full aperture. This is the highest quality MFT format lens yet to be offered. Pictures taken with this lens can be recognized when compared to those from other lens because of the optical quality. The all metal construction has a gorgeous black finish compatible with the Olympus Pen series. Very expensive lens is justified by its obviously superior optical and mechanical properties.",
      "rating": 5.0,
      "verified": true,
      "author": "student",
      "helpful_votes": 4,
      "publication_date": 20130822
    },
    {
      "title": "Perfect compliment to GH3",
      "text": "I couldn't decide between the Canon 135L for my 6d or this Olympus 75mm for my GH3. Glad I chose the 75. It is a marvel. Build quality is superb, optics are unrivaled, and the size allows for hours of shooting with no next ache. This has now become my favorite lens for children's soccer games as well as portraits.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 3,
      "publication_date": 20131113
    },
    {
      "title": "world class glass",
      "text": "As reviewed on numerous pro sites this lens is in Leica class. If the medium telephoto is what you need you will not be disappointed. Very sharp center and corners even wideopen.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert c gallagher",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Beautifull!!",
      "text": "I have only had 3 occations yet to use this lens, but it's a beauty! Very sharp immages!",
      "rating": 5.0,
      "verified": true,
      "author": "J.H. Jansen",
      "helpful_votes": 0,
      "publication_date": 20140813
    },
    {
      "title": "Get it!",
      "text": "Super sharp, very fast glass. Great intermediate tele lens. So much has already been written about it. It's all true.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Dezutter",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "best lens for the m4/3 for sharpness",
      "text": "best lens for the m4/3 for sharpness, a benchmark for quality in any camera line, fantastic for low light, concerts, etc",
      "rating": 5.0,
      "verified": true,
      "author": "EOSfan",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "Absolutely amazing lens",
      "text": "I use it specially for portraits and provides fantastic results, even compared with my previous (also very good) M.zuiko 45 1.8. The sharpeness and clarity is evident since the first shot. A must have for m4/3 owners.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20131019
    },
    {
      "title": "Good optics but poor focus mechanism & noisy barrel",
      "text": "Lens with good quality optics. However, the focus mechanism seems noisy & always try very hard with AF. Noisy barrel synonymous to poor quality control. May need to send back for either exchange or repair.",
      "rating": 3.0,
      "verified": true,
      "author": "Dick_Tracy",
      "helpful_votes": 5,
      "publication_date": 20150828
    },
    {
      "title": "Great lens",
      "text": "I took the time to research the reviews, and basically everyone loved it (if you like this focal length). Sharp, great color rendition, photos and videos turned out to be way above expectations. I would highly recommend this lens for all M43 users.",
      "rating": 5.0,
      "verified": true,
      "author": "Lio Chang",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "All I've read about this lens is true.",
      "text": "Fast autofocus, nice bokech, and very shallow DOF. But of course they should add lens hood not to sale separately. It is Olympus wicked game with customers",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Iniarski",
      "helpful_votes": 0,
      "publication_date": 20130224
    },
    {
      "title": "I have been taking good care of this lens",
      "text": "I purchased this lens brand new on Amazon in October 2013 and have only been using it lightly due to work and family obligations. Yesterday, when I tried to use it with my E-M10 during my visit to Montreal, I found out that its autofocus has failed! I have been taking good care of this lens. Its short life is particularly unacceptable for such a premium lens!",
      "rating": 1.0,
      "verified": true,
      "author": "C. Lou",
      "helpful_votes": 8,
      "publication_date": 20150705
    },
    {
      "title": "lens is not working",
      "text": "I am shocked , the lens is not working on the lumix GH3 . i dont know why , all what i hear upon turning on the camera is 2 clicks ( tesk...tesk) then an error message that the lens failed to connect ... i am so depressed as no similar issue happened . Amazon issued a complete refund flawlessly .",
      "rating": 4.0,
      "verified": true,
      "author": "Jamal",
      "helpful_votes": 5,
      "publication_date": 20131202
    }
  ],
  "product_meta": {
    "title": "Olympus M.Zuiko Digital ED 75mm F1.8 Lens, for Micro Four Thirds Cameras (Silver)",
    "description": "*:Silver| Style:75mmA new, bright, f1.8 Micro Four Thirds Lens. Perfect for portraits and challenging lighting conditions. New M.ZUIKO DIGITAL ED 75mm f1.8 High-Grade Portrait Lens Enhances the Power, Performance and Versatility of Olympus OM-D and PEN Compact System Cameras.",
    "rating": 4.6,
    "feature_bullets": [
      "High-Grade Portrait Lens (150mm 35mm equivalent)",
      "High-speed, single-focal-length telephoto lens optimized for studio, stage, indoor sports and portrait photography",
      "Nine-blade circular aperture unit",
      "50mm diameter glass front; 10 lens elements in nine groups",
      "MSC (Movie & Still Compatible) autofocusing mechanism"
    ],
    "specifications": {
      "Product Dimensions": "2.72 x 2.52 x 2.52 inches",
      "Item Weight": "10.8 ounces",
      "ASIN": "B00836JHVQ",
      "Item model number": "V311040SU000",
      "Customer Reviews": "4.6 out of 5 stars130 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#307 in SLR Camera Lenses",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 24, 2012",
      "Manufacturer": "Olympus"
    },
    "categories": [
      "SLR Camera Lenses",
      "Electronics",
      "Lenses",
      "Camera & Photo",
      "Camera Lenses"
    ],
    "price": 799.0
  }
}