{
  "website_summaries": [
    {
      "verdict": "A mid-priced machine. Stand-out feature is the fact that it can accommodate additional digital instruments.",
      "pros": [
        "A strong contender from a reputable company",
        "You can connect other digital instruments for expanded sound"
      ],
      "cons": [
        "Balance control forces ratio between vocals and accompaniment to move in tandem",
        "No lyrics display"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great little mic stand and speaker!",
      "text": "This is a fun, easy-to-use mic stand and speaker. Just plug it in, turn it on, ask your smartphone for your favorite song in karaoke, and you're off! Adjustable echo, volume control, additional mic plug. We bought a second mic so we can sing duets. We used it for several hours the day it arrived. Our kids and grandkids use it when they come over. Instant entertainment! The sound isn't booming--you get what you pay for--but it is fine for home use. We are very satisfied customers.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 2,
      "publication_date": 20191217
    },
    {
      "title": "Great design but the sound is not good",
      "text": "Great design but the sound is not good. Anyway it's good for the price! It would be perfect if I changed the speakers! Still love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 52,
      "publication_date": 20160821
    },
    {
      "title": "WORTH IT !!",
      "text": "Our daughter is 10 and we bought this for birthday. She places her IPAD in the holder, plugs item iPad in and goes to YouTube for music. Type in Karoake video in Youtube to get lyrics and songs. She and her friends love it. We bought extra microphone which also plugs in. You can turn down the \"voices\" so that the music dominates and not the original singers. We had the singing machine (pink one) and it required cd's which were horrible. This is 100 times better then that and we recommend it highly!",
      "rating": 5.0,
      "verified": true,
      "author": "Embeau",
      "helpful_votes": 5,
      "publication_date": 20160412
    },
    {
      "title": "Faulty jack in just 1 month = disappointing Christmas gift",
      "text": "Waste of money. Only worked one month with only a small amount of use time. Been on the phone with Memorex numerous times trying to get repair/replacement without success. Horrible customer service. I have been very polite and patient but I am now pissed off. This was the only thing my son wanted for Christmas and he barely got to use it to practice with. Memorex now says I have to mail back the unit (in what box) at my cost.",
      "rating": 1.0,
      "verified": true,
      "author": "Mama B",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Great gift!",
      "text": "I purchased this for my 5 year old's birthday. It was a more serious microphone than what she was ready for, but it's been a great purchase. The price was about the same as the \"kiddie\" microphones & she will be able to use more of the features on this as she gets older. It's always nice to purchase a product that kids will grow into instead of grow out of quickly! It has excellent sound & is great quality!!!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Vauts",
      "helpful_votes": 2,
      "publication_date": 20171120
    },
    {
      "title": "Just okay",
      "text": "It was delivered nicely packaged, and the sound is great however the little black piece that is attached to the the stem of the microphone stand broke off after having it for a short while. Also the shape of the top part is awkward, but I suppose it needs to be in order to place your tablet or other device on it. Also I should have taken note of the height adjustment since it is too tall for my son even when it is at its shortest setting. Other than that I suppose the next person might find it a good buy.",
      "rating": 3.0,
      "verified": true,
      "author": "C. Charles",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Just as described--favorite 12yo Christmas gift!",
      "text": "Bought this for my daughter for Christmas--she is thrilled, and so am I. It's just as advertised, with great sound quality and intuitive use. A pleasant surprise was the feature that lets you play normal songs, and it \"strips out\" the vocals, turning your entire music library into a karaoke library. The construction is solid enough to withstand the shenanigans of a 12-year-old girls' slumber party, which is about the highest praise I can give. Excellent purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20170108
    },
    {
      "title": "Excellent for people of all ages to sing and for prepping for public speaking events!",
      "text": "Loved it so much I purchased this for the second time. The kids wore the first one completely out and I don't blame the product. They used it daily unlike many karaoke owners who use once a year or just once ever. My kids love to sing and perform and they use it even when they don't have an audience. I also use it to help me prepare for presentations and public speaking events. It helps to get used to hearing yourself speak in the microphone prior to the event as it decreases some of the overall nervousness. great PRODUCT AND WILL BUY AGAIN IF IT BREAKS.",
      "rating": 5.0,
      "verified": true,
      "author": "TIPSKITop Contributor: Watches",
      "helpful_votes": 2,
      "publication_date": 20151228
    },
    {
      "title": "A gift the whole family will enjoy!",
      "text": "I bought the Memorex SingStand 2 Home Karaoke System along with an extra mic as a birthday gift for 6-year-old twin boys. Their 8-year-old brother actually helped me set up the machine. He plugged his IPod into it and in less than 15 minutes they were all singing along to the music. It's very simple to use and, according to their mom, they are still having a ball with it! It was kind of a splurge but I consider it money well spent, since it's something the whole family can enjoy. I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy L.",
      "helpful_votes": 3,
      "publication_date": 20150717
    },
    {
      "title": "This product is definitely for all age groups. I ...",
      "text": "This product is definitely for all age groups. I purchased this as a Christmas gift for my 22 year old daughter who is a college student and loves to sing. She was excited when she opened it, but even more so once we ALL started using it. It really is surprising how well this is made and works for such an in expensive product. It has been a non stop karaoke party ever since. My daughter is planning a karaoke party with her roommates once she returns to school. I will have to purchase another one for the house. Oh yeah my 70 year old mother also ordered one for her after singing to the oldies at our house.",
      "rating": 5.0,
      "verified": true,
      "author": "Tntawdat",
      "helpful_votes": 2,
      "publication_date": 20150109
    },
    {
      "title": "Overall this product has been a lot of fun for my kids and every kid who visits",
      "text": "We bought this for our daughter's 6th birthday. She loves to sing and was very excited to receive it. The microphone 1 spot has never worked for us but we just plug the mic into the 2nd spot and it works well. My kids broke the microphone after a month or two because it was set on a table and it fell on the ground. The cage part detached but my husband was able to glue it back together and it still works. Overall this product has been a lot of fun for my kids and every kid who visits.",
      "rating": 4.0,
      "verified": true,
      "author": "Samantha F.",
      "helpful_votes": 0,
      "publication_date": 20160625
    },
    {
      "title": "singstand 2 home karaoke",
      "text": "This is a product that seems to have everything at a great price. For a child who wants to use it to play with, it is fun. It was not what we were looking for. The microphone arrived in half where you speak into. Glue would be an easy fix but it was new. Customer service was easy to reach and returning it through amazon was no problem. We opted not to exchange for a new one because the sound quality was adequate as a toy but if using to amplify a guitar (it does have have the place to plug in) the sound quality is poor.",
      "rating": 3.0,
      "verified": true,
      "author": "Cara H.",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "This karaoke machine is fun for adults and kids alike",
      "text": "This karaoke machine is fun for adults and kids alike. I purchased for my daughter for her birthday, but honestly I wanted it for the whole family. LOL you can attach a kindle, iPad, iPhone, etc.. to it and play whatever music you have on your phone or even through the internet. The coolest is that there is a button to mute the singer in the song so that the karaoke star can have center stage and sing her/his heart out with just the music in the background. This is a huge hit. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "lovetomtnbike",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Great system for the money!",
      "text": "Good little karaoke system. Of course, it's hard to give it 5-stars after you've used the big, fancy, expensive karaoke sets as I have in the past. But, for this price, you get a great system that's fabulous to plug it into your tablet or iphone, use their karaoke apps or your own donwloaded backtracks, then sing along through the microphone. You do get ringing and feedback sometimes, hard to hear the backtracks playing through the speakers sometimes, but the kids adore this and can have hours of fun on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Eliza",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Awesome Karaoke Stand!",
      "text": "Great buy! I bought it right on time for the holidays! We used it all night long and it was lots of fun! Definitely kids friendly. The speaker doesn't have a super incredible sound but it does a fair job. The microphone also works very nicely although it interferes with our other mic quite a lot (we bought the Singing Machine SMM-205 Unidirectional Dynamic Mic). Overall is a great buy and it connected perfectly with my iPhone 6 Plus and even the Surface 3 for music and lyrics.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "fun for the kids",
      "text": "fun for the kids. was a great xmas present. great speakers. high quality product so it's not a plastic toy. and buying an extra mic....two kids can enjoy at the same time. it's just taller than I thought. meaning you can't lower it for smaller kids. and it's really not that small. so, unless you have a dedicated kids room...or stays in your kids room....you may end up having to keep it in a closet and bring it out when using. otherwise, it could be an eye sore.",
      "rating": 4.0,
      "verified": true,
      "author": "DG",
      "helpful_votes": 3,
      "publication_date": 20160313
    },
    {
      "title": "Buy it for yourself or your kids :)",
      "text": "Bought it used from amazon. Why didn't everyone lol...Its as good as new. 1. You will love this thing. Makes you feel like a rockstar. Quality is right where it needs to be. I mean if you got so much talent then step up and buy yourself those nice 300-400 sets. Kids love it, parents love it. The iPad stand WORKS. Tons of youtube videos & apps out there to use this machine... Only 1 things to rem when using this: MAY not be the best quality when using it in a LARGE living room. When i say quality, I mean the sound volume & bass. Key thing to rem is to NEVER play full volume. You will know why.",
      "rating": 4.0,
      "verified": true,
      "author": "Simit",
      "helpful_votes": 0,
      "publication_date": 20140307
    },
    {
      "title": "Sound sucks",
      "text": "Concept is nice but the speaker completely sucks. At its loudest setting you can hear your voice 100xs louder than the speaker. Didn't return it because it does hold your phone or tablet nicely while you're doing karaoke. We use it as a glorified phone/ tablet holder while we karaoke",
      "rating": 3.0,
      "verified": true,
      "author": "Manny",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "decent karaoke home system",
      "text": "Got this for my oldest because she loves serenading everyone in the house. This has a convenient stand at the top to hold whatever device you are using to play karaoke and the bottom has separate inputs for more than 1 microphone or an instrument. The speakers are not high quality but thats to be expected for the price. We have had this for a while and haven't come across any technical difficulties and it's still going strong. Perfect for family karaoke nights and not loud enough to wake the neighbors :-)",
      "rating": 4.0,
      "verified": true,
      "author": "B Taylor",
      "helpful_votes": 2,
      "publication_date": 20141229
    },
    {
      "title": "Amazing!",
      "text": "This thing is magical! My daughter LOVES it. It's amazing how it can strip the vocals from a song and let her sing along. We connect our iPad to it, go on YouTube and find a song that has the lyrics as the video (easy to find nearly any song like that), and this thing does the rest. Sure is better than a karaoke machine where I'd have to pay more for it and buy special CD's/MP3's without the vocals. It's a fantastic value price-wise too for something that does so much. Our entire family has gotten a lot of entertainment out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brave Sir Robin",
      "helpful_votes": 2,
      "publication_date": 20150506
    },
    {
      "title": "Great fun for adults; easy to use/set up!",
      "text": "Recently had a party and the karaoke stand was a huge hit! Kids are always wanting to play with it, too! The only complaint is the lack of volume... need to figure out how to plug in to better/bigger speakers to hear the music louder. But overall, it's literally plug and play! The stand will support either a phone or pad to read the lyrics from and you do not need to buy a bunch of karaoke CDs or anything. Most songs can be found online.",
      "rating": 5.0,
      "verified": true,
      "author": "westsidecarrie",
      "helpful_votes": 2,
      "publication_date": 20160301
    },
    {
      "title": "Fun Home Microphone for the Budding Star in Your Life",
      "text": "This was a Christmas present for my young daughter. It's been a complete hit with the rest of the family. We leave it plugged in and on in our playroom for whenever the mood strikes. The sound is very good for the small speakers at the bottom of the mic. It looks real and professional for my daughter which was her request from Santa. I have a background in singing as well and was happy with the output from the mic. It is not a professional one but it's not pretending to be. For home use, this baby can not be beat!",
      "rating": 5.0,
      "verified": true,
      "author": "The Scarlet Corset",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Simple, works well. Easy to use.",
      "text": "Does just what it says. You put it together in a few minutes, plug it in, turn on the power and mic and away you go with whatever music you want to input. Has a progressive echo effect control. Looks like fun. Something to bring out after the crowd has had a few drinks or at a child's birthday party.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Hoffman",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Surprised how well it actually works",
      "text": "My son received this for Christmas. There are so many Karaoke machines on the market that it was really difficult to decide on one. The tipping point for this one is that you can connect your iPhone or iPad directly to the machine - no TV necessary and you can go to youtube for the karaoke songs (tons to choose from and free!). When we plugged this in my son grabbed the mic and didn't put it down for the remainder of the evening. His voice aside (he's only 6.5), the sound is really pretty good, especially considering the price. I whole-heartedly recommend this if you are looking for a karaoke machine - child or adult, works great for everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "JennyB",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "Fantastic, super fun product, excellent quality for the price.",
      "text": "Wonderful!!! Fantastic product... bought this for our six-year-old who is constantly singing and really wanted a microphone for Christmas, but it has ended up being a great source of joy and fun for the entire family. It is SO easy to set up and use and extremely good quality and sound for the price. Highly, highly recommend this instead of purchasing a cruddy \"children's microphone,\" that is a heap of plastic garbage and requires batteries. This is a blast for everyone... you can hook up almost any device, pop on You-Tube and have tons of karaoke fun!",
      "rating": 5.0,
      "verified": true,
      "author": "TBS",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Kinda cheap",
      "text": "I guess this is a case of you get what you pay for. It works fine but the pole doesn’t secure and the place to put your phone seems unstable and cheap. If you just want an amplified microphone it’s not bad.",
      "rating": 3.0,
      "verified": true,
      "author": "jeannie712",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Broke after a couple minutes",
      "text": "So dissapointed. I bought this as a Christmas gift for my children in September. We opened it yesterday and the microphone worked great for the first few minutes but then it just stopped working. I don't know how to contact the seller so we just wasted our money and have disappointed kiddos. Does anyone know how to contact the seller to discuss this?",
      "rating": 1.0,
      "verified": true,
      "author": "Blessed",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "A piece of junk!",
      "text": "Poor quality microphone and speakers, a stand that won't hold together and a total waste of money. Really nothing else to say. After half an hour of disappointment, ready to return this garbage. Who on earth would give this overpriced piece of kitsch 3, 4 or 5 stars???",
      "rating": 1.0,
      "verified": true,
      "author": "A. Jones",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "Great for the price",
      "text": "I had bought a kids plastic microphone for my granddaughter, and she loved it, but it eventually broke. When researching a new one, I figured for about $25.00 more I would get this, which is sturdier. She loves it, and loves the fact that we can plug an MP3 player or phone into it to play the songs she wants to sing. You can also add a second microphone, which we have done, since we already had one. The only complaint is that there is no battery option, but really, that's a small issue most of the time. My family is very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Reg",
      "helpful_votes": 2,
      "publication_date": 20140906
    },
    {
      "title": "Sounds great!",
      "text": "The sound has been great on this! You can connect extra mics & adjust sounds easily. It has a place where you can place your iPad & seaside it for easy sing along!",
      "rating": 5.0,
      "verified": true,
      "author": "Marisol Aguilar",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "It’s not all that great. Not loud enough",
      "text": "It’s not all that great. Not loud enough. You have to put your lips on the mic in order to be heard. The stand does not hold up well. It slides up and down and comes apart when you move it. Not very happy about how it arrived. It was on my porch in a clear bag, showing what the product was. Not in a box with the Amazon logo on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Target Shopper",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "Great product!",
      "text": "Great product!! My kids love it. We just pull up karaoke songs from YouTube and stream them through our Apple TV and it works great!! Pros: Easy plug and play. Sound quality good for a small room. Can be used as a regular microphone. Takes 2 microphones and can adjust volume for each one. Has echo option. Cons: Cannot play a karaoke DVD. No key adjustment (i.e. if you want to sing in an \"A\" key rather than a \"C\" key.",
      "rating": 5.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "Much better than just a karaoke machine",
      "text": "This is exactly what we were looking for. Much better than just a karaoke machine. With this my daughter just attaches her ipad on it and then uses her karaoke app so that she can sing and read the words at the same time. Just wish there were better apps on ipad now! And cheaper. But the microphone and stand are great! I know other users said they had sound problems, but ours has great volume and don't even turn it half way up to be loud enough for the whole house to hear. We love this!",
      "rating": 5.0,
      "verified": true,
      "author": "Pmalady",
      "helpful_votes": 2,
      "publication_date": 20150109
    },
    {
      "title": "My daughter loved this Karaoke system",
      "text": "My daughter loved this Karaoke system. It works as expected and I found myself singing along to songs or just using it whenever I needed to hear my voice echo....Love the fact that it has the echo feature and the option to adjust the mic and overall sound volume. It also has a Vocal button which can be used to hear crisp sounding vocals when you are needing your voice chords measured.",
      "rating": 5.0,
      "verified": true,
      "author": "Oz",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Hours of Family Fun",
      "text": "The kids and adults love this! Pretty good sound. You can hook it up to an iPhone, iPod or iPad and if you use YouTube and type \"karaoke\" after searching for your favorite songs, you'll have an endless supply of songs. The \"free\" songs they give you with purchase aren't very good. We have had hours of fun with this karaoke stand. The 5yr old and 8yr old kids just love it. If your kid is a future entertainer, or if you want to practice in the privacy of your own home, this is a great karaoke system.",
      "rating": 5.0,
      "verified": true,
      "author": "Sickpup94",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Sing your heart out",
      "text": "Great fun. Works wonderfully. Bought an additional mic for it so more can sing. Don't have any additional instruments to plug into it but that's a great feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 3,
      "publication_date": 20161212
    },
    {
      "title": "Great Entertainment!",
      "text": "We purchased this for our 4 kids, ages 12-18 for Christmas. It was the highlight of the night! It was easy to put together. It took us a few minutes to figure out the best way to get our music but after that we were up and running! We like the stand because it makes them feel like they're on stage. The sound is good. If you're a serious karaoke singer, this may not be for you. But if you're an amateur who enjoys singing for fun, it's a really good product at a great price! Don't forget to buy an extra microphone! You can hook up 2 to the system!",
      "rating": 5.0,
      "verified": true,
      "author": "Tam Chau",
      "helpful_votes": 0,
      "publication_date": 20131225
    },
    {
      "title": "very nice karaoke machine",
      "text": "my 4 year old daughter & my wife & I have enjoyed this karaoke machine. it has a lot of features that we dont use yet like the extra instrument inputs. its nice that it comes with the double sided cord to hook up to the headphone jack of the mediaplayer/smart tv & the media player input on the karaoke machine. I thought I would have to buy that myself. its nice that it comes with a 2nd mike attachment. the controls are straightforward. my only idea for improvement is for the karaoke machine to be able to record your session for later playback. no feedback on the mikes.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryon",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Great product!",
      "text": "My aspiring singer granddaughter absolutely loves this! She gives it a good workout almost every day, and it has good sound. It seems to be lasting well, and has a nice heavy base. Much better than the box one I got her last year without the mic stand. She specifically states that she LOVES the mic. I think her family wishes the sound maybe wasn't so good when she's practicing the same songs over and over for her voice lessons! LOL",
      "rating": 5.0,
      "verified": true,
      "author": "S. Joiner",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "Working great so far",
      "text": "Working great so far. (Handful of uses). We used a splitter so we can attach 3 microphones for our triplets. Only complaint is the audio input you can't really hear the voices in the music input coming out of the speakers (minus one star). I'm not sure if this is a defect or the case with all of them. Will look into further by trying input from different devices. Not a huge problem for us personally. Will update if the unit does not last.",
      "rating": 4.0,
      "verified": true,
      "author": "TPBMM",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "A convenient, economical solution for kids/families who like to sing along",
      "text": "Surprisingly good sound quality. A good, simple home karaoke system. Use youtube in iPad as your sources of songs so there is no limit what you can find. Plug in the iPad audio directly to this system to mix the sound. You can connect two microphones, with separate volume controls. The system does not take much space and it is stand alone. Of course, it is not on par with the high end karaoke systems. But overall, we are happy with the purchase. We had a blast with this when our friends visited over the Christmas holidays.",
      "rating": 4.0,
      "verified": true,
      "author": "Baymate",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "Can plug in your guitar and sing along",
      "text": "As Karaoke machines go this seems a little different. You use your tablet or smart phone to access content. Its small and lightweight and best of all you can plug in your guitar to play through the speakers. You can plug it into a TV and watch it as a group or use the tablet mount to allow the singers to view lyrics. Also you can add a second mic for a friend. This was the best option that allowed us to us this in the most versatile way. My daughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Vindi317",
      "helpful_votes": 2,
      "publication_date": 20140104
    },
    {
      "title": "Does the Job!",
      "text": "Really works as described. Simple and easy to set up and use. Kids love it! I would say the only drawback is storage in that although it doesn't take up a lot of floor space, it also doesn't fold up for putting it away. Standing up in a closet is best option. Also, the cords are all over the place, but I suppose that's the case with all of these. These are somewhat minor complaints for a unit of this quality and price. I would highly recommend this product, as it works well, it's well designed, and priced lower than most.",
      "rating": 5.0,
      "verified": true,
      "author": "VivaDnA+2",
      "helpful_votes": 2,
      "publication_date": 20131228
    },
    {
      "title": "Go ahead and order this now!",
      "text": "This is a must have for any karaoke fan. I use it with my iPhone and iPad. The sound is excellent. It only comes with one microphone, but it has a spot to hold a second mic (which I also ordered for less than $15). I have several friends who purchased this after trying it out at our house. With the iPad, you can use a paid app like Karafun or Sing!, but you can also just use Youtube and search for karaoke versions of songs for a free, infinite playlist. It also has a place where you can plug in a guitar, but we haven't tried that feature.",
      "rating": 5.0,
      "verified": true,
      "author": "tigerMama",
      "helpful_votes": 0,
      "publication_date": 20140806
    },
    {
      "title": "The sound on this mike is great!!",
      "text": "Bought this for my grandsons along with a guitar and drum set. The sound on this mike is great!!!! Good value. My only negative is that you cannot lower the mike down low enough for kids. They have to take the mike off the stand and hold it. Hard to do when you are playing the drums! They do however, love to sing into it!",
      "rating": 5.0,
      "verified": true,
      "author": "birdie",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "it is fine. We were fine with the voices coming from ...",
      "text": "Used it with the amazon fire stick to sing along with youtube karaoke videos. Bought an additional mic so that more than one person can sing and it worked perfectly. For purely entertainment purposes, it is fine. We were fine with the voices coming from the speakers. It probably would have been better if we could connect it to other speakers but for straight out of the box usage, it was great. We did not use the built in karaoke system so can't speak to that.",
      "rating": 5.0,
      "verified": true,
      "author": "Novembreskye",
      "helpful_votes": 2,
      "publication_date": 20150101
    },
    {
      "title": "put on some YouTube songs and performed some great shows for us adults",
      "text": "I bought this for my (wannabe rock star) granddaughter's 7th birthday. (Also bought an extra microphone for her sister). They hooked their I-Pad to it, put on some YouTube songs and performed some great shows for us adults. They love it and it's holding up very well! It's an easy 5 star! I would definitely recommend it for anyone (regardless of age) who likes to do Karaoke style singing.",
      "rating": 5.0,
      "verified": true,
      "author": "mema10",
      "helpful_votes": 2,
      "publication_date": 20150412
    },
    {
      "title": "and while it is a great option for a karaoke system",
      "text": "I bought this based off of reviews, and while it is a great option for a karaoke system, our mic shorted out and stopped working about a month after we got it. It was a purchase for my kids for Christmas, and they didn't handle it rough, and they were always supervised while playing with it. I would say it wasn't anything they did too rough or out of the ordinary to cause the mic to break.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160621
    },
    {
      "title": "Line in cable is awful",
      "text": "Ok, I THINK that this would work well if the sound input cord that went from the machine to your device worked well. It doesn’t though. It cuts out like crazy, making this one frustrating machine. Kinda ruined our nye. Sound is great for such small speakers when it does work but it cuts in and out. I can’t figure out how to get the company to just give me a new cord without returning the whole thing?? Super frustrating. Going to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas Ledbetter",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Awesome Gift",
      "text": "This is by far one of the best gifts that I have ever purchased for my granddaughter! She loves putting on her own little plays with her dolls and stuffed animals. She also sings all of her favorite children's songs! It's truly awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Exactly what I was looking for!!!",
      "text": "I finally have a solution for my Karaoke needs! For years I have been borrowing stuff, trying to find something that doesn't cost the world, something where I don't have to keep paying after for songs, something that doesn't take up too much space. I was surprised about the sound, we have a small living room but the microphone & loudspeakers sound better than expected, It's easy to use and most of all I can just go on youtube with my mac & apple TV and have the microphone & loudspeaker separately. Soooo happy I bought this. We bought a second microphone for it, works great.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Nuesca",
      "helpful_votes": 0,
      "publication_date": 20140202
    },
    {
      "title": "Great Christmas buy!",
      "text": "My daughter's favorite Christmas gift. She sings on it daily. So glad I purchased. The sound is great, and love that you can adjust the height. Id recommend this. Updated: how do we contact the seller about the silver part of the plug on the microphone falling off? It will not go back on and microphone would need replaced.",
      "rating": 5.0,
      "verified": true,
      "author": "August",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "I expected much more",
      "text": "When I saw the great reviews for this Karaoke System, I expected much more. You plug in your phone or table and have to find the songs you would like to sing online (YouTube is a good source). The \"karaoke system\" is really is just a speaker with a microphone (or two if you buy an extra one) and a pedestal. The sound is OK but if you stand too close you get speaker feedback. I am giving it three stars because of the price. It is a karaoke system that the kids can handle by themselves (as long as they can find songs online) and you won't mind too much if it breaks.",
      "rating": 3.0,
      "verified": true,
      "author": "Delia",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Fun n Frolic",
      "text": "This is a great system for the price. We have been enjoying it everyday since Christmas. Only complaint I have is the holder for a second microphone has already broken. We will surely rig an alternative holder but original is plastic and with children durability just isn't there. Sound quality is pretty darn clear but might like a little more volume. For what we paid this product is well worth the investment. If you want all your needs satisfied you'll pay for it somewhere else.",
      "rating": 4.0,
      "verified": true,
      "author": "PastorIT",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Daughter loves it!!",
      "text": "I bought this for my daughter because she is in choir in school and she loves to sing. She loves this and the fact that you can mute the singers voice on a device and sing along. We have not used the karaoke option because my daughter loves singing her own songs. The options at the base also allow her to adjust without having to stop in the middle of a song. All around a great piece of equipment. It was not designed for studio quality, but it works fine for her around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Rita Karaffa ",
      "helpful_votes": 0,
      "publication_date": 20140205
    },
    {
      "title": "Very disappointed with the quality",
      "text": "I purchased this microphone for my almost 7 year old daughter a few months ago. It only worked for a little while. Then, the top of the microphone came off one day as she was singing. We have tried to put it back together but it keeps coming off. And now it won't even turn on. Very disappointed with the quality. Don't waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Julie C.",
      "helpful_votes": 2,
      "publication_date": 20160701
    },
    {
      "title": "This worked great for about 6 months and then the base came ...",
      "text": "This worked great for about 6 months and then the base came loose from the pole and it never worked right again. This was a Christmas gift for my daughter in 2014. She loved it, but was so not happy when it broke so easily. She had it in one place and didn't kick the stand over or any other rock star moves. Now looking for another karaoke machine.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Ogle",
      "helpful_votes": 3,
      "publication_date": 20151210
    },
    {
      "title": "Awesome",
      "text": "Pair this with Karafun subscription of high quality karaoke ($9.99 per month) and this thing is great. Have access to most songs I need (can youtube others not available on subscription) and easy to get started. The speakers themselves are pretty much useless because its not very loud, but connecting the stand to your stereo works great for capturing the music and the vocals. HIghly recommended. One negative is the plastic band holding the Ipad breaks after a while.",
      "rating": 5.0,
      "verified": true,
      "author": "GreggB",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "False website description. Only came with 1 microphone. Picture for reference",
      "text": "At the time of purchase (just a handful of days ago), the description said that the item comes with 2 microphones; there was only 1 in the box. I purchased this for Christmas so that my two children could play with it together. Extremely disappointing for them, and very inconvenient for me to have to return this item.",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "My grandchildren love this. It is very touchy to get started",
      "text": "My grandchildren love this. It is very touchy to get started, but we can figure it out most of the time. Sometimes we can't get it to work and they are disappointed, other times it starts after several minutes of trying and we can't figure out why we got it to work this time but not the last one!",
      "rating": 3.0,
      "verified": true,
      "author": "3jth44",
      "helpful_votes": 2,
      "publication_date": 20151103
    },
    {
      "title": "This is a nice system, I bought it for my daughter",
      "text": "This is a nice system, I bought it for my daughter. Gave it 4 stars because it's not comfortable to use the mic while it's on the stand - it's tilted a bit too far back, and also makes it difficult to look at an iPad if you have one plugged into it. There's a guitar jack, which is cool, but again you couldn't sing into the mic while playing guitar. If you plan to keep the mic in your hand, it's great.",
      "rating": 4.0,
      "verified": true,
      "author": "Wendy F.",
      "helpful_votes": 0,
      "publication_date": 20150424
    },
    {
      "title": "Supper Awesome",
      "text": "I would give it 10 Stars.. but there is a limit of 5 stars only... :) This is one of the best Sing Stand Home Karaoke system. good mic good speakers easy to use... I love it.. and recommend all",
      "rating": 5.0,
      "verified": true,
      "author": "Raheel Ali Nagori",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Keeps kids busy",
      "text": "My kids 10 & 12 love this thing. They don't even have to have music going they just use it! There are many ways to download music. Most of the time they stream songs and variations of songs from YouTube. The speakers are small and the mic isn't great but this isn't bar quality karaoke either. The price is right and your kids will love it. I have noticed an audio output - should be easy to connect to external speakers. I took a star away because the mic and speaker but don't let that dissuade you...",
      "rating": 4.0,
      "verified": true,
      "author": "Matty88",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "This is Fun!!",
      "text": "I bought this for my five grandchildren to play with during the Christmas holidays. They not only enjoyed it, but the adults joined in with the karaoke also. Everything worked as presented. All five children and seven adults would give it five stars! We got karaoke songs from youtube, which has the lyrics, or sometimes printed the lyrics from web sites. It appears that the SingStand 2 has corrected the problems expressed about the original SingStand. We did notice that the microphone that comes with it was not as good as the extra one I purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "cnnvly",
      "helpful_votes": 0,
      "publication_date": 20130105
    },
    {
      "title": "Great Purchase for our Daughter",
      "text": "HUGE Hit. We got it for my daughter's birthday back in March and it is still one of her favorite toys. She plugs her tablet into it and the \"holder\" section holds it quite well. She can then sing along with You Tube and such and she has a blast. Her friends love it too and it is always the first toy they go for when they come over to play. Audio is decent and the microphone cord is plenty long enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20141003
    },
    {
      "title": "Great",
      "text": "I bought one of these for my 5 year old niece for Christmas and I think I had more fun with it than she did! So much so, that my Dad ended up buying me one for my birthday a few weeks later. I'm a grown adult, but I love to sing and I love music. Although I haven't used this much since getting it, it is a fun thing to have when I get in the mood to sing. I just plug in my iphone or ipod and start belting out tunes. It's fun for all ages!!",
      "rating": 5.0,
      "verified": true,
      "author": "Northern Gal",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Great system!  5 stars!",
      "text": "Bought this for my 12 year old for Christmas and she is still using it every day. It was super easy to set up and the volume is \"just right\" - not too loud but loud enough that she feels like she's singing into a mic. We all love the ease of using our iPad or iPhone to pull up karaoke songs from YouTube or the internet. The other real benefit is that it's not a huge BOX like the old karaoke machines. I highly recommend this system!",
      "rating": 5.0,
      "verified": true,
      "author": "Connie Stewart",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "Great karaoke system for kids...and adults.",
      "text": "Kids love it. If you monitor carefully you may find a great price on this product. I missed the \"great price\" window and had to pay the normal price, but the kids would have paid double.",
      "rating": 5.0,
      "verified": true,
      "author": "rsharp",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Didn't Work and Didn't Contain Advertised Accessories",
      "text": "Not only did this come broken, but the description from the manufacturer states that it comes with two microphones and is Bluetooth enabled. Neither one of those is true. The only way to play the music track is through an auxiliary cable and the port broke after one use. Amazon was amazing in the return process. That was the one good thing about this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Dietzel",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Fun for the entire family",
      "text": "Just got this for Christmas and the whole family has fought to play on this all day. It's great how you can plug in your phone and pull up songs on youtube with the lyrics to sing to. I bought a CD to go with it and then realized I don't have a CD player to plug into it and then got the idea just to use youtube and you can find every song you want on there. The sound is clear and quality good.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrskafay",
      "helpful_votes": 0,
      "publication_date": 20141225
    },
    {
      "title": "This is a terrible karaoke machine!",
      "text": "This did not work at all. First, the top part that you put your phone would not connect so it was very loose and unstable. Then when we tried to sing with it, you could not hear the singer at all with volume all the way up. Pushing the vocal button just made the music sound bad and still couldn't hear the singer. Bought for daughter's birthday so opened it up too late to return. What a waste!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171225
    },
    {
      "title": "Does not work as expected.",
      "text": "When the stand was first received, everything worked well, but recently, the speaker on the base of the stand has been working intermittently (it cuts in and out). While there are many other great reviews of this item, I am unable to give this higher than a one-star rating, especially given that the stand is only a few weeks old.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Perez",
      "helpful_votes": 5,
      "publication_date": 20160427
    },
    {
      "title": "I do not recommend it.A waste of money.",
      "text": "I had this item for less than two months, and the microphone does not work anymore. We have only used it less than ten times, and it does not work anymore. I do not recommend it. A waste of my money.",
      "rating": 1.0,
      "verified": true,
      "author": "sara",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Fun product",
      "text": "My 10 year old daughter and 11 year old son are having a blast using this device. You can use your ipod, ipad or other tablet with it to get music (for either karaoke or just to sing along with). We haven't done much with the karaoke aspect yet as they are just enjoying singing with the microphone and using regular songs from their ipods. The quality is good (for our use) and you can get an additional microphone to go with it, which I intend to do. You can also hook up your guitar to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cef",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Fun with karaoke.",
      "text": "This is really a nice unit. We have had it for awhile and used it a lot. Everything works as intended. The one thing it could use is a little better speaker if I had to nit pick. Overall, it is a winner.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160503
    },
    {
      "title": "lots of fun great product",
      "text": "great product, easy to assemble and sounds great for the money. we had this up and working in less then 10min. I hooked up another mic and our iPad 2 and me my kid were off signing our hearts away.",
      "rating": 5.0,
      "verified": true,
      "author": "I. Gotto",
      "helpful_votes": 3,
      "publication_date": 20151212
    },
    {
      "title": "A must have for when Girls Just Want To Have Fun.",
      "text": "My two daughters can't get enough of this mike and sound systems. They have connected it up to their tablets, I Touches, laptops, my android phone, just about anything with a headset port. There is a guitar input port, and Auxiliary port and plenty of speaker strength for those girl parties your sure to draw.",
      "rating": 5.0,
      "verified": true,
      "author": "Fife",
      "helpful_votes": 2,
      "publication_date": 20150203
    },
    {
      "title": "Delighted our 5- and 10-year-old granddaughters.",
      "text": "My granddaughters were THRILLED on Christmas Eve when we allowed them to open it. (No peace and quiet after that until bedtime) It arrived on time, as described and was easy to assemble and get working",
      "rating": 5.0,
      "verified": true,
      "author": "Immunurse",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Awesome!",
      "text": "I love this karaoke system! It is a steal at this price. My Aunt even wants to order one for a church she preaches at because it has great sound. ( small church). Microphone already broke though. Did not drop it or anything. The top just came off..?? Very strange.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelz",
      "helpful_votes": 0,
      "publication_date": 20160406
    },
    {
      "title": "I Love this  Karaoke Machine",
      "text": "I've had this Karaoke Machine for 10 years, and it was broken at a family function. When It came time to replace my karaoke machine, I had to get the same exact one. This machine is very easy to use, and extremely easy to transport. I Love It!",
      "rating": 4.0,
      "verified": true,
      "author": "Robbie Hamilton",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Memorex Home karaoke system",
      "text": "We were excited on Christmas to enjoy the fun with this system but the microphone that came with it stopped working. we tried different things but it would not fork with out cutting off. Fortunately we had also purchased a backup microphone that works just fine. So we are happy with the system but not the microphone that comes with it. I thought Memorex was a well known brand and was disappointed that the microphone did not work . We still have to purchase another microphone so the girls can sing their songs together.",
      "rating": 2.0,
      "verified": true,
      "author": "NANCY R OGDEN",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Good karaoke system for having fun at home",
      "text": "Giving this a 4 because it totally does the job for having fun at karaoke at home, but it's not necessarily professional sounding and doesn't put out amazing sound. My daughter and mom love it, but for those who sing professionally, it just sounds ok. Not a bad price though!",
      "rating": 4.0,
      "verified": true,
      "author": "Heather G.",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Fun and easy to use karaoke system",
      "text": "This has been a great addition to the family. It works great with an ipad and karaoke app. In my opinion, this set up works much better than the systems that require you to buy the karaoke cd's and then only have a limited number of songs. The karaoke apps give access to many more songs and most are free. Just remember to turn off the microphone on your ipad or you will get feedback.",
      "rating": 4.0,
      "verified": true,
      "author": "Blndspdr",
      "helpful_votes": 2,
      "publication_date": 20150619
    },
    {
      "title": "Slim Karaoke",
      "text": "This slim karaoke sound system provides multiple options on incorporating sound into speaker or TV sound system or from the stand itself. It works with tablets, smartphones, MP3 players, smart HDTVs with internet access. It comes with only one microphone, which did not last too long. It has no capability to play CD+G disks and display lyrics.",
      "rating": 4.0,
      "verified": true,
      "author": "Anonym",
      "helpful_votes": 2,
      "publication_date": 20140605
    },
    {
      "title": "AWESOME!!!",
      "text": "Good product! I found out about this karaoke machine through relatives and well I just couldn't handlt not having one in my house. The sound is pretty good, and the mic that goes along with it is awesome! It was so easy to use, kid-friendly, definitely worth-buying for entertainment in small gatherings or parties (escpecially in filipino parties with their traditional karaokes) Trust me, this is a good product!",
      "rating": 4.0,
      "verified": true,
      "author": "Ari",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Great value",
      "text": "This is a great product for the price! Was super fun at my son's graduation party! It's also nice you can use your phone or tablet instead of buying Karaoke CD's.",
      "rating": 4.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Lots of Fun!",
      "text": "I considered a few different karaoke machines before purchasing this one and am thrilled with it. The sound is good for family use and a young (10 year old) child. We have an iPad so the set up is simple and portable. We purchased another microphone which is a must.",
      "rating": 5.0,
      "verified": true,
      "author": "Visionary63",
      "helpful_votes": 3,
      "publication_date": 20141107
    },
    {
      "title": "Best Karaoke Machine...no more CDs",
      "text": "Most people don't want to have to buy special CDs to sing Karaoke, and especially now when music is digital. Because this works with your iPad/iPhone (tablet/smartphone), it's just easier and cheaper. You can either download a lyrics app like MusixMatch or else just go to YouTube and search for \"karaoke [name of song]\". My kids have loved this, and getting a second mic is well worth it to make it even more interactive.",
      "rating": 5.0,
      "verified": true,
      "author": "Aldebaraan",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Great gift !!  It really works",
      "text": "My girls love singing with this microphone and stand . It really works . Great gift for girls !",
      "rating": 5.0,
      "verified": true,
      "author": "3 girls and a boy",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great time !",
      "text": "I purchased this for my 12 yr old daughter for Christmas, it was super easy for her to set up with in minutes. She and her freinds love it, I would definitely say it was well worth the money .The sound quality on it is great.Her Samsung s4 phone works great with it.Have not tried her kindle yet but she has more options with her phone.",
      "rating": 5.0,
      "verified": true,
      "author": "cecelia721",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "BEST GIFT EVER",
      "text": "This is an amazing system for karaoke!! We have had so much fun with it and even those that don't typically want to sing, can't resist once we have it going! Having the ability to download any song pretty much instantly from the internet makes it the most user friendly karaoke that I have ever seen! We have tried a few and this is by far the best I have seen! Love the podium style as well, makes you feel like you are really on stage! The kids LOVE it!!! But, hey so do the adults!! The best entertainment we could have ever purchased, and so economically priced!!!",
      "rating": 5.0,
      "verified": true,
      "author": "rhonda elkins",
      "helpful_votes": 0,
      "publication_date": 20140210
    },
    {
      "title": "One of my best buys in Amazon",
      "text": "I did'nt buy this for my son or my granddaughter, as many reviewers said, I bought it for me. Singing and playing guitar are part of my life since I was a kid, never have been a professional, never tried to be one, singing make me feel better and put me in a great state of positivism. This machine was something new for me regardless I'm an expert on Karaoke system, it has a wonderful mic, I can use the echo features easily and looks impressively pro. I'm glad my son made this choice for me cause usually I do not change brands, I recomend this Memorex Karaoke machine, It is what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "ElSobrinoDelJuez",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Love it!",
      "text": "This came earlier than expected which was nice to know that this gift (santas gift) was in my possession and I wasn't biting my nails hoping it would get here on time. It was very easy to assemble and it sounds great. We hooked it up to my daughters Kindle (which was as easy as inserting a plug into the microphone and one into the Kindle. Unfortunately the kindle did not fit onto the stand in the case but once out of the case it fit perfectly. We played Karaoke all Christmas day!",
      "rating": 5.0,
      "verified": true,
      "author": "V. Page",
      "helpful_votes": 0,
      "publication_date": 20130107
    },
    {
      "title": "Ability to connect to second device is a nice thought, but volume issues have been most pronounced ...",
      "text": "Had for 5 months. Never had problems with failing to work. Volume is biggest drawback, and at higher volumes there is significant distortion. That being said, since my kids are mainly on it, it does help keep the noise down. Ability to connect to second device is a nice thought, but volume issues have been most pronounced here not having the ability to project good quality audio at higher volumes.",
      "rating": 3.0,
      "verified": true,
      "author": "DN",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Works great!",
      "text": "This was a Christmas gift for my great niece and future star. She loves to perform and loves this! You can use your device and search any song you want to sing. Just plug it in and go!",
      "rating": 5.0,
      "verified": true,
      "author": "LoveToShop",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "great for karaoke and the quality is great",
      "text": "I was looking for a quality mike to get my daughter, since she almost breaks everything. ..I bought for her xmas gift in 2015, 6 months now and it is still going. Plays through the ipad, and sounds can be adjusted somewhat. ..great for karaoke and the quality is great!!!...this was a good buy",
      "rating": 5.0,
      "verified": true,
      "author": "N",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "My husband and I tried this out and we can't ...",
      "text": "My husband and I tried this out and we can't wait until Christmas morning. Not just so the kids can use it, but so we can play with it again too!",
      "rating": 5.0,
      "verified": true,
      "author": "Mela",
      "helpful_votes": 2,
      "publication_date": 20161212
    },
    {
      "title": "Good bang for the buck.",
      "text": "I bought this for my 3 yr old daughter. I know she's a bit young for it but she lives to sing and is in training with her stage presence. It was very easy to put together. Literally 3 minutes, but the stand doesn't lock into place when adjusted. At least mine doesn't. Everything else works fine. It's not exactly professional grade sound manipulation but its close enough. My daughter sings with the mike in her hand anyways.",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Nicole Truitt",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "A true favorite at our house",
      "text": "This has proven to be one of those perfect Christmas gifts that the kids keep on using all year. Good quality mic's and plenty of volume, every kid who visits our house gets a demo and leaves wanting one of their own. Although it handles 2 mic's at once, we might have to buy another to let everyone sign along happily.",
      "rating": 5.0,
      "verified": true,
      "author": "Haynes",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "I paid $348 for new item but received the used System with missing parts",
      "text": "Karaoke System arrived used instead of new and has few missing parts. I hope, this rewiev will be helpful for customers.",
      "rating": 1.0,
      "verified": true,
      "author": "greensong",
      "helpful_votes": 0,
      "publication_date": 20181008
    }
  ],
  "product_meta": {
    "title": "Memorex MKS-SS2 SingStand 2 Home Karaoke System,Silver/Black",
    "description": "style:SingStand 2\n\n Sing along to your favorite songs with the Memorex MKS-SS2 SingStand 2. Ideal for parties and family game nights, this all-in-one karaoke system connects with your MP3 player or tablet so you can sing along to custom playlists. The SingStand 2 also integrates a stereo speaker and a microphone, offering everything you need for a full karaoke experience. And with its instrument input, the system can even connect to a guitar or keyboard for easy musical accompaniment.\n\n All-in-one karaoke system includes stereo speaker and microphone.\nView larger.\n\n Instrument input lets friends play along with a guitar or keyboard. View larger.\n\nSTREAM CUSTOM PLAYLISTS FROM ALMOST ANY DEVICE\n Equipped with a universal line-in, the SingStand 2 can connect to any audio device equipped with a headphone jack. Using the input and included cords, you can access music and videos from tablets, MP3 players, smartphones, and a variety of other devices. The Singstand 2 also has a built-in cradle that holds your device securely in place, giving you a convenient place to set your device and read lyrics while you hold the microphone.\n\nINSTRUMENT INPUT FOR GUITAR OR KEYBOARD ACCOMPANIMENT\n The SingStand 2 features an instrument input compatible with a variety of instruments. You'll be able to practice your favorite songs on electric guitar or keyboard or support the singer with musical accompaniment during karaoke sessions. In addition, the system features two microphone inputs (one microphone included), making it ideal for vocal duets.\n\nAUTO VOICE CONTROL FOR BALANCED AUDIO\n Featuring built-in auto voice controls (AVC), the SingStand 2 actively amplifies your vocals to achieve just the right ratio between the music and your voice. AVC ensures that the song's original vocals are dampened when you're singing so you can hear yourself loud and clear. Using the SingStand's control panel, you can also dynamically adjust volume or add a fun echo effect to your voice. A convenient cord management clip is included so you can easily contain wires and prevent them from interfering with your performance.\n\nBUILT-IN STEREO SPEAKERS DELIVER CLEAR, CRISP AUDIO\n The SingStand 2 is equipped with two 5-watt speakers, which deliver powerful, crisp audio performance. Built into the SingStand's base, they are designed to project sound to every corner of your room. The speakers work whether you are singing or not, so they can double as a speaker system for your MP3 player or tablet.\n\nDIMENSIONS AND WARRANTY INFORMATION\n The SingStand is 59 inches tall when extended to full length and its base measures 12 inches in diameter. It is backed by a 90-day limited warranty.\n\nWHAT'S IN THE BOX\n SingStand 2, microphone, microphone cord, 11-inch line-in cord, 7-inch line-in cord, cord management clip, and user manual.\n\nMEMOREX MKS-SS2 SINGSTAND 2\nAT A GLANCE:\n * All-in-one karaoke system lets you sing along to custom playlists\n * Universal line-in for connections to tablets, smartphones, and other audio devices\n * Instrument input for guitar or keyboard accompaniment\n * Auto voice control manages audio balance during karaoke performances\n * Built-in speakers deliver crisp, powerful audio\n * Backed by a 90-day limited warranty\n\n Universal line-in for connections to tablets, smartphones, and other audio devices. View larger.",
    "rating": 4.2,
    "feature_bullets": [
      "Singstand 2 can connect to any audio device equipped with a headphone jack; using the input and included cords, you can access music and videos from tablets, MP3 players, smartphones, and more; Built-in cradle holds your device while you hold a microphone",
      "Instrument input compatible with a variety of instruments; practice your favorite songs on electric guitar or keyboard or support the singer with musical accompaniment during Karaoke sessions; features two microphone inputs (one microphone included)",
      "Built-in auto voice controls (avc) which amplifies your vocals to achieve just the right Ratio between the music and your voice; avc ensures that the song's original vocals are dampened when you're singing so you can hear yourself loud and clear",
      "Built-in stereo 5-watt speakers deliver clear, crisp audio; built into the singstand's base, speakers are designed to project sound to every corner of your room and they can double as a speaker system for your MP3 player or tablet",
      "59 inches tall when extended to full length and its base measures 12 inches in diameter; convenient cord management clip is included so you can easily contain wires and prevent them from interfering with your performance"
    ],
    "specifications": {
      "Item Weight": "9.3 pounds",
      "Product Dimensions": "8.5 x 8.5 x 59 inches",
      "ASIN": "B0083FTVB8",
      "Item model number": "MKS-SS2",
      "Customer Reviews": "4.2 out of 5 stars1,652 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#4,756 in Musical Instruments",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 18, 2012",
      "Color Name": "Silver/Black"
    },
    "categories": [
      "Electronic Music, DJ & Karaoke",
      "Electronics",
      "Karaoke Equipment",
      "Home System Packages",
      "Systems",
      "Musical Instruments"
    ],
    "price": 72.29
  }
}