{
  "website_summaries": [
    {
      "verdict": "A popular gel for curly hair that has earned a loyal following of satisfied customers. Regardless of the type of curls you have, chances are DevaCurl Ultra Defining Gel will hold them.",
      "pros": [
        "Defines and holds waves and curls without feeling heavy or sticky",
        "plus it gives hair a nice sheen",
        "Contains moisturizing soy protein",
        "Holds up well in humid weather",
        "Just like other products by this brand, it doesn't contain parabens, sulfates, or silicone",
        "Available in 32-ounce bottles"
      ],
      "cons": [
        "Has the tendency to get a little bit stiff, but the results it delivers outweigh this minor concern"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Apply on damp hair",
      "text": "When I first applied it I was not happy because my hair became so hard and it gave me flashbacks of my cheap La Looks gel days. Well I looked at tips on youtube and they recommend your hair be fully wet. So instead of using a spray bottle I put my head under the sink. Applied gel while hair was damp and when it dried it looked and felt great. I will continue buying this product. I don't like their prices but the products are magical",
      "rating": 5.0,
      "verified": true,
      "author": "Parent4amazon",
      "helpful_votes": 50,
      "publication_date": 20180114
    },
    {
      "title": "Yes yes yes!",
      "text": "I absolutely love this product! Finally after all these years of looking for a product that will hold my curls and reduce frizz, my curls have never looked better!",
      "rating": 5.0,
      "verified": true,
      "author": "jkuoha",
      "helpful_votes": 74,
      "publication_date": 20170422
    },
    {
      "title": "CURLS!!!",
      "text": "I thought I had wavy hair until I used this product. I hated that my waves never looked good despite using different products so I flat ironed my hair for 10 years. After using this on my sisters recommendation I found I actually have curly hair. Since buying this 8 months ago I haven't touched a flat iron. I apply to my damp hair, let it air dry, then quickly diffuse my roots with a blow dryer. Best product for curls, hands down. Will never use another product again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 196,
      "publication_date": 20151222
    },
    {
      "title": "FAKE!",
      "text": "I would give this 0 stars if I could. I've been using Deva products for awhile and decided to invest in a large bottle. First of all, this smells NOTHING like the genuine product. I had some left over of an old bottle I purchased from the salon, and they smell completely different. The consistency is even different. Really disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Corvus",
      "helpful_votes": 89,
      "publication_date": 20151120
    },
    {
      "title": "15 Years Too Late",
      "text": "I'm Caucasian with frizzy, loose curly hair and I have NEVER found a product that works as well as this one. Follow the directions & put in very wet hair & when it's dry break it up & it works amazingly. I don't find the product to have much of a sent at all...especially when my hair dries. Seriously though, if you're debating on whether or not to get this, do it. It's pricey but worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Emilie W",
      "helpful_votes": 15,
      "publication_date": 20180119
    },
    {
      "title": "All Devacurl products have changed",
      "text": "Sorry to tell you ladies, this seems different because it is. I have been using Deva products since 2005 when I first moved to NYC and visited the original salon on Broadway in Soho. I know for a fact that the product has changed, along with all Deva products. When the company was bought out, everything changed. The good news is, the original owner / founder is about to launch her own line, which will stick to the simple, few ingredients like the good old days. In the meantime, if anyone has a recommendation for a great, mostly natural gel that doesn't leave my curls dry and knotty like this does, do tell!",
      "rating": 2.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 12,
      "publication_date": 20171101
    },
    {
      "title": "defined curls without a hard crunchy finish",
      "text": "This product is great at giving defined curls without a hard crunchy finish. I recommend combining it with a hair lotion to provide hold and touchable texture of natural hair. I used it right out of the shower when my hair was still damp/wet. I flipped my hair over, scrunched it with about a quarter sized amount (I have medium length hair) and then put my hair up in a turbie twistie. Slept on it overnight... in the AM I let it down to air dry the rest of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "MaralSLP",
      "helpful_votes": 5,
      "publication_date": 20181014
    },
    {
      "title": "Not real formula.",
      "text": "Similar to previous comments I bought this thinking it was going to be the original formula. Unfortunately this product is not the real one you buy at ULTA. The hair ends up getting super hard and the formula is extra sticky. I bought the bottle from ulta, it looks the same, but it does not work the same. I am unsure as to the reason but I will pay $40 from now on in order to get the real product.",
      "rating": 1.0,
      "verified": true,
      "author": "Less",
      "helpful_votes": 8,
      "publication_date": 20180125
    },
    {
      "title": "Curl it up!",
      "text": "Works every time! A little of this magic sauce and my wavy curls have a spring in their step and are ready to take on the world. Plus, I love the language on the copy about casting \"a moisture-protective veil\" on my curls. Golly, it sounds like they're either being hypnotized or walking down the aisle. How exciting!",
      "rating": 5.0,
      "verified": true,
      "author": "Cinnamon Bark",
      "helpful_votes": 11,
      "publication_date": 20161221
    },
    {
      "title": "Style without crunch",
      "text": "I've been using this for several months. I get compliments regularly on the scent of my hair and I have less fly aways. It holds my curls throughout the day. Sometimes encourages hair to be curlier if it's pretty humid. I have also switched to the Deva Curl shampoo and conditioner.",
      "rating": 5.0,
      "verified": true,
      "author": "C Wilkerson",
      "helpful_votes": 4,
      "publication_date": 20190701
    },
    {
      "title": "best gel evaaaa",
      "text": "Going into this i thought it was going to leave my hair hard, and nasty, so i was a little bit skeptical but after watching a review on youtube, I absolutely love this! It DOES NOT leave my hair crunchy or hard like other gels that've gotten before. Its probably the best thing that has happened to my hair. It does emphasize my natural waves that i already have. I just grab a little while my hair is still wet, and scrunch it into the ends of my hair, then i get a little more and scrunch it into the roots of my hair, and it leaves it perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 4,
      "publication_date": 20180207
    },
    {
      "title": "BEST curly hair product ever",
      "text": "The most amazing product for curly hair I’ve ever tried. I couldn’t recommend more for anyone with wavy or curly hair. It makes my hair much curlier than its ever been able to be with any other products - creating lots of ringlets that normally wouldn’t form. It gives my hair volume and definition without being crunchy or too stiff. It’s also so moisturizing - even after days in my hair, I wash it out and it’s not at all dry feeling - it actually feels more moisturized which is the opposite of what any other product would’ve done in the past. I use it with the curl cream and it’s just perfect. I couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "ECookies",
      "helpful_votes": 3,
      "publication_date": 20180912
    },
    {
      "title": "Give this a try!",
      "text": "Like the other reviews, this stuff is the bomb. I have wavy hair, and this really makes it curly. Follow the instructions - I comb my hair in the shower with conditioner and don't comb it again after. I put this in and scrunch, and about an hour later when my hair is more dry, I scrunch again to get rid of the \"wet\" look, and viola - perfect curls!",
      "rating": 5.0,
      "verified": true,
      "author": "J Water",
      "helpful_votes": 12,
      "publication_date": 20160304
    },
    {
      "title": "After 6 years, the new recipe causes hair loss!",
      "text": "I have used this product for 6 years. No change to diet or medicine and I have had significant hair loss recently. After learning about the lawsuit I stopped using for a week and I am back to “normal” hair loss. I cannot believe that this was being sold knowing that it causes such significant hair loss!!!",
      "rating": 1.0,
      "verified": true,
      "author": "T-Sea",
      "helpful_votes": 3,
      "publication_date": 20200530
    },
    {
      "title": "I didn’t like how my hair feels",
      "text": "I have curly, not very thick, freeze, long hair (I’m Mexican, our hair texture is different) tinted hair with highlights. I did what the brand recommends, I didn’t like how my hair feels, the texture is ugh! I’ve been used Ouidad and Curly Hair products the last 3 years, and I will continue using those brands, yes more expensive but it worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeanette Mendez",
      "helpful_votes": 5,
      "publication_date": 20180601
    },
    {
      "title": "Beware! Not the gel you think it is.",
      "text": "Don't know what this is but didn't make my hair look or feel like how it did when I first used this gel a few months ago. This amazon version is weird. Makes my hair even worse. Hair is 3b/3c with a little 4a in the back.",
      "rating": 1.0,
      "verified": true,
      "author": "DilMeg",
      "helpful_votes": 9,
      "publication_date": 20170815
    },
    {
      "title": "THE BEST product for curly or wavy hair!",
      "text": "Since flat ironing my curly hair for too long, I thought I had totally lost my natural curl. Or it was a product of age - or possibly both. I've tried very expensive curly hair products, drug store brands, you name it. Then I found this. It is amazing. Never crunchy or stiff, never sticky, and if you follow the directions you get beautifully defined curl or wave. I'm even hoping my corkscrew curls might return one day. Pay no mind to the user name, I'm a female with shoulder-length hair, purchased this on my husband's Amazon account. LOVE LOVE LOVE this product!",
      "rating": 5.0,
      "verified": true,
      "author": "luke skywalker",
      "helpful_votes": 5,
      "publication_date": 20170103
    },
    {
      "title": "Love the results. Like nothing else in the market.",
      "text": "Amazing stuff. My hair stylist showed me how to use it. How I do it: Use it when your hair is SOPPING wet, use a lot, clip it up, wrap your towel on and then do your makeup and what not. When you take your towel off your curls will be soft and defined all day. :D I use this with the other devacurl stuff and I LOVE the results.",
      "rating": 5.0,
      "verified": true,
      "author": "yinyangqueen",
      "helpful_votes": 21,
      "publication_date": 20160927
    },
    {
      "title": "Great wave/curl enhancer",
      "text": "I originally used the entire line of these products. The shampoo, conditioner, etc., but it’s a pricey upkeep. I recently discovered that just using the gel gives me the same results. For reference, I have thick, naturally wavy hair with a coarse texture that I use a lot of product to maintain. However, with this, I just use my normal shampoo and conditioner, apply the gel after showering and scrunch with a microfiber towel. The longer you go without flat ironing your hair, the best results this product will yield. I now wash my hair once a week. To touch up my waves, I wet my hair completely, scrunch out excess water with a microfiber towel and reapply the gel.",
      "rating": 5.0,
      "verified": true,
      "author": "AllisonWonderland",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "LOVE",
      "text": "I'm in love. I always hated my curls thinking if I wanted my hair to be curly I had to use mousse or gel that made them look crunchy and (in my opinion) unattractive. This gel is the opposite of that and especially paired with the coconut curl styler my curls come out soft, defined, and gorgeous. I never knew I could love my naturally curly hair this much.",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 8,
      "publication_date": 20160520
    },
    {
      "title": "Started buying Deva products through our stylist, then through ...",
      "text": "Started buying Deva products through our stylist, then through Ulta to be able to get the reward points. I was hesitant to buy online because I'd seen some reviews about Deva products being watered-down, but the gel we purchased came in exactly the same consistency as the bottles we've purchased in-person through Ulta and at the salon. The savings far outweigh any reward program at the beauty store, so we will definitely be purchasing our Deva shampoo, conditioner and gel through here in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "IndyMom",
      "helpful_votes": 5,
      "publication_date": 20170405
    },
    {
      "title": "Yaaaas!",
      "text": "I have REALLY THICK hair so my curls are always weighed down. I used this product and it brought out my curls! I really love the fact that it doesn't leave my hair feeling greasy or crunchy. Feels like my regular ol natural curls!",
      "rating": 5.0,
      "verified": true,
      "author": "Paige Giebel",
      "helpful_votes": 7,
      "publication_date": 20170121
    },
    {
      "title": "Buyer Beware!",
      "text": "I got this on the recommendation of my stylist. I’m not sure if it’s the shampoo, the One Condition Conditioner, or the gel, but my hair has never ever had knots, kinks, or frizzy until DevaCurl products came into my life. My hair has been breaking in half when I have it up in a pony (which has never happened before). I thought I was crazy or it was some health problem, but then I found out DC has had several complaints about chemical damage done to hair. Now I’ve got to cut my hair or buy expensive hair treatments. I’ll be contacting DC for a full refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Made me lose a ton of hair.",
      "text": "Deva Curl products made my hair fall out - sad because I loved them. Didn’t know DC was the problem until my hair stylist told me there were a bunch of people online talking about it. I quit using all my DC products and sure enough, my hair stopped falling out. I was losing an UNNATURAL amount of hair every time I showered and would just cry. It was scary!",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren Taggart",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "sleeping and waking with something manageable or pretty because I haven't",
      "text": "I have thick coarse wavy, sometimes curly hair (think of coochie hair on the head). This product isn't all it's cracked up to be. It didn't keep my hair from frizzing after it dried. Once it dries, it leaves this funky feel to your hair and forget capping or wrapping your hair, sleeping and waking with something manageable or pretty because I haven't. God forbid if you brush it. This product was recommended to me but it just wasn't a good fit. On the positive side, hence 2 stars, it smell wonderful,",
      "rating": 2.0,
      "verified": true,
      "author": "jlgreer",
      "helpful_votes": 3,
      "publication_date": 20160812
    },
    {
      "title": "I tend to use Eco Styler with great results but was looking to try a softer gel ...",
      "text": "I am a gel junkie. I tend to use Eco Styler with great results but was looking to try a softer gel to reduce the crunchiness of my hair. This gel dired out my hair with ZERO definition and very little hold. I do not recommend. I tried using less, and I tried using more. Now to use it up, I use it to hold twists in place when I'm protective styling - and even then, I can tell by how my twists feel that my hair is completely dehydrated.",
      "rating": 2.0,
      "verified": true,
      "author": "NCCMc",
      "helpful_votes": 3,
      "publication_date": 20160128
    },
    {
      "title": "Curls defined. Lightweight. Not sticky. Smells amazing.",
      "text": "Love the smell of this gel and absolutely amazing the curls I get. I have cut my hair from the middle of my back which gave amazing curls to a long bob and it still gave me defined and cute curls. The gel itself gives great curls.",
      "rating": 5.0,
      "verified": true,
      "author": "Tatyana Sturdy",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Dries my hair out",
      "text": "Heard about the product through r/curlyhair and wanted to try it out. However after just one use, this product has made my hair texture go from smooth to rough, dramatically increased the frizz in my hair, and barely maintained my curl pattern. I wanted to love this product - but I do not, whatsoever. Currently exploring options on returning this, because this product does not work for me. For clarity; I have South Asian black curly hair.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Helps with curls",
      "text": "This product has been very helpful with controlling my curls. I’ve tried several products as many with curly hair do and this has been a repeat purchase item. One thing of note, it is recommended to use with wet hair to get the best use out of it. Make sure to try that way before you fully judge it. As with any product different hair may get different results, with that said I feel this is a solid product and the company has a growing reputation of quality products.",
      "rating": 5.0,
      "verified": true,
      "author": "IA-MG",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "the absolute best and only curly product i use after trying many ...",
      "text": "the absolute best and only curly product i use after trying many many many different things. Put it in your hair when your hair is SOAKING wet, and IF it's at all crispy when it dries, clap your hands over your hair. You look crazy for a second but then crazy GOOD all day! ;-) splash your hair with water the next day to reactivate and get a 2-day 'do out of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "LOVE THIS GEL",
      "text": "I bought 3 of deva curl products and this was one of them, I LOVE the way it leaves my hair and how it defines my curls, at first when you apply it and defuse your hair it leaves a little cast, not too much, then when you scrunch the crunch it leaves your curls soft and defined, I was amazed how long my curls lasted and I only used a little bit, I will be buying this gel again and recommend it to all my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "PMTZ",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Just buy it.",
      "text": "I was skeptical of this stuff. I do not spend money on myself, especially $30 for a hair product I've never tried before. But omg I'm so glad I did! I have actual curls now instead of stringy waves. It does dry my hair out kind of after 2 weeks, so I take a day off once every 2 weeks and just use a leave-in (Shea moisture). I was so nervous using a GEL but it works wonders and once you scruch out the crunch, you're left with soft, gorgeous curls!",
      "rating": 5.0,
      "verified": true,
      "author": "Makeup Momma",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Nice and light, good for finishing touches",
      "text": "I use this along with the DevaCurl Frizz Free Volumizing Foam as a finishing touch for fly aways after using a diffuser. My hair doesn't curl very well with using the gel wet and allowing to air dry like the instructions suggest on the bottle. This gel gets a little crispy, which isn't my preference when use it with my diffuser, so like I said, I generally use it as a finishing touch vs a main product.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "3bc hair, not for me",
      "text": "I bought this because of the good reviews and because it was cheaper than Ouidad Curl Quencher Gel (which my hair LOVES!). This stuff is AWFUL. It feels very heavy on my hair. Now I am stuck with a Liter bottle. I will use it to completion because I cannot afford to buy anything else now, but this stuff is truly awful on my hair. Kudos for the peeps who CAN use it! I just cannot.",
      "rating": 1.0,
      "verified": true,
      "author": "tm820",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Buy this.",
      "text": "So happy I bought this. I finally took the plunge and went to a curly hair specialist recently and he was a miracle worker but the biggest shock was his liberal use of hair gel. Hair gel is scary and makes your hair weird and crunchy, right?? Wrong! Watch some videos about gel casting your curls and then buy this giant tub of gunk and never look back.",
      "rating": 5.0,
      "verified": true,
      "author": "R.LienTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Best Gel - Five Star",
      "text": "I love this gel! I just started learning how to deal with my curly hair and this product is wonderful. I put it on while my hair is still wet - before towel drying - and let my hair dry naturally or use a diffuser. When the hair dries completely it is mildly stiff depending on how much gel you use, but after you scrunch the hair up it softens up right away. No residue at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Christie M.",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "great curl set up",
      "text": "i have been going through a lot of different creams and puddings for my hair. just discovered the devacurl line and the no poo movement and finally figured out that my 3a needs a gel to help set up the curl. i love this gel and the smell is great. i recommend that you check out books on curly hair to see what type you had and then match up your products to your type. i also recommend using just conditioner to wash and a leave in to condition. this has been working for me so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie S.",
      "helpful_votes": 7,
      "publication_date": 20151127
    },
    {
      "title": "Great styling gel for CURLS!",
      "text": "Great product. Holds up to its claims. After I apply this to my wet hair and scrunch it, I don't touch my hair again until it's dry, then I scrunch it again to release the crunchy gel hold, and my curls are soft and beautiful! The other DevaCurl products I've tried have all been great, too.",
      "rating": 5.0,
      "verified": true,
      "author": "LV Tutu",
      "helpful_votes": 6,
      "publication_date": 20160129
    },
    {
      "title": "Amazing!!",
      "text": "This is the real deal! I watched the YouTube video to make sure I was applying it correctly to get the best curls. It is amazing! I got so many compliments on my curly hair the next day at work, I quit counting. EVERYONE said I should wear my hair curly. It is usually a big fuzzball that I flatten down with the straightener. I have so many hair products in my closet that did not work. I did not use their brand shampoo and conditioner first either. !! So happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Concerned",
      "helpful_votes": 4,
      "publication_date": 20160307
    },
    {
      "title": "READ INSTRUCTIONS FOR BEST RESULTS!!!!",
      "text": "Very well pack to prevent leaking. I initially thought I'd be returning or selling this product after the trying it twice and not getting the results I'd expected. Then while complaining about it I happened to glance at the instructions. SO HAPPY I DID. Keeping my hair saturated as opposed to towel drying it before apply made a TREMENDOUS difference. Not only for the day. I no longer have bushy bed head when I wake in the morning. More than pleased. ELATED.",
      "rating": 5.0,
      "verified": true,
      "author": "Cox Family",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Not for me",
      "text": "I really wanted to like this product but it just didn’t deliver. The smell is okay, it didn’t dry my hair but, it also didn’t give me volume or bounce to my curls. They went flat. I guess it’s okay for a day when you don’t care to really go crazy and fix your curls but for me it just left me with flat hair with no volume.",
      "rating": 2.0,
      "verified": true,
      "author": "Deby Semon",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Great smell. Very light gel. Not for me, however.",
      "text": "So this gel has some pros and cons. Pros: it smells nice. I love the amount of product you get (its huge!) And the pump is great. Cons: the gel is too light for my hair. No matter how much product I use I cant get enough definition and my hair frizzes within a few hours. For this reason alone I feel that it is much too pricey of a gel that doesn't even define or hold.",
      "rating": 3.0,
      "verified": true,
      "author": "Bethany Moore",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Kind of crunchy...",
      "text": "This left a texture similar to if I had applied regular hair gel through my strands. My hair appeared kind of crunchy and wet all day until I brushed it out, which make it look like I hadn't put any product in at all. Using less product didn't resolve this issue either. While I don't have super curly hair, I do have defined waves that need frizz taming, but this product just didn't do it for me. I guess it's good that the product size is so small so I won't feel so bad about wasting the rest. Oh well",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Holy crap...amazing!!!",
      "text": "This gel is unreal!!!! My curls just wanna do what THEY wanna do. This helps them get into shape! I do praying hands with the gel on super wet hair, scrunch with a t-shirt, wrap the t-shirt around my hair to \"dry plop\" for 20 minutes or so, then diffuse and scrunch when dry to break casting. This works wonders!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Erika Sullivan",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Same day of using the complete line, my hair is frizzy and brittle",
      "text": "My hair is a combination of type 2C and 3A; my hair is thick, coarse and no porous. I gave this product a year so allow type my hair to adapt to it. This product doesn't work for me. It doesn't provide hold(nothing: no light hold, no hold at all). I used the entire line and it let my hair to air dry, after my hair dries it looks frizzy, and brittle. There is no way I can get a second day when using this product, I have to completely wet my hair and start all over again.",
      "rating": 2.0,
      "verified": true,
      "author": "from Brooklyn, NY",
      "helpful_votes": 3,
      "publication_date": 20160705
    },
    {
      "title": "Love love love this",
      "text": "Love love love this!!!! I've been searching for years to find a control gel that didn't leave my hair crunchy. This leaves it soft! I run some through my wet hair and then run a drop through my dry hair. AWESOME!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 4,
      "publication_date": 20160413
    },
    {
      "title": "Great product",
      "text": "It seems to work just like the one I bought at the store! I was worried after readying and hearing that u can get bottles that will have added liquid so it’s not completely the product but it seems to be the real deal all the way!",
      "rating": 4.0,
      "verified": true,
      "author": "amber brown",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Lightweight, but not strong enough for the humidity",
      "text": "I have short, thick, curly and frizzy hair. I used a quarter size amount of gel to hold my curls in place. At first it worked great. I liked how lightweight the gel felt on my hair and it didn't crimp like other gel products do. But the gel didn't hold up well in the humidity. My hair was still frizzy and I would add more gel to fix it, but I didn't like how my scalp felt with the product build up. I might try the brand again but with a stronger gel.",
      "rating": 3.0,
      "verified": true,
      "author": "Leona",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Wow is all I can say",
      "text": "I finally found my product! I live in Coastal Georgia where there is a lot of humidity. My hair does not frizz with this product. I also don't wash my hair very often and the gel will last through to my next wash without reapplying. I can put my hair in a bun and let it or without any scrunchy creases. Worth the price. My hair is very soft and not crunchy at all. I receive a lot of compliments on my hair now. I apply this in layers, that is the key. No diffuser necessary.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 36,
      "publication_date": 20170629
    },
    {
      "title": "One of the best gels EVER!",
      "text": "This gel is amazing in my hair. I have thin wavy hair, but when I apply this gel (as taught in the Devachan Salon) my hair looks fuller and better. At first it may feel like it's going to stay with that wet look, but eventually with motion and scrunching it's gone. I feel like I have the amount of hair I had in my 20's when using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Pump works great, nice BIG bottle, perfect in shower & on counter. Great buy!",
      "text": "If you love Devs Curl gel, this is a good deal. The pump works really well and makes application on wet hair a breeze, as you don't have to pick up the bottle. I keep one in my shower for wash days and one in my room for refreshing. It was worth the money to have one of my favorite products right where I need it! The pump helps me use the perfect amount too, so it is lasting longer than if it was just in a regular bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "missy",
      "helpful_votes": 2,
      "publication_date": 20180721
    },
    {
      "title": "It works!",
      "text": "So i tried rhe light defining gell and 8t worked okay on my 3a/b hair but this works sooo much better at defining my hair and it actually last the hole day! The bottle size it pretty good right now (i just cut my hair to my shoulders) overall really good product. Bit on the pricey side but since i dont use that many products its not too bad",
      "rating": 5.0,
      "verified": true,
      "author": "Raquel",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Love this line!",
      "text": "I love this line. It really works will with the shampoo, conditioner and styling cream. *****UPDATE 3.21.18***** So.. though this line is amazing and it really does define your curls. I would recommend using the cream first and then the gel. The gel really dries your hair out so if you need extra moisture definitely use the cream first then the gel then possibly another cream after. Then when you toss your hair after air drying, make sure to toss with an oil or anti frizz to help with the dryness.",
      "rating": 5.0,
      "verified": true,
      "author": "Nay",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "My saving grace!",
      "text": "Absolutely LOVE this product! For years I hated my curly hair because it would always frizz up and have that awkward wave look to it. But for the past year or so I decided to stop using heat on my hair so I not only would have healthier hair but to try and grow it out pretty long. This has been my saving grace! When using this I have beautifully defined curls and no frizz! To top it off my hair stays very soft and flowy. I will be using this as my forever hair product and will recommend this to whoever I know has curly hair. ☺",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Wilson",
      "helpful_votes": 2,
      "publication_date": 20170105
    },
    {
      "title": "Almost Perfect Gel",
      "text": "LOVE this gel. I have curl hair and have tried practically everything. This product comes at a slight premium but I think it's well worth it. I put it in at night after I wash my hair and let it hair dry. I wake up in the morning, scrunch my hair a bit and I'm good to go. The curls look great and they last all day. I have it 4 stars instead of 5 because I wish it helped a little more with frizziness.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Works like magic! 10/10 WILL buy again!!",
      "text": "Here's how I wash my curls with devacurl: (All mentioned products are also devacurl and work just as well) 1. Wet and massage shampoo into the scalp 2. Rinse well 3. Comb conditioner through ends until de tangled and smooth 4. Rinse and dry hair (Finish with cold water rinse to reduce frizz) 5. Comb styling cream through hair 6. Rub the gel into both hands and \"crump\" hair (as seen in videos with curly hair) (7. Blow dry if you want, I air dry my hair because I'm always tired 😂) Hope this helped! Take care ♥️",
      "rating": 5.0,
      "verified": true,
      "author": "cinda",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "It's never crunchy!",
      "text": "Works great for slightly wavy hair to make it wavier - it's never crunchy!",
      "rating": 5.0,
      "verified": true,
      "author": "LiveFreeInHim",
      "helpful_votes": 2,
      "publication_date": 20171118
    },
    {
      "title": "No thanks!",
      "text": "I started using this product from amazon based on recommendations in a curly group. I liked the soft curls and it is easy to use. It took me a while to figure out that it was causing my hair to fall out- big time. Once I stopped using it, the hair loss stopped.",
      "rating": 1.0,
      "verified": true,
      "author": "Janine",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Didn't work on my hair",
      "text": "I have dry thick wavy hair and this did not work for me at all. I've had hit and miss success with different products and hoped this would work since I thought it was a good brand but nope. It does create some texture but it feels sticky and works up too much frizz for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "I works great to define your curls.",
      "text": "I works great to define my curls. I have porous wavy/curly natural hair. I use this gel in my routine after I have sealed my curls with Shea Butter and scrunched with a light amount of Kinky Curly Curling Custard. The custard provides the hold but this gel makes the curls come out. A little goes a long way. It is water soluble is not sticky at all. A bottle lasts a really long time. I would recommend this gel to all the curly girls I know.",
      "rating": 5.0,
      "verified": true,
      "author": "C.A. Puzio",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "a new go-to for me",
      "text": "I've gotta agree with the other curlies on here. This actually does work. I have really fine but thick hair. The trick really is letting it dry ALL THE WAY before you tousle your hair, otherwise it can look a little limp. If you follow the directions if wont be crunchy. Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 2,
      "publication_date": 20170710
    },
    {
      "title": "🤢",
      "text": "Makes your hair SUPER DRY!! Felt like dry ramen noodles and looked like it too. Terrible product and a complete waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle Mercer",
      "helpful_votes": 4,
      "publication_date": 20170320
    },
    {
      "title": "Not worth it",
      "text": "Read great reviews and tried the travel pack of Curly girl method and this product. I actually really liked the travel product. So I bought the large bottles in NoPoo, Conditioner, Gel and Cream. And it’s awful!!! My hair is always so greasy by the second day! I typically don’t need to wash my hair but every other or two days when I use Herbal Essence. For the money I think these products are NOT worth it. My hair was fuller which I like but it does not work as advertised by all the “curly girl methoders”. Also my conditioner arrived leaking in the box which I have YET TO RECEIVE AN EMAIL BACK O.",
      "rating": 1.0,
      "verified": true,
      "author": "Brittany Payne",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Didn't Work for Me",
      "text": "I wanted to love this product to the moon and back, but I just can't. However, I will definitely be trying other DevaCurl products. This particular one made my hair feel very heavy and very oily the entire time it was on my hair. I've got long, dark, curly/frizzy hair, not to mention THICK hair and this product somehow always felt like I was putting too much in, even if it was ever only a nickle sized amount.",
      "rating": 3.0,
      "verified": true,
      "author": "Lynda",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Class action lawsuits",
      "text": "Google the class action lawsuits. I thought I was going bald!!! Stopped using and it's now growing back😭",
      "rating": 1.0,
      "verified": true,
      "author": "chevyrider",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Defines curls, leaves them soft and smells so good!",
      "text": "This was my first time trying deva curls for myself and my kids, My curl pattern is a 2b and my kids are a 3b-c. Works incredibly well in both of my kids curls, defines without making them crunchy. Didn’t do as much for my curls, Might be a little too heavy for curls in the 2a-c range. Def works best if applied to hair while really wet, and it smells SO GOOD! Next time I’ll buy the bigger size since it works so well for both of my kids curls! I should also note I used it along with coconut creme.",
      "rating": 5.0,
      "verified": true,
      "author": "Lll",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "It’s ok",
      "text": "I have to use a lot more of this one compared to the same gel I purchase at Ulta, so while it’s cheaper I think it’s watered down or something, you end up using more, might as well go to the store and pay full price. Smells good as always though.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Open container made a mess of every item in the shipment",
      "text": "Product arrived open and was all over everything else in the shipping box. Very disappointed that there was no seal on what should have been a new hair gel. How can I trust that this is even the correct product in the bottle and not swapped out?",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "I swear by this!",
      "text": "I just bought this about a week ago. My hair is naturally curly but this gives it the 'oomph' it needs to make it a kinky curly. I don't use the amount the directions indicate on the bottle. I use about 6-7 pumps because I have long and a lot of hair. This is why I bought the 32 oz considering I use a lot product. Once I feel I have enough gel and have scrunched up to my roots, I use a microfiber towel to dry the excess water and let it air dry. I absolutely love this product and will be buying again once I run out, which will be soon. :'(",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "Five Stars",
      "text": "Love it. Helps to define your curls. A little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 2,
      "publication_date": 20171102
    },
    {
      "title": "Great Hair Product",
      "text": "Besides shampoo, this gel is the only hair product I use. I have a shoulder length bob and it keeps my hair styled from washing to washing. I do not need any hair spray and my hair is never sticky. I have used it for about 6 years and love it.",
      "rating": 5.0,
      "verified": true,
      "author": "dollswest",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Perfect curls",
      "text": "I have being using the product and noticed that my curls are much curlier than before. If I want a more defined look, then I put more but if I want a more natural look I apply less. I used to wait 45 mins to start drying my hair but with this product I find myself starting at 30 mins. Saves me 15 minutes, enough time to make another cup of coffee. Love this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina D.",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Didn't work for my curls at all",
      "text": "I really really wanted this gel to be the answer to my hair needs! I read so many of the reviews and had great hopes for it. I followed the directions and tips but this just didn't work for my hair at all. Left it still dry and frizzy. I will be returning it. I do have to say it smelled great! I am truly bummed that this gel didn't work out for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Emma LeBlanc",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "holds and shapes curls well",
      "text": "Product does hold curls...next day, curls still good with a little scrunch from wet hands! makes my scalp a bit itchy.",
      "rating": 4.0,
      "verified": true,
      "author": "V. DeChristofaro",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "That's a strong NO from me",
      "text": "It was a let down for me. My go-to gel is Ecostyler Argan Oil and that leaves my hair soft and shiny as well as great hold for 3-4 days which is amazing because I go to the gym 5 days a week. From other reviews I thought the DevaCurl was going to be even more amazing but I found it went on while watery, dried leaving a sticky and crunchy texture and gave me 1 day hold. I've already given it away. I'm very disappointed in this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamiko Smith",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Excellent product",
      "text": "Having curly frizzy unruly hair I have to say I absolutely love this product! Non-alcohol based formula takes my hair and keeps it from frizzing as well as drying out. I can’t tell you how many compliments I get on my hair when I use this product. It’s got a very subtle clean scent. Very good price for the quality and quantity of product.",
      "rating": 5.0,
      "verified": true,
      "author": "Luz",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "this stuff is great! First of all - it's vegan",
      "text": "OK, this stuff is great! First of all - it's vegan, so how great is that? Not tested on animals either! (GO Devacurl!) I have fine, curly hair and it gets frizzy really easily. I have medium length hair and I use a bit the size of a small bean. I scrunch my hair with it and it really helps to keep my ends together and lessen the frizz. A light pick softens it and my curls look great. I really love this stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 3,
      "publication_date": 20160117
    },
    {
      "title": "I like my herbal essence gel better",
      "text": "I'm trying to get away from using hairspray, so purchasing this gel i was trying to see if my hair would still frizz at the ends and sides or would it really hold my curls and last all day. I use this on days i really don't care how my hair looks or not \"all day hair\". still in search for products.",
      "rating": 3.0,
      "verified": true,
      "author": "jfloyd",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Gives me defined, soft curls for days",
      "text": "I bought this product after my Deva hair stylist used it on me with amazing results. I was so happy that using I was able to achieve the same results at home with this gel. My curls are defined and last for days. Just make sure to use plenty of gel (more then you think you need) on super wet dry, then \"scrunch out the crunch\" once dried.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Miracle in a bottle",
      "text": "This might be the only hair styling product I've used that actually does what it says it'll do. I've been using DevaCurl products for a few years now, but I was styling my hair with the cream instead of the gel. I've always been wary of gel products because I hate the crunchy hair look, but this gel leaves your curls soft and defined. If you have curls from root to tip like I do, this will help them keep their shape all day long. The cream just didn't have the hold I needed, but this gel definitely does. Highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 8,
      "publication_date": 20170330
    },
    {
      "title": "One of the best I've tried",
      "text": "I love this gel! I used to struggle finding a gel that made my curls look voluminous, but not frizzy, until I found this product. I will be repurchasing this again and again!",
      "rating": 5.0,
      "verified": true,
      "author": "T Ray",
      "helpful_votes": 2,
      "publication_date": 20180204
    },
    {
      "title": "Skip it if you don't want to dry out your hair!",
      "text": "Quite possibly the worst thing I've ever put in my hair. I was looking for more body, and haven't had an issue with my curls being frizzy or unmanageable. I used this and suddenly I look like the Lion from the Wizard of OZ. I'll stick to Carol's Daughter. Way too flaky, sticky residue, fragrance, and made hair super dry.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Burrell",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "MAKES YOUR HAIR FALL OUT",
      "text": "I am now recovering from this brand that is making women’s hair fall out all over the world. PLEASE look at further info about this product online. You can follow the curl ninja on IG and YouTube for more information.",
      "rating": 1.0,
      "verified": true,
      "author": "Samantha  Cervantes",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Can’t be real.",
      "text": "I’ve used Deva Curl and my waves were FLAWLESS. This is the first time I’ve ordered product from the internet and my waves are gone. I have dry, frizzy hair after using this gel, so I’m assuming it’s not the real deal. Also, the scent is GROSS. Like cheap dollar store hairspray. Mad mad MAD.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "FAKE!!!",
      "text": "This product cannot possibly be real...I can't picture devacurl making something that basically ruins your curls instead of improving them. This gel dries your hair out and makes your curls flat and straight. It makes my hair feel worse than a brillo pad. Please save yourself the hassle and buy only from the devacurl site.",
      "rating": 1.0,
      "verified": true,
      "author": "Gia15",
      "helpful_votes": 0,
      "publication_date": 20190212
    },
    {
      "title": "Great hold, great curls",
      "text": "I love this gel! I’ve been using it for a few years and can’t imagine using anything else! It helps create more curl where sometimes there is just wave and controls the frizz. I highly recommend this gel.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather M.",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Offers great, long lasting hold",
      "text": "I have type 3C/3B curls and low porosity hair, this product is great for defining my curls and holding them for at least 24 hours. The reason why I’m not going to use it anymore is my curls always felt dry after styling despite having great hair care products & routine",
      "rating": 3.0,
      "verified": true,
      "author": "Serena",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Best quality, best curls for years!",
      "text": "I've been using DEVA styling products exclusively for at least 7 years, maybe more. I've never had any trouble and my hair has been its healthiest and most gorgeous. Highly recommend for naturally curly people.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen H",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Not crunchy...just right!",
      "text": "Perfect! Switched from Aveda Confixor liquid gel which was way too sticky and left my curls crunchy. The devalcurl \"ultra\" defining gel is just right with defining the curl and keeping the freeze to a minimum. I have yet to try the devalcurl light defining gel... Would say this is a must if you live in a humid climate like we have in North Carolina.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Hedman",
      "helpful_votes": 4,
      "publication_date": 20150820
    },
    {
      "title": "Love the fact that it's silicone free",
      "text": "Love the fact that it's silicone free! It works great in my hair to keep away frizz all day long. Keeps my curls defined.",
      "rating": 5.0,
      "verified": true,
      "author": "rla",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "Amaaaaaaaaazing",
      "text": "I can't say enough good things about this gel. I have a 3b/3c curls , Halve of my hair is curly and the other halve mildly relaxed and I was about to cut it. I v been using this gel since a month with devacurl no poo and one conditioner and deep condition my hair with a free silicon deep conditioner once a week, my curls are back and my hair is unbelievably soft and bouncy . Am in love with my curls 😍😍😍",
      "rating": 5.0,
      "verified": true,
      "author": "dalila",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Happy to use it",
      "text": "Omg LOVE IT! When I use this hair gel it makes my hair stiff feeling initially but with lots of body. If you follow the directions it will work. My hair is more wavy but Made my hair a little more curly.",
      "rating": 4.0,
      "verified": true,
      "author": "Krys228",
      "helpful_votes": 2,
      "publication_date": 20160526
    },
    {
      "title": "Crack the curly  hair code",
      "text": "I feel like I have cracked the curly hair code on this one. I have been fighting the war of the curl for years. This is the BEST defining gel I have ever used. Believe me I have wasted tons of money on what has not work. I first put in the Deva daily conditioner and got back over with this gel.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Jones",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "Best product for defined, frizz-free curls!",
      "text": "I have been using the Devacurl Ultra Defining Gel for at least 2 years now and I can't live without it! I put a 3-4 pumps on my wet hair (after squeezing a little of the water out first), scrunch with a microfiber towel, and then let my hair air dry. Once my hair is completely dry, I scrunch with my hands to \"release\" the stiffness of the gel. I'm left with perfect, frizz-free curls all day. I used to fight my curls and straighten my hair every day, but now I love them and this gel is a huge part of the reason!",
      "rating": 5.0,
      "verified": true,
      "author": "mbarrett",
      "helpful_votes": 2,
      "publication_date": 20160317
    },
    {
      "title": "Leaves hair dry/rough",
      "text": "Sadly for me, it does not feel moisturizing at all and it leaves my hair looking AND feeling dry. I have color-treated and fine hair, so I prefer the Ouidad climate control humidity gel because it makes my hair feel soft, shiny, and moisturized. I wanted to give this one a try because of the great price. I still have the full bottle and regret the purchase though.",
      "rating": 3.0,
      "verified": true,
      "author": "Esther",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Garnier's Curl Nourish line works better for me and is way cheaper",
      "text": "I've tried a lot of deva curl products. The shampoos and conditioners do not work for me. Honestly, Garnier's Curl Nourish line works better for me and is way cheaper. But I can't find anything better to style my curls with on a daily basis than this gel (which does not look at all like crunchy once your hair dries). This has a strong hold and makes curls look great. If I want my curls to feel moisturized too, I use a leave in conditioning serum along with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan S.",
      "helpful_votes": 2,
      "publication_date": 20171129
    },
    {
      "title": "Good, not Great",
      "text": "For the price, this is not a great buy. The product is nice for curls, but you can get equitable products for much less. The gel goes quickly! Probably won't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Tammy L. Stuck",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "I have had super curly hair my whole life and had always had ...",
      "text": "I swear by deva curl products, I have had super curly hair my whole life and had always had a problem with the curls looking flat or frizzy. After hurting my hair very short and a long process of straightening daily my curls just weren't the same. A friend recommended the deva curl line to me and I will never go back to anything else, my curls have never looked better. This product keeps my curls looking great all day and even for the day after if I needed!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "I don't like the way this holds my curls",
      "text": "I don't like the way this holds my curls. They seem very loose and doesn't tighten up like usual. Although every hair is different it's just not for me. Smells good though and is not sticky.",
      "rating": 2.0,
      "verified": true,
      "author": "Rosanna Pineda",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "Awesome gel",
      "text": "Works well on my thick, wavy hair. This was recommended by a friend whose curls looked great. I ordered it right away. The first time I used it, I was pleased with the good shape and frizz control, and the spirally waves in my long hair. Not a greasy look or feel at all, my hair feels soft to touch. This is at the height of a hot, humid summer. I expect in winter I can use the same gel, just less of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ticorella",
      "helpful_votes": 0,
      "publication_date": 20170802
    }
  ],
  "product_meta": {
    "title": "DevaCurl Ultra Defining Hair Gel, 32 Fl Oz (Pack of 1)",
    "rating": 4.2,
    "feature_bullets": [
      "Hydrating– award winning lightweight non-drying gel that gives strong curl control and enhance definition without the frizz or crunch; awarded Favorite Product for Wavy Hair by Naturally Curly",
      "Strong Flexible Hold- strong-hold styler surrounds your curls with a non-sticky; protective curl cast that sends frizz packing and enhances your curl shape and definition",
      "Nourishing- unique formula; made with wheat and soy proteins; locks in moisture; amps up shine and helps your curls defined",
      "Beautiful Scent- tropical scent of Starfruit & Mango is sunny and succulent",
      "DevaCurl Promise- all DevaCurl products are 100% sulfate; paraben and silicone free; vegan; wheat-free and cruelty free"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "3.3 x 3.3 x 10.5 inches; 2.4 Pounds",
      "Item model number": "U-HC-8043",
      "Department": "Womens",
      "UPC": "698798654392 793379279596 784190275416 798711602940 859413000899 885292481498 787734152778 000000016162 755332305469 784922340672 787734517973 850963006737 616919135391 786951306537 885264657456 987502408681 787734419550 787734795418 794437148939 755332174461",
      "Manufacturer": "DevaCurl",
      "ASIN": "B008COP6NM",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Gels",
      "Hair Care",
      "Styling Products",
      "Beauty & Personal Care"
    ],
    "price": 30.0
  }
}