{
  "website_summaries": [
    {
      "verdict": "The Acer Iconia W510-1422 goes all day long and most of the night, with a highly portable design, and a docking keyboard that lets you choose between laptop and tablet.",
      "pros": [
        "Seriously long battery life",
        "Immensely portable",
        "Windows 8"
      ],
      "cons": [
        "Atom processor is slow",
        "Webcam lags",
        "Limited storage space"
      ],
      "aspects": {},
      "publication_date": 20130123,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Total waste of money",
      "text": "This computer has been one problem after another. I've had most of the problems others had. Bad touchpad, unresponsive keyboard, poor touch response, poor performance. The keyboard dock won't charge anymore, which is a real bear. I have to remove it from the keyboard to charge, and the micro-usb on the side fits my OTG cable so poorly, that regular usb devices are pretty much out of the question while not docked. What a waste of money this has been! And the customer support has been awful. Really awful. Acer'd give Verizon a run for it's money as the worst customer service of all!",
      "rating": 1.0,
      "verified": true,
      "author": "Quasi Stomach",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "Loving this tablet and I have only had it for a few days!",
      "text": "It is pretty fast overall, very smooth to the touch. Windows 8 takes a little getting used to but once you go through their tutorials which may take 15-25 minutes you pretty much know how to use Windows 8. I was debating between this one and another tablet, this one came with a keyboard so I went with it and it was a good price. I really wanted a Microsoft Surface but they were just too expensive, so I decided to get this one. I use it mainly for emails, browsing the web, and watching some things online. I highly recommend getting the 64gb version because Windows 8 eats up about 20gigs of space.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul M. Frasca",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "Waste of Money!!!!",
      "text": "The Acer Iconia that I purchased had so many software and hardware issues that Acer Repair had the machine more than I did. Finally after a year and endless repairs Acer supplied new hardware (without the keyboard dock) only to have that start with software and hardware issues. If you want to constantly be sending your equipment away for repairs and arguing with customer service about the problems your having - this is the product to buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Jule",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Very disappointed!  Expensive Mistake --very slow and I mostly use for my Office 365 and access the cloud.",
      "text": "Very disappointed! Expensive Mistake --very slow and I mostly use for my Office 365 and access the cloud. I do some web browsing and some minor documents. Slow as molasses! Argh -- I have tried to make it work for the past several years =- -but it is creating such stress that I am junking it and buying something else!",
      "rating": 1.0,
      "verified": true,
      "author": "Mari",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Back to the shop",
      "text": "Keyboard dock worked for 2 hours, then died completely. Acer requires that *I* pay to have the whole unit shipped to a repair facility, where they advise me the machine will be wiped. Have been on the phone with tech support for half an hour and am still struggling with them to get the return process finished. Fine machine, except that it doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Jernigan",
      "helpful_votes": 2,
      "publication_date": 20121226
    },
    {
      "title": "Great Deal and Great Challenge",
      "text": "am really satisfied with my purchase. I really think this is a very good and suitable “Tabletbook” for a good price. I made a research first in the local market in México and the price was almost twice. The only thing that is kind of delaying my full enjoyment of my new very own and portable computer is the new Windows 8 version that I need to get familiar with. I know it’s a matter of time so, I believe it was a good decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20130520
    },
    {
      "title": "Acer Iconia W510",
      "text": "i like the tablet but the mouse pad, not sure why it did ntohave 3 button function. Windows 8 needs soem more work, it is not there yet. i have to say Amazon service is wonderful. The first one I got has some mul-function. Amazon got the repalceement to me overnight before I even get to send out my broken one. and, all the exchange processes are performed online without any interaction with a live person. Love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130102
    },
    {
      "title": "Acer Iconia W510-1422",
      "text": "This is a nice little unit. Battery life is amazing. I plug it in 1 or 2 times a week and use it daily. It is no i5 or i7 but I didnt get it to replace my desktop gaming machine. Very portable and very efficiant for my needs. I dont have any issues that others have had. There is a firmware update that I would recommend you do right off.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20130404
    },
    {
      "title": "good features poorly execution",
      "text": "the iconia clovertrail tablet pc has a great set of specs but it falls short in delivering a satisfying user experience. besides the win8 makeover the touch screen does not feel consistent. both touch location and sensitivity are variable depending on application and locatiion on screen. pretty annoying. could not do a radio button selection, instead it kept grabbing the text for copy selection. i had to magnify a lot to touch the selection. overall build quality is good and the keyboard dock is excellent.",
      "rating": 3.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 0,
      "publication_date": 20130206
    },
    {
      "title": "annoying issues...",
      "text": "1. powers off intermittently 2. loses audio on its own 3. Freezes occasionally there are numerous +ves abt this tab/pc but the 3 cons out-weigh all the positives as stated by all the other reviews; im on the verge of returning... 20 Jan 2013 I really would have liked to keep this tab/pc but soon afterwards (1 day) after experiencing the power problems the unit shut off and never came back on although the battery is fully charged or the charger was plugged in.",
      "rating": 2.0,
      "verified": true,
      "author": "snare",
      "helpful_votes": 2,
      "publication_date": 20130117
    },
    {
      "title": "Extremely portable. Had some issues with the keyboard. ...",
      "text": "Extremely portable. Had some issues with the keyboard. It was not working for quite some time. The tablet itself works well. Had some issues with faulty pixels, but it seemed to sort itself out. If you can handle the bugs in the hardware, go for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Motts",
      "helpful_votes": 0,
      "publication_date": 20141022
    },
    {
      "title": "Too many stickers and surface textires",
      "text": "This is a GREAT W8 tablet/Laptop. The only things I wish they'd perfect are getting rid of the zillion stickers all over the thing, and smooth our the surfaces with \"Acer\" etched in them. You can feel while holding it in your hands. They don't cause any real problems, but just make it feel less than perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Fuchs",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Upgraded to this tableting keypad",
      "text": "Upgraded to this tablet and keypadThis made my job easy got a lot more customers may think I can shoot pictures I shall do what they got right then and there those of the right tool and with the card excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Robinson",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "unexpectedly good tablet/laptop",
      "text": "do not be turned down by the fact that it has Intel Atom as CPU. This device is extremely fast if you use the Windows 8 UI with Internet Explorer 10. It is much faster than my ultra-book with i5. If you use it in the desk format with Mozilla Firefox, it lags and Mozilla crashes a lot and makes the tablet to freeze. It seems that Windows 8 is designed to work incredible fast and it is very stable when used with the new Internet Explorer 10. So far, the tablet/laptop combination does everything it is supposed to,performing very well, and the battery is extremely good.",
      "rating": 5.0,
      "verified": true,
      "author": "Audri",
      "helpful_votes": 4,
      "publication_date": 20121212
    },
    {
      "title": "Acer tablet",
      "text": "Shipped quickly and in good condition. Love this little thing. It's a little touchy but I'm learning. Plus windows 8 was hard to get used to. I learned not to forget my password. It won't work if you forget.",
      "rating": 5.0,
      "verified": true,
      "author": "Violet Kirkendoll",
      "helpful_votes": 0,
      "publication_date": 20130924
    },
    {
      "title": "Very good product, but...",
      "text": "I am satisfied at a reasonable level with my Acer Iconia W510-1422, but I have at least one complain about it: the battery of the keyboard-dock does not mantain the charge while it is not in use. About three days after a full recharge, with nearly no use in the meanwhile, the battery drains totally. I am considering to schedule it for repair, but to do this I have to return both the tablet and the keyboard dock to the Acer America service facility. Tablet's battery performance is okay (lucky me).",
      "rating": 4.0,
      "verified": true,
      "author": "ONELIA GUTIERREZ",
      "helpful_votes": 0,
      "publication_date": 20130505
    },
    {
      "title": "Good tablet.",
      "text": "In a few words, my Acer W510 has worked perfectly, using it for 3 weeks now. It's fast for having an Atom processor. The keyboard is a good solution for writing fast emails, but not so good if you want to work a lot with it. I've replaced mi iPad 3 with this small tablet because the keyboard, flash compatibility and full Office 2013 capability is what I need in a tablet. Althoug, I would never replace a laptop for this. It has never crashed and has never run slow.",
      "rating": 4.0,
      "verified": true,
      "author": "Andres Orvananos",
      "helpful_votes": 2,
      "publication_date": 20130408
    },
    {
      "title": "Bad choice on my part",
      "text": "Slow, touch screen is NOT very responsive. Top heavy. No comparison to an Android tablet. Bad choice on my part.",
      "rating": 2.0,
      "verified": true,
      "author": "Brian Matthias",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "Dog slow",
      "text": "This machine runs like a P100 from 1999, if you want to sit around waiting for things to load for up to five seconds on every click this is the machine for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Wage",
      "helpful_votes": 0,
      "publication_date": 20131220
    },
    {
      "title": "Troubles from the start bad customer service",
      "text": "This laptop looks nice and the tablet is nice BUT my keyboard does not work and I get errors where it shuts down every day. The support staff has an attitude and was not able to help me. They offered to repair it but I paid for a new laptop not a refurb. I am in the process of attempting to get our money back even though support told us they don't do refunds. Save yourself the aggravation and don't purchase an acer.",
      "rating": 1.0,
      "verified": true,
      "author": "Rick Hamilton",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Laptop",
      "text": "I like this tablet but it is taking time to figure out Windows 8. I am in a class to learn how and tablet is getting to be fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Love Love Love It",
      "text": "Easy to use, one touch - runs microsoft standard office products - totally replaces my laptop when traveling. Next move is to put all my files in the cloud and eliminate the need for an external drive for work files, pics, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "Love it! My best electronic purchase in a while.",
      "text": "Love how I can unclip it and take it to the couch, play Pinball and get back to writing my blog. Alt+Tab is king!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DA",
      "helpful_votes": 0,
      "publication_date": 20130307
    },
    {
      "title": "BIOS Update Fixes Issues",
      "text": "I bought this tablet in December. I was recently prompted by the Acer-installed Live Updater program that BIOS update v2.08 was available. This update fixed these issues that have been common with this device: - inability to effectively move cursor with trackpad - hard re-boot required after device goes into sleep mode - long delay with connecting to wifi I can now remove any reservations I've had with recommending this device provided this update is installed. As long as the buyer understands the benefits as well as trade offs with this device's hardware, form factor (hybrid tablet) and feature set, and does not expect it to be something it is not, it's a very cool device to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 4,
      "publication_date": 20130212
    },
    {
      "title": "Almost there",
      "text": "Although I will be returning this item because it doesn't fit my needs, it was excellent in the modern UI. I loved how all the included and installed apps performed. I just felt like MS. Paint as well as IE on the desktop weren't good enough for a hopeful graphic artist like myself. I probably will buy this item again in the summer, but for now it's best for me to send it back.",
      "rating": 4.0,
      "verified": true,
      "author": "Izzy",
      "helpful_votes": 2,
      "publication_date": 20130226
    },
    {
      "title": "Best pctablet",
      "text": "I highly recommend this product; it met all my expectations. Excellent camera with flash. I love the operating system. It is a great investment. - comment from BELIZE C.A.",
      "rating": 5.0,
      "verified": true,
      "author": "Rojer Acosta",
      "helpful_votes": 0,
      "publication_date": 20130328
    },
    {
      "title": "Acer Iconia W510-1422 10.1-Inch 64 GB Tablet with Keyboard Dock (Silver)",
      "text": "I am very pleased with my new Acer tablet and would recommend it very highly to my friends and/or family.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne M. Dixon",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Wow!!  We Absolutely LOVE it! - don't wait -just buy it!",
      "text": "I ordered one for my teenage daughter for her birthday. She absolutely loves it!! It's been hard for my wife to even get her hands on it to try it out. SO... I'm getting two more - one for my older daughter and one for my wife. It's that good!! The overall construction is first rate. The battery life is incredible. The UI is very intuitive and very fluid. I LOVE Windows 8. In summary, if you're looking at a great tablet that can also be used as a decent PC - just order this. You won't regret it.",
      "rating": 5.0,
      "verified": true,
      "author": "civilized barbarian",
      "helpful_votes": 7,
      "publication_date": 20121217
    },
    {
      "title": "Feel great with the product",
      "text": "It is small, easy to take for business trip,. It can solve the problem of office usage. I have no need for computer game, so it just suitable for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Quan Yuan",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "excellent warranty",
      "text": "I had problems with the operation of the keyboard dock and the tablet, and the company bestdigitalbuy changed my keyboard dock and sent me recovery software now works great",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "The keyboard it is not like it is shown in the picture",
      "text": "The keyboard it is not like it is shown in the picture, in fact it's totally defferent, but it is working",
      "rating": 2.0,
      "verified": true,
      "author": "mariano cavallo",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "Defected",
      "text": "Got it with some defects: camera, sound and volume button. Replaced an order we'll see what happens. So far feels like Acer's QA team is entirely on vacation.",
      "rating": 2.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20130424
    },
    {
      "title": "Good Tablet",
      "text": "It's a versatile, powerful and easy going pc/tablet. It's fast for a tablet but slow for a pc. But the versatility overcomes it's lack in speed.",
      "rating": 3.0,
      "verified": true,
      "author": "Odracir80",
      "helpful_votes": 0,
      "publication_date": 20130520
    },
    {
      "title": "I love it",
      "text": "Nothing to explain. Everything is awesome about acer iconia w-510 and also windows 8. I truly reccomend it to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Wieckowska",
      "helpful_votes": 0,
      "publication_date": 20130226
    },
    {
      "title": "Good reliable tablet",
      "text": "It is good, fast hybrid tablet. It comes with W7 and other acer software. Keyboard docking is little bit heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Fty183",
      "helpful_votes": 0,
      "publication_date": 20131025
    },
    {
      "title": "Major Flaw",
      "text": "Product is great for productivity after you get used to the small keyboard. The battery life is phenomenal. A huge flaw with this product is the faulty track pad which causes the moue to jump all over the screen. No amount of firmware updates have fixed this and you have to send the base back. Even then the new one you get may have the same problem. These are 1st gen, wait until 2nd gen come round before you buy this.",
      "rating": 2.0,
      "verified": true,
      "author": "Emmett Power",
      "helpful_votes": 0,
      "publication_date": 20130726
    },
    {
      "title": "Not enough power",
      "text": "We purchased this to use on a job site and it did not have enough computing power to be able to run our programs.",
      "rating": 2.0,
      "verified": true,
      "author": "H. Ervin",
      "helpful_votes": 0,
      "publication_date": 20130617
    },
    {
      "title": "Acer",
      "text": "Great tablet and great value. No issues and works great. A little top heavy when attached to keyboard but overall satisfied.",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "used product sent",
      "text": "I received a used tablet. Not really sure what game amazon is playing but it was just trully disappointing. I couldnt even register or login to set the tablet.",
      "rating": 1.0,
      "verified": true,
      "author": "e's.review",
      "helpful_votes": 0,
      "publication_date": 20130713
    },
    {
      "title": "32GB?",
      "text": "Well actually everything is ok with the item,but the SSD,the hard drive,is actually only 32 GB!I cannot accept this!Buying a 32GB one with the price of 64GB!",
      "rating": 1.0,
      "verified": true,
      "author": "Kc",
      "helpful_votes": 0,
      "publication_date": 20131009
    },
    {
      "title": "Sound fail",
      "text": "Loved the table, size, look but two now have had the sound system fail. I wanted it for movies, as well as work not into fuzzy sounds or silent movies. Cost me $50.00 to have professional computer guy to set it up, and $30.00 to have all personal information removed. Costly for nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20130315
    }
  ],
  "product_meta": {
    "title": "Acer Iconia W510-1422 10.1-Inch 64 GB Tablet with Keyboard Dock (Silver)",
    "description": "Acer Iconia W510-1422 Tablet comes with these high level Specs: Intel Atom Dual-Core Processor Z2760, Windows 8, 10.1-Inch HD 1366 x 768 resolution high-brightness (350-nit) Acer CrystalBrite LED-backlit TFT LCD, 5-Point multi-touch screen, supporting finger touch and image auto rotation, Intel Graphics Media Accelerator with 64MB of dedicated system memory, High-definition audio support, 2048MB of LPDDR2 800 MHz Onboard memory chip support , 64GB Internal Storage, Acer Invilink Nplify 802.11a/b/g/n Wi-Fi Certified , Bluetooth 4.0+HS, 8MP Rear-facing HD camera, 2MP Front-facing HD camera, 1 - Micro USB 2.0 Port, 1 - Micro-HDMI with HDCP support, 2-Cell Li-Polymer (3540 mAh) Battery, Up to 9-hours Battery Life, 1.27 lbs. 0.58 kg (tablet only) - INCLUDES Keyboard Dock\n\nAMAZON.COM",
    "rating": 3.2,
    "feature_bullets": [
      "Windows 8, 10.1-inch Touch Display",
      "Intel Atom Dual Core Z2760 Processor 1.5 GHz (1 MB Cache)",
      "64 GB Internal Memory, 2 GB RAM Memory",
      "Up to 18-hours of battery life (with Keyboard dock), 802_11_BGN wireless"
    ],
    "specifications": {
      "Standing screen display size": "10.1 Inches",
      "Max Screen Resolution": "1366 x 768 Pixels",
      "Graphics Coprocessor": "Intel Integrated Graphics",
      "Graphics Card Ram Size": "64 MB",
      "Wireless Type": "802.11bgn",
      "Number of USB 2.0 Ports": "1",
      "Average Battery Life (in hours)": "9 Hours",
      "Brand": "Acer",
      "Series": "Iconia W5",
      "Item model number": "W510-1422",
      "Hardware Platform": "Windows",
      "Operating System": "Windows 8",
      "Item Weight": "2.77 pounds",
      "Product Dimensions": "10.18 x 6.6 x 0.35 inches",
      "Item Dimensions  LxWxH": "10.18 x 6.6 x 0.35 inches",
      "Color": "Silver",
      "Rear Webcam Resolution": "8 MP",
      "Processor Brand": "Intel",
      "Processor Count": "2",
      "Computer Memory Type": "DDR2 SDRAM",
      "Flash Memory Size": "64 GB",
      "Hard Drive Interface": "Serial ATA",
      "Power Source": "Battery",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B009P7JJEC",
      "Customer Reviews": "3.2 out of 5 stars112 ratings3.2 out of 5 stars",
      "Best Sellers Rank": "#309,686 in Electronics",
      "Date First Available": "October 26, 2012"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Computers & Tablets"
    ],
    "price": ""
  }
}