{
  "website_summaries": [
    {
      "verdict": "Product gets out stains and doesn't leave a residue.",
      "pros": [
        "Very concentrated",
        "Does not require much detergent to work well",
        "Leaves clothes soft",
        "Many people found this product helped to clear up their skin irritations from other detergents",
        "Less expensive than diaper cleaning brands, but works just as well"
      ],
      "cons": [
        "This product doesn't seem to clean as well as some of the other best choices"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Chemicals included.",
      "text": "methylisothiazolinone and benzisothiazolinone (synthetic preservatives) - deceiving advertisement. \"... researchers conducted two recent laboratory studies on rat brain cells, and found that MIT caused damage to those cells. The researchers stated, “a brief exposure to methylisothiazolinone, a widely used industrial and household biocide, is highly toxic to cultured neurons....”",
      "rating": 1.0,
      "verified": true,
      "author": "Y. Cos",
      "helpful_votes": 354,
      "publication_date": 20160404
    },
    {
      "title": "Good!",
      "text": "This stuff is so weird. It works. It gets out stains. Leaves no residue behind and makes me feel better about what’s coming into contact with my children’s skin. It’s just weird it has no smell. For my whole life, smell was equal to cleanliness. Is this shirt dirty? I don’t know, what’s it smell like? Is out the window. Everything just smells like cloth. Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Pvirre",
      "helpful_votes": 33,
      "publication_date": 20171126
    },
    {
      "title": "and 8 years old and their clothes get really dirty. This detergent just wasn't strong enough at getting ...",
      "text": "It just didn't seem to get the laundry very clean. I have boys who are 2, 4, 6, and 8 years old and their clothes get really dirty. This detergent just wasn't strong enough at getting stains out.",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon McGarry",
      "helpful_votes": 25,
      "publication_date": 20180615
    },
    {
      "title": "Great for sensitive skin",
      "text": "I have sensitive skin and have been using this detergent for years. I like how it does not have a strong scent and always gets tough stains out of my clothes. I even trusted this detergent with my newborn daughter's clothing and other washable items.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany B.Top Contributor: Baby",
      "helpful_votes": 24,
      "publication_date": 20170303
    },
    {
      "title": "Great stuff. I am a customer for life if they don't change the formula",
      "text": "This stuff is awesome. My baby broke out from tide and gain, so we use this and honestly it works so great on stains and odor. It is scent less and got blueberry stains out of a white tshirt that I washed a day later!! You don't need much either. Ultra concentrated.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen says",
      "helpful_votes": 49,
      "publication_date": 20150507
    },
    {
      "title": "I've noticed that the colors of our clothes are really dull now. I may try to switch brands and ...",
      "text": "I use this detergent because it's non-scented and I have a baby. I've noticed that the colors of our clothes are really dull now. I may try to switch brands and see if it makes a difference.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachael Royal",
      "helpful_votes": 33,
      "publication_date": 20170623
    },
    {
      "title": "Allergic reaction",
      "text": "I would not recommend this product at all. I have had a very uncomfortable allergic reaction to it.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 13,
      "publication_date": 20190414
    },
    {
      "title": "GLUTEN FREE and NO ANIMAL TESTING",
      "text": "We have been using Free & Clear for years. It works on absolutely all stains except the rare ones for which you really need bleach. It is absolutely scent free and hypoallergenic. It also has the words GLUTEN FREE in small print on the back. Furthermore, the company website indicates that they have NEVER tested on animals; they use human volunteers. Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "DisneyDenizen",
      "helpful_votes": 9,
      "publication_date": 20180916
    },
    {
      "title": "Have allergies? Seventh Generation works for me!",
      "text": "I used Sears laundry soap all my life due to allergies. Dreft, All and others are still to harsh on my skin. I had a skin test done at my dermatologist and they found out more than my allergist. They gave me a list of laundry soap to try and I choose Seventh Generation first. It's been working great for me. I don't like the scents as I'm allergic to perfume so this is perfect for me and my family. Our clothes and towels feel clean and I'm happy not itching all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2",
      "helpful_votes": 3,
      "publication_date": 20191113
    },
    {
      "title": "Very small bottles, Over-priced for the amount, but it's a good product",
      "text": "40 oz. sounds like a lot but it's not. Not Even Close. I won't be buying this size again and will look for much larger bottles to minimize the amount of plastic. Considering how small these bottles are versus the price I paid for them, I feel ripped off. It's important to me to avoid scented laundry detergent/soap (it bothers my husband's allergies and I dislike all the scents I've smelled) and that's why I bought this brand but I'll try to hold off until I can find the brand \"All\" in its huge container. I've had satisfactory experience with that brand of no-scent laundry detergent.",
      "rating": 3.0,
      "verified": true,
      "author": "C. R. Russell",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Better than a few others...",
      "text": "I have been on the hunt for clean laundry detergent that doesn't have a scent but actually makes my laundry smell better. I have two boys and a husband, which makes for smelly clothes. I have tried Molly's Suds and Biokleen and none of them really get the smell out except this one (Biokleen does better than Molly's IMO). It's a little pricey compared to regular detergent, but it does the better job of the three.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin M.",
      "helpful_votes": 2,
      "publication_date": 20200511
    },
    {
      "title": "Clothes began smelling sour and/or of body odor and got worse over time",
      "text": "My daughter is allergic to a group of chemicals commonly found in many cleaning products. We purchased this laundry detergent because it was on the (short) list of products her allergist said would be okay. For that purpose, this laundry detergent was fine. However, we soon began to notice that our clothing was coming out of the wash smelling sour. Even when it wasn’t noticeable immediately, wearing the clothing — and warming it up through contact as a result — released a very unpleasant scent of old body odor. We concluded that the detergent was either not completely cleaning the clothing or was not removing odors completely.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "DEAD BUG IN CAP",
      "text": "Have been ordering this for a while now with no problem. It alwasy came which white electrical tape around lid which I assumed was to prevent leaking. WELL today when I took off the electrical tape and unscrewed the cap I found a dead bug (yes BUG) in the rim of the lid (zoom in to the picture). This makes me wonder if the product is authentic or if someone is filling it with something cheaper. How else would a bug have gotten in?! Am going to contact customer care. RETURNING! DISGUSTING!",
      "rating": 1.0,
      "verified": true,
      "author": "blue",
      "helpful_votes": 2,
      "publication_date": 20181130
    },
    {
      "title": "I love this!",
      "text": "My laundry comes out feeling clean and smelling lovely. I decided to live a more green lifestyle about half a year ago and my first concerns were of how to live normally but still lessen my effect on the environment. I found this for doing laundry and it's been great! MOST of the Laundry detergents on the market make me break out into hives, so I was stuck using tide my entire life. This doesn't affect my skin at all! No rashes, no itching, nothing. That and my laundry no longer smells like it had a chemical bath. :) VERY happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "Scentless laundry detergent as described",
      "text": "PERFECT for those of us allergic to floral and other scented detergents. This has NO SCENT at all. I switched to Seventh Generation laundry soap after TIDE changed their \"Original Scent\" (why? They won't tell why) and it's now has a floral, chemical smell that gives me asthma. I have used many Seventh Generation products and knew this would exactly as described: no scent. Highly recommended. (You might want to consider getting wool laundry balls and infusing them with an essential oil of your liking if you would like your clothes to smell fresh.)",
      "rating": 5.0,
      "verified": true,
      "author": "DLB",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "It seems to clean well and prevent skin allergy.",
      "text": "I bought it because I suspected that my skin was itchy and irritated due to allergical reaction with our previous detergent and/or fryer sheets. Since I started to use this one, it seems that my allergy went away, but it is difficult to say of this was the only factor. This detergent requires smaller volume (concentrated) and seems to clean well.",
      "rating": 5.0,
      "verified": true,
      "author": "GH",
      "helpful_votes": 3,
      "publication_date": 20180615
    },
    {
      "title": "Asthma Sensative and Odor Free",
      "text": "So far this product has lived up to the expectations. It is scent free and cleans clothes well. My husband has severe asthma and most Commercial products seem to bother him. We have been using it a few weeks now.",
      "rating": 5.0,
      "verified": true,
      "author": "elaine arizona",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Superb, unscented, dye free",
      "text": "Very effective, great for very sensitive skin, unscented and dye free! We’ve been using this for years if not well over a decade and love it. Everything comes our perfectly and without some cloying scent. It’s gentle on both clothes and skin, and a little goes a LONG way. We have an “under the counter” front loading machine and find using about 2/3 of the recommended amount is just right for the heaviest loads. We use their dish soap and hand soap and love them too!",
      "rating": 5.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "photos are kinda deceiving",
      "text": "Those bottles are very small ! Thought it was big bottles, was surprised when I got these. Other than that good product!",
      "rating": 3.0,
      "verified": true,
      "author": "Scarlett",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Not concentrate",
      "text": "Bought two of these - and regret it. The product is like water - and smell terrible. Seventh generation must not be as careful with their products, but I buy this at the store and it is totally different. This for me is not worth buying. Giving mine away",
      "rating": 1.0,
      "verified": true,
      "author": "Lori A. Samolsky",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "New favorite laundry detergent!",
      "text": "This is my new favorite laundry detergent. I've been looking for a \"cleaner\" and more natural alternative to traditional laundry detergents and I've loved this brand. The laundry detergent does not bother my sensitive skin. It has little to no scent, but still does a great job of cleaning my clothes and protecting the colors. It's also highly concentrated and a little bit of liquid goes a long way. There's two of us in my household, averaging about 5 loads of laundry/week and this pack lasted us about 4 months.",
      "rating": 5.0,
      "verified": true,
      "author": "Kailey Beck",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Just a really great detergent.",
      "text": "Excellent detergent. After washing with it, my cloths never has a weird chemical smell, which you would normally get from conventional detergent. I also believe that the 7th Generation is a bit more healthier and friendlier to the planet than the other detergents. Can't comment much in that department, because they still use factories, fossil fuels and conventional electricity. But if you want a really great detergent this is it.",
      "rating": 5.0,
      "verified": true,
      "author": "SpeakingMyMind",
      "helpful_votes": 2,
      "publication_date": 20160826
    },
    {
      "title": "Love this detergent!!",
      "text": "Love the product. I have had this on subscribe & save for several months & never had a problem in the past. My complaint this shipment is that the packaging was lacking when mailed. This last shipment had a soggy broken box, another product leaking in it, the tape that usually secured these lids was leaking as well. I need the product so I will keep it. Just annoyed that I have to deal with the mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Z",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Had to use way more than recommended",
      "text": "I use towels in the kennels of the dogs I foster for an animal rescue. Puppies will pee on the towels and I wanted to use a detergent that didn't have any harsh chemicals in it. This product was a disappointment. I would always have to rewash the towels because they would still smell like urine. I do not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "randomcookies",
      "helpful_votes": 9,
      "publication_date": 20171125
    },
    {
      "title": "Feeling clean!",
      "text": "I love this soap! Good for sensitive skin, great that it has no scent so your clothes can come out smelling like your fabric softner, and I have not had one issue with it leaving white streaks on black clothes like so many others do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Higgins",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "OVERPRICED",
      "text": "I mistakenly thought this was for 2 bottles of 100 fl oz. each for which this would have been a good price. Instead I received 2 small bottles of 40 oz. each. I should have looked more closely at the size but I purchased based on what I thought was a reasonable price for the larger sizes. Very unhappy and will be more careful next time.",
      "rating": 1.0,
      "verified": true,
      "author": "mom_cat",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Costs Too Much",
      "text": "I misread and boo-boo-ed on this one. Twice the price as at the grocery store. Also, if you are old or have weak hands, this is very difficult to open. I do like the detergent.",
      "rating": 2.0,
      "verified": true,
      "author": "Jo from Texas",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Deceiving Packaging/Picture",
      "text": "Look at the ounces closely. This is not a \"gallon like\" jug...these are tiny. You can get twice the amount for half the price in the AMZ pantry or wholefoods.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Moore",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Works well and no scent!",
      "text": "I have started using Seventh Generation and I like it. I tend to be sensitive to detergents and this one does not bother me at all. I actually bought the smaller bottles because they are not as hard to carry/lift. Also it gets my clothes very clean. No bothersome scent which is a plus!",
      "rating": 4.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Good detergent, just can’t get it open",
      "text": "Love the detergent and was getting it through subscription. But this last shipment the lids on both bottles were on so tight I can’t get them off. I’m actually going to have to ask my neighbor to try and do it tomorrow or get my toolbox out. It’s easier and cheaper to go to Costco and buy their environmentally friendly detergent.",
      "rating": 4.0,
      "verified": true,
      "author": "MO",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good for sensitive skin",
      "text": "I really like this detergent. I have even put it on auto. The bottle looks really small but one lasted me over a month. You don’t use very much. It leaves my clothes clean with no smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Tess",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "My new favorite soap",
      "text": "This was recommended to me by a friend who has been using it for years with cloth diapers (something I intend to use as well). Not only is it cheaper than all those diaper specific brands, but it works wonderfully. I love that it truly has NO scent since sometimes \"unscented\" just means they didn't add perfume, but still has some weird odor. Also nice that it can be used with both the HE washers and the regular ones and that it only uses around a tbsp per load. Will be buying exclusively for diapers and the rest of my clothes from now on!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20131002
    },
    {
      "title": "My clothes were rough",
      "text": "I don't know if it was the detergent but I thought my clothes seemed a little less soft after using this. I did like however that it was free and clear/unscented. Cleaned the clothes just fine otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "David R.",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Good stuff!",
      "text": "Been using this brand on/off for many years. I would try other brands from time to time but I always come back to this. No skin reaction of any type for me from washed items & gets everything clean w/o stripping the colors. Good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Orgainc mama-san",
      "helpful_votes": 2,
      "publication_date": 20170429
    },
    {
      "title": "Good detergent",
      "text": "was using the packets but this is good too. Makes my towels nice and soft when washed in cold water and dried low.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcia Moore",
      "helpful_votes": 3,
      "publication_date": 20170806
    },
    {
      "title": "Great for sensitive skin",
      "text": "We have used this product for several years and was unable to find it locally so we were thrilled you had it. It cleans extremely well and doesn’t break out our nine year old grandson. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim3497",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Great quality",
      "text": "Love this product. It is great for my skin, my clothes smell fresh and I don’t break out from this detergent",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda M Williams",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Plant based and works great.",
      "text": "All Seventh Generation products are great and this is no exception. No petroleum products used, all plant based, and works well!",
      "rating": 5.0,
      "verified": true,
      "author": "RP",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great for babies",
      "text": "This detergent is great for sensitive skin. It's unscented and made with natural ingredients. I've tried other dye and fragrance free detergents, but this one seems to do a better job getting clothes clean. My baby has not had a reaction to it which has been an issue with other products we've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "KristinC",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Best laundry soap I've ever used",
      "text": "I've been doing laundry for over 50 years. This is by far the best laundry soap I've ever used. It's incredible. It's supper concentrated, so the bottle is small and easy to pick up. I give it the highest score available, FIVE STARS !!",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Ellen Doering",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Clogs machine after a while of use.",
      "text": "Causes a jelly like accumulation in detergent dispenser in my machine. Not too difficult to remove, but it's a mess. Other than that it's okay laundry detergent.",
      "rating": 2.0,
      "verified": true,
      "author": "Yellowjacket",
      "helpful_votes": 0,
      "publication_date": 20191101
    },
    {
      "title": "Price gouging in the midst of a crisis! Don’t buy!",
      "text": "Total price gouge! Do not buy! The size is not worth the price! (And she definitely said that!)",
      "rating": 1.0,
      "verified": true,
      "author": "Michele Fitzgerald",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Detergent",
      "text": "I like that I can use to wash clothes for my family members but I cannot use as made me itch all over. Very strange as I didn’t expect this.",
      "rating": 3.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Tiny",
      "text": "This are surprisingly tiny. No smell let’s give it a chance if it works for sensitive skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Paola W.",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Cleans well without dyes or fragrances",
      "text": "Having someone in the house with sensitive skin makes this product a priority. It works well and leaves clothes smelling clean.",
      "rating": 5.0,
      "verified": true,
      "author": "jk",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "really expensive very small bottles",
      "text": "These are extremely small bottles .... I did t realize how inflated the price was for such small ones! Wow!",
      "rating": 1.0,
      "verified": true,
      "author": "Mocha54j",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great for sensitive skin",
      "text": "I have sensitive skin and have been using this detergent for years. I like how it does not have a strong scent and always gets tough stains out of my clothes. I even trusted this detergent with my newborn daughter's clothing and other washable items.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great products for babies too",
      "text": "Love this product. I use it on my baby's laundry too. I recommend it to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabrielle Millares",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Disappointed in size",
      "text": "A little annoyed by the size for the price but it works well for my child’s clothing.",
      "rating": 3.0,
      "verified": true,
      "author": "Synthia Stewart",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Tiny bottles",
      "text": "My fault for not checking size of this. Rip off tiny packaging. Don’t make my mistake",
      "rating": 2.0,
      "verified": true,
      "author": "huge amazon shopper",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Great for Sensitvie Skin. Cleans well!",
      "text": "This is the only laundry detergent I can use. It cleans really well even with no scent and it’s awesome for my sensitive skin! I really love the small containers for saving space. You still get 53 loads from each bottle. Only a small capful is needed for each wash cycle!",
      "rating": 5.0,
      "verified": true,
      "author": "Mellissa B",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Perfect for sensitive skin",
      "text": "Love this! Have been using this for a few years now and my 9 month old has never had skim reactions to it! So thankful because her skin is extra sensitive.",
      "rating": 5.0,
      "verified": true,
      "author": "Clinton Yada",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "I love the compact size.",
      "text": "Seventh Generation strength and quality in a smaller bottle. Very nice for conserving space.",
      "rating": 5.0,
      "verified": true,
      "author": "Artist",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Haven’t had to wash to many dirty clothes with it.",
      "text": "Just wish it was as larger amount for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth Malcom",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Does not irritate skin",
      "text": "Our favorite laundry detergent. Does not irritate my skin like some other detergents. I like that it does not have a lot of additives or harmful chemicals.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Leeseberg",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Ecofriendly well priced detergent",
      "text": "Love that it's unscented and it works well with little liquid",
      "rating": 5.0,
      "verified": true,
      "author": "Shaz",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "love",
      "text": "we love 7th generation products! i have 3 kids, ages 3,2 and 1, and we wanted a relatively nontoxic product that isn't going to break the bank. i tried making my own detergent but it was too hard to keep up once i went back to work",
      "rating": 5.0,
      "verified": true,
      "author": "DMV Mom",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Liquid detergent",
      "text": "Not interested couldn’t return it back on time cause I was out of town. REQUESTED NOT TO SEND ANYMORE THROUGH AUTO SHI",
      "rating": 1.0,
      "verified": true,
      "author": "Ruth RiveraAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Works Like A Charm",
      "text": "I love Seventh Generation products and this is no exception. Works great! No really noticeable smell, but that's okay - at least the laundry comes out smelling clean (and I have 3 teenagers and would know if it didn't!)",
      "rating": 5.0,
      "verified": true,
      "author": "jenni",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Awesome for sensitive skin",
      "text": "Amazing product. Everything messes with my fiancé’s skin. This stuff works. Cleans well too I use it for my stuff since we buy it anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin r gatton",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "good product",
      "text": "I like condensed products. same cleaning in less storage space. I did not like that each lid was glued on and that the glue was all over the lid so it looks dirty and messy. but the product is great and I cannot find the 4x in any stores around here. I did get the shipment quickly. I will probably order from them again, I just will never be happy with that glue. plus I am old and I had a very hard time getting them open.",
      "rating": 4.0,
      "verified": true,
      "author": "camicat",
      "helpful_votes": 0,
      "publication_date": 20130704
    },
    {
      "title": "Biodegradable",
      "text": "Love Seventh Generation products. Biodegradable and does a thorough cleaning. I bought unscathed because some items don’t need a scent.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica Treadwell",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Will re-purchase",
      "text": "Works well - no smell clothes smell and feel clean. Great stain remover as well",
      "rating": 5.0,
      "verified": true,
      "author": "Gigi",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Gotta Go Green!!!!",
      "text": "This got nice a soapy. I was very pleasantly surprised. I'm glad to have clean clothes and that I'm being kind to the environment and my skin!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michellely",
      "helpful_votes": 2,
      "publication_date": 20170410
    },
    {
      "title": "Great product!!",
      "text": "A household staple in our home. We use a bit of laundry detergent, and this is the best!!",
      "rating": 5.0,
      "verified": true,
      "author": "Motor City Madman",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "My absolute hands down favorite in every category",
      "text": "Works incredibly well, rinses away clean, good for the planet, actually removes stains, friendly packaging, and doesn't cause any fading or damage to my clothes (I always use cold water tho). Just be sure to follow the portion directions, as this really is super concentrated. It's also amazing for sensitive skin or babies.",
      "rating": 5.0,
      "verified": true,
      "author": "Green Guy",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Recommended, storage efficient product",
      "text": "These are very concentrated and take up very little storage compare to the number of washes they provide. Cleaning power is very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Montognese",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Great Product",
      "text": "I rate this product as \"great\" because it is long lasting. 1 bottle lasts me for approximately 3 months. Because it's concentrated there is no need to use very much of it. Of course this is contingent upon your own laundry needs. I do about 5 loads per month on average. It's great for the environment & may be good for those with sensitive skin since no dyes or perfumes.",
      "rating": 5.0,
      "verified": true,
      "author": "Louie",
      "helpful_votes": 0,
      "publication_date": 20140620
    },
    {
      "title": "Unscented and Good for HE!",
      "text": "Doesn't irritate my sensitive skin and I feel like I don't need to use very much per load!",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Not clean enough",
      "text": "I have been using this for about weeks, on all my laundry. I just don't think it gets them clean enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Barb",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Gets the tough stains out.",
      "text": "Kids clothes are clean & gives my son no rash. Would use it again.",
      "rating": 5.0,
      "verified": true,
      "author": "VBEBLESSED11 ",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Pricey",
      "text": "I wasn’t expecting for these containers to be as small as they were/are. Idk what else to buy tho soo",
      "rating": 3.0,
      "verified": true,
      "author": "H",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "I have super sensitive skin (eczema",
      "text": "I have super sensitive skin (eczema, psoriasis, and contact dermatitis) and love using this product. This, the powder, or regular (non-concentrate) Seventh Generation detergent is the way to go for those with sensitive skin!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren Camelotto",
      "helpful_votes": 2,
      "publication_date": 20170902
    },
    {
      "title": "I like this detergent",
      "text": "I like this detergent. Bottles were smaller than I anticipated. Hopefully, that doesn't mean we go through it faster. Kids...",
      "rating": 4.0,
      "verified": true,
      "author": "Janie",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "It looked like white plumbing tape",
      "text": "Came well packaged with a seal around the bottle. It looked like white plumbing tape. Would definitely purchase again. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Scelluet",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Can't say enough.",
      "text": "Wanted to wait until I used this for awhile before commenting. Just ordered my 2nd two bottles this stuff is great! Came home with a skin irritation think it was the soap after using this for awhile noticed it was gone would break out under arm pits from chemical in the detergents not no more #justsayn",
      "rating": 5.0,
      "verified": true,
      "author": "michael allen",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "Small size",
      "text": "Very small amount for the price and didn't clean very well",
      "rating": 2.0,
      "verified": true,
      "author": "r_o",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Bottles smaller than expected",
      "text": "It’s hard to find quality detergent that is also scent free, this stuff is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Natural and works",
      "text": "It is great and condensed - so the container takes up less space",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "So fresh and so clean",
      "text": "Love this, no allergic reactions for us or baby. No strong smell, really nice clean.",
      "rating": 5.0,
      "verified": true,
      "author": "ThePortlandBrowns",
      "helpful_votes": 0,
      "publication_date": 20170716
    },
    {
      "title": "Reliable and Scent Free",
      "text": "Been using this for at least a year now. It cleans as well as any other detergent, and doesn't leave any scent behind. We know it works because we can smell everyone else's scented clothing but ours are neutral.",
      "rating": 5.0,
      "verified": true,
      "author": "A.P.",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "NO SCENT, yay!",
      "text": "No overpowering perfumey scent - yay! Small bottles, concentrated 4x - easy to cart to the laundromat and back. Great company to support with a good record on employees, environment, etc - I feel good about buying their product. And most importantly - yes, the detergent works well and cleans our laundry beautifully. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Shopping Maven",
      "helpful_votes": 0,
      "publication_date": 20130519
    },
    {
      "title": "Makes me feel good...",
      "text": "It makes me feel good to know that I can wash my clothes in something that is non-polluting to our water supply - whether that is ground water or public water supply. I cannot find this in a retail store nearby, so it is wonderful to be able to have it delivered on a regular basis directly to my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Thayer",
      "helpful_votes": 0,
      "publication_date": 20140625
    },
    {
      "title": "Excellent Detergent!",
      "text": "All natural. Washes great! Clean smell. Super happy with this detergent.",
      "rating": 5.0,
      "verified": true,
      "author": "Dabney",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great size bottles, free of additives",
      "text": "My daughter and I have sensitive skin and get a rash if we use a detergent with added scents. This detergent doesn't cause any irritation. Also it's very concentrated so the bottles are smaller and easier to store.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 0,
      "publication_date": 20161020
    },
    {
      "title": "Five Stars",
      "text": "we've been back for more of this detergent. my husband won't use anything else now.",
      "rating": 5.0,
      "verified": true,
      "author": "Zoe R",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Not worth it especially the price",
      "text": "This containers are small. Went to my local heb and they have them bigger and cheaper at 11 dollars. Just buy them at your local grocery store.",
      "rating": 1.0,
      "verified": true,
      "author": "Vanessa F.",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Five Stars",
      "text": "This works great for laundry, just wish you could get a little more for a little less.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Great for sensitive skin",
      "text": "This detergent is great for really sensitive skin. I sometimes have skin reactions from other detergents, even when they claim to be \"free and clear.\" I never have any bad reactions when using this detergent. And it seems to clean my clothes just as well as other detergents.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20130716
    },
    {
      "title": "Great product!",
      "text": "Nice for HE washer. Lasts a long time. Clothes smell fresh, not scented.",
      "rating": 4.0,
      "verified": true,
      "author": "BUTTERFLY GIRL",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Its OK",
      "text": "This product is okay. I don't know if it gets my clothes as clean as the main stream products. So that being what it is i guess if you want an environmentally safe product this will do the job.",
      "rating": 3.0,
      "verified": true,
      "author": "Arron V",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Great detergent!",
      "text": "Safe detergent to use. It does a good job without harsh ingredients. Laundry comes out clean and fresh.",
      "rating": 5.0,
      "verified": true,
      "author": "booksplus",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Most thing I like about it is it has almost no scent on ...",
      "text": "After I started to use it, I will never change to other brands. Most thing I like about it is it has almost no scent on your laundry. Clean and efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank E.",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Good quality and does its job",
      "text": "I like how it's concentrated so slightly less packaging. It works well in our top-loading HE washing machine, and I do laundry every 2-3 days with a baby at home!",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Five Stars",
      "text": "Our son has very sensitive skin and this detergent has kept him rash/bump free!",
      "rating": 5.0,
      "verified": true,
      "author": "Ally Sweeney",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Fresh",
      "text": "This laundry detergent is good but came in small bottles. I expected bigger bottles for the price, but still used the small. Smell was fresh and clean and really that’s all that matters!",
      "rating": 4.0,
      "verified": true,
      "author": "Charlene",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Bottles are tiny",
      "text": "Bottles are very small. Cheaper to go to the grocery store and buy a big bottle for $5 less.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer ",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Good stuff!",
      "text": "I've started using almost all of Seventh Generation products. Free and Clear is great - no chemical smell on the clothes and it gets out quite a few stains. And you use a ridiculously small amount. The dishwasher detergent is good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "Helps get clothes clean.",
      "text": "Really good, hypo allergenic since my girlfriend has a ton of allergies. Makes clothes super clean.",
      "rating": 5.0,
      "verified": true,
      "author": "TheOriginalPancake",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Five Stars",
      "text": "laundry came out so clean better than the commercialized products",
      "rating": 5.0,
      "verified": true,
      "author": "Gardenqueen4life",
      "helpful_votes": 0,
      "publication_date": 20180613
    }
  ],
  "product_meta": {
    "title": "Seventh Generation Concentrated Laundry Detergent, Free & Clear Unscented, 40 oz, Pack of 2 (106 Loads)",
    "description": "Scent Name:Free & ClearClothes should feel cuddly and clean against your skin – and be good to it, too. Seventh Generation Free & Clear Concentrated Liquid Laundry Detergent features a triple-enzyme formula that fights tough stains without the use of fragrances, dyes, and artificial brighteners. Plant-derived enzyme stain removers like Protease and Amylase power away stubborn stains – grass, tomato sauce, or chocolate – you name it, we’ve got you covered. This hypoallergenic and fragrance free laundry detergent is dermatologist tested to be gentle on skin. Our ultra-concentrated laundry soap uses less added water, allowing us to use a smaller bottle to deliver impressive cleaning power – 106 loads in x2 40 oz. containers. Good things really do come in small packages. For more than 25 years, Seventh Generation has been thoughtfully formulating safe and effective plant-based products that work. Really well. As a leading green laundry detergent manufacturer, we are proud to make biodegradable and EPA Safer Choice Certified detergents. You may also notice a cute Leaping Bunny seal on our products. That means we never test our products on animals and our products do not contain animal-based ingredients. We design our products to be safe for people, their homes, and the environment. Based in Vermont, Seventh Generation is proud to be a Certified B Corporation. B Corps are certified to be better for workers, better for communities, and better for the environment. By choosing Seventh Generation products, you’re joining us in nurturing the health of the next seven generations.",
    "rating": 4.6,
    "feature_bullets": [
      "Powerful triple-enzyme formula fights tough stains",
      "Free & clear hypoallergenic laundry detergent made for sensitive skin",
      "EPA safer choice certified product designed with safety in mind",
      "Concentrated detergent washes 53 medium loads (for a total of 106 per 2 pACk) in a high efficiency (he) or standard mAChine",
      "USDA certified bio based product 96% made with plant-based ingredients"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "10 x 5.6 x 10.2 inches; 2.96 Pounds",
      "Item model number": "732913228928",
      "Material Feature": "Biodegradable Warning",
      "Date First Available": "August 23, 2012",
      "Manufacturer": "Seventh Generation",
      "ASIN": "B0091DS0UY",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Household Supplies",
      "Laundry",
      "Laundry Detergent",
      "Liquid Detergent",
      "Health & Household",
      "Health, Household & Baby Care"
    ],
    "price": 20.87
  }
}