{
  "website_summaries": [
    {
      "verdict": "With a 3-gallon size in this bucket, most people can carry it easily.",
      "pros": [
        "These HDPE materials are able to store either liquids or solids",
        "Multiple ribs at the top of the bucket mean it will maintain its shape",
        "Because it's shorter than the standard 5-gallon bucket size, it can fit into tight spaces where other buckets won't fit",
        "Includes a sturdy metal handle on the top to simplify carrying it"
      ],
      "cons": [
        "This bucket does not consist of food safe materials",
        "No lid included in order"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Buck It",
      "text": "Its a bucket. If you need a bucket, buy it. If you don't need a bucket, then you need to reevaluate your life and get a bucket. This bucket solves many problems. Need gallons of water? This bucket can hold that. Need a bucket of flowers after your partner found out you binged watched Stranger Things without them? This bucket can do that. Have a chocolate syrup addiction and need a close by supply at all times? This bucket can hold GALLONS of chocolate syrup. Your welcome.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 94,
      "publication_date": 20171210
    },
    {
      "title": "I had a use for a shorter bucket than the ...",
      "text": "I had a use for a shorter bucket than the normal 5gal big box bucket but I wanted the same strength and construction. This bucket is that. Same quality as Menards or Home Depot buckets, just shorter.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazonder",
      "helpful_votes": 29,
      "publication_date": 20150225
    },
    {
      "title": "Perfect sized bucked.",
      "text": "Used for 50' heavy duty extension cord, that I could not keep coiled and untagled. But now all works well with a small hole cut in bottom to feed end to power outlet. Other endfeed from top and re coils nicely back in bucket. And also can use bucket with cord in it to carry drill or jig saw. Seen on a dyi show.",
      "rating": 5.0,
      "verified": true,
      "author": "T.L.H.",
      "helpful_votes": 13,
      "publication_date": 20170401
    },
    {
      "title": "How do you mess up a bucket?",
      "text": "You make it out of some sort of plastic that emits a terrible disgusting odor, and you make a bucket that if you rub it with a cloth has the color come off onto the cloth.",
      "rating": 1.0,
      "verified": true,
      "author": "人",
      "helpful_votes": 9,
      "publication_date": 20180628
    },
    {
      "title": "Works great.",
      "text": "I use this bucket to sit on when repairing car wheels. works perfect for that and the other day I found a turtle in the middle of the road and it saved the turtle. Nice sized bucket to keep in the back of my SUV for odd purposes other than to sit on. Cheap too.",
      "rating": 5.0,
      "verified": true,
      "author": "4runner",
      "helpful_votes": 22,
      "publication_date": 20150715
    },
    {
      "title": "VERY CHEAP!!",
      "text": "This bucket didn't last 1 month before it cracked on the bottom of the bucket. Funny thing is I didn't see anything around me to make it crack. I was thawing my BBQ ribs in the bucket and added water and it would feel up due to crack in the bottom. CHEAP BUCKET DON'T BUY",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry J.",
      "helpful_votes": 6,
      "publication_date": 20180819
    },
    {
      "title": "Versitile and compact",
      "text": "The product came on time in a well-fitting box with protective wrap. There was a small flat area on the side but that made it easier to drill the hole for the intake/drain tube. I like the more compact and less heavy three gallon for growing shallow rooted and dwarf plants although I still use five gallon buckets for big and tall tomatoes. It is currently being used for my indoor baby beet experiment. These buckets are very versatile and can be used for tasks such as changing out solutions and storing nutrients and mixes.",
      "rating": 5.0,
      "verified": true,
      "author": "REC",
      "helpful_votes": 4,
      "publication_date": 20171123
    },
    {
      "title": "Perfect size cast net bucket for all you fisherman",
      "text": "Perfect size cast net bucket for all you fisherman. Needed something that had the width profile of a 5 gallon bucket but a bit shorter so that it cleared the hatch lid on our boat. This fit the bill perfectly and has held up well despite being subjected to saltwater after months.",
      "rating": 5.0,
      "verified": true,
      "author": "CameronC",
      "helpful_votes": 5,
      "publication_date": 20170526
    },
    {
      "title": "rip off",
      "text": "it says your buying ten but you only get one. this hydro farm company must be making a fortune selling10 packs that only contain one piece",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Nuss",
      "helpful_votes": 2,
      "publication_date": 20190917
    },
    {
      "title": "Hydrofarm Bucket, 3-gallon",
      "text": "Okay - I bought to use as a short composting toilet to fit under my camp cot, but the lid I ordered didn't fit so I'm going to have to use a taller bucket I already had and leave it out. The opening is wider than a 5 gallon bucket. Other than that, it seems good quality.",
      "rating": 4.0,
      "verified": true,
      "author": "KittyLover",
      "helpful_votes": 5,
      "publication_date": 20161003
    },
    {
      "title": "Great For Portable A/Cs",
      "text": "I own a wheeled air conditioner that drips a ton of water from a tube which unfortunately cannot be emptied by window. Smaller buckets would get full in a hour, and during the hot summer months, who wants to get up every hour to empty a bucket? In the meantime your A/C has to be off, or else it'll get water on the floor. This is perfect for holding a ton of water. I only had to empty it every few days, and when you have a busy job the little things that save chores can be so nice.",
      "rating": 5.0,
      "verified": true,
      "author": "M. L.",
      "helpful_votes": 2,
      "publication_date": 20161001
    },
    {
      "title": "Great product",
      "text": "These are good buckets , and the shipping was decent . Just little sad that they are so pricy compared to the store I use to shop when I lived in TX. But definitely would buy from this company agsin",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Heavy duty bucket.",
      "text": "Used for growing Green Peppers.. cucumber.. and peas. All indoors in a hydroponic garden. Works as expected. Heavy duty bucket. Will order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 3,
      "publication_date": 20180406
    },
    {
      "title": "Bucket cracks, poorly made.",
      "text": "I purchased this bucket for a hydro setup and once I started to make the necessary holes, the bucket would crack instead of holding strong. I had to fix with duct tape to prevent leakage. Very poor material.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Ramon",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Space saver",
      "text": "Perfect size to fit in the space I need. Couldn't find this size in stores but the lids for 5 gallon buckets fits this too.",
      "rating": 4.0,
      "verified": true,
      "author": "Muffin",
      "helpful_votes": 3,
      "publication_date": 20171025
    },
    {
      "title": "DURABLE",
      "text": "Excellent and durable bucket for all of the water requirements that I have on remodeling projects. 5-gallon buckets are too big and tall. This is the perfect size for meeting my requirements and this bucket is made of very thick plastic and will be durable and long lasting.",
      "rating": 5.0,
      "verified": true,
      "author": "T. L. Allen",
      "helpful_votes": 2,
      "publication_date": 20170307
    },
    {
      "title": "good weight",
      "text": "I got this bucket after watching someone make a composting toilet system. I had planed on using a 5 gal., but he said it didn't work with the urine diverter system ...and I had ordered one. What can you say about a bucket? It appears to be the same circumference a 5 gal would be, which is what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Gypsy B",
      "helpful_votes": 0,
      "publication_date": 20180920
    },
    {
      "title": "Good quality",
      "text": "I should have read the description better. I didn't realize it didn't come with a lid, but I was able to make it work anyway. Used it to brine my turkey for Thanksgiving. Worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaque",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Quality has gone down from previous orders",
      "text": "Disappointed. Bucket came without box and with shipping label stuck on bucket, that is near impossible to take off. Their bucket quality also went down. It's thinner and lighter. Ordered two previous times and buckets were excellent and shipped in boxes. Don't know what happened. I'll find another dealer.",
      "rating": 3.0,
      "verified": true,
      "author": "panchogrande",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "As described",
      "text": "I use as portable toilet (buy the toilet seat that attaches to buckets. Great on boats, tailgates etc). Solid buckets exactly as described. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "matt M",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Durable and made from a thicker plastic than Home Depot ...",
      "text": "Durable and made from a thicker plastic than Home Depot, etc. I bought a cushioned lid for it and take it with us camping, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Naramia",
      "helpful_votes": 3,
      "publication_date": 20170902
    },
    {
      "title": "Very poor product. Would not buy again.",
      "text": "This feels flimsy for the price. It's not worth $20 at all. When the bucket is full, I don't trust the handle not to break, either because the metal is so crappy or because the plastic is too thin.",
      "rating": 2.0,
      "verified": true,
      "author": "ph301",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "excellant",
      "text": "This is a strong strudy bucket, not even in the same class as the home Depot bucket. We were totally surprised at its quality, its used to care about 3 gallons of water a couple times a day and looks as good as it did when we got it. No signs of wear at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Rainbow Bridge",
      "helpful_votes": 4,
      "publication_date": 20151025
    },
    {
      "title": "Sturdy bucket",
      "text": "I am using this in my art room to hold clay and keep it from drying out. With the gamma seal lid and this container I could not be happier! (it does not come with a lid, I purchased separately)",
      "rating": 5.0,
      "verified": true,
      "author": "Artzgrl",
      "helpful_votes": 3,
      "publication_date": 20170301
    },
    {
      "title": "What can you say about a 5-gallon bucket? It ...",
      "text": "What can you say about a 5-gallon bucket? It works, it doesn't leak, it empties out when it is tipped over...",
      "rating": 5.0,
      "verified": true,
      "author": "rhg2914",
      "helpful_votes": 13,
      "publication_date": 20161109
    },
    {
      "title": "Nice quality",
      "text": "Sturdy heavy duty bucket. Good quality. After breaking several bucket, I purchased this one for my boy friend, and he loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "tracy",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "Great product",
      "text": "Love the bucket. Quality so much better the the box stores. Plus it’s a little larger then a normal five gallon buck and that’s what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "its a bucket",
      "text": "its a bucket comes with a nice metal handle, is sturdy enough to sit on works with various bucket toilet seat attachments",
      "rating": 5.0,
      "verified": true,
      "author": "Leala",
      "helpful_votes": 2,
      "publication_date": 20170721
    },
    {
      "title": "Amazing",
      "text": "Great buckets for the price. I also love that they are black and dont let light hit the water",
      "rating": 5.0,
      "verified": true,
      "author": "William J.",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Good for DWC",
      "text": "The type of plastic used for this bucket is food grade and safe for use in DWC systems. Fits the style netpod lids I prefer to use (Check out my profile on that) and over all a durable 5gal bucket. A little pricey for a bucket tho. I say......Grow Tent APPROVED!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Great Bucket for your Bucket List.",
      "text": "Its a bucket, strong and sturdy. It holds up well to abuse that i put it through every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin C.",
      "helpful_votes": 2,
      "publication_date": 20171211
    },
    {
      "title": "It's a bucket.",
      "text": "Just a plain black 3gal bucket. I use it for car washing alongside a 5gal bucket. Works well and seems durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Xavier S.Top Contributor: Cycling",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Good solid bucket",
      "text": "This bucket is very solid. We use it along with the screw lid as a doggie poop container in the back yard.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Kinder",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "They do the job",
      "text": "They fit a standard 5 gallon bucket. Seems like they would break easily if used too much.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley D.",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "It's a bucket",
      "text": "It's a bucket. It does what buckets do and it does it well. Highly recommended if you are looking to buy a bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 2,
      "publication_date": 20171105
    },
    {
      "title": "A smaller alternative to those big, awkward, buckets from Home Harware World",
      "text": "A perfect alternative to the much larger buckets sold at big box lumber stores. It uses, but does not have, the same tops. I found it perfect for garden chores, but expect to use it for tools and hardware for household projects.",
      "rating": 5.0,
      "verified": true,
      "author": "dbTop Contributor: Pets",
      "helpful_votes": 3,
      "publication_date": 20151102
    },
    {
      "title": "Nice bucket, include top",
      "text": "Need to buy with screw on top, a must for complete set",
      "rating": 5.0,
      "verified": true,
      "author": "gg",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Didn’t send right amount.",
      "text": "I bought a 10 pack. Only 1arrived. 1 lid for $25. WTF!",
      "rating": 1.0,
      "verified": true,
      "author": "KENNETH MATTHEW FULBRIGHT",
      "helpful_votes": 5,
      "publication_date": 20180616
    },
    {
      "title": "Expensive bucket",
      "text": "It's a good bucket! The price was pretty steep. I wouldve bought more had it not been for the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Hammertime",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "The black hides in well with the bucket so it doesn't look dirty or get dirty like other buckets do",
      "text": "I use this for ash collection and for cleaning my grill. The black hides in well with the bucket so it doesn't look dirty or get dirty like other buckets do. It's well built for the price. I could carry a bucket of water in this without fear that the handle would break.",
      "rating": 5.0,
      "verified": true,
      "author": "BLT",
      "helpful_votes": 2,
      "publication_date": 20151105
    },
    {
      "title": "Horrible",
      "text": "Wont snap in to buckets. Tape had to be used. Will not lock",
      "rating": 2.0,
      "verified": true,
      "author": "warren",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Good little buckets!",
      "text": "I use them for changing water in my fishtanks and they are a great size to tote around water in!",
      "rating": 5.0,
      "verified": true,
      "author": "Lycramosa",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "Great size bucket",
      "text": "The 3 gallon bucket is well made and durable. I would recommend the bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "7 Zion",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Good storage buckets",
      "text": "Good storage buckets if they are not too heavy. Lids cannot take heave stacking.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken O",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Does the job it was intended to do.",
      "text": "Can’t complain. It does the job it was intended to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Weetman",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "5 stars",
      "text": "Works just like all the others I've used so I give it a 5 star rating",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": ", expensive black bucket,",
      "text": ", it's a lot of money to pay for a black bucket,",
      "rating": 4.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "I'll be getting a second bucket",
      "text": "A great bucket built to last. Very strong and will be used a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Great Multi-use Bucket",
      "text": "Heavier than it looks. I've used it for carrying dug up crystals, soaking them in acid, and general cleaning. Has held up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Judie Kae Snipes",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "I can haz bucket.",
      "text": "Yes, I can haz. It's a good bucket. I love buckets. I named it Blakely Blackly.",
      "rating": 4.0,
      "verified": true,
      "author": "Ursan",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Warped when received",
      "text": "Both buckets are warped are was difficult at first to install any basket lid! Buckets were packaged good and without evidence of damage. Not returning items this time and hope they will reshape so lid will rotate.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Good strong bucket",
      "text": "Good strong bucket. Spend a few bucks more and get this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Tunes",
      "helpful_votes": 2,
      "publication_date": 20170719
    },
    {
      "title": "Wonderful",
      "text": "This bucket with the sealed lid is amazing. I use it for my dog's dog food so little critters can't get in a multiply. You could use it for food or anything where you want to keep it safe. I've never had liquid in it, but I bet it wouldn't leak.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "The perfect size for washing the car and not wasting water",
      "text": "Just what I was looking for! The perfect size for washing the car and not wasting water.",
      "rating": 4.0,
      "verified": true,
      "author": "jpd43",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Its a bucket",
      "text": "It holds water 5 stars for no holes it also doesnt have any warps in it so it's made pretty solid, the handle holds up nice",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Evenhouse",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Four Stars",
      "text": "Nice bucket for the price, only draw back is the handle is to thin",
      "rating": 4.0,
      "verified": true,
      "author": "cliff",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Heavy duty",
      "text": "It is go to wash down bucket for my boat.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Harper",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Great size for home gym chalk bucket",
      "text": "Perfect size for a home gym chalk bucket. Sticker peele off easily from side. Bottom is solid with no holes.",
      "rating": 5.0,
      "verified": true,
      "author": "pacbrent",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "No lid",
      "text": "Was surprised that no lid came with the bucket...It is made to have one.",
      "rating": 2.0,
      "verified": true,
      "author": "Prosper123",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "$$",
      "text": "Pricey for a small bucket but exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Yeah, .... right",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Sturdy and Durable",
      "text": "A very sturdy, quality bucket. If you want something that will hold up to rigorous applications, these fit the bill.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Langdon",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Too pricey . . .",
      "text": "The bucket is well made but the price is too high.",
      "rating": 4.0,
      "verified": true,
      "author": "Letter Addict",
      "helpful_votes": 2,
      "publication_date": 20170414
    },
    {
      "title": "bucket matched lid",
      "text": "the 3 gallon matched the changing lid for weekly changes perfectly, it even snapped into place.",
      "rating": 5.0,
      "verified": true,
      "author": "Gman",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Great Duch Bucket",
      "text": "This is a great bucket for hydroponics. But was a little high on the price",
      "rating": 5.0,
      "verified": true,
      "author": "Bo Cabral",
      "helpful_votes": 5,
      "publication_date": 20150811
    },
    {
      "title": "Much more useful than smaller bucket I had been using",
      "text": "Use bucket boss in this 5-gallon bucket. Much more useful than smaller bucket I had been using. Carries larger gardening shears as well as smaller gardening and outdoor tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Louise",
      "helpful_votes": 2,
      "publication_date": 20151102
    },
    {
      "title": "Missing parts",
      "text": "Hey guys I just got my leaktight bucket with no leaktight lid! I need the lid for it to be “leaktight”",
      "rating": 2.0,
      "verified": true,
      "author": "Jackilene J. Beaman",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "It's a bucket. Bit pricey for a bucket, ...",
      "text": "It's a bucket. Bit pricey for a bucket, but exactly what I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "MB 007",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Nice",
      "text": "Working great so far. Well update if it falls apart.",
      "rating": 5.0,
      "verified": true,
      "author": "tftMom",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Made right",
      "text": "I needed this for fishing. It was made as it should be: handle was stable and form was made correctly",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 2,
      "publication_date": 20160722
    },
    {
      "title": "Nice Bucket",
      "text": "Good size, distinct color, it's a great aquarium tool, no one will think it's a mop bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "NoNameNope",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Felt cheap and not built to last",
      "text": "These kids fit very loosely on a regular 5 gallon bucket, not very rigid",
      "rating": 3.0,
      "verified": true,
      "author": "Kurt thomas",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "It's a bucket.",
      "text": "There are no holes. It holds liquid. I use it to mop my house every week. Suitable bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "The correct product based on searches. Thank you Amazon)",
      "text": "Wanted to say thank you for the delivery of this product, used. This was what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Gleb",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Five Stars",
      "text": "perfect for my aeroponic setup. 11 inches tall and type 2 plastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Perfect for bucket seat",
      "text": "Bought a seat lid to use for baseball bucket. Perfect! But That sticker was a monster to remove!",
      "rating": 4.0,
      "verified": true,
      "author": "Wes Upton",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "3 gallon bucket",
      "text": "Like,used this product for a hydro reservoir also can be used for a dozen more applications",
      "rating": 5.0,
      "verified": true,
      "author": "Pete T",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "No holes I am happy.",
      "text": "Damn its just a bucket. No holes I am happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Old ET",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Nice bucket.",
      "text": "Using as a tool bucket with my Bucket Boss equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "nowufny2",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Five Stars",
      "text": "It is a bucket and it does bucket things. It isn't flimsy when full.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "beware",
      "text": "I recieved a HYDROFARM correct lid! Does not fix LEAKTITE Buckets about 1/8\" larger dia. Some are sending when you order hydrofram buckets",
      "rating": 1.0,
      "verified": true,
      "author": "James E",
      "helpful_votes": 2,
      "publication_date": 20150209
    },
    {
      "title": "Perfect for the garden",
      "text": "Using this for a garden tool bucket. Works perfectly. Sturdy, strong all last growing season. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "rms",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Hydrofarm HG5G 5-Gallon Black Bucket",
      "text": "Lowest rating I have ever given and that is because this bucket is so over priced. Its just a black bucket; nothing special about it, not heavy duty, not even branded with a company logo. Yes, it will hold water or whatever you want to carry in it. Concerning the rings at the top, they're there as stiffeners, to make the bucket more stable. Now, if you live somewhere where availability of 5 gallon buckets is limited or nonexistent, or you can't get out and you have a real need for a black bucket, then this may be a reasonably priced bucket for you.",
      "rating": 2.0,
      "verified": true,
      "author": "j woodruff",
      "helpful_votes": 2,
      "publication_date": 20120717
    },
    {
      "title": "Extremely bucketish",
      "text": "This is the bucket I have always dreamed of. Exceeds all expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Cap'n Fran",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "These things feel like they'd be difficult to break",
      "text": "I bought two of these buckets to hold water for car cleaning. These buckets are made of a hard plastic, and the handle keeps a firm hold on these buckets. These things feel like they'd be difficult to break.",
      "rating": 5.0,
      "verified": true,
      "author": "Kalhe",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Great product, great price",
      "text": "This product was perfect for what I needed it for. Great purchase, great price",
      "rating": 5.0,
      "verified": true,
      "author": "Ajebaby311 ",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Great product",
      "text": "This bucket was great! Exactly what we needed for the event we had. Great quality, great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Hier",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "Great product",
      "text": "Works perfectly with my bucket stool, and the perfect height for what I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Rose",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "How dumb is that",
      "text": "Could not believe it didn't come with a lid. Apparently they are a separate item. How dumb is that!",
      "rating": 3.0,
      "verified": true,
      "author": "trulyhappy",
      "helpful_votes": 2,
      "publication_date": 20150810
    },
    {
      "title": "Yes, you can carry water in it",
      "text": "Well...it's a bucket. If you need a 5 gallon bucket, buy it",
      "rating": 5.0,
      "verified": true,
      "author": "tourniquet grab",
      "helpful_votes": 0,
      "publication_date": 20161203
    },
    {
      "title": "Four Stars",
      "text": "These are great, I got 1 more. if you plan to do DWC than this is what you want.",
      "rating": 4.0,
      "verified": true,
      "author": "hydropx",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "This is BIIIG",
      "text": "I leave it on the front seat of my SUV-- no place I can really stow it and don't want to leave it upstairs. It holds ALOT of water and is great for washing the big car.",
      "rating": 5.0,
      "verified": true,
      "author": "BookAce",
      "helpful_votes": 0,
      "publication_date": 20150617
    },
    {
      "title": "Its actually really good and can deal with a lot of weight",
      "text": "It's a bucket it works. Its actually really good and can deal with a lot of weight, Well made!",
      "rating": 4.0,
      "verified": true,
      "author": "Kolrick",
      "helpful_votes": 2,
      "publication_date": 20150714
    },
    {
      "title": "Highly recommend.",
      "text": "Fanstaic black bucket which is exactly what I wanted. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Captain C",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "I was very disappointed that these didn't come with lids for 10",
      "text": "I was very disappointed that these didn't come with lids for 10.00 a piece but they are good, sturdy buckets.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon M.",
      "helpful_votes": 0,
      "publication_date": 20160412
    },
    {
      "title": "Quality bucket!",
      "text": "High quality sturdy bucket. Stands up to continual use great!",
      "rating": 5.0,
      "verified": true,
      "author": "Bronco Princess",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "overpriced",
      "text": "Don't know why I paid this price. Lowes has a 5 gal. bucket that is just as good for less than 3 bucks.",
      "rating": 3.0,
      "verified": true,
      "author": "WM",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "The trash can punch bucket you've been looking for.",
      "text": "Made a great trash can punch bucket. I don't really remember what happened to the bucket afterwards but it served it's purposed while it lasted.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "Great Product!",
      "text": "This bucket was great! Exactly what we needed for the event we had. Great quality, great price!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Hier",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "5 Gallon bucket",
      "text": "Perfect for intended use. Periodically vacuuming fish tank. Holds sufficient vacuumed water to complete cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "It's a bucket.",
      "text": "Would have been nice if it came with a lid.",
      "rating": 4.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 0,
      "publication_date": 20170118
    }
  ],
  "product_meta": {
    "title": "Hydrofarm HG3G, Black, 3 Gallon Single Bucket, 3-Gallon",
    "description": "Style:Bucket| Size:3 gallon\n\nHydrofarm's 3 gallon black bucket. Buckets can be the true building blocks of your indoor hydroponics setup or outdoor garden. They're an ideal way to transport media, water, and other nutrients, as well as a collection receptacle for all your other accessories. From its sturdy construction to its strong carry handle, you'll find many reasons to tote this bucket. Available in multiple sizes. Made of HDPE, but not of foodsafe resin. All our polyethylene buckets are BPA free.\n\nIdeal for building your own hydroponic system\n\nGreat for containing and transporting liquids and solids\n\nUse as a reservoir in simple hydroponic systems\n\nSteel carrying handle with ergonomic grip",
    "rating": 4.5,
    "feature_bullets": [
      "Great for containing and transporting liquids and solids",
      "Ideal for building your own hydroponic system",
      "Use as a reservoir in simple hydroponic systems",
      "Steel carrying handle with ergonomic grip",
      "Made of HDPE, but not of foodsafe resin. All our polyethylene buckets are BPA free"
    ],
    "specifications": {
      "Product Dimensions": "12 x 11 x 12 inches",
      "Item Weight": "1.45 pounds",
      "Manufacturer": "Hydrofarm, Inc.",
      "ASIN": "B009GK2SN2",
      "Item model number": "HG3G",
      "Customer Reviews": "4.5 out of 5 stars527 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#94,460 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Indoor Gardening & Hydroponics",
      "Gardening & Lawn Care",
      "Garden & Outdoor"
    ],
    "price": ""
  }
}