{
  "website_summaries": [
    {
      "verdict": "The Fitbit Zip is still a great entry-level tracker for people that don't want to wear a wristband.",
      "pros": [
        "Affordable",
        "tracks steps, distance and calories burned",
        "up to six months of battery life"
      ],
      "cons": [
        "It doesn't track sleep or stairs climbed"
      ],
      "aspects": {
        "Design": 6.0,
        "Battery": 9.0,
        "Performance": 8.0,
        "Software": 8.0,
        "Features": 6.0
      },
      "publication_date": 20160510,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great product! Love it!",
      "text": "I have been using this same product for the last four years. Recently it began to fail. Because I was so satisfied with the previous one, I bought another one exactly like the first. I love my tiny Fitbit which monitors my daily activity and is synchronized to my iPhone so that I can monitor steps, calories and several other activities.",
      "rating": 5.0,
      "verified": true,
      "author": "ciof6",
      "helpful_votes": 4,
      "publication_date": 20190523
    },
    {
      "title": "Disappointing",
      "text": "Pros: Discreet fitness tracker, water resistant. This actually survived an accidental trip through the the washer. Pretty accurate and I liked that I could see instant data. Comes in fun colors. Cons: The battery lasts 2-3 months (not 6 as advertised) and towards the end, it was a battery every 2 weeks. Clip doesn't last long...the rubber cracks exposing metal. Went through 4 clips in 18 months. Fitbit did replace them at no charge, which was awesome of them. It died after about a year and a half.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Williams",
      "helpful_votes": 9,
      "publication_date": 20151214
    },
    {
      "title": "Great fitness tool",
      "text": "This is the perfect device to keep you accountable for your health. When I wear this, I make sure that I get my daily steps, no matter what. I love how easy it is to navigate between the steps, calories, etc. All you have to do is tap the screen. I also love how convenient it is to wear, I simply clasp it to the middle of my bra. This is a great little device that is sturdy, adorable and effective!",
      "rating": 5.0,
      "verified": true,
      "author": "evan",
      "helpful_votes": 7,
      "publication_date": 20160306
    },
    {
      "title": "Sucks battery life like crazy",
      "text": "Sucks battery life like crazy. Never reads how much battery is actually left so all of a sudden you look and its off and you lost all your steps. Battery has lasted 2 months at the most and as little as one week. TERRIBLE customer service as they lie about the battery life and make excuses instead of fixing the issue. This is my fourth one and all have done the same very consistently. And they simply don't last. For that reason I am going to find a better option instead of spending $50 on junk. Fitbit, fix the problem or sell them for less than $20. Or no one will buy them anymore.",
      "rating": 1.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 8,
      "publication_date": 20150414
    },
    {
      "title": "Brilliant device! My exercise \"conscience.\"",
      "text": "I absolutely love this thing! I am suspecting that we all think we are more active than we actually are. But it is so easy to sit down at the computer \"for a minute\" and end up still sitting there two hours later. This device is brilliant! There is no kidding yourself - when you take it out of your pocket and see that you have only done 3500 steps, you know you need to get busy. That's what I use this for, although my daughter on the opposite coast from me, and I compare steps, and I think we both are a bit more motivated when we see that the other is creeping ahead!",
      "rating": 5.0,
      "verified": true,
      "author": "Mistercrisp",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Love this -- wear it every moment of the day",
      "text": "I've tried all kinds of activity trackers -- from simple step counters to the Weight Watchers tracker. This is, by a mile, the very best. It stays put; you don't even know you're wearing it. It syncs seamlessly and effortlessly to your iPhone or computer -- you do nothing but be in proximity to your devices. It can be easily adapted to the kind of exercise you do -- and anyone can do it. You don't have to be a computer nerd to use this. It will also syncs with My Fitness Pal so I get all the information I need about calories in and calories out. I love, love, love it.",
      "rating": 5.0,
      "verified": true,
      "author": "sps",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Keep Fit",
      "text": "I wear this Fitbit all day, everyday. I love how it keeps me motivated to keep moving, eating right and tracking it all. Love the weekly FitBit summary on my week. Only thing I have not used it for is tracking sleep. Maybe someday I'll try that part of the Fitbit. Love the clip that keeps the device secure on your person. Lightweight, don't even know you have it on Like the choice of colors of device Price was not outrageous, affordable for everything it does. I would buy another Fitbit in a minute!",
      "rating": 5.0,
      "verified": true,
      "author": "Dazride",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Good things don't always last!",
      "text": "I bought my fitbit back in Sept 2013 I had to replace it as I had lost the one provided at work for our wellness program. Everything was good until in late January 2014 I started having problems. In four months my battery went out and once it was replaced it's been downhill. It does not sync my correct steps taken and will reset to zero when many times I have totaled up to 3 - 4 daily miles. The time will be off along with steps and distance and not always sync my correct distance and zero it out. It hasn't been functioning well since I replaced the battery and contacted fitbit when I have done everything correctly.",
      "rating": 3.0,
      "verified": true,
      "author": "jessica",
      "helpful_votes": 0,
      "publication_date": 20140311
    },
    {
      "title": "This product is great!!",
      "text": "I purchased the FitBit Zip as a birthday gift for my daughter. She loves the fact the way this product works by encouraging her to walk more and eat less. Every day brings a new challenge to improve, even if it's just a small amount. I was so impressed by her enthusiasm that I purchased a FitBit for myself. It definitely is great. Should you decide to buy one for yourself, after installing it, be sure to follow the directions when syncing it to your PC or Bluetooth.",
      "rating": 5.0,
      "verified": true,
      "author": "N2230",
      "helpful_votes": 0,
      "publication_date": 20140305
    },
    {
      "title": "Easy setup and great product",
      "text": "I got this as a gift to my sister, and she loves using it. She feels it has helped her increase her daily activity level and it's so small and portable, she can put it everywhere. We played around and connected it to her phone and computer to keep track of her steps. It was easy to set up and fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Arli",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "better then any used before",
      "text": "My wife says this has been the best pedometer she has ever used. She is able to clip on to bra so it does not fall off like the ones clip on belt. She loves how easy it was to set it up and track her daily steps.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Jolly",
      "helpful_votes": 10,
      "publication_date": 20130916
    },
    {
      "title": "My mother in law loves it!",
      "text": "The setup was pretty straight forward and easy - The battery was a bit challenging getting fit inside the back, but overall very happy with the product and how it works which is very important. I would recommend this to family and friends. It's really nice to hear how motivated and excited my mother in-law is over the calorie tracking and online fitness program.",
      "rating": 5.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "FITBIT ZIP SUCKS",
      "text": "purchased in late November 2013 by June 2014 it stopped working (tried two new batteries) still didn't work - 6 months is all REALLY! I had the slim fitbit for a year before it stopped working - WILL NOT BUY ANOTHER ONE !!! - MY CHEAP ALARM CLOCK HAS BEEN WORKING FOR 8 YEARS ON ONE BATTERY!! Fitbit needs to get their ACT together !!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "MARIE",
      "helpful_votes": 0,
      "publication_date": 20140604
    },
    {
      "title": "Does more than I expected!",
      "text": "It does everything I expected it to do and more. Fitbit even sends a weekly progress report via email. Wearing fitbit has got me to walking more. If I walk three miles one day, and then walk less than a mile the next three days, it bings my progress way frown and I hate that. I have recommended it to friends.",
      "rating": 4.0,
      "verified": true,
      "author": "Elke Muller",
      "helpful_votes": 0,
      "publication_date": 20131215
    },
    {
      "title": "A Pedometer to live with!",
      "text": "I've blown through so many cheap, plastic pedometers that stop working that it is really nice just to have a reliable one. It fits snugly onto any band on your clothing and at the end of the day, you can see how close you've come to your 10,000 step goal. Not certain what the little emoticons are trying to communicate, though. They seem thrilled when I finish my morning walk, but at the end of the day (even if I've exceeded the 10,000 steps) it is sticking out it's tongue at me. Yes, I need some new friends... ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Susan McEowen",
      "helpful_votes": 0,
      "publication_date": 20140405
    },
    {
      "title": "Great product. More accurate than the more expensive Fitbit ...",
      "text": "Simple but works. I bought this to replace a Force that fell of my wrist. Great product. More accurate than the more expensive Fitbit products. I recommend calibrating stride for even more accuracy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Great gift",
      "text": "ii have one of these myself and bought my daughter in law one for her 40th birthday. she belongs to a gym and loves this for keeping track of steps and other things to do with her physical activity.",
      "rating": 5.0,
      "verified": true,
      "author": "maureen from NH",
      "helpful_votes": 2,
      "publication_date": 20150531
    },
    {
      "title": "Once that was accomplished the set up was easy and seamless",
      "text": "I'm still learning how to use it. It was unusually difficult to open the back to get the battery inserted. Once that was accomplished the set up was easy and seamless. Good to know that I am not taking as many steps as I thought I was taking!",
      "rating": 4.0,
      "verified": true,
      "author": "P. Green",
      "helpful_votes": 0,
      "publication_date": 20141119
    },
    {
      "title": "This is a fabulous product",
      "text": "No more lying, no more trying to calculate...did you walk the walk or did you talk the talk...",
      "rating": 5.0,
      "verified": true,
      "author": "Wild and Wonderful Wanda",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "A truly great product with excellent support",
      "text": "The FitBit is a wonderful device and encourages us to walk more than five miles a day and has enriched our lives. But what is really great is the customer service from Amazon and FibBit in replacing a torn clip under warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Master",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Helpful and motivating!",
      "text": "I misplaced another Fitbit so I ordered this one, which is exact what I had. It tracks very well and is so easy to use. If I lose this one I will reorder another one, that's how much I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Napoleon",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "Getting Fit",
      "text": "I'm thrilled with my fitbit and would recommend it to anyone. It has been such a motivator for me each and everyday. It's like my best friend when it comes to staying active each day and also encourages me to eat or not to eat some things. It's a great start in the right direction that is more healthy for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce A. Kirkpatrick",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "Piece of junk",
      "text": "Went through 3 batteries in 3 months and then just died.",
      "rating": 2.0,
      "verified": true,
      "author": "Sharon L. Brooks",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Fit Bit Zip is awesome!",
      "text": "This product syncs wonderfully with my iPhone 5c to track my steps and track my food plan. It's a great tool for weight loss and to help encourage me to stay active. I highly recommend this product and site.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20131023
    },
    {
      "title": "I wear this everyday!",
      "text": "I absolutely love my fitbit. The bluetooth doesn't sync with many phones but they say they are working on it. It does work on wifi though. This little gadget helps me be more accountable and helps push me just a little farther each day.",
      "rating": 5.0,
      "verified": true,
      "author": "LeeLee",
      "helpful_votes": 3,
      "publication_date": 20130610
    },
    {
      "title": "FITBIT KEEPS ME ON TRACK",
      "text": "FITBIT KEEPS ME MOVING EVERYDAY. I TRY TO REACH THE GOAL, BUT NOT ALWAYS EASY THIS SPRING SINCE THE WEATHER IS SO BAD. BE SURE TO BUY THE LEASH WITH IT. IT FALLS OFF YOUR WAIST EASILY.",
      "rating": 5.0,
      "verified": true,
      "author": "ChicagoTutu",
      "helpful_votes": 0,
      "publication_date": 20140430
    },
    {
      "title": "Love it",
      "text": "I love it more than my Fitbit One, which I lost. The difference is that you need to replace the batteries. And the Zip doesn't track sleep. I didn't track my sleep when I had the One...",
      "rating": 5.0,
      "verified": true,
      "author": "Kolene",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Great",
      "text": "This fitbit seems great! It's been several weeks and I find this step counter to be a great motivator to be more active. I was surprised how much more exercise I needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Zip it",
      "text": "My exercise has increased dramatically since you have a dashboard that shows all your stats. That makes you want to turn them all green (meet all goals) no matter what. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaynee C. Steinman",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Great little pedomiter that is easy to master and easy to use.  Really good product!",
      "text": "Best little device ever. It is so easy to use, (the instructions sounded complicated, but common sense tells you how. Just tap it's face to get the info). It encourages me to walk more and further and slips into my front pocket. Really good product!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Larrabee",
      "helpful_votes": 0,
      "publication_date": 20140518
    },
    {
      "title": "Keeping in step",
      "text": "A great way to keep track of your daily activity. Easy to read, updates on your smart phone during the day. Motivates you to keep up your required daily steps",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20131208
    },
    {
      "title": "Wish the Battery was Different",
      "text": "I love my FitBit but the battery life is terrible (three months) and the battery is absolutely miserable to change.",
      "rating": 3.0,
      "verified": true,
      "author": "LoveMyTwins",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "A pedometer on steroids!",
      "text": "I really love my FitBit! It makes record keeping SO easy! With my previous pedometer, I had to remember to reset it every day. Not so with this one! I also like how it links with my smartphone and all the other things I can record there too!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine A. Grass",
      "helpful_votes": 2,
      "publication_date": 20130527
    },
    {
      "title": "luv this tracker",
      "text": "Easy to use, computer tracks your steps, easily hooks on your waistband. Luv the color. It has survived a trip through the washer.",
      "rating": 5.0,
      "verified": true,
      "author": "raleigh",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Hard to install, but once done it's tap and go",
      "text": "It took several iterations to get this to work with my wifi. Once it was connected, I found it was fun to check the status on my computer and iphone during the day. I will use this all the time and strive to get in my 10,000 steps per day.",
      "rating": 4.0,
      "verified": true,
      "author": "Golfygirl",
      "helpful_votes": 0,
      "publication_date": 20131218
    },
    {
      "title": "Love my FitBit Zip!",
      "text": "I hang it at my waist and enjoy seeing the results of my daily activity. I recommend that everyone have one",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra R List",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "So Little",
      "text": "No idea what is the purpose of this little gadget, but it's a Christmas gift exchange thing, so She liked it. Look Cute and hope she will transform to her dream figure once she start using it for her exercise :)",
      "rating": 3.0,
      "verified": true,
      "author": "jbone",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "nice and small",
      "text": "Very small and inconspicuous. Good motivator to let you see what you accomplish every day. Haven't found all the perks it has built into it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "R I T",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "Love the Fitbit zip",
      "text": "I love the fitbit. It is small & convenient. I always wear it. It really encourages me to meet my daily goals.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryanne",
      "helpful_votes": 0,
      "publication_date": 20140315
    },
    {
      "title": "Fun getting fit!",
      "text": "I bought two of these so that my daughter andI could engage in friendly support of our fitness programs. We are hooked! We detail our calories in, keep track of our daily steps taken, miles walked, calories burned. It is easy to install on an Ipad, a little trickier on a laptop, and doesn't work at all with Blackberry phones. It sends encouraging messages when you approach your daily goals. And my favorite moment is 10 pm watchingTV when it says \"you have 200 more calories to eat.\"",
      "rating": 5.0,
      "verified": true,
      "author": "Mary J.",
      "helpful_votes": 0,
      "publication_date": 20130707
    },
    {
      "title": "Great and easy to use",
      "text": "I love my new little workout device! I love that it keeps track of my steps, my calories and more!",
      "rating": 5.0,
      "verified": true,
      "author": "Tebow",
      "helpful_votes": 0,
      "publication_date": 20140324
    },
    {
      "title": "It will  motivate me to keep moving",
      "text": "It does not interfere with my daily routine. It gives me a better picture of my actual activity level, which in turn reminds me that even little improvements accumulate.",
      "rating": 5.0,
      "verified": true,
      "author": "David Baldwin",
      "helpful_votes": 0,
      "publication_date": 20140215
    },
    {
      "title": "A , It's Pink!",
      "text": "A , It's Pink! It is so easy. It clips on easy. It syncs easy.The program associated with it is easy to use. It clarifies how to maximize your activities with your nutrition. It is sturdy. It is inexpensive enough that you need not fear it. Lastly it doesn't do zillion different things making it completely easy to master.",
      "rating": 5.0,
      "verified": true,
      "author": "Carole Cackowski",
      "helpful_votes": 0,
      "publication_date": 20140304
    },
    {
      "title": "Four Stars",
      "text": "Great for tracking your activity. Did not take full advantage of the options",
      "rating": 4.0,
      "verified": true,
      "author": "william g wuori",
      "helpful_votes": 0,
      "publication_date": 20150119
    },
    {
      "title": "Seriously",
      "text": "My third fit-bit. I really want to love it! They are easy and comfortable. But, My first one broke after a month and my next one says I lose more calories than I take steps. I have bought two as presents. I have spent 360$ on these things and I am not happy. I am a gadget freak. Why can't it just work?",
      "rating": 2.0,
      "verified": true,
      "author": "Candice",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Inspiration!",
      "text": "Love everything about my FitBit!! It inspires me to get moving everyday! Everyone with fitness goals should own one for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandra Rhody",
      "helpful_votes": 0,
      "publication_date": 20140215
    },
    {
      "title": "Great gift!",
      "text": "Gave this to my daughter for Xmas and she loves it! She is a techy, so it's perfect for her.",
      "rating": 5.0,
      "verified": true,
      "author": "slt",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "order",
      "text": "Perfect Thank you I have enjoyed it very much and we surprised to reciecve it so quickly and it is very much helping me",
      "rating": 5.0,
      "verified": true,
      "author": "Joy Worley",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "Easy, motivating",
      "text": "I really like the FitBit. It has motivated me to walk more every day. It was simple to set up and seems to work great without having to hook it up to a computer.",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Love it",
      "text": "I wear this product ever day to monitor how active I am each day. It makes me think about how much I should move and exercise.",
      "rating": 5.0,
      "verified": true,
      "author": "vmandy18",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Great invention!",
      "text": "Gets me motivated and moving! love love!i can compete with my friends and it's easier using their free app than weight watchers.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer kyett",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Love the Fitbit!!!",
      "text": "Live the Fitbit and how it makes me want to walk more and get in shape!!! It is a great insentive!!!",
      "rating": 5.0,
      "verified": true,
      "author": "cj smith",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "FitBit Zip",
      "text": "Love this little guy...keeps you motivated, easy to use and no one knows I am wearing it! Battery was not a problem for me and like that I don't have something else to plug in every night.",
      "rating": 5.0,
      "verified": true,
      "author": "PB Bert",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Great activity monitor!",
      "text": "This is a great little gadget that can be a simple \"step counter\" or part of an overall fitness plan if you link it with MyFitnessPal software. Put all of your fitness info together and be as detailed as you choose. One caution - my daughter got so fixated on her number of steps that she had to put her FitBit in TimeOut for a few weeks!",
      "rating": 5.0,
      "verified": true,
      "author": "Janet",
      "helpful_votes": 3,
      "publication_date": 20130819
    },
    {
      "title": "Love My Fitbit Zip",
      "text": "This is my 2nd FitBit Zip I lost my first one. I just love it. It is durable and keep track of my activity and calories. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Lois Smith",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Inspiring",
      "text": "It encourages me to get out and do more. it has stayed securely attached to wherever I put it so far. A security strap would be a nice addition.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreamfarm",
      "helpful_votes": 0,
      "publication_date": 20130323
    },
    {
      "title": "This device has really kicked my fitness up a notch!",
      "text": "I had heard some of my friends talk about their Fitbit and I became intrigued. I did some research of my own and decided to purchase it. I am very pleased and it coincides well with my fitness regime. I would definitely recommend this device to all who are keeping track of their fitness or weight loss activity. This is a must have!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20130312
    },
    {
      "title": "i like it",
      "text": "I enjoy my fitbit!! It's easy to get started and you don't have to reset it for the next day",
      "rating": 4.0,
      "verified": true,
      "author": "Vickie Garfield",
      "helpful_votes": 0,
      "publication_date": 20140326
    },
    {
      "title": "Wish it would track miles cycling",
      "text": "When I remember to wear my FitBit, it is really accurate. I test it periodically on a treadmill at the gym and the miles are within 0.10 mile. It is small so I usually forget it is there, and when I change clothes, I have to remember to pull it off. It holds on tight to my pants. I'm not sure what the faces it makes mean, but at least it never frowns at me. My only wish it that when I bicycle 20 miles, it only reads that as 2-3 miles. I'm sure someone is working on a BikeBit.",
      "rating": 4.0,
      "verified": true,
      "author": "Joy Marie",
      "helpful_votes": 0,
      "publication_date": 20130630
    },
    {
      "title": "Like it!",
      "text": "I could not sync it to my Windows XP laptop so I could not get the operating instructions except from Youtube videos. The device needs to come with written instructions. I love the size of the device and really like the fact that I can clip it to my bra or pants.",
      "rating": 4.0,
      "verified": true,
      "author": "Susie Bogus",
      "helpful_votes": 0,
      "publication_date": 20140317
    },
    {
      "title": "Nice Product BUT...",
      "text": "Product is great but does not connect via Bluetooth to all smart phones. I found that out the hard way.",
      "rating": 3.0,
      "verified": true,
      "author": "Ashley Gardner",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "A hit as a birthday gift!",
      "text": "My grand daughter loved the magenta activity tracker. I also gave her two of the bracelets that would go with it, one in pink, one in white.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Losing weight the right way with FitBit",
      "text": "I have had this for months, works great..... I have lost 16 pounds, just by watch how many steps I take in a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Kimmel",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "My wife loves it.",
      "text": "I bought the FitBit for my wife and she wears it every day. We use it for number of total steps per day and also to determine the mileage of our daily walks.",
      "rating": 5.0,
      "verified": true,
      "author": "Quiltnvan",
      "helpful_votes": 0,
      "publication_date": 20130422
    },
    {
      "title": "Excellant tracker",
      "text": "It tracks everything I normally do by hand. It also gives you a weekly progress summary via email. Dashboard easy to read.",
      "rating": 5.0,
      "verified": true,
      "author": "patricia winner",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Great Motivation!",
      "text": "This is a great tool for daily feedback on diet and exercise, customized just for me. It is easy to wear and gives a wealth of information.",
      "rating": 5.0,
      "verified": true,
      "author": "WSF",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Great product!",
      "text": "Compact size,silicone cover for protection, easy to set up. Great motivator when you see your progress. Graph is great. We'll worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Lynch",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "Handy Activity tracker",
      "text": "The FitBit met & exceeding my expectations! I love that I can see my progress on my smartphone anytime I want and that each week I get a progress report of my total activity. It will even track your water consumption for you - but that you have to enter each time you drink some. I definitely would recommend this to anyone that's active & wants to monitor their activity.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Mathews",
      "helpful_votes": 3,
      "publication_date": 20130417
    },
    {
      "title": "a real motivator!!",
      "text": "This is easy to set up, fun to use and has made a big difference in the amount of walking I do.",
      "rating": 5.0,
      "verified": true,
      "author": "d weeks",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "Love!",
      "text": "Helped me to lose 7 lbs in a few weeks! Like that it is based on my own personal information and not just a one size fits all pedometer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Frame",
      "helpful_votes": 3,
      "publication_date": 20130711
    },
    {
      "title": "Like the Color, but it uses a battery",
      "text": "I liked the color of this Fitbit because the black one blended in with my clothes and I ended up washing and drying it--and it died! BUT I used to have the One and I could charge that with my computer. The Zip has a battery and I didn't like that. Also, I could not sync the Zip with my computer, but that was probably my fault! So I returned the Zip and I purchased another One. I just have to remember to keep it out of the wash! It's an expensive mistake!",
      "rating": 2.0,
      "verified": true,
      "author": "Anitaarm",
      "helpful_votes": 0,
      "publication_date": 20130909
    },
    {
      "title": "One Star",
      "text": "Battery runs low way to quick and it is annoying having to change a battery every few days.",
      "rating": 1.0,
      "verified": true,
      "author": "Nina G.",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "the fitbit is great.",
      "text": "Use it every day, except the batter went dead, so I have to get a new battery and haven't had the time. But, the fitbit is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary C. Davies",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Great motivation!",
      "text": "Love it it tracks steps taken in24 hours and resets automatically at midnight. I also love that I can sync it to my phone and add my daily calorie intake exercise and water. It really motivates me to move more!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Conscience, condensed",
      "text": "I've been wearing this for a month and I'm feeling better every week. The Fitbit helps me throughout the day to make healthy choices.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20130531
    },
    {
      "title": "Loving my Fitbit",
      "text": "I've been using the Fitbit for about a week now and so far I like it. It's nice to how how many steps I take everyday, but also scary to know how few I take some days. I plan to start travking the number pf calories and ounces of water consumed as well. The set up was easy and painless. I like that all of the information from the Fitbit syncs to my smartphone.",
      "rating": 5.0,
      "verified": true,
      "author": "SmoocherBean",
      "helpful_votes": 0,
      "publication_date": 20130711
    },
    {
      "title": "FitBit Z",
      "text": "So far so good. Just started using it today. It came while I was out of town. Don't quite understand the calorie burn screen. It's says I burned calories that I did not burn. But it syncs nicely to my computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Claudine A Waldo",
      "helpful_votes": 2,
      "publication_date": 20130319
    },
    {
      "title": "Problem",
      "text": "Will not connect to internet. I will have to contact manufacture or get a new one. Can you send me help to resolve problem.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert V. Dahlke",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Not working properly",
      "text": "It does not sync up with laptop. Had one before that worked great. This one does not \"wake up\" it is worthless!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "No manual, no instructions, very complicted",
      "text": "Could not figure out what app I needed to sync with my Galaxy III android phone. My husband, who is computer savy could not sync it either. It is just sitting on my desk. May just send it back!",
      "rating": 1.0,
      "verified": true,
      "author": "LMT",
      "helpful_votes": 2,
      "publication_date": 20131031
    },
    {
      "title": "Great Product!",
      "text": "Love how small it is and easy to use! I have become much more active and aware of what I am eating.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20131015
    },
    {
      "title": "Keeps you moving",
      "text": "This product is great, it gives you a chance to be held accountable and you are able to find friends that have it and compete to have more steps. This makes it a little bit more fun as well. The internet connecting makes it easy to sink and allows you to see you progress in a weekly and monthly chart. This is small and very convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli Arasz",
      "helpful_votes": 2,
      "publication_date": 20130415
    },
    {
      "title": "great!",
      "text": "The Fitbit Zip is small and easy to operate. Works the way it is advertised and has a great app to help you follow your plan.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda Hood",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "Disappointed.",
      "text": "Either the battery ran out or it broke within he first 2 weeks. I'm super disappointed and will exchange it but that's a pain.",
      "rating": 1.0,
      "verified": true,
      "author": "Alice Lee",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Love this product",
      "text": "I bought one for myself and after the first day I knew my husband would enjoy this so I ordered him the grey one. We really like them and we are already more active with them - trying to see who can get the most steps in the day. I've gone from just 5-6,000 to over 10 per day in just the short time I've been using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 5,
      "publication_date": 20130809
    },
    {
      "title": "Great product",
      "text": "It does it all and is so easy to use. I gave it as a birthday gift and she loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Coe",
      "helpful_votes": 0,
      "publication_date": 20131124
    },
    {
      "title": "I love my fitbit",
      "text": "I am using my Fitbit to train for my first 5k walk . It is helping me track my steps and miles .",
      "rating": 5.0,
      "verified": true,
      "author": "Wamplers",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "Second One",
      "text": "I had purchased one of these earlier. My wife liked it so much that she also wanted one. We are happy with the unit.",
      "rating": 5.0,
      "verified": true,
      "author": "W.D. Tamm",
      "helpful_votes": 2,
      "publication_date": 20130118
    },
    {
      "title": "Zipping along!",
      "text": "Great product both I and my friends have them. Now my girlfriend has one as well. Look forward to using this product to aid in assisting my exercise program.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20130515
    },
    {
      "title": "Washed an Dried and still works",
      "text": "This is amazingly sturdy. It has survived a night outside in the rain and recently went through the wash cycle and being dried in the dryer. Still works. Oh, it also clocked two miles between the washer and dryer.",
      "rating": 4.0,
      "verified": true,
      "author": "FRAN",
      "helpful_votes": 2,
      "publication_date": 20131208
    },
    {
      "title": "Could Not Connect",
      "text": "I could not get mine to connect to the internet and there is no phone support. I returned mine, too bad!",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Thomson",
      "helpful_votes": 2,
      "publication_date": 20130510
    },
    {
      "title": "My wife really likes it",
      "text": "I bought this as a gift. My wife is extremely happy with the features and the small size. It is much smaller than you might think and clips on the inside of her clothes easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 7,
      "publication_date": 20130116
    },
    {
      "title": "Unable to use it.",
      "text": "I don't hate it. I have not been able to use it yet because my laptop isn't compatible. I understand that I have to set up another account. I will be getting help with this next week. I'm sure I will like it once I am able to use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20130809
    },
    {
      "title": "Resets unexpectedly",
      "text": "It seems to short out. I did a step class tonight and it reset itself and only tracked 5265 steps when I was already at 4000+ steps prior to the class. It's done this before and is very frustrating.",
      "rating": 3.0,
      "verified": true,
      "author": "Theresa Montez",
      "helpful_votes": 0,
      "publication_date": 20130513
    },
    {
      "title": "Nearly impossible to wake up",
      "text": "I was excited to get this, but very disappointed that it is very difficult to wake up. I thought perhaps it just needed a new battery, but alas, that is not the case. Planning to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Karen M Jost",
      "helpful_votes": 3,
      "publication_date": 20130430
    },
    {
      "title": "My wife loves it!",
      "text": "My wife uses it to track her steps and calories burnt, easy to use. It's small size makes it easy to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Lussier",
      "helpful_votes": 0,
      "publication_date": 20130613
    },
    {
      "title": "Wife likes",
      "text": "Had trouble with getting the correct software for the Mac but I also got a new Mac and then all was well. Seems to be working well.",
      "rating": 4.0,
      "verified": true,
      "author": "Dan Dantuono",
      "helpful_votes": 5,
      "publication_date": 20130117
    },
    {
      "title": "Keep it moving!",
      "text": "Just wearing the Fitbit encourages me to do more to meet my fitness goal. It is small, neat, vibrant in color and light-weight. I don't have a problem keeping the device from slipping off my waistband as others have done. It doesn't make that clicking sound with every step you take. I like that the information automatically syncs with and updates on my computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jannie MB White",
      "helpful_votes": 5,
      "publication_date": 20130315
    },
    {
      "title": "fitbit not fit",
      "text": "It did not work. I returned it. I could not get it to sync with my computer. Difficult to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20130822
    },
    {
      "title": "Great product",
      "text": "Makes me go the extra miles to compete with family. A new part of the morning is clipping on the Fitbit.",
      "rating": 3.0,
      "verified": true,
      "author": "Suzanne M. Boerschinger",
      "helpful_votes": 2,
      "publication_date": 20131228
    }
  ],
  "product_meta": {
    "title": "Fitbit Zip Wireless Activity Tracker in Magenta",
    "description": "Garantie L'étroite collaboration entre High-Tech Place et ses fournisseurs nous permet de vous proposer une garantie commerciale de 1 an.",
    "rating": 4.2,
    "feature_bullets": [
      "FitBit Zip Fitness-Tracker magenta"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.87 x 0.98 x 7.8 inches; 3.74 Ounces",
      "Item model number": "40-15-4017",
      "Batteries": "1 Lithium Metal batteries required.",
      "Date First Available": "September 30, 2012",
      "Manufacturer": "FITBIT",
      "ASIN": "B0096NXKBS",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Exercise & Fitness",
      "Activity & Fitness Trackers",
      "Sports & Outdoors",
      "Sports & Fitness",
      "Fitness Technology",
      "Health, Household & Baby Care"
    ],
    "price": 199.99
  }
}