{
  "website_summaries": [
    {
      "verdict": "A surprisingly soft yet durable plush toy for indoor tug-of-war fun for dogs of all sizes.",
      "pros": [
        "Braided nylon crab legs will withstand many a fetch",
        "This is a super-tough squeaky ball covered in plush and cuddly fur",
        "Available in small, medium, or large"
      ],
      "cons": [
        "Remember that it’s a tug-toy, not an indestructible chew toy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Broke way too quickly and did not squeak",
      "text": "I was super excited to get this toy, and so we're the dogs. Unfortunately, pulling on the legs did not cause the toy to squeak, and sean keeping the body together came undone within a few plays. Got this for the dogs for Christmas and lasted less than ten tugs. I was very disappointed to have paid 17 dollars for it. Other reviews are good, so I don't know if the toy we received was defective, given that it wouldn't even squeak. :~( Would love to give it another shot, but not for that price!",
      "rating": 1.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Fell apart in less than a week.",
      "text": "I have the smaller version, and it's been great for months. This extra large one, made for larger dogs? It didn't last a week before one leg was spilling stuffing, and a front claw fell off. 40 pound yellow lab puppy. Cute toy, but not a good value.",
      "rating": 2.0,
      "verified": true,
      "author": "T.F.",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "From shipping box to trash in 20 minutes flat",
      "text": "My puppy was pretty stoked to get this toy. It consists of a large squeaky ball in what amounts to a crab costume. This is a very loud toy and seemed well made. I went to the bathroom and by the time I washed my hands the body had already fallen apart my the seams and he was destroying the ball. On one hand, I liked that the dog was super excited for this toy. On the other, it seems pretty poorly made for a $12 toy since it fell apart at the seams. It lasted 20 minutes from Amazon box to trash can. What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "My furbabies favorite toy",
      "text": "I have ordered 3 of these crabs in my dogs 3 years of life and I must say is by far their favorite toy that stands up to some serious tug-a-war tournaments. You will save about $5 ordering this through Amazon as the local pet shop charges more. I have a GSP and an Irish Terrier if that helps. Oh and you will find carcasses in random places as the toy is pulled apart which will make everyone in the family giggle :)",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Hedman",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Not for powerful dogs.  16 month old calm GSD destroyed within an hour",
      "text": "I love Jolly products but this lasted about an hour before the face was ripped from the seams and then the next day the band with the legs was ripped at the seam and all there is a loud squeeky ball. Last time this happened (6 months ago) with a dog toy it was credited to my account and I returned it with shipping on the seller. How can I get this done again? Toy seems durable but it was the seams that were not stable. Not for big dogs. I just wanted 30 days; that's all.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Guess it isn't bad for her because she is still at it",
      "text": "My dog loves it. Sure it is more expensive than a lot of squeaky toys but my Lab takes several weeks before she puts a hole in the ball. The only real down side is she eats the fabric which does make the poop a bit on the orange side. Guess it isn't bad for her because she is still at it.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Simms",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Poor quality",
      "text": "Don't waste your money on this cute toy. It fell apart in just a few minutes after our dog was just shaking it. We weren't even tugging on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Pat H.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Cheap",
      "text": "My dog loves it. But brokeoff the first claw in less than 5 minutes playing on his own.",
      "rating": 1.0,
      "verified": true,
      "author": "alexander zuhusky",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "... toy every 3 months cause it’s our fur babies favorite!",
      "text": "We buy this toy every 3 months cause it’s our fur babies favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Hedman",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Nope!",
      "text": "I have a 32lbs Boston Terrier & this lasted maybe 4 minutes before it was dismantled into several pieces.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan S.",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "Great toy",
      "text": "My dog hasn't found a way to destroy it yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime W.",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "crab people crab people",
      "text": "My medium to large dog loves this toy. It is big and on the heavy side. Has lasted 5 months and still squeeking. The squeeker can be super annoying, but hilarious at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Bullitt",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "My boxer's favorite!",
      "text": "I just ordered my third replacement of this squeaky crab toy... it's my boxer's absolute favorite toy! No dog toy will last forever-- not with my dog, anyway-- but it does last a good long while, longer than most of his stuff, and even when he has it destroyed down to just the middle body of the crab (with his legs and claws long torn off), he STILL loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Two Stars",
      "text": "Cute toy, but my 1 year old Boston Terrier destroyed it within 20 mins of opening.",
      "rating": 2.0,
      "verified": true,
      "author": "Laura Weber",
      "helpful_votes": 0,
      "publication_date": 20170211
    },
    {
      "title": "Four Stars",
      "text": "My dog loves the crab and it holds up pretty well considering how hard he is on toys!",
      "rating": 4.0,
      "verified": true,
      "author": "Diane Gray",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "If your dog is a big chewer get a different Jolly Tug",
      "text": "Adorable but not as sturdy as the other Jolly Tug pets. My Wheaten terrier had it apart in 2 days",
      "rating": 3.0,
      "verified": true,
      "author": "L. Ragone",
      "helpful_votes": 0,
      "publication_date": 20150103
    }
  ],
  "product_meta": {
    "title": "Jolly Pets Tug-a-Mal Crab | Squeaky Tug Toy for Dogs",
    "description": "Size:X-LargeTug-a-Mals' easy-to-grip handles encourages tug of war play between pups, and levels the playing field for humans. An internal squeaker thrills four-legged friends with a surprising element of realism. Soft to the touch, but hardcore in the squeaky department, Tug-A-Mal offer the best squeak on the block. When playtime is over, Tug-a-Mals are great for curling up to for a little doggie nap. Available in four sizes and multiple shapes, Tug-A-Mals are ideal for indoor or outdoor play. Patented: U.S. Patent No. 8,881,685 / 9,295,232 / 9,681,643. Proudly offered by Jolly Pets. Jolly Pets is proud to support organizations nationwide that provide dog toys to dogs in shelters- we believe all dogs should be Jolly (even while waiting for their forever homes).",
    "rating": 3.2,
    "feature_bullets": [
      "Designed with your safety and your pets safety in mind",
      "Safe material for your pet",
      "Made in the USA with quality materials"
    ],
    "specifications": {
      "Product Dimensions": "20 x 6 x 6 inches; 12.64 Ounces",
      "Item model number": "JTA65",
      "Date First Available": "February 18, 2013",
      "Manufacturer": "Horesemans Pride/Jolly Pets",
      "ASIN": "B009XP9OUU",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Squeak Toys",
      "Dogs",
      "Toys",
      "Pet Supplies"
    ],
    "price": 16.99
  }
}