{
  "website_summaries": [
    {
      "verdict": "Pre-drilled with multiple options, these brackets support up to 65 pounds each and can be painted to match any project.",
      "pros": [
        "Pre-drilled installation holes",
        "Multiple holes for multiple levels",
        "Steel construction",
        "Enamel finish",
        "Each bracket rated for 65 pounds",
        "Can paint any color to match decor",
        "Great for use in garage and utility projects"
      ],
      "cons": [
        "Screws not included, but that's so you can choose the correct type for your project and wall type"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Buy!",
      "text": "Great garage brackets! I could've bought a size smaller but these are working great. Love them. Will buy again if I need to do another wall. WAY less expensive than big box stores. Picture shows them with 1\"x12\" shelving. I put the 10\" length under the shelves and the 12\" length on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 40,
      "publication_date": 20150910
    },
    {
      "title": "Sturdy and Inexpensive!",
      "text": "These things are fantastic. Sure, they're well made and fairly strong, but the greatest thing about them is how inexpensive they are. Install them 16\" apart at every beam and the shelf will be solid and sturdy. For light duty, they could be installed every 32\", but for a garage shelf that tends to accumulate a lot of weight use them at every beam.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam P",
      "helpful_votes": 9,
      "publication_date": 20180402
    },
    {
      "title": "price is a + but not the toughest hangers on the market.",
      "text": "Great price for 20 of these, they arent the toughest hangers though so be aware of that! I only used 3/8\" plywood as shelves but put one of these in every stud throughout the shelving. This was just garage storage for me so no biggy there",
      "rating": 4.0,
      "verified": true,
      "author": "B. Schultz",
      "helpful_votes": 21,
      "publication_date": 20160205
    },
    {
      "title": "One Star",
      "text": "There was only ONE bracket in my box. ONE. ridiculous.",
      "rating": 1.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 19,
      "publication_date": 20170410
    },
    {
      "title": "good brackets",
      "text": "brackets are what I expected. good quality, decent price. I just put a couple of shelves up in my outdoor shed. Brackets were fine. I'd definitely would buy again. these are the types of brackets I'm used to for the last 40 years. not the cheapo knock-offs.",
      "rating": 5.0,
      "verified": true,
      "author": "TNman",
      "helpful_votes": 5,
      "publication_date": 20180525
    },
    {
      "title": "Handy lil brackets",
      "text": "Great price, better value then the box stores. Gray color is nice not an option always avail in stores. Does not come with hardware, which no big deal given everyone is installing theirs differently. Needed some shelving for my project room closet to help with organization and these fit the bill perfectly. They are sturdy for my purposes and seem to handle the shelves i used (just 2 x 12 lumber from local box store). They aren't going to be supporting an really heavy items anyways. And i like the look of the beefier shelves.",
      "rating": 5.0,
      "verified": true,
      "author": "c. gonzales",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Good quality for the price, sturdy",
      "text": "Good quality and fair price: I put up 48ft of garage shelving with these spaced every 18 inches to 2 feet, and they hold the weight of the shelves well. I am not over-stressing the shelves (bottles of motor oil, polishes etc.), but they're holding up well. I have the 10\" side into the wall, and the 12\" side out for a longer shelf, which will be the weaker combination (stronger combo would be 12\" in wall, 10\" of shelving)... but doing well. Metal is slightly soft under tight screws, but this is useful as it twists the shelf into shape if a screw is slightly off. So 5/5 rating - all good!",
      "rating": 5.0,
      "verified": true,
      "author": "Steve B.",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Does the job with slight modificaton.",
      "text": "Sturdy and does the job with slight modificaton, which I knew about before purchasing. Basically, when securing to 2x4 studs in walls, the single bottom screw hole is great but not the two upper screw holes at the angle. Due to the space between the upper two holes it is nearly impossible to secure both screws to a 1.5 inch deep 2x4 stud. Had to drill a separate hole just above and between both of the upper screw holes. Then, would secure bracket using the new hole and one of the two upper screw holes.",
      "rating": 5.0,
      "verified": true,
      "author": "kazekozo77",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Awesome supports for easy and quick shelves",
      "text": "Awesome supports for easy and quick shelves. One problem I had, which really wasn't a big deal is that 1 or 2 of the brackets had at least one \"hole\" that was not punched. I easily drilled a hole and it was good to go. The manufacturer suggests 25 pounds per support. I would say that in some spots, I have more than that. I ordered a total of 200 of these for my back room / storage area and I now have sooooo much space for activities!",
      "rating": 5.0,
      "verified": true,
      "author": "Bored Paracord",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Quality material, good finish and good value.",
      "text": "I was installing many shelves in a storage and deeded about sixty of these brackets. I had a few brackets on hand that had been purchased from a big box store. Needing about sixty more brackets I just didn't want to pay the price that hardware and big box stores were asking. These brackets are equal in quality to those that I had on hand and are aboult 1/2 the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JPerryE",
      "helpful_votes": 3,
      "publication_date": 20170326
    },
    {
      "title": "Be careful when ordering",
      "text": "I ordered 10 x 12\" brackets, and it says that all over the description. I got 6 x 8\" brackets and I would have tried them for what I needed but they felt super flimsy. The part number printed on the package even matches, but the description on the box says 6 x 8\", so I don't really understand how I got 6 x 8\". Is this a 10\" or 6\" bracket??",
      "rating": 1.0,
      "verified": true,
      "author": "Katie Zudjelovic",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Easy to install and great quality. 100% recommend",
      "text": "Love it. Definitely recommend. Easy to install and good quality. Just as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Niels Berg",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Happy with Purchase",
      "text": "The only thing that I had to be careful with was the size of the 2x4 studs. A 2 inch stud isn't really two inches so the screw holes on the edge \"shelve brackets\" have to be aligned with care or screws will miss the stud edges.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "great cheap lite brackets",
      "text": "same dam brackets i paid almost double at hardware store for. they are plenty strong for most applications. don't think your gonna put hundreds of pounds on them, i bought them for storage of common house hols stuff. if your wanting to put machines or really heavy stuff on them then get a grip and buy the appropriate weight brackets.",
      "rating": 5.0,
      "verified": true,
      "author": "jimmy M.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great Value",
      "text": "The shelf brackets are sturdy and well made. I got 20 of them for $22. Can't beat the price. They are almost 12 inches on the long side so they hold a large shelf. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Mc",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Exactly what I needed.",
      "text": "These are much stronger than the orange logo big box store I purchased my last ones from for the same price. These are holding up a large wall bookshelf. They look great and I'm not concerned anything will fall down from the weight of the books.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "It works",
      "text": "I used this product for garage shelving . The brackets are well built and handle the load I put on them. I origionally bought two orders of 20 each. I have since ordered another 20. They are great for organizing and saving space. I recommend these brackets. You will be happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles B..",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Good. Sturdy. Consistent. Received 20.",
      "text": "I made 5ft long wooden shelves and used three brackets per shelf, screwed into wall studs. Shelves are sturdy and I don't worry about putting too much weight on them.",
      "rating": 5.0,
      "verified": true,
      "author": "trinadiazreal",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great price and I dont have to go anywhere?",
      "text": "Great value, used them for shelves to store my art and crafts products which can get pretty heavy and they are still on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Pope",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Really Strong, Incredible Value!",
      "text": "Great brackets - very strong! Used 3 of them to support a wooden closet shelf 65\" wide by 20\" deep. Absolutely no problem supporting it. The only negative is that they are not a true L, so if you are needing a bracket that sits flush against two surfaces, this will not. It's won't be off much, but it won't be flush. Incredibly great value for the money!!!",
      "rating": 4.0,
      "verified": true,
      "author": "GnT",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Only 1 bracket received not the 20 as advertised.",
      "text": "Ordered a few weeks back and received a single bracket in the box. It is listed as \"Item Package Quantity 20\" I was able to return the item however. It seems others have similar issues.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170715
    },
    {
      "title": "They're holding up lots of boxes in my shop.",
      "text": "I bought dozens of these to put up shelving in my garage at home. I'd say three of these under a five-foot long shelf can hold up 80 pounds, maybe more. A good deal for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Hendrik A. Mills",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Flimsy & light duty....",
      "text": "Not as expected. Half the thickness & weight of ones from Home Depot or Lowes. Project was time sensitive so I had to use twice the number of brackets to carry the weight. Brackets are flimsy and only suited for light duty (IMHO)...!",
      "rating": 5.0,
      "verified": true,
      "author": "Zonk",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Nice & sturdy brackets.",
      "text": "These brackets were suitable for my project. I used 15/16\" plywood cut 10\" wide. I put heavy boxes on them like files and such.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave B.",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Everything I needed for the perfect price",
      "text": "Tried finding brackets from the home stores near me. Nothing compared to the price and value these were able to provide. Love this product will definitely order again in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Sutter",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Quality and economy",
      "text": "Great brackets, holding up well so far. Used them to make some shelves in my garage to hold parts and boxes. For the quality and amount in a box it is worth twice the price, please dont increase it now.",
      "rating": 5.0,
      "verified": true,
      "author": "Some random dude",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Great Value",
      "text": "I used these as supports for a shelf-based model railroad layout built around 1x3 framing and foam board track laying surface. Installed into each stud, these create a VERY sturdy shelf with no flex where it is 1 foot deep, and with the back of the framing screwed into the studs in the 24\" sections I have less than 1⁄8\" of flex there as well. Overall I'm really happy with these for the price paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "They just work.",
      "text": "Shelving in my home. easy to install , I used the gray ones , as they seam to be the best color for my purpose. I spaced the brackets at a 32\" center , so I was able to hit a wall stud for each.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Great Shelf Racks.",
      "text": "These are identical to the image. You need to hang shelves? You have used these types of brackets before, maybe seen then in store, then these are identical to those. These are good quality. Some are made thin with sharp edges, these are not that way and have thicker metal with smooth edges.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnny Wilson",
      "helpful_votes": 2,
      "publication_date": 20151009
    },
    {
      "title": "Great economical shelf brackets",
      "text": "I wanted inexpensive shelf brackets for attic storage and that is what I received. The sheet metal appears to be a lighter gauge than I could purchase at my local hardware store. However, for my intended purpose, they are perfect and less than half the price if purchased locally.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Great value",
      "text": "Paid half of what I previously paid for the same shelf bracket I purchased a few days earlier at an Ace Hardware. Looked and worked as well as \"name-brand\" shelf brackets.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Good for VERY light items",
      "text": "Cheap and flimsy... not too unexpected, but felt flimsier and cheaper than I was expecting. 2 medium duty 10x12 brackets hold up more weight with less flex than 7 of these on the same span and length of shelving. Good for VERY light items.",
      "rating": 2.0,
      "verified": true,
      "author": "silkiechicken",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Great for shed shelves.",
      "text": "These were a good value and seem as sturdy as anything else I've used. I needed a bunch.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Hey it's a bracket. Not too exciting",
      "text": "But used as support for upper, bedroom closet, pinewood shelving. Sprayed white and voila. Worked perfectly for this situation.",
      "rating": 5.0,
      "verified": true,
      "author": "French Roast",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "All in one shot.....no multiple trips to multiple stores",
      "text": "Needed to put up shelves and I couldn't get enough brackets from one store. Amazon had all that I needed in one box.",
      "rating": 5.0,
      "verified": true,
      "author": "franklin watson",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "sturdy metal, will hold even something heavy which is ...",
      "text": "we ordered 2 different sizes and both will be serving us well for many years to come. sturdy metal, will hold even something heavy which is why we chose these over something more visually pleasing, these are perfect for putting heavy things on a shelf.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin T",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "it makes a pretty sturdy storage shelf for the garage if you have ...",
      "text": "Trying to find more places to put up unfinished shelves around the house. Have resorted to volunteering to install shelves at friends houses. Paired with a 6'x1\"x12\" plank, it makes a pretty sturdy storage shelf for the garage if you have exposed 2x4s like i do.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess L",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Great value and product",
      "text": "Great product for your dollar! Took my hubby 30 mins to install a total of 6 brackets for 3 shelves. We packed the shelf’s with books, toys, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole Burleson",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Great products.",
      "text": "Great brackets- worked well in my \"pantry\" I created above my washing machine. Seem to be sturdy, the color is fairly neutral, and they are easy to measure with the raised crease running down the center. I bought two 20 packs of this.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20170311
    },
    {
      "title": "As advertised.",
      "text": "The made well and I didn’t have to leave the house to get them. So everything went great. I hope everyone has a blessed day.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Worked fine",
      "text": "I screwed these into studs and spaced them 32\" apart; they worked great for bins of screws.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Hartman",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Nice brackets",
      "text": "Nice quality and great value, would buy again, perfect for adding shelves in my shop.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Guyse",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Great Value",
      "text": "Half the price of anywhere else, seem pretty sturdy too. Would order again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandman_Detroit",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "L bracket",
      "text": "I only used the brackets to hang reefs and dried flowers and they worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Good Buy",
      "text": "Great price for the quantity you receive. Used this to put up shelves in my shop and still had some left over. The metal is heavy gauge not flimsy tinfoil metal. The brackets were able to handle a good deal of weight from the stuff I put on the shelves ( saws, drills etc).",
      "rating": 5.0,
      "verified": true,
      "author": "Truth Be Told",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "3rd time we have purchased this product!",
      "text": "We are redoing the closets and pantry in our home. We have used these brackets to install the shelving for both. They are supper sturdy and very easy to install. We originally purchased them for one closet and have now used them in another closet and in our pantry. We love them and will purchase them again!",
      "rating": 5.0,
      "verified": true,
      "author": "Sabrina Buller",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Excellent. Stronger than similar brackets from a big box store. Would buy again.",
      "text": "Excellent brackets. They were more rigid and provided better shelf support than similar shelf brackets that I got at a big box store.",
      "rating": 5.0,
      "verified": true,
      "author": "TH3298",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Medium duty",
      "text": "A good product. They are not the very heavy duty ones, but if you put them every two feet, they are adequate for putting a few hundred pounds on a 10 foot shelf.",
      "rating": 4.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Quality brackets",
      "text": "Price was right (extremely so), delivery prompt and quality is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "E. H. Hobbs",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Great quality for the price",
      "text": "As other reviewers have claimed these are a very good value. Strong enough for what they are made for and you can't beat the price",
      "rating": 5.0,
      "verified": true,
      "author": "JohnMac",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Perfect for my needs",
      "text": "Great product. They came packaged very well and they were all accounted for. I ordered another box after I saw how nice they are.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Great value, great brackets.",
      "text": "Nice and sturdy, gray, and overall brackety looking. What can I say, they do a great job and have a great price. Use them in the office, studio and workshop.",
      "rating": 5.0,
      "verified": true,
      "author": "Trip Bauer",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Heavy duty shelf brackets value priced",
      "text": "Was not expecting such sturdy brackets but was pleasantly surprised. Exceptional value and quality product that I would recommend to anyone needing to put up shelving.",
      "rating": 5.0,
      "verified": true,
      "author": "momak",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Handy and not too difficult to install",
      "text": "We used a whole set of these for shelves in the workshop and so I bought another set for office shelves. They are pretty easy to install with regular sheet rock screws.",
      "rating": 5.0,
      "verified": true,
      "author": "Headin’ Home",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Works perfectly.",
      "text": "Great brackets for shelves. I used in the Garage but I just framed in a closet for our bedroom. Will probably just use these as well. No need for closet maid or other shelves. Its a closet.",
      "rating": 5.0,
      "verified": true,
      "author": "Shootsnscores",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Just what we needed for our garage shelves.",
      "text": "I needed a bunch of brackets to hold MDF floating shelves in our garage. This set was just what we needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly S.",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Great deal on shelf brackets",
      "text": "Great deal on shelf brackets. Built new shelving in the garage on studs as well as in the basement into brick. Holding up nice and sturdy. I will probably look into another set soon.",
      "rating": 4.0,
      "verified": true,
      "author": "ACP",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Sturdy",
      "text": "Very sturdy and having one side shorter makes them versatile. One side I used for 10\" the other for 12\". These are as strong as any I have ever seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Lord",
      "helpful_votes": 2,
      "publication_date": 20140916
    },
    {
      "title": "Money saving.",
      "text": "They do the job required. Cost savings over big box store prices.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney H.",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Good choice",
      "text": "Brackets were all I expected them to be and seemed a bit sturdier, and certainly less expensive, than those of the same size at Home Depot.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold",
      "helpful_votes": 4,
      "publication_date": 20131115
    },
    {
      "title": "Five Stars",
      "text": "Worked perfect for the basement shelves I installed. I ordered a second set.",
      "rating": 5.0,
      "verified": true,
      "author": "steven",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Used those for extra shelving in my garage. After ...",
      "text": "Used those for extra shelving in my garage. After shopping at my local home supply store I decided to go with Amazon. I've save a lot of money as these were a lot more at the store,",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Happy",
      "text": "I've bought these twice now. They are sturdy and can not get them at a better price. I use them In my closet and out in the garage.",
      "rating": 5.0,
      "verified": true,
      "author": "jazz_loving_life",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great value and quality",
      "text": "Best value I was able to find and exactly what I was looking for. Good to have a surplus of these around the garage",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Odom",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "do their job and are a pretty good price",
      "text": "do their job and are a pretty good price. cheaper than they are in stores for me but it doesn't hurt to check first.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael G",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Five Stars",
      "text": "Great price for these and seem very sturdy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine L. Bell",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Durable and Strong - certainly can't beat the price. ...",
      "text": "Durable and Strong - certainly can't beat the price. I ordered these in order to install shelves in garage and they worked perfectly. I wish I would have known about these before I drove all over town looking for them which of course I couldnt find anywhere anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Gab",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Great value and works as intended in our garage for ...",
      "text": "Much cheaper than buying them at Home Depot! Great value and works as intended in our garage for tote shelving.",
      "rating": 5.0,
      "verified": true,
      "author": "Lyssette S",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "Strong brackets",
      "text": "Used for shelves, excellent product, nothing fancy just for the basement.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Would buy again!",
      "text": "Great brackets! We put them all over our garage! They are supporting shelves and holding ladders. Tough!",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Nice, Sturdy Brackets",
      "text": "What can I say other than my shelves are still up? Ha ha.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe from Philly",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Good Value",
      "text": "These are every bit as good as the ones at Home depot and 1/2 the price",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "... screw holes could have been slightly bigger but otherwise good product.",
      "text": "The screw holes could have been slightly bigger but otherwise good product.",
      "rating": 4.0,
      "verified": true,
      "author": "LR",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Good deal.",
      "text": "Good quality and price compared to individual brackets sold locally.",
      "rating": 5.0,
      "verified": true,
      "author": "PT",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Works great",
      "text": "Using them in the garage to hold my lumber up a little higher on the wall.",
      "rating": 5.0,
      "verified": true,
      "author": "Erica S.",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Huge disappointment.",
      "text": "Read carefully, this is only ONE SINGLE BRACKET! One $17 bracket! Huge disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "megan",
      "helpful_votes": 3,
      "publication_date": 20170626
    },
    {
      "title": "Great Value",
      "text": "Very good value. About 2.5x cheaper than home depot. Will work great for a bedroom closet.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruzin",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Great!",
      "text": "So much cheaper than the local box store! I built shelves in my garage and these were the perfect solution.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Sturdy shelf brackets that don't cost an arm and a leg",
      "text": "Practical, no-nonsense, sturdy, and not overpriced like so many others.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Great price on a great product with a ton of ...",
      "text": "Great price on a great product with a ton of uses. Easy to install - I've used them for hanging shelves in the garage. It was a breeze and they're very sturdy! Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "SM",
      "helpful_votes": 0,
      "publication_date": 20160525
    },
    {
      "title": "size matters",
      "text": "These are 8x6 inches. Not what is advertised. Still a good deal if that makes you happy",
      "rating": 1.0,
      "verified": true,
      "author": "harry ojo",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "These are very easy to hang",
      "text": "These are very easy to hang. Get a shelf hung in just a couple minutes. They are strong and hold a lot of weight!",
      "rating": 5.0,
      "verified": true,
      "author": "Andy D.",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "Five Stars",
      "text": "these brackets are great, gets the job done, cant complain.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "Money well spent",
      "text": "Very sturdy and a good a value as I have found recently....would not hesitate to buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Fearnofishbob",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "Great shelf support",
      "text": "They are brackets, they do what they are supposed to do. I'm giving 5 stars because they are nicely finished and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "SpringfieldBlue",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Four Stars",
      "text": "Good product. Easy to install. Great for adding shelves most anywhere.",
      "rating": 4.0,
      "verified": true,
      "author": "Anthony Bottorff",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Not very appealing to the eyes but they are functional ...",
      "text": "Not very appealing to the eyes but they are functional and cheap so that's a win in my book.",
      "rating": 4.0,
      "verified": true,
      "author": "MichiokoXIII",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Solid Bracket",
      "text": "Standard all purpose shelf bracket...others come and go but this one is the work horse of brackets; it just get the job done!",
      "rating": 5.0,
      "verified": true,
      "author": "Alma H.",
      "helpful_votes": 0,
      "publication_date": 20161118
    },
    {
      "title": "65 lb. rating ???",
      "text": "Not bad. I am not sure about the 65 lb. Rating though ????",
      "rating": 3.0,
      "verified": true,
      "author": "Vlukas",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Great brackets",
      "text": "As expected - product was very sturdy for the price too",
      "rating": 5.0,
      "verified": true,
      "author": "RYAN K.",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "Three Stars",
      "text": "The distance between the mounting holes exceeds 1.5 inches. Thus the outside screws must be angled in.",
      "rating": 3.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 2,
      "publication_date": 20160421
    },
    {
      "title": "Great price and product",
      "text": "Great price and product. These brackets met my expectation, and cost less than it would've taken me in gas to go get them at the nearest hardware or chain store.",
      "rating": 5.0,
      "verified": true,
      "author": "Keane Schwarz",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "... anything you'll find in a store and just as sturdy. Will be buying more when I need more ...",
      "text": "Way cheaper than anything you'll find in a store and just as sturdy. Will be buying more when I need more shelves.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin B.",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "Five Stars",
      "text": "Was everything I expected and everything I wanted in a bracket.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Garrett",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Adequate",
      "text": "Brackets are adequate for my needs, but are not heavy duty. For their size the metal could be a heavier gauge.",
      "rating": 3.0,
      "verified": true,
      "author": "deezer47",
      "helpful_votes": 4,
      "publication_date": 20131130
    },
    {
      "title": "I needed the exact amount that came in this set and I can not be happier with their performance and price",
      "text": "If you've ever needed several of these you may have realized that they are extremely expensive in a retail environment. I needed the exact amount that came in this set and I can not be happier with their performance and price. Plus you can paint them any color you like! I used them to hang shelves in my workshop and they are holding up just perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Reed Photography",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Five Stars",
      "text": "fast shipping and product is sturdy and easy to install",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "One I had to cut in two at the bend and then used them as mending plates which worked out fine. These are not the wimpy little t",
      "text": "I bought two different packages of these brackets. A couple of them were dinged up a little but I just laid them out on the anvil and with very little beating they straighten right out. One I had to cut in two at the bend and then used them as mending plates which worked out fine. These are not the wimpy little things you might expect at an outlet store but rather are hefty and solid steel. I am very satisfied with these purchases as they are truly a good product and are as advertised. Would sure buy more if needed.",
      "rating": 4.0,
      "verified": true,
      "author": "joe davis",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Four Stars",
      "text": "The brackets did the trick for the shelves we put up. They are strong.",
      "rating": 4.0,
      "verified": true,
      "author": "Rae Nell Janik",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "A great deal! Easily would cost at least double - ...",
      "text": "A great deal! Easily would cost at least double - even at a big box retailer like Home Depot. Easy to install and strong enough to hold reasonable weights. Great value for the money and my garage looks SO much better now.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas E Keller",
      "helpful_votes": 2,
      "publication_date": 20161025
    }
  ],
  "product_meta": {
    "title": "Ultra Hardware 96121 Shelf Brackets Grey, Pack Of 20",
    "description": "Item Package Quantity:20Make the most of any space with decorative organization. Shelving is essential for your books, potted plants, and all kinds of home items. Create a balanced and beautiful environment in your home by installing simple shelves. Each bracket comes with pre-drilled installation holes to guide you through the process. Just pick your shelf size and position, level it out, and screw into the desired place. They can be installed in almost any place on any level for a range of options. Ultra Hardware’s product lines offer a full rand of colors and sizes to accommodate every project and part of your home. Ultra Hardware gives every homeowner an option for that all-important finishing touch to complete a room makeover or renovation. Ultra Hardware offers quality products for builder’s hardware and cabinet hardware. Ultra Hardware products span 14 categories including Storm & Screen Door Hardware, Door Security, Builder’s Hardware, Gate & Garage Hardware, Home Hardware, Wire Goods and more. Package contains (1) Ultra Hardware Enamel Steel Shelving Bracket - Pack of 20. Limited warranty – 25 years. Steel construction with durable enamel finish. Heavy gauge 0.0354. Each bracket has pre-drilled installation holes.",
    "rating": 4.7,
    "feature_bullets": [
      "ESSENTIAL ORGANIZATION: Make the most of any space with decorative organization. Shelving is essential for your books, potted plants, and all kinds of home items. Create a balanced and beautiful environment in your home by installing simple shelves",
      "EASY INSTALLATION: Each bracket comes with pre-drilled installation holes to guide you through the process. Just pick your shelf size and position, level it out, and screw into the desired place. They can be installed in almost any place on any level for a range of options",
      "TONS OF VARIETY: Ultra Hardware’s product lines offer a full rand of colors and sizes to accommodate every project and part of your home. Ultra Hardware gives every homeowner an option for that all-important finishing touch to complete a room makeover or renovation",
      "TRUSTED BRAND: Ultra Hardware offers quality products for builder’s hardware and cabinet hardware. Ultra Hardware products span 14 categories including Storm & Screen Door Hardware, Door Security, Builder’s Hardware, Gate & Garage Hardware, Home Hardware, Wire Goods and more",
      "PRODUCT SPECIFICATIONS: Package contains (1) Ultra Hardware Enamel Steel Shelving Bracket - Pack of 20 (Grey, 10\" x 12\"). Limited warranty – 25 years. Steel construction with durable enamel finish. Heavy gauge 0.0354. Each bracket has pre-drilled installation holes"
    ],
    "specifications": {
      "Manufacturer": "Howard Berger Company, Inc",
      "Part Number": "10749694961118",
      "Item Weight": "6.04 pounds",
      "Product Dimensions": "11.75 x 9.75 x 2 inches",
      "Item model number": "96111",
      "Is Discontinued By Manufacturer": "No",
      "Size": "10\"x12\"",
      "Color": "Gray",
      "Finish": "Grey Enamel finish",
      "Material": "Metal",
      "Item Package Quantity": "20",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B009PXR628",
      "Customer Reviews": "4.7 out of 5 stars384 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#21,954 in Tools & Home Improvement",
      "Date First Available": "November 14, 2011"
    },
    "categories": [
      "Tools & Home Improvement",
      "Hardware",
      "Brackets",
      "Shelf Brackets & Supports"
    ],
    "price": 26.99
  }
}