{
  "website_summaries": [
    {
      "verdict": "The best general golf cart battery charger that is compatible with most 36V batteries.",
      "pros": [
        "Clear controls and labels make it easy to use the charger correctly without overcharging the battery",
        "Cord connects to virtually any golf cart battery without issue",
        "Relay provides energy savings"
      ],
      "cons": [
        "Heavier compared to standard golf cart chargers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "has a very good start up !",
      "text": "I have had problems over the years with my different golf carts/cars with charging. the charger that this one is replacing was the factory unit for E Z Go. the charger had problems getting connected so I replaced the head of cable and the receiver on the cart. still the same problem. so I got this charger and right off it connected and went to work! a VERY good design and only thing I would like would be a digital read on the unit!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Harris",
      "helpful_votes": 6,
      "publication_date": 20181017
    },
    {
      "title": "I revise my review again!!",
      "text": "I charged my golf cart once. The next time I plugged into cart none of the lights on the front of the charger came on. A call to technical support said that person was not available... Ok, Finally got golf cart to shop installed new batteries and controller. Cart running fine. Test drove once at shop and again after returning home. Plugged cart in for a full charge overnight ( the second time charger has ever been used) and cart will not run the next morning!!!! Taking the charger so it can be tested.",
      "rating": 1.0,
      "verified": true,
      "author": "Claudia A. Horne",
      "helpful_votes": 8,
      "publication_date": 20181213
    },
    {
      "title": "Poor customer service from warranty department",
      "text": "I always liked the review after I had it for a while. Quit working after 6 months... Took many calls. From warranty department, finally sending me a new motherboard. I hope that last longer than 6 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 4,
      "publication_date": 20190713
    },
    {
      "title": "Works better than the original equipment.",
      "text": "I have a 36 volt golf cart. I use it to ride mostly the trap circuit. I had let it lingering for 5 years due to dead batteries. Finally got around to fixing it. Then i found out that the E-Z-Go Charger that came with my cart had died, wouldn't work. So I decided to get a charger that had better features like automatic shutoff and trickle charge. I settled on htis one and was basically the same price as a replacement Original Equipment. It came already set for th battery configuration. Had easy to read instructions. Works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Fernando",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Great Customer Service Lady",
      "text": "Built well, works well. Very heavy, but so was the original. Great Customer Service Lady! Very helpful.",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy",
      "helpful_votes": 8,
      "publication_date": 20171027
    },
    {
      "title": "Love it",
      "text": "I have struggled for three years with two different chargers. I had to be careful and forget it was on and the lead wire would get so hot you couldn’t touch it Now I plug and go. This is the first time we could go around the block, country block My wife is ecstatic wit this new charger as I am. This is the first time that my new batteries have had a deep charge Didn’t have to change settings",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Douglas",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Replace defictive charger,will not work",
      "text": "this charger has never worked . I have replaced batteries and done everything i know to do. the amp meter. has never worked. I charged batteries with another charger and it ran good. when i finished riding it i plug the new charger inand when i go back a month or two it is dead.I need a new charger that will work",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20181202
    },
    {
      "title": "Great while it lasted",
      "text": "I had this charger for two years and then it died. To get it warranted I have to ship it back of course and being that its 30 lbs. its not cheap. So buyer beware; it's suppose to have a three year warranty and I guss does if you want to spend a ton on postage.",
      "rating": 2.0,
      "verified": true,
      "author": "DFM325",
      "helpful_votes": 3,
      "publication_date": 20181114
    },
    {
      "title": "The charger cable.",
      "text": "when I drug my mouse across the charger it showed crows foot for the plug in. I called my wife to look at the crow foot she said BUY IT and I did. Then I had to take it to Golfcrest Unlimited (321-268-4882 and paid $96.55 before I could use the charger.. George R. Powell 96. No golf any more just ride around in the neighbood.",
      "rating": 1.0,
      "verified": true,
      "author": "M.A. Powell",
      "helpful_votes": 2,
      "publication_date": 20190829
    },
    {
      "title": "plug in connectors came slightly bent.",
      "text": "The plug in connectors were slightly bent in the receptacle such that it wouldn't plug in to the cart. After figuring this out, they were easy to align in the center with the help of a screw driver. I have Duracell batteries(a very common type) and of the 4 modes listed to charge, Duracell was not mentioned. The charger did charge up the batteries well however.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170513
    },
    {
      "title": "Yes, it works great",
      "text": "We weren't sure if our charger was bad (How do you really know?) but after using this charger for a day our cart runs great again.",
      "rating": 5.0,
      "verified": true,
      "author": "Busy Mom",
      "helpful_votes": 5,
      "publication_date": 20170409
    },
    {
      "title": "Not working",
      "text": "I only picked 1 star because I had to , I need to send this item back. Not working.",
      "rating": 1.0,
      "verified": true,
      "author": "Joanne DeFrisco",
      "helpful_votes": 4,
      "publication_date": 20180828
    },
    {
      "title": "One Star",
      "text": "DO NOT BUY THIS CAHRGER Received item yesterday plug it in today and it doesn’t work I should have looked at all the reviews on this charger before purchasing. plenty of other more reliable chargers for same price or less out there",
      "rating": 1.0,
      "verified": true,
      "author": "Josh",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "MADE IN AMERICA",
      "text": "I have a 99 EzGo TXT. Charger is very fast. Maintains batteries after full charge. Works as advertised with a three year warranty. American Made.",
      "rating": 5.0,
      "verified": true,
      "author": "Trey",
      "helpful_votes": 8,
      "publication_date": 20170320
    },
    {
      "title": "HORRIBLE!",
      "text": "This battery charger did not work well. I took my cart to the shop and they said that the battery is no good. SO UPSET that I wasted that much money on something that doesn't even work!!!",
      "rating": 1.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 4,
      "publication_date": 20180927
    },
    {
      "title": "Buyer beware",
      "text": "Purchased this product in January, installed in February. Charger stopped working June 15th. Because 90 days had passed CAR Partners not allowed to warranty. Went to manufacturer, after several phone calls they requested I return at MY COST ($95) and they would inspect. After much deliberation they offered to replace with a USED charger. As of today I have not received my USED charger. Buyer beware $290 later, 5 months and no battery charger.",
      "rating": 2.0,
      "verified": true,
      "author": "K Hopkins",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Didn't work",
      "text": "Very displeased, charger we ouldnt work fro. The mo.ent the box was opened .then the price jumped another 100 dollars for another one. There should have been a replacement option.",
      "rating": 1.0,
      "verified": true,
      "author": "paul w beke",
      "helpful_votes": 3,
      "publication_date": 20190312
    },
    {
      "title": "Does not power up",
      "text": "Does not work and nobody is answering the phone in Tennessee cause it’s after 4pm. Pay the extra $125 and get the good charger.",
      "rating": 1.0,
      "verified": true,
      "author": "Jacob Rollo",
      "helpful_votes": 3,
      "publication_date": 20190222
    },
    {
      "title": "Excellent",
      "text": "This charger is excellent. It test the batteries before it starts charging to determine that they are can be charged. Charges completely and quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "C. One",
      "helpful_votes": 14,
      "publication_date": 20130625
    },
    {
      "title": "Highly recommend",
      "text": "Replaced my old powerwise charger. Should’ve done it before it went out. I spent a thousand dollars on the blue top American Battery 6v. This charger, chargers them right. I was getting a lot of gassing with the old charger.",
      "rating": 5.0,
      "verified": true,
      "author": "stanley colley jr",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "The plastic is very fragile and breaks easily. It broke right after it was connected and ...",
      "text": "Connector on front broke. The connection is made with plastic twist lock. The plastic is very fragile and breaks easily. It broke right after it was connected and it was nudged from the side when positioning the charger in my garage. I have a call in to see what can be done. It still works but the connection can come loose.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Collingwood",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Plug and Play",
      "text": "Plug and play...worked on our 36 volt Club Car using the charger's factory settings. FYI, we have Duracell batteries in our cart. The charger is made in the USA and looks to be made from quality parts. I'd buy another one. Hope this helps. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Heavy. Arrived damaged.",
      "text": "This arrived damaged. I had to rig it together. Seems to be doing OK but I would have rather it come complete with all of the parts and not be defective.",
      "rating": 3.0,
      "verified": true,
      "author": "kim s",
      "helpful_votes": 2,
      "publication_date": 20180307
    },
    {
      "title": "Stopped working 1 month after purchase",
      "text": "Was great till it stopped working only a month later!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jessica Neskey",
      "helpful_votes": 4,
      "publication_date": 20180828
    },
    {
      "title": "The product is junk.",
      "text": "Purchased unit. It went bad within 30 days. Seller replaced unit. Unti went bad within 30 days. I highly suggest you deo not purchase this unit",
      "rating": 1.0,
      "verified": true,
      "author": "Dissatisfied User",
      "helpful_votes": 3,
      "publication_date": 20191009
    },
    {
      "title": "Waste of Money",
      "text": "I purchased this item roughly 9 months ago and it has already quit working. After spending almost $300 on what I thought was a quality item, I am very dissatisfied. I would advise you not to waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "JennG",
      "helpful_votes": 4,
      "publication_date": 20180528
    },
    {
      "title": "But service was outstanding and shipped very timely.",
      "text": "Unfortunately this product will not work I will have to return it. The plug doesn’t fit the plug on my golf cart",
      "rating": 1.0,
      "verified": true,
      "author": "DH",
      "helpful_votes": 3,
      "publication_date": 20190718
    },
    {
      "title": "Charger Cord",
      "text": "Works as it should. Only issue with mine is where the charger cord plugs into the charger there is a threaded connection that will not actually thread on. Basically if you were to walk by and hit it the cord would pull out.",
      "rating": 3.0,
      "verified": true,
      "author": "Park Harris",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Junk",
      "text": "Bought this charger in March and it died at the end of July",
      "rating": 1.0,
      "verified": true,
      "author": "Ilance Herzog",
      "helpful_votes": 4,
      "publication_date": 20180906
    },
    {
      "title": "Do not recommend this battery charger",
      "text": "Never used the battery charger much for the golf cart. maybe once or twice a month. All of a sudden it just quit working. If I used it everyday, I could maybe understand, but I did not use it much at all. Maybe 12 - 15 times total. There is only a 30 day warranty. I would recommend to purchase a different brand charger.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra Morgan Harrop",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "This charger does a great job, time will tell about longevity!",
      "text": "The charger completely charges the battery bank and maintains the charge at all times without overcharging. My cart seems to have more pep. The old charger must havevbeen going bad for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Just charger",
      "text": "Actual in use very slow can not give full charge",
      "rating": 3.0,
      "verified": true,
      "author": "Monair K.",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Overall just ok",
      "text": "Works perfectly but The feet were broke off the bottom during shipping. Need to figure out how to get the plastic retainers replaced. No damaged in outside box or inside box just cheap plastic retainer is holding feet on.",
      "rating": 4.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Dont buy!",
      "text": "Already quit working and ive only had it a few months.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180718
    },
    {
      "title": "small but works as good as any other",
      "text": "Takes a lot longer to charge batteries than I expected.",
      "rating": 3.0,
      "verified": true,
      "author": "patricia king",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "product worked only for 6 months,",
      "text": "product worked only for 6 months, when i asked for a return golf kart king approved the return without shipping",
      "rating": 1.0,
      "verified": true,
      "author": "Jose Camacho",
      "helpful_votes": 4,
      "publication_date": 20180721
    },
    {
      "title": "What you say!",
      "text": "Best value for money works have to make sure your battery's are at the level needed before it kicks in. If you are charging from a completely dead or run down you need to break up the banks and charge with an auto charger first then it is awesome. Half the cost of the ORM",
      "rating": 5.0,
      "verified": true,
      "author": "Starfixer",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Excellent heavy duty charger",
      "text": "I've only used the charger for a week but it is working perfectly. It is heavy to lift but that is a part of its quality, Use of the charger is easy and it works exactly as promised. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Documentation contradicts itself",
      "text": "Beware of error in online manual, as settings are critical. Online manual numbers the 5 switches as 1-5 from top to bottom. Single-page insert with unit says the opposite - that #5 switch is at the top and #1 at bottom. Insert is correct; manual is wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "Halifax B.",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Brings my batteries up to 100% charge. Old charger ...",
      "text": "Brings my batteries up to 100% charge. Old charger was only getting to about 97% capacity. Seems well made. I wish there was a way to put a lock on this thing. These seem to walk away on their own when nobody is looking and I don't think a lock thru the handle would slow this down very much.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Lake",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "Heavy...well constructed.",
      "text": "A. Bit complicated to figure out what settings to use....different batteries have their own settings...but seems to be working well.",
      "rating": 5.0,
      "verified": true,
      "author": "DJeep",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Great product",
      "text": "Have had for a year now still working flawlessly definitely worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "dave king",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "This works well with my ezgo golf cart. Just ...",
      "text": "This works well with my ezgo golf cart. Just be sure to plug in directly to outlet. First tried with a 6 outlet adapter plugin and charger didn't work. After several times of trying to get it to work, finally found out it didn't work with the adapter.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "DPI did not support the warranty as claimed but refund now complete.",
      "text": "I ordered 2 units; 1 was ok but not the other. Claim to have 2 year warranty but after so much frustration with DPI Mfg Amazon assisted with return and $57.79 restock fee. So it cost me to return the charger that was not working. CAR that sold us the DPI charger saw our posting, called us to apologies and refunded the stocking fee. Thank you CAR.",
      "rating": 2.0,
      "verified": true,
      "author": "Phil B.",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Spend the extra money and save yourself some grief",
      "text": "Excellent charger, briefly tried one of the less expensive ones only to be disappointed by cord length and build quality.",
      "rating": 5.0,
      "verified": true,
      "author": "JAD",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "I love my charger",
      "text": "I love my charger, it won't overcharge and fits my Golf cart, I don't use it for the ordinary use of one. I take my doggie for her walks, I can't walk far enough so she walks and I ride' Haha;",
      "rating": 5.0,
      "verified": true,
      "author": "Ann M Hall",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Product only worked for 5 months.",
      "text": "This product worked fine for 5 months then NOTHING... it will click 3 times and go off. NOT worth the $$ spent. VERY disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "J. R. Snider",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Made in merrica!",
      "text": "So far, so good! We’ve had two of these running for several months now, with no problem. Would buy again. We have four golf carts, so eventually will happen!",
      "rating": 5.0,
      "verified": true,
      "author": "yogabera",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Great product",
      "text": "This charger works flawlessly for me. Replacing the old charger that would not shut off with the timer and overcharged the batteries. This unit once I found the proper plug to order, has been fantastic!",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "I receive item but the retainer lock ring that holds ...",
      "text": "I receive item but the retainer lock ring that holds The output cable receptical was broken making it very difficult to attach the out put cable. I need the threaded receptical retainer nut replacement so the receptical will remain locked in place. If a further description is needed please contact me",
      "rating": 3.0,
      "verified": true,
      "author": "steve p schiwietz",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Good unit for the money",
      "text": "Good product Have to wait till fall to comment on Maintence feature",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Bielaczyc",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "I like it!",
      "text": "Very good product. I like it. Better than original equipment. Seems to also be saving energy as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaz",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "They contacted me the next day and were amazing and throughout",
      "text": "Didn’t understand the user guide, called amazon and because it was a third company they had to contact me. They contacted me the next day and were amazing and throughout. If I had to buy another one I would but since the one I bought works I am good to go. Get it, you won’t regret it. Be blessed!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Worth the price",
      "text": "As soon as I received the charger, I plugged it in to my almost dead EZ Go cart. It immediately began charging and by the next morning, the charger showed fully charged and the charging rate had dropped to maintenance level. So far, well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Glenn Smith",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "I WOULD BUY IT AGAIN , IF I NEED ONE....HOPE THIS ONE LAST AWHILE",
      "text": "I LIKE THE WAY IT CHARGED THE GOLF CART BATTERIES TO A FULL CHARGE OVERNIGHT , WITH EASY TO READ LIGHTS AND METER TO LET YOU KNOW WHATS GOING ON WITH THE CHARGER AND THE BATTERIES...A LITTLE PRICEY & REAL HEAVY",
      "rating": 5.0,
      "verified": true,
      "author": "martin e summey",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Best charger on the market.",
      "text": "Great charger. Manufacturer recognizes there are differences in batteries and provides ability to set charger accordingly. Why would you pay more for a charger that does less? This is the only charger to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Poppy",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "DO NOT BUY !! JUNK !! No customer Service!",
      "text": "DO NOT BUY !! TOTAL CRAP ! Broke in less then 90 days will not return my emails!! Waste of money! No customer service . JUNK! DO NOT BUY !! Local dealer said not fixable. Company will not reply to me. CRAP !!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great support.",
      "text": "Good charger. Customer service was unbeatable. Had a little issue upon arrival. Called seller and it was taken care of quickly enough that it wasn't even a problem. Buy with confidence.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "1 Year and Still Works Great",
      "text": "Been using for a year, no issues, charges much faster than my old charger",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "It is smaller than my original charger and has worked ...",
      "text": "It is smaller than my original charger and has worked perfectly so for on two golf carts. Both 36V, 1 with 6 x 6 volt Trojan batteries and the other with 3 x 12V RV/Marine batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "David Lewis",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Five Stars",
      "text": "works great..... I've been using this charger for about a year now. I would highly recommend this charger to anyone who has a golf cart. It has worked great from day one :)",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "very good unit, replaced my original EZGO charger",
      "text": "Charger works great, I would recommend it and it is less expensive than most EZGO charger replacements",
      "rating": 5.0,
      "verified": true,
      "author": "RLJ",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Five Stars",
      "text": "Works great. Not sure about the programming part , just plugged it in and it worked !",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonMike",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "Nice charger",
      "text": "Needed a new charger for my golf cart after the stock one finally died. So far i am pleased with this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph N.",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "USA Made.",
      "text": "Works well and the price was good. Like all the extra lights to show how it is functioning. Makes it easier to monitor. Love that it is made in the USA.",
      "rating": 5.0,
      "verified": true,
      "author": "Joanne Olson",
      "helpful_votes": 8,
      "publication_date": 20131117
    },
    {
      "title": "Five Stars",
      "text": "this is a great trust worthy company!!!! The charger works perfect. No issues",
      "rating": 5.0,
      "verified": true,
      "author": "Dearing",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Has worked fine for the few weeks I've had",
      "text": "My old charger went out, I thought. Plugged the new charger in and it went to work immediately so the old one was not working. Has worked fine for the few weeks I've had. It is much quieter than the replaced charger. I'm happy.",
      "rating": 4.0,
      "verified": true,
      "author": "Doyle",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Warranty came in handy",
      "text": "Bought in Sept 2016 from seller Car Partners LLC based on manufacturer Diversified Power International's 3 year warranty. Charger has stopped working and manufacturer took about a week and two emails to respond but issued a replacement charger.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff Ratliff",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Right application for right purpose",
      "text": "Perfect product for the right application. Works like it should. Very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Eldridge",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Excellent Charger!",
      "text": "As an alternative to the 'other' charger everyone uses, this is really nicely built and is just humming along. I am VERY pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Schleis",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Quality charger for the price",
      "text": "Works perfectly on my ezgo golf cart with the d shaped plug. Packed well, and arrived quickly. Very good quality, and I like the lights on the front that tells you exactly what's going on. Highly recommend this charger, I usually plug mine in overnight, and in the morning it has s full charge, fully automatic feature is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "Quality!!",
      "text": "Heavy duty and works great! Don't buy the $100 junk ones on eBay. They can actually hurt your batteries. My first $100 one burned up. My second $100 one was waaaay overcharging the batteries. Not worth the risk with an $800 battery bank. I tossed that and bought this one. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "charlie",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Quick delivery & exactly what I needed",
      "text": "Got the charger quickly. Looks brand new. Excited to use equipment",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Reese",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Good",
      "text": "Very good charger. It’s a little bulky but otherwise no complaints",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Battery charger",
      "text": "I bought this for my mom and it is PERFECT",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Works well",
      "text": "Works well for the price. Not as fast a charge as my last charger.",
      "rating": 3.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Works great but the twist connect collar on the cord broke ...",
      "text": "Works great but the twist connect collar on the cord broke pretty quickly. Now because of that it doesn’t get a good connection and results in inconsistent charge time.",
      "rating": 3.0,
      "verified": true,
      "author": "ARMThree",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "HEAVY DUTY",
      "text": "This charger was well built heavy duty construction.This charger fit my golf cart just as said electrical connections(PLUG) to my cart was the same its still working very well.",
      "rating": 5.0,
      "verified": true,
      "author": "buster",
      "helpful_votes": 4,
      "publication_date": 20130904
    },
    {
      "title": "Would order again",
      "text": "still working great. We've had it for 2 seasons now.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20161012
    },
    {
      "title": "very good chargers I use a lot of DPI chargers to ...",
      "text": "very good chargers I use a lot of DPI chargers to replace factory chargers that have bad transformers or carts I buy without chargers",
      "rating": 5.0,
      "verified": true,
      "author": "mark",
      "helpful_votes": 0,
      "publication_date": 20140826
    },
    {
      "title": "Excellent product. Works well",
      "text": "Excellent product. Works well. Well packaged and shipped. Saved about $125 under what a local dealer wanted for a comparable charger.",
      "rating": 5.0,
      "verified": true,
      "author": "Oldiebutgoodie",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "EZGO battery charger",
      "text": "This works great charging my old golf cart and it was reasonably priced. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret A Unger",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Works Great!",
      "text": "Works great! It brought life back to our carts batteries that we thought were surely destined to be replaced!",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Good chargee",
      "text": "Good charger. Replaced the original that came with the golf cart and I actually think it works better. It has an automatic shut off which is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Melvin",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Has worked great ever since",
      "text": "Purchased this battery 12/2016. Has worked great ever since. Have plug it in 24/7 since then and it continues to outperform. Would recommend this charger any time.",
      "rating": 5.0,
      "verified": true,
      "author": "The Coopster",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Read all the instructions.",
      "text": "This charger is lighter than the last one we had. Works great. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory B.",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Good value.",
      "text": "It's a charger. It works. What more can I saw. This thing is quieter than my old charger which died in a flood. And the little meter is amusing, if not entirely useful for an experienced user.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Highly recommend",
      "text": "Works flawlessly and keeps my golf cart always ready. I particularly like that you can keep it connected all the time without worry. Connector plug exactly like the ezgo charger which is much more expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Bateman",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Exceptional customer service",
      "text": "First I want to say that the customer service is exceptional....bar none. The charger works well. I thought that it should have charged faster but it adjust the charging rate to maximize the charge cycle.",
      "rating": 5.0,
      "verified": true,
      "author": "David K",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Perfect! I wouldn't expect to find this on Amazon",
      "text": "Perfect! I wouldn't expect to find this on Amazon, but with free shipping with Prime, it was really worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170803
    },
    {
      "title": "Works Great!! Don't waste your time with the cheaper ones!",
      "text": "I Finally found a charger that works !! I tried the cheaper ones but they did not charge my golf This one works great !!",
      "rating": 5.0,
      "verified": true,
      "author": "Alisa Hoskins",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Great charger, much better that OEM charger",
      "text": "Great charger, much better that OEM charger. This charger solved a continuing problem I have had for a year, it maintains your batteries thru extended sitting and seems to be great.",
      "rating": 5.0,
      "verified": true,
      "author": "stoneman",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Plug and Play",
      "text": "Replaced my Power Wise... delivered, opened, plugged in and charging!!! Delivered on a Sunday, a day early....BONUS!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "Great charger!",
      "text": "Wow! Love this charger! I work on a golf course and it's great with our carts!",
      "rating": 5.0,
      "verified": true,
      "author": "Deb",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Error in instruction manual per manufacturer",
      "text": "Be aware there is a written error in the manual. If the light is solid red, it does not mean it’s defective.",
      "rating": 4.0,
      "verified": true,
      "author": "melissa metz",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "36 volt golf cart battery charger",
      "text": "The charger works great and charges all six trojan batteries in no time. The only thing I am not happy with is that when the batteries are finished charging the unit is still on and dose not shut down as I would expect it would. Not sure how it will be when winter comes and manual says it can be left on all winter and it will keep the batteries maintained I just assumed it would shut down when not needed. Overall very happy with the charger!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Adair",
      "helpful_votes": 0,
      "publication_date": 20140611
    },
    {
      "title": "Love this charger",
      "text": "Love this charger, highly recommended. Quiet, easily programs to your type batteries. I've only had charger for 3 months so not sure about reliability but if it's anything like the other qualities of the charger it will last a long time. I have had 2 other cheap chargers that have not lasted more than a year. This one seems like it is built very well, heavy duty.",
      "rating": 5.0,
      "verified": true,
      "author": "William A. Wood",
      "helpful_votes": 0,
      "publication_date": 20140724
    },
    {
      "title": "It's optional.....",
      "text": "Good built charger......but in the comments I reviewed it states that the charger automatically shuts off the ac to the charger when the batteries are fully charged and will turn back on on a preset level. But when I got mine , it does not have this feature.......it's optional according to the manual.",
      "rating": 4.0,
      "verified": true,
      "author": "Grif",
      "helpful_votes": 8,
      "publication_date": 20141225
    },
    {
      "title": "**** MUST BUY !!!! ****",
      "text": "Must Buy! I originally purchased a cheap $100.00 + charger for my 1999 EZGO TXT cart which it did not charge the batteries. Spend the extra money and GET this charger!. I plugged it in and within 12 hours my cart was fully charged from being totally dead. Fast shipping, I ordered it on a Sunday and received it on Weds.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken S",
      "helpful_votes": 7,
      "publication_date": 20150410
    },
    {
      "title": "Seems rally good.",
      "text": "I've had this charger on my cart for about a month. Well constructed. Fairly heavy. Works great. Hard to imagine something this well made giving any trouble.",
      "rating": 5.0,
      "verified": true,
      "author": "UpstateGent",
      "helpful_votes": 0,
      "publication_date": 20140219
    }
  ],
  "product_meta": {
    "title": "36volt 18amp Golf Cart Battery Charger for Ez-go",
    "description": "Specifications: Large Analog meter with 5-L.E.D Display No Spark Charging, Reverse Battery Protection Accusense-Charge Series High-Reliability Economy Series (Generation IV model) Multi Stage Charging Algorithm Pre-Qualification Test Stage tests the condition of the battery and prepares battery with a specialized Test Charge Algorithm to prepare battery pack for fast charge. Up to 18 A Output Fast charge to quickly replenish 80% capacity Cell-Balancing. The Equalization Stage balances battery cells and increases charged capacity to near 100% DPI’s computational algorithm computes the precise amount of Top-Off Charge which brings the battery to 100% state of charge. Automatic A.C. Disconnection / Reconnection after charger has finished charging conserves energy while continuing to monitor and trickle charge battery pack Periodical Auto-Restart, when batteries are left in storage, assures battery pack is ready to go at the start of the season. Patent Pending Selector allows user to charge most every lead-acid battery type 32 Charge modes available via user accessible switch. Large and Small Capacity Battery Flooded, AGM, Sealed Multi-Chemistry UL/CSA Listed CEC Compliant Designed/Made In USA 30lbs (13.5kg), 6.25x6.875x10.25in (159x175x260mm)",
    "rating": 4.3,
    "feature_bullets": [
      "PLASTIC/STEEL",
      "Made in USA",
      "36Vdc, 18Adc Output, 120 Vac 60 Hz Input",
      "Universal IEC Input Connector with A.C. Line ‘Power-Good’ and Disruption Green/Red L.E.D Indicator",
      "Output Connector Type: EZgo 2-Pin 'D' Shaped 36V Connector (Powerwise or TXT)",
      "Comes with Relay for Energy Savings"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.25 x 10.25 x 6.88 inches; 29 Pounds",
      "Item model number": "1-36C018E40-00",
      "Department": "\"\"",
      "Date First Available": "September 24, 2012",
      "Manufacturer": "DPI",
      "ASIN": "B009F11YN2",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Golf",
      "Sports & Fitness",
      "Golf Cart Accessories",
      "Sports & Outdoors"
    ],
    "price": 290.95
  }
}