{
  "website_summaries": [
    {
      "verdict": "Perfect for those who need a solid mattress support system that’s easy to assemble.",
      "pros": [
        "Easy for most to put together and install on bed frame",
        "Good mattress support",
        "Solid construction"
      ],
      "cons": [
        "Difficult to adjust heights of the legs",
        "Some received a package with missing parts"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Slats that can adjust from King to Twin and are made to be placed where you need them to support most.",
      "pros": [
        "Legs adjust to needed height",
        "Can adjust to most bed widths",
        "Adds a lot of extra support to your bed",
        "Easy to install and stays put",
        "Durable",
        "Helps eliminate the creaking of your bed"
      ],
      "cons": [
        "This product is designed for use with wooden frames and may not work well with other types"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It works on metal rail bed frames",
      "text": "This works on a metal rail bed frame, I wasn't sure if this was gonna work for metal bed frames because the description says it won't work for metal frames, I went to my local Home Depot and got some bolts, washers and nuts and it worked perfectly, 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Johnathan T.",
      "helpful_votes": 86,
      "publication_date": 20150412
    },
    {
      "title": "Great for wooden rails!",
      "text": "Great product. My partner and I are 600lbs and they hold up fine. (With lots of movement) For those complaing about the wobbly legs.. you have to use the hex nuts that come in the package. It should be 2 hex nuts on one screw.. the one that comes already on the screw at the foot, and the other one you put on and tighten were the screw and metal leg meet. That makes it sturdy and does NOT wobble. These are for WOODEN rails only!!",
      "rating": 5.0,
      "verified": true,
      "author": "Queen Neshia",
      "helpful_votes": 26,
      "publication_date": 20170301
    },
    {
      "title": "Does the job",
      "text": "I bought this item to help preserve a mattress. I just spent $1000 on a new mattress for my daughter so what is another $65 to make sure it's supported properly. I was disappointed in the paint job on the metal rails. In some areas the paint was missing and bare metal was exposed. I quickly touched it up with black rustoleum paint, and then assembled the bed an hour later. I did not have time to stop and take pictures to post them here. I had to build my daughters bed so she could sleep in it. As a bonus, my daughters bed no longer squeaks with these new rails!",
      "rating": 4.0,
      "verified": true,
      "author": "BELL",
      "helpful_votes": 2,
      "publication_date": 20181216
    },
    {
      "title": "Expect some modifications for metal frames, but it's easy....",
      "text": "I installed it on a metal frame. With a little modification it's not hard. You drill two holes and each side of the metal frame. Add some small bolts with lock washers. Good to go. I was expecting to have to modify it. I don't know why they don't just add some bolts and a metal bit, add instructions for drilling or make it a $5 add on kit for metal frames. It really wasn't that hard and it would up their sales dramatically.",
      "rating": 5.0,
      "verified": true,
      "author": "jachansen",
      "helpful_votes": 2,
      "publication_date": 20171018
    },
    {
      "title": "We are so happy with this product",
      "text": "We are so happy with this product! It was fairly simple to assemble & install (thank you to the reviewer who gave the tidbit that both washers go on each leg ~ directions a bit unclear). Our wobbly wood platform bed is now quiet and sturdy! One side note: if you have wood floors & no area rug, you will probably need the rubber non slip discs to place under the 4 legs to make it extra solid (running out to buy those today)! I would highly recommend this system!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180613
    },
    {
      "title": "Great nights sleep",
      "text": "I broke the legs on my wooden slats one day while moving furniture around, which led to my wooden slats breaking under the pressure of my mattress. I finally got tired of sleeping on my box spring on the floor, inside of my bedframe so I decided to look into these. The assembly wasn't hard at all; all you need is one tool. I didn't drill the ends into my bedframe, but it's been a week and these slats have had no problems supporting my box springs and my king sized mattress. I no longer have to worry about my slats breaking while I'm sleeping. I am pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 2,
      "publication_date": 20180316
    },
    {
      "title": "happy with purchase",
      "text": "Previously had wooden slats the furniture store installed. I've installed this on a queen size frame with box spring and memory foam mattress with wooden bed frame, the support is great I finally feel like the bed isn't going to collapse. 250lb + spouse + sporadic child with bad dreams. Minus 1 star for the finishing on the product being scraped on several pieces. Kept the product because it's hidden so the scrapes would be out of sight out of mind.",
      "rating": 4.0,
      "verified": true,
      "author": "Eman P",
      "helpful_votes": 3,
      "publication_date": 20160925
    },
    {
      "title": "Best used IN PLACE OF existing wooden slats",
      "text": "Updated 12/10/17. Omg. Amazing. Have slept on this about two weeks. Back pain-gone. Mattress bowing in middle-gone. Best money ever spent! 5 stars for the product but -1 because the directions weren’t very clear. I wasn’t sure if I should use these with the existing wooden slats (I decided to remove the wooden slats in the end).",
      "rating": 5.0,
      "verified": true,
      "author": "Lee G",
      "helpful_votes": 4,
      "publication_date": 20171201
    },
    {
      "title": "Highly recommend this product.",
      "text": "Bought 2 sets to use along with the original 3 metal support bars that came with my king size 4 poster bed years ago. Was concerned that the old support slats weren't enough to safely hold my new thick mattress & box springs. These universal supports made all the difference in the world in terms of support, stability and comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie  AZ",
      "helpful_votes": 3,
      "publication_date": 20170515
    },
    {
      "title": "Easy peasy",
      "text": "These are very easy to put together and install. Made a huge difference in the sturdiness of the bed. We have a slat bed and the slats were bowing in the middle and it became a crush hazard: I would roll towards the center toward my husband, and he would almost crush me! No more clinging to the edge of the bed to save myself from the canyon in the middle! They have great adjustable feet for a perfect level and even set up.",
      "rating": 5.0,
      "verified": true,
      "author": "MDH",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Universal Bed Slats Center Support System",
      "text": "Pros: Metallic - solid construction. Good and clean finish. Easy to install. Eliminated all the creaking on a king size bed along with the slight dip. Cons: I hope there is a good reason why the nuts attached to the base (plastic end) are not welded. Recommend: Yes - definitely for larger king size beds. And I don't believe you could go wrong in adding additional support to any bed.",
      "rating": 5.0,
      "verified": true,
      "author": "RM",
      "helpful_votes": 5,
      "publication_date": 20160727
    },
    {
      "title": "My daughter's bed was constantly falling because the slats were ...",
      "text": "My daughter's bed was constantly falling because the slats were slightly to short. Since using this product, the bed has not fallen. It takes a little time to setup, but that is not a huge disadvantage. The biggest disadvantage I see is that it may be a little more difficult to move your bed from place to place in the same room since there are legs on the device. I would recommenced this device to someone who has slats that are not the correct size.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Fritts",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Sleeps like a baby",
      "text": "Fantastic solution. We have a custom queen bed frame with headboard and footer that just could not provide the support for box-frame and mattress without sagging in the middle. By retrofitting the frame with these rails we have the use of our frame again and it is wonderfully supportive. I'm really happy that someone created this as a product as I thought I would have to either stack bricks under the bed OR have some custom supports welded in (bed is iron).",
      "rating": 5.0,
      "verified": true,
      "author": "UCrazyKid",
      "helpful_votes": 2,
      "publication_date": 20170210
    },
    {
      "title": "Still in great condition",
      "text": "Been using these for over a year. They've held up very well. Even with extra curricular activities... YOU KNOW!! KIDS JUMPING ON THE BED ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Trey Lynn",
      "helpful_votes": 2,
      "publication_date": 20191116
    },
    {
      "title": "Not scared to lay down in bed anymore",
      "text": "Our queen bed came with wooden bed slats and a flimsy wooden center support that buckled and warped after just a couple of years (it ran the length of the bed). I bought two of these (2 slats come per package, so I had 4 slats total) and my husband installed them relatively easily. These slats are steel, and they make the mattress and box spring feel much more supported. I can now fall into bed without any of the disconcerting pops and thuds the old wooden slats used to make as they cracked and fell to the ground. Great purchase all around.",
      "rating": 5.0,
      "verified": true,
      "author": "LRVA",
      "helpful_votes": 3,
      "publication_date": 20150701
    },
    {
      "title": "Strong support and worth every penny",
      "text": "These worked perfectly. I have a newer cal king bed with 3 wooden cross bars. One of the slats started sagging and caused creaking. After installing these slats, the bed is rock solid. No more creaking or sagging. Left the wooden slats in too so there is much better support. Using two of the extenders on each side gave me the best support, so I called the seller and requested extra extenders which he had. I always wondered why the original wooden slats dint come with more than one leg. It looks like the manufacturer has put some thought and engineered this to fix a real world problem",
      "rating": 5.0,
      "verified": true,
      "author": "PO Ryan",
      "helpful_votes": 2,
      "publication_date": 20171129
    },
    {
      "title": "Perfect for active couples and other activities!",
      "text": "To say we have broke a few beds in our 25 years together is an understatement! Wife and I are fluffy folks who like to stay active in the bedroom and these made all the difference. Sturdy as can be short of laying a concrete foundation. Easy assembly, just one thing not mentioned is that the adjustable legs should barely touch the floor or you will be to high for the headboard ro stay attached.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Norris",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Other than that once you have it secured to the frame and weight on top of it it will hold up pretty",
      "text": "This product does what it sets out to do but I will warn of the cheapness of the material/construction. The grub screw for holding the 2 horizontal members is a hole drilled in the metal with a nut tack welded on to it in two places and then the screw/bolt goes into that nut and pushes the two bars together. Not an elegant solution as the tack weld will snap clean off if you apply the slightest hint of too much pressure when tightening the bolt. Other than that once you have it secured to the frame and weight on top of it it will hold up pretty well",
      "rating": 3.0,
      "verified": true,
      "author": "Archibald T Thwacker",
      "helpful_votes": 4,
      "publication_date": 20160524
    },
    {
      "title": "doing their job",
      "text": "5 stars for sturdiness 5 stars for stability 4 stars for assembly- since the instructions aren’t the clearest. I’m pretty handy but I can see how other people may find it a little harder to put together. . I put them together myself took about 40-45min total time this includes taking off the wooden slats and back on. (I am using these metal rails as extra support along with our wooden slats)",
      "rating": 5.0,
      "verified": true,
      "author": "LGRiver",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Saved our son's bed frame",
      "text": "Our son has a full size bed that was converted from his crib. The slats on the bed frame didn't work with his mattress so they had to be removed which placed too much pressure on the frame. These were super easy to install and have the mattress supported taking pressure off the bed frame so we don't have to worry about the wood splitting.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather CTop Contributor: Baby",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "It took an evening to install but now the bed is better and safer than new",
      "text": "We purchase a medium/low quality bed to accommodate our king mattress in a small room. Our wooden slats broke within the year and we couldn't really replace them because the hardware was damaged. The furniture store we purchased the bed from would not fix or replace it but instead tried to sell us a similar product as this. It took an evening to install but now the bed is better and safer than new!",
      "rating": 5.0,
      "verified": true,
      "author": "JBuff",
      "helpful_votes": 5,
      "publication_date": 20150623
    },
    {
      "title": "Excellent and super strong.",
      "text": "I used these on a very nice wooden bed that had broken wooden slats after surviving several moves. When the bed would be moved or the cheap wooden leg supports would get moved from vacuuming etc, they would get moved off center and break the next time someone got in bed. No more. I used two sets on a king bed and it worked perfectly. Very strong. Very sturdy. No more issues.",
      "rating": 5.0,
      "verified": true,
      "author": "csaggie",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "Easy Assembly and Installation on Steel Bed Rails",
      "text": "These slats are tubular steel and strong. Assembly was easy with two wrenches and the directions. All dimensions were specified. After installation, some small adjustments were necessary to the height and width. Installation on my steel bed rails required four nuts and bolts. The ends of the slats are pre-drilled and so were the rails. I'm pleased with my purchase and the result.",
      "rating": 5.0,
      "verified": true,
      "author": "MacWil",
      "helpful_votes": 2,
      "publication_date": 20171228
    },
    {
      "title": "Fine for a while then...",
      "text": "...the silver feet simply bent. Clearly the weakest part of the structure. This meant the bed frame, over time, broke too. Ended up replacing the whole lot. I'd recommend at least 3-4 of these under a large mattress to spread the load.",
      "rating": 3.0,
      "verified": true,
      "author": "Cecil Turtlebasher",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Good quality, lots of support",
      "text": "I love these. My husband and I are both big people and when we bought a new bed we just didn't feel the wooden slats provided us enough support. It took me a few tries once I got these out of the box to figure out how to put them together, but once I got the first one right the rest were easy. And now we can rest easy!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Messer",
      "helpful_votes": 6,
      "publication_date": 20141011
    },
    {
      "title": "Its universal as described",
      "text": "don't like the screws, and the insert female screw holes moved when trying to initially trying to remove lower part of leg, this should not have happened, I thought the leg was damaged but suddenly like magic, it stuck in place and I was able to unscrew the lower part of the leg and continue installation of silver leg parts",
      "rating": 4.0,
      "verified": true,
      "author": "nannook58",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Excellent product. It was used for a king size ...",
      "text": "Excellent product. It was used for a king size bed to replace two original wooden slates. Only issue was that the leg extensions were not long enough- but after letting the company know- they mailed out extra extensions. Now the metal slates are perfect and durable. The owner replied back quickly and sent the extensions with priority shipping. Very satisfied with this purchase. I will definelty re-purchase from them if in the future the other wooden slates give out.",
      "rating": 5.0,
      "verified": true,
      "author": "pg_purewal",
      "helpful_votes": 2,
      "publication_date": 20171210
    },
    {
      "title": "Sturdy!",
      "text": "These are extremely sturdy. Loved so much, I bought 2 for a friend as a surprise (I’m a functional gift giver lol). I took a star away because when they were delivered, only 1 set arrived. By the time we figured it out, it was too late to contact the company without seeming sketching. Next time, I’ll be mindful of that.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Marie",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Good product",
      "text": "We have a king metal bed and the factory metal rails were hollow and one of them bent. These are much better quality than the oem rails and very sturdy. They are universal and simple to adjust to any size bed. I do think that they are a little on the expensive side, but worth the expense.",
      "rating": 5.0,
      "verified": true,
      "author": "yrock",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Metal slats without the frame..Finally!!",
      "text": "I didn't know bed slats were so hard to find until I needed one to replace the wooden slats on my daughters bed. The price was the best I could find, and they adjust to fit any size bed. These come two to a box, so you need to determine how many you will need. What you see is what you get. They are adjustable and can be adjusted to fit any bed. You can try to go to several mattress stores, Home Depot, Lowes, etc. like I did; or just order these, wait a few days and be done with it.",
      "rating": 5.0,
      "verified": true,
      "author": "RMichael",
      "helpful_votes": 2,
      "publication_date": 20150608
    },
    {
      "title": "Definitely recommend!",
      "text": "My husband & I recently got a king size wood bed frame with wood slats (previously had a metal frame). First night on the bed we were afraid we would break the slats as together we weigh over 500 lbs. Bed was creaking and sinking severely in the middle. Just installed these bed slats last night and everything was fixed! No sagging or creaking at all. Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy Davidson",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Don't wait one more minute!",
      "text": "These are truly awesome! I am a beginner when it comes to fixing things and home improvement. I ordered these thinking I might have to send them back. You see, I am not a small woman and my boyfriend dwarfs me in size and weight. Needless to say, my pathetic bed, which is new, has paid the price. The slats that are still not cracked are straining at the seams. These slats actually took less than 15 minutes to install from opening the package to screwing in the screws. And the bed is fixed!",
      "rating": 5.0,
      "verified": true,
      "author": "CharmedOne",
      "helpful_votes": 2,
      "publication_date": 20150909
    },
    {
      "title": "Great Product, Easy Assembly, Worth the Investment",
      "text": "This is a great product. I have a king side bed that was wobbly. Before I bought another bed decided to invest in a support kit. I bought two sets for my king size bed & glad I did. Instructions are not too good But it’s very easy to assemble. In my opinion this works best on beds with wooden frames. It took me 30 minutes to install the 4 supports you see in pics. Bed is now very sturdy & stable. It’s worth the investment. Also I have a high bed so the foot extenders worked perfectly! Happy customer, great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Eddieed316",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Great supports",
      "text": "These have worked great on our bed. They are the only ones that haven't caved in or bent under our mattress. We had the manufacturer replace the supports twice before we finally gave up and bought something ourselves. Worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Giordano",
      "helpful_votes": 0,
      "publication_date": 20170810
    },
    {
      "title": "Not meant for metal bed frames.",
      "text": "I purchased these because a used bed frame did not come with cross slats. These shipped fast, and we're easy to install without taking the bed apart. It stated on the package insert that these should not be used with metal frames, but this was not mentioned in the description. Anyway, they installed easily (queen mattress) and the legs easily adjusted to provide enough pressure to keep them in place. They seem very sturdy, and I feel more confident with them.",
      "rating": 4.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 5,
      "publication_date": 20141230
    },
    {
      "title": "Don't waste your time or money.",
      "text": "I'd honestly save your money and buy something else. These arrived at my house on time but as I was trying to assemble it (there's no real instructions) I found that one of the rails would not fit together. I spent 30 minutes trying and finally gave up. After calling the 800 number for help, the receptionist told me no one there knew how to put them together, and that they would call me back. They never did. I'm now stuck with a product that doesn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Courtney A.",
      "helpful_votes": 3,
      "publication_date": 20170921
    },
    {
      "title": "Fast shipping and easy install",
      "text": "Fast shipping and easy install. My bed frame's original three slats became useless after moving my bed around several times and this system is much more stable. I will be buying another kit to double up on the support.",
      "rating": 5.0,
      "verified": true,
      "author": "DVD",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Best money ever spent",
      "text": "Best money ever spent. Wood slats were not installed correctly so they broke one night. Ordered these metal slats, now my bed is stronger than ever! Slept like a baby after easy install. Took about 15 minuets to set up. Insulation was so easy and dummy proof. I’m so happy I purchased these metal slats, wish I would have found them sooner. Definitely worth the money. I recommend them to everyone who has a queen and king bed. Extra security is priceless.",
      "rating": 5.0,
      "verified": true,
      "author": "Callette A. Stephenson",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Does what it says!",
      "text": "Added Great support to my daughters convertible Full Bed. The bed didn't come with center support once we converted to the full size mattress. This helped alot. I can not get on her mattress and not feel like it will break! Was very easy to assemble ( I did it myself!) and my hubby helped me put it on the bed and drill it in.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 3,
      "publication_date": 20160811
    },
    {
      "title": "... these rails to support a queen bed that looks great but isn't well constructed",
      "text": "Used these rails to support a queen bed that looks great but isn't well constructed. Now the bed is sturdy - so the rails did exactly what they were supposed to. They were reasonably easy to install with two people. The adjustable feet are great for getting the rails to really do their job and didn't mark my wood floor. I did pair this solution with another, a bunkie board.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine K",
      "helpful_votes": 2,
      "publication_date": 20160627
    },
    {
      "title": "Much better support, recommended!",
      "text": "Our queen size bed was sagging in the middle and we thought the metal supports that came with the wooden frame (15 yrs old) were the culprit. This product was easy to put together (shout out to Terneshia review -- helpful pictures!) and has solved the problem. Our mattress (not very old) has a new life and we're sleeping much more comfortably. Very glad we didn't buy the product that costs almost 2x as much, this one works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "DELANEYSLEW",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "... on the bed not being as straight as I liked and thought these might help",
      "text": "I was having problems with my footboard on the bed not being as straight as I liked and thought these might help. DIdn't work as well as I had hoped but they were well made and I\"m sure the extra support helps when you're carrying a few extra pounds.",
      "rating": 5.0,
      "verified": true,
      "author": "smg",
      "helpful_votes": 0,
      "publication_date": 20171007
    },
    {
      "title": "My bed is now secure!",
      "text": "Perfect solution. The wood slates and legs that came with my bed required me to repair them about every 6 months. So when we got a new memory foam matress--much heavier than our old one--I wanted something that wouldn't need me to remove the mattress from the bed. This was a great solution, easy to install. Not simple, but not difficult. Instructions weren't all that good, but between the picture, rereading the directions, and looking at the product, it made enough sense. And ultimately, this solved my problem, and solved in much better than what the bed frame came with.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20160502
    },
    {
      "title": "Excellent",
      "text": "I'm laying on my bed as I type. Very sturdy and easy to install. I holds my spilt boxspring and queen sized mattress well.. I was done with wooden slats from The Home Depot and invested in these for the lifetime of my bed..Good Buy!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley C Williams",
      "helpful_votes": 43,
      "publication_date": 20150710
    },
    {
      "title": "Excellent customer service.",
      "text": "As I half expected, they were just 2\" to short for my bed. So I called the customer service number which was answered by a REAL HUMAN BEING! she took my information and said she'd forward to it on. I put my phone down expecting the hear from them tomorrow. Nope. At 7:30pm my phone was ringing with the owner calling me back! Got my information, validated what I needed and confirmed they'll be in the mail TOMORROW. That is rare good ol fashioned American customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Good product",
      "text": "Have had these for several months now and have worked well. They are much better than the original supports I had. Held up a super heavy queen purple2 mattress and 2 adults no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Do not recommend",
      "text": "This didn’t work for me. The bottoms are round and not flat so they didn’t stay in place and scratched my floors.",
      "rating": 1.0,
      "verified": true,
      "author": "Terrilynnhudson",
      "helpful_votes": 2,
      "publication_date": 20180902
    },
    {
      "title": "Great Product and Easy to Install",
      "text": "I have a King size bed that came with individual wooden supports and wooden slats. After 2 years the wooden supports were constantly falling and the slats started bending. We have wood floors with no carpet. I bought two packages of the bed slats for a total of 4 slats. They were very easy to drill into the bed frame and super sturdy. Have had them on for 5 months and no problems at all. Rarely, when getting onto the bed you hear them creak. Would definitely buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Great Support",
      "text": "Ordered 2 sets to support my heavy, 14-inch thick, king size mattress as replacements for buckled supports. Installation onto wood side rail bed was easy and straight forward. Great support - mattress no longer sags in the middle. One set was missing a pair of locking nuts - resolved with a trip to hardware store.",
      "rating": 5.0,
      "verified": true,
      "author": "CC",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Decent for the price",
      "text": "Product is decently built in china. My bed is very heavy and they are holding the weight well. The biggest problem is that the frame will need to be cut down to fit the frame of a king size bed (it will not reach fully across) and the legs will need to be trimmed as well if u have a medium hight frame like mine. It's a decent for the price",
      "rating": 4.0,
      "verified": true,
      "author": "Logan",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Excellent quality, excellent results.",
      "text": "These worked great with my wooden bed frame! They are very solid and come with extra parts for taller beds. I installed them in about 15 minutes, with no issues. Now my bed no longer safe in the middle!! I left the old wood slats that came with the king size bed, and just added the two metal supports. Highly recommended!!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Twilley",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "so sad",
      "text": "i had 2 of the 3 installed. i went to do the final one and the bolt snapped off when I went to tighten it. Very poorly made. I was to far in to give up so I threw the box springs and mattress on top of it. very squeaky. requires duct tape now.",
      "rating": 1.0,
      "verified": true,
      "author": "sbuyer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Great product however will need 2 sets",
      "text": "Used this for a wooden queen bed frame that i bought used and did not have these supports. They were quick and easy to put on and work well. The supports have greatly improved the quality of the matress. Please note that i had ordered 2 sets as there are only 2 in a single set and generally at least 3 supports will be needed for any bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce Miller",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Should have gotten them sooner",
      "text": "These bed slats work better then the ones that came with the frame. These slats are much stronger and give more support. I wish I had purchased them sooner. I had to replace my mattress I had because my old frame slats bowed and didn't give proper support. I only purchased two slats so I'm going to get two more and remove the rest of the old slats. The two I have now alone have greatly improve the support. I have a metal frame system and it works fine with proper screws.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah DeCarolis",
      "helpful_votes": 0,
      "publication_date": 20150814
    },
    {
      "title": "I have a wooden sleigh bed. The bed is ...",
      "text": "I have a wooden sleigh bed. The bed is surrounded by wood. I bought this frame as a requirement for the warranty on the mattress company. These helped with the extra weight on the newer mattresses that are thick.",
      "rating": 5.0,
      "verified": true,
      "author": "Daredevil1970",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Easy and convenient!",
      "text": "Worked perfectly to replace the center post for my Guest bed frame. I didn’t even need the directions, super straight forward and took less than 20 min!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Sturdy Legs",
      "text": "Brought these after worrying the bedframe I brought might collapse because of weak leg support. I was right to because the wooden legs on the bedframe ended up slipping, but these metal legs held up the weight of my mattress and box spring. They're very strong, just be careful installing them on your bedframe, I almost splintered the wood on mine, but that was my fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Only for basic metal bed frame.",
      "text": "Installation was not possible on our bed. Make sure you can use them. Only works for basic metal bed frames.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Works great, just as expected.",
      "text": "Worked exactly as I expected. It comes with screws to use on wood cleats but if you have a metal frame I think you can make it work, just need to drill your metal frame and use bolts with nuts instead of the screw it comes with. I have a wood frame so it worked out great. If you can visualize the final product installed it's very easy to figure out how to assemble and install it. Cheap investment to make sure your mattress has longer life span.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruno Soares",
      "helpful_votes": 0,
      "publication_date": 20150129
    },
    {
      "title": "Not pleased.",
      "text": "One of the tightening screws was welded together. I tried everything to get it unscrewed. I needed this by a certain date because that's when I had somebody coming over to help me. Total bust and I'm still sleeping at an angle with a busted bed. Not pleased.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "I love it because it is very sturdy as it supports ...",
      "text": "I have a king size bed and when I got it i was a bit confused with the directions and I had a small issue but after I spoke with the company, my issue was resolved promptly and they are sending me an extra support as a courtesy. I love it because it is very sturdy as it supports my heavy king size mattress very well. I would recommend anyone who need a good support system for their mattress to get this one.",
      "rating": 5.0,
      "verified": true,
      "author": "AD",
      "helpful_votes": 2,
      "publication_date": 20160820
    },
    {
      "title": "Good product!",
      "text": "I had a bed with old broken wooden slats and these not only lift the mattress but provide extra support. Loved them so much I ordered two more for extra support",
      "rating": 5.0,
      "verified": true,
      "author": "Thekindleismysidekick",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Very sturdy support!",
      "text": "We bought these to put under our mattress in our vintage wrought iron bed. They work perfect for support!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Cox",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "However upon contacting the owner I had the best customer service I have ever acquired",
      "text": "So due to Factory Robotic Issues my first delivery was the wrong size. However upon contacting the owner I had the best customer service I have ever acquired. He was so helpful and fedex me the correct parts, sent me a personal note of apology and even gave me his cellular number to text or call him personally. He was the nicest and sweetest and now I know why they call it Southern Charm!!! My bed slats work amazingly well also.",
      "rating": 5.0,
      "verified": true,
      "author": "Odette Arez Lugo",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "Great purchase!",
      "text": "This is great! Super easy to put together. We have wooden slats on our bed and it just didn’t feel supportive. We had it all set up in no time and our bed frame feels brand new! Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Midori E Harris",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Take",
      "text": "They took longer to install then I expected and I needed my wife's help to line the slats up evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Agent Orange",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Excellent support!",
      "text": "Once these were adjusted properly, they were set to go. I have been enjoying the security of the supported mattress for a couple of months now. Very restful.",
      "rating": 5.0,
      "verified": true,
      "author": "Scorpio",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great",
      "text": "The slats in our bed frame were cheaply made and broke easily. These were a great replacement - we just set them inside the bed frame and you cannot tell the difference. We have moved houses and rooms and these have stood the test of time.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Mariani",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "1 out of the 4 slats I bought would not ...",
      "text": "1 out of the 4 slats I bought would not go together properly and I wish I could get a refund on that set, but I decided to just use the 3 working ones. Works well I guess, but some of the long screws for the feet are bent and cause a bit of squeaking and I also wasn't aware I'd need a wrench which wasn't included. My box spring seems to slip around a bit on top of the slats as well so I've ordered a non-slip grip pad for it.",
      "rating": 3.0,
      "verified": true,
      "author": "wtblife",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Works as advertised, great customer/technical support.",
      "text": "Great customer service! Had some issues with my bed being too high and needed extra leg extensions. Called the number on the instructions and they shipped me everything i needed. Install was simple and now i dont have the sag in the middle of my matress. Highly recommend this product and this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike in Guthrie",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Very sturdy..",
      "text": "Very sturdy... I got 2 sets of 2 to support my california king bed. It holds up quite well. I'd give 5 stars if the assembly instructions were better. We had a mild problem of the legs wobbling but with the weight of the boxspring and mattress it isn't noticeable.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelsea Abner",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Great bed slats - supportive and adaptable!",
      "text": "What a great product! Worked perfectly on 100+ bed - stabilized it, provided excellent support for the mattress. Being able to 'flip' the crossbeams let it fit to older narrow 'indents' on the side rails. Very impressed (so was my mother - that is high praise indeed). Will recommend these to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "AliceS",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Additional bed mattress support system is not easy to find!",
      "text": "This product offered above and beyond what we needed to reinforce under our very heavy king size bed. Especially after movers misplaced the middle support for our expensive wooden frame. The Universal Bed Slats were easy to install an offer more support than we ever needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Sturdy — Well-suited for Support",
      "text": "More stability was suggested for my poster bed: I tried these and “rested assured”. My poster bed has a low profile platform plus a queen-size mattress — sturdy and steady is all that’s left to say. 🙂",
      "rating": 5.0,
      "verified": true,
      "author": "Annie W.",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "I’m pleased....so far",
      "text": "So far so good. I am rarely able to put anything together but I literally did this in seconds and added some extra support for my wood based bed. My mattress delivery has not come yet and then I can comment on the stability of the rails but so far it looks great and supportive. Didn’t utilize the wobbly legs as I found the structure sturdier without the added feet.",
      "rating": 4.0,
      "verified": true,
      "author": "bren",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Easy to install",
      "text": "Was thankful to find this. Daughter jumps on bed and this works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Bought a bed frame and it just didn't seem like it had the support I needed so we bought ...",
      "text": "Does what it says it supposed to do.. Bought a bed frame and it just didn't seem like it had the support I needed so we bought this and it worked out great! Easy to adjust and put to your bed frame!",
      "rating": 5.0,
      "verified": true,
      "author": "Babyytop",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Easy to install and works great!",
      "text": "Bought this to replace two of the wooden supports that had broken on our wooden framed bed. They were easy to install and work great! I will definitely buy another set when I can to replace the last wooden support we have left.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy Simmons",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Cured the creaking!",
      "text": "Looking for something for our king size bed to stop it creaking. Replaced the wooden slats with these and they worked a treat. Bought 2 sets. Definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Exactly what I needed and exactly what it looks like. Assembly was not hard once I looked at ...",
      "text": "Exactly what I needed and exactly what it looks like. Assembly was not hard once I looked at it but from what I remember I think I felt like the actual instructions were not so intuitive/linear. Still 5 stars since just eyeballing it I was able to assemble just fine using common sense.",
      "rating": 5.0,
      "verified": true,
      "author": "Merry",
      "helpful_votes": 0,
      "publication_date": 20161014
    },
    {
      "title": "Better than what came with my bed set!",
      "text": "Great product,easy to assemble, u will need a 10mm socket or wrench to loosen the bolt and to tighten the bolt.I used a impact wrench with a phillips head to screw the bars to the side boards to keep in place",
      "rating": 5.0,
      "verified": true,
      "author": "Maxemilio Cortes",
      "helpful_votes": 2,
      "publication_date": 20150727
    },
    {
      "title": "Slats were perfect for our king bed!",
      "text": "This is exactly what we needed! We have 3 wood slats that are part of our king bed and the middle one broke. We unscrewed it and replaced it with these 2 and they were perfect. Much easier than trying to fit new wood ones and they are sturdier! I would highly recommend these!",
      "rating": 5.0,
      "verified": true,
      "author": "AS",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Looks elsewhere",
      "text": "Instructions are useless. Box spring wobbles on top due to the cleat that holds the rails together. Disappointed in this purchase",
      "rating": 2.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Item do not match picture.",
      "text": "Items came with box open and no instructions, and item do not match picture.",
      "rating": 2.0,
      "verified": true,
      "author": "Vickie Langston",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Works very well",
      "text": "Great product - replaced a broken bed frame on a queen size bed. Adjustable to a range of sizes, so very easy to fit to my wooden bed frame.",
      "rating": 5.0,
      "verified": true,
      "author": "Clint",
      "helpful_votes": 0,
      "publication_date": 20161111
    },
    {
      "title": "No more back pain",
      "text": "The one thing I regret about this product is not buying it years ago. After waking up with back pain for years due to a sagging king size mattress I am finally waking up pain free. Assembly was simple and easy. I did buy two sets just to be sure there was plenty of support.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse Glossinger",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Perfect for what I needed",
      "text": "Perfect for what I needed. I bought these to replace the flimsy single leg supports that came with the bed frame. They work really well and hold up under a lot of movement. Very sturdy for the happy couple.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Terrible experience",
      "text": "Not happy with product. I would return half of it if we could even get the bloody thing apart. One of the legs was improperly machined, making it impossible to screw in a foot. I won’t even touch upon what someone passed on as directions. Company needs to contact me to make this right.",
      "rating": 1.0,
      "verified": true,
      "author": "Christie LMG",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "The existing bed support I kept them and these are great",
      "text": "Well made I got these as additional bed support for a wooden frame bed. This will come out cheaper than buying individual claw bed support which costs $25/ piece. The existing bed support I kept them and these are great re-inforcement",
      "rating": 4.0,
      "verified": true,
      "author": "JMSS",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Easy to Install & Sturdy",
      "text": "The movers lost the support legs for my CA king bed so I ordered these as a replacement. Very easy to install and they hold up well.",
      "rating": 5.0,
      "verified": true,
      "author": "MamaDee",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Otherwise good",
      "text": "This was sent to me with 4 wood screws and 4 large nuts...? So I had to buy nuts/bolts at the adware store to secure the slats to the side rails. Otherwise good product",
      "rating": 4.0,
      "verified": true,
      "author": "GInurse27",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Amazing!",
      "text": "So I bought I very gorgeous looking Slat Queen bed from Wayfair but it came with only 4 Slats and 1 Stability leg, Even my bulldog was sinking when she laid on the bed, let alone a person this did the trick! Cannot recommend it enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Cara Allen",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "works well",
      "text": "It works fine and it came on time it was easy to install following the instructions that were given. it fits fine",
      "rating": 3.0,
      "verified": true,
      "author": "G-man90",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "Unsupported productParts",
      "text": "Parts missing. Could not get order replaced or replacement parts",
      "rating": 1.0,
      "verified": true,
      "author": "Mark Russell",
      "helpful_votes": 2,
      "publication_date": 20191001
    },
    {
      "title": "Works Great! Wish I would have purchased sooner since it ...",
      "text": "Works Great! Wish I would have purchased sooner since it made a big difference in the support of a KING Size bed. This should be mandated for all Queen and King beds!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Badgett",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Worded as a third support on a wooden bed frame.",
      "text": "Really easy to install on queen wood bed frame. Used a hand screwdriver. Using one as a third support.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Hayes",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Good value.",
      "text": "Easy to install. Much cheaper than replacing a frame and easier than a new wooden cross beam.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon M Orth",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "The item was very easy to put together",
      "text": "The item was very easy to put together, and extremely sturdy. I have an Ikea Helmes bed and for some reason the box spring would slip through on one of the sides, since the beam only runs in the center from head to foot. I ended up purchasing these and it has fixed my bed. I definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "gortega76",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Works for us!",
      "text": "Working surprisingly well! I thought the legs were a little wobbly when I installed them but I guess the weight of the mattress plus us holds everything in place. Saved our bed frame!",
      "rating": 4.0,
      "verified": true,
      "author": "Sara B Garro",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Do not purchase for a king size bed",
      "text": "I would not suggest purchasing this product for a king size bed. When the pieces are extended so each end sits on the ledge of a king size bed frame side rails it leaves only about a foot where both pieces are side by side. This isn't enough length to offer sufficient mattress/box spring support.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171021
    }
  ],
  "product_meta": {
    "title": "Universal Bed Slats Center Support System Adjustable Tubular Steel with 4 Legs",
    "description": "Universal Center Support System is a heavy duty adjustable steel bed slats support system that fits between the side rails of your bed. It allows your box springs and mattress to sit on a solid foundation and relieves a lot of the weight that normally is placed on the side rails. These heavy gauge steel bed slats incorporate two adjustable feet on each bed slat giving you a total of four feet supporting your box springs and mattress. Our Universal bed slats support system exceeds the manufacturers warranty criteria. It includes four(4) - 6\" threaded feet, four(4) 4\" center posts and four(4) top \"T\" posts to give you a height adjustable from 7 1/4\" to 16 1/2 inch height.(If you need it to be higher please send a message through Amazon messaging service and I will be glad to send you 4 extra 4\" straight sections at no extra cost.) Each support system comes with all necessary mounting hardware and installation instructions. WARRANTY IS A TEN(10) YEARS MANUFACTURER'S WARRANTY AGAINST DEFECTS FROM DATE OF PURCHASE FOR FULL REPLACEMENT FOR THE ORIGINAL OWNER. NOTE: THIS IS TO CERTIFY THAT ALL PARTS CONTAINED ARE NEW. SHOULD THERE BE ANY DAMAGE TO THE BOX, DAMAGED OR MISSING PARTS AS A RESULT OF SHIPPING PLEASE NOTIFY ME IMMEDIATELY THROUGH AMAZON'S INSTANT EMAIL MESSAGING SERVICE. IT WILL RING STRAIGHT TO ME WITH IN A FEW MOMENTS.",
    "rating": 4.4,
    "feature_bullets": [
      "NEW AND IMPROVED! Fully Adjustable to accommodate a variety of bed frame sizes from a Full, Queen, King and California King",
      "This mattress/box springs support system is designed for use on a wooden bed frame. Installation is easy using the pre-drilled holes in the end of the steel slat.",
      "Height adjustments can range from 7 1/4\" inches to 16 1/2\" inches and features two(2) adjustable legs for each cross support, with two cross supports, for a total of four(4) adjustable legs under your bed.",
      "Made from heavy gauge steel that has been powder coated to eliminate rust. The heavy gauge tubular steel eliminates warping, cracking, splitting and breaking as the wood slats usually will do over time.",
      "This support system incorporates 4 adjustable legs that gives the box springs and mattress the added support for a solid foundation as well as protects the side rails from bowing or bending."
    ],
    "specifications": {
      "Item Weight": "14.12 pounds",
      "Product Dimensions": "49.5 x 3 x 9 inches",
      "Item model number": "GGI150-4TP525",
      "Is Discontinued By Manufacturer": "No",
      "Weight": "15 Pounds",
      "ASIN": "B009QDA1LA",
      "Customer Reviews": "4.4 out of 5 stars438 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#43,956 in Home & Kitchen",
      "Date First Available": "March 13, 2014"
    },
    "categories": [
      "Bed Frames",
      "Furniture",
      "Home & Kitchen",
      "Bedroom Furniture",
      "Beds, Frames & Bases"
    ],
    "price": 73.95
  }
}