{
  "website_summaries": [
    {
      "verdict": "Well-rounded, budget-friendly design that offers 10 speeds with pulse and comes with a lightweight 6-cup jar.",
      "pros": [
        "Powerful 550-watt motor with four-point stainless-steel blade",
        "Lid features measuring marks, and lid insert doubles as a 1-ounce measuring cup",
        "Jar and lid are dishwasher-safe for easy cleaning",
        "Operation is straightforward with clearly marked buttons"
      ],
      "cons": [
        "Occasional product malfunctions have been reported concerning blade rotation and leaking jars"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I totally loved this. Update 4/7/2018 - After using this for ...",
      "text": "A must product for every household. It can be used for grinding spices for making masalas as well as for making smoothies.. I totally loved this. Update 4/7/2018 - After using this for 3 months it crashed and stopped working.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 94,
      "publication_date": 20180615
    },
    {
      "title": "Blender exploded",
      "text": "I purchased this in March and other than it jumping around on the counter while blending, I was fairly happy with it. Until today. I was making a shake with ice cubes that were not too large, when all of a sudden there was chocolate shake all over the place - all over the counter, all over the blender and all over my clothes. There was suddenly a large hole in the blender and pieces of plastic on the counter. I have never had this happen in all my years of using a blender to make shakes. Luckily Amazon is letting me return it (thank you, Amazon). I will never buy another Black+Decker again.",
      "rating": 1.0,
      "verified": true,
      "author": "Laurel S. Druce",
      "helpful_votes": 97,
      "publication_date": 20180308
    },
    {
      "title": "this thing works fine.",
      "text": "As far as blending goes, it gets the job done. My only complaint is that this blender does not have a safety feature. In other words, the mechanism that makes the blades spin will spin even if the container part is not on the base. I nearly got my fingers caught in the spinning mechanism when my toddler pushed the button when I wasn't expecting it. Be careful. Other than that, this thing works fine.",
      "rating": 3.0,
      "verified": true,
      "author": "jon",
      "helpful_votes": 65,
      "publication_date": 20180426
    },
    {
      "title": "BLACK+DECKER Crush Master 10-Speed Blender, Black, BL2010BP",
      "text": "Worked OK at first then Jar cracked and leaked. 30 Day return had expired with Amazon. Replacement Jar cost more then Blender. Definitely do not recommend!",
      "rating": 1.0,
      "verified": true,
      "author": "Gpcharlie",
      "helpful_votes": 44,
      "publication_date": 20180708
    },
    {
      "title": "Blew up chopping 6 pieces of ice unbelievably disappointing",
      "text": "I wish I could give this a 0 star rating! I try very hard not to be overly negative ever in my reviews, however this is without a doubt the CHEAPEST MOST WORTHLESS piece of equipment I have ever worked with in a kitchen both professionally and personally at home. Being that it is a Black&Decker I expected a much better quality. It actually melted off chunks of the interior near the blade pushing it into the ice and started smoking. This is with 6 pieces of ice! This has NEVER HAPPENED with any other blender I have ever used. I am beyond disappointed in this product. And they should be ashamed for selling it to people!",
      "rating": 1.0,
      "verified": true,
      "author": "Mommalola",
      "helpful_votes": 26,
      "publication_date": 20190417
    },
    {
      "title": "Light weight cup, good price.",
      "text": "I bought this for the price because I needed a blender to use in addition to my nutribullet. You cannot use hot liquids in the nutribullet, but once the item is cooled off a bit you can put it in the blender. The cup is plastic which is not my first choice, but I made that decision to buy it anyway. It works fine for my hot cereals and soups.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 20,
      "publication_date": 20180621
    },
    {
      "title": "So far this is working much better and it's larger so I can make much more ...",
      "text": "I make a lot of smoothies for the gym and my NutriBullet turned out to be a piece of Sh$#@^&%*!. So far this is working much better and it's larger so I can make much more of it and store it in the fridge or freezer for my next workout. Much easier,faster,to make a head of time with easy clean up too.",
      "rating": 5.0,
      "verified": true,
      "author": "Maximo",
      "helpful_votes": 25,
      "publication_date": 20180523
    },
    {
      "title": "Mediocre but works",
      "text": "Not the best for making smoothies with ice. Takes awhile to blend, but good for non frozen items.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 12,
      "publication_date": 20180617
    },
    {
      "title": "Pure Crap",
      "text": "I got into making fruit smoothies. I used my mother's blender until I ordered and received this one. I used the recipe in the book that came with this blender for my smoothies. After 2 uses, it burned up and started smoking. The return was amazingly easy. All I wanted was it to be replaced. The replacement arrived within 2 days. I was excited. Just half way through the first smoothie, guess what? You got it. The thing started smoking and burned up. I ended up returning this one too. Now I am on the hunt for a better blender.",
      "rating": 1.0,
      "verified": true,
      "author": "Donald ",
      "helpful_votes": 2,
      "publication_date": 20200921
    },
    {
      "title": "Cheap Construction",
      "text": "This blender's plastic is so thin and cheap feeling that I hope it does not crack on me, like it did per another customer's review. It has to be the loudest blender I have ever used and I hope I don't get noise complaints from my neighbors where I live. I believe the extreme noise is due to the plastic pitcher. When did blenders start being made out of plastic? I previously owned a similar Black and Decker, the pitcher was made of glass, and tried to find a similar blender. This one blends as well, but the materials are so cheap feeling.",
      "rating": 1.0,
      "verified": true,
      "author": "Restless",
      "helpful_votes": 2,
      "publication_date": 20190324
    },
    {
      "title": "Done with the glass carafes.",
      "text": "I usually buy heavy duty blenders with those beautiful thick glass carafes. Opted for this plastic one since the motors on all of my blenders have zonked out within a few years and left me with an unusable heavy, glass carafe. I bought this lightweight one and am super happy with it. If the motor dies within a couple of years, I won't have minded spending only $20.00 on it. It's pretty powerful for such a lightweight blender too. Blended vegetables in broth until smooth. I am impressed but then again, it's a Black and Decker so I shouldn't have been that surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "fattymoko",
      "helpful_votes": 2,
      "publication_date": 20181012
    },
    {
      "title": "LOUD LOUD LOUD",
      "text": "Wake up everyone in the house with this screaming, hard plastic blender. Scare your pets, maybe even your neighbors. It is SO loud. If you can get over that (I can't...I'll get something else and it'll be quieter), I guess its good enough to make basic drinks. I bought it to make ice drinks, smoothies to be more specific. I can't say its great a liquifying ice...its okay, but not great. Or maybe its just that anything that takes longer than 20 seconds is just too annoying. For the money i guess its fine, but I'll be twice as much for something half as loud.",
      "rating": 3.0,
      "verified": true,
      "author": "Philip Tannenbaum",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Good product if you need limited blender power and features",
      "text": "I bought this for use in my garden, blenderizing moss and buttermilk...I know, it sounds weird but never intended to use it in the kitchen. It blenderized my concoction just fine, even with some dirt added in to increase the degree of difficulty. Have only used it once, and it doesn't seem like something that will last for years, but it would probably be perfect for vacation use where you'd want to use it for a week or a month then leave it behind. The price was certainly right!...the least expensive full size blender I saw ANYWHERE.",
      "rating": 4.0,
      "verified": true,
      "author": "Telgator1",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Does what I bought it for",
      "text": "I wanted something simple to make smoothies, Frappuccinos, and frozen margaritas. This blender can. I don’t quite get how to use the buttons for pulse verses constant, but I still get by.",
      "rating": 5.0,
      "verified": true,
      "author": "Jabez02",
      "helpful_votes": 3,
      "publication_date": 20190706
    },
    {
      "title": "After breaking my glass to the blender I'm so happy with this plastic one",
      "text": "After breaking my glass to the blender I'm so happy with this plastic one. I make smoothies in summer. Sooo good",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 7,
      "publication_date": 20180614
    },
    {
      "title": "Leaks",
      "text": "The blender leaks just like some of the other reviews said. Every time I use it I have to clean the base and sometimes the counter too. As far as working it is ok. It usually does not crush all the ice or fruit or whatever is frozen. It is not a blender worth spending you money on.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda Hughes",
      "helpful_votes": 2,
      "publication_date": 20190820
    },
    {
      "title": "BLACK+DECKER Crush Master 10-Speed Blender",
      "text": "5* all the way! It is everything, what I've been looking for in inexpensive/affordable and practical blender. Smoothies - yep! Milk shakes - yep! Veggie cocktails - yep! Soups, sauces, dressings - yep! etc. This blender does exactly what it's designed for! Ice crushing for frozen drinks, slashies ain't its thing. It's unreasonable and stupid to expect that $30 blender could perform all functions as $300-$1.400 professional grade models!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandre",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "One Star",
      "text": "motor died first night trying to make a milk shake with melted ice cream",
      "rating": 1.0,
      "verified": true,
      "author": "movie man",
      "helpful_votes": 9,
      "publication_date": 20180601
    },
    {
      "title": "So far so good",
      "text": "As the title states, this blender is good so far, and I am really hoping it lasts me a while. I had a really terrible experience with the company/blender I dealt with before this one, Oster. Black & Decker is so much more professional, and trustworthy. The blender works great making smoothies, milkshakes, and even dealing with ice. Do what it tells you in the instructions in using it, and you should be good. I'm really loving this blender so far.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Pollard",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "I like how it was able to blend my smoothie without ...",
      "text": "I bought a blender to replace my old one that broke. The blender worked really well. I like how it was able to blend my smoothie without any problems even though there was ice in it. The base was stable and the buttons were easy to press.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter T.",
      "helpful_votes": 13,
      "publication_date": 20180429
    },
    {
      "title": "Loud",
      "text": "Only used it twice, blending fruit with juice, and another time to blend some vegetables to make chilled cucumber soup. It’s very loud, maybe due to the thin plastic container and plastic body. It does blend well but I don’t think I’ll put ice cubes in it due to others who said that caused their plastic containers to crack.",
      "rating": 4.0,
      "verified": true,
      "author": "Diogenes",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Garbage!!!!",
      "text": "This blender is a peice of junk! Wasted my money! The pitcher cracked after one week!!",
      "rating": 1.0,
      "verified": true,
      "author": "Chris M",
      "helpful_votes": 8,
      "publication_date": 20180611
    },
    {
      "title": "Worth the price",
      "text": "Really worth for processing tag. Does the job perfectly. Should be carefully when using very big piece of ice to grind(keep pressing and leaving the button until all the ice is crushed to small pieces and then you can grind it in speed)",
      "rating": 5.0,
      "verified": true,
      "author": "AJAY PREMARAJAN",
      "helpful_votes": 6,
      "publication_date": 20180918
    },
    {
      "title": "For $23 Fantastic -",
      "text": "For $23 the blender worked like a charm. I guess I'm trying to understand what a $100 blender gives for 4x the price. I highly recommend this blender, crushed cubes to order and delivered a perfect smoothy etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Roberto",
      "helpful_votes": 4,
      "publication_date": 20180714
    },
    {
      "title": "Noisy",
      "text": "It works, but, its noisy, vibrates across the counter top. Did I say noisy! As in my neighbors can hear it. My ears ring afterwards. It is a must to wear ear protectors. I would love to send this thing back!!",
      "rating": 1.0,
      "verified": true,
      "author": "Keith K.",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Piece of Junk",
      "text": "Highlights include: Sounding like a plane is taking off when in use, can't puree a room temperature banana, can't crush ice at high speeds, the pitcher is so cheap that falling into the sink broke it, the ring cracked and was crumbling after about 2 months. Its $25 down the drain if you buy it.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Jelen",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Good blender for the price",
      "text": "I find this blender to be very good for most uses. However, it's a bit cantankerous to use. The jar must be positioned in just the right spot for it to work. It's not meant for hard core use because it clogs sometimes. You have to scrape the sides often. But, easy to assemble and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Alexander-Francois",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Nice",
      "text": "For the price is good, I need to make a frozen.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Torres ",
      "helpful_votes": 2,
      "publication_date": 20200224
    },
    {
      "title": "seems cheap",
      "text": "to early to tell. All the diffent setting seem to do very little in blending or chopping . Have a feeling it won't work very long. Other wise I guess I have nothing to compare it with till I have something else . Hope it will last",
      "rating": 1.0,
      "verified": true,
      "author": "Mr T",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Good quality blender",
      "text": "Purchased this unit because of previous experience with B&D blenders and other small kitchen appliances. Like virtually every other B&D product I've purchased, this one works well, seems durable and made of quality components, and is priced appropriately for what you are getting.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Forwerck",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Smoothy Machine",
      "text": "Didnt realize it was plastic ,probably didnt read the description Just saw the price and i went for it. In a way its good because at least i wont break it in the sink when cleaning,like i did with the glass ones.",
      "rating": 4.0,
      "verified": true,
      "author": "James J. Reilly",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Good for smoothies but too loud",
      "text": "This product is good for making smoothies But makes a lot of noise I personally did not find any noticeable difference between different modes and I thought it was really loud.",
      "rating": 3.0,
      "verified": true,
      "author": "Zain syed",
      "helpful_votes": 2,
      "publication_date": 20181125
    },
    {
      "title": "Immediate Breakdown!",
      "text": "This blender disintegrated the FIRST TIME I brought it out to make a smoothie! Smoothie aka mushy fruit and milk. All of a sudden, I see liquid coming from beneath the jar and I think I spilled something so I lift jar up to wipe...only for the bottom to just fall away! Milk and fruit everywhere. Turns out, the seal at the bottom failed. Thank God it wasn't on. Getting my refund was CHORE as Black&Decker CS is meh. I had to call 3ce, after sending pictures and cutting the plug and all they requested. All for $23. Stay clear!",
      "rating": 1.0,
      "verified": true,
      "author": "Mary ",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "It should have been boxed differently",
      "text": "I like the blender. It was shipped in its store box, which was damaged when it arrived. The blender works fine, but easily could have been damaged. It should have been put into another box with bubble wrap or padding.",
      "rating": 5.0,
      "verified": true,
      "author": "GW Smith",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Too weak to crush ice in smoothies",
      "text": "Too weak for the ice in my smoothies, The motor struggles and won't last long. Pay the bucks and buy quality.",
      "rating": 3.0,
      "verified": true,
      "author": "amdesq",
      "helpful_votes": 4,
      "publication_date": 20181028
    },
    {
      "title": "extremely loud",
      "text": "very loud grinding sound , works ok but i don't expect it to last long / would have rather had a bit better product ,i expect better product from black & decker ,seems cheaply made",
      "rating": 2.0,
      "verified": true,
      "author": "Randall Capps",
      "helpful_votes": 2,
      "publication_date": 20190603
    },
    {
      "title": "Not Heavy Duty",
      "text": "I bought the blender to make smoothies, first of all you have to figure out how to use the buttons, secondly, you get what you pay for. It is not suitable for heavy blending, it does not rotate the items well, you have to stop and stir and finally it is VERY loud. (I didn't send it back, I gave it away).",
      "rating": 2.0,
      "verified": true,
      "author": "Brenda H.",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "YES!! Great deal and works perfectly!",
      "text": "Had the glass model previously and it shattered with a little hot water. It wasn't even boiling water so super disappointed. Got this new blender and it is 100% better than the glass model! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "No name",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Good value for the basics",
      "text": "The brand is always good, made a mean smoothie and protein shakes are mixed smooth. It’s just enough power for me blend basic things. I haven’t tried it on ice yet, but considering that it’s plastic I better not.",
      "rating": 5.0,
      "verified": true,
      "author": "Florida Girl",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Don’t be suckered in by the low price",
      "text": "I bought this item because I figured I couldn’t go wrong for the price. I’ve never seen the blender cheaper. But, I can’t imagine a blender being made of lesser quality. The jar feels like a feather in your hand. Unfortunately, I dropped the feather about 3 feet to the floor. It was empty, and nevertheless, it shattered when it hit the floor. I would suggest spending a few dollars more and finding something that will last.",
      "rating": 1.0,
      "verified": true,
      "author": "Carol C",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Dissapointing",
      "text": "Glad that I got this on Prime day. No way it is worth the regular price. Delivered in the factory box, not in an Amazon box. Looks like it was opened and repackage. Not at all the quality I would expect from Black and Decker. Buyer be ware. It is an inexpensive blender.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul DRaluck",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Lightweight and powerful",
      "text": "Lightweight, smooth plastic pitcher that is easy to clean. The motor is very powerful for the price. It works great for regular home use. I use it regularly.",
      "rating": 5.0,
      "verified": true,
      "author": "Chereen",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "CRUSH MASTER? PFFF",
      "text": "I bought this to make smoothies, and it has a difficult time with ice and frozen fruits. Then after about 10 uses, it no longer seals and the liquids come out of the blender so I had to throw it away. A total waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Shelby Guevara",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Good Value for the money",
      "text": "It may not be the best quality but for the price, it is a good buy. Not a fancy looking product but it does what it meant for Blending. Blending as good as a high end fancy-looking blended.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamran",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "You gotta hold the lid on IT when In Use else It Spills everywhere",
      "text": "my old blender was able to be left to blend without needing me to hold the lid down but this one does it will not hold it down no matter how small of amount you got inside the blender.. it works great though and it still working after more than 4 months of usage",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Waste of money",
      "text": "Ordered this and only ONE button and speed works the rest do not work. Waste of money. Yes easy to clean the top part and lid it can go in dishwasher. Just wish all the speeds and buttons worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Sometimes you get what you paid for.",
      "text": "After a few weeks of use (mostly crushing ice) the seal on the canister started to leak (slightly) and the motor is about to die (starting to smoke). That will be the last time I attempt to use it. Now I need to find a blender that isn't a POS. I wonder if Dewalt makes blenders:P",
      "rating": 1.0,
      "verified": true,
      "author": "Daniel Bogin",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Great food the pricee",
      "text": "My 25 year old blender died and bought this to replace it. Much more power and processing. Good deal easy to operate and completely use.",
      "rating": 5.0,
      "verified": true,
      "author": "jimbaratto",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great blender but not for blending laundry detergent",
      "text": "I bought this, thinking the blender blade unit would fit a mason jar, for mixing my homemade laundry detergent, but it does not. A good blender for everything else, just not what I needed it for.",
      "rating": 5.0,
      "verified": true,
      "author": "DBKiss",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great value for the money",
      "text": "Bought this to mix stuff I don't want to mix in my food blender. Pulverized egg shells and potting mixes for gardening, etc. It's taken everything I've thrown into the jar so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Yellowjacket",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Great Blender!!",
      "text": "We've had this blender for 8 years and love it. The bbn only reason I'm giving it a 4-star is I wish they made the blade a bit sharper. I've had to change the blade twice and it gets dull after about a year of using it. Other than that, it works great and cleaning it is a breeze.",
      "rating": 4.0,
      "verified": true,
      "author": "Bidrussian",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Great product",
      "text": "Cant beat the price! It works like its supposed to and easy to clean. I just throw mine in the dishwasher and I haven't had any issues. It is plastic so very lightweight.",
      "rating": 4.0,
      "verified": true,
      "author": "Mackenzie Gambrell",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Box was damaged but not by the postal service.",
      "text": "The product is fine thankfully. I got a message from the Postal Service that the box arrived damaged and when I got the box it was written on the box that it had arrived at the Postal Service unsealed the box was in terrible shape. The Postal Service did use packing tape on the box to secure it. The blender works fine.😏",
      "rating": 5.0,
      "verified": true,
      "author": "C.D.",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "I don’t get the bad reviews",
      "text": "So much more powerful that the previous one I had which was more expensive. Simple and slim, doesn’t take up too much counter space.",
      "rating": 5.0,
      "verified": true,
      "author": "arianna",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "junk",
      "text": "don't waste your money stopped running and the window to return it closed bought it in feb 2020 window closed march 2020",
      "rating": 1.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Happy with the powerful blender",
      "text": "The milk shake was perfect. Would recommend. Great blender at the price. Powerful. Easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Nice",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Does the job",
      "text": "I share this with 2 other people and we all make smoothies, soups, pesto... it's nice and straight forward.",
      "rating": 5.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "The cheap plastic jar blasted off easily. Don't put yourself into danger!",
      "text": "Very cheap plastic product. The plastic jar blasted off while using. Very dangerous! I used it less than 2 months and the tragedy happened. It totally doesn't worth it!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Nice blender",
      "text": "I love the mixer. I do not use it as much as I wanted to but it works great",
      "rating": 5.0,
      "verified": true,
      "author": "Bev t.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Ice gets stuck under blades",
      "text": "Large chunks of ice get stuck under blades. I had to keep removing pitcher to free up trapped ice with butter knife",
      "rating": 1.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Great value!",
      "text": "Excellent value for money. The blender is a thick glass so a bit heavy. But easy to clean and use! Can’t go wrong with this brand and price.",
      "rating": 5.0,
      "verified": true,
      "author": "Yale",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Amazing blender",
      "text": "Great product for price, was t too sure how it would work, but it’s so easy to use, 100% recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Diamond",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "You get what you pay for",
      "text": "A cheap blender means a cheap product. If your goal is to make smoothies you should just spend the extra money on a more expensive blender. It took me 5 minutes to cut down half of the fruits and some ice cubes to make a smoothie. I eventually got tired of trying to get it to blend everything and just poured it in a bowl to eat like that. Not only does it not work well, it’s extremely loud too.",
      "rating": 2.0,
      "verified": true,
      "author": "Maia",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Box ripped up poor delivery",
      "text": "This is a wedding gift can I make it work sure but I am not pleased with the delivery condition of a “brand new item”. Especially when I’m giving as a gift.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Durable",
      "text": "I like this product I brought this for my niece",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila Young",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Loved it",
      "text": "Works great for its price point! Made my favorite fruit smoothies with it. Not the best for greens.",
      "rating": 5.0,
      "verified": true,
      "author": "Agnes O.",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Waste of money",
      "text": "It got dis colored after first cleaning. Parts are not dishwasher safe. So there is no easy clean up.",
      "rating": 3.0,
      "verified": true,
      "author": "My",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Looks great works great",
      "text": "Nice works awesome I liked that it was plastic but sometimes blades have difficulty cutting up frozen fruit or ice.",
      "rating": 5.0,
      "verified": true,
      "author": "Danadoo",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "however I wish it was a little better at breaking up my smoothie ingredients",
      "text": "I purchased this to use at work. It gets the job done, however I wish it was a little better at breaking up my smoothie ingredients.",
      "rating": 3.0,
      "verified": true,
      "author": "highonlife",
      "helpful_votes": 3,
      "publication_date": 20180619
    },
    {
      "title": "Pretty good for the price",
      "text": "It's not very powerful with thicker consistencies. Works pretty well.",
      "rating": 3.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Good blender for the price",
      "text": "Had to assemble myself when received but been working properly ever since",
      "rating": 3.0,
      "verified": true,
      "author": "Will Will",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "good basic blender",
      "text": "not made to grind concrete, but makes soups, smoothies etc just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "BingBadaboom",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "All plastic",
      "text": "My old blender had a glass carafe, this one is plastic, the entire blender is lighter than expected but it does work well. I suppose it is kid proof, theey cannot break the caraffe.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Robinson",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Garbage blender",
      "text": "No stars don't buy blender missing the whole base and the container was cracked total loss",
      "rating": 1.0,
      "verified": true,
      "author": "KING DJ",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Very Light Duty Only",
      "text": "It works really well for very light duty blending. I used it trice and it started smoking and throwing sparks. I woldn't call it Crush Master unless you plan on using it once. If you are going to blench watery things easy to mix then it does a good job.",
      "rating": 3.0,
      "verified": true,
      "author": "G. JACOBS",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "👍",
      "text": "There is not to say a lot. It works properly. Arrived on time. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "I know Black and Decker is a good product  I hope this does as good as old one",
      "text": "I’ve had my blender for over 25 years it still works but gave it to granddaughter time for me to get a new one",
      "rating": 5.0,
      "verified": true,
      "author": "george  mansur",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Works great !",
      "text": "It works very well. I had no problems with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah c bay",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Some items may be missing",
      "text": "I liked how simple it was to use, but mine did not come with instructions so assemblying it was difficult. I have used it twice so far, both times was to make milkshakes.",
      "rating": 5.0,
      "verified": true,
      "author": "Elisha",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Used once!",
      "text": "Purchased in October of 18, used once worked well.....tried to use it March 19 doesn't work. I did call customer service and they were very nice and helpful and will send a replacement when they receive this one.....which is good but in the mean time I have to go and purchase another one because I need one today.........Will not purchase this specific one again!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Last 3 months",
      "text": "Awful!!!!! I purchased this blender 3 times and it worked for a few months then the just stops. Why 3 times, because money and the price was right + prime shipping. 30 day returns expired. Do NOT waste your money, just pay a little extra and get a good one. The fact that this is still on the market and the first blender listed by amazon is beyond me. Don’t do it.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Lee",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Didn't last more than 2 months....",
      "text": "Worked fine for 2 months and then one fine day, suddenly it stopped working, without any notice. I am expecting something like this should at least last longer than that. Thoroughly disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Works great!",
      "text": "My husband is in love with this lol he has made shakes everyday since i surprised him with it lol",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "great product for the money",
      "text": "I mean it's no ninja blender but for $18 this is a great money for item deal. I do have some concerns to the long term longevity of the plastic jug but it was $18 and well worth it in my opinion. I didn't pay under $20 and expect gold so i thought this as a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Calvin Chi",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "great buy",
      "text": "Black and Decker gives great value every time, which is why I return to them time after time when I need quality",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn R.",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Dissatisfied",
      "text": "I purchased this to make smoothies and it doesn’t blend well at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Keosha L Lipsey",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Not a good purchase",
      "text": "Not worth the purchase, it broke within the month we purchased. Not sturdy enough for making smoothies. We are a family of 5 and this was not a good purchase for us!",
      "rating": 1.0,
      "verified": true,
      "author": "Momof4",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "It was cheap, but to loud.",
      "text": "I hated it cause it is soooo loud. I sold it on letgo and lost $4.00 on it.",
      "rating": 3.0,
      "verified": true,
      "author": "Mindy Miller-Been",
      "helpful_votes": 0,
      "publication_date": 20191018
    },
    {
      "title": "Blender became Smokey",
      "text": "After using this blender for 3months, it exploded in smokes. I only use the blender once a week and am surprised at this.",
      "rating": 5.0,
      "verified": true,
      "author": "victoria",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Excellent Christmas gift",
      "text": "I bought it for a Christmas gift and they loved it",
      "rating": 5.0,
      "verified": true,
      "author": "Lytebrite",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Good product",
      "text": "Nice product. Just that mine which I received did not work.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Parts can dishwasher clean.",
      "text": "A good blender for the price, easy to clean and use.",
      "rating": 5.0,
      "verified": true,
      "author": "wanda porter",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great buy !",
      "text": "The jar itself is quite light as it is plastic but the base carries a little weight . I am very pleased with my purchase and it was very well !",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Territorial",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Great value",
      "text": "Not very fancy, but better than exoected. Works really well and is even nicer looking in person.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah",
      "helpful_votes": 0,
      "publication_date": 20180508
    },
    {
      "title": "Great job for the price",
      "text": "It grinds flax seeds and my protein shakes come out great. So far I like it",
      "rating": 5.0,
      "verified": true,
      "author": "susan twarowski",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Blender is awesome",
      "text": "Exactly as described. Fast delivery. Mom loves this B & D blender.",
      "rating": 5.0,
      "verified": true,
      "author": "lilmama247",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "It doesn't worth!!!",
      "text": "It has amy strongness. It just works with easy things...some juices I can't do such as carrots or even uput ice in my juces. Don't buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Hyllana Medeiros",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Perfect for gym shakes or enjoyable smoothies!",
      "text": "I use this for smoothies and post work out shakes, its a great deal, not too loud really, and definately gets the job done! I love this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "James Whittemore",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great gift",
      "text": "Bought as a gift and they really liked it and said that it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Doreen",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "This is not the blender for you.",
      "text": "After using blender 7-9 times over a 3 month period the blender smoked a bit and died. This is a tool for people that won't be using it. Great gift for someone you don't like. I bought cheap and got cheap. I once again learned this lesson.",
      "rating": 1.0,
      "verified": true,
      "author": "Zet",
      "helpful_votes": 0,
      "publication_date": 20190523
    }
  ],
  "product_meta": {
    "title": "BLACK+DECKER Crush Master 10-Speed Blender, Black, BL2010BP",
    "description": "The BLACK + DECKER 10-Speed Blender is a kitchen classic. With 10 speeds and a pulse control, operation is simple and efficient. The lightweight plastic 5-cup (40-oz.) jar is easy to pour from and holds several servings of your favorite soups, smoothies, and more! Plus, cleanup is a breeze thanks to the dishwasher-safe removable parts.",
    "rating": 4.1,
    "feature_bullets": [
      "10 Speeds with Pulse - Find the right consistency for everything you make with a range of blending speeds for the 550-watt motor",
      "Lightweight 6-Cup Jar - The plastic 6-cup (48-oz.) jar is easy to handle with a PerfectPour spout that eliminates drips and spills",
      "4-Point Blade - The multi-level stainless steel blade blends at multiple levels to improve efficiency and blending power",
      "Measuring Lid - The clear lid insert doubles as a 1-ounce measuring cup, perfect for making iced mixed drinks",
      "Dishwasher-Safe Parts - Cleanup is a breeze with the dishwasher-safe pitcher, lid, and blade"
    ],
    "specifications": {
      "Product Dimensions": "7.8 x 10.8 x 12.9 inches",
      "Item Weight": "4.4 pounds",
      "Manufacturer": "Spectrum Brands",
      "ASIN": "B009NIRA1M",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "BL2010BP",
      "Customer Reviews": "4.1 out of 5 stars1,360 ratings4.1 out of 5 stars",
      "Best Sellers Rank": "#1,436 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 8, 2012"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": 29.99
  }
}