{
  "website_summaries": [
    {
      "verdict": "Although the blade is shorter than that of some other choices, these are versatile scissors that can be used on heavy carpets and in awkward cutting situations (thanks to the angled blades).",
      "pros": [
        "Angled blades, spring-loaded handle, and high-quality stainless steel make for an excellent product",
        "Extremely sharp blades"
      ],
      "cons": [
        "May require more hand strength than some users would like to exert"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Sshhiiiiing! is the sound of my CANARY Arm Wrestler Carpet Scissors!",
      "text": "Where have you been my entire life?! These are glorious. I can cut *anything* with these. I got them for carpet, but have found they are just all around useful to have. They're strong, they're sharp, and they're sort of shiny and pretty too... It's like a ninjato cutting through butter. Seriously though, if you find yourself in need of a well crafted, multi-purpose, super sharp cutting tool, I definitely recommend these.",
      "rating": 5.0,
      "verified": true,
      "author": "oddlyoily",
      "helpful_votes": 31,
      "publication_date": 20170228
    },
    {
      "title": "Sharp and strong (worked for my small hands)",
      "text": "I had a shag area rug that was too big for the space. I bought these scissors and used them to chop off two feet of length. Then I used a hot glue gun on the back of the rug to keep it from unravelling. I have never used carpet scissors before, so I have no basis for comparison -- but these did the job, and I'm happy with the result. They seem to be sharp, and they allowed me to cut precisely. Also, I have small hands, and I was able to manage quite well with these.",
      "rating": 5.0,
      "verified": true,
      "author": "C Smith",
      "helpful_votes": 19,
      "publication_date": 20180410
    },
    {
      "title": "Cuts carpet well but tough on the hand",
      "text": "My new area rug was smaller than the existing rug pad so the pad had to be trimmed. Scissors didn’t work at all because fibers were trapped where the two sides join thus preventing the blades to meet. I looked online for a more suitable tool and found these carpet scissors. The cutting ability is great but these are not ergonomic so your hand will still take a beating. I believe this product would be much improved if it had longer handles with a thicker grip for easier handling. I’d buy these again because the cutting ability is great but would have someone else use them for me.",
      "rating": 4.0,
      "verified": true,
      "author": "2757045",
      "helpful_votes": 10,
      "publication_date": 20180822
    },
    {
      "title": "PERFECT carpet scissors!",
      "text": "I have been looking for very sharp, durable, easy to use scissors for cutting up thick wool carpeting. These are PERFECT! The flexible hinge located between the handles really helps facilitate easy cutting and prevents hand fatigue. I hope they continue to remain sharp, but they are helping me complete a tedious and time consuming job with a lot less aggravation. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "bramwell",
      "helpful_votes": 20,
      "publication_date": 20170522
    },
    {
      "title": "Not for thick carpet",
      "text": "These will not cut pile carpet, but work great on trimming the backing or other thinner pieces such as indoor/outdoor carpet.",
      "rating": 3.0,
      "verified": true,
      "author": "R Hopkins",
      "helpful_votes": 10,
      "publication_date": 20180722
    },
    {
      "title": "hard to cut a straight line",
      "text": "these scissors seem to be reasonably well made but I don't understand why they are sold as \"carpet\" scissors as they didn't make cutting thin carpet tiles any easier than using a pair of kitchen scissors or others. and for trimming carpet i think you need a blade that is angled a little to the handle (i'm sure there is a term for that), which these are not. i found the images to be easy to think the blade was angled because of way they turn up, but they are not.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Moore",
      "helpful_votes": 5,
      "publication_date": 20190622
    },
    {
      "title": "Quality snips for many uses",
      "text": "These are quite heavy with a nut hinge you can tighten yourself. The angle makes them useful in odd situations. Earned a place on my at home but mystay in my carry kit for ease of locking. eBIS TRADING shipped them straight from Japan in 15 days.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 6,
      "publication_date": 20170505
    },
    {
      "title": "These do not cut well through thick carpet",
      "text": "I looked at a bunch of different carpet cutting tools and decided to purchase this one. I didn't want to spend a ton of money on some industrial carpet cutter, but wanted to make my project a little bit easier (cutting carpet up from living room). This product is definitely not what I expected. I basically ended up using these scissors to cut a little bit through the middle of the carpet, just enough to get a grip on it and just ripped the carpet all the way down. These cut great through paper or thin pieces of material but not on something thick like carpet.",
      "rating": 2.0,
      "verified": true,
      "author": "Melanie Rositani",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Just an expensive pair of scissors",
      "text": "Does NOT cut carpet. Does not work on anything thick. Would not cut cardboard box for recycling. Bought for use on carpet. Did not work for us the way other reviews claim.",
      "rating": 1.0,
      "verified": true,
      "author": "Maydaysmom",
      "helpful_votes": 2,
      "publication_date": 20190405
    },
    {
      "title": "NOT FOR CARPET",
      "text": "I bought these because they showed people using them for artificial grass. Well, they don't work well at all!! They have minimal grip causing the handles to twist in your palm while trying to cut, which is hindered significantly because of the design, making it much to difficult to use on carpet lengths over six inches in my opinion.",
      "rating": 2.0,
      "verified": true,
      "author": "Daemon Lee",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Worked well on thick shag",
      "text": "These shears cut through a thick shag rug. Yes, it took some work because it is a thick rug, but with some hand strength applied, the job got done. I had tried giant scissors, but I couldn't get those to work. These shears are strong and didn't suffer with the mega strength I had to apply to make the cuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Sonia R.",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Don’t waist your money",
      "text": "Can barely cut through my old carpet, they are the worst ever. Ended up using my old military Ka-Bar knife to cut the carpet, should’ve used my knife in the first place, knife went through the carpet like butter, the carpet cutter? Couldn’t cut your way out of a wet paper bag with them. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Waste of money",
      "text": "This product broke upon cutting 5 inches of carpet. The spring popped off giving me a nasty sting. It also doesn't cut but 1/2 inch at a time. I ended up nicking the carpet with these and ripping the rest off with only my hands. I am extremely dissatisfied with these cutters!",
      "rating": 1.0,
      "verified": true,
      "author": "alicia",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Not for deep pile",
      "text": "I should have read closer. Although this is very sharp and the blades stay very tight, I had a hell of a time cutting the old carpet which was maybe deeper than this is designed for (about 5/8\"). I'll keep it for other uses as it seems very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Jasef",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "It was so, so great... For the first hour",
      "text": "These were an answered prayer and made life so much easier until they got jammed from carpet strings. I tried pulling them out, but I couldn’t get them all and I really, really tried. They still cut after that, but not nearly as well. I ended up using them as a grip on the carpet and just yanked with them to tear it (very old carpet).",
      "rating": 2.0,
      "verified": true,
      "author": "Ronda",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Amazing!",
      "text": "We bought some runners to put together to create one long rug for our long hallway. Unfortunately though the size of the runners was too long and we needed to cut. I was floored by how easy and effectively these worked. Whole thing was done in 25 seconds. Fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "jjjjordan",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Don't misuse, works great",
      "text": "Cut all of my multiple pieces of carpet for an old classic truck. Worked great. Then I used it to trim some edging with metal inside. It worked, but now doesn't cut carpet as well. Foolish (normal).",
      "rating": 5.0,
      "verified": true,
      "author": "Sanguine",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Good size and cuts beautifully !",
      "text": "Giving a 5 star rating because the scissors are very well made, sturdy but not too difficult to. Squeeze. I cut a dense oriental carpet with ease. As others have said in reviews, the trick is to NOT hang onto them at the end of the handles, but closer to the scissors end.",
      "rating": 5.0,
      "verified": true,
      "author": "S BROWN",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Great product!",
      "text": "I'm using this scissors for work with para cord and they are great. These are a quality product that have exceeded my expectations. You can believe the projected delivery times because you are buying them from a Japanese company and the product is shipped from Japan. My purchase arrived just before the 4 week mark.",
      "rating": 5.0,
      "verified": true,
      "author": "M B Clendenin",
      "helpful_votes": 4,
      "publication_date": 20160629
    },
    {
      "title": "Great  Utility scissors to have around the house.",
      "text": "Are use these to cut through artificial turf does a pretty good job I did get a blister while using them so I recommend having gloves on if you were cutting through something very thick one con is that they could be sharper however these are still a great pair of Utility scissors to have around the house.",
      "rating": 4.0,
      "verified": true,
      "author": "sensible",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Two Stars",
      "text": "Not very sharp, and had to really squeeze hard to operate. Really hard on joints in hands to operate.",
      "rating": 2.0,
      "verified": true,
      "author": "marcia walden",
      "helpful_votes": 5,
      "publication_date": 20171023
    },
    {
      "title": "Very difficult to cut through shag carpet with these.  Our gardening shears worked better.",
      "text": "The scissors were comfortable to hold but after a few inches of trying to trim a shag carpet to a smaller size, it seemed to lose it's sharpness and was unable to handle the job. I will keep it to cut other thinks like thinner carpets or fabric but ended up using our garden sheers to cut the carpet that I orginally bought these for.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Cuts rugs like buttah",
      "text": "I didn’t believe this could work as well as it does. Easy on the hands, cuts like a dream. I’m in my 70’s with achy hands..., and NO problem. Did two big rugs by myself.",
      "rating": 5.0,
      "verified": true,
      "author": "Joycie",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Would not cut the carpet.",
      "text": "Product arrived on time and as described. The product material quality and build were good. However, it would not cut the carpet without the blades sticking during the cut. I recommend the seller, but not the product.",
      "rating": 3.0,
      "verified": true,
      "author": "errico perrotta sr",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Easy to use and conquers the job",
      "text": "Worked perfectly to trim a rug pad and easy to grip. The angled blade made it easy to get into bulky fabrics and I've already found other uses for it. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ravinia",
      "helpful_votes": 0,
      "publication_date": 20191115
    },
    {
      "title": "Made quick work of trimming a thick felt rubber-backed rug pad!",
      "text": "I needed something to trim a thick rug pad and decided to try these instead of a carpet knife. These scissors are fantastic - I could trim the pad safely and easily. I’m sure I will find other uses around the house, too. I highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "2tejas",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Works Well",
      "text": "Works well on most of my projects and carpet. I tried to use it on a thicker carpet and it was a little harder to cut so I will probably get bigger shears.",
      "rating": 5.0,
      "verified": true,
      "author": "Avid Amazon Shopper",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Not strong enough to cut 1/4 rug pad",
      "text": "Didn't like it. Used this to cut 1/4\" rug padding. Didn't work too well, was hard to cut. I'd recommend spending more money and getting something stronger",
      "rating": 2.0,
      "verified": true,
      "author": "Ravyn",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "For more than carpets",
      "text": "These are terrific scissors. I found them sharp, comfortable and easy to use, for crafts (foam and other materials), as well as making quick work of cutting up an old carpet that needed to be discarded.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Didn't work on my rug",
      "text": "I wanted to cut my rug to remove it from my home and it doesn't work to cut it. It seems sturdy but just not sharp enough for the rug.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Woodworth",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Does the job.",
      "text": "Does the job. Pretty strong. Was able to cut up my carpet with no issues.",
      "rating": 4.0,
      "verified": true,
      "author": "Chinnonye O. Okafor",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "work well - failry sturdy",
      "text": "needed these to cut some new carpet pads...they worked well, have only used a few times - they're fairly sharp and study enough for the job...",
      "rating": 5.0,
      "verified": true,
      "author": "RM98104",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "These are perfect for cutting silk but not much else",
      "text": "These do not cut carpet and they get stuck when you try to cut! I was disappointed to see that this item was an “Amazon’s choice” item.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Gret carpet cutter.",
      "text": "Canary arm wrestler works as it says it would. I used it to cut a runner carpet that was about 1 inch thick. I had no problem cutting through it.",
      "rating": 5.0,
      "verified": true,
      "author": "diana domio",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Perfect",
      "text": "These work Great! I've tried several different cutting tools this is by far the best. I am installing thick carpet squares that have a thick rubber later on the bottom and these cut right through and my hands don't hurt.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "great for cutting heavy rug pad",
      "text": "I didn't expect these to work as well as they did. I have arthritis in my right thumb so scissors aren't that easy to use. I didn't have any problem cutting heavy rug pads with these, even 15-20 feet at a time. Great scissors for the job.",
      "rating": 5.0,
      "verified": true,
      "author": "mbjinala",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "I did not feel they worked!",
      "text": "They did not cut my small carpet mats well at all, disappointed. Read reviews, did not work for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Sady",
      "helpful_votes": 2,
      "publication_date": 20190501
    },
    {
      "title": "Worked like a charm!",
      "text": "I tried every tool I owned to cut my heavy-duty rug pad. Even garden shears didn't work. But these scissors made quick work of the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Guendel",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Works like a dream",
      "text": "Amazing! Better than I hoped! Cuts carpet pad with ease. So excited to use for other things too 🙌🏻",
      "rating": 5.0,
      "verified": true,
      "author": "svk",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Didn’t work",
      "text": "I couldn’t cut the carpet I ended up using scissors",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Waterman",
      "helpful_votes": 2,
      "publication_date": 20190801
    },
    {
      "title": "Not like",
      "text": "I couldn’t use these at all. I am left handed but not sure that is why they didn’t work for me",
      "rating": 2.0,
      "verified": true,
      "author": "Dwight E. Sutherland",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "It was like cutting through butter",
      "text": "I was hesitant about ordering these carpet scissors as I have weak wrists and find it difficult to use scissors that aren't sharp. But after reading some of the reviews I decided to give them a chance. I couldn't believe it. It was like cutting through butter!! So easy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline Wade",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Not for carpet",
      "text": "For thin carpet like the indoor outdoor type should do, both nothing meaty, metal is thin and they didn’t work well in a woven carpet",
      "rating": 2.0,
      "verified": true,
      "author": "Jodicia",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Works on other things than carpet",
      "text": "I us the ahears for plastics modifications. The tight fitting sharp blades, and the angled design work perfectly in my application.I couldn't be more pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "W. OConnor",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "WORKS SMOOOOOOOOTH",
      "text": "It took me a try or two to get the feel of it, but once I did it cut a rug like buttah. Snazzy.",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Great job it makes cutting carpet easy.",
      "text": "I bought these to cut carpet for my boat really good value and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Lege",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Needs to be sturdier",
      "text": "A fairly good tool which needs to be sturdier. It did the job adequately but may not last the next use.",
      "rating": 3.0,
      "verified": true,
      "author": "RP",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Great Shears!!",
      "text": "These shears are just what I was looking for. They cut carpet like it was paper. I totally recommend them!!",
      "rating": 5.0,
      "verified": true,
      "author": "MP",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Good for cutting carpet that is on the thinner side",
      "text": "Good for cutting carpet that is on the thinner side, I wish the blades will be twice as thick that will help with thicker carpets!!",
      "rating": 2.0,
      "verified": true,
      "author": "Marc E",
      "helpful_votes": 3,
      "publication_date": 20180808
    },
    {
      "title": "Great quality cutters!",
      "text": "Worked great and as described. High quality, durable and got the job done. Advice: wear gloves, prevents blisters.",
      "rating": 5.0,
      "verified": true,
      "author": "D. M. Buzz",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Just eh",
      "text": "Worked great at first but lost its sharpness rather quickly",
      "rating": 3.0,
      "verified": true,
      "author": "Kermit Buchman Jr.",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Cuts like butter",
      "text": "Great product for doing my job duties of destroying bad handbags",
      "rating": 5.0,
      "verified": true,
      "author": "J. Vargas",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Worked great on our thick carpet",
      "text": "I wanted to get rid of my old thick shag carpet and wanted to cut it in half to make it easier to handle and these scissors did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "These carpet shears are great! Just what I needed to cut a really ...",
      "text": "These carpet shears are great! Just what I needed to cut a really good pad. Love them and highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy M DiMuro",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Get a utility knife instead!",
      "text": "These don't really work for a big job like removing carpet. The scissors have to be \"just so\" to cut at all.",
      "rating": 1.0,
      "verified": true,
      "author": "MARY COLEMAN",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Great on carpet and fabric",
      "text": "Did a great job on carpet, and now to my surprise, they are still sharp enough to use on fabric. This was a great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MsManners",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Great carpet shears!",
      "text": "They work very efficiently. I effortlessly cut my carpet - not a problem. Good price and prompt delivery. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "ekgirl",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "They are good for opening items sealed with hard plastics",
      "text": "They are well made. They are good for opening items sealed with hard plastics. The offset angle of the handle to the blades help keep your hand away from the sharp plastic as you cut.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Y. N.",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "doesn't cut",
      "text": "uh, it's a carpet scissor right? well, it doesn't cut carpet",
      "rating": 2.0,
      "verified": true,
      "author": "Desperado",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Better than any scissors I have ever owned.",
      "text": "I was looking for something to cut carpet samples. They worked on carpet but it was a struggle. Heavy duty scissors but they have limitations. Still a good tool to have in the tool box",
      "rating": 4.0,
      "verified": true,
      "author": "teresa H",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Waste of money.",
      "text": "Completely useless. Had to get and use an old fashioned utility knife. Woll use these for cutting wrapping paper.",
      "rating": 1.0,
      "verified": true,
      "author": "Colliemom2",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Made of bad sleek cannot keep a edge",
      "text": "This idiom is made to cut carpet but will not sharp enough the steel will not keep a sharp edge",
      "rating": 1.0,
      "verified": true,
      "author": "Ed Moreau",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Sharp scissors",
      "text": "I liked the scissors, they cut through the pad for my carpet without problem. I don't know how long they will stay sharp but I have a lot of things I can cut now.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue in Oregon",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "worked",
      "text": "needed to cut up an area rug. these worked, but hurt my hand after awhile. I would say these are great if you don't have too much to cut.",
      "rating": 5.0,
      "verified": true,
      "author": "Kellee C.",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Good for many things but not for cutting carpet",
      "text": "I don't know why these are called \"Arm Wrestler Carpet Scissors\"... maybe because you have to wrestle the carpet while trying to cut it with these scissors?? Not good at all for cutting carpet, BUT I am keeping them because they cut many other things well (e.g. cardboard, plastic packaging).",
      "rating": 2.0,
      "verified": true,
      "author": "SN",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "These do the job!",
      "text": "I needed something to cut through a wool rug, and these worked great. I am so glad I took a chance and ordered these and I was able to use them as soon as they were delivered.",
      "rating": 5.0,
      "verified": true,
      "author": "Rac83",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Quality and Awesome Scissors!",
      "text": "Highly Recommend! My husband used these to cut carpet. Worked like a charm! Like cutting through butter!",
      "rating": 5.0,
      "verified": true,
      "author": "Bermudabluez",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Just fine",
      "text": "Well the scissors work good but, I struggle sometimes with vehicle carpets and the isolation under the carpet is difficult to get into, otherwise to carpet is just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "raul",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Good tool... worth the money",
      "text": "as described and worked really well for cutting automotive carpet.",
      "rating": 4.0,
      "verified": true,
      "author": "rob barrett",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Not effective on thick carpet pads",
      "text": "I bought these for a number of new carpet pads I've purchased and a sharp box cutter works better. I had a blister on my palm before I was finished trimming a 8' length of carpet pad. They just aren't worth it for think pads, maybe for thin pads.",
      "rating": 2.0,
      "verified": true,
      "author": "L. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great carpet scissors",
      "text": "These scissors work great! Cut through carpet we are removing like butter. No dulling yet! Great product. Using them does not fatigue hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Mandy56",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Pretty disappointed.",
      "text": "Struggled cutting through any thick carpet, just not very sharp I guess. Good design and felt good in the hand but left a lot to be desired. I switched to a utility knife and got the job done.",
      "rating": 2.0,
      "verified": true,
      "author": "Tyler Sheron",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Great cutting results!",
      "text": "Needed scissors that cut my office rug pad easily. I tried previously the household scissors and carpet knife - all failed but this was exactly what I needed. Clean cut. No effort at all trimming the pad to my rugs size. It was a few minutes project and I loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "magic7",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Comfortable and cuts carpet",
      "text": "We've Removed the carpet and pad in two rooms in 4 foot strips now and these scissors are still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley Crews",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "works better than anything else I tried",
      "text": "wished I would have bought them sooner. Makes the job cutting artificial grass a lot easier",
      "rating": 5.0,
      "verified": true,
      "author": "David K.",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "A winner!",
      "text": "These are a five-star purchase. Beautifully packaged, and shipped in record time. These scissors will cut absolutely anything.",
      "rating": 5.0,
      "verified": true,
      "author": "Daphne",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Canary tool",
      "text": "I gave negative feedback on this item earlier, that's because you said it had been delivered 2 days ago ,I just got the item. the negative feedback was your fault ,now that I actually have the item I'm well pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Emanuel Deason",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Did the job",
      "text": "Did the job I needed to do cutting some faux grass outdoor carpet. Nice clean cuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Disappointed",
      "text": "Pretty disappointed. Used them for the first time today to cut up a carpet-the handle is slippery, I’m getting a blister and it is not cutting very well. Definitely not what I expected.",
      "rating": 2.0,
      "verified": true,
      "author": "Karen V.",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Recommend",
      "text": "pretty sturdy, was purchased to cut 60Mil TPO roofing membrane and they worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "bigmill",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great, sharp scissors!!",
      "text": "These work great! They are really sharp and you'll be happy that you bought them, I used themt to cut up old rug and they worked perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda K",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Sturdy and easy to use carpet scissors",
      "text": "Canary carpet cutting scissors are easy to use and strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Tung Le",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Work fine for EPDM...",
      "text": "Work fine for cutting EDPM for roofs. Makes the job easier with the offset blades and they are sharp enough to glide through the sheets on a straight slice.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Cox",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Waste of money!",
      "text": "I had to take carpet from an 8x10 room. These were dull after cutting one strip! I had to stop and sharpen after each cut. Waste of money!",
      "rating": 3.0,
      "verified": true,
      "author": "Kathleen Leon",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Does not cut clean the length of the blade.",
      "text": "I have to usually re-adjust my cut to get it to cut clean over 2\" or 50mm.",
      "rating": 2.0,
      "verified": true,
      "author": "J. H.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Just ok",
      "text": "Pretty good. But not terrible sharp. A blade worked better for my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "OP Cal",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Quality materials very good cutter",
      "text": "Very nice. Quality materials came from Japan. Cuts very well. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Macho Macho Macho Man",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "Great for automobile carpet cutting and trimming",
      "text": "Much easier to use than scissors and excels at cutting difficult carpet/jute layers where razor knifes are completely failing.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Alan Koeneke",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Excellent Pair of Scissors",
      "text": "Fantastic pair of scissors, went right into my tool bag and they cut really well",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Great scissors",
      "text": "Worked great to cut boat carpet. Real sharp, made in Japan",
      "rating": 5.0,
      "verified": true,
      "author": "Richard R.",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Cutting Isn't Always Easy",
      "text": "To remove the carpet in my dining room. It had been there for over 34 years. The scissors had difficulty cutting through so!e of the carpet and padding",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley Aiello",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Don’t buy unless carpet is very thin.",
      "text": "They started our great - for about half way down the rug I was cutting. Then they failed on me.",
      "rating": 3.0,
      "verified": true,
      "author": "Katie Williams",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "These cutters dulled up very quickly",
      "text": "I was going to use them to install artificial grass but they simply didn't cut even as well a razor blade!",
      "rating": 1.0,
      "verified": true,
      "author": "Doug Lampshire",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great product",
      "text": "Works as described! Bought it to cut carpet and it worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Caro",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "Five Stars",
      "text": "Love it! Was hoping a bigger one but it did the job.",
      "rating": 5.0,
      "verified": true,
      "author": "NCA71",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Doing the job meant to do.",
      "text": "I like the product because it's sharp enough to cut my rug. I wish it had a much better Rubbermaid grip.",
      "rating": 5.0,
      "verified": true,
      "author": "Agnes Tangata",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "got them one day early. the were just what we needed to cut a patterened carpet and match it.",
      "text": "We had all of my dads old carpet laying tool except the sissors.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Anthony",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great",
      "text": "These are great! Fast shipping and they easily cut through thick felt carpet pad.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Not great",
      "text": "It is just ok. After cutting run in one room, it lost it sharpness.",
      "rating": 2.0,
      "verified": true,
      "author": "Alejandra Beltran",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "These carpet scissors work well!",
      "text": "This is a great product that performs exactly the way it advertises. I used them to reduce the size of a rug for my bedroom. I did have to wear a glove to reduce the pressure on my hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181231
    }
  ],
  "product_meta": {
    "title": "CANARY Arm Wrestler Carpet Cutting Scissors Black (NAW-205B)",
    "rating": 4,
    "feature_bullets": [
      "[BEST CARPET SCISSORS EVER] The scissors is specialized in cutting and trimming carpet, wallpaper, denim, rubber sheet, leather, vinyl, cardboard, artificial grass. Helpful for your DIY and cut and resize these materials as you want.",
      "[PRODUCT SIZE] Length: 8.07 inches / Blade length: 1.96 inches / Weight 0.286 lbs",
      "[HEAVY DUTY SCISSORS] Blade: Stainless steel / Handle: ABS Plastic Japanese high quality Japanese stainless steel is used.",
      "[JAPANESE QUALITY] Made in Japan. All item is hand made by professional Japanese craftsmen.",
      "[OFFICIAL ENGLISH INSTRUCTION] Including CANARY official English instruction. Easy to use."
    ],
    "specifications": {
      "Manufacturer": "CANARY",
      "Brand": "CANARY",
      "Item Weight": "3.98 ounces",
      "Product Dimensions": "8.07 x 0.79 x 2.13 inches",
      "Item model number": "NAW-205B",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Black",
      "Manufacturer Part Number": "NAW-205B",
      "ASIN": "B0091GW6XI",
      "Customer Reviews": "4.0 out of 5 stars314 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#19,880 in Tools & Home Improvement",
      "Date First Available": "June 4, 2013"
    },
    "categories": [
      "Office Products",
      "Scissors & Shears",
      "Hand Tools",
      "Tools & Home Improvement",
      "Power & Hand Tools"
    ],
    "price": 19.88
  }
}