{
  "website_summaries": [
    {
      "verdict": "A worthy investment in good mornings – it does everything consumers expect in a wake-up light and more.",
      "pros": [
        "Recognized by the National Sleep Foundation",
        "Simulates natural sunrise",
        "Straightforward design is attractive and easy to use",
        "Has 5 sounds, FM radio, and 10 brightness levels"
      ],
      "cons": [
        "It's one of the most expensive models on our shortlist, but it's well-made and effective"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A more affordable Philips wake-up light than the premium version that still has several of the same features.",
      "pros": [
        "Features a sunrise simulation where the light gradually gets brighter over 20 to 40 minutes",
        "Sunset feature decreases light over 15 to 60 minutes",
        "Includes 20 brightness settings, 5 wake-up sounds, FM radio, and backup battery"
      ],
      "cons": [
        "Buttons aren't intuitive, so it can be a little confusing to program"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The clock light doesn't dim. At first I thought ...",
      "text": "The clock light doesn't dim. At first I thought that there was something wrong with the device but then I noticed that the brightness of the clock in all 4 brightness settings is very similar. I will have to put a sticker there.",
      "rating": 3.0,
      "verified": true,
      "author": "Anastasia Cabolova",
      "helpful_votes": 555,
      "publication_date": 20170202
    },
    {
      "title": "It’s really too bad because I really liked the clock/light before it started ...",
      "text": "Unfortunately, the Philips Wake-Up Light broke after two months. The light will no longer turn on and the menu selection turns off and on at random. I was also surprised to find the clock/light emitting a high pitched clicking sound which prompted me to unplug the electrical device for fear of a fire. It’s really too bad because I really liked the clock/light before it started to malfunction.",
      "rating": 1.0,
      "verified": true,
      "author": "Wintersday",
      "helpful_votes": 21,
      "publication_date": 20180316
    },
    {
      "title": "Defective Product",
      "text": "This product worked great for the first few months. About 6 weeks ago I noticed it making a clicking noise with the passing of every minute. It is the same noise that it makes when you're changing the time/settings/etc. A few times it has become \"possessed\" and makes the same clicking noise non-stop until it is unplugged from the wall. I've also had instances where the light will not turn on or off and again the only solution is to unplug it from the wall. Unfortunately, when looking to see how I can return the product I saw that the return window is past and I'm stuck with the defective product.",
      "rating": 1.0,
      "verified": true,
      "author": "Caitlin",
      "helpful_votes": 23,
      "publication_date": 20171009
    },
    {
      "title": "Was nice when it worked",
      "text": "After about 6 months, it decided to stop working. The warranty information listed with this product brings up a general list of product categories, not one specific for this item but it seems like it falls in a category with a 12 month warranty. I contacted Philips months ago and still no response.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Facteau",
      "helpful_votes": 14,
      "publication_date": 20170826
    },
    {
      "title": "Wake up light is great, interface is challenging (but worth it)",
      "text": "The slow wake-up light works beautifully. I no longer even need my audible alarm. This lamp helped me through the time change, which was the reason I bought it. My only gripe is the interface. It may look nice, but it is quite challenging to use. I have to look at the lamp every morning to make sure I am pressing the correct button to turn it off. On multiple occasions I have inadvertently touched the skin-sensitive buttons at the bottom. I wish these were physical buttons instead. But still, I give it 4 stars because I am MUCH happier waking up to this light than I have ever been to an audible alarm.",
      "rating": 4.0,
      "verified": true,
      "author": "OC",
      "helpful_votes": 8,
      "publication_date": 20170423
    },
    {
      "title": "Where have you been all my life",
      "text": "I really enjoy this clock. It really does allow me to sleep more soundly until the time I need to wake up. And I usually set the light to start coming on about 30min before the alarm. So it is easy to quickly tell how close you are to the alarm time without having to reposition to look at the clock. It is also pretty calming to wake up to. I really enjoy it. I purchased this 7 years ago and still going strong today.",
      "rating": 5.0,
      "verified": true,
      "author": "DoctorMasterBlaster",
      "helpful_votes": 2,
      "publication_date": 20200908
    },
    {
      "title": "Looks great, wish it could connect to the phone",
      "text": "My wife got a cheap version of the same alarm clock and loves it. I figured I would get one for myself too and I looked up the best one - this was it. I was extremely surprised and disappointed when I found out it cannot connect to your phone. I should have done more research on it beforehand, but I figured if her $40 version could be controlled and set via a phone app this $100 version most certainly could. This, unfortunately, was a deal-breaker for me. That being said, it was a very nice product, good sound quality, looks very sleek, and has an amazing light up feature.",
      "rating": 3.0,
      "verified": true,
      "author": "JP2",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Light Stopped Working After Less Than 1 Year",
      "text": "It is horrible that this didn't even last a year before it is going to have to go in the trash. The light doesn't come on anymore with the alarm, only the radio sounds do. I tried unplugging it, resetting it, changing the alarm I used - alarm 1 or 2. Nothing fixed it. This defeats the purpose of buying it - to help me get up early before the real sun is up. I need something more dependable than this. I am VERY disappointed since it was not cheap, very poor value and would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaclyn",
      "helpful_votes": 3,
      "publication_date": 20191010
    },
    {
      "title": "Broken after 2 months and 13 days",
      "text": "This alarms WAS amazing and worked as advertised... then, just over 2 months after buying it, it broke. Now it makes a weird ticking noise all the time. I don't know what happened, since I really haven't moved it or used it besides setting and turning off my alarm. I ignored the other reviews and bought it thinking it would not break for me. Boy was I wrong. Avoid this alarm.",
      "rating": 1.0,
      "verified": true,
      "author": "kimberly",
      "helpful_votes": 2,
      "publication_date": 20200818
    },
    {
      "title": "This clock does not keep time",
      "text": "It took me a while but I have recently discovered that this clock slowly loses time! At first I thought I had just set it improperly, but after setting it again twice (today will be the third time) I now am positive that it is the clock slowing down. This last time it lost about 6 minutes in about 3 weeks. Unacceptable. The least a clock can do is keep time. The speakers are also pretty tinny so the wakeup noises are not very enjoyable. The wakeup light is very nice.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190510
    },
    {
      "title": "Nothing Else Could Wake Me Up",
      "text": "I work long hours, starting my day at 4am. As long as you get decent sleep (for me, I need 6~8hrs), this light clock can get you up and out of bed stress free. On nights when I only had 2~6 hrs of sleep, this got me groggily out of bed when a normal alarm clock wouldn't have even stirred me at full volume. Clock face can be turned off for absolute darkness Audio can be turned on/off for wake up Doubles as a nice dimmable bedside lamp Minor annoyances: Clock full resets with power outage Alarm not programmable by day of week to accomodate a varied work schedule. Takes up as much deskspace as a traditional digital alarm clock.",
      "rating": 5.0,
      "verified": true,
      "author": "mikek",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "BUY IT!",
      "text": "I believe everyone should own one of these. They are life changing I’ve had mine for some time now (maybe over a year?) and I am so thankful all the time I have it. I literally stop and think how much I need it. Before this product, I would wake up so angry. I dislike winter. I dislike morning. I especially dislike dark morning winters. Now, I wake up a normal human. It’s a world of difference. I recommend this product all the time to family, co workers, and friends. One star off as side buttons are tough to use. Once you learn them you’re ok. But, they could have done a better job with that.",
      "rating": 4.0,
      "verified": true,
      "author": "AMAZONALEXA",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "WAKE ME UP INSIDE",
      "text": "I LOVE this thing. Its light helps me wake up before the sun is up and it will be perfect when I move into the basement during the winter time. But as other reviews have said, it's design is a mess. It's hard to figure out how to turn it off in the morning, the buttons are hard to see, ect. But for me personally the light makes up for the other glaring flaws.",
      "rating": 4.0,
      "verified": true,
      "author": "Chynna Miller",
      "helpful_votes": 2,
      "publication_date": 20200720
    },
    {
      "title": "Pretty awesome. The light can be BRIGHT",
      "text": "Pretty awesome. The light can be BRIGHT, if that's what you want, and it really does work. I took off a star though, because of the alarm tones. They are 5-second loops of nature sounds, some with an electronic music scale to boot. It's kind of annoying and I think it makes it easier for your brain to tune out. I can't believe it was too hard to load up 30 minutes of birds chirping over piano music, digital storage space these days costs peanuts. Maybe one of their other versions doesn't have that problem, but still, an overall good purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Henson",
      "helpful_votes": 0,
      "publication_date": 20181201
    },
    {
      "title": "life-altering purchase",
      "text": "I will never use my iPhone as an alarm clock again. I sleep with the shades closed and usually wake up at 10am, so this perfectly solves the problem of not being able to wake up to pleasing sunlight at an unnaturally late hour. The light is really powerful and works great as a reading lamp or just to get more light in the room during the day. The sound selection is awesome and has a lot of different sounds for people with different tastes. Very easy to program. Would recommend to anybody who has ever lived.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie Watkins",
      "helpful_votes": 3,
      "publication_date": 20180915
    },
    {
      "title": "Alarm turns itself off",
      "text": "Pros: Amazing sunrise simulation, most of the time thats enough to wake you up. Cons: - After 3 months my alarm will come on for 5 seconds in the morning then turn itself off - This is the worst interface for an alarm clock Ive ever seen. Overall: I'm 50/50 on wether this is worth it or not. Ive had two of these, the first one didnt have any of the alarm problems so - you may get lucky.",
      "rating": 3.0,
      "verified": true,
      "author": "Charles Sanders",
      "helpful_votes": 2,
      "publication_date": 20181101
    },
    {
      "title": "I was hesitant about the price..but I would say this is a quality product",
      "text": "This sunrise clock really grew on me. I had to adapt from waking up at 10:30am to 5:15am, and this clock has been a lifesaver! I was looking at cheaper options, but due to the more realistic light features, I decided to just go with the Philips brand. I am not disappointing, so I feel like it was money well spent! The only annoying thing is that there doesn't seem to be an easy way to turn off the alarm without disabling it completely..but that might be a user error thing on my end.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 3,
      "publication_date": 20180607
    },
    {
      "title": "Easy to use, very effective",
      "text": "This thing has made my mornings an order of magnitude easier and more pleasant. I used to have the absolute hardest time waking up in the morning. I'd sleep through four or five alarms and never know it. The light-based alarm system is perfect for me. I wake up gradually and naturally, so I'm not agitated. Most importantly, though, I actually WAKE UP. Your mileage may vary and everything, but this clock has actually changed my life, and that's pretty cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Lena",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "We really like this light but it got four stars from me",
      "text": "We really like this light but it got four stars from me. Overall is suits our needs, but for this review I'll get a little more detailed. Waking up to a combination of lighting and sounds is almost too comfortable. I think everyone should try it. Pros: The color transition from deep red to fully lit is natural. You can control how bright it gets. You have a host of options on alarm sounds and radio. It looks great by itself, which is saying something for a funky light. Cons: The speaker quality is not as good as I had hoped at this price point. It's too easy to bump a touch setting and not know what you changed.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Martin",
      "helpful_votes": 3,
      "publication_date": 20170612
    },
    {
      "title": "Really your only choice",
      "text": "There's this light and there's everything else. And this one is far superior to the cheaper, mostly garbage, you'll find. Is it perfect? No. The top buttons aren't labeled in a way you can easily see them so you have to feel around and remember where each one is. And the touch buttons on the front aren't labeled well either and you have to hold the unit as you press them otherwise you push it around your bedside table. Still, this is the light alarm clock you are looking for. The light is great, the gradual wake is great, the sleep timer is great, and the unit doesn't feel like it will fall apart if you look at it wrong.",
      "rating": 4.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "i love this alarm light",
      "text": "i love this alarm light, it comes on with this orange/red to simulate the sunrise and slowly gets a lighter and brighter color, this makes waking up so much better and much more gradual instead of a sudden alarm going off when its still dark and shocking you awake, i wish i would have had this along time ago",
      "rating": 5.0,
      "verified": true,
      "author": "greene",
      "helpful_votes": 3,
      "publication_date": 20170405
    },
    {
      "title": "Should be 5 star if not for the ocean alarm...",
      "text": "Honestly, overall this product is great. I’ve been using it for about 2 months now and I really like it. It has helped me wake up easier in the AM and I really do feel more awake/alert/energized The only problem I have with it is the ocean/wave crashing alarm tone. One of the main reasons I bought it was for that specific tone. Unfortunately, for some reason that tone has the sound of the waves crashing more in the background and the very loud annoying sound of seagulls in the foreground... They really sound terrible... Almost like donkeys... For that reason and that reason alone, I give it 4 stars instead of 5.",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Not easy to setup, but it works",
      "text": "It was a struggle to configure the alarm correctly, and I don't like that to turn off the alarm in the morning I'm turning off the schedule too (and have to turn it back on so it wakes me up the next day) Also, this could have been designed better so that you can turn off both the light and the sound but you have to click 2 different buttons. It is nice and bight though and I often find myself waking up a few minutes before the sound goes off (the light starts to come up 30 min prior and gets brighter over that 30 min period)",
      "rating": 4.0,
      "verified": true,
      "author": "Natv",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Super, works excellent and saved our marriage",
      "text": "Christmas gift for hubby who could never get up to a alarm, he had three alarms and could still sleep through them, I however couldn’t. He actually wakes up to this! Miracles of miracles, saved him from getting smacked in the head with a pillow if I had to hear all the alarms going off, he would let them go on and on and on, I would be up and out of bed sometimes early so I didn’t have to punish myself.lol. Must buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20180129
    },
    {
      "title": "Light helps in waking up better.  No battery backup, difficult to program.",
      "text": "Other reviewers have said enough. Read the negative reviews first to get the real scoop. Yes, light function works well, but it is worrying that it does not have a battery backup. If there is a power outage in the night and came back again, it would have lost the clock time and will not sound alarm. Several function buttons are on the rim of the light and hard to see. Every morning it is a circus to use the buttons. For such an expensive alarm clock, they should have done better job on design and battery backup (or at least auto setting clock).",
      "rating": 3.0,
      "verified": true,
      "author": "Ram",
      "helpful_votes": 3,
      "publication_date": 20161222
    },
    {
      "title": "Easily the best purchase I ever made",
      "text": "This thing does wonders for my mood and my daily sleep schedule. I have it set to silent. When I bought it, I kept my old alarm clock (a standard clang-clang-clang piece) as a backup. I think in the past year since I bought this product, I have only heard my old clock's clang-clang-clang perhaps four times. Needless to say this clock works wonders for reducing anxiety and making mornings more pleasant.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "It's attractive, moderately easy to use, and it wakes up my 9-yr-old",
      "text": "It's Philips and it seems to be high-quality. But, seriously -- it's overly complex to set up and use, and the buttons you will use everyday are small and hard to find. Philips -- how about an app? How about controls on the front of the unit? I got this for a kid who has trouble waking up. Tomorrow is Day 1. I'll let you know how it goes. UPDATE: The clock was relatively easy to set up, and it works reliably. Most important: It wakes up my very-hard-to-wake-up son. Our mornings are much easier! Before, it took a parent -- or two -- 15-20 minutes to wake him.",
      "rating": 4.0,
      "verified": true,
      "author": "C. J. G.",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Loved it for 2 years but very expensive clock has stopped working.  Sad quality Philips!",
      "text": "Loved this clock for its wakeup light and soft bird sounds. Clock is not even 3 years old and has started doing strange things like not activating at the right time, turning off the light before the wake time, and then starting the bird sounds after the wake time. The clock has not been mistreated at all. I'm guessing the problem is a cold solder joint somewhere on the PC board or other quality issue. Really sad to spend this much on an alarm clock and not even have it last for 3 years. Poor quality by Philips!",
      "rating": 2.0,
      "verified": true,
      "author": "MGoBlueBob",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "This thing seemed pretty expensive at first",
      "text": "This thing seemed pretty expensive at first, but it has totally transformed my morning routine. I wake up with a smile on my face instead of a desire to murder my annoying alarm clock. Instead of being jerked awake by a horrible sound, I'm slowly drawn from my dreams with the soft light and the eventual sound of birds chirping - even when it is still pitch dark outside. A total game changer for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Lyman",
      "helpful_votes": 3,
      "publication_date": 20170210
    },
    {
      "title": "Really like this alarm",
      "text": "There was a noticeable difference in ease of waking up during winter months once I got this alarm. The slow brightening of the room really does help me wake up more naturally and less violently angry at the world than I used to. I have no trouble telling the buttons apart like some have said, there are little raised bumps to help find them. My only complaint is that it's easy to accidentally roll off its base (and potentially off your night stand). Also would be nice to have some more alarm sounds but otherwise I really love this thing.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelsey",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Love the sunrise for a natural wake up!",
      "text": "Wow, this is the nicest way to wake up! I absolutely love it! It was easy to set up, I never even opened the guide/manual. The way the sunrises to wake me up is so natural and the birds chirping right at th alarm time is also NOT annoying. The volume can be turned down super low on the alarm (birds chirping in my case) and it sounds real. The sunrise usually wakes me up naturally though. Such a pleasant way to wake up! I feel so much better, starting my day this way. Also the display for time can be dimmed super low, for those that need a dark room. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "California Girl",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Malfunctions after 18 months of regular use",
      "text": "I loved this product for many months, but it has just started to malfunction unexplainably. I set the time, set my alarm and go to sleep. Wake up light turns on at appropriate time for first alarm, but then it re-sets the clock to 12am and just blinks until I can re-set it again. This means it does not work for the second alarm I have set, and it's very inconvenient to have to set the clock all over again every time it re-sets itself. I am disappointed in this malfunction.",
      "rating": 2.0,
      "verified": true,
      "author": "Courtney Deakle",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "The best.",
      "text": "My two-year warranty expired and it still works perfectly. With time it’s been a great help waking up. I use it along with my cellphone’s alarm because I prefer a custom tone. I also use it for reading because I can adjust it to the right brightness. After this whole time using it my only critique is the following: • Even when I choose the alarm without a tone I still have the bird icon appearing and waiting to be turned off. I can’t forget to mention that it has also withstand a lot of power outtages. Thank you, Philips.",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick Rosa",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Wake up naturally (as long as there's no power cut overnight).",
      "text": "The Philips HF3520 Wake-Up Light has definitely made my morning wake-up ritual more pleasant and natural. My one criticism is that the clock has no built-in backup battery, so that you have to reset it manually after a power failure, and may miss your wake-up time. In some places that's not something you'd worry about very often, but where I live there are frequent power cuts. I think a backup battery should be a standard feature in a device that costs over one hundred dollars.",
      "rating": 3.0,
      "verified": true,
      "author": "Arend Van Dorp",
      "helpful_votes": 7,
      "publication_date": 20151013
    },
    {
      "title": "The one to buy",
      "text": "I looked through a ton of these alarms and researched trying to get the right one. I finally got this one even though it’s more than other types and I am so glad. Easy to use and clear directions. I did a test run once it came in and adjusted the light so it wasn’t too bright. I do always have a backup loud alarm on my phone to ease anxiety, but I never need it. This wakes me up gently and I feel more rested and calm in the mornings. Does not effect my boyfriend on the other side of the bed which is nice since I’m up an hour earlier",
      "rating": 5.0,
      "verified": true,
      "author": "Katie Dibble",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Worked for 3 years, then died",
      "text": "I loved my wake up light. Never used the sound, just light for a gentle awakening at 5am each morning. After just 3 years, it died and now refuses to turn on. There were warning signs for months, as I would have to unplug it and plug it back in from time to time to get it to stay on. Although I'm not happy, I will be buying another one, because I've become accustomed to it and can't live without it.",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 2,
      "publication_date": 20190915
    },
    {
      "title": "Not Recommended",
      "text": "I loved this alarm clock for almost 4 years, then it abruptly stopped working. Yesterday the buttons were completely unresponsive. I unplugged it to try to \"reset\" whatever was causing trouble and after plugging it back in, no lights, no clock. I read the reviews that said it's not repairable in any way but I bought it in spite of that. But now that mine actually died, I can't recommend this in good faith. There's just too much plastic/electronics waste in this device to recommend for anyone to buy, given that it can fail so completely. I'm off to seek a new solution....",
      "rating": 2.0,
      "verified": true,
      "author": "superwesman",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "The best alarm clock in the world",
      "text": "The main advantage of this over other alarms is in how you wake up. I wake up w/ more energy & feeling more relaxed than the typical silent then blaring alarm. I'm fairly sure this is because it helps people wake up slower. The light hue is very similar to a sunrise from dim to bright. The radio is clear and the reception is good. It doesn't have very much bass but that's to be expected in a radio this size.",
      "rating": 5.0,
      "verified": true,
      "author": "VortextuaL",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Great purchase. Great gift. Worth the cost.",
      "text": "I’ve had this for 4 years now, and the light is still going strong (I’ll use it for hours a day). I set the alarm to silent and just use the light to wake up. It is a must have now. Waking up (especially during the dark winter mornings) is SO much easier with this thing. Much less jarring. Your body feels like it naturally woke up, not like it was surprised by some loud alarm. I point it at the wall to bounce more light into the room. Can’t say enough good things about this product. It would be a great gift for a college student! But anyone really will love this gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Amazing Alarm Clock",
      "text": "Ever since I got this alarm, I'm still a night owl and the mornings are still hard, but it's been making waking up easier. It makes a HUGE difference to actually wake up to light and not the dark. It is almost completely blacked out while sleeping so it doesn't bother me to sleep next to. I also love the night light that I can easily turn on the lamp on and off. I can dim it so low that the light feels natural closer to fire than the light from your phone so it's better for your health and eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Works for me",
      "text": "This product definitely works for me. Waking up feels much more natural with it. I don’t have experience with any other brands or models, but I am definitely happy with this Phillips SmartSleep. The only con is that setting up an alarm is not the most intuitive, so whenever I want to change it, I have to look it up on the instruction manual. Because of this I keep the manual under the lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "emcee",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "It's ok, I guess",
      "text": "Lazy as **** for 30 years; can finally get up at five every morning. I don't feel tired all day, I'm less grouchy, I take a nice brisk walk, get coffee, pick up lunch, and roll into work with a half hour to spare. Changed my life, kind of, so I suppose it was a good purchase. Kind of pricey though, for a glow-in-the-dark egg.",
      "rating": 5.0,
      "verified": true,
      "author": "Your mom",
      "helpful_votes": 4,
      "publication_date": 20160728
    },
    {
      "title": "Perfect for seasonal affective disorder!",
      "text": "I suffer from seasonal affective disorder and after a particularly rough year was not looking forward to winter depression. I bought this in the hope that I can give myself sunlight every day, regardless of the actual weather. It's already been a life-changer. I wake up earlier and in a better mood. It *is* annoying that it needs to be plugged in, so I often need to reset everything if I forget and turn off the outlet switch. However, the amazing effects outweigh a small inconvenience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170913
    },
    {
      "title": "Color simulation is worth the extra cost",
      "text": "Yes it’s a little hard to figure out the settings, but once you figure it out it’s not bad. It is hard to find the buttons in the dark, but I still love the product. The color simulator is totally worth it!! I also like how I can set the brightness because 20 is really too bright for me, so I turned my down to 10. Perfect. I love that the light starts early, I feel like it allows me to wake up when at a good time in my sleep pattern, when my body is ready.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Works great",
      "text": "It sure makes a difference getting up with the light as opposed to waking in pitch dark. I still wake up tired so no change there, but psychologically, So don't expect to wake up energized. This isn't a miracle lamp. It is really hard to get up in the dark and then your eyes hurt trying to adjust to the light you just turned on. With the wake-up light, by the time my alarm goes off, the light is at full brightness and my eyes do not need to adjust to the brightness.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Falise",
      "helpful_votes": 2,
      "publication_date": 20171225
    },
    {
      "title": "Zombie Seagulls.",
      "text": "I love everything about this clock...except the alarm sounds. My husband thought the seagulls was the sound of people screaming (seriously). To me, they sound like zombie seagulls. Everything else is wonderful, though, and I highly recommend this clock (just use your phone for an alarm sound).",
      "rating": 4.0,
      "verified": true,
      "author": "leiluni",
      "helpful_votes": 3,
      "publication_date": 20170826
    },
    {
      "title": "No more heart stopping alarms",
      "text": "Living in the far north we have steadily declining daylight hours October - December. It's pitch black but we have to get up and function. This new clock that I've had for about a week allows my brain to have a set time for brightness and gentle birdsong that is a whole lot better than the spine shaking alarms of my phone. Sunrise for me is always 6 am and I don't start the day jarred awake....rather I have sunrise and birdsong. Just like summer. Really happy with this clock.",
      "rating": 5.0,
      "verified": true,
      "author": "GrandmaTheGrey",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Soothing for humans and dogs",
      "text": "I got this product to see if it would work to both relax me before bed and gently wake me up. I have had it for a year and it has worked well. As an added bonus, my dog seems to really enjoy the sunset and will settle in her bed so that she can face the lights until they fully dim before curling up to sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol T",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Works great. Menu settings seem to have everything I need ...",
      "text": "Works great. Menu settings seem to have everything I need as far as alarm settings and sound options go. The brightness of the bulb is good for waking me up. The only critique I have is that the top buttons could be defined more so you can more easily see what your pressing. They are all flat and do not have any differing textures and since they are on the top and due to the curve of the unit, it makes it difficult to tell what you're pressing - especially at night when its darker in the room.",
      "rating": 4.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Big disappointment for Christmas",
      "text": "I bought this item for Christmas gift and you can imagine how we felt on the day of Christmas when the clock turned out to be defective. Display did not respond to any of the buttons on main bulb screen and above on the brim. No digits and no menu icons appear. I have requested the immediate money return and will see how Amazon and Philips respond to that kind of situation. It's very sad to me because previously I've always received products of high quality from Amazon so I didn't even check the item before presenting it to my family member. My trust to Amazon was that high.",
      "rating": 1.0,
      "verified": true,
      "author": "vadko",
      "helpful_votes": 3,
      "publication_date": 20181229
    },
    {
      "title": "Quality product but cost isn't justified over similar alarms with wake-up lights",
      "text": "Works well, as expected. I thought it would be a bit brighter though. I upgraded to this from a cheaper similar model (+/- $30) thinking it would be a lot better. The dual alarms are appreciated and the overall quality and FM radio reception are all better but not really worth the $70 premium over some of the knock-offs. I've also read that the light bulb is not able to be replaced so if it ever goes out....that's it, I'm out $100+.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "An alarm for those who miss the days of programming a VCR",
      "text": "The once a year showing of Thriller...Tigers vs. Padres 1984, game 5...that *very special* episode of Different Strokes. All of these needed to be watched and watched again, and if you were lucky enough to have an engineer in the family, your VCR could be programmed to record them. This alarm brings back that love of your nerdy Dad with settings not done in English, but with a re-discovered set of hieroglyphs. If the alarm does go off...and you never really know if it will...you will be rewarded for your effort with a pleasant feeling, like that time you found the VHS that Dad thought no one knew about...",
      "rating": 2.0,
      "verified": true,
      "author": "Ian Langmore",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Wonderful alarm clock with a couple of minor issues",
      "text": "I've been using this for two days now, and I love it! I wake up feeling refreshed, and not terrified (like I used to with a loud alarm clock). I find that it helps to set the alarm for a bit earlier than you want, because it feels so good to lie in a nice warm bed and feel the light on your face :-) I have to deduct a star, though, because there's no battery backup (so, if the power goes out, you'll need a secondary alarm clock), and because even on the dimmest setting, the clock portion is just sliiiightly too bright at night.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven L. Smith",
      "helpful_votes": 0,
      "publication_date": 20161024
    },
    {
      "title": "This product will change your life!!",
      "text": "I have never been a morning person, but have always had to get up early for work. Waking up to a screeching alarm is such an unpleasant way to start the day. With this product, I wake up feeling good. If my lamp every breaks, I will order a new one the same day. I'm usually pretty cheap and looked at alternatives for a long time before I purchased this alarm. It is seriously worth every penny, if you buy it you will not regret it!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex White",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Best upgrade to my morning routine",
      "text": "I bought this during a very stressful couple months at work. It wasn't that I had trouble waking it, it's that I was tired of waking up angry. I bought this along with a load of daylight spectrum LEDs to swap out all the crappy soft white lighting in my house. I've been using this alarm for over a year and I still love it. I usually wake up to the light, before the sound starts, and that's just lovely. The bird noises are impressively real. Sometimes I think my alarm has gone off, but it's the birds outside. LOL.",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Snooze function is too sensitive",
      "text": "I'm not so sure this is worth it. The alarm goes off and it's just a light on in my room. I do appreciate you can dim the time to be essentially off as I don't like any light while sleeping. However, my biggest gripe is the snooze function. It's bizarrely sensitive. It'll snooze if I place something on the nightstand or even if my cat jumps off the bed. I reached out to Amazon thinking there was something wrong with it. They sent a replacement and the same thing keeps happening. For an alarm clock over $100, I don't think my cat jumping off the bed should be able to snooze the alarm.",
      "rating": 3.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Need a PHD to Program It",
      "text": "The Good... Waking to light and the sounds is a nice experience. The sound quality is exceptional. The Bad... Instructions are worthless, they give pictures vs written words, the settings in the clock are almost unreadable, and it tps over very easily when you touch it. Bottom Line... It's going to be returned because i cant figure out out to program it easily and I\"m a technology guy.",
      "rating": 3.0,
      "verified": true,
      "author": "tom pate",
      "helpful_votes": 2,
      "publication_date": 20181206
    },
    {
      "title": "Some majore design flaws",
      "text": "Good idea and works well in principle but has some major design flaws. The buttons are ridiculously small and the labels are invisible from the front. The clock display can be dimmed but can not be turned off completely. Also, I would love to have the option to dim the light some more. The lamp can obviously do that when simulating sunris/sunset, but the lowest light setting I can choose manually (1 out of 20) is already pretty darn bright. Not suitable as a night light. And the menu is very unintuitive.",
      "rating": 3.0,
      "verified": true,
      "author": "Brainslug",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Don't recommend spending the money",
      "text": "Not worth the money. Alarm has failed to go off or failed to go off at the correct time MANY times. Often the alarm sound will come on at full volume instead of a gradual wake me up. Don't recommend spending the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 5,
      "publication_date": 20171026
    },
    {
      "title": "WORKED SO WELL...until it didn’t",
      "text": "Ya know, this alarm is hella expensive. So I thought it would give me at least 5 years! But no, for such a reputable company - I’m sad to report that this alarm clock died at 1 year an 11 months. A simple light clock that did the job. Since it died so quick for its price - I knocked it down to 1 Star.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20191114
    },
    {
      "title": "Alarm Stopped Working After 1 Year",
      "text": "The clock looks really nice and I really liked it at first. However, the alarm stopped working after about a year. The light still turns on when the alarm is scheduled to go off, but neither the radio nor alarm sounds work. It is rather large and takes up a lot of space on my nightstand. It also doesn't have a USB charger, or ability to play mp3s. You have a choice of the radio or built-in nature sounds.",
      "rating": 2.0,
      "verified": true,
      "author": "Wynn K.",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Expensive but worth it if you need it",
      "text": "I got this when I was living in a small shoe box of a room in NYC with no window. It was really hard for me to wake up because I had no sense of the time because there was no window! It was awful but this clock really helped me out. I haven't really used it sense I moved out of there, but would use it again in a heartbeat if I needed to wake up regularly prior to the sunrise or, God forbid, I live in another room without a window again.",
      "rating": 5.0,
      "verified": true,
      "author": "Sophia M.",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Greate for people with depression",
      "text": "I feel like it eases you into the morning. you can save two alarms on it that you can turn off or on by a click of one button (2 buttons, one for each alarm saved). that also means you can only have two alarms in the morning. Honestly, I use it with no volume, full brightness, about half an hour before I want to wake up. Then I set an alarm on my phone with low volume on the time I want to wake up. THEN another phone alarm on high volume on the time that I HAVE to leave. This is my way to guarantee that I will wake up, while removing loud unnecessary annoyance in the mornings.",
      "rating": 5.0,
      "verified": true,
      "author": "Boruj",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Interesting concept, but some issues",
      "text": "The sunlight idea is great (and that's why I got it), the way you snooze (by tapping) is terrific, but does anyone else have issues with setting the alarm or trying to change the radio station? Just seems very archaic and hard to use. Very surprising considering the price of the product. If they at least had a remote it might be easier to use the product.",
      "rating": 2.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "My Alarm Clock for the Past 6 Years",
      "text": "Roses: - Bright - Soothing - Great wake up sound options -Makes waking up in winter a little easier Thorns: - There are only 5 sounds, they get old and the only other option is the radio",
      "rating": 5.0,
      "verified": true,
      "author": "Jake Dermer",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Best. Alarm clock. Ever.",
      "text": "This will literally change your life. You know that bleary, groggy, groaning feeling when your alarm clock goes off? I haven't had that since using this. In fact, I've only actually needed the sound a handful of times to wake up. I wake up feeling naturally awake. Never groggy. It's wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Konrad Mark",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great Purchase",
      "text": "I had previously tried a day light to help with my Seasonal Affective Disorder, but found myself not feeling depressed in the winter anymore, just having a difficult time waking up. I decided to give this a try and it has been wonderful. In the winter if I don't wake up to this alarm I am usually much more tired throughout the day and have a hard time waking up, but when I'm slowly awakened by the light I get up much quicker and feel more refreshed. I have had this for about a year now and I am still very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Stefanie Davis",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Definitely worth the money! I saw a change in my mood and energy in just 3 days!",
      "text": "This was actually a splurge buy after I got a credit card, which I pretty much regret! :) But this light was definitely worth it. After just 3 days, I noticed I had so much more energy and felt better. It was kind of hard to figure out at the beginning, especially when I kept bumping it, but you get used to it after a couple of days. There are so many different settings and levels of light. You can change pretty much anything on this clock. It also doesn't clear out if you accidentally unplug it or have to move it. I just wish my dog wouldn't wake me up when the light starts up!",
      "rating": 5.0,
      "verified": true,
      "author": "Britney Sexton",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Non-stop Clicking Noise",
      "text": "I liked it in concept, and it was working pretty well for a time. The light was easy to adjust and it was refreshing to wake up to. However recently with no rhyme or reason, the clock will randomly make the 'tick' noise that should only sound when you hit the on-screen buttons. I've had to resort to just leaving it permanently unplugged because it will randomly start making the noise and it won't stop. It's actually quite creepy, especially at night. I've come home from work and the clock has been making the noise for who knows how long. Not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Wendi",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "which I loved and ended up in my daughter's room",
      "text": "I had an earlier version of the Philips wake-up light, which I loved and ended up in my daughter's room. It is still going strong after five years. When I looked for a replacement, that version was no longer available and I was a bit skeptical about this one. I still don't love the shape as much and it is quite large. But it works as well as the previous one and has some additional features that I appreciate (two alarm settings, sunrise simulation, the ability to choose not to have any alarm sound, the 24-hour clock). All in all, I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170412
    },
    {
      "title": "Was great at first.",
      "text": "Another update: It simply stopped working. Plug it in and nothing. Update: I've had this wake up light for a couple months. I still LOVE it! Not a single problem nor complaint! This wake up light is so wonderful. I loathe being startled awake (which my morning person partner has done for the past 3+ years). I woke us ungrumpy today! This thing is nice and heavy. The light is so pretty. Just like the sunrise. I just got this yesterday to replace a cheap one from another company (which stopped working after a week). It was around 20.00. This one was about 104.00. So worth it!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Brain_Sick_Monkey",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Not great",
      "text": "I don’t care for this clock, it’s not cheap and the programming the time and radio and alarm is SO CONFUSING, in fact it’s in the top of my closet for this reason. I wouldn’t buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "TG",
      "helpful_votes": 2,
      "publication_date": 20190517
    },
    {
      "title": "One year in, light failed, no customer support.",
      "text": "After nearly one year on the clock from purchase (pun intended), the wake-up feature stopped functioning properly. I attempted to call the numbers for technical support five times, and each time I was disconnected. As the alarm continues its progression towards full brightness, when the desired alarm time occurs, the light turns off. The alarm still acts normally apart from this. The lamp is still able to go to full brightness outside of the alarm settings. I am attempting to reset the clock, and I have had absolutely no support trying to do so. Will update review as this progresses.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Perfect way to wake up!",
      "text": "I love this Wake up Light Alarm clock. I wanted to stop using my phone for an alarm..I wake up every morning to the light coming on and don't even need the soothing music that comes on after...the light is a perfect tone, very soothing, it gradually lights up just before the time you have set the alarm for. The settings feature takes some getting used to, no different than any alarm clock and easy to manuever once you get the hang of it. Love the ability to set how bright the light is, the multiple options for wake sound (all soothing) and the fact that it is also a bedside light.",
      "rating": 5.0,
      "verified": true,
      "author": "hollandnjs",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Surprisingly amazing",
      "text": "Went into this thinking there was a 90% chance this was an overpriced gimmick. I was wrong! This is a great lamp and even better way to wake up in the morning. Actually makes it a lot easier to wake up and go to bed at the right time. Only complaints are that it’s hard to navigate the outer rim buttons in the dark (not very easy to “find” with your fingers since they blend in to the surface of the product) and the odd, burning plastic smell that it emits while the new lamp is breaking in. It was casually really intense, it went away after. about a week of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hanna Huffman",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Like the transition of light",
      "text": "As I prep for bed, it is nice to have the light slowly dim. It is now a part of my routine prior to sleeping. I like the light in the morning. I need to sleep in complete darkness, which doesn't afford me the opportunity to wake with the sun due to heavy window coverings. Really nice alarm with gentle sounds that get louder. The snooze is cool also. I don't need to look for a button; just tap the front of the light.",
      "rating": 4.0,
      "verified": true,
      "author": "TBates",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "LOVE THIS! I'm no longer grumpy in the morning.",
      "text": "I use this everyday! It's so nice not having to wake up to that annoying buzzer in the morning. gently waking up with the light has made me less grumpy in the morning and ready to start my day. Easy set up, easy to use for any age person. Also great for a bed side light when reading a book in bed. Only thing i really didn't like is the \"squawking seagulls\" for the sound it makes for the wake up audio, I wish they would have done something difference. all and all in the end I really do love this and super glad i got it :)",
      "rating": 4.0,
      "verified": true,
      "author": "Matt C.",
      "helpful_votes": 2,
      "publication_date": 20171213
    },
    {
      "title": "The gradual, simulated sunrise allows waking to be natural and not jarring!",
      "text": "This wonderful circle of light has been amazing! My days have started out better with naturally waking up to a simulated sunrise (not getting jarred awake) and even falling asleep more easily with a sunset. I gave it 4 stars because the user interface has been tricky to get used to. I’ve had to keep the manual nearby for correct settings. Otherwise, I have been very happy with it and will get used to the settings in no time.",
      "rating": 4.0,
      "verified": true,
      "author": "Lindy",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "5 years and still use it every morning",
      "text": "I bought this when I got to college because I am NOT a morning person. 5 years and I still use it every morning. In college, I got an attachable nightstand (basically a shelf that hooks onto the bed frame) and had the alarm set to max brightness. Every morning I had a flashlight directly pointed at my face. The clock illuminates gradually, so it wasn’t startling/uncomfortable. Also, it pointed away from my roommate and at me, so it didn’t bother her. Great gift for anybody leaving the nest.",
      "rating": 5.0,
      "verified": true,
      "author": "Graciela Marez",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Feel great in the morning",
      "text": "This is amazing. I don’t care about the buttons around the rim, you get to know where they are like a watch or anything. Not sure about the backup battery, didn’t see anything in the manual. I feel the best I have except for waking up naturally in a long time. I’d like a travel option, this is so awesome. I like the night time function as well and FM radio should be around for awhile. It’s user interaction for set up (alarm, time) is smooth and good product design. Is it worth $100? If you can skip that cup of coffee because you feel so great, it pays for itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Gordon",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "I am sold on this.",
      "text": "Just wanted a plain alarm clock but decided to step it up a bit. Great product. It's in the bedroom. First thing I turn on when I get there. Keep this on sunset because the color is so calming and helps to de-stress. Wake up on the ràinforest option. Excellent tone on the radio, excellent visual from the light effects. Easy to program - if you can figure out a cellphone you can program this. I read the instructions but decided to piddle around with it and was able to figure it out. Wished the sunset was a richer color. Recommend. 💖 💖 💖 💖 💖",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "It's a cool product, in theory",
      "text": "It's a cool product, in theory, but underwhelming in reality. Yes, the way it wakes you up is far less jarring and unpleasant than a traditional beeping alarm, I suppose, but any illusions that it's going to dramatically change the way you sleep, wake up, or feel in the morning are overblown. Its limited, repetitive selection of wake-up sounds can be more annoying than soothing. And it's pretty massive - a bit more of an eyesore on my bedside table than I'd expected.",
      "rating": 3.0,
      "verified": true,
      "author": "a_will",
      "helpful_votes": 2,
      "publication_date": 20170820
    },
    {
      "title": "Actually really impressed.",
      "text": "Normally I really don't bother to write reviews. Although I felt compelled with this wake up light. Before I got this wake up light, I had two alarms in two different apps set on my phone. I had the worlds loudest alarm clock set as well and I still struggled to get out of bed. This wake up light is fantastic. I thought to myself that I'm insane for spending $100+ on an alarm clock. I also thought it was all a bunch of malarkey at first but I have to admit I'm impressed. I actually wake up and I don't feel exhausted. I'm super glad that I bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Yetzer",
      "helpful_votes": 2,
      "publication_date": 20170413
    },
    {
      "title": "Sound/Snooze Doesn't Work - Waste of Money!",
      "text": "This is so NOT worth the money that I'd give it zero stars if I could. The alarm's sound keeps turning off in less than a minute after going off! I'm a very heavy sleeper, and I don't wake up after 30 seconds worth of sound. I tried resetting it, moving it to a different spot in the room, changing from pre-built sounds to radio and vice versa, and even exchanged it. However, it still doesn't work. Philips' customer service was TERRIBLE and absolutely impossible to deal with, which made this an even larger waste of money. Save your money and your time by not buying this product. 0/10 don't recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashleigh",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Stopped working properly right outside of warranty",
      "text": "We really liked it while it worked. Unfortunately, after having it about a year and 3 weeks it got faulty. It slowly gets bright over the 20 minutes but when the sound part of the alarm starts, the light shuts off. I've also had more than one morning where the buttons don't respond when trying to snooze or turn off the alarm. A lot of the negative reviews mention that it conveniently stops working right outside of the warranty. I won't be buying another Philips sunrise alarm clock to replace this one.",
      "rating": 2.0,
      "verified": true,
      "author": "Andrea Guzman",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "too complicated with little buttons",
      "text": "I agree with other reviews. The buttons are simply non-intuitive, and it becomes a problem to set the alarm, adjust the alarm, and turn it on and off. It is the most expensive model, and I do not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181226
    },
    {
      "title": "AMAZING",
      "text": "I can’t even begin to explain how wonderful this clock is. I have a HORRIBLE time falling asleep and waking up. The sunset sleep setting and sunrise alarm with the birds somehow makes me wake up fully. I used to be groggy all day - like when you nap a little too long and wake up foggy and disoriented. I’ve tried herbal supplements to help me fall asleep, herbal energy remedies to help me through the day, but NOTHING has ever worked as well as this clock. AMAZING.",
      "rating": 5.0,
      "verified": true,
      "author": "MsBellie",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "How did I live before this???",
      "text": "I have never felt great upon being woken up before this. Literally. I have always had such a hard time getting out of bed each morning, but getting sunrise clock is a huge game changer. I love how customizable it is, that it has the option to have two alarms, and the fact that it is a gradual warm-tone light. It feels so great to wake up to. Can’t reccomm this enough. ALSO my cat loves listening to the bird alarm sound. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Aimee Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Glad I bought this",
      "text": "I've had this for maybe a year now, and I love it. I can't say I actually wake up on time now, but I really do like how the light gradually comes on. It's very easy to use, even when you're mostly asleep and just trying to hit snooze. My favorite use for it is how I can easily (with the press of one button) turn on the light, and it will gradually fade to darkness, helping me fall asleep more easily. I would purchase this again.",
      "rating": 5.0,
      "verified": true,
      "author": "fuzzybird",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Survives a short power outage",
      "text": "This works as described. Once you get used to the location of the buttons, it is easy to use and set. I really enjoy the sunset feature - helps me fall asleep. Others complained that the alarm clock does not survive a power outage. I unplugged mine, moved it to a different area in the room, and when I plugged it back in all the settings remained intact. The light is very bright and can illuminate our entire master bedroom. I don't need to be facing the light to wake before the alarm sounds begin sounding.",
      "rating": 4.0,
      "verified": true,
      "author": "lauracocoa",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Nice way to wake up but could use some design tweaks",
      "text": "So I’ve been using this for about 3 months. Had hoped it would make getting up early a little easier but if you aren’t a morning person ...you aren’t a morning person. But MUCH nicer than waking up to an annoying alarm! My main reason for not giving 5 stars are the buttons are awkward and I still struggle to feel my way around which is which. Plan to put something with texture on the key ones so I can find easier.",
      "rating": 4.0,
      "verified": true,
      "author": "C. Grant",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Happy Mornings",
      "text": "Best. Thing. Ever. Did not find it difficult to program. You do have to be diligent at remembering to set it at night, had two rude awakening mornings where I had forgotten before I got it into my brain to reset every night. Really is quite pleasant to wake up to. Usually I am awake and ready to go before the birdies start chirping on it. Get this! You won't regret it. One of my favorite \"little things\" in my life.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Good extra features but lacking an important one",
      "text": "It makes getting up in the mornings better for me. The alarm sounds are soothing and the gradual sunrise option is great. What is lacking and the reason y dropped 2 stars is that in the event of a surge or power failure it just resets just like the microwave clock or other appliance. For the price I'm paying I would expect to have a battery backup as many wake up alarm clocks have. This makes me have to set up a second alarm on my phone on for just in case the Phillips one doesn't go off and kind of of breaks its purpose. I will continue using it but that for me is almost a deal breaker.",
      "rating": 3.0,
      "verified": true,
      "author": "Vic",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "Wish I got one long ago",
      "text": "9/10 times it wakes me up in a slow and steady fashion like having the sunrise slowly though the window. It’s far superior than a simple audible alarm and I don’t think I’ll ever go back.",
      "rating": 5.0,
      "verified": true,
      "author": "coupfatal",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Expensive and flawed, but the sunset feature is super-relaxing",
      "text": "I bought this clock for the gradual wake-up lighting, but the sunset feature is what I love the most about it. That gradual fading out of warm light knocks me out in 15 minutes flat. It's not perfect - the button layout isn't great, it's expensive, it apparently doesn't automatically update itself to account for daylight saving time (what the hell, Philips?! Even my $20 Sony alarm clock did that...) and it has a tendency to roll over if you give it a good bump, but given how much it helps me fall asleep I have no regrets. It might be worth taking a chance on a cheaper knock-off, but I really like this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "More features, please!!",
      "text": "I have a hard time giving this even 4-star, because it's missing basic features you can find on any digital alarm clock for $10 at Walmart -- recurring daily alarms (you have to turn this on each time you want the alarm); auto daylight savings time; battery backup for power outages; etc. But otherwise, the clock works great. My wife loves the bird chirping for wakeup, and I've really noticed my ability to wake up easier in the morning -- something I didn't get from their previous model that didn't have the red hue. So, for the price, it's missing basic features that would easily have made this a 5-star.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew Kleinberg",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Finally An Alarm Clock Built the Right Way",
      "text": "This clock is great. I usually wake up on my own anyway, but have always had an alarm clock just in case. I hate the shock of the traditional clock radio alarm on those \"just in case\" days. With this new clock, it starts to turn on in a low powered orange color like the early sun and within a half hour is full bright yellow like the sun. It happens slowly and smoothly. There is no shock (if you leave the radio off like me). This is the way our ancestors woke but with the real sun. Something seems very right about this. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 2,
      "publication_date": 20160515
    },
    {
      "title": "Product doesn't last long.  1.5 years and stopped working.",
      "text": "Great concept, broke after 1.5 years. Too expensive for the length of time it lasts. If it would have lasted longer I would have given full star review. Disappoint to say the least.",
      "rating": 2.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 3,
      "publication_date": 20191019
    },
    {
      "title": "Wow...I feel...refreshed. A feeling that has seemed so distant ...",
      "text": "Wow...I feel...refreshed. A feeling that has seemed so distant for so long has finally become known once again. I began to stir a few short minutes after the sunrise began and laid there in tranquility until its rays peaked over the horizon. The birds sang their morning song. Upon their command I swung my legs over the side of my bed with a sense of inspiration and peace ready to approach the day with confidence. A new day awaits.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170418
    },
    {
      "title": "Wonderful features",
      "text": "Have tried to convince my friends & family they need this clock! Wonderful features, has truly helped both my sleeping and waking. The adjustable amber light is nice at night and the simulated sunrise alarm wakes me without making me want to throw it across the room, which makes for a much better way to start the day.",
      "rating": 5.0,
      "verified": true,
      "author": "Blue Vesta",
      "helpful_votes": 0,
      "publication_date": 20180915
    }
  ],
  "product_meta": {
    "title": "Philips SmartSleep HF3520/60 Wake-Up Light Therapy Alarm Clock with Colored Sunrise Simulation and Sunset Fading Night Light, White",
    "description": "Inspired by Nature's Sunrise, light gradually increases within 30 minutes from soft morning Red through Orange until your room is filled with bright yellow light. This process of changing an increasing light stimulates your body to wake up naturally. By the time light has filled the room your chosen natural sound completes the wake up experience, leaving you ready for the day Ahead.",
    "rating": 4.2,
    "feature_bullets": [
      "Light therapy lamp and natural sunrise alarm clock for improving your sleep, energy, and well being",
      "Relax and drift off to sleep with dimming sunset and sounds. Colored sunrise simulation alarm clock wakes you gradually with a natural light lamp and a speaker that plays a choice of 5 wake up sounds, or FM radio with tap to snooze",
      "New PowerBackUp+ feature maintains internal clock settings and back-up alarm for at least 8 hours in the event of power failure",
      "90 Day No Hassle Money Back Guarantee from Philips and can be used as a bedside reading lamp with 10 brightness settings",
      "Philips’ #1 best-selling wake up light alarm clock. Only Philips wake- up lights are clinically proven to help you wake up feeling more refreshed",
      "Power Output: 12Watt ; Voltage: 100/240 Volt ; Cord length: 150 cm"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.83 x 5.75 x 7.56 inches; 2.45 Pounds",
      "Item model number": "HF3520/60",
      "Batteries": "1 Unknown batteries required.",
      "Date First Available": "August 27, 2012",
      "Manufacturer": "Norelco",
      "ASIN": "B0093162RM",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Home & Kitchen",
      "Alarm Clocks",
      "Clocks",
      "Health, Household & Baby Care",
      "Home Décor"
    ],
    "price": 116.66
  }
}