{
  "website_summaries": [
    {
      "verdict": "The Canon PowerShot SX160 IS is a good, inexpensive travel-zoom option for those wanting more control over results or who are just getting into photography and don't want to empty their wallets.",
      "pros": [
        "The Canon PowerShot SX160 IS has a large selection of shooting options from full manual to full auto",
        "big, easy-to-press controls",
        "and the convenience of AA batteries"
      ],
      "cons": [
        "The SX160 IS will eat through alkaline batteries",
        "shooting performance is good, but not fast",
        "and picture quality drops off above ISO 400, so it's not a great choice for handheld low-light shots"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 8.0,
        "Performance": 6.0,
        "Image quality": 7.0
      },
      "publication_date": 20121218,
      "rating": 7.0,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "GREAT USED CAMERA",
      "text": "WORRIED WEE BIT ABOUT BUYING FROM middle east & yes came on slow boat-- 5 weeks-- but got it, and great USED camera-- looks good, and tested out everything I normally use and all worked well-- yes used means it is a crap shoot but I can't afford $300 plus cameras so this old 16X cannon fit the bill at $80-- well worth it so far--",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey D.",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Best AA battery camera around",
      "text": "This is the best AA battery camera around. Unfortunately the new SX170 edition of this series switched to proprietary rechargeable batteries, so this one pretty much remains the king of AA battery cameras. The picture quality if excellent. Not as great as an SLR, but you have plenty of options to play with. Many other AA cameras do not include manual controls for focus and aperture. This one does, and it's a fun device to play with. It's very easy to use and controls are very intuitive. I like how the enabling the flash requires a manual raise. This creates a helpful visual cue. Overall I absolutely love this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Erich Maria Remarque",
      "helpful_votes": 2,
      "publication_date": 20140726
    },
    {
      "title": "returned but never received refund...",
      "text": "Appears to be brand new, but doesn't work properly. Every time I turn it on I have to re-program the date and time, in order to take a picture. I returned the camera, but never received a refund, so now I'm out $200 and have no camera",
      "rating": 1.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "... fell in a river with it and it worked good. This one seems to match the capabilities as ...",
      "text": "I had one of these before I fell in a river with it and it worked good. This one seems to match the capabilities as my old one. Same model, so I would expect it to be the same. The video is only 720, but for most of what I do, that is okay. Pictures are good. Update: I noticed the button cell is drained and the lens is either scratched or smeared with something. Has trouble focusing.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Lewis",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "Wow!",
      "text": "It takes great pictures and video, and was easy to learn how to use the basic features. Love that 16 to 1 zoom, IF I hold the camera more steady. Be aware that some of the largest files on your harddrive will be those 720p videos if you take long ones. I did reduce the picture res to 8mp, as that's already much better than my last camera, and I don't do poster prints. Battery life with Eneloops was outstanding, 2 weeks on one set during our Niagara and Pennsylvania trip! And I took a couple of hundred pics and vids. The Transcend 16GB Class 10 card keeps me shooting as rapidly as I need to shoot.",
      "rating": 5.0,
      "verified": true,
      "author": "Don L. Binder",
      "helpful_votes": 3,
      "publication_date": 20140103
    },
    {
      "title": "best all around camera that takes AA batteries",
      "text": "Great camera for specific considerations: uses AA batteries, easy to find in a pinch; good zoom; and manageable size, it can fit into a pocket or a woman's purse quite easily. Great camera for someone who like quality pictures but prefers not t haul around a large, conspicuous camera with them.One drawback: takes a few second for flash to charge up. Take this into consideration if you do a lot of night shots that you only have a scant few seconds to take. Hard to find AA battery using cameras these days so get one while you still can.",
      "rating": 5.0,
      "verified": true,
      "author": "Mateo",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "A great camera that runs on AA batteries!",
      "text": "The newer version of this camera uses a proprietary battery, like most cameras do these days, but this version runs on standard batteries. I had purchased several \"gum stick\" style batteries for my old camera, and after a while none of them would hold a charge, it was infuriating. Not only did I solve the battery problem, but by buying last years model I saved almost half the price. Operationally the thing works like a dream, It'll do anything you want - it has lots of manual settings if you're the creative type. And the ultra long optical zoom range was what sold me.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Olson",
      "helpful_votes": 3,
      "publication_date": 20140514
    },
    {
      "title": "Excellent camera. I chose it because it will take ...",
      "text": "Excellent camera. I chose it because it will take AA batteries; I frequently travel in places without dependable electric service. Easy to use for someone (me) who just wants point-and-shoot. And has a lot of features that a more involved photographer would enjoy. When electricity is available, I use rechargeable batteries in it. One fully charged pair will run this camera all day even with using the zoom A LOT. It's too large to put in a pocket, but light enough that it's comfortable to carry in a nylon camera pouch. I've used it in some very dusty places with no ill effects, although I'm careful to keep it off and/or in the pouch when not in use.",
      "rating": 5.0,
      "verified": true,
      "author": "RCB",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "which is easy, but it runs through them like crazy so ...",
      "text": "Unfortunately, I bought this for a trip where I couldn't use flash very often. Without it, pictures are definitely fuzzy. When I did get the chance to use it, the flash takes forever to charge up. It runs on AA batteries, which is easy, but it runs through them like crazy so I always have to carry around a pack of batteries. The pictures aren't amazing, so I don't see the bulky camera as a good replacement for what I can just take on my phone's camera. (also - be warned, it doesn't come with any kind of wrist strap!)",
      "rating": 2.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "Great camera!",
      "text": "This camera is excellent. I bought it to use as my back up camera for my vacation to Montana. I ended up using this camera and leaving my \"good camera\" at home. I was not disappointed. I didn't have a neck strap for it so that caused some inconvenience but otherwise it was fantastic. Some of the reviews complain about battery time. I had no problem with that. I took over 250 pictures on one set of batteries. I bought a dry bag that fit the camera wonderfully for when we were fishing the Yellowstone river. I have always had great experiences with Canon cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan O",
      "helpful_votes": 2,
      "publication_date": 20130927
    },
    {
      "title": "Excellent stabilization.",
      "text": "Good image for 720p. Regular double a batteries last only a short time. Rechargeables are the way to go. Feels good in your hands. Be prepared for an extremely high learning curve. Instruction manual is 214 pages. Many features for creating unique images.",
      "rating": 4.0,
      "verified": true,
      "author": "Lee Albright",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "A powerful compact camera",
      "text": "I originally bought this camera for an introductory photography class, and I'd say that this was money well spent. This camera gives a lot more control than other compact cameras I've owned before. It has options to change the lens aperture, shutter speed, white balance, and ISO. Along with auto focus, it also has a macro mode and manual focus. The only thing I don't like about this camera is that it goes through batteries fairly quickly. I highly recommend getting some rechargeable AA batteries along with this. Also, the use of AA batteries makes this camera a little bulkier than most compact cameras.",
      "rating": 5.0,
      "verified": true,
      "author": "Shio",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "Great buy for the money",
      "text": "I used to shoot weddings (in the old film days) on a contract basis for a local studio so I know something about photography. For a simple camera with a lot of features that takes very good pictures, this camera is a keeper. The zoom range is great. I would buy this camera again if I dropped this one on a concrete floor like I did the last one. The price is very reasonable as well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Steiner",
      "helpful_votes": 2,
      "publication_date": 20140829
    },
    {
      "title": "Very happy",
      "text": "For those ordering who like to record video you should know that the camera records in MOV/TMP format only. You may need to buy a program to convert movies once uploaded. Otherwise photo and picture quality is great, just as described. I have absolutely no complaints. My camera arrived in very secure packing. Also, I'd like to mention it arrived earlier than expected. I am more than please with my service from DataVision Computer Video!",
      "rating": 5.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 4,
      "publication_date": 20130906
    },
    {
      "title": "Good optical zoom capability",
      "text": "I got this camera because it has 16x optical zoom and uses AA batteries. It worked well on a trip to Africa for getting good shots of the animals - including birds in trees where the zoom was essential. I got photos as good as people who had larger digital SLR cameras. Sometimes a bit slow writing to SD card when maximally zoomed in - even a faster SD card did not help in that regard. Good all-around camera. Because of the zoom capability, it is heavier and larger than some point-and-shoot models.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy415",
      "helpful_votes": 2,
      "publication_date": 20131127
    },
    {
      "title": "Wide angle. good sunlight pictures,automatic macro/close-up.",
      "text": "The best features of this camera are the wide angle and automatically adjusting closeup modes, which require no settings, along with the big monitor. Takes better quality photos in full sun. I have a cheaper camera that takes sharper pictures with the flash indoors. I guess to get better quality you have to buy an SLR.",
      "rating": 4.0,
      "verified": true,
      "author": "rastaman",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "I like the features",
      "text": "I had previously owned another model of PowerShot camera and when it didn't survive after getting run over by a small tractor on a concrete surface I new exactly what I was going to get as a replacement. My hands aren't the steadiest and so I really appreciate the image stabilization. There might be others out there that do a better job but they are in a whole other price range than what I can afford. When I have it tripod mounted the optical zoom works great. There are features that I haven't even got around to exploring yet and I am still impressed with the quality of the shots that I have been able to achieve.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Powell",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Older But Special",
      "text": "Reviews indicated this item was supersceded by a new one, virtually identical but for the use of a proprietary battery to power the SX170. The features of the SX160 were, then, great to begin with. The optics are clean (comparable if not superior to the competitive N____). Ease of operation and responsiveness to commands - and changes in settings - are remarkable. For less money than the 'new & improved' I have a very acceptable camera for this price and features range, and the ability to use the best, and most reliable, power source I choose. Not bad at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140412
    },
    {
      "title": "I'd rather have spare batteries",
      "text": "Like others have indicated, the battery life sucks. But I would still rather use AA batteries, than not have a working camera because of a dead battery that must be charged. The whole point of being able to take pictures won't matter if you can't quickly have a good/replaceable power source. Plus, as worth any other portable device, the batteries will still have to be replaced eventually, and proprietary batteries may not be available if you want to keep the camera for a long time.",
      "rating": 4.0,
      "verified": true,
      "author": "T",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Bought this camera due to it being battery powered",
      "text": "Took it to Machu Picchu for our 120km trek through the Peruvian Andes. Great camera, great pics. Unfortunately, I dropped it while in a soft case and it fell right on the lens and bent the lens protector iris. It was still usable if I manually pushed the iris open. When we got back, I sent it back to Canon and they sent me a new one...free. Our Peruvian guide liked it so much and he had no camera, so when we got back. I bought him one and sent it to Peru.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr E",
      "helpful_votes": 5,
      "publication_date": 20130621
    },
    {
      "title": "My wife and I love this camera so much that we have now bought ...",
      "text": "My wife and I love this camera so much that we have now bought 3 of them (his/hers and one with a special neckstrap). We travel alot and this size and type of camera meets our every need with zero problems. In fact, one of our SX160 cameras was on a tripod when a very strong wind on Maui (near Blackrock) blew the tripod over. The camera lens was damaged, it would not retract. We sent it to Canon and Canon replaced the camera. Can't ask for more than that.",
      "rating": 5.0,
      "verified": true,
      "author": "CJTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Returned",
      "text": "Ordered for a vacation, was really disappointed. View and picture quality is grainy. The camera was used and there was a black spot that appeared and expanded as u zoomed in. It would also appear in tje pics taken",
      "rating": 1.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "I think this is a pretty good camera for the price",
      "text": "I think this is a pretty good camera for the price. It isn't the most superb quality, but it takes decent pictures and videos for a casual use. Definitely not something for a person planning on being a photographer or something of the sort, but for anyone who just needs a camera every once and a while to do the job.",
      "rating": 4.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Definitely a great buy",
      "text": "This camera is much better than the old Powershot it replaced (the old one simply died). It doesn't chew through batteries the way the old one did and it takes great photos. The image stabilizing works very well, even at high optical magnification. I have always longed for a digital SLR but this camera has dampened that yearning. The ease of carrying it in my pocket means that I get lots of shots that I wouldn't have time to get with an SLR.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Crawford",
      "helpful_votes": 2,
      "publication_date": 20131130
    },
    {
      "title": "we liked this camera",
      "text": "we liked this camera, but were disappointed that it broke in the first month. Cannon has replaced the camera with a more updated version. Which I commend, but we like how this one used AA batteries. So you could always just hit a grocery store to get it immediately working or have a set of rechargeables to save money. The new one is great, but has a cannon battery.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Cozens",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "nice for price",
      "text": "The SX160 is a good compromise for a \"point and shoot\" and an ultra zoom ... it is small and light but takes good pictures and is relatively intuitive to operate. on trips the ultra zoom gets pretty heavy around your neck and is always bouncing on your chest as you walk... hopefully this camera will take good pictures while being easy to carry",
      "rating": 5.0,
      "verified": true,
      "author": "5th wheel camper",
      "helpful_votes": 2,
      "publication_date": 20131218
    },
    {
      "title": "Shoot Product Photography Like a Pro",
      "text": "This camera takes fantastic pictures. I purchased it specifically to shoot pics of my pottery in a light box. It hasn't let me down. One of my favorite features is that it uses rechargeable batteries. For me, the learning curve was a bit steep. But once I got the hang of it I was impressed with the results.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyber-Shop Until I Drop",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Best investment this year",
      "text": "I bought this camera for my spring break, and man am I glad I did. It has the auto shoot function so even if you are camera challenged (or asking someone to take your picture and maybe not speaking the same language) you'll get an awesome picture 98% of the time (the other 2% accounts of photobombers, those sneaky bastards! or the blink mid picture) It takes AMAZING outdoor pics and excellent indoor pics in 90% of the dim/dark/indoor pictures I took. I highly highly recommend this camera",
      "rating": 5.0,
      "verified": true,
      "author": "k",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "The camera is making me look good",
      "text": "easy to initial set up and now operate. Takes wonderful shots and I am even able to transfer my photos to my computer. I would not classify me as a pro by and standards but I am enjoying trying to learn and easy to try different settings and then pick the \"best\" from sunsets to full moon shots to some outstanding Fall mountain shots in PA Worlds End area.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Stevens",
      "helpful_votes": 3,
      "publication_date": 20131110
    },
    {
      "title": "Beautifully simple",
      "text": "This was my second digital camera by this manufacturer because I was so satisfied with the first one. So far I have only used it just enough to become familiar with it so I cannot elaborate at this time. It is very well made and it looks and feels very smart. I'm impressed with the optical zoom capabilities, especially the image stabilization feature. I will know more after I have gone on vacation later this month. I am sure that I will be very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Sleepyquad",
      "helpful_votes": 0,
      "publication_date": 20130427
    },
    {
      "title": "Love this camera",
      "text": "This was the third camera that I bought in my search for a camera that was not too bulky, had a decent zoom, and could take monochrome pictures (I love having the option of taking sepia and black and white pics!) I bought a Samsung, an Olympus, and this Cannon. They were all good cameras for the price, especially since I got the Olympus on a REALLY good sale) but this was the only one of the three that could do the monochrome easily. So far I absolutely love it. The only down side is that it does not take spectacular action shots.",
      "rating": 5.0,
      "verified": true,
      "author": "m.turner",
      "helpful_votes": 0,
      "publication_date": 20130223
    },
    {
      "title": "everybody knows it's your camera",
      "text": "loved the red color of this camera - bought it so we could easily pick out which was ours and it does have some fun effects (fishbowl, sepia, poster effect...) But a little bulky/heavy for travel. Good for our overseas trip as it takes regular batteries so we could just buy more if needed and not have to worry about charging with a converter and all that mess. So good for what I needed it for but wouldn't purchase anything similar in future",
      "rating": 3.0,
      "verified": true,
      "author": "LGeo",
      "helpful_votes": 0,
      "publication_date": 20140323
    },
    {
      "title": "Excellent Camera!",
      "text": "I bought this for my son to take while studying abroad in Europe in 2013. The photos he brought back look like they should be in an international travel magazine! Also makes great videos too! I also purchased a Transcend 32 GB Class 10 SDHC Flash Memory Card from amazon.com and installed it, and he came home with over 2500 great photos of England, Ireland, and France!",
      "rating": 5.0,
      "verified": true,
      "author": "T Sanders",
      "helpful_votes": 0,
      "publication_date": 20140625
    },
    {
      "title": "Great Camera!",
      "text": "I bought this an an upgrade from my previous point and shoot. I love all of the various settings and the ability to control all or some of the settings as I learn to be a better photographer. The improved zoom is already making a difference for me over my previous camera. This camera allows you to use regular batteries instead of the proprietary battery required for the SX170 while giving you all of the same features. I am very pleased with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Wonderful Jones",
      "helpful_votes": 0,
      "publication_date": 20140105
    },
    {
      "title": "Hard to find these days but works great, no complaints",
      "text": "Purchased for work use. I work for an engineering/construction company and wanted a camera that uses AA batteries instead of lithium ion. Hard to find these days but works great, no complaints. Bought a second one after compliments from engineers on first one.",
      "rating": 4.0,
      "verified": true,
      "author": "gwenifred",
      "helpful_votes": 0,
      "publication_date": 20151117
    },
    {
      "title": "Camera is very user friendly!",
      "text": "This camera makes awesome pictures. I point and click, and to my surprise - they look like I know what I'm doing. The camera is not heavy, easy to travel with, and gives me the little extras I need, to help me catch a beautiful AZ sunset, lightening striking in the desert sky, a smile on a small childs face, etc. I am very pleased with this camera and all the memories it gives me.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie Gaetjens",
      "helpful_votes": 2,
      "publication_date": 20130620
    },
    {
      "title": "A really good camera",
      "text": "I was shopping around for an upgrade for my older Canon Powershot 580. My main need was taking decent photos of my jewelry for Etsy, so I needed a good upclose in natural light. I was looking at the SX170 and read a review that said this was essentially the same thing with a few minor differences. I didn't need it for action shots so I took a chance on this, half the price and does what I need perfectly, I haven't really tried it much for anything else but I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "sue",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Great Purchase!!!",
      "text": "I have had this camera for about a year and use it all the time. Mine was in used condition but works without a fault and looks basically new. I just love it. Great videos and nice pictures! I would definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. R.",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "A good camera for being creative",
      "text": "Canon digital cameras are a bit silplistic. I got one of these for the live feature. That allows you to see what manual controls are doing when you adjust the color and brightness. It should be helpful for being a bit creative which I like to do. It only uses two AA batteries so it a bit thinner than some cameras with long lenses. It is a bit heavier than a regular point and shoot. All in all a nice camera.",
      "rating": 5.0,
      "verified": true,
      "author": "KSArnold",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Perfect!",
      "text": "This is exactly what I was looking for! A small, easy to use camera that takes GREAT pictures! A few people expressed concern with this camera not taking good action shots but I have not found that to be true. We have two very active puppies which I have got great action photos of. Better than any camera I've ever had! I also love that it uses AA batteries which can be found anywhere that I'm traveling. This camera is absolutely perfect!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Breezyk",
      "helpful_votes": 2,
      "publication_date": 20130223
    },
    {
      "title": "Good camera.  Was a good purchase",
      "text": "This is a nice little camera with good features and high quality photos. Those that complain about the photo quality are doing it wrong and not knowledgeable about SD card speeds and the camera's internal photo quality settings. I've even dropped it and crashed on it on my mountain bike and it still works very well.",
      "rating": 4.0,
      "verified": true,
      "author": "EaSpawn",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Not impressed",
      "text": "After reading the reviews I was expecting high quality photos but was disappointed by what I got. The Kodak 10MP I currently own takes better quality pics than this Canon does! I ended up returning this Canon and got an upgraded model Kodak for a third of the price! The new Kodak is a lot easier to use (than the Canon) and the pics are much better quality. Too bad Kodak won't be making cameras anymore.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunshine Lover",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Superb Canon Power Shot",
      "text": "This camera met or exceeded my expectations. I chose it because I had an older Canon Power Shot that I really liked AND because this camera uses two AA batteries. Also, the batteries last a very long time. It is pocket sized, not bulky, and can easily fit into any purse. I recommend this camera for anyone: those who just want to take pictures for a pastime or for the real camera buffs who don't want to tote their larger cameras to sporting events, etc. It is simple to operate and has a large 3-inch view screen. The pictures are great.",
      "rating": 5.0,
      "verified": true,
      "author": "French Fry",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "Great camera.",
      "text": "Bought to replace another Canon Powershot that got broken accidentally. I am very impressed with this camera! It has so many features I have not even really started to \"learn\" all of them yet! The owners manual, is very lengthy and is only available on line, so be sure to have paper to print it out. It does come with a 30 page manual, but it barely touches on the features of this little gem.",
      "rating": 5.0,
      "verified": true,
      "author": "S. M.  In N.J.",
      "helpful_votes": 0,
      "publication_date": 20130224
    },
    {
      "title": "good clean photos",
      "text": "I've been using this camera for work purposes and it's great. It takes really nice photos, easy to use and the color is great. This little camera also takes good video as well. This would make an excellent vacation camera, it's small enough to fit in your pocket easy no fuss to use.",
      "rating": 5.0,
      "verified": true,
      "author": "westshop",
      "helpful_votes": 2,
      "publication_date": 20141017
    },
    {
      "title": "Canon camera",
      "text": "I bought my son this camera for Christmas because it was inexpensive, had many good reviews, and used double A batteries. My son liked his camera so much, I bought one for myself and for my husband. If you're just a casual photographer, don't need all the bells and whistles of a fancy camera, and don't want a camera with a rechargeable battery pack, this Canon camera will fit the bill.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine Banks",
      "helpful_votes": 0,
      "publication_date": 20140414
    },
    {
      "title": "Recommended to anyone",
      "text": "This is a older camera that does not have a zooming that is clear compared to the younger model of this camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Evelyn",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "This is the best camera! They don't make it anymore",
      "text": "This is the best camera! They don't make it anymore, and the subsequent versions are not as good. I paid more than the original price to get another one of these because Canon doesn't make them anymore, and it was worth it to me. I wish Canon would make this one again!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Rose Glenn",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "Great Camera!",
      "text": "Actually I love it for the simple fact that it uses batteries I can easily replace and don't have to keep track of a yet ANOTHER charger for a specific battery etc. ad nausium. Looks great and performs great. The LED is a bit sketchy for clarity some of the times but for the most part it's fine. Can't beat the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan G Migita",
      "helpful_votes": 3,
      "publication_date": 20131106
    },
    {
      "title": "Great Camera for the Price!",
      "text": "I have been using this for 9 months now. I've owned several Canon cameras over the years. The photo quality has been excellent! I've taken photos that people have raved about! Its easy to use. My 12 year old can even use it. The price was very reasonable. It's big enough to work like a serious camera, yet small enough to be portable.",
      "rating": 5.0,
      "verified": true,
      "author": "Coach Joe Scott",
      "helpful_votes": 3,
      "publication_date": 20130811
    },
    {
      "title": "Canon PowerShot SX160IS",
      "text": "I love this camera. I have the Canon Power Shot S5IS and also love it, but it's big and bulky when traveling. The SX160IS fits into my purse perfectly. The buttons are very similar to the S5IS, so I didn't have to learn much. And the picture quality is great. It's a little bigger than a lot of the \"smaller\" cameras but I find that makes it easier to hold and not move when taking pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "M. J. Wenzel",
      "helpful_votes": 2,
      "publication_date": 20130918
    },
    {
      "title": "Clean, quality pictures.  Easy to Use.",
      "text": "If you want an easy-to-use, better quality camera, this is the one. It will take great pictures quickly and clearly, as well as HD video. I like the fact that it takes AA batteries. I never have to worry about having the battery charged up and can purchase extra batteries almost anywhere. It's best to use Energizer Advanced or Ultimate lithium AA batteries too. They will last a long time, unlike regular alkaline cells.",
      "rating": 5.0,
      "verified": true,
      "author": "Al B",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Marvelous transition from Instamatic to DSLR",
      "text": "This is the handiest inexpensive camera we have yet found! My wife loves the fact that it is 16.0 MP and the photos are amazingly sharp. We are both happy that it has many of the capabilities of the more expensive SLRs on the market. My wife is currently learning to use the changes in the aperture and speed settings to get the exact qualities she wants in her photos.",
      "rating": 5.0,
      "verified": true,
      "author": "SonomaEd",
      "helpful_votes": 3,
      "publication_date": 20131109
    },
    {
      "title": "Great Camera!",
      "text": "This is a great little camera! We bought this in replacement of an older model that was dropped (sx120is). We went with this model because it still used \"AA\" batteries and not a special battery as the newer models use (sx170is). This camera is very easy to use right out of the box with the \"auto\" setting. Takes great pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Collins",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "great images",
      "text": "Really happy with product after contacting Canon and getting a bit of coaching. The software provided on disk is a bit of a pain for easy upload like the older Powershot, but more than makes up for it with in expanded functions. I have Adobe Creative Suite, so thought it would just be duplicating functions but really helpful. Really great shots in low light.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lee Harper",
      "helpful_votes": 0,
      "publication_date": 20121225
    },
    {
      "title": "An Impressive Camera",
      "text": "I bought this one because of reviewers on Amazon.com web site. This one has AA batteries which you can find anywhere rather than the much more expensive Canon battery. I use rechargeable batteries which is even better. I like 16X optical zoom which is very impressive. I have turned back to the lower level the 16mp size. A great camera.",
      "rating": 5.0,
      "verified": true,
      "author": "John in Alex",
      "helpful_votes": 0,
      "publication_date": 20140207
    },
    {
      "title": "A camera for all occasions work and fun",
      "text": "I use cameras for inspections and have had several however this one has more than before and can take photographs even with more detail. It is bigger than the normal cameras used not that far off, it handles like most digital cameras with the feel of an expensive camera so far enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "LJB",
      "helpful_votes": 0,
      "publication_date": 20150810
    },
    {
      "title": "Canon PowerShot 160 Camera",
      "text": "I bought a used Canon PowerShot 160 camera at a 3rd of the suggested retail price. Product was in very fine condition as well. I thank the seller highly. It's a good camera for sunrise or sunset photo taking. Sadly Canon doesn't make or repair this model anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Leonard, Augusta Ga",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Good camera; lousy manual",
      "text": "Four stars for the good old camera part. Easy settings, lovely pictures. But comes with a lousy manual. Claims to have WiFi capability. So far I have not managed to have it 'find' my modem. The 'Auto' search does not work; the 'Manual\" I dare not try in the face of the manual written only for whiz kids. Has anyone succeeded in getting WiFi connection work?",
      "rating": 3.0,
      "verified": true,
      "author": "C. M. Naim",
      "helpful_votes": 0,
      "publication_date": 20160520
    },
    {
      "title": "Full featured pocket camera",
      "text": "This is one of my favorite \"pocket cameras\". The 16X zoom lens is sharp, it has many controls for manually setting the camera, nice LCD screen, low price. It uses rechargeable AA batteries, but you can use alkalines in an emergency. Only complaint is that the CCD sensor gets noisy in low light.",
      "rating": 4.0,
      "verified": true,
      "author": "tom",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Nice camera; have everything you need!",
      "text": "We like this camera for the price we payed for it, specially the large zoom allows to take closeups from quite far. Odds: it consumes much energy. Must have with you a pair of spare batteries ALWAYS. The case amazon recommends to buy with this camera is quite small. Quality is good but the camera fits quite tight in it. I think amazon should have to review this recommendation. we recommend people to see a larger case.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Diez",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Over all good camera for digital pictures",
      "text": "Exactly what I wanted, was a quality camera that took regular battery's that didn't burn through them extremely fast. This camera does take AA battery's it is not very fast between pictures, it had to charge the flash between pics. You can take about 100 to 150 pics before replacing the battery's, I was using regular alkaline battery's. Over all good camera for digital pictures.",
      "rating": 4.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "This little camera is a wonderful tool for anyone looking to take more control of ...",
      "text": "This little camera is a wonderful tool for anyone looking to take more control of their photography! It offers many features of Canon's DSLR line in an easy-to-understand and lightweight package. I bought this one as an upgrade from the SX150, which I also loved. The SX160 offers 16x optical zoom compared to only 12x (which was still awesome) with the SX150. Youtube has plenty of easy-to-follow videos for learning creative controls of a digital camera. Try it - you'll love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "canon powershot sx160 is a great camera",
      "text": "I like how well pictures turn out on auto. I have not done anything in manual mode, but I plan to once I go through all 260 pages of the manual.It does burn through alkaline batteries quickly and recently bought a Duracell charger and 4 NiMH batteries. I would reccommend this to anyone that wants a digital point and shoot. My only disappointment that the price dropped right after I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "steven t. bremer",
      "helpful_votes": 3,
      "publication_date": 20121203
    },
    {
      "title": "Great value for the price",
      "text": "Great value for the price. I needed a camera that takes good quality product pictures with good color rendering. I read a lot of product reviews and decided on this Canon and I was not disappointed. It has a lot of advanced features I would have expected in more expensive cameras. I highly recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Otilegna",
      "helpful_votes": 0,
      "publication_date": 20150406
    },
    {
      "title": "Looks nice on the outside. Hard to use but not impossible.",
      "text": "For a point and shoot, it doesn't have a lot of good effects. I like the big LCD, and the fact that it kind of looks like an SLR. It has manual functions like shutter time and others. But honestly the images come out kind of grainy and it's hard to lock on with macro. If I had to buy this camera again, I'd pick something else.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr Suds",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Great for the price & quality !",
      "text": "Camera is great 16Mp/16 Optical zoom combination is great. The use of regular AA batteries is also a great advantage, I could not gave it a 5 star rating due to the slow flash and the fact it didn't came with at least a cheap SDHC card which most of today's cameras come with .... I still recommend it as a great purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Osvaldo J",
      "helpful_votes": 0,
      "publication_date": 20140201
    },
    {
      "title": "Bang for your buck",
      "text": "This camera works great. I took it with me overseas to keep a photo diary. I love that I have been able to take close ups of the moon (64x). The only issue is the stabilization. But I am going to try a tripod to see if this helps. Overall for the price I paid its been a good camera.",
      "rating": 4.0,
      "verified": true,
      "author": "Francesca M. Vanderwall",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "I love this camera",
      "text": "It is a long lens and the pictures are nice and clear. We live by a lake and i enjoy taking pictures of the birds. I also bought a battery charger and i like having the 2 aa batterries. Good photos.....not a compact but a nice size camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Constance",
      "helpful_votes": 2,
      "publication_date": 20130920
    },
    {
      "title": "Bought as a gift",
      "text": "I bought this as a gift and I still hear all the compliments on the quality of it. This is a small but powerful camera and preforms extremely well as a camera for stills or as a movie camera. Thanks to this little guy I get movies and pictures of my grandkids. For this type camera, you just can't beat it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony Kimbrough",
      "helpful_votes": 0,
      "publication_date": 20140610
    },
    {
      "title": "Hope this one lasts as long as the identical one it is replacing!",
      "text": "I bought this as a replacement for 1 identical to it that I had had for years. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great Gift!",
      "text": "This camera was a gift from my husband (ARM) I like it very much so far. It is bigger than tiny one I had - easier to use. I have not experimented very much with it yet...but what I have done has been great! I would recommend it to non-experts like me. I don't know if experienced photographers would require more...but I like it!!",
      "rating": 4.0,
      "verified": true,
      "author": "Tony MONTOYA",
      "helpful_votes": 0,
      "publication_date": 20130110
    },
    {
      "title": "Wonderful little camera!",
      "text": "I got this instead of spending hundreds of dollars on a great camera. I needed to get one quickly and have not been disappointed in it yet. It takes great photos, is easy to use, and small enough to be an easy carry!",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki Fotheringham",
      "helpful_votes": 2,
      "publication_date": 20130613
    },
    {
      "title": "Nice size camera - fits in my fanny pack",
      "text": "This camera takes terrific photos of people and scenery. My only objection is not being able to see what I'm shooting in bright sun light and wish the cameras with eye pieces weren't so heavy and cumbersome. And I love having a different colored camera so it doesn't get picked up by someone else by mistake when I'm on a trip.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20130904
    },
    {
      "title": "This is the second camera of this type I have ...",
      "text": "This is the second camera of this type I have owned. The first one I used on a trip to Maine and afterwards gave it to a friend as a gift. The zoom on this camera is stunning. And the quality is supurb as well. But the main reason I chose this camera is because it uses AA batteries. I bought 8 Tenergy rechargable NiMH batteries and a charger for them for $25, so that gives me 4 changes of batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Kornmiller",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "SMILE",
      "text": "I LOVE ALL CANON PRODUCTS AND THIS IS MY 6TH CAMERA. THE PICTURE IS SO CLEAR AND PRETTY. THE CAMERA HAS SEVERAL FEATURES ON IT FOR A PROFESSIONAL OR AMATEUR. ANYONE WOULD BE ABLE TO OPERATE THIS CAMERA AND IT COMES WITH A BATTERY CHARGER. HOW GREAT IS THAT",
      "rating": 5.0,
      "verified": true,
      "author": "B ANGIE B",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Just right",
      "text": "Needed a small and dependable camera that still used AA batteries for living/traveling in a third world country. Though I have a powerful phone camera, I could not trust others with it as I had to be in many of the shots. This is absolutely what was needed. VERY happy with this; easy to use; great colors; great zoom and small enough to put in your pocket.",
      "rating": 5.0,
      "verified": true,
      "author": "JCW",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "LOVE IT!",
      "text": "LOVE IT !!! I' m a professoinal photog, and it's oneof the most adaptable small cameras I've ever had Excellent lense and over quality",
      "rating": 5.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Canon PowerShot SX160iS",
      "text": "Absolutely love this camera. Read lots of reviews of various cameras and this is the one. Just in time for holidays, My son owns much costlier camera and he couldn't believe all the great features Batteries not an issue - bought re-chargeable ones as suggested in reviews.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Read",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "It's ok",
      "text": "This camera is pretty ok. It takes terrible shots of my daughter because she it always moving. It smears with even the slightest movement. It is really only good for still photos and it is awesome at that, so keep that in mind. I bought it on a lightning deal so I don't feel screwed.",
      "rating": 3.0,
      "verified": true,
      "author": "J. T. Smith",
      "helpful_votes": 0,
      "publication_date": 20130303
    },
    {
      "title": "this is a  really  great  camera....!!!! I would recommend it, to any one...!!!!!!!!!!!!!!",
      "text": "this is the very best camera ever...!!! I would recommend it, to any one...!!! it takes the best pictures.....!!! I was really impressed, with this camera....!! if you need a good over all camera get this one....!! and the price is the best to ..!",
      "rating": 5.0,
      "verified": true,
      "author": "TATTOO JOHN & Dianna Starr",
      "helpful_votes": 2,
      "publication_date": 20131114
    },
    {
      "title": "Clear photos, good price",
      "text": "This camera has a very good picture quality and a great zoom. I bought this after taking my SX120 to the beach and getting it full of sand, and it is great! Very happy with my purchase. Plus it's much more advanced than the 120 and cost $50 less than I paid for the 120 several years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20130809
    },
    {
      "title": "Wish it would do a better job inside without the flash",
      "text": "Survived a year of use by middle-school yearbook students. Wish it would do a better job inside without the flash. Pictures of sporting events in the gym were dark or blurry. Pictures outside or when using flash were great.",
      "rating": 5.0,
      "verified": true,
      "author": "DavidW",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Good camera. I took it to Africa and got ...",
      "text": "Good camera. I took it to Africa and got great pictures, even without learning to use the many features it has. But for most of my picture taking, my cell phone does a great job without carrying an extra piece of equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "Super Camera.",
      "text": "Many features, great zoom. I wish I could give this camera more then 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 3,
      "publication_date": 20141013
    },
    {
      "title": "ooops",
      "text": "took it to Japan and dropped it three times , still did a great job and not a scratch on it.",
      "rating": 4.0,
      "verified": true,
      "author": "tuggie",
      "helpful_votes": 2,
      "publication_date": 20141003
    },
    {
      "title": "A lotta bang for not a lotta bucks",
      "text": "this camera is the best Christmas gift I could ever buy for myself. Coming from a camera noob, I bought Canon because my roommate is a film production major, and after telling her my ideal camera, she advised me to purchase this one. The pictures are very clear, and there are a lot of cool settings you can play with. It is a point and shoot, but I honestly feel like it's a DSLR at heart lol. No cons so far, everything is perfect!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Eme",
      "helpful_votes": 0,
      "publication_date": 20140226
    },
    {
      "title": "Great camera!",
      "text": "We got this camera for our daughter's 9th birthday. It arrived yesterday and we are very pleased so far! It takes great pictures. She is having a blast learning the different settings and says she feels like a real photographer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin ~ Talkin with Twang",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "\"Old Model?\"  Not so!",
      "text": "This model is state of the art. The difference to the SX170 is the chargeable battery. Otherwise same functions across the board. This is a good replacement for my Canon Power Shot A590 which I have had for years until the dial fell off last month.",
      "rating": 5.0,
      "verified": true,
      "author": "ADK-PAPA",
      "helpful_votes": 0,
      "publication_date": 20140603
    },
    {
      "title": "excellent replacement camera",
      "text": "this canon sx160-IS is a replacement for my non-working sx110-IS, it is more advanced than my older model but I believe I will be extremely pleased with its performance. The instruction booklet and the DVD that were inclosed will be a great help. thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Sheehan",
      "helpful_votes": 0,
      "publication_date": 20140321
    },
    {
      "title": "Great Service",
      "text": "I can not say enough great things about this Canon digital camera. It's by far the best small camera that I have ever owned. I took a photo of a full moon and people could not believe how I was able to zoom in with is camera. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo",
      "helpful_votes": 3,
      "publication_date": 20130326
    },
    {
      "title": "Present",
      "text": "I got this as a gift for one of my parents who had not yet moved from film cameras to digital. So far I've been pretty impressed with the image quality and ease of use. It seems to balance the two well.",
      "rating": 4.0,
      "verified": true,
      "author": "Serenity Horizon",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "Great pictures, zoom and megapixels",
      "text": "Great pictures, zoom and megapixels. I like the use of AA rechargeable batteries over the special batteries required in other models. They're less expensive and available anywhere. Excellent large viewer",
      "rating": 5.0,
      "verified": true,
      "author": "CZ",
      "helpful_votes": 0,
      "publication_date": 20140705
    },
    {
      "title": "AA Batteries",
      "text": "I had this camera before but it did not survive a fall on to a marble floor. It took excellent photos. It uses AA batteries which I find more user friendly than those that have to be recharged on a regular basis. I only wish there was a camera with this that also featured the alternate viewer to the screen which is always hard to see in the sun.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Welch",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Easy to use",
      "text": "Bought this for my wife. She likes an easy to use \"Point and shoot\" style. It takes great phots's in about any condition and uses AA batteries.",
      "rating": 5.0,
      "verified": true,
      "author": "Harold W. Melius",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "My Camera Review",
      "text": "I really like the Older style, because the Features are good, but mostly because it uses AA batteries, more cameras should do this. Batteries can always be had, but fancy batteries and charges are expensive and cumbersome. AA Batteries always for me..",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20131201
    },
    {
      "title": "Nice Camera.... Nice pictures",
      "text": "Nice Camera....Nice pictures.. Easy... Controls would have been nicer if they were on the bottom or side, give me more room for my big hands,,, sometime i press the wrong buttons. Maybe a touch screen menu would be better",
      "rating": 5.0,
      "verified": true,
      "author": "G. Lawrence",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Better than average point and shoot",
      "text": "Very impressed by 16 megapixels and x 32 lens. Pictures are clear and beautiful. Drawbacks: a little heavier than the average point and shoot you have to manually open the flash, and no matter how many times I have set time, date, etc, it keeps showing up every time I turn the camera on.",
      "rating": 4.0,
      "verified": true,
      "author": "Leslie Frankel",
      "helpful_votes": 0,
      "publication_date": 20130815
    },
    {
      "title": "Good buy!",
      "text": "All's good. Excellent picture quality and very durable. Just that you have to manually pull out the flash every time you need it. Well I already knew it before buying so can't complain.",
      "rating": 4.0,
      "verified": true,
      "author": "Sakura Avelon",
      "helpful_votes": 0,
      "publication_date": 20140723
    },
    {
      "title": "love my canon",
      "text": "this baby takes beautiful photos . delivery was fast and the price was right . it took me some time to get used to seting the picture up with the screen as it does not have a view finder . easy to use , even with all the functions .",
      "rating": 5.0,
      "verified": true,
      "author": "ang nc",
      "helpful_votes": 0,
      "publication_date": 20131113
    }
  ],
  "product_meta": {
    "title": "Canon PowerShot SX160 IS 16.0 MP Digital Camera (Old Model) with 16x Wide-Angle Optical Image Stabilized Zoom with 3.0-Inch LCD",
    "description": "Color:BlackThe Canon 6354B001 PowerShot SX160 IS 16MP Compact Digital Camera, in black, offers a powerful 16x optical zoom lens enabling you to shoot photos and videos that cover the full spectrum of focal lengths. From wide-angle 28mm shots of friends gathered 'round the dinner table to standard length shots of landscapes and even telephoto shots of animals, sporting events and close-up portraits, the SX160 has you covered. The Intelligent Optical Image Stabilization system recognizes the different conditions that can cause a shaky, blurry image and corrects them so your long zoom, fast action and low light shots are delivered sharp and stunning. It houses a 16MP CCD sensor and DIGIC 4 Image Processor. The SX160 also captures video in 720p HD and with the HDMI output, you can connect your camera to your HDTV and screen your videos in gorgeous HD moments after you shoot them. If you don't carry your HDTV around with you, use the camera's large 3.0-inch LCD screen to compose and display your images. It come along with the \nPowerShot SX160 IS Body, 2 AA-size Alkaline Batteries, Wrist Strap WS-800, USB Interface Cable IFC-400PCU, Digital Camera Solution CD-ROM.\n\n\nFROM THE MANUFACTURER\n\n\nTurn Memories Into Memorable Images You'll want to carry this compact, versatile camera everywhere, because it gives every shooting opportunity the potential to become a beautiful image. The spectacular 16x Optical Zoom with 28mm Wide-Angle Lens and Optical Image Stabilizer captures clear, vivid images whether your subject is up close or far away. And with the 16.0 Megapixel sensor and Canon DIGIC 4 Image Processor, every detail is precisely rendered for truly impressive image quality. The PowerShot SX160 IS captures breathtakingly realistic 720p HD video in stereo sound with the\n\nPRECISION CANON OPTICS\n\n\nPOWERFUL 16X OPTICAL ZOOM WITH 28MM WIDE-ANGLE LENS\nThe PowerShot SX160 IS features a powerful Genuine Canon 16x Optical Zoom Lens that delivers outstanding optical performance and versatility. With precision engineering and decades of leadership in optical technologies, Canon has created a bright, wide-angle lens that provides an extraordinary 16x zoom range. The lens starts at 28mm wide-angle and extends to 448mm telephoto (35mm equivalent), giving you tremendous coverage and reach. The telephoto end lets you capture subjects from a considerable distance, while the 28mm wide-angle makes it easy to shoot sweeping landscapes, large groups of people and tall buildings. Moreover, this superb lens incorporates innovative designs that enable it to fit the compact profile of the PowerShot SX160 IS.\n\n\n\nOPTICAL IMAGE STABILIZER\nHandheld shooting can often lead to camera shake, making photos and videos blurry. Canon's Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical in more shooting situations, providing excellent image quality in many difficult situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For still photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.\n\n\n\n\nPOWERFUL CORE SPECS DELIVER BEAUTIFUL IMAGES\n16.0 MEGAPIXEL IMAGE SENSOR\nThe PowerShot SX160 IS's 16.0 Megapixel CCD sensor delivers impressive photos with fine detail and brilliant color. The high resolution ensures superb image quality even when cropping or making very large prints.\n\nCanon DIGIC 4 Image Processor Canon DIGIC Image Processors have set the standard for functionality and performance since their groundbreaking introduction in 1999. With each successive generation, DIGIC Image Processors have brought elevated performance and powerful new features to PowerShot digital cameras. The DIGIC 4 Image Processor has ushered in a new level of picture quality and accelerated processing, making possible features such as high-speed continuous shooting, HD video and Face Detection Self-timer. New, more powerful noise reduction algorithms also provide improved low-light capture.\n\n\nPRESERVE AND SHARE YOUR MEMORIES IN SPECTACULAR HD\nCANON HD VIDEO ADVANTAGE\nThe PowerShot SX160 IS lets you record highly detailed 720p HD video at 25 frames per second with clear stereo sound. Imagine the fun and excitement of being able to shoot high definition video whenever you want, right from your compact digital camera. Watching your videos and sharing them with family and friends is especially easy with the camera's HDMI output: you can connect the camera directly to your HDTV with an optional HDMI cable, and see your videos on the big screen right away.\n\nDEDICATED MOVIE BUTTON, WIND FILTER AND OPTICAL ZOOM WHILE SHOOTING\nIt's never been easier to shoot videos with a PowerShot digital camera. The PowerShot SX160 IS has a dedicated movie button that lets you start and stop recording instantly. The camera is always ready to shoot stills or video whenever you want. The camera also incorporates an electronic wind filter, which suppresses wind noise that can muffle or distort the sound. The PowerShot SX160 IS lets you use the full range of optical zoom when you're shooting a video without sacrificing HD video resolution.\n\nIFRAME MOVIE SUPPORT\nWith the PowerShot SX160 IS, you can also shoot video in the Apple iFrame format, which is a computer-friendly standard that speeds up importing and editing of videos. It keeps file sizes small, making it more convenient to upload or e-mail high-quality videos. The iFrame format enjoys native support in compatible Mac and Windows video applications, making it unnecessary to perform time-consuming and often quality-degrading conversions.\n\nSEE WHAT YOU'RE SHOOTING ON A CLEAR, BIG SCREEN\nLARGE 3.0-INCH LCD\nEasy to see from a wide angle, the camera's 3.0-inch LCD with a great resolution of approximately 230,000 dots gives you the big picture, whether you're shooting, reviewing or showing off your images. This high-resolution screen offers a crisp, clear picture to make shooting, playback and using the camera's menu functions especially convenient; it also features Night Display for easy viewing in low light.\n\nA SMARTER CAMERA MEANS BETTER PHOTOS AND VIDEOS\nSMART AUTO\nThe PowerShot SX160 IS features Smart AUTO: sophisticated Canon technology that makes getting that great shot as simple as pressing the shutter button. Smart AUTO automatically detects scenes by assessing various factors in both the background and the subject. Detected scenes are analyzed using 32 predefined shooting situations. The camera then makes optimal settings to ensure the best possible image capture, whether you're shooting stills or video. Smart AUTO also includes Advanced Subject Detection, which allows the camera to detect and track non-human moving subjects like animals and vehicles. With Smart AUTO, all you have to do is frame your shot and capture away.\n\nA STEADY IMAGE IS A BEAUTIFUL IMAGE\nINTELLIGENT IS\nThe latest advance in Canon Optical Image Stabilization technology, Intelligent IS, analyzes camera movement and applies the best shake correction method for the shooting situation. For stills, the system automatically selects among Normal, Panning, Macro (Hybrid) and Tripod IS modes. When shooting video, the system automatically selects among Dynamic, Powered, Macro and Tripod IS modes. With Intelligent IS, you can concentrate on image capture, letting the camera make the most effective IS settings to assure the steadiest possible image.\n\nNormal Corrects for a wide range of camera movement when shooting stills. Panning Panning motion is detected so that IS does not interfere with desired camera movement. Macro (Hybrid) Corrects for shift-type camera shake, which typically occurs in macro (close-up) shooting. Dynamic Effective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking. Powered Compensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified. Tripod When tripod use is detected, the Image Stabilizer is stopped because it is not needed. FASTER FOCUS HELPS YOU CAPTURE EVERY SHOT\nHIGH SPEED AF\nThe PowerShot SX160 IS is equipped with Canon's latest advancements in Autofocus (AF) technology. Working on multiple fronts, Canon has developed AF that is significantly faster than on previous models, for a shooting experience that's spontaneous and natural. The extremely responsive High Speed AF lets you capture great shots as they happen, with reduced lag time.\n\nSeveral engineering breakthroughs contributed to this major enhancement to speed. In addition to improved AF algorithms, the camera can process multiple sequences simultaneously, and takes advantage of reworked controls between AF and the start of shooting.\n\nPOWER WHEREVER YOU ARE\nAA BATTERY POWERED\nRecharging batteries can often be an inconvenience, especially when traveling in foreign countries. With the PowerShot SX160 IS, you'll never need special power adapters or chargers because it's powered by two AA batteries that are widely available around the world.\n\nA COLOR JUST RIGHT FOR YOU\nAVAILABLE IN BLACK AND RED\nWhile the classic black camera will always be right for a lot of photographers, Canon recognizes that others will long for colors that express their individuality. Accordingly, the PowerShot SX160 IS digital camera is offered in both black and red.\n\nADDITIONAL FEATURES\nFACE DETECTION TECHNOLOGY\nFace Detection technology makes it easy for you to take great photos of people. The camera will automatically detect the face(s) in a frame to give it optimal focus, exposure, flash (if needed) and white balance. Face self-timer adds convenience to Face Detection because you can set the camera to release the shutter when someone enters the frame.\n\nSHOOTING MODES\nPowerShot cameras offer shooting modes that make it easy to take perfect photos in a wide range of shooting situations by providing intelligent presets with optimized settings.\n\nSHOOTING MODES/SPECIAL SCENE MODES\nManual You have complete control of exposure, selecting both aperture and shutter speed manually. Aperture-Priority You set the aperture, controlling depth-of-field. The camera automatically selects the shutter speed. Shutter-priority You select the shutter speed to stop or blur action, and the camera finds the appropriate aperture. With slow exposure times, Canon's noise reduction system activates to ensure low image noise. Program Access advanced exposure compensation features while shooting mostly automatically. Smart AUTO The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity. Portrait The camera sets a large aperture, focusing the subject and artistically blurring the background to make your subject “pop.” Low Light For high quality image capture in an amazing range of dimly-lit situations. Snow Shoot clear snow scenes without darkened subjects or an unnatural bluish tint. Fireworks Grab brilliant images of skyrocketing fireworks. Creative Filters This setting provides easy access to special filter effects and scene modes, such as Toy Camera Effect, Poster Effect, Monochrome and more. Movie Record video in stereo sound. Unwanted scenes can be deleted in playback mode. iFrame Movie The Apple® movie format, iFrame, makes it easier and quicker to import and upload videos while retaining high image quality. Discreet Mode Disables flash, AF assist beam, and all camera sounds with one mode dial setting—so you can capture images in quiet areas. Live View Control Enables Brightness, Color, and Tone adjustments to your images using easy-to-understand controls. Face Self-timer The camera waits for a face to enter the frame before releasing the shutter. \nSPECIAL SCENE MODES WITH CREATIVE FILTERS\nSpecial Scene Modes have fun and creative filters you can add to your photos without having to use a computer. You can make a quirky portrait using a Fisheye Lens Effect or add a beautiful single-tone effect with Monochrome. Toy Camera Effect simulates a vintage look as if capturing the photo using a \"toy\" or pinhole camera. Make a scene appear like a small-scale model with Miniature Effect, when shooting from a high vantage point. Super Vivid enhances an image for bright, intense colors while Poster Effect alters the contrast of an image for poster-like presentation.\n\nAVAILABLE IN 30 LANGUAGES\nThere are now a total of 30 display languages from which you can choose: English, German, French, Dutch, Danish, Finnish, Italian, Norwegian, Swedish, Spanish, Simplified/Traditional Chinese, Japanese, Russian, Portuguese, Korean, Greek, Polish, Czech, Hungarian, Turkish, Thai, Arabic, Romanian, Ukrainian, Farsi, Hindi, Malay, Indonesian and Vietnamese.",
    "rating": 4.3,
    "feature_bullets": [
      "16 effective megapixel, 1/2.3-inch CCD sensor",
      "3-inch TFT color LCD with wide viewing angle",
      "DIGIC 4 image processor",
      "720p HD video with dedicated movie button",
      "28mm wide-angle lens with powerful 16x optical zoom and optical image stabilizer",
      "16x Optical Zoom with 28mm Wide-Angle lens",
      "DIGIC 4 Image Processor",
      "3.0-inch LCD",
      "720p HD video in stereo sound",
      "AA battery power"
    ],
    "specifications": {
      "Product Dimensions": "4.37 x 1.73 x 2.87 inches",
      "Item Weight": "10.2 ounces",
      "ASIN": "B00908BQCY",
      "Item model number": "6354B001",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.3 out of 5 stars816 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#87,233 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 20, 2012",
      "Manufacturer": "Canon",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}