{
  "website_summaries": [
    {
      "verdict": "A trio of slow-smoked, brined salmon fillets wild-caught in the waters of the Northern Pacific.",
      "pros": [
        "Certified kosher with a high-quality taste",
        "Includes 3 varieties",
        "Comes in a wooden box for gifting",
        "Rich in Omega 3 and packaged in individual foil pouches"
      ],
      "cons": [
        "Packaged in liquid, which some consumers don’t like"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This Salmon was not fit to eat.",
      "text": "This Salmon was not fit to eat. I was fooled by the numerous 5-star ratings for this product. One of the 1-Star ratings said that it was only fit to feed his cat. I strongly disagree, because if he did so he might be convicted for cruelty to animals. After opening one of the packages and being hit with the pungent awful smell, I immediately threw all packs in the garbage. I am a long-time Salmon lover, whether smoked or fresh. This product smelled like rotten tuna fish.",
      "rating": 1.0,
      "verified": true,
      "author": "Top Cat",
      "helpful_votes": 16,
      "publication_date": 20181102
    },
    {
      "title": "Salmon With A Twist and Great Taste",
      "text": "This fancy wooden container of fine smoked salmon is a real pleaser. I liked it so well that I ordered more for friends and family. You will think you have fresh salmon it tastes so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Compass",
      "helpful_votes": 10,
      "publication_date": 20180306
    },
    {
      "title": "Pop's loves it",
      "text": "I got this for my dad for Christmas because he loves smoked salmon and I saw the good reviews. He CALLED me once he had a chance to try it (and don't worry this isn't some cat-in-the-cradle relationship, we just talk in person frequently rather than by phone) to tell me it was the best smoked salmon he had ever had. He could not have been happier and I've already gotten it for him again for his birthday. I am very happy with my purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary G Wharton",
      "helpful_votes": 15,
      "publication_date": 20170320
    },
    {
      "title": "Excellent Product",
      "text": "Each of the three portions serves two people with a generous serving. The quality is just as good, if not better, than the Sea Bear trio package. Arriving in a wood box, the salmon looks like an actual gift, rather than just something bought off the Internet.",
      "rating": 5.0,
      "verified": true,
      "author": "michael r hall",
      "helpful_votes": 43,
      "publication_date": 20140513
    },
    {
      "title": "... favorable but got it anyway and hoped for the best. Gave it as a gift & the recipient ...",
      "text": "Was hesitant to purchase as some reviews were not favorable but got it anyway and hoped for the best. Gave it as a gift & the recipient loves it. He eats it with crackers, onions, capers, ect - when watching football - more as a hearty appetizer than an entree. He said he likes the variety of flavors and the box made a nice presentation.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 10,
      "publication_date": 20170201
    },
    {
      "title": "Dissappointed in quality",
      "text": "A small step above canned salmon. when I opened one of the vacuum sealed foil packages, as reddish type oil/water mixture ran out. The fish had no body to it, just a flaky mess of really wet salmon. I am not saying it was inedible, because a still we tried it with crackers and cheese. Bland taste with little smoke flavoring. It seemed like any smoke flavor had been introduced chemically and not by actual smoking. Great outside packaging though; shipped in a wooden box. They should save money on the packaging and put it into producing a better product.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Severson",
      "helpful_votes": 3,
      "publication_date": 20190309
    },
    {
      "title": "Definitely worth trying",
      "text": "We've always bought the \"amazon preferred\" brand of smoked salmon, but after seeing this one was less expensive, still wild caught, and you actually get more ounces, we had to give it a try. We had our first packet this morning, and loved it. I can't imagine how the wooden box and higher weight of the salmon, could actually cost less, but this will be our go to product from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "lo24",
      "helpful_votes": 4,
      "publication_date": 20180701
    },
    {
      "title": "Tasty smoked salmon",
      "text": "I love smoked salmon-- the salmon was great! It is a bit pricey, but I was told that I can't take \"it\" with me, so I might as well spend it on quality, great tasting smoked salmon. Another Amazon customer pointed out that the nutrition information is incorrect-- instead of 1 or 2 grams of carbohrates per serving-- it must be about 15 grams, Also-- brown sugar is listed as an ingredient ...if less than 1 gram/serving, FDA allows stating zero grams and zero calories for the sugar,",
      "rating": 4.0,
      "verified": true,
      "author": "Tintinnabulation",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Not \"Smoked\" Salmon - Tasted Like Canned Salmon!",
      "text": "This salmon is not smoked! There is liquid in the bag just like processed can salmon which is exactly what it tastes like. I have eaten a lot of smoked salmon and this it not it. Beware that you cannot return it! I am now stuck with two additional packets of this unacceptable product. Don't buy this!",
      "rating": 1.0,
      "verified": true,
      "author": "Meeche White",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great Salmon great price!",
      "text": "What a great buy! Such a good price and the perfect gift. I bought this for my mom just on a whim to surprise her and she was absolutely amazed. She adores smoked salmon and said that it is one of the best she has ever had! She asked me to order it for her for Christmas every year. Guess we have a new tradition! I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Kay Mews",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Great product",
      "text": "Product was excellent But pepper was a little too peppery Not too salty Salmon quality was excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Bektrom",
      "helpful_votes": 4,
      "publication_date": 20171012
    },
    {
      "title": "EXCELLENT TASTE",
      "text": "I don't get out in the big lake to fish for salmon anymore, and this is great stuff, smoked correctly. Too many these days are smoked inadequately, but these people know how to do it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "you get three packages perfect portions",
      "text": "I like the two of salmon and the fact that its packaged in 3 portions. The flavor is very good but too much excess packaging with the fancy wood box and then another cardboard huge amazon box",
      "rating": 5.0,
      "verified": true,
      "author": "jessica Kay",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "This satisfied my craving for smoked salmon",
      "text": "This satisfied my craving for smoked salmon. Being on the east coast it is hard to find good smoked salmon. I would buy this again.",
      "rating": 4.0,
      "verified": true,
      "author": "Veronica",
      "helpful_votes": 3,
      "publication_date": 20170711
    },
    {
      "title": "No",
      "text": "Too salty and tasted like canned salmon. Nothing like the nova lox we are used to using on our bagels.",
      "rating": 1.0,
      "verified": true,
      "author": "MC",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Pleased with Large Wooden Presentation Box",
      "text": "Huge Box was a pleasant surprise, since the salmon was a gift for Mom and Dad who would never indulge on their own. Came in 3 diferent sealed pouches for a long lasting treat. Very impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "debra banks",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Excellent Smoked Pacific Salmon at a reasonable price",
      "text": "My favorite was the smoked Sockeye. I gave it a 4.5 out of 5 rating. The smoked Pink and Peppered Sockeye were almost as good, so I gave them a 4 rating. The Peppered Salmon is quite peppery, so maybe not for all. I will be re-ordering this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Kittiwake",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Wonderful flavor and texture",
      "text": "I love this smoked salmon and its versatility in so many recipes but will stop buying it if they keep going up on the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Nola Guy",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Smoked salmon trio",
      "text": "I like my smoked salmon trio but the recipe leaves much to be desired. I had to look for my own recipe for the third one. What do I do with the wooden box?",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca Sekse",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Wonderful for salads and snack",
      "text": "Love the Box and Salmon Taste Great, just right size for salads & snack",
      "rating": 5.0,
      "verified": true,
      "author": "Verna Long",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Good Salmon with skin attached",
      "text": "I was pretty skeptical buying seafood I couldn't see first. The quality and flavor was great. It's moist with the skin attached, but the skin is soft and comes off with bits. If that bothers you this probably isn't for you, otherwise it's a great product and I would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob from Marketing",
      "helpful_votes": 6,
      "publication_date": 20151226
    },
    {
      "title": "Best dad in the world",
      "text": "I live in the UK, my daughter lives in the USA. We Brits are more than partial to our Smoked Salmon! How do you give your daughter who is 3000miles away a special surprise gift? I sent her the 22oz trio she was so pleased that 2 months later I sent her another one. At the moment I'm definitely the best dad in the world. They make a great product and deliver on time.",
      "rating": 5.0,
      "verified": true,
      "author": "cameron",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Delicious!",
      "text": "We treat ourselves to this smoked salmon several times a year (birthdays, anniversary, Christmas) and greatly enjoy it each time we get it. Goes great with pasta, great on crackers, great in an omelet.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas B.",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Must try great smoked Salomon",
      "text": "Must try great smoked Salomon! I am very picky, especially with seafood. But this is mild on fishy taste, love it whither cream cheese and a bagel. Trust me amazing yummmmm",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "The birthday boy said \"it is good\"",
      "text": "This was a birthday present. I had to buy a differnt brand as the one I usally get was not availble. My friend said it was really good!",
      "rating": 5.0,
      "verified": true,
      "author": "Gay l Boyd",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Poor quality and no customer service follow",
      "text": "Salmon fillet had a problem, no quality control. I reached out to the company with several emails and photos and no reply. I called the company and left voicemails and no reply",
      "rating": 1.0,
      "verified": true,
      "author": "TS",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Best gift for my Brother in Law",
      "text": "It arrived on time and he says the salmon is delicious!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Great Product",
      "text": "Absolutely wonderful product. Any of the three varieties is just great. Wish it were cheaper, by Salmon is expensive and your product is worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Don K.",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "This salmon smells like trash when you open it",
      "text": "It smells just like trash when you open it so don’t buy it and there’s no return",
      "rating": 1.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 2,
      "publication_date": 20190519
    },
    {
      "title": "Simply Delicious",
      "text": "I love it, it's great with salad or a simply with crackers. Awesome for pescatarians.",
      "rating": 5.0,
      "verified": true,
      "author": "Allisia Christie",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Delicious",
      "text": "\"Delicious. Very easy to cook with. I like the box a lot.\" -Receiver of salmon",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "The gift was enjoyed and was a great surprise.",
      "text": "This was a bday gift for someone going on a camping trip to celebrate. it was perfect for them. I got a postcard saying they enjoyed it each night their trip and that it was delicious..",
      "rating": 5.0,
      "verified": true,
      "author": "Laura L.",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Great choice!",
      "text": "The variety of this option is perfect for a meal for two (with enough remaining for a snack) or hors d'oeuvres for several. Add wine or champagne! We try to order monthly.",
      "rating": 5.0,
      "verified": true,
      "author": "Franklin P. Cawthon",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "He loved",
      "text": "Bought for my dad on father's day. He loved it",
      "rating": 5.0,
      "verified": true,
      "author": "dave",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "An appreciated gift.",
      "text": "I send this to out of state relatives and get good feedback. Have not tried it myself.",
      "rating": 4.0,
      "verified": true,
      "author": "RK",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "THE BEST SALMON SO FAR!!",
      "text": "So far this is my second purchase and I can tell from my experience that is absolutely delicious and tasty, it really taste as a real and wild salmon.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara H",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "great for brunch",
      "text": "served with cream cheese and thinly sliced red onion on bagels, excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "DALE BRYAN MATTES",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Five Stars",
      "text": "It was a gift and they said they enjoyed it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald E.",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "freshly packed and Wonderful taste!",
      "text": "So far I've only tried the peppered Salmon and made a spread using my own secret recipe. Perfectly smoked, freshly packed and Wonderful taste!",
      "rating": 5.0,
      "verified": true,
      "author": "Deadwood",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Five Stars",
      "text": "Ordered 2 Boxes and Am Positive we will order more for ourselves and for Gifts!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn M.",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Five Stars - Beautiful Box",
      "text": "Bought for my father who is from up north. He was very happy to see Fairhaven on the label - said it had to be good! The next morning he sent me a message saying how delicious the salmon was and that he put some more in his wish list should I ever have the urge to buy this for him again, lol. Needless to say, VERY happy with my purchase for my father who is not easy to please in the food department :)",
      "rating": 5.0,
      "verified": true,
      "author": "meljoj",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Overrated",
      "text": "Sent to my son for xmas..stunk up house..slimy..not worth buying..cats might like it..threw it in garbage",
      "rating": 1.0,
      "verified": true,
      "author": "R. Sandberg",
      "helpful_votes": 2,
      "publication_date": 20171222
    },
    {
      "title": "Fantastic!",
      "text": "Fantastic! Great gift for my Aunt the smoked salmon lover!",
      "rating": 5.0,
      "verified": true,
      "author": "Dee Myers",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Five Stars",
      "text": "I buy this product for my mom. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiger Bob",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "Not what I expected it is vacuum packed with some ...",
      "text": "Not what I expected it is vacuum packed with some oil/water substance . I would not buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "john siemer",
      "helpful_votes": 2,
      "publication_date": 20150425
    }
  ],
  "product_meta": {
    "title": "Smoked Salmon Trio, 22 Oz in Wood Legacy Gift Box",
    "description": "We use only the freshest, wild Alaska sockeye and pink salmon from the frigid waters of the Northern Pacific. Unlike lox or gravlax portions, which are cold cured and come thinly sliced, or jerky which is dried, our fillet pieces are brined in a special brine using our unique blend of spices, and then slowly smoked over a traditional alder wood fire. Packaged in 3 individual foil pouches containing 8 oz. natural smoked sockeye, 8 oz. natural smoked pink and 6 oz. peppered sockeye for that extra zesty taste. Our products are Certified Kosher and have NO PRESERVATIVES. Each juicy fillet piece is rich in healthy omega 3 oils, making this one of the healthiest treats you can buy. Sealed in individual foil pouches and processed to guarantee that unforgettable fresh smoked salmon flavor, NO REFRIGERATION is required until you open the pouch. This product offers only the best. RECIPES INCLUDED! Check out the rest of our products here on Amazon! All of our products are smoked, cured and packaged in Bellingham, WA. Product package contains only the smoked seafood. Herbs, crackers, cheese, beverages and other display elements are for suggested use only and not included in shipment.",
    "rating": 4.3,
    "feature_bullets": [
      "Wild Alaska smoked salmon, sockeye and pink, from frigid Northern Pacific waters. An ideal smoked salmon gift box for any occasion..",
      "Wild caught using sustainable fishing practices. Comes packed in reusable wooden box with sliding lid for great gift appeal.",
      "Our smoked salmon is an elegant gourmet sampler that is rich in protein, gluten-free, low salt, low sugar and high in Omega-3 fatty acids",
      "Three pouches per 22 oz. box- 8 oz. Sockeye, 6 oz.Peppered Sockeye and 8 oz. Pink. Delicately flavored; hot-smoked and packed in natural juices. RECIPES INCLUDED.",
      "Ready to serve smoked seafood; Certified Kosher; sealed in foil pouches for extended shelf life. Perfect protein for your pantry."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "18 x 7.6 x 1.8 inches; 2.21 Pounds",
      "UPC": "713757137911",
      "Manufacturer": "Fairhaven Bay Seafoods",
      "ASIN": "B009BTIJ22",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grocery & Gourmet Food",
      "Jerky & Dried Meats",
      "Snack Foods"
    ],
    "price": 41.99
  }
}