{
  "website_summaries": [
    {
      "verdict": "A large massage bolster that offers firm support at a price that can't be beat.",
      "pros": [
        "Memory foam adjusts to your body",
        "Two-layer design provides extra comfort",
        "Wide enough to support both legs comfortably",
        "Firm support",
        "High-quality Egyptian cotton cover"
      ],
      "cons": [
        "This bolster is too firm for some users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Is this a joke? WTH? UPDATE after having it",
      "text": "OK, well I am updating this review and increasing star rating only because it took a couple days for the memory foam to fill completely out and it is more full now. Also now that I've used it a while I can say it works great for neck support, I use it on my side when sleeping sometimes and between the knees also. Great pillow. OLD REVIEW: Uhhhh, is this a joke?? (See photos) not like the photo of the products. It’s tiny, flat and not that supportive nor is it very large. This is a joke. Seriously, a joke. Where is the zero STAR selection?",
      "rating": 4.0,
      "verified": true,
      "author": "Johnny M",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "The product really helps your body while you sleep.",
      "text": "I purchased this item originally for my son due to the fact that he has a curved spine due to many years of video game and computer usage. At first, he wasn't optimistic that it would help. After just a few days, he told me that it is really making a difference and he sleeps with it under his knees to help properly align is spinal curve while he sleeps. I have now purchased this item a total of 3 times. In addition to buying it for my son, I also bought it for my Mother, and for me. I love It.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette S.",
      "helpful_votes": 3,
      "publication_date": 20170619
    },
    {
      "title": "Not Malleable",
      "text": "Okay. I got this to use as a back support but it's so firm I can't use it as such, so I tried using it the way it's supposed to be used -- but it's kinda really not malleable and feels like a trunk of wood (well, half of it). I guess that's what it's supposed to be like, but I don't know. Kinda stiff, ya know.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 5,
      "publication_date": 20170629
    },
    {
      "title": "Great size, nice support, not too squishy",
      "text": "Great support pillow! I bought it to use under my knees in my new recliner to prevent sciatic nerve pain. It's firm enough to do the job without being too firm and it's long enough to fit under both knees across my recliner. I wish they had one that was not quite so high up, as that would be perfect, but this one is doing the job. It would also work well as a back support. I like the fact it comes with a washable cover, just wish the cover fit a little more snugly, but maybe that's to allow for shrinkage. I haven't had to wash it yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Petunia",
      "helpful_votes": 2,
      "publication_date": 20170417
    },
    {
      "title": "Good Quality, Usefullness For Me Wasn't There",
      "text": "Seems durable enough; pretty stiff memory foam which I expected. It's not flimsy at all. I don't think it's provided good support for my purposes in my lower back but then again I haven't found anything that does. It'll stay put wherever you place it on your couch or bed, that's for sure. It grips other fabric well and stays in place. Be wary of others like this that are too soft. Not sure if it would hold up over weeks or months of daily use because I didn't use it like that. It seems to be very high quality memory foam and would hold up as well as any other though.",
      "rating": 4.0,
      "verified": true,
      "author": "J. HurleyTop Contributor: Cycling",
      "helpful_votes": 3,
      "publication_date": 20150326
    },
    {
      "title": "Works GREAT!",
      "text": "My adult son with special needs always needs support when he sleeps or sitting for comfort. This helps him so he is more comfortable. He uses it under his knees or on his side while he sleeps it has help re leave the pain he was feeling while trying to sleep. He said he needs another one so he can use it anywhere. Very happy with this pillow support product.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Not a Firm Support, but Still Okay",
      "text": "Considered returning this when it first arrived, but kept it out of curiosity. I ordered this to use to alleviate some pain in my lower back, similar to pillows at my chiropractic. Disappointed in the firmness of the pillow, as it is described as a \"hard support\" or \"durable foam\". It goes near-flat when laying down on it. However, it does provide enough support to help a little but is not the firmness I was aiming for. When it arrived, I wasn't convinced I received the right item as it was squished as tightly as it could be into a shrink-wrapped blob that took two hours to re-inflate to the proper shape.",
      "rating": 3.0,
      "verified": true,
      "author": "medwards1",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "Nice firm pillow for under your knees.",
      "text": "When I opened the box I thought this thing cannot be any good as it was vacuumed packed and smashed into a small bundle. But after I opened it and it filled out it was fine. It is stiff enough that it does not crumble under your knees and soft enough to feel good. It came with a nice cover also. If you are looking for something to lift your knees a little while you sleep, this works well. Can also be used between your knees if you sleep on your side.",
      "rating": 4.0,
      "verified": true,
      "author": "james davis",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "and it's easy to position between my knees when I'm on my ...",
      "text": "This is exactly what I have needed for so many years. The pillow is firm but its profile is small, so it elevates my knees perfectly when I'm on my back, and it's easy to position between my knees when I'm on my side. No more folding pillows throughout the night. The first night I had with this pillow told me that it and I will have a beautiful future together.",
      "rating": 5.0,
      "verified": true,
      "author": "Lazserus",
      "helpful_votes": 3,
      "publication_date": 20160509
    },
    {
      "title": "Nice Support Pillow!",
      "text": "This is working out very well for me in bed for a knee prop when I am sleeping on my side or for putting against my back when I am sleeping on my side. Has Just enough give to be comfortable and does not squish down much. I think I need another one, since right now I just have one so I have to still prop my knee with another pillow when i am using this one against my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Ella Belle",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "Exactly what I needed.",
      "text": "Received it this afternoon planning on using it for my clients when I do their eye lash extensions. It came with a pillow case for it with a nice zipper.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy L Robles",
      "helpful_votes": 4,
      "publication_date": 20170927
    },
    {
      "title": "Good Value",
      "text": "I have been using this support pillow for about 2 months now and it has not flattened or lost it's shape like others do. It does a good job of supporting the knees and back when lying on your back. The pillow comes with a removable and washable cover.",
      "rating": 5.0,
      "verified": true,
      "author": "J. A. Hernandez",
      "helpful_votes": 5,
      "publication_date": 20160628
    },
    {
      "title": "It Works Okay....",
      "text": "I use it all the time, but wish it were designed a bit differently. I like how much it raises the knees, but it would be more comfortable if it were designed like a more forgiving speed bump with a more shallow drop off rather than a severe speed bump with a severe drop off. During use after several hours, pressure builds up behind the knees, and I need to augment it with rolled towels on either side of it. But I still use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Lowther",
      "helpful_votes": 2,
      "publication_date": 20151006
    },
    {
      "title": "Nice and comfortable",
      "text": "I love that it's memory foam. I bought it to put under my client knees when I perform eye lash services. But once it set up, I sat down and tried it on my lower back for support . Looks like I need to order another. This one isn't leaving my house.",
      "rating": 5.0,
      "verified": true,
      "author": "kelli",
      "helpful_votes": 2,
      "publication_date": 20180212
    },
    {
      "title": "Does the trick",
      "text": "I got this to put under my knees while in bed. I was having some lower back issues, and this size gave me the comfortable support I needed to take the pressure off my lower back. I'm very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Thomas",
      "helpful_votes": 57,
      "publication_date": 20130722
    },
    {
      "title": "Dual Purpose Pillow.",
      "text": "Purchased as marital aid. Works great for angles, submission work, and ground & pound. Also not too bad of a neck pillow when watching TV. Wife loves it. Has a washable slipcase.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Brown",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "Very good purchase",
      "text": "Recovering from a car accident and sitting and sleeping are painful without support pillows. This is useful as back support and under my knees, and is firm but still molds. The cover is a nice cotton with a zipper and looks decent, it has a zipper and goes on and off easily. The cover fits well and does not like a medical pillow. Super happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "melanie j larosa",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Finally a snoring solution!",
      "text": "I purchased this Four Position Support pillow about 3 months ago in hopes that it would help stop my snoring... and it did... 100%. I sleep on this along with the foam wedge bed pillow and with proof from my SnoreLab app, not one bit of snoring all night long. I admit it took a couple months to really get use to sleeping in the raised position, but it works perfectly. There is no smell at all... love the zipper cover for easy cleaning. If you are looking for a way to stop your snoring, DEFINITELY give this a try!",
      "rating": 5.0,
      "verified": true,
      "author": "kcm",
      "helpful_votes": 6,
      "publication_date": 20150305
    },
    {
      "title": "This product page lies",
      "text": "This page says that this pillow is made of memory foam, but it really is made of polyurethane foam which is firmer and nowhere near as viscoelastic. I am using as a foot reset under my desk instead of as a pillow for this reason (I ended having to buy a completely different support pillow for normal use).",
      "rating": 1.0,
      "verified": true,
      "author": "Lyova",
      "helpful_votes": 6,
      "publication_date": 20150228
    },
    {
      "title": "Use every night!",
      "text": "I use this every night, and it is perfect to help me keep a good posture as I sleep on my back. Very comfy and perfect to keep my knees elevated!",
      "rating": 5.0,
      "verified": true,
      "author": "Milhouse",
      "helpful_votes": 2,
      "publication_date": 20170108
    },
    {
      "title": "Everything I was looking for",
      "text": "I got this to go with the wedge pillow in hopes of keeping me from sliding off the wedge. It is very supportive and the memory foam on the curved side is very comfy. The zippered cover is great! It stays in place, almost like it's been attached to the sheet with velcro. It keeps my knees elevated and they don't hurt nearly as much in the morning as they did before this support pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "ladysings",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "I'm still glad I got it because it will serve multiple purposes",
      "text": "I've lived to the age where I need some elevation to my knees when I sleep on my back. This product is very firm so I have to sometime switch to a bed pillow to roll under my knees. I can start out using it, but by and by during the night it becomes too rigid for my comfort.It IS just what it says it is, thus, the description was true to what I received. I had no idea how it would work for me. I'm still glad I got it because it will serve multiple purposes.",
      "rating": 4.0,
      "verified": true,
      "author": "Sweetie#8",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "This was alright but didn't help take the pressure off ...",
      "text": "This was alright but didn't help take the pressure off my lower back as I hoped it would when I put it under my knees. Used it once or twice at the most.",
      "rating": 2.0,
      "verified": true,
      "author": "M Hollman",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Support Pillow",
      "text": "I have had several back surgeries. So sleeping on my back with my knees supported is the only way I can sleep. I was using a pillow but they didn't give me the support I needed, they were too soft. But this support pillow is wonderful! It does not get soft, it stays firm and supportive.",
      "rating": 5.0,
      "verified": true,
      "author": "VickiLynn Gongwer",
      "helpful_votes": 0,
      "publication_date": 20160601
    },
    {
      "title": "Too high",
      "text": "I'm returning it. Not really comfortable. The pillow is too high, to begin with - kinda the whole purpose of half-pillow is gone... And the base material, the foam, is a \"hot kind\", not a lot of breathing, which is quite common though for this type of pillows.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "After doing some research on best sleeping techniques I heard about giving support to your ...",
      "text": "After doing some research on best sleeping techniques I heard about giving support to your knees while you sleep. This pillow provides great support (not too hard, not too soft). I have been experiencing lower back pain, and using this pillow has helped decrease the pain level. You can use it when sleeping on flat on your back, or on you side. The size is just right, and it does not bother my wife on her side of the bed. I am happy with my purchase. I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Emerson",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "The purpose was to help with sleep because I'd like to sleep on my back more often rather than ...",
      "text": "I am in my early 30's with spondylolisthesis (basically, a slipped vertebra at L5/S1) and I bought this to put under my knees because bending them releases a lot of pain/tension in my lower back. The purpose was to help with sleep because I'd like to sleep on my back more often rather than my side (and belly is too uncomfortable with my spine anyways). Unfortunately, while a good product I imagine, it didn't work for me. It was too low to the bed and I am now looking for a higher pillow that will raise my knees much more.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele Reyes Marquez",
      "helpful_votes": 0,
      "publication_date": 20141224
    },
    {
      "title": "I do not feel good when I put it under my knees",
      "text": "I do not feel good when I put it under my knees. But when I put it on my back, and on my couch, OMG! It's so comfortable! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "JUN ENG",
      "helpful_votes": 0,
      "publication_date": 20171003
    },
    {
      "title": "Hard as a rock! I've tried using this a ...",
      "text": "Hard as a rock! I've tried using this a number of nights on different beds and in different positions but I can't stay on it for longer than 20 minutes without quite a bit of discomfort. Its just too firm and inflexible.",
      "rating": 2.0,
      "verified": true,
      "author": "Emily's Mom",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "Great after surgery sleep aid!",
      "text": "Love this. After 2 knees replacements and a hip replacement this pillow under my knees allows me a great night’s sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean S.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "A firm leg pillow.",
      "text": "The pillow was too firm for me and not long enough.",
      "rating": 3.0,
      "verified": true,
      "author": "big r",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Excellent price and durability",
      "text": "Excellent price and durability. This is working perfect for under my knees when I sleep (on my back only). It helps out with back pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Scottsdale mom",
      "helpful_votes": 2,
      "publication_date": 20170102
    },
    {
      "title": "Poor Presentation",
      "text": "I kept the case but the actual pillow was a lost. Cheap and flat. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Paw",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Bought for placement under hip for side sleeper",
      "text": "I bought this product to fit under my hip when I sleep on my side. I was worried it would be too soft and would not provide enough support, but I have been quite happy with the firmness. It is very supportive and after 2 months of use, the middle of the pillow (where the most pressure is put) is just as firm as the outside edges of the pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "I recommend this product.",
      "text": "I use this product each and every night, it's very comfortable and affordable.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Rhodes",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Kinda stiff but still gets the job done",
      "text": "This does what it is supposed to do but is just a tad too firm for my taste. I find myself throwing a thick comforter over this as to smooth out the transition and fill in the gaps between my legs and the bed. The material it is made out of sticks to my sheets pretty well too so it stays in place. I would say that I have gotten my moneys worth.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Loomis",
      "helpful_votes": 0,
      "publication_date": 20150716
    },
    {
      "title": "Very Hard!",
      "text": "I didn't find it comfortable at all because it actually started hurting the backs of my knees. If you like firm then this is for you. It does seem to be well made.",
      "rating": 2.0,
      "verified": true,
      "author": "DPH4UGA",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "So after a long night working in the ER I use it under my knee's and watch TV it's wonderful even though its not what I was hopi",
      "text": "I was hoping this was smaller than advertised and could use as a neck pillow.....it's not. So after a long night working in the ER I use it under my knee's and watch TV it's wonderful even though its not what I was hoping for. Its very hard to find the neck pillows.",
      "rating": 5.0,
      "verified": true,
      "author": "Nursedana",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "It is a nice well made pillow",
      "text": "It is a nice well made pillow, but for both support of my neck and my lower leg it is too hard and doesn't conform at all. I thought it was more foam which may be my mistake.",
      "rating": 4.0,
      "verified": true,
      "author": "Danny's wife",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "great little pillow",
      "text": "great little pillow, am using it more for feet than for back, but is comfortable, like that it has removable washable cover, nice support, not too firm but supportive",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca Browning",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Too firm",
      "text": "The size and shape is perfect. It unfortunately is too firm. My feet go numb after a short period of time with it putting too much pressure on the back of my knees",
      "rating": 2.0,
      "verified": true,
      "author": "Stacie ",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Brought pain relief to cancer patient",
      "text": "I bought this for my Uncle who had very painful cancer throughout his body. It brought him great comfort and was easy for him to arrange where he needed it to help with pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Rockin21Ranch",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Supportive, my husband loves it.",
      "text": "I bought to replace a lost one, for my husband. He loves it. I on the other hand cant sleep on it all night. I might need to get use to it. Maybe goid for naps for now. It comes with a zippered cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina Mason",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Is okay. A little smaller than I thought and ...",
      "text": "Is okay. A little smaller than I thought and need. and wanted. I wouldn't say the seller mis-presented the item though.",
      "rating": 4.0,
      "verified": true,
      "author": "Designer G",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Great for restorative stretching",
      "text": "Great for my lower back stretches. It's too stiff to sleep on all night, I can only lay on this for 5-7mins under my lumbar. It's a harder foam, not soft enough for the neck. I practice yoga regularly. Found this to be a great, softer alternative compared to a hard foam roller, I prefer to relax on this memory foam instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Annelise",
      "helpful_votes": 0,
      "publication_date": 20140902
    },
    {
      "title": "It is working out as a most excellent knee pillow for me now",
      "text": "I originally bought this to try to use as a neck support pillow. Unfortunately it is too large for that purpose. However, for it's advertised uses, I *LOVE* this pillow! It is working out as a most excellent knee pillow for me now!",
      "rating": 5.0,
      "verified": true,
      "author": "V. J.",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Hard",
      "text": "Light weight and hard as a rock. Low quality foam core... probably has half inch of memory foam on the outer layer. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "wildelmo",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "They’re so awesome that we ordered 2 more!",
      "text": "We absolutely love our pillows. I used mine on my neck - best sleep ever! We just bought 2 more!",
      "rating": 5.0,
      "verified": true,
      "author": "N. Scott",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "but it is a bit too high to be comfortable. I haven't found another use for it yet",
      "text": "Thought this would work well under my knees at night, but it is a bit too high to be comfortable. I haven't found another use for it yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Liz FlaglerTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20151210
    },
    {
      "title": "Bigger than I anticipated.",
      "text": "Its HUGE. Much larger than what I was attempting to replace and for me not comfortable. However its good quality and just took a day to fully expand from its compressed shipping size. Had a bit of a smell when opened, but it was gone by the time it fully expanded.",
      "rating": 3.0,
      "verified": true,
      "author": "Bastet",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "Caused hip pain",
      "text": "Didn’t work for me. I think it’s too high. It causes me to have hip pain. I’m 5’ tall.",
      "rating": 1.0,
      "verified": true,
      "author": "KarenR",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Great product for a massage table",
      "text": "at first thought it was a bit soft but after leaving out for a few hours it became surprisingly much firmer. Great product for a massage table.",
      "rating": 5.0,
      "verified": true,
      "author": "Clark B. Jones",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Perfect and firm",
      "text": "Just what I was hoping for! I use it in my facial treatments for my clients to rest their legs on. Fits perfectly under the knees and is soft yet firm. It came with a washable cover which was great. Good purchase and I got it for a good price. Love Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "MakeupartistJen22",
      "helpful_votes": 0,
      "publication_date": 20160729
    },
    {
      "title": "Fantastic product! I use this on my adjustable Sleep ...",
      "text": "Fantastic product! I use this on my adjustable Sleep Number bed when my fiancé and I watch movies because, for some reason, the back of the bed doesn't actually adjust to a 90 degree angle (more like 75 degrees). This pillow keeps me from hunching over and straining my back / neck.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "Great Product.",
      "text": "I use this product in my massage business. Couldn't find a cover to fit yet though. That aside it is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "stan simmons",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Five Stars",
      "text": "Only complaint is it could be a bit wider to keep my knees from falling off the sides",
      "rating": 5.0,
      "verified": true,
      "author": "Some lady",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "InteVision Four Position Support Pillow",
      "text": "Pretty fast delivery with good packaging. The quality of the pillow is great; it's neither too soft nor firm, just about right for the leg support. Also the cotton cover can be taken out and washable, which is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Yang",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "However it’s soft but firm & works great.",
      "text": "Smaller than expected/ length wise. Probably should have paid attention to that. However it’s soft but firm & works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Collins",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "I bought this for support under my knees after surgery ...",
      "text": "I bought this for support under my knees after surgery. It's a little too high... it might soften up over time though?",
      "rating": 3.0,
      "verified": true,
      "author": "Ellyn M",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Super comfortable but does pile.",
      "text": "This has definitely piled some. BUT, it remains firm and comfortable and does exactly what I need it to do at night! I keep it under my covers at knee height so it is rarely seen. I am hoping to find a pillow case for it to cover the piling.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Marsh",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Not ideal for back sleepers",
      "text": "I bought this pillow to put under my knees in order to sleep more comfortably on my back. The pillow is slightly too firm and thick for me and causes my knees to bend more than is comfortable for me. It is a great lumbar support pillow in my work chair though!",
      "rating": 3.0,
      "verified": true,
      "author": "Gypsie14",
      "helpful_votes": 0,
      "publication_date": 20150805
    },
    {
      "title": "OK",
      "text": "Pretty useful depending on your specific needs, very dense pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul P",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Meah... pillow cover and pillow had ugly yellow stains",
      "text": "Pillow cover and pillow itself had ugly yellow stains... probably very old product",
      "rating": 3.0,
      "verified": true,
      "author": "Angelika",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "These pillows were easy to transport & alternate under hip areas to eliminate ...",
      "text": "Bought 2 pillows to use when my parents were being transported on stretchers to appointments. Very uncomfortable to stay on your back for long periods of time. These pillows were easy to transport & alternate under hip areas to eliminate pain/discomfort for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Ridley",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Just What The Doctor Ordered",
      "text": "My orthopedic doctor told me that I should be sleeping with a pillow between my knees when sleeping on my side. He also said to place a pillow under my knees when sleeping on my back. This pillow does the trick for both sleeping positions",
      "rating": 5.0,
      "verified": true,
      "author": "Shnan",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "A rolled up towel or blanket will provide better height and support if you need something for back ...",
      "text": "Too small. A rolled up towel or blanket will provide better height and support if you need something for back pain relief.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay Gee",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "Very firm but it gets the job done with keeping ...",
      "text": "Very firm but it gets the job done with keeping your legs rising or helping you sit up a bit",
      "rating": 5.0,
      "verified": true,
      "author": "Mskisses8",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Three Stars",
      "text": "I find it too hard for the neck and too large of a dome for my lower back.",
      "rating": 3.0,
      "verified": true,
      "author": "MedNerd",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Firmness and Zipper don't last.",
      "text": "Arrives flat and compressed but does inflate once packaging is opened. Does have an odor which does disappear once aired for 24-48 hrs. Love the length and firmness which doesn't go totally flat with compression until one year later. Cover is thin with large tags on the outside zipper seam which eventually makes the zipper defective.",
      "rating": 3.0,
      "verified": true,
      "author": "jlk",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "Love it!",
      "text": "I use this for side and back sleeping and it's great! I had used regular pillows for this purpose for at least ten years, but this is SO much better. Great price, too!",
      "rating": 5.0,
      "verified": true,
      "author": "AwesomeSausome",
      "helpful_votes": 0,
      "publication_date": 20170217
    },
    {
      "title": "If you need knee support in bed following back surgery--this is the one to buy !",
      "text": "I have had 3 back surgeries and have to sleep with a pillow under my knees. I have tried a lot of different pillows. This one is the BEST I have ever used. Does not mash down and is the perfect height and size to be comfortable to use.",
      "rating": 5.0,
      "verified": true,
      "author": "twosweet4",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "is better than the full length body pillow I bought at ...",
      "text": "This pillow stays firm. At first I felt it was a bit too short for side sleeping but I just had to get use to it. is better than the full length body pillow I bought at Costco eight years ago because the filling is now unevenly distributed and I've just thrown it out.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "Best item ever for Knees!",
      "text": "Perfect comfort for knees, whether in bed or on ottoman it feels so great, never slept better. Highly recommend this wonderful pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Arnold",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Five Stars",
      "text": "Am using it as a knee wedge to improve nighttime hip sleeping posture. It's very effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary  Kurzban",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Comfy",
      "text": "I have this on my reclining sofa and it works well for my bony back (6', 175 lbs). After unpackaging, it takes a little bit of time for it to grow into its shape (I was skeptical when I first saw it). It's fairly long -- fits perfectly on one reclining section of the sofa (any longer would be a problem).",
      "rating": 5.0,
      "verified": true,
      "author": "KA",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "This product is not like the picture--it is not really shaped like half of ...",
      "text": "This product is not like the picture--it is not really shaped like half of a cylinder. It is almost rectangular and basically flat. Also, the pillowcase that came with it had a tear that was several inches long along the zipper seam. I am keeping it because it works okay for lumbar support on one of my chairs and because I don't care about the pillowcase, but if you are looking for something that is actually rounded, or that provides medium to firm support, this is not it.",
      "rating": 1.0,
      "verified": true,
      "author": "E. Wallace",
      "helpful_votes": 10,
      "publication_date": 20151201
    },
    {
      "title": "Happy with quality!",
      "text": "Very nice pillow! Using it to prop up my knees while recovering from shoulder surgery. Will also use it on massage table my husband bought me for Christmas after my shoulder has healed,",
      "rating": 5.0,
      "verified": true,
      "author": "Sheri B.",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "I love the firmness of it too",
      "text": "I use it to relief the pressure on my back when lying down. I works well. I love the firmness of it too. Just placing it under my lower legs helps me to rest better. Haven't tried it for upper body yet, but considering ordering another for neck and shoulders.",
      "rating": 5.0,
      "verified": true,
      "author": "C. T. Jones",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "This is a small pillow for a smaller person. ...",
      "text": "This is a small pillow for a smaller person. FYI, I 'm 5'11 167. Too small for me. I'd look elsewhere. I wish I ordered something else.",
      "rating": 2.0,
      "verified": true,
      "author": "James Godin",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Very comfortable",
      "text": "These are great for lumbar support and under my knees. They're very versatile, I will order more when I need them. If you want a firm pillow in this shape, I would fully recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "K8co",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "I tried using this for some weeks. One thing ...",
      "text": "I tried using this for some weeks. One thing you may not expect is that it gets quite warm. For me, it is just a bit too short. I am 6'1\" guy, and I often found one leg would slide off. It's a bit too bulky for between the legs.",
      "rating": 3.0,
      "verified": true,
      "author": "Ambrose",
      "helpful_votes": 0,
      "publication_date": 20151224
    },
    {
      "title": "Three Stars",
      "text": "Good quality, just not high enough to provide real support.",
      "rating": 3.0,
      "verified": true,
      "author": "D V DeGee",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "This is now another thing I don't use but have around",
      "text": "This is ok but really not much lift for the knees. It is very firm which I liked but not big enough. It's too small for the legs. To big for the neck. And too firm to use for comfort.",
      "rating": 3.0,
      "verified": true,
      "author": "Candice",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "I hyper extend my knees while standing and lounging. ...",
      "text": "I hyper extend my knees while standing and lounging. I use in bed under my knees and if I'm on my stomach on the front of my ankles. This has really helped alleviate most of my daily knee pain.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle McCain",
      "helpful_votes": 0,
      "publication_date": 20170228
    },
    {
      "title": "I don't like that that it doesn't feel like a memory pillow",
      "text": "I put it between my legs to keep me from having pain in my pelvis, I don't like that that it doesn't feel like a memory pillow. It is too hard and I don't like it at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Great product!",
      "text": "I love this product. It is just right for under your knees. I bought it when I broke my sternum and still use it when I read in bed. Very comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Nunez",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Great pillow.",
      "text": "This is a good quality pillow to put under your knees or behind your back when sleeping. It is sturdy and the size it says it is. I was concerned it wouldn't be wide enough after my mother had hip replacement surgery but it was fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Jane",
      "helpful_votes": 0,
      "publication_date": 20160411
    },
    {
      "title": "Works great for my needs!!",
      "text": "This is perfect for getting pressure off my lower back when in bed by placing it at the bend of my knees! Love that is holds its shape. Would love to see a nice cover for it in various colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Jedi Nole",
      "helpful_votes": 0,
      "publication_date": 20160325
    },
    {
      "title": "Five Stars",
      "text": "Wife loved it. She says sleeping on it finally eliminated her back pain.",
      "rating": 5.0,
      "verified": true,
      "author": "FL Counselor",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Five Stars",
      "text": "Really well made and I like that you can wash the pillow cover.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordyn",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "This is a great pillow for back sleepers",
      "text": "This is a great pillow for back sleepers; works great for me and comfortable. If it was a bit longer, I'd give it five stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Quality product",
      "text": "Quality product, use it every day since my total knee replacement. Helps with my exercises and sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa C.",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Great for pregnancy",
      "text": "This pillow is great for between the knees in pregnancy, and it does not take up the entire bed like many pregnancy pillows. I like that it comes with a washable cover that can be easily removed as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Theatre Chick",
      "helpful_votes": 0,
      "publication_date": 20151021
    },
    {
      "title": "Can't get comfortable with it",
      "text": "I had high hopes for this, but the bump is too tall. Can't get comfortable with it. Need a shorter one.",
      "rating": 3.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "I was surprised and satisfied by the firmness of this pillow",
      "text": "The pillow arrived before the expected date. I was a little concerned by the fact it was all rolled up, but after following the instructions to allow it to expand, I was surprised and satisfied by the firmness of this pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce L. Sarquist",
      "helpful_votes": 0,
      "publication_date": 20141129
    },
    {
      "title": "Sometimes a lumbar pillow makes all the difference",
      "text": "We purchased this for my husband to use in his chair to help with his lower back. After having it for over a month now, he says that it has made a marked difference in c the comfort level of sitting g in his favorite chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Laird",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Three Stars",
      "text": "This can be useful but it's not comfortable to sleep with all night.",
      "rating": 3.0,
      "verified": true,
      "author": "PJB",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "... my second time to buy this bolster and it's perfect to use as bolster to do a massage",
      "text": "This is my second time to buy this bolster and it's perfect to use as bolster to do a massage.I wish it's a little bit longer.",
      "rating": 4.0,
      "verified": true,
      "author": "Belize",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "... for use on a table for massage though it's perfect for a neck pillow or in between the knees ...",
      "text": "It's just a tad bit short for use on a table for massage though it's perfect for a neck pillow or in between the knees at night. Really good arm cushion in the car too :) love this little sidekick bolster.. Def a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph andrew zordich",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Great back support!",
      "text": "It's great support. I personally use it pushed up against my back when I'm laying on my side. But whatever support you need it for will work great. I recommend this product for anyone needing back support. It's also great to use when your sitting on the sofa and the throw pillows just isn't enough.",
      "rating": 5.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 0,
      "publication_date": 20170307
    }
  ],
  "product_meta": {
    "title": "InteVision Four Position Support Pillow (20.5\" x 8\" x 4.5\") with Bamboo Cover - Provides Best Support for Sleeping on Side or Back - Helps Relieve Back Pain",
    "description": "The InteVision Four Position, Half-Moon Bolster Pillow is designed with your utmost comfort in mind. For extra comfort, we have upgraded the pillow cover to a silky-smooth, high quality bamboo cover that is removable and machine-washable. It is made of a memory foam layer on top of a highly resilient base foam so that it feels soft and comfortable while providing the best support for your legs and knees to ensure you get a good night's sleep. It helps reduce back pain, supporting your legs and knees in an elevated position, improving circulation. It is great for side or back sleepers. \n\nFor people who need to sleep on a wedge pillow to help reduce symptoms of acid reflux, COPD, back pain, and post surgery, you can place this pillow under your knees to help you stay on the most comfortable position on the wedge pillow without sliding down.\n\nIf you are not completely satisfied with the product, you can return it in 30 days for a full refund.",
    "rating": 4.1,
    "feature_bullets": [
      "Best Comfort - this latest version comes with a silky-smooth bamboo cover which is removable and machine-washable",
      "Great For Side Sleepers - Made of dual-layer memory foam, it is carefully designed to make you feel soft and comfortable while providing the best support for your legs and knees to ensure you get a good night's sleep. It can also be placed under your knees to help you stay on the most comfortable position on the wedge pillow without sliding down.",
      "Leg Elevator Pillow - It helps reduce back pain, relieve tension on your legs and knees.",
      "Multi-Purpose - It can be used as a pain reliever positioning pillow, bolster pillow for side sleepers and back sleepers, during pregnancy or after surgery. Provides therapeutic support in multiple areas of the body.",
      "Note: the product has been placed in vacuum sealed package and it could take up to 48 hours for it to regain its original shap. Size: 20.5\" x 8\" x 4.5\""
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.6 x 6.6 x 6 inches; 1.06 Pounds",
      "Item model number": "HD 192",
      "Date First Available": "January 4, 2013",
      "Manufacturer": "IPT LLC",
      "ASIN": "B00AWJC340",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Mobility & Daily Living Aids",
      "Health & Household",
      "Bedroom Aids & Accessories",
      "Wedges & Body Positioners",
      "Health, Household & Baby Care"
    ],
    "price": 18.95
  }
}