{
  "website_summaries": [
    {
      "verdict": "A motorcycle battery that lasts 1,000 charges or more.",
      "pros": [
        "12V fully charged battery",
        "Chrome case ensures the motorcycle battery is resistant to shocks, vibrations, and heat",
        "Design prevents leaks and corrosion",
        "Includes heavy-duty terminals designed to withstand wear, pressure, and torquing"
      ],
      "cons": [
        "Terminals may be too large for some motorcycle connectors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Supplied nuts don't fit properly",
      "text": "I had a hell of a time installing this because the nuts that come with it are too small. The center of the holes of the nuts sit in the line with the bottom edge of the holes on the terminal. The nuts are too thin, as well, and so, trying to thread on the supplied bolts pushes the nuts out of reach. I basically had to jam a flat head screwdriver under the nut, then jam another flat-head screwdriver behind the nut in order to get the terminal bolts to thread. Poor design. And no, this isn't typical...my other motorcycle batteries don't have this issue.",
      "rating": 2.0,
      "verified": true,
      "author": "Noneofyour DamnBusiness",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Perfect fit for my 95 Suzuki Dr 350SE",
      "text": "Perfect fit for my 95 Suzuki Dr 350SE. Nice cranking power. I agree with other reviewers on the included screws... about 3mm too short to catch the threads, even though I have a very thin stainless steel battery bracket on my bike, Just take 2 small screwdrivers (realy small, like for electronics screws), one on each side, to hold the nut up. Or jam a small piece of wood or a piece of matchbook in there. We'll see how long it lasts!",
      "rating": 4.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20180603
    },
    {
      "title": "Bashan brozz 250 replacement, kind of.",
      "text": "Comes precharged which is great. I could not find an exact replacement battery for the bashan brozz 250. This worked just fine with some modification to the battery cage. I just had to cut the cage a bit and squeeze this battery in but it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20190112
    },
    {
      "title": "Best deal",
      "text": "This was the best deal I could find on the internet (that included prime delivery) Got it for my 2008 Honda Rebel and seems to be performing fine. Delivered on time. Happy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Miller",
      "helpful_votes": 3,
      "publication_date": 20180503
    },
    {
      "title": "Fits my 1984 Yamaha RZ350",
      "text": "This battery fits the '84 RZ350. It is a bit tall, making it a little difficult to connect my battery tender but, all in all, it does the job. I cannot rate durability or longevity, having purchased it only recently.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Doesn't fit, can't return",
      "text": "When I first put in the year, make and model, the website said this battery would fit my motorcycle. Why else would I buy it? When trying to install it, turns out it doesn't fit and conveniently, the site says it doesn't fit either. You think you'd be able to return it but because it requires \"special handling\" you're out of luck.",
      "rating": 1.0,
      "verified": true,
      "author": "Thuy Nguyen",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Perfect fit! Great buy!",
      "text": "I got this for my 2007 Kawasaki Ninja 250cc - It fit perfectly, my bike started right up, and it even came with the hardware, replacing my old ones. Love this and will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Demagoguer",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "so far so good",
      "text": "this battery arrived well packaged and in good shape , it was also charged and started my suzuki 250 imideitely , so far it is working good however a similar battery bought last year didnt even last 1 year, the limited 3 month warranty is the shortest i have ever seen",
      "rating": 5.0,
      "verified": true,
      "author": "Captain Wolfe",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "good price",
      "text": "I liked that the price was half of what the stock yusa battery costs. Also the battery was fully charged as advertised, I expected to have to charge it some before use but it wasn't needed. Specs were right on, all in all happy with purchase and would purchase again, only time will tell if its durable.",
      "rating": 5.0,
      "verified": true,
      "author": "1fastvic",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Awesome!",
      "text": "Perfect value for dollar. I put it in my CRF250L just to sell and it installed smooth. It does come will the screws and bolt for the terminals!",
      "rating": 5.0,
      "verified": true,
      "author": "Jourdan Lee",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Works well.",
      "text": "Have a 2013 Honda Cbr250r, battery works so far but the terminals were too big for the connectors. Will update if anything goes wrong, otherwise everything should be good!",
      "rating": 3.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Perfect fit",
      "text": "This product has about 300 starts on it already. Price was well below what walmart or rural king wanted for a similar battery. Fit perfectly in the 4 wheeler.",
      "rating": 5.0,
      "verified": true,
      "author": "renfeh07",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "A great battery at a great price",
      "text": "I needed a new battery and they were almost double the price locally, if I could even find on to fit my bike. This was delivered quickly and worked great right out of the box. No need to pre-charge or mix any chemicals, etc. It's only been a couple of weeks but my bikes fired fine on two of the coldest days of the year so far for us(mid-twenties)",
      "rating": 4.0,
      "verified": true,
      "author": "Bert Davis",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Durable",
      "text": "My motorcycle was hit by a drunk driver on new years while I was out of town. I went to see if it stared and sure enough it did. Battery survived the crash, and the bike's fixed now.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Fits 2010 Honda Elite Perfect",
      "text": "Fit my 2010 Honda Elite perfectly and fires right up. Only time will tell if it can match the 8 years my OEM battery lasted. My only gripe is that the bolts to hold the screws and the leads took some finagling to catch the threads, but once in it wasn’t a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Tortious",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Fit chart is not accurate",
      "text": "Ordered using the fit chart - battery was to large to fit in the motorcycle's battery location.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200826
    },
    {
      "title": "Four Stars",
      "text": "It fits and is what I expected. I expect to last at least a couple of years.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Cody",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Does not last long and does not recharge.",
      "text": "I have had this battery for about a year. In winter I had kept it for recharge. It does not recharge.",
      "rating": 2.0,
      "verified": true,
      "author": "Rakesh Pachawa ",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Let there be power!",
      "text": "Perfect! Fits right in, bike starts right up, haven't had a single problem with it! Though amazon says otherwise, this battery DOES fit and work for the 88-07 model year Ninja250.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20160728
    },
    {
      "title": "Perfect fit for 2005 rebel 250",
      "text": "Perfect fit for 2005 rebel 250. Started the bike right up right out of the box. Only time will tell how durable and long lasting it is, but for the price, I’d be totally happy with a year (the bike is super easy to push start). Shipping was faster than what i was originally quoted too, by about 3 days.",
      "rating": 5.0,
      "verified": true,
      "author": "sara",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Great battery",
      "text": "I was concerned with the price being so low, but the battery is working great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristi",
      "helpful_votes": 0,
      "publication_date": 20171017
    },
    {
      "title": "Fits my crf250l",
      "text": "It's a battery, it fit and worked. What else ya want?",
      "rating": 4.0,
      "verified": true,
      "author": "ElevatorDave",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Faulty product",
      "text": "I just had this for two months and it’s already not working. After 1 day of use, there is no voltage on the battery and it wouldn’t even charge anymore and stays at 11.5 volts.",
      "rating": 1.0,
      "verified": true,
      "author": "Clarisa",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Installed on my 02 honda nighthawk 250 and works great so far",
      "text": "Installed on my 02 honda nighthawk 250 and works great so far. Was ready to go when it arrived and has kept up its charge quite well so far.",
      "rating": 5.0,
      "verified": true,
      "author": "faten",
      "helpful_votes": 0,
      "publication_date": 20180116
    },
    {
      "title": "Works great on 2002 Kawasaki Ninja 250r",
      "text": "Bought this battery for my 02 Ninja and it works great. Comes with the screws and bolts you will need to hook it up and already charged and filed with the acid to go! So all you literally have to do is swap out old, put in new - then screw!",
      "rating": 5.0,
      "verified": true,
      "author": "Tru_Warrior",
      "helpful_votes": 4,
      "publication_date": 20140621
    },
    {
      "title": "Not a great fit!",
      "text": "I had to use the nuts from my old battery to secure the battery terminals, because the ones provided were to large to fit the terminals. Not a great fit!",
      "rating": 3.0,
      "verified": true,
      "author": "Adrian Monfils",
      "helpful_votes": 0,
      "publication_date": 20170808
    },
    {
      "title": "... was exactly what I thought it was and worked perfect for my use",
      "text": "It was exactly what I thought it was and worked perfect for my use.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Wait ,& see",
      "text": "Attractive price, it fits & starts my bike. I'm using a battery tends so time will tell",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171104
    },
    {
      "title": "Five Stars",
      "text": "Great price works fine. Highly recommend for a budget bike.",
      "rating": 5.0,
      "verified": true,
      "author": "ray mojica",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "so far it works great. Time will tell if it holds up",
      "text": "Purchased this battery based on price, so far it works great. Time will tell if it holds up.",
      "rating": 4.0,
      "verified": true,
      "author": "Jodie Raser",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Not for CTX700",
      "text": "Better not buy this for a Honda CTX700N DCT ABS. The info on this site says it fits, but it doesn't. Too small, and not the right amperage.",
      "rating": 1.0,
      "verified": true,
      "author": "jerryreliable",
      "helpful_votes": 0,
      "publication_date": 20161020
    }
  ],
  "product_meta": {
    "title": "Rechargeable YTX7L-BS Replacement Motorcycle Battery - Maintenance Free - Sealed Absorbed Glass Mat - Zipp Battery",
    "rating": 4.5,
    "feature_bullets": [
      "BATTERY TYPE: YTX7L-BS AGM battery with [- +] terminal is a rechargeable, power sport battery. 5. 12x 4. 45x 2. 76",
      "VERSATILE FIT: This YTX7L-BS battery fits in a variety of applications, ranging from motorcycles, ATVs, jet skis, and more",
      "TOP TECHNOLOGY: The Acid inside is constructed with Absorbed Glass Mat technology allowing for a low-maintenance and spill proof battery, Patented sealed post prevents corrosion, which gives extended battery life",
      "EASY APPLICATION: Zipp Battery batteries come fully charged and ready to go once delivered, Simply connect your battery to the application and you are ready to go",
      ": 18 month - 30 day refund window",
      "fit type: Vehicle Specific"
    ],
    "specifications": {
      "Manufacturer": "Chrome Battery",
      "Brand": "CB CHROMEBATTERY",
      "Model": "PWS-YTX7L-BS",
      "Item Weight": "4.73 pounds",
      "Product Dimensions": "4.45 x 2.76 x 5.12 inches",
      "Item model number": "PWS-YTX7L-BS",
      "Batteries": "1 12V batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Exterior": "Chrome",
      "Manufacturer Part Number": "PWS-YTX7L-BS",
      "OEM Part Number": "CTX7L-BS, GTX7L-BS, LTX7L-BS, M327BS, PTX7L-BS, UB7L-B, UTX7L, EX-TX7L, EBX7L-BS",
      "Folding": "No",
      "Cover Included": "Nuts and bolts",
      "Special Features": "Rechargeable, Polarity: [- +]",
      "Vehicle Service Type": "Motorcycle, All-terrain-vehicles",
      "Voltage": "12 Volts",
      "Wattage": "72.00",
      "ASIN": "B00ASMZYIS",
      "Customer Reviews": "4.5 out of 5 stars120 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#34,487 in Automotive",
      "Date First Available": "December 24, 2012"
    },
    "categories": [
      "Electrical & Batteries",
      "Motorcycle & Powersports",
      "Parts",
      "Batteries",
      "Automotive Parts & Accessories",
      "Automotive"
    ],
    "price": 29.9
  }
}