{
  "website_summaries": [
    {
      "verdict": "An economical luggage scale that is easy to store and comes with a room temperature display.",
      "pros": [
        "Rubber paint handle gives the scale a comfortable grip when using it to weigh luggage",
        "High-precision weight sensors ensure accurate readings up to 0.1 lbs",
        "Temperature display provides you with a portable travel thermometer"
      ],
      "cons": [
        "Does not include a backlit display",
        "Battery tends to have a short lifespan in comparison to the batteries used in other luggage scales"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It doesn't work",
      "text": "The temperature function never worked on ours, but I was most interested in the weighing function so I didn't worry about it. I found out that it doesn't weigh accurately a few months later when I used it for the first time. It weighted my bag at 46 pounds, but at the airport it was 52 pounds. I had the same issues coming home with the airport weighting my bag at 49.5 and the scale reading 44. This luggage scale almost cost me $100 in overweight fines, but luckily I was with others who took some of my clothes into their bags.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan Champ",
      "helpful_votes": 35,
      "publication_date": 20180815
    },
    {
      "title": "Product available under different names at different prices",
      "text": "Purchased two similar luggage scale items at the same time, thinking they were different but were almost the same, but marketed differently based on the name brand. I purchased a Camry and a Dr. Meter at Amazon. They look identical, but the Dr. Meter was a dollar cheaper. It also has a blue back light, this one does not. Also, the latch to wrap around the suit case is not as nice as some other products. If you are bent on this product, buy the Dr. meter as it looks identical, has a back light and is a dollar cheaper.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd Cayton",
      "helpful_votes": 20,
      "publication_date": 20190114
    },
    {
      "title": "This is a MUST-HAVE for any airline travel!!!!",
      "text": "This product is fantastic! This little scale saved us lots of money at the airport. My husband and I recently took a cruise. We were fine going, but on the way back I was over the weight limit on luggage. I put some of my things in my carry-on and a few things in my husband's suitcase. It worked. It is very accurate as well. My luggage weighed exactly what the scale said when we got to the airport. I had never thought of purchasing a hand held weight scale before, but Southwest airlines only allows 40lbs, which is really tight. I highly recommend this product and would purchase again in a heartbeat.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Bernhardt",
      "helpful_votes": 12,
      "publication_date": 20180923
    },
    {
      "title": "Good tool for travel but depletes batteries when not in use",
      "text": "Great but don't forget to take out the batteries between uses... I am a chronic over packer and this device is critical for avoiding overweight charges. Airlines are so strict now. I bought this to replace my other one that uses up all the battery power when not in use. If I forgot to remove the battery after using it, it was dead the next time I took it out. This one does the same thing. So now I have two that annoy me and those little 2032 batteries are not cheap.",
      "rating": 3.0,
      "verified": true,
      "author": "BonWil",
      "helpful_votes": 26,
      "publication_date": 20160618
    },
    {
      "title": "A Waste of Money!",
      "text": "I bought this luggage scale to determine the weight of my luggage for an upcoming flight. Unfortunately I was not able to use it. It did not have a hook on it where I could hang it from an iron gate to weight my luggage. I am a female and do not have the strength lift the luggage. My previous luggage scale allowed me to hang it from my iron gate to hold the scale and luggage as I read the weight. Also the function buttons had a cheap plastic covering that kept coming loose when you turned off and on..",
      "rating": 1.0,
      "verified": true,
      "author": "JMarie",
      "helpful_votes": 8,
      "publication_date": 20181115
    },
    {
      "title": "Very accurate weights- exactly on at the airport weigh in",
      "text": "Used this on the last trip as overseas luggage allocations are not as generous as US ones. Worked well and the temp is kind of fun- used in the room to figure out what the temp was a couple of times. Small enough to bring along- but keep in the bag as it is small enough to get lost in the luggage. Worked best for me (I am short) if I stood on a stool to do the measuring or I could not lift the bag all the way off the floor- I doubt most folks would have my issue. Easy to hook on the bag. Might use to weigh the cats now that I am home for a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn K. Sweet",
      "helpful_votes": 7,
      "publication_date": 20171212
    },
    {
      "title": "Bad quality control: One fine, one broken",
      "text": "I bought two of these, one as a gift and another for myself. Good thing I checked that they actually worked. One of them works how you'd expect, while the other just displays \"Err\" when any load over 7kg/16lb is applied, or sometimes doesn't even get that far and just shows \"Err\" when turned on. If you do decide to take your chances with one of these, be sure to TEST IT WORKS before going on a trip!",
      "rating": 1.0,
      "verified": true,
      "author": "Nick P",
      "helpful_votes": 20,
      "publication_date": 20180308
    },
    {
      "title": "Inaccurate read out scale !",
      "text": "Shows less than the actual weight, I used a 10 Lbs dump bell to test, it shows 9.5, and with a 20 Lbs test, it show 14.7 Lbs and different reading each times ! Don't take risk with this scale for Air Line travel.",
      "rating": 1.0,
      "verified": true,
      "author": "Tennis",
      "helpful_votes": 8,
      "publication_date": 20181202
    },
    {
      "title": "No more bathroom scales for me.",
      "text": "Great product that does what it says it does. Sure beats standing on the bathroom scale. No more of that for me. This portable luggage scale works great. Have taken it on several trips with me and it really comes in handy. The convenient nylon strap is easy to use to get an very accurate reading of your luggage. Will update review if I encounter any problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamazon",
      "helpful_votes": 8,
      "publication_date": 20161224
    },
    {
      "title": "Doesn't work",
      "text": "I removed the plastic protective strip but the unit will not turn on. How did this get passed by \"Q.C. No.1\" ? I don't know if it's a dead lithium battery or a defective unit, but even if it's just the battery, I'm irritated that I have to go out and buy one. If it's not the battery, I'll be even more irritated that I went out and bought a new battery for an item that doesn't work. Either \"Quality Control\" is a hoax, or Q.C. #1 is not doing their job.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Nichols",
      "helpful_votes": 2,
      "publication_date": 20191214
    },
    {
      "title": "After 4 Years of Use, Still Running Strong -- Accurate, and Battery Lasts Forever",
      "text": "I've owned this product for 4 years, so this is a long-term user review. It's very accurate (usually measures within a half-pound of the scales at the airport checkin counter), and the battery lasts a long time (I haven't had to change my battery yet). My only wish was that it came with a small protective case for taking on trips. I usually put it in a ziploc bag, but that provides no protection. All in all, a good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Shazam",
      "helpful_votes": 3,
      "publication_date": 20180802
    },
    {
      "title": "Lightweight Scale with Temperature, Metric and Imperial Units",
      "text": "The Camry 110 pound luggage scale is compact, and the strap is easy to attach, but sometimes the catch falls off if you're not careful. The scale reads in one-tenth of a pound increments, but does not stabilize and freeze the final weight...it just keeps showing new numbers. My other scale beeps and freezes the reading once it's stabilized, and I much prefer that method. Overall, a great travel scale that's small and light enough to travel with. For a 50-pound suit case, it read within 1 pound of the airport scale (which read 1 pound higher than this one).",
      "rating": 4.0,
      "verified": true,
      "author": "Hawaii",
      "helpful_votes": 2,
      "publication_date": 20181129
    },
    {
      "title": "Don’t travel without one!",
      "text": "This is the second one of these tools I’ve purchased. I passed the other one, another brand, on to a friend. The way we travel, with many bags for our nonprofit org, these tools are priceless! And they pack super easily in a pocket of your luggage. I’ll never travel without one now. And this one is excellent quality, very easy to use, easy to read (I have old eyes) and comes with a nice sleeve to pack it away in.",
      "rating": 5.0,
      "verified": true,
      "author": "Veteran Hockey Blue Liner",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Didn’t last.",
      "text": "Worked well when I initially got it. I travel 3-4 times a year. My most recent trip, this hand scale read 45lbs, but when I got to the airport, luggage weighed 55lbs. Needless to say, I wasn’t happy about paying the overweight baggage fee. When I got home, I tested the hand scale vs my bathroom scale, sure enough, the hand scale was off. I did ensure 0.0 to start as well. Well, on to the next one.",
      "rating": 1.0,
      "verified": true,
      "author": "oldman042",
      "helpful_votes": 2,
      "publication_date": 20191015
    },
    {
      "title": "No more fat luggage",
      "text": "If you travel often, I highly recommend this product. It has come in handy for all my international and domestic travels. Especially when on vacation and you \"over buy\" and now your luggage is 70 pounds. This tiny product has helped to avoid those extra fee's the airlines charge for an overweight bag. Sometimes it leads to buying more luggage ( a win in my opinion) and sometimes just simple re-arranging and wearing extra layers of clothing have been in order to avoid that extra fee.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberley",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Not Worth It",
      "text": "So I purchase this for a trip that I took recently and used it the night before getting on my flight by the time I went to use it again I was getting false readings and it was saying LOW. I assumed it was the battery but of course I did not have an spare batteries on me so I was not able to use it before I got on the plane. What a waste!!!! Go to Walmart and buy one at least you can return if it is not working.",
      "rating": 2.0,
      "verified": true,
      "author": "Tee",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "Light weight and fits anywhere.",
      "text": "This is a fantastic device for those who travel a lot and are always worried about the weight of their luggage. This thing weighs only ounces and accurately tells you how heavy your bags will be. I've been using this for all my world travels and have even caught the airport scales trying to say my bags were overweight until they fixed their scale and showed that my scale was correct. Definitely a great device to travel with.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted J. Gianopulos",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "Works as described",
      "text": "The scale is small enough to pack in luggage without taking up any significant space or adding weight, so it is ideal for those of us who like to buy things while traveling and still not pay extra luggage fees at the airline. It seemed a little awkward to use correctly the first time, but after I figured out the minimalist design and how the strap was supposed to be used, things were better. Some instructions in the package might have helped; my recollection is that there were none. It is also possible that there were instruction sheets, but that they were either unintelligible or unhelpful as seems the case with so many products these days.",
      "rating": 4.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Quit Working",
      "text": "This was great for the three times I was able to use it. Now it will turn on, but as soon as you go to weigh a bag it shuts off like its dead. I've tried new batteries and still the same issue. Unfortunate it quit working after the return deadline, else it would be going back. (The three times I did use it, I loved it. It weighed just a shot heavy - a pound or two. But that is how I want it to make sure I am within range when I get to the airport!)",
      "rating": 3.0,
      "verified": true,
      "author": "Dakota Thomas",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Handy for weighing your bags at home or on the road",
      "text": "While this did not agree 100% with the scales at the airport, it is pretty close and gives a good idea of how close you are to weight limits. It is always a good idea to stay a bit under the weight limits anyway. Even if your scale is completely accurate, it is the weight shown on the airlines scale that matters. The size is very convenient and it is easy to use with any bag that has a handle. It is now part of my regular travel gear.",
      "rating": 5.0,
      "verified": true,
      "author": "Scubabandit",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Lightweight, easy to use, and accurate!",
      "text": "This little guy is GREAT! Lightweight, easy to use, comes with its own little carrying pouch. Can be attached via the sturdy strap or small hook depending on the size of your item. I can also testify to its accuracy: the gate clerk when I checked my bag looked at the scale and said, \"Oh, good packing!\" (I was at 49.53, just as my little scale had told me at home. So nice to be able to verify weight before heading home as well! Just be sure you press the button to show kilos or pounds, depending on your preference so that you're not looking at the wrong number. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Keri",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Excellent luggage scale! Portable/packable, accurate, money-saver!",
      "text": "Accurate (as verified by our home scale and two airport luggage scales), lightweight, convenient, easy to use. Indispensable on our recent 10-day trip overseas where our 'value airline' had stricter weight limits than usual, and after weighing, we needed to redistribute items between our family's three suitcases and carry-ons. Otherwise would have faced 'overweight luggage' fees or have to get offline and rifle through and re-pack our stuff in the baggage-check area and hope for the best. Really happy we had this scale!! It will be coming with us on all future trips involving flights/weight limits!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon User",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "So worth it",
      "text": "I ordered this while traveling because I was tired of guessing if my suitcase would make it under the 50lb limit. At home I have been using a fishing scale, but I had to rig it up to hold the suitcase and find a way not to hurt my fingers or luggage during the lift. Yesterday on my trip home I used an airport scale and then went off and rearranged things off to the side of the ticketing area - ever do that? For under $10 I'm done with screwing around, this thing is traveling with me. Easy to attach to the luggage, easy to read, works great and exactly matched the weight at the airport.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Great",
      "text": "When I got to airport I weighed my luggage and the scale showed the exact same weight as the airline scale, the product performed perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Rosiak",
      "helpful_votes": 99,
      "publication_date": 20130914
    },
    {
      "title": "Hard to use, if u are old or not strong 💪",
      "text": "I initially bought this for my mother in law and I bought 2 cause I’m planning my vacations as well,,,, she could no use because she is old and is not too strong, I’m in the other hand am young and lift weights but still hard for me to lift the 50 pounds luggage and keep it lifted until it stops moving and the numbers on scale settle on the weights number... is easer if u climb on a chair or something so you don’t have to keep ur arms lifted at chin level while lift 50 pounds, but I’ll give it3 stars cause the products does what it says it does",
      "rating": 3.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "A must have for traveling.",
      "text": "I usually hold my suitcase and get on the scale. And I usually fall off or can’t see the scale. I saw this on Amazon and thought the price was decent. It’s perfect. It is small enough to keep in my suitcase to travel along with us for the trip back. I took it out of the box and it was ready to use. I would highly recommend this scale.",
      "rating": 5.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "This Luggage Scale is great!",
      "text": "I bought this after our last trip home from England cost a fortune in over weight bags. After reading reviews, I decided on this one and I’m very happy with it. It’s very easy to use and weighs in lbs and kgs. Weights are spot on and it is light and easy to tuck in your luggage to take with. The digital display is easy to read and you can’t beat the price. Just avoiding an over weight fee one time more than pays for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shalyn Sue",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Easy to use and accurate",
      "text": "This worked as advertised and was a great help during our recent extended travel. Before we left home I confirmed the reading with my other scales because I wanted to make sure not to get caught in the airline's penalty fees for going over the weight. Also because I had all four pieces of luggage close to the maximum allowed weight and knew that repacking them on the road would be a challenge. Definite recommendation.",
      "rating": 5.0,
      "verified": true,
      "author": "E. D'Alise",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Accurate",
      "text": "Purchased this for a trip over a year ago to assure that we do not go over the luggage weight limit. Honestly I was very sceptical and as a precaution I packed each luggage 3 lb less than the weight limit. To my surprise it showed exact same weight at the airport!!! Very pleased with my purchase and keeping it handy for the next trip",
      "rating": 5.0,
      "verified": true,
      "author": "Live, love, laugh 🖖Top Contributor: Baby",
      "helpful_votes": 3,
      "publication_date": 20180320
    },
    {
      "title": "Don't get this type",
      "text": "You are better off getting a mechanical scale. This is battery operated and the battery needs replacing with every trip. If this is something you will use periodically you really don't want to have to keep messing with batteries. I used it for one trip and now getting ready for a second trip it just registers low battery. Ugh. I was not thinking about this when I made the decision to purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Large, Heavy Luggage is Problematic",
      "text": "I loved the idea of this scale, better than its execution. It wasn't as easy to use as advertised. Large, heavy bags are difficult to lift to determine an accurate reading, and luggage handles that are not centered cause a swaying motion preventing the scale from locking in a reading. As applied to smaller bags, it was much easier to use and much more accurate.",
      "rating": 3.0,
      "verified": true,
      "author": "2LZ",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Great travel scale, accurate.",
      "text": "I bought two of these scales and they have been great. I found they were accurate compared to the airline scales at the check in desk on multiple occasions. I have been using these scales when I travel with toolboxes full of metal tools and equipment when I fly. They haveheld up to weighing bags up over 100 lbs. My only complaint would be that it feels very cheap and I imagine it might break in the future. But then again, it was so cheap to buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Great item",
      "text": "Have used this scale a few times when traveling and it works great. It has given me the same weight as the airport scales have shown. Easy to hook-up and use. Well worth the money to save the guesswork at weigh-ins. Compact enough so you can take it with you if needed. With the hookup strap, other items can be weighed as well. Very handy and worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Moss",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Can’t wait to use it.",
      "text": "Got it with a bad battery so now I have to wait to get a new one. Seems like vendor knows about battery since the manual it self it shows what to do in the event display shows LO. Not a big deal just hoped battery was out of device so it doesn’t run out of juice or it going bad before you can use it. Other than that looks pretty handy can’t wait to use it and see how accurate it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Dania",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "This is really helpful esp for international travel where you ...",
      "text": "This is really helpful esp for international travel where you have to be accurate about luggage weight. It really helps since it is digital scale. The only draw back i experienced is that it is difficult to weight 50lbs since you have to lift it with both hands (it hurts) and the battery slot right below is loose so whenever you lift, it tends to disconnect and reset the measurement and you have to start the whole thing over and over again. I had to tape it so, it wouldn't move. The battery lasted only lasts 3 mths, and i used it to weight 50-60 times.",
      "rating": 4.0,
      "verified": true,
      "author": "blah",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "Accurage weight, Easy to Use, Battery Lasts Years",
      "text": "I travel often and always bring this along to maximize what I can bring while keeping to airlines rules and regs! I've found it accurage within about 1/10 of a pound. It also can switch to kilograms. And it has a temperature guage on it. Super functional, tiny and easy to use. It barely uses any battery strength so it lasts a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "OutAndAbout",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Great to have",
      "text": "I was a bit nervous on this because I did not really have anything to truly calibrate it once it arrived. I figured that if I gave myself +/- 5 lbs I would be safe for my flight but the bags weighed the exact same at the airport as they did according to this scale. It is small so it's not a hassle to take with you and it worked well.",
      "rating": 5.0,
      "verified": true,
      "author": "KLuv",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Mixed results",
      "text": "I AM better off for having this bc I can weigh my bags and adjust them. However, it has been off as much as 3lbs. That could be a difference in calibration in airline scales. I KNOW this so I pack accordingly but it drives my husband UP THE WALL. He thinks it is pointless and wants to throw it out. Lol! I just know that I need to keep my bags around 47lbs...or buy a different scale. Im ok with that.",
      "rating": 3.0,
      "verified": true,
      "author": "Ralphie",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "It works but not very sturdy",
      "text": "While this product works, ours came with a very low watch-type battery, which we have to replace, thereby adding additional cost. After a few uses on a trip, the rubber over one of the buttons curled under and we had to dig it out and reposition it our assessment is the unit isn't very sturdy. The luggage and unit have to remain perfectly still in order to get a \"final\" reading.",
      "rating": 3.0,
      "verified": true,
      "author": "Soldier",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Super well designed luggage scale",
      "text": "I am using this product to weigh my two dimensional art pieces. I make collages with glass and have been way over the weight limit for some art shows. Using this scale will help me ascertain how much leeway there is in adding more things to my art. I will also use this device in upcoming art shows to make sure the art submitted by other artists is within the weight limits. This will prevent damage to the hanging system.",
      "rating": 5.0,
      "verified": true,
      "author": "glasslady",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Compact, Accurate, and worth the price for Utility.",
      "text": "I bought this to weigh my luggage for international travel and this is what I found. Pros: 1. Accurate and saved me the trouble of repacking in the airport after it measured me to be 4lbs over weight whereas another weighing device said I was OK. 2. Lightweight and compact so I carried it with me abroad. 3. The canvas belt and hook are sturdy and easily gave me confidence to weigh my luggage over and over. 4. Easily turned off and on. Cons. No complaints really. I am really happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "TRH",
      "helpful_votes": 4,
      "publication_date": 20151223
    },
    {
      "title": "A little disappointed",
      "text": "This review is only for packaging and appearance as I'm giving as part of a gift. Part of the reason I picked this over some others is the item description says rubber grip for comfort. It's not rubber, just generic hard plastic. In one of the pics posted by another reviewer it shows a grey felt bag it came with which was another reason I chose this over others. Mine didn't come with that bag, just in a plastic tray in a peeling cardboard box. Not so nice to give as a gift. I just hope it actually works.",
      "rating": 3.0,
      "verified": true,
      "author": "Shuga",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Worth it",
      "text": "It's been years since I purchased this, I am finally writing a review to say that this item is still working well! I don't know what kind of magic batteries they put in this but I haven't needed to change them. I usually slide this portable scale on the outer compartment of my soft cover Luggage, so I am assuming it had withheld all the slammings through the years. Recommended item",
      "rating": 5.0,
      "verified": true,
      "author": "ImReviewingStuff",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Convenient",
      "text": "I cannot attest to the accuracy only because I did not compare side by side with another scale, however I am glad I purchased it. I was able to track the weight of my luggage as I accumulated souvenirs while on vacation. Very compact, handy and easy to use. I only hope it’s good to use (No dead battery) the next time I travel.",
      "rating": 5.0,
      "verified": true,
      "author": "SU",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "So glad I purchased this!",
      "text": "I travel a couple of times per year and ALWAYS push the 50 lb max. for my checked duffle bag at the airport. Returning home, I always have more than I came with, so this scale is soooo handy! This winter returning home, I was over by 4 lbs, so I had to leave some things behind, but able to mail the rest of my stuff back, no big deal. Before I bought this scale, I've gotten real lucky with weigh-ins of 48 and 49lbs! I just got tired of playing roulette so I bought this scale. Now, there's no guessing coming and going with my bag at the airport! Fantastic buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Common Cents Person",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Failed after a few months",
      "text": "I received this scale on September 12, used it about 6 times, and now in November it has failed. Replaced the battery (was down to ~2.85v) and it still did not work. According to the description, \"100-percent Satisfaction Guaranteed:Hassle-Free 30-Day Money-Back Guarantee and One-Year Warranty\" How to I get it replaced under the Warranty?",
      "rating": 2.0,
      "verified": true,
      "author": "Mr.B",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "pictures are a bit deceptive",
      "text": "the on - category button is just a rubber \"plug\" not a true \"button\" which is easily pressed into the device and has to be pulled back out to set/reset the features. There is no \"off\" option - you just have to let the scale \"time out\". For the price, it is okay and useable.",
      "rating": 3.0,
      "verified": true,
      "author": "LYNDA J",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "99.99% Accurate!",
      "text": "I was a little wary as to how accurate this would be but we weighed our luggage and it was within 1 oz of what the airline said it was. It was very helpful for staying under the 50 lb mark and moving things around to other suitcases. It was very easy to use by just attaching to the suitcase handle and just lifting up to weigh. I’d buy again in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Rogers",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Very handy and accurate.  Must-have for a frequent flyer.",
      "text": "I keep this in my luggage wherever I go, it helps avoid any surprises at the check-in counter about your bag exceeding the weight limit set by the airline. Battery lasts about a year, it's a watch sized battery that's easy to replace yourself. It's also very accurate, as I remember seeing the airport's scale readout everytime I travel and think, wow, it's exactly what it said it was.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Huang",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Functional",
      "text": "This gets the job done, and does so with relative ease (assuming you can lift your luggage, of course!). I can't say yet how accurate it is because I haven't taken my flight yet, but I did notice that that sometimes the weight varies a bit if you weigh something a couple of times. That's probably to be expected, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Sally Mercedes",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Very easy to use",
      "text": "Saved my butt on many occasions as I tend to overpack...lol. Pretty accurate and easy to use. Just wrap around luggage handle and lift. Done. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Madman With A Camera",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "The Age Old Question....",
      "text": "...is my suitcase too heavy. Once you're at the airport it's too late or too much trouble to remove things from your suitcase if it's overweight. We travel quite frequently but this last trip made us question the weight of our suitcases...so I purchased this. We tested it and it worked great!",
      "rating": 5.0,
      "verified": true,
      "author": "Savivi",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Great accurate reasonably priced luggage scale",
      "text": "Via comparison radings on house and airport scales this thing is within a pound up to 50lbs. We know this, my wife maxes out. Of course it's awkward to lift a big heay bag using the handle but I 've tried many others, this is as good as it gets i'm upper 60's, and i can manage. I highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Works great!",
      "text": "I finally purchased a luggage scale after a lot of traveling and the only thing I can say is I wish I would've bought one sooner! This luggage scale is so convenient, lightweight, and easy to use. I no longer worry about my bag being overweight and having to rearrange my packing in the middle of the airport. I can't say exactly how accurate it is when compared to airport scales because every scale is different. The times I've used this, I make sure my bag is 2 pounds under the weight limit and have never had an issue! I love this thing and highly recommend it! I wish I would've purchased a luggage scale sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "SadieTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "Shuts off when you weight your luggage!! Don’t buy it!!!",
      "text": "We had one of this before and worked fine. We bought another after we lost the other one, and we took it in last vacation and did not work. We had to open our luggage in the airport and get things out of it because was to heavy. We place the scale in the garbage bacause that’s where it belongs.",
      "rating": 1.0,
      "verified": true,
      "author": "David Segoviano",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Awesome to know my bag wasn't going to be overweight",
      "text": "This scale worked like a champ! I was able to weigh my bags before heading to the airport. I was confident I was not going to exceed the 50 lb limit on any bags. I made a mistake and didn't take it on my trip with me. I worried that my checked bag might be over 50 lbs and that I might have to unload some content in order to not pay overage charges. I am very happy to have it and will take it along on future trips where weight might be an issue.",
      "rating": 5.0,
      "verified": true,
      "author": "CottonsMom",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Worth money, must be strong and steady to read",
      "text": "Bought this luggage scale to use as I'm studying in Europe so have a fair bit of traveling going on. For the most part it is accurate, however, i've noticed it's starting to take a while to read the weight of luggage. I'm fairly strong to hold it up and steady but i've noticed with my new suitcase which is fairly large and weighed only 44 pounds it took a while of holding the scale up and three tries for it to provide a reading. Changed the batteries but no difference. Overall for the price it was worth the purchase as it's gotten quite a bit of use by both me and my friends.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20160819
    },
    {
      "title": "I LOVE this thing",
      "text": "I LOVE this thing. I travel a lot throughout the world and so I have to be very careful on how much my bags weigh. This comes to the exact weight with the airline scales. It's sturdy enough that I have dangled about 65 lbs on it plus its small enough to easily tuck it away in your bag. If you are worried about how much your bags weigh then this is a must have. I haven't used the temp (I haven't ever found myself in need to) but I figure its an added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "KWalk",
      "helpful_votes": 2,
      "publication_date": 20161222
    },
    {
      "title": "An excellent choice.  and I've had it for a few years -- and a few more",
      "text": "An important item for a family that travels. It isn't fragile. The batteries last years. It appears to be very accurate. It is well designed. I probably researched this before purchasing... just like you're doing... and I'm really happy that I chose this scale. A smart move is to keep this little thing in your luggage all the time. It weighs next to nothing and is really terrific when you're returning home from vacation with more stuff than you started. Edit: 5 years later. Just had to replace the battery. It was a very standard button cell. The luggage for which this item was purchased is long gone. The scale is still excellent. Absolutely accurate and new looking.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20160209
    },
    {
      "title": "Great to Have",
      "text": "I travel often and every other time I go I get hit by overweight. I began to realize that you do not have any control of their scales, so I had to see for myself what I was doing wrong. The airline today make money for over weight. Now I can beat them at their games.....lol",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "spot on with airport scales, remove battery slide when not in use or you will have a dead battery...",
      "text": "Works great. Was spot on with airport scales on my trip to Arizona and back home TT o Florida. A money saver cause on my way home with extras I purchased on my vacay my luggage was 52lbs. Did some rearranging of suitcases and was at my allowed weight. I never got above 46 lbs just to be on safe side. Important...remove battery slide when not in use! Otherwise you will have a dead device. I read this in reviews prior to purchase. I remove and reinsert before I use and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20181001
    },
    {
      "title": "I’m glad I bought this! Very convenient & accurate!",
      "text": "We just literally just came back from our 8 night cruise to Bahamas & we flew from sfo to newark. I decided to purchase this one bcoz I had a hard time of guessing how much I have to packed on my previous trip. And I’m so glad I bought this! This has almost the same scale as on the airport. It has only 1-2 lbs difference bcoz it kept changing the numbers while your holding it up to weigh the luggage. But it’s fine with me bcoz it gave me an extra allowance so I won’t be over weight once they weigh it on airport scale.",
      "rating": 5.0,
      "verified": true,
      "author": "ER",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Very hand product;  must have for travelers",
      "text": "This thing really does take away from having to fidget around wondering what weight your luggage is. It's easy to use too; just press the button, and wait for the screen to show 0.00 and you're off. Of course you can change it from lbs to kg as you wish. I have used this for my trips in and out of the country and has been a great help. It keeps you from guessing and guessing wrong once you get to the airport (how horrible would that be)? So if you travel a lot by plane, don't forget this. It's as important as your charger is, I think.",
      "rating": 5.0,
      "verified": true,
      "author": "MdgnTop Contributor: Korean Beauty Products",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "Matched airport's weight measurement",
      "text": "Works great, took it with us on our trip and the measurements matched the airlines. Before we left I kept checking my bag by weighing smaller piles and adding those together and also weighing the whole bag with everything in it- which equaled to the smaller piles combined. Hopefully that makes sense- basically I'm saying each time I got an accurate measurement that ended up matching the airport 🙋",
      "rating": 5.0,
      "verified": true,
      "author": "This is me",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "great seller, the first did not work and the seller promptly sent another",
      "text": "great way to check your luggage weight at home before you have to repack at the airport. as noted in the title the first one did not work and the seller promptly dispatched another. this one works well and even included a travel pouch the 1st one did not have.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph J Manganiello",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Not great but not too bad either",
      "text": "I thought the weight displayed on the scale would be accurwte. But I found that the weight displayed varies everytime. I know it depends on several factors and i am not really sure if there is a better way to address it since i was lifting a 50 pound checkin bag and the balance while lifting could impact the weight displayed on scale.",
      "rating": 4.0,
      "verified": true,
      "author": "Keerthi",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "A must have for air travel",
      "text": "We took a big trip lately and carried 5 pieces of luggage. It was really hard to pack for this diverse trip and even harder to keep each bag under the 50 lb limit of the airlines. This little gadget was really easy to use and entirely accurate to an ounce. We pack each bag to 49 lbs and 8 oz and when we got to the airport, they were each on the mark. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Very Helpful",
      "text": "I love this!! I bought it before my trip to Costa Rica and Cancun and it came in handy while traveling. I had overweight on my suit case and thanks to the scale I was able to balance the weight and switched heavy stuff and light stuff from suit case to backpack. It works quick and easy, just lift and read the weight. Only thing about heavy suit cases is that you have to held it high for while and be steady and takes a while to read so have steady hands. Other than that I highly recommend this product to travelers.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Perez",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Thermometer is great for checking hotel room temperature.",
      "text": "Great product, especially for people like me who want to ensure they get the most possible use out of the $25 spent to check a bag! I was on my way back from Europe via Lufthansa with a 23kg limit, packed my bag to 22.9kg and it matched the airport scale exactly. No problems, I certainly couldn't have managed that without this. I only wish I had paid more attention to the description when I bought it and knew about the built-in thermometer a week before when my buddy and I were sweating through the night in an un-air-conditioned room in Copenhagen. Some hard numbers of actual room temperatures might have helped in our arguments with the front desk!",
      "rating": 5.0,
      "verified": true,
      "author": "iEspressoTop Contributor: Fountain Pens",
      "helpful_votes": 0,
      "publication_date": 20150811
    },
    {
      "title": "Works well",
      "text": "Easy to use with a variety of different types of bags, accurate, and small enough to easily travel with. The only nitpick I have is that I wish it would stick with defaulting to LBs instead of KGs, but it's a simple press of a button to display LBs.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "A Solid Travel Scale",
      "text": "Easy to use and accurate. Although the battery died after only one trip. And unless you’re Thor, Captain America, Iron Man, etc... you’ll need a friend to help you hold it long enough to get an accurate weight. Note that the scales at the airport didn’t match this scale exactly but it was quite close.",
      "rating": 4.0,
      "verified": true,
      "author": "OllieAko",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Wow! Accurate, clean, and compact",
      "text": "Recently went on a 10 day family vacation knowing someone in our party is an overpacker and loves to buy many souvenirs. We were able to pack up and weigh our luggage going and coming home (thank goodness as I had 15 extra pounds free and were able to move stuff to family's luggage to mine as they were over by 10 pounds). We were also able to use the temperature guage to see if the back room of the condo we rented was too hot compared to the rest of the rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Kourtney",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Accurate, Small, and Easy to Use!",
      "text": "Just used this for my Delta travels and very accurate. My bag had to be 50lb out less sand I measured 44lb, it weighed exactly so at the airport scale! What a lifesaver! I used a nice Swiss luggage that was only 11lb so so my stuff for perfectly. The scale itself is very light and shouldn't add weight to your bag, otherwise easily fits in your bag or purse.",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Perfect Luggage Scale for Ease of Use!",
      "text": "Great luggage scale that really works! We used this when moving with luggage cross-country and had 8 items that couldn't be overweight before we got to the airport that morning. It is lightweight and can be tossed into any luggage to go along on your trip - save hassle and headache with surprises when you're checking bags.",
      "rating": 5.0,
      "verified": true,
      "author": "WiildAngels",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Accuracy Accuracy Accuracy",
      "text": "I love love this item best buy I ever made on Amazon. I got this for my trip in November to Punta Cana. It was amazingly accurate to the airport scales maybe off by a 1/2 lb. or so. Everyone on the trip was asking to use it before left and when we was packing to leave. It was a God send for the price. So glad I bought this scale. It is so easy to use, its light weight and easy to transport. It can fit easily in a purse or bag. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sherie M.",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Not fantastic, does the job",
      "text": "Not fantastic, does the job, but batteries run flat if you leave them in the luggage for too long. Build is ok - used it for 3 years. Am considering versions with AAA batts or mechanical ones that may be heavier but does not require flat batteries. This is similar to other third-party/white-labelled scales out there.",
      "rating": 3.0,
      "verified": true,
      "author": "Ming",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "EXCELLANT for travelling, must have",
      "text": "Bought this for a 3 week Europe trip. Saved us a LOT of time, making sure our bags weren't over the weight limit for the airlines. Very accurate. Multiple times we were at 49.8lbs of our 50lb limit, but we were never charged at the airport so it must be accurate. It can be set for Lbs or Kgs, and is very lightweight with a handy storage pouch. I kept it in my backpack the whole trip. DEFINITELY buy if you're like us and always have big, full luggage....",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Functional. Stylish. Practical.",
      "text": "A very practical item for a frequent flyer. Works like a charm and light enough to pack along with other items. Not sure why the ambient temperature meter is needed, but it works like a charm, too. It seems to be of good quality and construction. I feel it might be functional for years to come. Stay tuned . . . bgs.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob GlickSmith",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Works great even af",
      "text": "Got one for myself seven years ago and it still works great! Only had to replace the batter recently after all these years. Battery is easily found in cvs. I use it and bring it with me every time I fly, and I travel quite a bit! It has put my anxiety on being charged for over weight baggae to rest. I recently got one for my baby sister too!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiff",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Doing its work",
      "text": "It has good battery life, having it for a month, never worried about it not sure if it lasts for years. Very easy to use. It also comes with a storage bag and makes it easier to pack with other items.",
      "rating": 5.0,
      "verified": true,
      "author": "yaohui",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Accurate and handy",
      "text": "Very accurate and light enough to bring on a trip to so can weigh luggage prior to hitting return airport. Easier to use then a traditional bathroom scale at home so we use it to weigh luggage prior to trip also rather than using the bathroom scale as previously done. There are a couple of minor design issues that might be improved such as the shape but these are minor and don't greatly impact usage. Wish I had it decades earlier.",
      "rating": 5.0,
      "verified": true,
      "author": "CandidThoughts",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "If you travel a lot you should get something like this.",
      "text": "Love this device. I travel to different parts of the country very often and this little device helps with weight control in my check in bags. It’s very convenient and small to just pull out and weigh my bags before I leave the hotel to prevent any unwanted attention pulling stuff out of my bag trying to drop the weight in my bags. Love it and recommend it if you fly often.",
      "rating": 5.0,
      "verified": true,
      "author": "Tysilios",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Quick and easy luggage scale.",
      "text": "Needed this for luggage. I usually check a bag and I seem to get to airport after trips and it's at 50.8 or 51lbs and I'm off to the side taking something out. I can weight it at home with bathroom scale but needed something small and travel size. So this works perfectly and I just tested it out last week on a work trip.",
      "rating": 5.0,
      "verified": true,
      "author": "AuntGigi",
      "helpful_votes": 2,
      "publication_date": 20170119
    },
    {
      "title": "Buy it NOW",
      "text": "I love this. In the past I always had to keep redistributing everything at the airport, and I finally decided to buy this thing after I came back from the Middle East. This product changed the game for me in my travels, and now I no longer need to worry about weighing my bags once I arrive, which saves me a lot of time and money si I don't have overweight bags. I like it because I can change between lbs and kilos, not that it matters any more which one I use. But I highly recommend this investment.",
      "rating": 5.0,
      "verified": true,
      "author": "Etaz",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "It worked for a couple of months.",
      "text": "Neat little scale, when I first got it that is. I use it to weight musical instruments that I buy and sell. After 2 to 3 months the display started jumping around showing different weights, and not wanting to settle. I guess you get what you pay for. Very dissapointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Fog Render",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "Non standard batteries And too slow to lock a reading",
      "text": "This scale uses CR2032 battery. It would have been helpful if it uses AA or AAA batteries instead.. Particularly considering this is a travel accessory.. Just imagine out of country / out of state and the battery is down . It will be so difficult to find the CR2032 batteries!! Moreover, it takes too long to lock the reading and is very frustrating when I am lifting the 50lbs in .. the reading also switches to 0lbs while trying to lock. I recommend paying more and buying a better product.",
      "rating": 2.0,
      "verified": true,
      "author": "Ahmed",
      "helpful_votes": 5,
      "publication_date": 20141202
    },
    {
      "title": "Must have for Airline travel",
      "text": "If you've ever tried to set your suit case on your bathroom scale to weigh it when traveling, you'll love this. For anyone that flies, it really is essential to know what your suitcase weighs. Airlines are getting quite strict about it and will charge you (a LOT) for overweight luggage. This handy little thing is a money saver. Just don't forget to pack it -- for the trip home ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Annie W",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Scale was off by half , almost cost us $150 in over weight fees",
      "text": "We used this product on our three bags for a trip. All bags on this scale showed under 50lbs. One was 20lbs, one 23lbs, and the last one was 30lbs. We got to the airport and the big bag (30lbs) was actually 59lbs, the others were under 50lbs but all the bags were wrong. This scale almost cost me about $150 in over weight bag fees.... I will change out the batteries once we get to our destination but it’s not looking good for this scale.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Display not as pictured",
      "text": "I was expecting a bright white lcd display but instead it's a basic grey and black (hard to read) display. I have bad eye sight and the white contrast is what I was looking for. For me it's hard to see what unit of weight i'm switching to. It seems to work but don't let the pictures mislead you.",
      "rating": 3.0,
      "verified": true,
      "author": "rickreviews",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Handy to have, small to pack, helpful to give you an idea what your luggage weighs.",
      "text": "Handy to have, small to pack, helpful to give you an idea what your luggage weighs. Loop the strap around the handle, turn it on, lift it up with both hands raising your suitcase and your weight is in either kilos or pounds. Two out of three weighs It read the same weight. It auto shut offs when done.",
      "rating": 4.0,
      "verified": true,
      "author": "Panama Red",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Must Have Travel Item!",
      "text": "For someone who does not travel often, I was unsure of how much I could take with me on my flight. I ordered this tool to ensure that I would not show up at the airport only to discover that I needed to leave something behind or pay additional baggage fees. The item works as described and can display the weight of your bag in lbs or kg. It is simple to use and is small enough that you can take it with you wherever you travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "had this for 5 or so years, still works great",
      "text": "When I was so close to reaching the max luggage weight I was pushing it and was afraid that this scale gave me an under estimate and I would have to pay extra for the weight. But that read it accurately, was just at the max weight just like the scale read.",
      "rating": 5.0,
      "verified": true,
      "author": "konoka",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Stop using a bathroom scale for your suitcase!",
      "text": "If you've ever tried to weigh your luggage on a bathroom scale, do yourself a favor and buy this thing! It saves so much time and effort trying to get a weight read for your suitcases. Quick, easy, and accurate. Made packing and planning suitcases a breeze because we knew when we'd reached the weight limit on a bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruthie",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Why didn't I buy one of these long ago? It saves me a lot of money as I no longer pay overage fees to the airline!",
      "text": "This little luggage scale is awesome. Easy to use, no instructions needed to operate this one. I even take it with me when my luggage is close to the maximum allowed weight. I refuse to pay an overage. The scale was about 1.5 lbs off of what southwest scales say, showing a bit lighter. But now that I know that, I just allow for it. The strap is easy to attach to a handle to weigh. It is easy to read the digital readout. I'm very happy with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "ksf4par",
      "helpful_votes": 0,
      "publication_date": 20170501
    },
    {
      "title": "Ok, but not very accurate",
      "text": "The title says it. It seems ok, but I question the accuracy. I loaded some weights in a bag and weighed with this luggage scale and my regular bathroom scale. The luggage scale was .6 lbs lighter. As I added more weight to the bag the variance became greater with the luggage scale increasing to just about 1 lb lighter than my bathroom scale. I guess I don't know which is correct and which is wrong. But, this variance is concerning. I suppose as long as I don't fill my luggage beyond 48 lbs or so I should be ok. I may return this product.",
      "rating": 3.0,
      "verified": true,
      "author": "Product Review",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Not Sturdy",
      "text": "Didn't last long broke after a few times weighing bags. I do not recommend this product",
      "rating": 1.0,
      "verified": true,
      "author": "TalonRo",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Re-weighed and was good. At the airport they weighed the bag and ...",
      "text": "Bought this to use on my new luggage as I hadn't traveled with it yet and wasn't sure of the weight. Ended up using it on all my bags and everyone's that was travelling with me. I actually had to repack after weighing my large bag, as this said it was over. Re-weighed and was good. At the airport they weighed the bag and it was still good (49.6lbs), however I think it was .1 lb off of what this scale said. Flying back, I managed to nail it at exactly 50lbs. Didn't have to repack (I watched a family ahead of us have to). Completely worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "km0485",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Awesome for foreign airlines",
      "text": "I need this frequently when I go overseas and the foreign airlines follow strict rules on the 7kg limit for carry-ons. I load the bag to 6.9kg, put the rest in a backpack, and then put the backpack in the suitcase after getting past the check-in counter!",
      "rating": 5.0,
      "verified": true,
      "author": "Benn",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Luggage scale, light & convenient",
      "text": "Ordered this for a friend. Not really sure how long the battery will last since I just received it today. I tested the product & it seems to work fine, giving your bag's weight in pounds or kilograms. In addition, it also tells the room temperature. The gizmo has a turn on, turn off switch. It's very light & convenient to put in your carry on. It uses a watch battery.",
      "rating": 5.0,
      "verified": true,
      "author": "PickyjadeTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Easy to use and carry",
      "text": "Easy to use and carry. Display locks quickly after object get stable. Switching from LB to KG is simple. It auto-power off after few mins till that time it shows previously locked value. Problem is with the accuracy. It always shows 400gms less than the actual weight of the object. This 400gms is consistent irrespective of the weight of the item. I figured it out by weighing a known item and that helped me from getting into trouble in airport. May be my particular piece has calibration issue.",
      "rating": 3.0,
      "verified": true,
      "author": "maran38",
      "helpful_votes": 0,
      "publication_date": 20180903
    }
  ],
  "product_meta": {
    "title": "Camry Digital Luggage Scale, Portable Handheld Baggage Scale for Travel, Suitcase Scale with hook,110 Pounds, Battery Included",
    "description": "Never Pay Unexpected Overweight Bag Fees Again \n\nOverview \n\nThis sleek digital Luggage Scale is small and handy with room temperature display when press on the unit button. It is easy to store, carry and convenient for traveler. With the rubber paint handle it gives a comfortable grip when using the scale to weigh your luggage or package anytime and anywhere during travelling or when required. This luggage scale is also a good choice as gifts for your family and friends. Avoid hassles at the check-in counter, save your hard-earned money, and travel with peace of mind and confidence! \n\nKey Features \n\nCapacity:110 lb/ 50 kg, Zero and tare function \n\nHigh Precision Weight Sensors: Accurate to 0.1 lb / 50g \n\n1.44\\\" LCD Display, with comfortable rubber paint handle \n\nPowered by 3V CR2032 \n\nLithium Battery (included) Low battery/overload indication\n\nWeigh your luggage easy way! \n\nUnravel the black strap seen in the picture; \n\nRemove the plastic battery stop; \n\nSlip through a handle or strap the scale strap and clip back over the scale; \n\nPower on(about 2 second hold) ,Wait for Zero read; \n\nLift and hold till the display flashes 3 times,that is the weight. \n\nExtra Feature\n\nTemperature Display (℉/℃)\n\nYour own built-in portable travel thermometer! \n\nPacket content\n\n1* Portable Luggage Scale\n\n1*CR2032 Battery\n\n1* User Manual",
    "rating": 4.6,
    "feature_bullets": [
      "Avoid Overweight Fees: check your package weight before to the airport and avoid unexpected overweight luggage or baggage fees again.",
      "Travel without stress: high-accuracy sensor, capacity: 110 LB/50 KG, Division: 01 LB/50 G, Unit: LB/KG",
      "Easy to Use：1.4\" LCD display with room temperature with rubber paint handle so that you can carry with ease. Zero and tare function, low battery/overload indication.Power:1 x 3V Lithium Cell CR2032 included, automatically shuts off after 2 minutes to save battery, so you don’t have to worry about losing power.",
      "Light & Portable - the small and lightweight design fits into your bag or purse; easy to store and carry and is perfect for travelers.",
      "100-percent Satisfaction Guaranteed: Hassle-Free 30-Day Money-Back Guarantee and Two-Year Warranty."
    ],
    "specifications": {
      "Product Dimensions": "5.1 x 1.65 x 1.18 inches",
      "Item Weight": "3.2 ounces",
      "Department": "Unisex-adult",
      "Manufacturer": "Bdt Ecommerce",
      "ASIN": "B00A8SXGKA",
      "Item model number": "EL10",
      "Batteries": "1 Lithium Metal batteries required.",
      "Customer Reviews": "4.6 out of 5 stars5,637 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#11,709 in Clothing, Shoes & Jewelry",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Luggage Scales",
      "Clothing, Shoes & Jewelry",
      "Luggage & Travel Gear",
      "Travel Accessories",
      "All Departments"
    ],
    "price": 7.89
  }
}