{
  "website_summaries": [
    {
      "verdict": "For rapid relief of symptoms, this cream is useful for treatment of internal and external hemorrhoids. Ointment provides fast-acting relief for painful symptoms.",
      "pros": [
        "The Plus formula includes ingredients that numb and relieve symptoms",
        "Reduces swelling, burning, and pain associated with hemorrhoids and provides instant relief according to reviewers"
      ],
      "cons": [
        "Not effective for all users"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Swear By It!",
      "text": "My Dr had given me a prescription for this since years ago you could by over the counter. My mother swore by it. Drs prescription was not for \"plus\" but I ran out and did not want to go through the hassle going through my Dr however, I got immediate relief, shrunk them up, and there was a slight burn at first but I was not bothered by it. Just knew it was working. I'll continue to use for my issue and am very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Marra",
      "helpful_votes": 19,
      "publication_date": 20190518
    },
    {
      "title": "I think it's working",
      "text": "My PCP recommended this to me, but I couldn't find it in a store here in America. Thank you, Canada! The stuff seems to be helping so far! Roids are still there, but getting better over the past week. I guess those things take a while to heal. Never had them before. But yeah. I'm able to sit for longer, walk without pain, and after using this for a few days, I was able to have a bm without pain. Of course, I'm using this in conjunction with a few other items and healing techniques. But I like the stuff.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Wells",
      "helpful_votes": 8,
      "publication_date": 20190222
    },
    {
      "title": "Fast relief",
      "text": "I've had trouble finding this product and was surprised to find it still available when I thought it was discontinued. It has always been superior to the popular brand treatment and I will not be wasting time and money on any other!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 8,
      "publication_date": 20190905
    },
    {
      "title": "Not a Miracle, but I Am Pleased",
      "text": "I've not had a lot of experience with this (fortunately) but this definitely made eased the discomfort and a fairly serious swelling went down noticably in a couple of days and was gone completely within a week. I've had this condition once before and the product I used at the time was Preparation H. This was at least as effective.",
      "rating": 4.0,
      "verified": true,
      "author": "ibaconi",
      "helpful_votes": 3,
      "publication_date": 20190909
    },
    {
      "title": "Fast & quick delivery",
      "text": "AWESOME product & ALWAYS ARRIVES FAST, ESPECIALLY now that we have an AMAZON PRIME warehouse here in Tucson, AZ!!!",
      "rating": 5.0,
      "verified": true,
      "author": "BlackMagic420",
      "helpful_votes": 3,
      "publication_date": 20200207
    },
    {
      "title": "it's better than TUCKS",
      "text": "this is our second order....hubbie loves it and the way it works. The price is very reasonable...it's better than TUCKS!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Zahm",
      "helpful_votes": 10,
      "publication_date": 20170329
    },
    {
      "title": "This Anusol Is Okay",
      "text": "The reason Anusol Plus is no longer available in US is probably because it contains Paraben. This product (ointment) kind of works and reduces the somewhat of the swelling but the extra pain relief is not that great, it takes some time to numb the pain. It would be nice if they could make this product the way it was, with the original Anusol Ointment.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20151221
    },
    {
      "title": "Cream is better.",
      "text": "Cream is better. Got ointment by mistake. Ointment burns a little. I recommend this product to everyone. So much better than any other. My dr. advised me to get it but I could only find on Amazon. No longer sold in US stores. Why?",
      "rating": 2.0,
      "verified": true,
      "author": "kg",
      "helpful_votes": 2,
      "publication_date": 20200129
    },
    {
      "title": "Used to work great, now I might as well have used baby ...",
      "text": "The composition of the contents must have been changed. Used to work great, now I might as well have used baby lotion",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170528
    },
    {
      "title": "Instant pain RELIEF!",
      "text": "Excellent product. Relief from pain on the first day I used it.",
      "rating": 5.0,
      "verified": true,
      "author": "BigMama8",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Not to sure about this stuff....",
      "text": "I think it helps. Disappointed it did not take care of my problem. In my experience it burns!!!! I did read where you can massage it in for a minute and that does help. If you are suffering, it’s worth a try but don’t get your hopes up to high.",
      "rating": 2.0,
      "verified": true,
      "author": "Christy Bumpas",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "I product I never wanted to use",
      "text": "Hopefully I never have to use this again, I can’t quite remember how helpful this was, but I suggest just go to the freaking doctor and get lidocaine gel because that works the best. This will do the trick though, good luck soldier.",
      "rating": 5.0,
      "verified": true,
      "author": "Serena Davis",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Not worth the hype",
      "text": "Really hoped this worked as well as the reviews said. Not so much. Noy for me, anyway.",
      "rating": 3.0,
      "verified": true,
      "author": "Theresa T",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Hemmorid cream",
      "text": "This has been a great product for years! It really works and soothes the pain!",
      "rating": 5.0,
      "verified": true,
      "author": "Marleen F. Walaitis",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Effective",
      "text": "This product is worth the extra money you spend. It works better to shrink hemorrhoid and helps correct cause of pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosemary Bengtson",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Ouch",
      "text": "Didn't like this product at all made everthing worse it was very irritating nothing like preparation H which is much more soothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Sandiego",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Works better than All other brands",
      "text": "This product works better than any other hemorrhoid cream I have used. Takes the pain away almost immediately and the hemorrhoid was gone within a couple days.",
      "rating": 5.0,
      "verified": true,
      "author": "RJAM",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Good product, bad sticker placement",
      "text": "Product arrived as described and on time, but the seller covered directions and ingredients with an inventory sticker when 3 sides of the box were the exact same: just the name of the product, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Not working for me",
      "text": "I used it for a week and didn’t see feel difference.",
      "rating": 3.0,
      "verified": true,
      "author": "elvrfer",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great value",
      "text": "Only medication that works for me. Better than what my doctor recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Only thing you need.",
      "text": "This beats all other brands. I used it when it was only available by prescription.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "What a relief on that cream.. excelente!!",
      "text": "Very good product. Exactly what is described. Delivered really fast.",
      "rating": 5.0,
      "verified": true,
      "author": "kaze",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "The ointment seems to work better than the wipes",
      "text": "This is an \"old\" stand by. Hemorrhoids, and swelling are really uncomfortable. This product will give you relief. The ointment seems to work better than the wipes.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Arthur",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Not too good as an hemorrhoidal medication",
      "text": "Not as good as the Tucks hemorrhoidal ointment that just wasn't available anymore. Considering not to buy it anymore.",
      "rating": 2.0,
      "verified": true,
      "author": "LindaA",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Better than H",
      "text": "It apparently works better than Preparation H, as I was informed. (I got this for someone else.)",
      "rating": 4.0,
      "verified": true,
      "author": "kaiapit",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Works ok",
      "text": "The effect is average, but it will be comfortable after use, but it will not last long.",
      "rating": 4.0,
      "verified": true,
      "author": "Lighty",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "A good replacement for the Tucks Ointment which no longer is ...",
      "text": "It works very well. A good replacement for the Tucks Ointment which no longer is available.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo-Ann Forsyth",
      "helpful_votes": 2,
      "publication_date": 20160920
    },
    {
      "title": "One Star",
      "text": "this is not like tucks, I can get prep H cheaper if that is what I wanted",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Skapik",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Five Stars",
      "text": "I like this product better than others I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "Neil Miller",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Relief",
      "text": "Can not find in drugstores. It works better and faster than the well known over the counter remedy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jammy",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Anusol Plus",
      "text": "Excellent. I was very pleased to get it so quickly. It works the best of anything that I have found even better than prescription meds.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Four Stars",
      "text": "Worked but wasn't what I expected from the Anusol I used 30 years ago.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorri R.",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Arrives quickly",
      "text": "It was a stronger brand than you can purchase in the stores.",
      "rating": 3.0,
      "verified": true,
      "author": "CC ",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "I recommend it!!!",
      "text": "I highly recommend this product works better than any other cream",
      "rating": 5.0,
      "verified": true,
      "author": "Ammar",
      "helpful_votes": 0,
      "publication_date": 20180902
    },
    {
      "title": "This ointment works very well to soothe - not to ...",
      "text": "This ointment works very well to soothe - not to cure. Used regularly I think it may reduce the problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Caledonia",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "Worked like a charm",
      "text": "Anusol was just what the doctor ordered. Worked like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "I am a very happy customer!",
      "text": "I have been suffering with hemorrhoids for 1 year. I have used cream after cream without results..I just bought 12 Anucort-HC suppositories at the pharmacy for $100.00. It did nothing to relieve my symptoms. I bought this product and obtained relief within 3 days. I am a very happy customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacquelyn",
      "helpful_votes": 3,
      "publication_date": 20161230
    },
    {
      "title": "Good product",
      "text": "Have not used yet but have in the past. Only product that cured anal fissures. this product works over anything that Big Pharma puts out.",
      "rating": 5.0,
      "verified": true,
      "author": "Red eagle",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Did not work for us",
      "text": "Doctor recommended it but we don’t get any benefit using it. I would recommend Preparation-H instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Fk",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Happy buttocks!",
      "text": "Amazing worked wonders also banned in USA so was able to still purchase thank you 😃",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "Five Stars",
      "text": "Recommended by my Dr. and does it's job as he said.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Anusol Plus ointment",
      "text": "I put it where the sun don't shine and it helps relieve the discomfort.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "It only made problem worse!",
      "text": "I don't think medicine is authentic... Burns very badly... It only made problem worse!",
      "rating": 1.0,
      "verified": true,
      "author": "Kendra Harrison",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Avoid Anusol",
      "text": "The best was the next day delivery. The product itself isn't good at all. It doesn't have any anesthetic or doesn't feel like it has it. It doesn't reduce swelling not even using the whole tube. Same sh** as the rest on the market !!",
      "rating": 3.0,
      "verified": true,
      "author": "JUAN MARTI",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "You must try this if your suffering",
      "text": "I'd been to the doctor several times and even went to an apothecary for relief and nothing worked. So glad I found this on amazon and even though the reviews widely varied I gave it a try. Within 48 hours I was able to sit without pain and after another day I did not have to push anything back in. I used this along with the suppositories and could not be happier with the results. My bottom is forever grateful.",
      "rating": 5.0,
      "verified": true,
      "author": "Poodle Mom",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Wife needed relief after child birth. This saved the day.",
      "text": "My wife swears by this and it was recommended by her OB. I previously bought some Prep-H but she said this brand worked much better. Additionally, it also came with an added attachment that can be used to apply 'further up' (as this was a bit intimidating, she did not use so I was told).",
      "rating": 5.0,
      "verified": true,
      "author": "dSeLeKTa",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Great product for hemorrhoids. Wish we could buy it in Ohio, next best thing a seller on Amazon.",
      "text": "We cannot find this product inOhio and it is the only brand my husband likes, so we do the next best thing, we order from Amazon. The product really works, easy to use, great seller and we will buy again from this seller.",
      "rating": 5.0,
      "verified": true,
      "author": "NancyOH44",
      "helpful_votes": 2,
      "publication_date": 20170609
    },
    {
      "title": "Holy crap!",
      "text": "Ever have just uncontrolled burning, itching, pain, and even scant blood! Make your anus feel super cooled and comforted! Definitely worth the money! I have tried so many products and even went to the extent to having a colonoscopy at a young age cause of my rectal discomfort, this crap right here has been doing it for me for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Hansen",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "This is great",
      "text": "This was literally the only product that worked for me. This along with the inserted ones. I've had hemoroids since baby #2 and this product was the only thing that worked for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Bschumacher",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Works better than anything else out there!",
      "text": "Works better than anything else out there without a prescription. Got for my daughter who is still occasionally suffering 2yrs after childbirth after",
      "rating": 5.0,
      "verified": true,
      "author": "SN10306",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Seems to work well",
      "text": "Not anything special. It is par for the other creams I tried but definitely felt an improvement. I would recommend and buy again if I need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff D.",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Soothes..",
      "text": "I used this a long time ago, so I kind of know it’s good. Am happy to say it’s still good. Will buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Bewaji",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Seems to work better than the generic stuff",
      "text": "Getting older is a pain in the butt, but this helps better than the generic stuff.",
      "rating": 4.0,
      "verified": true,
      "author": "DeRavenSey",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Keeps bug bites from itching",
      "text": "This is the best mosquito medicine ever put it on bug bites no more pain,itch or swelling",
      "rating": 5.0,
      "verified": true,
      "author": "R Dean Pryor",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great product and it works",
      "text": "This is what I used to get prescription from the doctor. So happy it’s otc now. Relieves pain, itching, soreness, & swelling on first application",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "This product didn't help my hemorrhoids at all",
      "text": "This product didn't help my hemorrhoids at all. No pain relief or burning relief. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce C.",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Does the job.",
      "text": "Very effective, can't find in stores. Glad you carry it.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A. Melaragni",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "It works, and I am truly grateful!",
      "text": "This truly made me feel so much better after an entire week of pain! It worked for me and I'm just mad I didn't get it sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevbot",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Stains underwear!",
      "text": "Stains underwear. Not like the creamy ointment they used to make.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "Five Stars",
      "text": "Best for hemorrhoids in my opinion, much better than preparation H.",
      "rating": 5.0,
      "verified": true,
      "author": "Scoot",
      "helpful_votes": 0,
      "publication_date": 20170419
    },
    {
      "title": "Expected more from it. Still trying other products. ...",
      "text": "Expected more from it. Still trying other products. Rate this below Prep H.",
      "rating": 2.0,
      "verified": true,
      "author": "Dennis Barnhart",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Four Stars",
      "text": "I liked the older one by Phizer better, as it had the zinc oxide base. This works well though.",
      "rating": 4.0,
      "verified": true,
      "author": "lmc",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Clears up the problem",
      "text": "You can't buy this product in the US anymore because it works. Doctor prescribed a tube of stuff that worked somewhat but was extremely expensive. This stuff works like a charm.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Borsay",
      "helpful_votes": 9,
      "publication_date": 20160412
    },
    {
      "title": "The cream itself was as expected, but the shipping ...",
      "text": "The cream itself was as expected, but the shipping packaging wasn't adequate. The item and pkg was all squished and torn.",
      "rating": 4.0,
      "verified": true,
      "author": "Kim Weaver",
      "helpful_votes": 0,
      "publication_date": 20140904
    },
    {
      "title": "Love this stuff",
      "text": "This is the only product that relieves my pain and reduces swelling. Other otc and prescribed ointments haven't worked this well. Im glad i can get this product from amazon, since i cannot purchase in the stores here in the US.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160622
    },
    {
      "title": "This did not relieve any painful burning and itching symptoms",
      "text": "This did not relieve any painful burning and itching symptoms. It reduced minor swelling but did not reduce any discomfort.",
      "rating": 2.0,
      "verified": true,
      "author": "elkelk",
      "helpful_votes": 5,
      "publication_date": 20150105
    },
    {
      "title": "OKay, I have a problem. But this product ...",
      "text": "OKay, I have a problem. But this product helps relieve the pain and I believe it does help to um, reduce the problem 8)",
      "rating": 4.0,
      "verified": true,
      "author": "fieldflower",
      "helpful_votes": 0,
      "publication_date": 20150626
    }
  ],
  "product_meta": {
    "title": "ANUSOL Plus Hemorrhoidal Ointment Treatment 30 g Tube",
    "description": "ANUSOL PLUS hemorrhoidal treatment in 30 g tube.",
    "rating": 4.4,
    "feature_bullets": [
      "Doctor & Pharmacist Recommended",
      "Hemorrhoidal Ointment Treatment in 30 g size Tube",
      "Extra Pain Relief with Anesthetic",
      "Fast, Long-lasting Relief, Helps Reduce Swelling",
      "Made in Canada"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "251.97 x 220.47 x 118.11 inches; 1.59 Ounces",
      "Item model number": "No Model",
      "Date First Available": "November 11, 2012",
      "Manufacturer": "Johnson & Johnson",
      "ASIN": "B00A5Y3WJW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "OTC Medications & Treatments",
      "Health & Household",
      "Pain Relievers",
      "Hemorrhoid Care",
      "Health, Household & Baby Care"
    ],
    "price": 14.0
  }
}