{
  "website_summaries": [
    {
      "verdict": "This light-up ball is great for neighborhood games or practices that extend after dark. It's harder than a leather ball, so parents of young children may wish to try a different ball.",
      "pros": [
        "Size 5 nylon soccer ball with two LEDs inside",
        "Can be seen from a few hundred yards away",
        "Lights are impact activated and turn off after 40 seconds of inactivity",
        "Rubber grommets make ball waterproof",
        "Batteries are replaceable",
        "Fun for casual play, and lets you extend evening team practices past dark"
      ],
      "cons": [
        "May arrive deflated, so be sure you have a pump available",
        "Harder than a standard soccer ball"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Party save for my 10 year old's birthday",
      "text": "I bought this product for my 10 year old sons birthday party with 40 (yes 40) of his friends for a \"glow party\" outside. I was nervous about the 1 & 2 star reviews saying the ball deflates easily after 2 days. I've had this inflated over 11 days now with the kids using it daily and there's no loss of pressure, glow, or durability issues. It glows bright red and the kids all loved it ! they played for over 4 hours that night non stop. I definitely recommend this and the glow football by the same company.",
      "rating": 5.0,
      "verified": true,
      "author": "Grimm",
      "helpful_votes": 2,
      "publication_date": 20191119
    },
    {
      "title": "Best and brightest ball ever for my kid! A must have!",
      "text": "Best gift I ever bought my 10 year old son and all the neighborhood kids come over to play. This ball has survived twenty kids ages 4 to 16 with constant play. I got this as a gift for my son 6 months ago and the battery is just now beginning to dim. I got it to prolong playtime after school with daylight savings time cutting playtime short after school. Now he can play longer to get his exercise and burn off school stresses. The kids rush out after homework and join in. Even the teen aged boys down the street come down to kick the ball around. I am ordering a new battery for Summer! Great purchase-no second thoughts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160507
    },
    {
      "title": "Very nice  and a fun product.",
      "text": "I bought this soccer ball for my granddaughters for Christmas. It arrived inflated, which concerned me. My husband inflated it with no problem and it is just fine. The ball is bigger than I thought it would be, but that is because it is a size 5 and the girls use a size 4. I didn't see the different sizes when I ordered it. It does light up very nicely and the girls love it. They got outdoor soccer nets for Christmas and I thought this ball would be great as they play late in the day. They can't wait to put it to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Marilyn Bennett",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Fun Item!",
      "text": "During a tailgate to a soccer match, a friend's son had this ball and the boys had a fantastic time playing with it especially after the game ended at 9pm. My son and his soccer buddies had a blast. It passed the time until we were able to leave the parking lot. Of course several parents used their phones and placed orders or their sons. So did I. I also brought the Nite Lze Flashflight L.E.D Light Up Flying Disc",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hendricks",
      "helpful_votes": 2,
      "publication_date": 20160517
    },
    {
      "title": "Shot in the dark!",
      "text": "This was amazing!! Sturdy and a huge hit at a soccer team party. Numerous moms immediately got online and ordered one for their kids. It auto shuts off after not being touched a while, comes with batteries and instructions to replace. Huge hit, lights up beautifully",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Di",
      "helpful_votes": 4,
      "publication_date": 20170916
    },
    {
      "title": "Keep your teams practice going like crazy fun even as it gets dark out.",
      "text": "Giving this a 4.5, it performed well on the darkening field for team practice, but has a different feel, and the hard plastic light spots take head butting out of the scrimmage. On the plus side..every player wanted to get to the ball to kick start the light ups again..this light up ball never went dark. The team practiced well past sun down to make the most of practice as the days grew shorter. Need glow pinnies for next season if someone makes them. Overall, the kids and the coach enjoyed the extra play into the dark, and my son loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy Reader",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Great product",
      "text": "Gave this product to my nephew for Christmas 2019. He absolutely loves it! He says it's great for playing at night. He brings it with him everytime he comes over. It is now March & he hasn't had to replace the batteries or the lights. It's very durable considering how much it gets kicked around.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie B.",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Team loves it",
      "text": "My soccer team loves it. We extended training by 45 minutes (sorry parent) and all could see the ball well. The only problem is still can see the other people, Glow vest maybe? The reason for the lower stars is that I was expecting something soccer ball like not rubber ball like.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Your soccer fan will 'glow' with joy",
      "text": "This is NOT a regulation ball. SO WHAT?!?!? It glows when you kick it. My 9 year old soccer fan loves it and wants to go and shoot with it almost every night. Every other 5 star review is pretty much the same, and most of the reviews are 5 stars... Enough said.",
      "rating": 5.0,
      "verified": true,
      "author": "hubrisIsSin",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "easy to blow up with air pump and seems like ...",
      "text": "Okay, I give this product 5 stars because it's unique, works well, easy to blow up with air pump and seems like a hearty product. I give this product 3 stars because this ball is hard as a rock once it's blown up. It's definitely an outdoor thing, and BE CAREFUL when getting hit by the ball with harder kicks and bumps because my son got quite the nice bloody nose with just a gentle tap with this harder soccer ball. So, average 4 stars. Great seller and product.",
      "rating": 4.0,
      "verified": true,
      "author": "K Dawes",
      "helpful_votes": 2,
      "publication_date": 20151229
    },
    {
      "title": "Absolute Buy!",
      "text": "This is very cool! It lights up when it’s kicked and stays on. It automatically turns off if it hasn’t been kicked. The lights are a vibrant red hue. My 12 year old and 6 year old LOVED it on quarantine. They kicked it in the street at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Adele Baca",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great gift for soccer fans!",
      "text": "This was a big hit! We got this for one of my son's friend as a birthday gift. He's a huge soccer fan. At first when he opened the gift he was like \"awww a soccer ball\" not that enthused. Then I hit the ball hard enough to make it light up (takes about a kick's worth of force) and he said \"oh wow that's so cool!!\" Easily the hit of the party. Just know it comes deflated and not in packaging or a box you can wrap. We just inflated it and put it in a gift bag. Easy peasy!",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Saucier",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Best way to get kids to play outside",
      "text": "This ball is great my son loves it and wants to kick this ball around all the time. He normally just sits around the house and doesnt want to go outside. Im now having to call him inside. It was pretty easy to inflate you do need your on inflator it doesnt come with one.",
      "rating": 5.0,
      "verified": true,
      "author": "katytilton",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Great soccer ball for boys and girls of all ages!",
      "text": "I Bought this as a Christmas present for my younger brother. He's 11 and thought it was cool just to get a soccer ball for Christmas. As soon as he gave it a bounce he got so excited that it lit up! He exclaimed how cool it was and proceeded to show everyone. Then he took it outside to play with his friends. The ball was shipped deflated with the batteries already installed. The ball was easy to inflate with our air compressor. A tool to change the batteries was included it hasnt been used yet but the directions made it seem simple enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170101
    },
    {
      "title": "Brightly lit",
      "text": "Excellent soccer ball. I bought it for the neighbor’s son for his fifth birthday. We live in a cul de sac, and the families get together often. I knew this lighted ball would be a hit. It is better than expected. It lights brightly and has enhanced the nightly soccer games. Great purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa C. Garieri",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Very bright and easy to see",
      "text": "They only downside is it is \"rubbery\" without a soft pad on the outside and so it hurts a little more when you get smacked with it and when you kick it. It does not play like a real soccer ball, but if you are playing in a backyard at night, it is fabulous.",
      "rating": 4.0,
      "verified": true,
      "author": "hellohu",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "GREAT PRODUCT AND A GREAT COMPANY",
      "text": "I had initially given Glow City only 3 stars. There was a problem with one of three balls I purchased. There was a product flaw and I was waiting to see how it would be resolved. Glow City has been outstanding to deal with. In this day and age, the consumer many times is out the money spent on a flawed product. This is not the case with this company. Kudos on a great product that our grandchildren love.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol E",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "Amazing company",
      "text": "It was a gift for my Granddaughter and she absolutely loved it. Very easy to inflate and very good quality. I actually got a thank you email just before I got the balls. Telling me if I had any questions or concerns don’t hesitate to contact him and he was true to his work. Couldn’t be happier with the prior the customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Austin",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Bright and Fun",
      "text": "What I like most about this ball is that it's motion activated, meaning the battery doesn't run down when you aren't playing it and there's no ON/OFF switch to worry about. I've used this ball for about 6 months now and it is still going strong. This ball has held up well while being played with by adults and I still have not had to worry about changing the batteries. It really is the perfect way to get outside and get active even in the dark.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany E Avery",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "Sturdy high-quality ball, light stays on",
      "text": "I comes with batteries. Just pump it up and go. Seems durable. Light stays on for constant play, it turns off after about 20-30 secs of inactivity and then activates upon impact again. The only thing keeping me from giving it a 5-star review is that it's not truly a soccer ball. It's more like those rubbery volley balls I remember from highschool. So, it sort of grips to your shoe unlike a soccer ball, it's not slippery so it can trip you if you're trying to do tricks or roll your foot over the top of it. Other than that, it's great and seems very sturdy and capable of taking the solid impact of adult kicks.",
      "rating": 4.0,
      "verified": true,
      "author": "davirino",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "These light up soccer balls are SO much fun!!",
      "text": "These light up soccer balls are SO much fun!!! From reading the other reviews, I can see where some people might think it's hard, but it has to be to protect the light and battery pack inside. It feels like a tough rubber, but extremely kick-able as long as you're not unloading full blast on the ball. If you're ripping big shots one right after another, you might have sore feet. If you just play the game, and make awesome passes.....IN THE DARK!!!!!.....and take normal shots, then it's lots of fun, especially since you're playing AT NIGHT!!!!!!! I'm going to try the football next.",
      "rating": 5.0,
      "verified": true,
      "author": "orsunshine",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Worth the money, hours of fun",
      "text": "Can play with it in daylight light or night time Holds up being kicked around Soft enough no one gets hurt Price is great Great gift for whole family",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl Stow",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Great for late night excursions or winter practices when the light's too low",
      "text": "This is God's gift to mankind. Bought their basketball and loved it. I'll update my review if it quits on me, but I don't think I'll need to do that. Buy it, you won't regret it. The basketball is a year old and still going strong. I think this one will be of similar quality",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180619
    },
    {
      "title": "Turns off when not in use, lots of fun",
      "text": "My soccer players love it! We've had it for 2 months and it still works great. The ball is made out of rubber so it's not something to bring to an actual soccer training. Great for soccer parties and some evening/night kicking in hour backyard. It turns off when not in use to save battery.",
      "rating": 5.0,
      "verified": true,
      "author": "A. K.",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Great item, wish it came in a giftable box, my only complaint!!",
      "text": "Does not come inflated, comes in plastic bag, no box. Wish it was more giftable in a box but great ball.. Lights up really cool, easy to inflate and light up.",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi T",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Junk.  Worked twice. Won’t hold air.",
      "text": "This is junk. Got it for my 8 year old for Christmas. Worked about as good as you can expect a soccer ball to work the first and maybe second time he used it but since then we can’t get it to hold air. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "T. OBRYAN",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Good quality ball",
      "text": "I bought this ball for my daughter as she likes to kick a ball outside when it’s getting dark, and was having to use a flashlight to find her soccer balls in the yard. We’ve had this ball for a couple months now and it’s still working. It’s even been kicked against the fireplace and is working.",
      "rating": 5.0,
      "verified": true,
      "author": "BSK",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "This is a great ball, it lights up well and stays lit ...",
      "text": "This is a great ball, it lights up well and stays lit for a decent amount of time so you can find it after dark. Stays inflated, we have had ours a couple months now and haven't had to reinflate at all. This has been a great ball. I would recommend for any soccer players out at dusk or after dark!",
      "rating": 5.0,
      "verified": true,
      "author": "Mel C",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "This is a rubber type ball vs leather so I recommend not using it where there are a lot of ...",
      "text": "The ball lights up very well. Need to keep using or lights will go out. This is a rubber type ball vs leather so I recommend not using it where there are a lot of rocks present.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Wire",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Great Ball! I have been coaching high school soccer ...",
      "text": "Great Ball! I have been coaching high school soccer for 7 years and each year we do a glow in the dark game. I have never had a ball that works well until this one. It does not feel like a regular game ball. It is basically an old style rubber ball but very visible and very durable. It was able to hold up to the normal play of high school players",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "Lights up perfectly",
      "text": "Super cool soccer ball. Very cool when it lights up. Not the same material as A real soccer ball and more like a four square ball type material. Fun for kids to use at night but not sure it would fly during a real soccer practice.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Merrill",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Lights up bright.",
      "text": "The ball lights clearly and very bright. Lights as you kick it. Great for evening play. Would recommend and purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "I am so glad that I did",
      "text": "I was nervous about this item as the other reviews seemed mixed. However, I am so glad that I did, because my 14 year old son loves it. It is super bright, and perfect for night time games in the back yard. The ball shuts off automatically after about 40 seconds of non-use, which is great. The only drawback is while they claim it is a standard size (5) it seems a bit smaller than a normal size 5 ball. We are only using it for fun so not a big deal for us, but could for others. I plan to buy more balls from glow city again.",
      "rating": 5.0,
      "verified": true,
      "author": "melissa a bass",
      "helpful_votes": 0,
      "publication_date": 20151229
    },
    {
      "title": "Beyond my expectations",
      "text": "This ball was bright, weighted just right for passing and kicking, and the sand from the beach did not stick to it. I recommend this for night time shenanigans.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Quirk",
      "helpful_votes": 2,
      "publication_date": 20180902
    },
    {
      "title": "Be prepared to fill it up",
      "text": "Ball was great, but came deflated. I had to find a pump to fill it up which is not normally in my wheelhouse last minute, but thankfully my local dollar store had a hand pump with a needle that did the job. I didn't notice you could buy it in black as well until later. The black might hold up better outside, but we have been using this indoor so far. I cannot speak for the black scuffing floors or not.",
      "rating": 4.0,
      "verified": true,
      "author": "Decorating mom",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Good for nighttime play",
      "text": "My kids were playing soccer with a group and they used this ball when it started to get dark earlier when summer was over. It is a little hard according to some players but it worked well enough. It stayed lit. It glowed the whole time during the games, It will glow when it gets hit and keep the glow long enough for the next hit.",
      "rating": 4.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Excellent quality and service!",
      "text": "Balls are of excellent quality. I purchased three as Christmas gifts for three teenage boys and what a hit they were! I can't say enough good things about this company. I had an issue and a replacement was sent out priority mail. I had the replacement in 2 days and they included a small handheld pump at no cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Nice",
      "text": "It sort of heavy, my son is 7 years old and has a hard tome kicking it around",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley Armijo",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Light Up Soccer Ball",
      "text": "This ball is made out of good quality material and is very durable. I can see this lasting a very long time. The lights were brighter than I was expecting! My son loves to kick it around the house in the dark. It comes with the tool to cha ge batteries but nothing to help blow it up.",
      "rating": 4.0,
      "verified": true,
      "author": "HeatherH",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Attractive but not as durable as expected",
      "text": "Ball deflates quickly and is easily scuffed. The overall look and light feature are good",
      "rating": 4.0,
      "verified": true,
      "author": "Michele C.",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Awesome",
      "text": "Awesome product. It's still going strong. Now to look for a light-up hockey puck.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C.",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "Lights up great but not sturdy.",
      "text": "The ball lights up awesome! Only downside? It’s nowhere near as sturdy as a normal ball. For regular use would probably be fine, but we are pretty rough on balls (played on motorcycle)",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher Shaw",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "An amazing product combined with great customer service.",
      "text": "I bought this specifically to be used for a nighttime tournament with a group of friends. The ball sustained 3+ hrs of intense play and is still going strong. It lights up brightly enough that we never lost sight of it. We had a lot of fun with glow sticks and candles as our boundaries/team identifiers. Customer service very quickly addressed any questions I had and were more than accommodating to any requests. I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Wwitz757",
      "helpful_votes": 2,
      "publication_date": 20161126
    },
    {
      "title": "Best thing ever!",
      "text": "Best thing ever according to the grandkids. Loved how it turned in with s single bounce and automatically turned off. They love playing soccer and now they can play at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Laura Karczewski",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Absolutely worth it.",
      "text": "I don't usually take the time to write reviews, but this is one of those items that so completely lives up to expectations that I have to add my vote that this ball is totally worth it. We bought several glow items for a bday party and this was by far the biggest hit. It glows BRIGHT and doesn't fade since it's battery-powered LEDs. Completely satisfied and would buy again for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "MommyRN",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Happy with purchase",
      "text": "My son loves the ball so much. Will wait and see how it holds up",
      "rating": 4.0,
      "verified": true,
      "author": "Naj",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Too hard to use for soccer",
      "text": "Too hard to actually use as a soccer ball. The ball is made with very hard plastic. Under inflating made it roll slower. My 12 yr old daughter is in club soccer and I thought she'd have fun playing this in the yard in the dark, but It's like kicking a plaster wall.",
      "rating": 3.0,
      "verified": true,
      "author": "Janie Appleseed",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "I bought this for my grandson who is legally blind ...",
      "text": "I bought this for my grandson who is legally blind. He can only see bright lights. He really enjoys playing with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Coolest coach in town",
      "text": "My soccer teams (8 and 10 year olds) loved this at the end of the fall season when it got dark early. The kids (and many of the adults) were delighted. The only complaint is that the ball is a bit hard...the rubbery skin wouldn't be fun to get hit too hard with. But is any ball fun to get hit with?",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Love the idea",
      "text": "I loved the idea it was awesome for the first 10 min but when it popped we were all kinda bummed out.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon Clouse",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Glow crazy",
      "text": "We used this ball for a glow in the dark soccer game at the end of our soccer season. Such a hit! The ball stay lit while in play and the kids absolutely thought it was the coolest thing ever! The only problem I had was the ball deflated during use. I had to pump it up after about an hour. Other than that, we absolutely loved it and I recommend it to anyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan Carter",
      "helpful_votes": 0,
      "publication_date": 20171027
    },
    {
      "title": "Lots of fun!!",
      "text": "We bought this soccer ball and the football. The kids are having a great time. These look great at night in the dark! I highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Exceeded expectations!",
      "text": "This soccer ball is PERFECT! We played Human Foosball in the dark in a church gym with all the players organized like a foos ball table, holding onto PVC pipe and wearing glow sticks! We lit up the goals with Christmas lights and had the greatest time! The ball is PERFECT!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Johnson",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Great, but glue the plugs.",
      "text": "Works great! Used for kickball and gaga. Only problem was when someone booted it and one of the little plugs flew out, in the dark. I actually found it, but that was just lucky.",
      "rating": 4.0,
      "verified": true,
      "author": "Deanna Gemmer",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "It's definitely not regulation but it sure does the trick for having some fun after hours",
      "text": "My son was a little leery about this glowing soccer ball (he's 16) but when he realized that he can go play soccer at night he quickly warmed up to it. It is not the same texture as a normal soccer ball. It's definitely not regulation but it sure does the trick for having some fun after hours.",
      "rating": 5.0,
      "verified": true,
      "author": "sourjackjen",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Great Party Game Ball",
      "text": "I bought this for a birthday party game. We rented an indoor soccer field, wrapped all the kids in glow bracelets and necklaces, as well as outlined the field and goal posts. This ball is really awesome, just as advertised. It is a rubber ball, which is more of a novelty than a traditional PVC or PU ball, but for the party is was an instant success. The kids loved it and the ball worked flawlessly. The ball is very bright and stayed lit the entire time it was played with.",
      "rating": 5.0,
      "verified": true,
      "author": "judco55555",
      "helpful_votes": 10,
      "publication_date": 20141023
    },
    {
      "title": "Great product. The package was delivered a day earlier ...",
      "text": "Great product. The package was delivered a day earlier then expected. The status showed shipped within a few hours of purchase. The ball itself works as promised and seems to withstand solid hits. I have only used it twice and i will update if my opinion changes in the long run",
      "rating": 5.0,
      "verified": true,
      "author": "marc durham",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Kids had a blast playing with this. Heavy duty ...",
      "text": "Kids had a blast playing with this. Heavy duty (my son used it to play basketball and now the lights won't work.)",
      "rating": 5.0,
      "verified": true,
      "author": "island mama",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "The glow part was really cool. It might do better if not played with ...",
      "text": "It popped without much use. Kids are bummed. The glow part was really cool. It might do better if not played with near a rosebush.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Johnson",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Praying it was a fluke",
      "text": "We got this ball for my daughter for her 8th birthday. She LOVED it. She took it out one time and it’s now flat and will not stay inflated. I’m sending it back and will try again. Praying this was just a fluke.",
      "rating": 2.0,
      "verified": true,
      "author": "Tiffany Jones",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Their 20 month old brother loved it as much as the older ones",
      "text": "A huge hit! After playing with it outside, my 8 and 10-year old grandsons continued to play with it inside by turning off the lights and rolling it around their room. Their 20 month old brother loved it as much as the older ones. A caveat: the picture shows a white and orange ball but I was sent a black and orange ball. Too much trouble to return it, so will keep it.",
      "rating": 5.0,
      "verified": true,
      "author": "PAM",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "Super fun",
      "text": "The kids love it ! Very fun to play the soccer ball at night, when it glows in the dark.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Impressive at first and then the problems show",
      "text": "So it was okay for a little while but then one of the plugs fell out and disappeared. It's not super durable, sometimes the lights flicker inside so only 1 led is on for a time and randomly the 2 would turn back on hours to days later.",
      "rating": 1.0,
      "verified": true,
      "author": "Bryton",
      "helpful_votes": 2,
      "publication_date": 20160826
    },
    {
      "title": "It was opened Xmas morning and ended up in the backyard that afternoon getting kicked around.",
      "text": "I bought this for my nephew. Christmas afternoon it was in the back yard getting kicked around by him and all his cousins. It was a hit. I have to admit it looks pretty cool getting kicked around.",
      "rating": 5.0,
      "verified": true,
      "author": "PatO2098",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Fun and bright",
      "text": "this ball is a lot of fun to play outside in the dark with and very bright.",
      "rating": 5.0,
      "verified": true,
      "author": "JASMINE CAGE",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "As promised.",
      "text": "The ball does light up well. Hasn't used much so not sure how durable. Looks well made. Changing the batteries seem easy havnt done so. Very easy to inflate. Was a gift smd they loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "Queenie",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great for playing at night.",
      "text": "Love it. My daughter and I walk the dog at night and it's fun to pass the ball as we walk. It feels more like a rubber basketball than a stitched soccer ball - but it glows brightly and it perfect for night play.",
      "rating": 5.0,
      "verified": true,
      "author": "JRWall",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Ball lit up great..",
      "text": "Ball lit up great...for all of 2 minutes. Kicking it (youth team) got the ball to stop working. Took the batteries out and had to jam a metal piece in between to conduct electricity better. Even then, the ball would work every dozen kicks or so. Very disappointed and ruined what would have been a fun time for the team.",
      "rating": 1.0,
      "verified": true,
      "author": "Connor Shuck",
      "helpful_votes": 2,
      "publication_date": 20150814
    },
    {
      "title": "My grandson was happy to be able to play in the evening",
      "text": "Glows very well. My grandson was happy to be able to play in the evening. I purchased this from Glow City. They have a great Customer Service Department. I will be ordering from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Lighted soccer ball",
      "text": "I bought this for my granddaughter's birthday next week. I think she'll love it as she is a avid soccer fan; however, this ball is very hard and I don't know what kind of shoes she'll be wearing. She's only 6. It lights and looks very cool. At dusk it's awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "MB",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "awesome ball that works great but get the black one",
      "text": "awesome ball that works great but get the black one. I got both and the white and black and the white one seems to be made out of a more rubber type material and looks nasty dirty after little use.",
      "rating": 5.0,
      "verified": true,
      "author": "andrew t",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Kids love it!",
      "text": "Ball activates with movement, goes off after few minutes of no movement. Kids love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "... it a couple of time making the ball rather useless if the battery keeps falling out",
      "text": "Works but the piece holding the batteries feel out after kicking it a couple of time making the ball rather useless if the battery keeps falling out.",
      "rating": 2.0,
      "verified": true,
      "author": "Karson Dellert",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "The 4 year old I got this for loved it. Works well but just be aware that ...",
      "text": "The 4 year old I got this for loved it. Works well but just be aware that it comes deflated so you need a pump with a needle to inflate it. I had to run out and buy one at the last minute. Maybe it says that in the description and I just missed it.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Worth it!",
      "text": "Bought for my 11 yr old son's birthday. He loves it. Material is very tough more like a volleyball. But lights work great and shut off on it's own when not in use! Would buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Williams",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Not happy",
      "text": "I get this soccer ball thinking it will send as is in the picture! It literally came flat!! And no pump with it at all! That’s just a waist of time or at least sell a Pump with it or say u need to put air in it ur self!",
      "rating": 1.0,
      "verified": true,
      "author": "Lusha ",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Bummer because they are a lot of fun for the first 20 min",
      "text": "The ball will not hold air, second one we had and both have the same issue. Bummer because they are a lot of fun for the first 20 min.",
      "rating": 1.0,
      "verified": true,
      "author": "Father",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Five Stars",
      "text": "All ages love this! Had a \"ball\" outdoors! Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan L.",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "Had high hopes for this glow in the dark ball ...",
      "text": "Had high hopes for this glow in the dark ball, but it is so hard it hurts to kick it!!",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "it was probably the most fun I have seen those kids ever have",
      "text": "My son's soccer team was practicing this past week and unfortunately the park lights were not coming on due to the holidays. We busted out this ball and I gotta tell you, it was probably the most fun I have seen those kids ever have. From the sideline, the ball was amazing! It lit up way more than I ever expected and the kids had a blast since it stayed on and functioned like a real soccer ball. I highly recommend this for any avid soccer player who will not be slowed down by lack of light.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Brenan",
      "helpful_votes": 0,
      "publication_date": 20151231
    },
    {
      "title": "Disappointing",
      "text": "Came with a defect I had to end up returning it unfortunately",
      "rating": 1.0,
      "verified": true,
      "author": "StephenShu",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Great fun!",
      "text": "Great fun for dusk/evening play with the kids. Note that this is really an inflated rubberized ball, not a classic stitched soccer ball but it still works great.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Turnbull",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "The ball is an amazing ball the way it glows and looks",
      "text": "The ball is an amazing ball the way it glows and looks, the idea of it glowing at night is a great idea the thing I didn't like was the fact that it is very hard, as in when you kick it it hurts. So sadly w went back to playing with our old soccer ball. Also it is a ruber type ball not leather.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "The kids LOVED it!",
      "text": "This is a must have for Fall Soccer when it gets dark earlier. The kids LOVED it!! As other reviewers noted, it is not as soft as a regular soccer ball. But all three of my boys' soccer teams absolutely loved getting to use it during practice these past couple of weeks.",
      "rating": 5.0,
      "verified": true,
      "author": "Deneen Murphy",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "AWESOME!! Super happy!!",
      "text": "This ball is awesome!! The ball lights up well and feels durable. A little puppy tried to bite it a couple of times and couldn’t pierce the ball. Easy to inflate and came with extra batteries for the lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Schaub",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "I can't tell you about the durability just yet but ...",
      "text": "I can't tell you about the durability just yet but if I don't update, you will know. It seems durable though and it's impressive! Can't wait to use this ball at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Tavmoney",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "great ball for night soccer",
      "text": "this ball works really well and my kids like that they can kick the ball after the sun goes down. it was really handy when they kicked it over the fence into a ditch at night and they were still able to find it!",
      "rating": 5.0,
      "verified": true,
      "author": "JenM",
      "helpful_votes": 0,
      "publication_date": 20160114
    },
    {
      "title": "Bought as a going away gift for my son's friend ...",
      "text": "Bought as a going away gift for my son's friend, he thought it was so school and can not wait to play in the dark in Italy...",
      "rating": 5.0,
      "verified": true,
      "author": "J.Hill",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Excellent for practicing in the dark.",
      "text": "This ball enabled my soccer team to practice into those Fall evenings when it gets dark early. It is heavier than a regular soccer ball and feels more like a rubber kickball, but it works as described and the kids loved it!",
      "rating": 4.0,
      "verified": true,
      "author": "Russ Reihart",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "Super cool ball",
      "text": "Super cool ball. We took it to the beach to play soccer at night. Everyone on the boardwalk stopped to ask where we got this ball.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Not a soccer ball.",
      "text": "This is probably fine if you just want to kick a ball around, but it's not a soccer ball. It's a rubber ball with soccer pattern printed on it.",
      "rating": 2.0,
      "verified": true,
      "author": "J.Maye",
      "helpful_votes": 0,
      "publication_date": 20160702
    },
    {
      "title": "Good Product, Great Gift",
      "text": "Good quality, Easy instruction and Delivered on time as promised",
      "rating": 5.0,
      "verified": true,
      "author": "Ramon",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Nice Idea",
      "text": "The balls do not hold air that well, but they get you through a practice or a juggling session fine. Overnight they deflate a bit. No biggee though as they still fulfill their purpose when I air them up.",
      "rating": 4.0,
      "verified": true,
      "author": "Wesley H. Wood",
      "helpful_votes": 8,
      "publication_date": 20130417
    },
    {
      "title": "This ball is so fun! Bright neon colors when lit up",
      "text": "This ball is so fun! Bright neon colors when lit up. I thought I was going to have to put batteries in it, but no. All you do is inflate the ball with a standard ball pump and it's ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Grammarg",
      "helpful_votes": 0,
      "publication_date": 20161223
    },
    {
      "title": "... products which are all a blast to use and wonderful in getting our children",
      "text": "We own several Glow City products which are all a blast to use and wonderful in getting our children, as well as others, at the park active in the late evenings.",
      "rating": 5.0,
      "verified": true,
      "author": "TeamsterGene",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Five Stars",
      "text": "We love our GlowCity soccer ball! Perfect for night time soccer in the front yard! :)",
      "rating": 5.0,
      "verified": true,
      "author": "C. Harrah",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "GREAT ball but comes deflated so careful giving it as a gift",
      "text": "GREAT ball but comes deflated so careful giving it as a gift",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Cashman",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "It was a soccer themed party and her friend loved it. She said it glows really bright",
      "text": "My daughter gave this to her friend for her 10th birthday. It was a soccer themed party and her friend loved it. She said it glows really bright!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenlp",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Not gift quality",
      "text": "I didn’t like it came in a clear bag. It was a gift. I had to inflate it to present it. Ball was scratched/dirty",
      "rating": 4.0,
      "verified": true,
      "author": "Jackie Mendez",
      "helpful_votes": 0,
      "publication_date": 20200802
    },
    {
      "title": "Fun to play with at night",
      "text": "Fun to play with at night, but it's not nearly the same quality as a true soccer ball. Fun, but don't expect a \"real\" feel to it.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael G. Mcclain",
      "helpful_votes": 0,
      "publication_date": 20170103
    }
  ],
  "product_meta": {
    "title": "GlowCity Light Up LED Soccer Ball - Uses 2 Hi-Bright LED Lights, Size 5",
    "rating": 4.4,
    "feature_bullets": [
      "IMPACT ACTIVATED LIGHTING: Our LED soccer balls have two LED Lights that turn on when kicked or bounced. The Lights Illuminate the soccer ball when played with and automatically shut off after 30 seconds of nonuse. Unlike waiting for a glow in the dark soccer ball to charge under a light, The LED lights illuminate the soccer ball into bright red/orange glow.",
      "READY FOR PLAY: Light Up Soccer Ball Batteries are Pre-Installed and ready for use. Just pump the ball up with air and you’re ready to go. Soccer Balls are official size and weight and play just like any regular soccer ball size 5. Batteries will last about 30 hours of use; we also provide a replacement set for your convenience.",
      "DURABLE QUALITY: The GlowCity light up LED soccer ball is far from a novelty toy. Our Premier size 5 soccer ball is made from high quality materials that are meant to last. Our Hi Bright LED lights that power the ball have special optics that illuminate the entire soccer ball in a vibrant red glow.",
      "GREAT GIFT IDEA: Our cool Soccer Balls are great for boys and girls of all ages. Perfect for soccer season when it gets dark early in the fall. They also are a must have for camping and vacations. These Balls add a whole new dynamic to the game which makes it really fun for all ages.",
      "FIRST CLASS CUSTOMER SERVICE: GlowCity strives to provide the best customer service to our customers. If for any reason your glow in the dark soccer ball stops working We provide a 60-day hassle free repair/replace guarantee on all our products. Our Team Hand Checks Check each individual item Right here in our warehouse in the USA before shipping."
    ],
    "specifications": {
      "Product Dimensions": "10.8 x 5.9 x 3.7 inches",
      "Item Weight": "1.01 pounds",
      "ASIN": "B00A02PUAS",
      "Item model number": "LED_Soccer Ball",
      "Batteries": "12 LR44 batteries required.",
      "Best Sellers Rank": "#48,071 in Sports & Outdoors",
      "Customer Reviews": "4.4 out of 5 stars553 ratings4.4 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer": "GlowCity"
    },
    "categories": [
      "Toys & Games",
      "Soccer",
      "Sports & Outdoors",
      "Team Sports",
      "Sports & Fitness",
      "Balls"
    ],
    "price": 19.95
  }
}