{
  "website_summaries": [
    {
      "verdict": "A bucket dolly that rolls smoothly and resists tipping, even over rough surfaces.",
      "pros": [
        "Casters stay in place",
        "Includes metal tighteners to help secure your bucket",
        "Good quality on the construction",
        "A versatile bucket dolly that you can use to carry a variety of things"
      ],
      "cons": [
        "Some versions of this bucket arrive with plastic screws for bucket tightening, rather than the metal screws pictured"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wash & Roll System (Base)",
      "text": "Great bucket dolly for my carwashing system. Rolls easily on my asphalt driveway, brakes on two wheels keep the bucket from rolling on an inclined driveway. Three large dia. thumb screws hold 5, 6, or 7 Gal bucket in place without damaging bucket. Great foundation piece for my carwash system! See my other reviews of the additional components shown in this photo. Look for review title - Wash & Roll.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Groth",
      "helpful_votes": 6,
      "publication_date": 20160622
    },
    {
      "title": "Overall Good Plastic Screws Not as Good as Metal",
      "text": "The picture on Amazon sight shows metal screws to secure the bucket. They arrived with plastic. The sight has been updated since. The plastic to not hold the bucket as secure as the metal. The wheels are high quality and move great when the bucket is full of water. The overall construction is solid. Disappointed about the plastic fasteners.",
      "rating": 3.0,
      "verified": true,
      "author": "JAMES SWISTEK",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "One of the best purchases I've made",
      "text": "I bought a couple of these for work. We all are wondering how we got along without them for so long. Makes it much easier to carry around 50-80 lb buckets. Also works for drums, or anything else a little heavier than you want to carry. Very high quality casters and housing.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 4,
      "publication_date": 20141113
    },
    {
      "title": "You get what you pay for.",
      "text": "Very sturdy compared to others. Will support bucket with seat lid full of stuff with my 200 pound butt, and roll around just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Money24/7/365",
      "helpful_votes": 3,
      "publication_date": 20150208
    },
    {
      "title": "useful item.",
      "text": "I paired this up with a seat lid and have a rolling garage chair. I also used it for a rolling car wash bucket. my only issue with it is the set bolts seem to push into the buckets and loosen as the plastic buckets aquire the new shape.",
      "rating": 4.0,
      "verified": true,
      "author": "Carlos M Castro",
      "helpful_votes": 4,
      "publication_date": 20130529
    },
    {
      "title": "Works great. Makes it very easy for me to move ...",
      "text": "Works great. Makes it very easy for me to move my, 5 gallon, dust bucket around. This dust vacuum gets hooked up to my table saw, chop saw, plainer, router, and othe small woodworking tools.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric  Williams",
      "helpful_votes": 2,
      "publication_date": 20150312
    },
    {
      "title": "Buy same bucket marked up as from other sellers",
      "text": "Decent dolly with plastic bolts, NOT metal as seen in photo; Repackaged better deal from Chemical guys at 39.99 or Buy direct from Grit Guard also at 39.99.",
      "rating": 3.0,
      "verified": true,
      "author": "JRS",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Awesome!",
      "text": "Five casters are much better than four, and the quality of these dollies is far greater than I expected. No more lugging pails of grease and oil around. These roll very easily when loaded (on a cement floor).",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Rooks",
      "helpful_votes": 2,
      "publication_date": 20140111
    },
    {
      "title": "Bucket Dolly",
      "text": "Great piece hard to find fits 5 gal. round pail perfectly. Time saver as you can move full bucket around very easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred G.",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "Works as described",
      "text": "Was as expected. I do not like the fact that the new dollys have plastic stabilizers for holding the buckets, but I guess metal is a thing of the past. All hardware was shipped and parts arrived in a timely manner.",
      "rating": 5.0,
      "verified": true,
      "author": "Weaver1212",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "More handy than I thought it would be...",
      "text": "I was hesitant to purchase this, but it ended up being more handy than I thought it would ever be...",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Millman",
      "helpful_votes": 0,
      "publication_date": 20140302
    },
    {
      "title": "Well made product",
      "text": "Heavy duty, solid, durable, works great. I use it in my window washing business",
      "rating": 5.0,
      "verified": true,
      "author": "jpmac88",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "yum!",
      "text": "Awesome! Used it for my bucket that I have for washing my car. Makes things easier and quicker",
      "rating": 5.0,
      "verified": true,
      "author": "offroad",
      "helpful_votes": 0,
      "publication_date": 20140808
    },
    {
      "title": "Five Stars",
      "text": "use it to mop my garage floor, works exceedingly well!",
      "rating": 5.0,
      "verified": true,
      "author": "Joyce A. Klauer",
      "helpful_votes": 0,
      "publication_date": 20150813
    },
    {
      "title": "item pic is old model, but new model arrived",
      "text": "the pic shows metal screws and a bucket dolly label, what I received was the new updated version with large plastic screws and a \"Grit Guard\" label. The quality is great and made in the USA. Casters are nice and plastic mold is strong. I will buy another!",
      "rating": 5.0,
      "verified": true,
      "author": "MetalMan",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Outstanding Tool",
      "text": "These dollies are nothing short of superb. I bought one, just to test it out, and ended up buying two more for my other buckets. They easily fit the 5-gallon buckets from Lowe's or Home Depot. Made of a very tough plastic and supported by 5 wheels, they roll smoothly around in my garage, holding such things as lava sand, Texas green sand and bird seed. Hauling a full 5-gallon bucket around can be quite a bit of effort, but with one of these dollies, it's a piece of cake. I was especially pleased that they were available with Prime shipping, which got them to me in two days.",
      "rating": 5.0,
      "verified": true,
      "author": "ZekeC",
      "helpful_votes": 0,
      "publication_date": 20140923
    },
    {
      "title": "Heavy duty dolly",
      "text": "This is NOT a cheap thin piece of plastic like the buckets you will put in it. This is heavy duty. It's about 5 or 6 times thicker than a bucket with 5 heavy hard rubber wheels. I'm impressed and would recommend to anyone that needs a heavy duty bucket dolly.",
      "rating": 5.0,
      "verified": true,
      "author": "Waldo Brewer",
      "helpful_votes": 0,
      "publication_date": 20170614
    },
    {
      "title": "Two Stars",
      "text": "picture shows metal loops to hold bucket in place but we got cheap plastic ones",
      "rating": 2.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20180629
    },
    {
      "title": "Good Product",
      "text": "Works great for washing cars. It's easy to move around on hard surfaces such as concrete or asphalt. Very stable and doesn't tip. Be careful wheeling over cracks or divisions in concrete because the wheels are small and can catch causing the bucket to spill over.",
      "rating": 4.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 2,
      "publication_date": 20140317
    },
    {
      "title": "keep buckets rollin",
      "text": "hands down the best bucket dolly on the market today. sturdy thick plastic and strong casters. we uses these in a commercial kitchen to move around our 5 gallon buckets and they work great.",
      "rating": 5.0,
      "verified": true,
      "author": "D417RiCeR",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "Excellent Product",
      "text": "Sturdy construction, secures your bucket, saves your back and locks in place so it doesn't roll away. Would recommend to anyone. I'm buying another one and then getting the diamond plate Dolly connector from auto geek net",
      "rating": 5.0,
      "verified": true,
      "author": "Ranger Bob",
      "helpful_votes": 0,
      "publication_date": 20140604
    },
    {
      "title": "Awesome Product",
      "text": "You don't know how a product like this simplifies washing you car until you get it. Moving buckets around just got easier. The dolly has some really smooth wheels. A little push goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "WB SR",
      "helpful_votes": 0,
      "publication_date": 20130410
    },
    {
      "title": "Good solid construction.  Really tough!",
      "text": "Good solid construction. Really tough! I can tell it will last a good long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Gi'me my stuff!!!!",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Perfect Solutio",
      "text": "If you have a very heavy plant or some such item this works perfectly. Would recommend it for many uses.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "Expensive but it works well",
      "text": "Well built and sturdy, use a heat gun to take the sticker off it looks better.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Angry Russian",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Very well made and useful",
      "text": "a great cart to use with your 5 gallon bucket",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Rice",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Perfect for what was needed",
      "text": "We were having a car wash fundraiser and we purchased these to save our aching backs. These dollies worked great. Our backs thank them.",
      "rating": 5.0,
      "verified": true,
      "author": "christa",
      "helpful_votes": 0,
      "publication_date": 20130707
    },
    {
      "title": "Great product",
      "text": "Great product at a good price, does everything I expected. seems durable, holds the bucket tight. I purchased several products like this and this one is the one i would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "chris Wright",
      "helpful_votes": 0,
      "publication_date": 20131013
    },
    {
      "title": "DOes the job",
      "text": "I bought it for the bucket vacuum. Price is a little high but the quality is good and so far no complains.",
      "rating": 5.0,
      "verified": true,
      "author": "User",
      "helpful_votes": 0,
      "publication_date": 20140314
    }
  ],
  "product_meta": {
    "title": "Original Bucket Dolly- Black",
    "description": "Highlights: Color: Black 5 caster non-marring rubber 2\" wheels make it virtually 'tip proof' Can be used with any standard 3-1/2 or 5 gallon bucket Great for tilesetters, painters, driveway sealers, spacklers, home owners, car washes, hospitals, schools, movers and more Made in the USA Made of polypropolene copolymer plastics WARNING: This product can expose you to chemicals which is [are] known to the State of California to cause cancer and birth defects or other reproductive harm. For more information go to www.P65Warnings.ca.gov.",
    "rating": 4.3,
    "feature_bullets": [
      "Color: Black",
      "5 caster non-marring rubber 2\" wheels make it virtually 'tip proof'",
      "Can be used with any standard 3-1/2 or 5 gallon bucket",
      "Great for tilesetters, painters, driveway sealers, spacklers, home owners, car washes, hospitals, schools, movers and more",
      "Made in the USA"
    ],
    "specifications": {
      "Product Dimensions": "16 x 7 x 16 inches",
      "Item Weight": "4.6 pounds",
      "Manufacturer": "Original Bucket Dolly",
      "ASIN": "B00A9XW89Y",
      "Item model number": "GGBD-BLACK",
      "Customer Reviews": "4.3 out of 5 stars40 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#173,973 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 19, 2012"
    },
    "categories": [
      "Material Handling Products",
      "Home & Kitchen",
      "Material Transport Equipment",
      "Dollies",
      "Industrial & Scientific"
    ],
    "price": 60.0
  }
}