{
  "website_summaries": [
    {
      "verdict": "If you're the sensitive type - skin, that is - try this link bracelet from Willis Judd. It's made from high-quality titanium and features a double row of 3,000G magnets.",
      "pros": [
        "8.5 inches long yet lightweight",
        "resizing tool included",
        "Hypoallergenic and strong",
        "Includes germanium, negative ions, and far infrared for therapeutic purposes",
        "Comes in attractive gift box"
      ],
      "cons": [
        "Tool to remove links does the job but requires patience"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Doesn't look like the picture!",
      "text": "The picture does not look shiny at all and it looks grey...like gunmetal which is what I wanted. I already have a black one. The product has two lines of dark gunmetal coloring and the other three lines are shiny black. I am very disappointed. I will add that the finish has started wearing off as well. I’m downgrading from two stars to one.",
      "rating": 1.0,
      "verified": true,
      "author": "Ralph R.",
      "helpful_votes": 10,
      "publication_date": 20170315
    },
    {
      "title": "This products helped me, nice design and priced right",
      "text": "I've held off reviewing my Willis Judd bracelet to see how It affected my arthritis. The results in the first month have been quite good. When I wear the bracelet I have much less pain. My arthritis has never been extreme, but uncomfortable to the point that do not play golf any more. I continue work out pushing through the discomfort, but with this bracelet the discomfort is minimal. It's a good weight and in fact I sleep with it on. I also like the design, the price is reasonable and expect I'll add another one. Lastly I did remove a couple of the links and the tool was easy to use but requires patience.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob S",
      "helpful_votes": 9,
      "publication_date": 20160418
    },
    {
      "title": "I have type 1 Diabetes & really bad Neuropathy along with Arthritis & have been waking up ...",
      "text": "I have type 1 Diabetes & really bad Neuropathy along with Arthritis & have been waking up every morning for the past 10 years with my fingers & thumb locked up in a fist. The very first morning & every morning since for the past week & a half since I've been wearing this bracelet I have NOT had any locked up hands ! I was a Mechanic for thirty years so I just figured my hands were worn out, I am completely in awe that this combination of magnets & other elements has done so much for me ( I'm kinda wondering if it will wear out ? ) Thank you for this unbelievable product !!",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Williamsen",
      "helpful_votes": 12,
      "publication_date": 20160214
    },
    {
      "title": "Bad clasp, no customer service",
      "text": "I really liked this bracelet. I wear it to ease my carpal tunnel symptoms (and I believe it works). HOWEVER, the clasp that holds it on wouldn't stay closed and it fell off numerous times until the final time that I didn't notice it and I lost it. If that were the only issue, I'd give it a better review, but there is no easy way I could find to contact customer service. The contact link they have on their website doesn't work. I tried many times to contact them about the bad clasp with no success",
      "rating": 2.0,
      "verified": true,
      "author": "Doug Lee King monument",
      "helpful_votes": 6,
      "publication_date": 20170509
    },
    {
      "title": "Nice look Titanium Magnet bracelet",
      "text": "I have been wearing this Titanium magnet bracelet for a couple of months now. Since then I like the light weight, and look is sharp on my wrist. Really nice if you don't like heavy jewelry. It took a bit of time getting use to the snug fit for the mag effect, to work properly. Did have some issue with the link tool ,but Willis Judd was very nice and fast in making things right. I like it,worth buying.",
      "rating": 5.0,
      "verified": true,
      "author": "netshopit",
      "helpful_votes": 10,
      "publication_date": 20140521
    },
    {
      "title": "I like this one much better lighter and better looking",
      "text": "Magnets work for me the bracelet is a replacement for one I lost made do another company, I like this one much better lighter and better looking. I have been a journeyman auto tech for 35 years and my wrists have taken alot of abuse kayaking mountian biking and dirt bikes. At 52 I need all the help I can get, the bracelet helps with my carpel tunnel and swelling I'm right handed and that is were I wear it . Yea it can be scratched but I'm after function then fashion I never take it off for me it's a working tool. And for the money you can not go wrong, easy to size clasp is strong .",
      "rating": 5.0,
      "verified": true,
      "author": "batman",
      "helpful_votes": 6,
      "publication_date": 20160608
    },
    {
      "title": "I love it. Put it on yesterday",
      "text": "I love it. Put it on yesterday, and have felt better today. More energy. Am a firm believer in magnetic therapy. Have reaped benefits since June 1994, and this is the nicest magnetic bracelet I've seen. It's light, and like they say; hardly know it's on. Think I'll order another one. The benefits far outweigh the cost... It looks good too! This is not solicited, rather my firm beliefs... The box it came in is nicer than it has to be... Makes a very nice gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Big V",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "I was lookimg for an non-shinny bracelet.",
      "text": "I first loved this item, but why I have reviewed this as \"I like it\" is because, it indicated that this bracelet was to be in \"Matt\" or dull in color (as shown) and not glossy. Outer and mid section are \"Glossy\", very shinny and the two mid rows are \"Matt\", dull.",
      "rating": 4.0,
      "verified": true,
      "author": "Toshio Ozawa",
      "helpful_votes": 6,
      "publication_date": 20170523
    },
    {
      "title": "Picture and product color do not match!",
      "text": "Looks nothing like the picture. So looking at the photos others provided will give you a better idea of what it really looks like. The clasp for me was very hard to undo which is good because other reviews indicated lousy clasp. Cant comment on magnets and effectiveness only been one day but was not happy about color at first which is why i am posting. Being a woman with a thick wrist doesnt give a heck of a lot of \"pretty\" options but was able to remove 3 links and the color is growing on me.",
      "rating": 4.0,
      "verified": true,
      "author": "michelle touhey",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Had to remove a couple of links and the link removal tool worked great; you just nee to sure it's aligned correctly ...",
      "text": "Came well packaged and as advertised. Had to remove a couple of links and the link removal tool worked great; you just nee to sure it's aligned correctly and don't force it, the pins popped right out. Fit and look is great; have only had it for a few days, and can't speak to the overall affect of the magnets (will update later).",
      "rating": 5.0,
      "verified": true,
      "author": "James W.",
      "helpful_votes": 5,
      "publication_date": 20170304
    },
    {
      "title": "So glad I listened to my wife and bought one.",
      "text": "I have not taken the bracelet off since I received it. Unlike some customers, it does not have any scratch marks. It is not discolored, and it has not turned my arm green. But if it did, I would still wear it. Because the nasty pain I had in my knuckles is almost completely gone. I hope every bracelet bought works this well. One more thing. It fit me perfect, right out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Curly",
      "helpful_votes": 2,
      "publication_date": 20170121
    },
    {
      "title": "It has to stay on to work!",
      "text": "I lost the bracelet a few days ago. It just slipped off my wrist for about the forth time, and I didn't feel it this time. This one was a replacement for one that I sent back because the clasp seemed to stick out more than I expected and I was afraid it would come off. I asked on their website if it should stick out, and the answer was, No. I liked the bracelet for it's looks and feel, but if it doesn't stay on, it can't do what I bought it for. The really bad part is because it slipped off, I can't even return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Looks like a nice product and it arrived on time as ...",
      "text": "Looks like a nice product and it arrived on time as promised, but within two days of use one of the pins fell out and I put it back in only to fall out again. Looks like it may be a factory defect with the pin that holds the links in place. I returned it and I ordered a new one and see If I have better luck.",
      "rating": 3.0,
      "verified": true,
      "author": "Mario C.",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Helped with my arthritis pain.",
      "text": "The last couple months I've been having problems with my knuckles burning. I'm guessing it's arthritis. I've been wearing this bracelet for about a week now on my right hand. Absolutely no pain in my right hand. Still have a little in my left knuckles. Really thinking about ordering one for my left. Don't know how it works but it does.",
      "rating": 5.0,
      "verified": true,
      "author": "BILL BRU",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "The Bracelet is excellent and wonderful product but the removal tool is fast ...",
      "text": "The Bracelet is excellent and wonderful product but the removal tool is fast damage and made from poor quality or maybe i might have abused it.",
      "rating": 5.0,
      "verified": true,
      "author": "Haytham Younes",
      "helpful_votes": 0,
      "publication_date": 20171221
    },
    {
      "title": "... I broke a few years back and it seems like my hand isn't as sore when wearing it",
      "text": "I wear this on the wrist of the hand I broke a few years back and it seems like my hand isn't as sore when wearing it. Its a plus that it looks good also (and matches up to any of my watch bands).",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff P",
      "helpful_votes": 3,
      "publication_date": 20160131
    },
    {
      "title": "Looks impressive!",
      "text": "Giving it four stars as too soon to tell if it is doing any good. However, it is a very masculine AND attractive bracelet. My boyfriend is a bodybuilder so has larger than average forearms and wrists I would imagine so didn't need to make it smaller. The packaging is first class and definitely would make for a fabulous gift. i would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Cor-Vital",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Stylish and effective",
      "text": "This is a very nice looking bracelet, even if it didn't have all the magnets in it. And the magnets seem to work. I have varying levels of arthritis in several joints. Seemed to help my wrist and hands almost immediately.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ Papais",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Nice bracelet with difficult clasp",
      "text": "The bracelet is nice and I like it overall. However the clasp is very difficult to get on and off and I am concerned that it will not last long without breaking. I haven’t noticed reduction in pain due to wearing it. It is light and removing links is easy.",
      "rating": 3.0,
      "verified": true,
      "author": "crashdaddy",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Link removal is tough.",
      "text": "Will someone explain to me why a product that is for people with arthritis is so extremely hard to remove links? I struggled to get the pins out and broke all three of the tool ends. I ended up spending $15 at a jewelry repair shop to remove the links. Even the jeweler said it was hard to do. After all of that I'm hoping it works.",
      "rating": 3.0,
      "verified": true,
      "author": "Colleen M.",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Nice looking, fast acting - wish you could order already sized.",
      "text": "I've just had the bracelet for a few days now but can already feel an improvement with my arthritic hand. The tool to resize the bracelet was a bit challenging as I broke two of the three tool pins that push the bracelet pins out. Fortunately the give you two extra ones. I'd advise leaving one link for slack to allow for wrist swelling ... I'm nervous to go back and add a link to mine as I only have one tool pin left. It is a nice looking product and seems to work well!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Really works for pain!",
      "text": "Ordered for my husband for a gift because he has issues with pain in his wrist. It has really helped him. The band is easy to adjust with the tools that come with it too. He had to take out a few links to make it fit his wrist. It is a nice look as a bracelet too!",
      "rating": 5.0,
      "verified": true,
      "author": "CGDCR51",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Recommend this",
      "text": "I bought this for a male person he tells me he feels so much better wearing it opposed to him taking it off so it must have some value to it but very beautiful piece of jewelry",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Martin",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "The bracelet is well made and feels good to wear",
      "text": "The bracelet is well made and feels good to wear. The bracelet was too big but I was able to remove 2 of the links and have not had any problems. Thanks, Gloria Allen",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria ",
      "helpful_votes": 0,
      "publication_date": 20170822
    },
    {
      "title": "great bracelet",
      "text": "So far so good. I recieved it on the delivery date given. Bracelet is in great shape. Seems to be of good quality. Gunmetal color is really cool. I've only been wearing it for s couple days but seems to be working. Rather it's really the bracelet or just in my head, it's working I'll keep wearing it. ha ha!! I felt I had more energy and not as much ache pains as a normally do. It's a keeper!! The link removal tool was easy to use. No bent or broken pieces for us. Would recommend and purchase from this manufacturer again (in fact I've already found another bracelet I'm anxious to get).",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa E.",
      "helpful_votes": 5,
      "publication_date": 20131122
    },
    {
      "title": "Classy product and is working to solve my issue.",
      "text": "Classy looking, fits great considering I bought another Bracelet at the same time from the same same company, it’s longer than the other one, maybe I made a mistake in my order and didnt take enough time checking the length, I would buy from this company again. The reason I bought them is I have cramping in my fingers, it hasn’t been a problem since wearing this bracelet, is it that it really works or just I’m my mind, I don’t care something is working and that’s gold for me!",
      "rating": 4.0,
      "verified": true,
      "author": "Graham  Packer",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Lovely finish",
      "text": "I ordered this to replace an old magnetic bracelet. It's a very nice finish. The included \"tool\" did not work and I took it into a local jeweler to take off additional links. It's still a little larger than what I had hoped, but it's effective for me and I wear it 24/7. The clasp has, so far, never come loose. Nice product.",
      "rating": 4.0,
      "verified": true,
      "author": "rms",
      "helpful_votes": 4,
      "publication_date": 20160213
    },
    {
      "title": "Great Quality",
      "text": "It's easy to wear, looks great. Wasn't too difficult to adjust. Good quality, I was impressed. I've had others that come off when I would perform normal day to day tasks.",
      "rating": 5.0,
      "verified": true,
      "author": "A W.",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "This works fairly well it helps alleviate some of the ...",
      "text": "This works fairly well it helps alleviate some of the pain. I have had another that was much more costly that worked batter. You get what you pay for.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Haloon",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Beautiful bracelet",
      "text": "What a nice bracelet. Bought it for husband and he loves it. Color is beautiful. Came with tool to pull the pins to adjust the size of it. Which is a plus! Made sizing it down way easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Claspill",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Nice bracelet",
      "text": "Nice looking braclet decent price. The tool is chintzy to remove links but not a deal breaker. I don't believe in the magnetic mumbo jumbo. I just wanted a nice looking bracelet to fidget with.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Hall",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Great Bracelet, no pain relief",
      "text": "The sizing was great. Its very light so it's barely noticeable when wearing it. The quality seems to be excellent. I haven't really noticed any pain relief yet. I've tried it on both wrists and my finger, wrist, elbow pain is basically unchanged.",
      "rating": 4.0,
      "verified": true,
      "author": "tiny",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "Five Stars",
      "text": "My husband loves it seems to feel like it works for his back issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20170901
    },
    {
      "title": "Nice looking bracelet",
      "text": "Dont notice much pain relief. Durable. Has not faded. Nice looking. Worth the money",
      "rating": 5.0,
      "verified": true,
      "author": "Mary B.",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "... tightly that I need to insert a sharp object like a knife to be able to force the clasp ...",
      "text": "Only problem with product is the clasp to connect the two ends clamps together so tightly that I need to insert a sharp object like a knife to be able to force the clasp open to take bracelet off.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170522
    },
    {
      "title": "This is a very nice bracelet. I don't know how much the magnetic ...",
      "text": "This is a very nice bracelet. I don't know how much the magnetic therapy really helps but it can't hurt and bracelet looks really great on my wrist. The link removal tool is handy and makes it very easy to remove the links I needed to make a perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Shall",
      "helpful_votes": 3,
      "publication_date": 20161207
    },
    {
      "title": "It works",
      "text": "Looks great. It's strange my Neuropathy seems to be much better. Joint pain has lessened.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Lewis",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "This bracelet is fantastic. Its very comfortable",
      "text": "This bracelet is fantastic. Its very comfortable, helps reduce the pain and swelling I get from my arthritis. The gray titanium design is very stylish and looks great, I have received several complements while wearing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Magnets are great, but the finish is cheap.",
      "text": "After the first day, there were marks on the finish, simply from resting my wrist on the table as I wrote and typed. Within that first few days, I noticed a slight difference in pain level (for the better), but I won't be getting another. There are significant marks on every link and I haven't had it a week yet.",
      "rating": 3.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "He said his wrists started hurting so bad he put his regular bracelet back on",
      "text": "Bought for my dad. He wanted to compare to his regular magnetic bracelet. He said his wrists started hurting so bad he put his regular bracelet back on! He hasn’t worn it since.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Miracle bracelet for me.",
      "text": "Love it! I watched the video on how to remove the links and it was so easy! I wear it on my right hand that has the most pain and so far it has really helped I don't feel pain in my hand and have noticed that I don't feel pain throughout my body.",
      "rating": 5.0,
      "verified": true,
      "author": "contrean",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Looks Great.",
      "text": "I bought this item to use as a \"golf bracelet\" so I can't really comment on its \"pain relief\" properties. With that said, I very much like the look of the bracelet and the pricing was very reasonable. The clasp takes a little getting used to and it took a while to remove a link for sizing purposes using the enclosed tool.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul G",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Relief",
      "text": "I was hesitant about the technology, but constant pain inspired me to try it. What a surprise! It's not a cure but immediate relief! Side note, customer service could not be better.",
      "rating": 5.0,
      "verified": true,
      "author": "bravely secone",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Very comfortable and stylish that I almost forget the health benefits!",
      "text": "I love that it comes with a tool for sizing that's very easy to use. I wear it all the time as jewelry, and it certainly is attractive enough too. Very comfortable to wear that I even forget I have it on. Very happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Collier",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "Pain Relief",
      "text": "It was very easy to remove links to make smaller..It works for my Back Pain..Haven't had a backache since I put the bracelet on..this is the first time in twenty years my back did not hurt..Excellent!",
      "rating": 5.0,
      "verified": true,
      "author": "J Flor",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "It hasn't helped my pain but I still like the quality of the product",
      "text": "It hasn't helped my pain but I still like the quality of the product. I have Tenosynovitis, TMJ and other hand related issues with inflammation and pain in my finger, thumb joints.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Corriero",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Very attractive bracelet for a man",
      "text": "My husband likes this brand. This is the second one we ordered. The first one lasted a long time until he broke it at work.",
      "rating": 5.0,
      "verified": true,
      "author": "NEO",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Nice",
      "text": "Very nice for the price. Easy to remove links and durable",
      "rating": 5.0,
      "verified": true,
      "author": "Js79",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Light and resists scratch marks.",
      "text": "Good quality bracelet and surface resists scratch marks. It does seem to be unisex as it is quite lengthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane M.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Works for me",
      "text": "Wear this everyday it helps with my wrist issues. I did have an issue with taking the links out but other then that love the bracelet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Great looking and easy to adjust!",
      "text": "Excellent bracelet that very attractive on your wrist. It wasn't hard at remove links for a good fit. I'd recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul L. Blackwell",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "One Star",
      "text": "Lost it on the first day when the clip didn't hold",
      "rating": 1.0,
      "verified": true,
      "author": "stony g",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Love 'em! Everybody compliments them at work!",
      "text": "I'll have to go to a jeweler to take three links off because I'm afraid to use the link thing that comes with it. I had bought one before and these things are so lightweight that when I knocked the clasp loose at work I didn't even know it was gone until it was too late. I bought two more though! I can't really speak for the healing properties because of the physically stressful work I do, but I will say it's either my Lexapro or these that give me lots of energy!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Lee Wilkie",
      "helpful_votes": 2,
      "publication_date": 20150723
    },
    {
      "title": "Unbelievable",
      "text": "I cannot describe how much this has done for me.I'm 82, have had a broken back, I don't take medication work 4 full days a week, I've worn other magnetic bracelets but this one tops them all sleeping better less pain all over, What else can I say, The best.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Very nice!",
      "text": "Very good looking bracelet, but can't really speak for the effectiveness of the magnets. I have a very bad right shoulder and can't honestly tell any difference, but nothing else has helped either, so I can't blame the magnets. Appearance alone worth the price, though.",
      "rating": 5.0,
      "verified": true,
      "author": "dj garner",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Clasp and pins fall out",
      "text": "Bought a pair of these bracelets for my husband that has arthritis. He has used magnetic brackets in the past and thought these would work. The clasps open and the brackets fall off. Or a pin will slide out. They have not been reliable enough to stay on to determine if they will help him.",
      "rating": 1.0,
      "verified": true,
      "author": "B. Wall",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Review of Willis Judd magnetic bracelet",
      "text": "Very good looking bracelet and lightweight as titanium is known to be. Link removal tool is cool accessory, since I needed it to remove a link. Two extra pins were included, which was another nice feature. If this magnetic bracelet holds up as well as my old Sabona bracelet has (years of constant wear and still has all the magnets), I'll be a huge fan of Willis Judd products.",
      "rating": 5.0,
      "verified": true,
      "author": "Chill",
      "helpful_votes": 0,
      "publication_date": 20140104
    },
    {
      "title": "Funny how well this works",
      "text": "Funny how well this works... Some call it a placebo - I call it relief and don't care how it gets done ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "B. Thompson",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "Happy husband.",
      "text": "My husband really likes it. He doesn’t even wear a watch but he wears the bracelet!",
      "rating": 5.0,
      "verified": true,
      "author": "Lirije Asani",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Second one I've bought",
      "text": "Magnets help, looks and feels good on my wrist. Wears well.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "I was fortunate enough to catch it the two times it has ...",
      "text": "While I do appear to experience less pain with this on my right wrist, the problem comes from keeping it on my wrist. The clasp is not strong at all and constantly comes undone. I was fortunate enough to catch it the two times it has completely fallen off my wrist (in the first week of ownership). I'm considering returning it, since I'm pretty sure i will lose it eventually. It looks good, seems to work when clasped, but none of that matters if it doesn't function and stay clasped together.",
      "rating": 2.0,
      "verified": true,
      "author": "Matthew R Dvorak",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "Five Stars",
      "text": "This is my favorite magnet bracelet. It is very comfortable and it really helps with my shoulder pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Click Chick",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Well made",
      "text": "Sturdy and well made. I use it on my ankle and just leave it on 24/7.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay Hardy",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Five Stars",
      "text": "Will rerun with written after a little use. So far pretty good. Had to remove the clasp it kept opening. Other then that all is good.",
      "rating": 5.0,
      "verified": true,
      "author": "David Lee",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Pain",
      "text": "Had wrist pain after wearing bracelet, have the stainless version no broblem.",
      "rating": 3.0,
      "verified": true,
      "author": "william chatlos",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "It was very nice when new",
      "text": "Had it for about a week and the color is already wearing off the bracelet. It was very nice when new, but i wouldn't buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Wallace W. Cleveland",
      "helpful_votes": 3,
      "publication_date": 20140813
    },
    {
      "title": "Very nice design",
      "text": "I love the design of this bracelet and it does make a difference for my balance when I wear it... Just try it for yourself :) The link removal kit however is not strong enough... All 3 meshes broke when I tried to make it fit my wrist... So I am wearing it on my ankle until I find a jeweler who can make it shorter :)",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20130910
    },
    {
      "title": "Loving it",
      "text": "Love the quality and feel of it. Ive been wearing it for several months and I think it helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell S.",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "... have purchaged this one before and they are working good on me due to that i dont have any ...",
      "text": "I have purchaged this one before and they are working good on me due to that i dont have any more shoulder back pain after starting using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Bjørn-Ole Furuseth",
      "helpful_votes": 0,
      "publication_date": 20150728
    },
    {
      "title": "Bought this for my husband for Fathers Day present. ...",
      "text": "Bought this for my husband for Fathers Day present. he likes it, however, has only had it a week and he said it has helped some but thinks it may take a little more time to really know anything.",
      "rating": 4.0,
      "verified": true,
      "author": "shutter bug",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "More links needed",
      "text": "I give 3 for looks. But please send 3 more links(.and instructions for installation. It is too small to wear. Therefore, no pain relief",
      "rating": 3.0,
      "verified": true,
      "author": "alimom",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Nice quality and easy to adjust",
      "text": "Nice quality and removing the links was much easier than the one I bought a year or so ago. However, only 4 stars because it is black not charcoal grey as shown.",
      "rating": 4.0,
      "verified": true,
      "author": "Zack",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great looking bracelet",
      "text": "This bracelet is not as dark as indicated on Amazon but is very nice; good quality and the link removal tool works well. No problem removing 3 links to fit. I wear it 24/7 but have not had it long enough to know if is effective in reducing joint pain. Looks and feel good though. It is so light that I don't realize I'm wearing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sweetpilgrim",
      "helpful_votes": 0,
      "publication_date": 20140123
    },
    {
      "title": "Difficult taking on and off should be magnetic at the ...",
      "text": "Difficult taking on and off should be magnetic at the ends my husband was having problems taking it off to get in the shower not made fir men",
      "rating": 1.0,
      "verified": true,
      "author": "Annette Kuhnle",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "Four Stars",
      "text": "looks very nice however I don't feel any benefits of the magnets honestly.",
      "rating": 4.0,
      "verified": true,
      "author": "Jared Pugh",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "I am a mechanic and not real gentle on things and so far it has held up nicely. I definitely is for an 8",
      "text": "Have had it a week now. I am a mechanic and not real gentle on things and so far it has held up nicely. I definitely is for an 8.5 inch wrist. Had to order two to get it to fit my wrist.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Miner",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Daddy likes.",
      "text": "It looks sharp and helps me to get through my day.",
      "rating": 5.0,
      "verified": true,
      "author": "Roper",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Scratches easily",
      "text": "Packaging and delivery was excellent. Looks and weight are perfect. I wanted titanium because it does not easily scratch. I’ve only worn it less than a week and I already see lots of scratches",
      "rating": 3.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Four Stars",
      "text": "This think might actually work! My aching finger now doesn't ache!",
      "rating": 4.0,
      "verified": true,
      "author": "Cheryl Dodson",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "I like the look and after a couple of day's I ...",
      "text": "I like the look and after a couple of day's I didn't even know it was on. The only thing is the hasp is really hard to open with one hand. I know you want it tight so it doesn't come lose",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Hahnlen",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Quick Results",
      "text": "Stylish, comfortable, reasonably easy to remove links & the pain in my thumbs seems noticeably reduced. We'll give it some time, but initial result seems positive.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Well made",
      "text": "Not a believer in it helping arthritis but I liked the style and it’s very comfortable and I wear it wherever I go. Looks nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Tedster",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great looking magnetic therapy wrist band .",
      "text": "Looks great and feels great . No pulling of hair and no pinching of skin . It is taking a licking as I am working .",
      "rating": 4.0,
      "verified": true,
      "author": "LAWRENCE  PIZZICHEMI",
      "helpful_votes": 0,
      "publication_date": 20170506
    },
    {
      "title": "Nice looking addition to my jewelry, benefits too!",
      "text": "Nice looking bracelet. I still need to remove a couple of links. I've only worn it two days, but I do think it has helped ease the pain in my fingers that often wakes me up at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Phillips",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "The large is big enough to fit a 10” wrist",
      "text": "The fit is better than expected it’s starting to relieve the arthritis in my hand",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby A.",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Five Stars",
      "text": "Came with a tool to push out pins to adjust bracelet",
      "rating": 5.0,
      "verified": true,
      "author": "KIM M. ARNOLD",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Not effected",
      "text": "Still I getting electric chock even i have it all the time",
      "rating": 1.0,
      "verified": true,
      "author": "hatem_farag2001",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "but I feel better when I wear",
      "text": "Some people may scoff at magnetic therapy, but I feel better when I wear it",
      "rating": 5.0,
      "verified": true,
      "author": "RickPS",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "For my husband",
      "text": "He likes it very well. Finds it attractive. Really no comments yet on how it is helping him.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Roblyer",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Received today completed set.",
      "text": "Thanks seller, colour nice a bit shining hopefully it will last 3 years I ware everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "wee ah chye",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Very nice looking bracelet",
      "text": "i like everything about it. I use it for better blood circulation .",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Worth a try!",
      "text": "The clasp isn't reliable, it released several times. Pain has been reduced by 50% in 2 weeks.",
      "rating": 4.0,
      "verified": true,
      "author": "jay s",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Look very nice.",
      "text": "Very nice looks, and works great! The clasp is a really tight but I guess I don’t have to worry about it coming undone.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Kolb",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "My friend loved getting this as a gift",
      "text": "My friend loved getting this as a gift. I bought a second one to give to another friend because I liked it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "I removed two links and the bracelet fit perfectly. ...",
      "text": "I removed two links and the bracelet fit perfectly. A friend of mine saw the bracelet and he is ordering one. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "lefty9",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Five Stars",
      "text": "Fits perfectly looks great, not to flashy but noticeable, and quick shipping time Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "scratches easy",
      "text": "Its nice and works but after wearing it fore a week it has a lot of scratches.wish I new before I bought it.",
      "rating": 3.0,
      "verified": true,
      "author": "richard s",
      "helpful_votes": 12,
      "publication_date": 20130113
    },
    {
      "title": "One Star",
      "text": "Bracket is nice, tool to remove links broke first time I tried to use it",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Made for men but great for women",
      "text": "Bough for may daughter and she loves it. The looks, style and fit. Great that it included a a resizing tool.",
      "rating": 5.0,
      "verified": true,
      "author": "wboyd",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Very good buy. Just follow video to adjust size and ...",
      "text": "Very good buy. Just follow video to adjust size and take your time doing it. Very well made and looks really cool.",
      "rating": 5.0,
      "verified": true,
      "author": "bob a adelman",
      "helpful_votes": 0,
      "publication_date": 20150724
    }
  ],
  "product_meta": {
    "title": "Willis Judd Double Strength 4 Element Titanium Magnetic Therapy Bracelet for Arthritis Pain Relief Gunmetal Colour Adjustable",
    "description": "PRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Package Dimensions :9.4 x 3.2 x 0.5 inches; 5.6 Ounces\n * Item model number :TB0064FEUSA\n * Department :Womens\n * Date First Available :November 27, 2012\n * Manufacturer :Willis Judd\n * ASIN :B00AE79KXW\n\n * .zg_hrsr_item {list-style : none};\n * Amazon Best Sellers Rank: #194,119 in Health & Household (See Top 100 in Health & Household)  *  #81 inMagnetic Therapy Products \n    *  #52234 inHealth Care Products \n   \n   \n\n * Customer Reviews:4.2 out of 5 stars253 ratings",
    "rating": 4.2,
    "feature_bullets": [
      "DOUBLE ROW 4 ELEMENT extra strong high powered 3000 Gauss Magnets helping to relieve the symptoms of arthritis, carpal tunnel and tennis elbow. These are the strongest magnets available, much stronger then any other weaker magnetic products on the market!",
      "8.5 INCH LONG / .5 INCH WIDE with free size adjusting tool included with this bracelet allowing you to easily adjust the size of the bracelet at home so it always fits your wrist perfectly. An easy to follow Instructional video link is also provided!",
      "PURE TITANIUM with GUNMETAL IP PLATING & 100% HYPOALLERGENIC! Titanium is extremely strong and incredibly light weight you'll hardly know you are wearing it. Titanium is an extremely robust and very low maintenance metal perfect for everyday wear it will not irritate your skin or cause the allergic reactions that steel and copper can.",
      "PERFECTLY PACKAGED in the stunning premium quality Willis Judd Packaging. This provides a great place to keep this lovely jewellery safe or make it a fantasic gift to give!",
      "ALWAYS looks fashionable and modern. This stylish design is so descreit no one would suspect it's a therapeutic bracelet. There is a Willis Judd bracelet to suit every occasion."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "9.4 x 3.2 x 0.5 inches; 5.6 Ounces",
      "Item model number": "TB0064FEUSA",
      "Department": "Womens",
      "Date First Available": "November 27, 2012",
      "Manufacturer": "Willis Judd",
      "ASIN": "B00AE79KXW"
    },
    "categories": [
      "Magnetic Therapy",
      "Clothing, Shoes & Jewelry",
      "Health & Household",
      "Massage Tools & Equipment",
      "Wellness & Relaxation"
    ],
    "price": 36.99
  }
}