{
  "website_summaries": [
    {
      "verdict": "The Canon PowerShot N packs a neat Creative Shot mode, but it doesn't let you select your favorite filters and its design makes it a frustrating camera with which to shoot.",
      "pros": [
        "Sharp lens",
        "Excellent high ISO performance",
        "Wi-Fi",
        "Instagram-like image filters",
        "Touch screen display"
      ],
      "cons": [
        "Difficult to hold and operate",
        "Few physical controls",
        "In-camera charging only",
        "Limited manual filter capability",
        "Weak flash"
      ],
      "aspects": {},
      "publication_date": 20130611,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Stabilization in standard zoom is excellent, highly recommend getting a tripod for static video",
      "text": "My only complaint with this camera is the extremely fleeting battery life. Even with two spare batteries the camera would be dead before the end of the day. To be fair, I was shooting primarily video in 1280P. Stabilization in standard zoom is excellent, highly recommend getting a tripod for static video. Touch screen display is super responsive, and the 90 degree tilt is great for panning and filming while walking - does not allow for selfie-shooting. More features than I used but great to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Lothar",
      "helpful_votes": 0,
      "publication_date": 20170402
    },
    {
      "title": "Expensive, moderately useful little camera-looks cool!",
      "text": "It is an awkward design little camera-I'm glad I only paid 79.00 (super clean used) rather than the more than 200.00 most places. Quality is good fine-Like my canon g-10 power shot, I keep it in program mode with -1/3 exposure compensation and mostly it works fine. Connection to cell phone/tablet easy enough. Touch screen focus is handy combine with touch screen shutter release is much better than ring on front release... Using touch shutter release, touch the screen where you want it to focus it seems to adjust focus to the shutter touch point. I really wanted it because I think it looks good...I own better cameras,",
      "rating": 4.0,
      "verified": true,
      "author": "J. Nadelle",
      "helpful_votes": 2,
      "publication_date": 20150515
    },
    {
      "title": "its a nice camera.",
      "text": "Maybe my expectations were set too high... its a nice camera... but in the end I feel like its more of a novelty item, the ring shutter is confusing and the fact that the LCD does not extend all the way up really makes the hinge aspect useless other than for the sake of holding the position of the camera on an uneven surface without a tripod, the \" sleeve\" for the tripod is a contrast in color to the actual camera and makes it look even more like a toy!...",
      "rating": 2.0,
      "verified": true,
      "author": "nedboogie",
      "helpful_votes": 0,
      "publication_date": 20161124
    },
    {
      "title": "A few gotcha's",
      "text": "Some nit-picks: a) Camera is advertised as being able to trip the shutter with a tap to the touchscreen. But no on can seem to get that function to work, and it was a prime selling point of the camera so will probably be returning. b) Listing should also include \"What's in the box\"!!! Nothing in the listing or on the Canon site mentioned a neck strap, so we shelled out an additional $15 for a neck strap, only to find that one came with the camera. c) Camera comes with a blue bottom shell (presumably to protect the SD card & battery doors), but shell does not fit properly when neck strap is attached. Not a very good design.",
      "rating": 3.0,
      "verified": true,
      "author": "Glenn V,",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Great product Canon.",
      "text": "Bought the camera as a Christmas present for my wife. She loves it. It is small, compact and I like the flip of viewer. Using the lens ring to trip the camera is a good idea. So many of these small cameras move at the effort of presing the picture button. With this camera you are able to hold it solid while you trip the shutter. Canon has done another good job. I have not used the wireless feature yet but look forward to learning it as my PC and printer are wireless.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas J. Floria",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Best small camera ever!!!!",
      "text": "I Love Love this camera.....My husband bought this for me so that i could have a smaller camera to take places. The pictures are great i love the options it has and it's not heavy when i hang it around my neck. I like that i can connect with WI-fi to my I-pad or I-phone and send pictures.I have a canon rebel but sometimes it's too big to take to Disneyland this camera is perfect for stuff like that. The only thing i don't like is where the shutter button is located and the battery dies fast. But the camera charges fast so i keep a plug in my car.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20140129
    },
    {
      "title": "Great for taking photos with one hand",
      "text": "This is my second camera of this model. Great for taking photos with one hand. I use it while riding on the back of the motorcycle with my husband. My husband has fun asking others to take a picture of us and laughs when they have no idea how to use it. There's no shutter button and believe me it is easy to use. I carry it ALL the time in my purse.. It's small enough to fit in a medium/small purse.",
      "rating": 5.0,
      "verified": true,
      "author": "Life Is Good",
      "helpful_votes": 3,
      "publication_date": 20150703
    },
    {
      "title": "It has been the perfect little camera to take very allike professional photos",
      "text": "It has been the perfect little camera to take very allike professional photos. It doesn't dissapoint, very compact and has a very useful zoom. Except that it is not easy to tell someone to take you a photo since the cliker is on top of the lens. As user you know where it is, but as a person new to it, it can be a little tricky.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen N",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "I should have read the reviews first",
      "text": "I first learned about the N2 and saw screen flip completeley but it was $300. This older camera at half the price would fit my needs in every way but I didn't find out that the screen didn't flip all the way like the N2 until after I placed the order. So it's a bummer that it isn't any more special than my ELPH HS300 (bought 2009 ?) which I still prefer because it's so much lighter.",
      "rating": 4.0,
      "verified": true,
      "author": "wabbitt",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "Great Quality for the Price",
      "text": "Video quality isn't DSLR status, but it IS HD and it pretty amazing considering the price of this little bad boy. The actual camera isn't that great, but I purchased this mainly to use for a quick and convenient video camera. Yes, the swivel screen only goes halfway but that isn't that big of a deal considering this camera is so much cheaper than the newer versions. Also, playback audio on the camera itself is really hard to hear, but this doesn't effect the actual audio of the video itself.",
      "rating": 4.0,
      "verified": true,
      "author": "Austin Balke",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Nice zoom. Good sensitive and flexible screen to not ...",
      "text": "Nice zoom. Good sensitive and flexible screen to not miss a shot. Transfer from iphone to camera using canon connect worked.",
      "rating": 5.0,
      "verified": true,
      "author": "Bond Street llc",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Decent Little Pocket Camera",
      "text": "This is a decent little pocket camera. It would have been useful to have a shutter-release button and optical viewfinder, though.",
      "rating": 3.0,
      "verified": true,
      "author": "Ky",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Great Compact Camera for Travel",
      "text": "For such an inexpensive camera this camera did great during my trip to the Caribbean. The sound quality for recording video is very good and so is the picture quality. Mine also came with a turquoise colored holder and a strap for hanging around my neck. I am going to the Caribbean again October 2017 and will definitely use this camera again.",
      "rating": 4.0,
      "verified": true,
      "author": "Pinkorchid",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Small but powerful",
      "text": "Great small camera. Little hard to hang on to because it's so small, but after some practice its not too bad. Takes very good pictures and videos even in low light conditions. Had a problem with the wireless connecting to one of my computers but with the help of Canon tech support got it working. It has lots of cool features some of which I am still learning about. I like the camera and would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Pieter Ott",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "I feel that the video recordings are better than the Nikon (even being HD)",
      "text": "The shooter and all the operational system is different to all you know. it takes a while ti learn how to use it. I bought it as a second camera (I have a Nikon P 450). I feel that the video recordings are better than the Nikon (even being HD)",
      "rating": 4.0,
      "verified": true,
      "author": "pediatra",
      "helpful_votes": 0,
      "publication_date": 20151006
    },
    {
      "title": "Perfect travel camera!",
      "text": "This camera is absolutely adorable and of much better quality than I was expecting. The screen is very large for such a tiny camera and the resolution is amazing. I love the little blue snap on thing that encapsulates the bottom, which will definitely prevent scratches as well as the fact that it came with straps making it a cinch to travel with. Would highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Salina",
      "helpful_votes": 0,
      "publication_date": 20160224
    },
    {
      "title": "can click the screen like a shutter button",
      "text": "Likes: takes clear photos, can click the screen like a shutter button, connects to wifi to upload pics Dislikes: a little heavy, the included software takes way to long to upload so I use the Facebook upload (set so only I can see them) to upload my pics then save those pics to my computer, there is not always wifi available so you can't easily share photos, a little expensive",
      "rating": 3.0,
      "verified": true,
      "author": "crystal",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Merry Christmas to Me",
      "text": "I have just received the Power Shot N 12.1 what a little gem. It fits in your pocket, is not intrusive the creative pictures are wonderful. I like the idea of shooting in black and white, It is the best little camera, it will help me understand my other cameras, that are a little intimidating this is perfect I intend to have fun with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Transylvania Jones",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Great quick snap camera.",
      "text": "Love this camera. The ease of operation makes it easy for all members of the family to use. The quality of photos is very good, especially for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JEREMY EAGLEBEAR",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Not bad (but look for a good price)",
      "text": "Nice toy. You can get one for $110, I f you look. Lense is slow, but it produces good color reproduction. Attached is midday photo. Caveat: software sucks. Ok, on Android tablet, but WiFi configuration on PC is hair pulling. Canon, why?",
      "rating": 4.0,
      "verified": true,
      "author": "George S.",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Great little camera but pics are not at all what ...",
      "text": "Great little camera but pics are not at all what i expected! Im planning on selling mine and getting something better",
      "rating": 3.0,
      "verified": true,
      "author": "M.W.",
      "helpful_votes": 2,
      "publication_date": 20160125
    },
    {
      "title": "Good Camera",
      "text": "Lots to learn to be able to use all of the functions of this camera. Hopefully, I will eventually know how to do everything I need to know to take, review, edit, and download my pictures. Not there yet! Handy size for traveling.",
      "rating": 4.0,
      "verified": true,
      "author": "Judith M. Collins",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Great Little Camera",
      "text": "I love my camera it takes great pictures, videos and easy to share content to my phone. And fits on my pocket perfectly fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Beto",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "but would recommend it.",
      "text": "Fantastically small, but perhaps Too small? Took us a while to find the \"snap a picture\" button. Weirdly small, but would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary Kong",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Viewfinder does not turn completely",
      "text": "Bought this to vlog, picture quality is ok but not reccomend for video.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanie fail",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "picture quality is great. the flip up screen is nice and this ...",
      "text": "picture quality is great. the flip up screen is nice and this camera just looks cool in white (looks like an apple product). there is no wasted space or awkward design cues, its refined and minimalist. comes with very nice leather strap and blue base guard also.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim E",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "nice little camera for filming my vlogs",
      "text": "nice little camera for filming my vlogs. It came with a necklace strap and a wrist strap, so i was happy with that.",
      "rating": 5.0,
      "verified": true,
      "author": "gig doran",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Annoying",
      "text": "I received this for Christmas and I'm not sure I like it. The instructions are poorly written and somewhat confusing. I've always gotten a new camera, set it up and started using it. No problem. This one I'm still trying to figure out. It's not intuitive. Since I've really not used it for taking photos yet, I can't comment on that. I'm just tired of messing with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Think again before buying this model",
      "text": "A old very hard camera to operate. I would like to return this. This is a 2013 model. I was fooled. Cannot sink to Facebook.",
      "rating": 1.0,
      "verified": true,
      "author": "KASH",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Perfect",
      "text": "Ease of use. Touch screen focus/shutter. Auto focus takes you to macro. Built-in fish eye f/x. Nice, compact design although manual shutter and zoom are a bit tight at the base of lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul V. Sale",
      "helpful_votes": 0,
      "publication_date": 20140322
    },
    {
      "title": "Good camera",
      "text": "I like this camera. Takes pretty nice pics. Small, fits in purse or pocket. Also you can take pics at waist level",
      "rating": 5.0,
      "verified": true,
      "author": "SG",
      "helpful_votes": 0,
      "publication_date": 20160521
    },
    {
      "title": "Takes excellent pictures but the focus and shutter both being on ...",
      "text": "Takes excellent pictures but the focus and shutter both being on the rim of the lens is awkward and not made for big fingers. Good shots missed messing with focusing and shooting. Disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Takes excellent photos though",
      "text": "The camera does take some getting used to. I still keep reaching for the button on the top right hand side of the camera to snap a photo. Have taken a few photos of my fingers getting used to using the lens ring to snap photos. Takes excellent photos though, once I get my fat fingers out of the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin K Moore",
      "helpful_votes": 2,
      "publication_date": 20141124
    },
    {
      "title": "Nice!",
      "text": "I ordered this for my girlfriend as a gift and she really love it. I didn't think it would be that great due to the size of the camera but the photos are surprisingly sharp. Really good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jereme",
      "helpful_votes": 5,
      "publication_date": 20140217
    },
    {
      "title": "Three Stars",
      "text": "It is very hard to cordlessly sync this device. The instructions are poorly worded and have gross errors.",
      "rating": 3.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Five Stars",
      "text": "Absolutely am in love with this tiny gem!!!! Perfect pictures every time!!!",
      "rating": 5.0,
      "verified": true,
      "author": "jen_muse",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Five Stars",
      "text": "very nice! tiny yet usable. fits in the palm of my hand. zoom actually goes to 32 times!!! amazing",
      "rating": 5.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Five Stars",
      "text": "What an amazing little camera, so simple, so easy and such excellent pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Mitchell Lucas",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Five Stars",
      "text": "Love this camera. Fits in my pocket and perfectly in my hands I love vlogging with this camera!",
      "rating": 5.0,
      "verified": true,
      "author": "Blanca Duran",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "Four Stars",
      "text": "Works well but not as easy to use online as I would have liked.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 2,
      "publication_date": 20151017
    },
    {
      "title": "Adorable",
      "text": "The title says it all. For something so small, I though the material of the outer shell might be plastic, but even though it is it's actually quite strong and feels very good in the hand. Check out more images at my blog: [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140205
    },
    {
      "title": "Four Stars",
      "text": "Takes great video and photos but its hard to use the ring/shutter at first.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob T",
      "helpful_votes": 0,
      "publication_date": 20151115
    },
    {
      "title": "which is good to put it in your pocket",
      "text": "It's very compact, which is good to put it in your pocket, but a little hard to handle because it's so small and I'm always afraid of dropping it. I'm not very techy, so I wish I had gotten something more basic. It does a lot of things that I don't use because it's more complicated than what I need. The pictures are good, but the files are so big that when I want to save pictures and email them to someone, I can only send one at a time. I haven't figured out a way to make them smaller, like I said, I'm not very techy.",
      "rating": 3.0,
      "verified": true,
      "author": "Marcia Hughes",
      "helpful_votes": 2,
      "publication_date": 20160409
    },
    {
      "title": "Small",
      "text": "It works great, especially for being so small. The wifi feature works easily and is quite handy. Im Recommended this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140118
    },
    {
      "title": "Picture quality is decent, but when on video mode ...",
      "text": "Picture quality is decent, but when on video mode there is an audible clicking that ruins the video. Save your money, honey.",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki Bowdish",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "I love the little camera except for the position where you ...",
      "text": "I love the little camera except for the position where you have to push to take a picture. It takes great pictures and is easy to carry. It fits in a pocket, purse, you name it.",
      "rating": 4.0,
      "verified": true,
      "author": "ladydal",
      "helpful_votes": 0,
      "publication_date": 20160529
    },
    {
      "title": "Great picture and video quality",
      "text": "Having so much fun with it. Great picture and video quality. Love that it's so small that it can fit into my purse easily. Also a great deal right now. I would recommend it over canon N2.",
      "rating": 5.0,
      "verified": true,
      "author": "Wei Ning Chi",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Camera",
      "text": "I wanted a wifi camera and decided on this one and I am glad I did. I just love the size and how easy it is to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl",
      "helpful_votes": 0,
      "publication_date": 20140506
    },
    {
      "title": "Five Stars",
      "text": "Great camera for my 12 year old. He loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Cool little camera, takes good pics, easy and fast to deploy.",
      "text": "Cool little camera, takes good pics, easy and fast to deploy.",
      "rating": 5.0,
      "verified": true,
      "author": "Catapult",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Video resolution is not good with light within a room or office",
      "text": "I thought the camera was smaller. Video resolution is not good with light within a room or office. Compensated for when the flash is used as lighting. Very good that can be shared by wifi.",
      "rating": 4.0,
      "verified": true,
      "author": "Miguel Fadic",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "Perfect!",
      "text": "I purchased this camera because I like taking pictures with a real camera instead of my phone. The quality is just so much better. So this is perfect because it's small enough to carry around (it's smaller than my iPhone) and can easily upload the pics to my phone. It is a bit thick but not bad. So bottom line, I'm not a pro photographer, just someone that likes to take pics for sharing with friends and social media (Instagram and Facebook) and this is the perfect addition to carry around with me.",
      "rating": 5.0,
      "verified": true,
      "author": "Picture Perfect",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "Easy to use",
      "text": "Easy to use, affordable, great quality photos. I love that I can upload to the cloud on any device with wifi capability!",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney T Norris",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Canon Power Shot CMOS Digital camera",
      "text": "I was pleasantly surprised when I received this camera. It takes excellent pictures as well as great movie shots. It has a bunch of editing features. Too many to list. Very nice and clear screen. A comfortable size that is easy to pocket! All in all, a great little camera that does a lot for a little. I think you too would be pleased overall with this camera!",
      "rating": 4.0,
      "verified": true,
      "author": "Albert C. Marth",
      "helpful_votes": 0,
      "publication_date": 20140109
    },
    {
      "title": "Touch...take 1 or take 6",
      "text": "There are 2 amazing features on this camera. 1: the touch screen allows for easy breezy photo taking, and 2: the creative mode feature. With this one shot creates 6 very different & unique pictures.",
      "rating": 5.0,
      "verified": true,
      "author": "Delia Saunders",
      "helpful_votes": 2,
      "publication_date": 20131119
    },
    {
      "title": "Difficult to use.  Returned.",
      "text": "Camera uses unusual means of releasing the shutter. There is a ring outboard of the zoom ring, that must be pressed just right to release the shutter. My technicians had great difficulty getting the shutter to release on several occasions.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Novak",
      "helpful_votes": 3,
      "publication_date": 20150818
    },
    {
      "title": "I love this camera",
      "text": "I love this camera. Easy to use, carries in a pocket well. Exactly what you'd expect from Canon. It isn't the best picture quality, and the app interface is pretty rough... But the accessibility and features of the camera really save this from a lower rating. I'd recommend to anyone looking for a fun, good quality camera for casual use.",
      "rating": 5.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "very good purchase",
      "text": "The first word to describe my feeling to this cute thing is: Surprised. I've never seen any camera as tiny and cute as this one, which makes it so irresistible. Besides, the quality of picture is good enough to me (as a person who randomly uses camera).",
      "rating": 5.0,
      "verified": true,
      "author": "YING LI",
      "helpful_votes": 3,
      "publication_date": 20130810
    },
    {
      "title": "Wow",
      "text": "This cam is amazing small and perfect i take it with me everywhere very nice thank you so muuch love it",
      "rating": 5.0,
      "verified": true,
      "author": "Fafi",
      "helpful_votes": 0,
      "publication_date": 20140627
    },
    {
      "title": "Mother's Day Gift",
      "text": "I purchased this camera with my gift card. So far I love it. I own several compact digital camera's and think this one will probably be my favorite. The size is great. I love the focus lens an touch screen is awesome. The flip screen has so far been great too.",
      "rating": 5.0,
      "verified": true,
      "author": "lgb",
      "helpful_votes": 7,
      "publication_date": 20130625
    },
    {
      "title": "Good Camera",
      "text": "This camera is an amazing camera for its size! It does not work very well in low light situations, but other than that, it is fine. I use this camera for mostly family pictures and it is better quality than your average iphone camera. I also love its different form which makes it uniuqe from different cameras. Overall, a good camera",
      "rating": 5.0,
      "verified": true,
      "author": "rachel",
      "helpful_votes": 2,
      "publication_date": 20150808
    },
    {
      "title": "Five Stars",
      "text": "My daughter is very pleased with the gift I got her.",
      "rating": 5.0,
      "verified": true,
      "author": "F H",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "excellent camera, very difficult software to use.",
      "text": "great camera capabilities, excellent photos, easy and convenient controls and easy to use. Software is slow loading, difficult to see, (dark background), not arranged logically, and doesn't work for me. Still have not found a telephone number I can call for help. I dont want to return camera, but I am considering returning.",
      "rating": 4.0,
      "verified": true,
      "author": "bill-still",
      "helpful_votes": 3,
      "publication_date": 20131021
    },
    {
      "title": "Love the multiple shoot!!",
      "text": "Very happy I got it before my trip. Image's quality is very sharp, same when shooting videos. Loved the filters and compositions she can create when in Multiple Shoot function, my best pictures are probably those with no effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20131003
    },
    {
      "title": "You won't be sorry : )",
      "text": "Small and really amazing! Love this camera! I carry it everywhere, it is very small and captures images nicely. I love the creative shooting mode, which shoots 5 images using different filters. For the most part the other shots aren't useable, but sometimes you end up with something really great. Different than any other camera I've ever owned. The shutter release is totally unexpected, the touch screen works really well. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 2,
      "publication_date": 20131124
    },
    {
      "title": "takes great pictures and videos",
      "text": "Beauiful camera. takes great pictures and videos. Not that difficult to operate and understand, in fact it's rather cool. I have small hands though.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivonne M. Aviles",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "One Star",
      "text": "broke within a day- keeps asking to charge battery that has been fully charged already - returned",
      "rating": 1.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Great Camera!",
      "text": "My daughter absolutely loves this camera. She said it is everything that she expected and more. I strongly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen S. Morgan",
      "helpful_votes": 5,
      "publication_date": 20130918
    },
    {
      "title": "More does not equal better quality.",
      "text": "Arrived quickly. I chose this model because the N2 has the same sensor with more megapixels crammed on it. More does not equal better quality.",
      "rating": 5.0,
      "verified": true,
      "author": "ezpixels",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "coolest camera",
      "text": "Love this camera. Still discovering all the things it can do. Does cool insta-gram like shots and can connect to internet to download. Fun camera!",
      "rating": 5.0,
      "verified": true,
      "author": "SMK",
      "helpful_votes": 2,
      "publication_date": 20130816
    },
    {
      "title": "Nice Product",
      "text": "It was a gift for an older couple and the way you zoom & take shoots was a bit unusual, for me it would have been fine. Loved that it was compact... just not the best for someone not technically savy",
      "rating": 3.0,
      "verified": true,
      "author": "Ronald T Gallagher",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "canon powershot camera",
      "text": "The directions for making use of the camera are weak...and the ability to use its many features will go unused as a result. 6 - 8 step by step directions on the major features would make this a much more valued camera.",
      "rating": 4.0,
      "verified": true,
      "author": "mel bollom",
      "helpful_votes": 2,
      "publication_date": 20131128
    },
    {
      "title": "Not user friendly, strange and awkward way to take ...",
      "text": "Not user friendly, strange and awkward way to take photos. Pressing on the shutter ring to take a picture is not quickly done, what's wrong with a button?",
      "rating": 2.0,
      "verified": true,
      "author": "Lori Lacina",
      "helpful_votes": 2,
      "publication_date": 20150901
    },
    {
      "title": "Crazy but very fun.",
      "text": "One of the most unusual cameras I've ever owned, hangs around your neck, flips open yet it's a great little camera, pics are nice. Great conversation piece. Just fun to use.",
      "rating": 4.0,
      "verified": true,
      "author": "TLavine",
      "helpful_votes": 2,
      "publication_date": 20130721
    },
    {
      "title": "A nice little camera that takes quality pics with one major caveat.",
      "text": "It has an adjustable LCD but it really isn't that adjustable because you cannot flip it all the way to take a \"selfie\". So really, what's the point? Try another brand instead if that is what you're looking for.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher E. Fuller",
      "helpful_votes": 3,
      "publication_date": 20131103
    },
    {
      "title": "Very poor performance at low-light environment!!!",
      "text": "It takes some time to process each image shots and you can easily miss opportunistic moments you really want to capture. Zoomed in and low-light environment image quality isn't as good as phone camera. If you have a phone equipped with camera, there's no point getting this period. Apply your hard earned cash towards meaningful device.",
      "rating": 1.0,
      "verified": true,
      "author": "honest.review",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "however I have to say the design is very bad and user Unfriendly",
      "text": "Solid quality, however I have to say the design is very bad and user Unfriendly: there is no button to press for taking pictures, it's the thin outside ring you have to press. My husband just simply refuses to use it after several tries. You can set it up to press screen to take pictures, however, you can't adjust focus while doing it",
      "rating": 3.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Little disappointed. The ergonomics of this camera are too odd",
      "text": "Little disappointed. The ergonomics of this camera are too odd. I know they were going for unique, but so far it's been annoying rather than amazing. Secondly as a canon owner for sometime I thought the controls would be similar to other models. I get the feeling that this camera comes from a whole new company. The creative additions are fun, but not mind blowing. Still learning with it, but so far a bust.",
      "rating": 1.0,
      "verified": true,
      "author": "Jared Rawlings",
      "helpful_votes": 2,
      "publication_date": 20141223
    },
    {
      "title": "Three Stars",
      "text": "if the slow motion has higher resolution, it will be better",
      "rating": 3.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "love the size and quality.",
      "text": "love the camera, it is small to put in any purse of mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Ajjima Wettayanon",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Awesome tiny camera",
      "text": "Love everything about this camera. Just wish the battery would last longer but other than that im happy with the camera. My third canon camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed31",
      "helpful_votes": 3,
      "publication_date": 20130602
    },
    {
      "title": "I would buy something else...",
      "text": "Not as small as I thought it would be. The screen would be more useful if it could flip up so you can view the picture for timer self portraits or group shots on a tripod. The single shot capture is strange to press the entire ring as the photo button. Also, hard to handle without inadvertently pressing a function on the touch screen. Once you get past all that though it's a decent camera.",
      "rating": 1.0,
      "verified": true,
      "author": "JP808",
      "helpful_votes": 10,
      "publication_date": 20131126
    },
    {
      "title": "Where is the shutter button?!",
      "text": "Excellent pictures but the lack of a proper shutter button makes this camera more of a toy rather than what would otherwise be a great point and shoot camera.",
      "rating": 3.0,
      "verified": true,
      "author": "CraigE",
      "helpful_votes": 2,
      "publication_date": 20131106
    },
    {
      "title": "Screen movement is limited compared to other cameras",
      "text": "WARNING: This camera will not work for selfies. The screen only tilts 90 degrees. The product review on Amazon does clearly state the screen only rotates 90 degrees, but I bought this camera based on comparison reviews I read on other sites and on the manufacturer site where it is not so apparent. Canon really missed the boat here. Why would you engineer a movable screen and then limit it to 90 degrees so you can't see yourself when shooting?",
      "rating": 2.0,
      "verified": true,
      "author": "David Renfroe",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "It works well, but it is a little challenging ...",
      "text": "It works well, but it is a little challenging to remember that the front of the camera is the shutter release.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel/Bob",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "i like it",
      "text": "small enough to leave it in any girls purse. bluetooth is so convenient.",
      "rating": 5.0,
      "verified": true,
      "author": "qianying",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "It caused a stir! :)",
      "text": "Got my camera just before a fantastic weekend away in the tropics, so it got quite a workout. The photos are fabulous. A professional photographer friend was really impressed with it too. Compact but sturdy. Still learning to 'drive it', but think this will get a lot of use. Have a Canon SX50 as well, so have it all covered.",
      "rating": 5.0,
      "verified": true,
      "author": "Hellen White",
      "helpful_votes": 0,
      "publication_date": 20130721
    },
    {
      "title": "Three Stars",
      "text": "It is well made and a handy size but using it is a bear!",
      "rating": 3.0,
      "verified": true,
      "author": "Maurice A. Enderle",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Disappointed",
      "text": "Don't buy it if upgrading to Windows 10 (OS). The battery never worked correctly and I expected it to be easier to use.",
      "rating": 2.0,
      "verified": true,
      "author": "Griffin",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "Well I gave it away. I could not get ...",
      "text": "Well I gave it away. I could not get used to the shutter control on the front of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Donald D. Olson",
      "helpful_votes": 0,
      "publication_date": 20141123
    },
    {
      "title": "Not very impressive.. My camera automatically shuts down ...",
      "text": "Not very impressive .. My camera automatically shuts down at first us ..",
      "rating": 2.0,
      "verified": true,
      "author": "VJ",
      "helpful_votes": 0,
      "publication_date": 20151225
    },
    {
      "title": "Camera Had Problems",
      "text": "Camera did not work. Took forever to charge up (about 10 hours). Probably a nice little camera if it did work. Nothing wrong with seller, package was fine. Just the camera was defective. Will have to search for a different camera now.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Memory card sold separately",
      "text": "Beware, the memory card is not included in the box. I Wish it was made clear. Otherwise item is as described.",
      "rating": 3.0,
      "verified": true,
      "author": "JCWC",
      "helpful_votes": 0,
      "publication_date": 20131224
    },
    {
      "title": "Nice and small",
      "text": "The powerShot N is a tiny little camera, perfect to carry along in your pocket. It has a great zoom for its size and takes very good photographs. The flash isn't too powerful zo night pictures, even close up portraits came out a little dark. There maybe solutions to this but I have unfortunatley not had the time to check them out as I dropped it in the water. It doesn't float and it isn't waterproof (I knew this...) and it went straight to the bottom of the Caribbean sea. I bought a Powershot 270 SX270 instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Bastiaan De Rooij",
      "helpful_votes": 0,
      "publication_date": 20130607
    },
    {
      "title": "Two Stars",
      "text": "Still learning how to use it.The vidio part is easy",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia Markle",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Disappointing",
      "text": "I just didn't feel that Canon lived up to it's name. This is probably better suited to preteens. The only thing missing is a Hello Kitty Sticker...",
      "rating": 3.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 4,
      "publication_date": 20130918
    },
    {
      "title": "not user friendly ...",
      "text": "not very user friendly ....i actually ended up returning it and looking for a replacement cute camera tho ...",
      "rating": 2.0,
      "verified": true,
      "author": "False Advertisement from this seller, SpaceBound.  Look elsewhere",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "NO MEMORY CARD!!!",
      "text": "Super disappointed that memory card is not included or clearly stated it it is not included. Can't try it out until I run to the store to make another purchase. :(.",
      "rating": 3.0,
      "verified": true,
      "author": "lana sieler",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Five Stars",
      "text": "Love this camera - but you have to be very careful with it..",
      "rating": 5.0,
      "verified": true,
      "author": "lydia",
      "helpful_votes": 0,
      "publication_date": 20150325
    },
    {
      "title": "Disappointment from Canon",
      "text": "I'm a Canon DSLR fan (have a 5D and new very compact and promising Rebel SL1), photography enthusiast and computer systems/networking expert by trade. The PowerShot N is a disappointment for me. It doesn't take very good pictures. Many out of focus or blurred no matter what settings I use. I also find the WiFi capability a pain in the neck to use. I put the camera away in a drawer and will probably sell it on eBay.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Gerber",
      "helpful_votes": 4,
      "publication_date": 20130626
    }
  ],
  "product_meta": {
    "title": "Canon PowerShot N 12.1 MP CMOS Digital Camera with 8x Optical Zoom and 28mm Wide-Angle Lens (White)",
    "description": "Color:WhiteThe Canon PowerShot N 12.1MP Compact Digital Camera opens up a new dimension of photographic expression. Shutter and zoom rings enable quick intuitive operation and a 2.8-inch tilt-type capacitive touch screen offers photographic flexibility; shoot diagonally, horizontally, from low angles or high for versatile expression. Creative Shot mode automatically creates five unique images every time you take a shot. The 12.1MP High-Sensitivity CMOS sensor and DIGIC 5 Image Processor create the Canon HS SYSTEM for stunning image quality and low-light performance. An 8x Optical Zoom with 28mm Wide-Angle lens captures images with grandeur, from up close or far away. Record 1080p Full HD video and know that the enhanced built-in Wi-Fi of the PowerShot N makes sharing easier than ever. A Mobile Device Connect Button also brings powerful sharing capabilities with smartphone connectivity. Express your creative style with the PowerShot N and share with the world, all with a simple touch!\n\nFROM THE MANUFACTURER\n \n\n\n\nSHARE YOUR ARTISTIC EXPRESSION\nThe new PowerShot N opens up a new dimension of photographic expression, helping you express your personal style and flair with powerful innovative Canon technologies. The PowerShot N features an entirely new design, sporting a functional sleek shape. Shutter and zoom rings enable quick, intuitive operation, and a new 2.8-inch tilt-type capacitive touch screen offers amazing photographic flexibility; shoot diagonally, horizontally, from low angles or high for versatile expression. The camera features a new Creative Shot mode for artistic image capture, automatically creating an additional five unique images every time you take a shot. The 12.1 Megapixel High-Sensitivity CMOS sensor and DIGIC 5 Image Processor create the Canon HS SYSTEM for stunning image quality and low-light performance, ensuring every photo is a powerful statement. An 8x Optical Zoom with 28mm Wide-Angle lens captures brilliant images with grandeur, from up close or far away. Record 1080p Full HD video when you want to express yourself with moving images, and know that the enhanced built-in Wi-Fi® of the PowerShot N makes sharing easier than ever. A convenient Mobile Device Connect Button also brings powerful new sharing capabilities with smartphone connectivity. Express your creative style with the PowerShot N and share with the world, all with a simple touch!\n\nSHARE SIMPLY FROM WHEREVER YOU ARE\nBUILT-IN WI-FI® ALLOWS YOU TO WIRELESSLY TRANSFER YOUR IMAGES TO SOCIAL NETWORKING SITES THROUGH CANON IMAGE GATEWAY#; TO A PC OR UPLOAD VIRTUALLY ANYWHERE ON YOUR IOS® OR ANDROID™ DEVICE* WITH THE FREE DOWNLOAD OF THE CANON CAMERAWINDOW APP**\nThe PowerShot N is equipped with enhanced built-in Wi-Fi® for on-the-go convenience when you want to share what you've recorded with friends, family and the whole world. The camera can connect directly to both iOS® and Android™ devices*, and upload images via the free Canon CameraWindow app** without a computer. Easily post your images to your favorite social networking sites through CANON iMAGE GATEWAY# or save them to the online photo album to share anytime, anywhere. The camera's built-in Wi-Fi® also lets you transfer images and video directly to your computer to update friends and family while you're traveling or out and about. Enhanced Wi-Fi® makes posting in real-time possible, so you can keep everyone up to date with photos even as events unfold. Easily control the destination of your uploads to social networking sites; share with everyone, or send photos to selected groups. Post to groups, add comments, and edit and upload MOV video files from both iOS® and Android™ devices*. Frequently used devices and accounts are stored in the camera's Wi-Fi® history menu, so you can immediately connect with a simple touch. Share with other Wi-Fi® equipped PowerShot cameras, send images to your computer, and print your photos to Wi-Fi® compatible printers^. The PowerShot N also features a convenient Mobile Device Connect Button that connects to a smartphone with Canon CameraWindow launched, making transferring and sharing images simple. Built-in Wi-Fi® on the PowerShot N makes it easier than ever for you to express your creative flair, and share it with the entire world!\n\n# One-time registration is required on CANON iMAGE GATEWAY online photo album. \n\n* Compatible with iOS version 5.1/6.0 or later and Android devices version 2.3/4.0 or later. Data charges may apply.\n\n** This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software.\n\n^ Wireless PictBridge certified printer is required.\n\nSHARE WITH A SINGLE TOUCH\nTHE CONVENIENT MOBILE DEVICE CONNECT BUTTON ALLOWS YOU TO CONNECT TO YOUR ANDROID™ OR IOS® DEVICE* FOR QUICK AND EASY SHARING\nThe PowerShot N features a dedicated Mobile Device Connect Button that easily syncs the camera with your iOS® or Android™ device* with the Canon CameraWindow app**. After registering your device, two easy steps is all it takes to start sharing! Simply press the Mobile Device Connect Button, which launches the CameraWindow app on your smartphone, and the connection is complete. By connecting to a smartphone with the Mobile Device Connect Button, you can browse and share images while still leaving the camera inside a bag. It is also possible to turn off the camera quickly and easily, directly from a smartphone.\n\n* Compatible with iOS version 5.1/6.0 or later and Android devices version 2.3/4.0 or later. Data charges may apply.\n\n** This software enables you to upload images to social network services. Before uploading images, please be aware that image files may contain privacy related information such as people and places. If necessary, please delete such information. Canon does not obtain, collect or use such images or any information included in such images through this software.\n\n\nRETHINK PHOTOGRAPHY WITH CREATIVE SHOT\nNEW CREATIVE SHOT MODE USES COMPOSITION, COLOR AND LIGHTING FROM YOUR ORIGINAL IMAGE TO CREATE FIVE UNIQUE IMAGES WITH AN ARTISTIC FLAIR\nThe new Creative Shot mode featured on the PowerShot N can help anyone create images with artistic flair. Rather than randomly applying filters, Creative Shot mode takes advantage of Canon's advanced image and scene analysis technology to apply a range of artistic presets based on the individual scene, subject, and exposure. In addition to the original shot, the camera automatically produces and saves five unique variations of the composition by cropping it, rotating it, or adjusting its color, tone, and more. The result is stunning artistic photos that are perfect for sharing.\n\nEXERCISE COMPLETE CONTROL WITH NEW TECHNOLOGIES\nNEWLY DESIGNED 2.8-INCH CAPACITIVE, TILT, TOUCH PANEL LCD; LENS SHUTTER; AND ZOOM RING OFFER USERS A UNIQUE AND CREATIVE WAY TO CAPTURE PHOTOS\nLeverage the flexibility and creativity of the PowerShot N using a set of new innovative controls. The newly designed 2.8-inch capacitive LCD monitor is more than just a means of reviewing your photos. 90-degrees of tilt open up new perspectives when framing shots – shoot diagonally, horizontally, from low angles or high for the perfect emphasized shot. The top-mounted hinge keeps the PowerShot N compact, even when folded out, for easy, one-handed operation. Adjust settings and modes using the intuitive touch-screen menu—use gestures to zoom, rotate, and select images. Dual rings provide effortless control over the lens and shutter. The outer ring controls the shutter, which can be released from any point on the ring. Whichever angle or position you choose to hold the PowerShot N, the shutter release is always under your finger for quick and discreet release. The inner ring controls the zoom of the 28mm Wide-Angle 8x Optical Zoom lens with Optical Image Stabilizer, ensuring your images are sharp and clear. Responsive and silent zoom action provides a welcome feel of tactile control that makes operating the PowerShot N an incredible experience.\n\nA POWERFUL AND COMPACT NEW LENS\n8X OPTICAL ZOOM WITH 28MM WIDE-ANGLE LENS\nThe PowerShot N houses a Genuine Canon 8x Optical Zoom Lens in the center of its square-shaped body, allowing you to capture powerful shots with outstanding optical performance and versatility. The zoom starts at 28mm wide-angle and extends to 224mm telephoto (35mm equivalent), covering a wide and highly useful range. The telephoto reach gives you the freedom to capture subjects from afar, while the 28mm wide-angle makes it easy to shoot sweeping landscapes, large groups of people and tall buildings.\n\nOPTICAL IMAGE STABILIZER\nHandheld shooting can often lead to camera shake, making photos and videos blurry. Canon's Optical Image Stabilizer is a sophisticated system that uses lens-shift technology to correct for unwanted camera movement. It makes handheld photography more practical in more shooting situations, providing excellent image quality in many difficult situations: outdoors at dusk, inside without a flash, and even at the telephoto end of the zoom range without a tripod. For photos, it enables shooting at slower shutter speeds, accommodating more low-light shooting situations than ever before without having to boost ISO sensitivity. With camera shake and vibration reduced, you get a sharper, steadier image. And because it is an optical system, there is none of the image degradation typical with electronic image stabilizers.\n\nBEAUTIFUL IMAGES AND FAST PERFORMANCE START HERE\n12.1 MEGAPIXEL HIGH-SENSITIVITY CMOS SENSOR\nThe PowerShot N employs a Canon 12.1 Megapixel High-Sensitivity CMOS sensor, which delivers state-of-the-art imaging performance and is optimized for use in compact cameras. Utilizing a sophisticated light-capturing design, it provides high sensitivity for improved high ISO capture with reduced noise. It is also a high-speed design, capable of rapidly capturing and moving image data to the processor, enabling faster continuous shooting and faster autofocus.\n\nCANON DIGIC 5 IMAGE PROCESSOR\nThe latest-generation Canon DIGIC 5 Image Processor works with the PowerShot N's image sensor to bring phenomenal increases in processing speed and power, delivering incredible detail in more situations, without the need for artificial light sources. Improved noise reduction produces clearer images when shooting in low light at high ISO speeds. The faster processing speed results in faster continuous shooting capability while maintaining full image quality. With the power of the DIGIC 5 Image Processor, the PowerShot N can achieve higher ISO sensitivity and even perform advanced functions like lens correction, special scene modes and much more.\n\nCANON HS SYSTEM FOR EXCEPTIONAL LOW-LIGHT PERFORMANCE UP TO ISO 6400\nThe PowerShot N gives you the power to create images with spectacular depth, detail and emotional resonance. The 12.1 Megapixel High-Sensitivity CMOS sensor works in concert with Canon's latest-generation DIGIC 5 Image Processor to create the renowned Canon HS SYSTEM. With the Canon HS SYSTEM, you'll experience excellent tracking performance even in low light, and achieve gorgeous still image quality even at high ISO speeds all the way up to ISO 6400; beautiful low-light shots are possible with minimal noise and maximum detail in highlight and shadow areas. The Canon HS SYSTEM lets you use higher shutter speeds to capture clearer images with reduced noise and blur in a variety of situations for incredible photos and even when shooting video.\n\nGET THE COMPLETE HD EXPERIENCE\nCAPTURE STUNNING 1080P FULL HD VIDEO WITH A DEDICATED MOVIE BUTTON, PLUS ZOOM WHILE SHOOTING\nSimply touch the dedicated movie button on the PowerShot N to start recording video in 1080p Full HD that is breathtakingly vivid and realistic. You're free to use the full range of the zoom in movie mode to get the video you want. You can also view and share your video on an HDTV to enjoy.\n\nOPTIMAL IMAGE STABILIZATION IN ANY SITUATION\nINTELLIGENT IS AUTOMATICALLY CHOOSES FROM SIX DIFFERENT MODES TO OPTIMIZE IMAGE STABILIZATION FOR THE SHOOTING CONDITION\nIt's easy to capture clear, steady images with the PowerShot N, even in low light without using a tripod. That's because the camera is equipped with Canon's innovative Intelligent IS. The system analyzes camera movement and applies the best shake correction method for the shooting situation – allowing you to focus on framing and capturing your shot. For stills, the system automatically selects among Normal, Panning, Macro (Hybrid) and Tripod IS modes. When shooting video, the system automatically selects among Dynamic, Powered, Macro and Tripod IS modes.\n\nNormal Corrects for a wide range of camera movement when shooting stills. Panning Panning motion is detected so that IS does not interfere with desired camera movement. Macro (Hybrid) Corrects for shift-type camera shake, which typically occurs in macro (close-up) shooting. Dynamic Effective for video shooting at wide-angle focal lengths, eliminating the unwanted shaking that typically occurs while walking. Powered Compensates for hand movement when shooting video at the telephoto end of the zoom range, where camera shake is magnified. Tripod When tripod use is detected, the Image Stabilizer is stopped because it is not needed. ADDITIONAL FEATURES\nECO MODE\nThe PowerShot N takes energy conservation to the next level with ECO Mode, which provides more shots per single charge through monitor and camera power management. ECO Mode can be activated for easy power preservation when an outlet is unavailable or the moment is too exciting to put the camera down. ECO Mode quickly wakes the camera from sleep when a button is pressed or with a touch of the LCD screen. With ECO Mode activated to conserve power, you can even stay connected for longer with the built-in Wi-Fi® feature on the PowerShot N. With ECO Mode, you can be sure that your camera will keep up when fun with family and friends runs late into the night!\n\nSHOOTING MODES\nPowerShot cameras offer shooting modes that make it easy to take perfect photos in a wide range of shooting situations by providing intelligent presets with optimized settings.\n\n\nSHOOTING MODES/SPECIAL SCENE MODES\nSmart AUTO The camera automatically selects the best shooting settings for optimal quality based on subjects and environmental factors to provide point-and-shoot simplicity. Hybrid Auto Automatically selects shooting settings for optimal quality and records a video clip before capturing a still image. One day's worth of clips are then combined into a video. Program The camera automatically and intelligently selects the aperture/shutter speed combination based on the shooting conditions. Creative Shot Analyzes the scene and applies a number of creative filters to automatically create five variations in addition to the original image. Fisheye Effect Now you can get the fisheye effect – a classic photographic distortion – without a fisheye lens. Miniature Effect Give images a miniature look with an effect that emphasizes perspective by blurring the top and bottom of the image. Toy Camera Effect Simulates photos taken with \"toy\" or pinhole cameras, darkening the image at the edges to create a vignette effect. Soft Focus Creates a hazy ambiance that's perfect for portraits and wedding photos. Monochrome Choose from three single-tone effects: Black-and-White, Sepia, or Blue. Movie Record video; unwanted scenes can be deleted in playback mode. Super Slow Motion Movie Record your clips in high speed (approx. 240 fps), and then watch your videos in slow motion. Actual results may vary from examples shown above.\nFinal image may vary depending on picture composition.\n\nEASILY CHARGE BY USB\nIn addition to standard outlet charging, the PowerShot N can be easily charged using a USB cable anytime. It is possible to charge the camera by connecting it to devices with USB ports such as a notebook PC, for convenient charging when you are out or traveling, or even when saving photos to your computer.",
    "rating": 3.7,
    "feature_bullets": [
      "Built in Wi-Fi for wireless transfer of images to social networking sites",
      "Mobile Device Connect Button allows for a sharing connection to Android or iOS devices",
      "New Creative Shot mode uses composition, color and lighting from original image to create five unique images with artistic flair",
      "Newly designed 2.8-inch capacitive, tilt, touch panel LCD; lens shutter; and zoom ring",
      "12.1 MP CMOS sensor, DIGIC 5 Processor, 8x Optical Image Stabilized zoom, 28mm Wide-Angle lens"
    ],
    "specifications": {
      "Product Dimensions": "3.11 x 1.14 x 2.36 inches",
      "Item Weight": "6.9 ounces",
      "ASIN": "B00AWYN1O6",
      "Item model number": "8231B001",
      "Batteries": "Lithium Metal batteries required.",
      "Customer Reviews": "3.7 out of 5 stars200 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#108,262 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 7, 2013",
      "Manufacturer": "Canon",
      "Language:": "English"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": 168.0
  }
}