{
  "website_summaries": [
    {
      "verdict": "Superbly designed charger base for the often unwieldy Wii U Pro controllers. You’ll save space and charging hassle.",
      "pros": [
        "Lightweight yet sturdy charging base that provides rapid charging for 2 Wii U Pro controllers",
        "Bright charging indicator over each charging slot",
        "As a separate charging station, prevents GamePad from discharging power, which occurs when charging Pro via the Wii U console"
      ],
      "cons": [
        "Has a manual, not automatic, on-off switch",
        "Must place magnetic dongles (included) onto Pro controllers  in order to work"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not working after 3 months",
      "text": "After a few months, this is trash. It no longer will charge the paddles. It charges for a moment the shows each of the paddles as \"charged.\" I tried to reach out to the seller and Nyko. With no progress. I would not recommend this product. ~~~ Original review~~~ Kids love the simplicity of charging these controllers! Good and easy execution. The lights are simple to understand and it's easy to use.",
      "rating": 1.0,
      "verified": true,
      "author": "mesco",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Close to perfect.",
      "text": "It's almost perfect. The controllers hang onto the base with a magnet that's perfect in strength. Once attached the controllers aren't going anywhere, but still it's easy to pull one off with one hand. I haven't figured out what the light indicators mean. I have some good guesses but they appear to work inconsistently. I'm sure reading the manual would clear it up but I hate reading manuals. I always can figure out what things mean just by using them over time. But in this case I'm still somewhat puzzled. Bear in mind I've not gone out of my way to figure it out. I'm just saying I hate when it's not obvious.",
      "rating": 4.0,
      "verified": true,
      "author": "Benjamin C. Drake",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": ") They snap on to the controllers semi-permanently and follow the curve of the handset nicely, and the magnetic fixture has a so",
      "text": "One word of warning: The magnetic mounting clips on this stand fit *only* the official Nintendo Pro Controllers — ironically, they will NOT fit the Nyko models! (The Nyko handsets have a slightly different curvature, and the charger-cable-socket is upside-down versus the Nintendo model.) They snap on to the controllers semi-permanently and follow the curve of the handset nicely, and the magnetic fixture has a solid feel when charging. (Unlike the Nyko Wii Remote hangers, where the remotes can be knocked off pretty easily). The charger-adapter-dongle stays out of your way when playing.",
      "rating": 5.0,
      "verified": true,
      "author": "BRP",
      "helpful_votes": 0,
      "publication_date": 20141219
    },
    {
      "title": "Excellent charging station",
      "text": "It's an excellent charger for official Nintendo-made Pro controllers. Insert the magnetic dongle into the controller's USB port, plug the charger into an electrical outlet, and you're ready to go. The controller grabs onto the base, and can be removed with two hands, or a one-handed slight twisting motion. You leave the dongle on the controller while you're playing. My kids have no issues using the unit. You can also store your controllers attached to the base without turning the base on.",
      "rating": 5.0,
      "verified": true,
      "author": "Snufalufagus",
      "helpful_votes": 0,
      "publication_date": 20150201
    },
    {
      "title": "Absolutely awesome!!!",
      "text": "Absolutely awesome!!! Plug in magnetic adapter and place in stand, orange light shows its connected and charging while green light shows its charged and ready to go... love it",
      "rating": 5.0,
      "verified": true,
      "author": "Concerned consumer",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Beautiful, but make sure the power is always on!",
      "text": "I love the design choices; you can leave the magnets clipped to the controller for an incredibly convenient method to dock your controllers and it is aesthetically appealing. Unfortunately, this product has an off and on switch that does not power-on during any power outage. As a result, your Wii U Pro Controllers attached to the charging station will have dead batteries (the charge base appears to slowly drain the batteries when connected without the power on) if you didn't turn the power back on manually.",
      "rating": 3.0,
      "verified": true,
      "author": "Shayne",
      "helpful_votes": 0,
      "publication_date": 20150305
    },
    {
      "title": "Great for the official Wii U pro controllers",
      "text": "Great for the official Wii U pro controllers. I have 2 and love them. The Green led light at the bottom is a bit bright but you can cover it with tape or something.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew T. Cook",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Works Great",
      "text": "This charging base works very well charging your Wii controllers. I am very pleased with the performance the magnets are very strong. I do however have an issue with my wife calling the controllers remotes. If you are a gamer you know remotes are for the TV and controllers are for gaming systems. If you consider yourself a gamer and refer to controllers as a remotes you are not a gamer.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "WOW! These are amazing!",
      "text": "I may be late to this party since I just bought a second hand Wii U... but this charging base is amazing! It works better than advertised and I love not having to worry about a cable! Even my 5-year-old finds this easy to grab the controllers when needed and to place it back to charge. The magnet is plenty strong!",
      "rating": 5.0,
      "verified": true,
      "author": "werds",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Great to help keep charged",
      "text": "This is perfect for the price. I love that its magnetic and easy for my 7 year old son to make sure its hooked up. The only thing that stinks is the charging magnets dont work for modified controllers, like our generic l.e.d. controllers, but thats ok.",
      "rating": 5.0,
      "verified": true,
      "author": "MountainMama",
      "helpful_votes": 0,
      "publication_date": 20170227
    },
    {
      "title": "Looks nice, works great",
      "text": "Magnetic dock function makes it easy for my kids to put the controllers on the charger. Helps the game area not look cluttered.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelic M Hudelson",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "Works fine.",
      "text": "The adapter that snaps onto the controller adds almost no weight to the controller. Should also prevent wearing out or damaging the mini-USB port on the controller itself, which I'm pretty sure my 5-year-old was trying to do. Charges great, and gives the kids a specific spot to keep the controllers.",
      "rating": 5.0,
      "verified": true,
      "author": "Slash-2CPU",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "Does what it's supposed to do",
      "text": "I really like this Charge Base Pro from Nyko. It's much more simple to be able to plug in the Wii U pro controllers into a stand rather than charging the controllers while being plugged into the Wii U. I'm not sure how long it takes for a full charge, but the battery life on the pro controller is like 8-10 hours anyway. An overnight, while you sleep, charge should suffice. The Base also looks pretty cool.",
      "rating": 5.0,
      "verified": true,
      "author": "tubuochen",
      "helpful_votes": 0,
      "publication_date": 20130712
    },
    {
      "title": "Yup!",
      "text": "Does what it says...charges with no issue, magnet holds good, unique style. No problems here!",
      "rating": 5.0,
      "verified": true,
      "author": "hyperion24",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "I haven't had it terribly long but so far its nice",
      "text": "I haven't had it terribly long but so far its nice, does exactly what its supposed to do. I like the magnetic clip you place on the controllers. It allows them to be smoothly popped off the stand for use. No doubt this reduced wear on the controller's charge socket from continually popping the controller in and out.",
      "rating": 4.0,
      "verified": true,
      "author": "WideAndNerdy",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "Works well",
      "text": "Works really well, charges our Wii U pro controllers, and sits on the table and is handy.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Kurz",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "it is a cool product and i like that it is connected with ...",
      "text": "it is a cool product and i like that it is connected with magnets. but i regret buying it because the plugin cord didn't mach the outlet. i did however find out that i could replace it with the cord to my computer's speakers. but i didn't want to lose my sound just to recharge my controllers batteries. it is by no accords a bad produckt and could be very useful, as long as you live in USA where the outlets match, or ether you or one of your friends and family is good with electricity and know how to swarp the plug to match the outlet.",
      "rating": 3.0,
      "verified": true,
      "author": "Dragonmand55",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Study, secure, works well",
      "text": "It holds two controllers well and keeps them charged. It has an on switch on top, which I find odd, and a bright green light on the bottom. There is a clear indicator for when it is charging. It's pretty sturdy. If, say your cat throws it from a windowsill to a hardwood floor it will not be damaged. My cat really needed to test that.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivy Reisner",
      "helpful_votes": 0,
      "publication_date": 20150208
    },
    {
      "title": "I like it!",
      "text": "I bought this because i had lost the charging wire for the pro controller and i was worried this wouldnt be as good as it sounded but I'm so happy to find that its just as great. Works like a charm and its small so i can have it out of the way while its charging or just waiting to be used. I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Tokyo",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Works great!",
      "text": "Love this stand, it charges the controllers fast and I enjoy the fact that it changes colors to let you know when it is charged fully. The magnetic backing makes it easy to put on and off.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosie Peete",
      "helpful_votes": 0,
      "publication_date": 20160424
    },
    {
      "title": "Great charger",
      "text": "Perfect! We have 2 chargers and these charge and keep them out of the way. I’m glad I bought this",
      "rating": 5.0,
      "verified": true,
      "author": "Pohai K",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "This charging base is really great and looks even better when controllers are on it",
      "text": "This charging base is really great and looks even better when controllers are on it. Bought The Nintendo Wii U Pro By Commendable, The charging adapters attached to controllers with not problems at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro",
      "helpful_votes": 2,
      "publication_date": 20151214
    },
    {
      "title": "Wonderful",
      "text": "Item works great! love how you can keep the charge nodes on and they won't interfere with how you play. The magnetic aspect of it pretty cool too.",
      "rating": 4.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Best charging craddle",
      "text": "Best charging base ever! Keeps controllers charged and magnets are strong enough. The attachments to the controllers aren't that big, so it's still super comfy to hold.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Castrejon",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "amazing charger!",
      "text": "amazing charger!!!!!!!!!!!! i've had mine for a few moths now. it's very well built and the magnets are very strong. if you have wii u pro controllers you NEED this! especially since it was so cheap. EDIT: please make the same exact thing for PS4 and xbone!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Solomon",
      "helpful_votes": 0,
      "publication_date": 20150517
    },
    {
      "title": "Five Stars",
      "text": "This station is working great. Keeps the controllers together and charged without having extra cables.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenix623",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Five Stars",
      "text": "Great charge base. Could not find one any where else. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "lynn",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Missing Piece",
      "text": "Love the product, supposed to have two magnetic charging attachments, only came with one so can only charge one at a time.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Denis",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Works fantastically well, is beautiful to look at...",
      "text": "Works fantastically well, is beautiful to look at, holds 2 original Wii U two Pro Controllers perfectly, seems by magic, and even let's me turn it off manually, easily when they are fully charged. Worth far more than $15! I would easily have paid $30 for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Prior",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "Very Stylish",
      "text": "This is a very stylish base for my Wii U controllers...the magnetic charging ports add a nice touch to it alongside the LED lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Dominik",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Easy to set up",
      "text": "Easy to set up. Colored lights indicate if the base is on and whether each charger is fully charged. Good value. Stand folds up so this base can be transported without breaking and makes the base quite reasonably sized.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny C.",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Works for Nintendo brand pro controller",
      "text": "Nintendo Wii U Pro Controller fits nice and snug into the adapter (the two little small pieces seen next to the charger). The adapter (and controller) is magnetically held onto the charge base. Takes about 2 hours to fully charge a depleted controller. ****The adapter DOES NOT fit on Nyko's Pro Commander controller. Thus, you cannot charge Nyko's Pro Commander with this charger. Not sure if any other controller brands will work****",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "Base Pro for Wii U just great",
      "text": "This item was received in great order, worked right from the word go, was well packed. Kids love the ease of use and has worked now for several months. Recommend this product. Shipment was in time and the item was well packed",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "Great As A Supplement Or A Replacement",
      "text": "Couldn't find the charge cords that came with my pro controllers, so I decided to get this guy. Works flawlessly, and my controllers were charged quickly. Would definitely recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "i love that i can leave the magnetic charger on the ...",
      "text": "works as advertised! i love that i can leave the magnetic charger on the controller and just pop it into the tower when i'm done playing. great addition to my nintendo collection. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Bush",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "and also they fall off the charger easily.",
      "text": "A couple of flaws with this item, the controllers seem to be a bit buggie, a couple buttons don't seem to work well, ie have to push them excessively hard to get them to work, and also they fall off the charger easily.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin F.",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Five Stars",
      "text": "Easy to use, convenient and compact charger. Works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "Love it",
      "text": "Great product. It looks great, works perfectly and keeps the cord clutter demons away. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Stewart",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Works great",
      "text": "Love this takes little space and keeps the controllers charged.",
      "rating": 5.0,
      "verified": true,
      "author": "kytropic",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Looking for a super easy to use Wii U pro controller charger? You found it.",
      "text": "Absolutely superb design. If you are looking for a standalone charging base for your Wii U pro controller, this is it. Impossibly easy to set up and use. I highly highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "John Libree",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "this is the best item to get",
      "text": "If you want to keep your game controllers in one place and have it charged, this is the best item to get. I highly recommend it. A place for everything!",
      "rating": 4.0,
      "verified": true,
      "author": "Tripple J",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "This charger is excellent! The only reason I'm giving it 4 stars ...",
      "text": "This charger is excellent! The only reason I'm giving it 4 stars is the adapter that goes on top of the controller is a little obnoxious. Other than that it's great!",
      "rating": 4.0,
      "verified": true,
      "author": "Thai Di",
      "helpful_votes": 0,
      "publication_date": 20150128
    },
    {
      "title": "Five Stars",
      "text": "Works very nicely charging 2 different items with one charger, and the only one for the wireless wii remotes.",
      "rating": 5.0,
      "verified": true,
      "author": "E P",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "it makes it so easy to just pop the controller in and out",
      "text": "The magnetic connectors are a blast, it makes it so easy to just pop the controller in and out! I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "GN",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "Best charge base for Wii U Pro controllers I've found",
      "text": "Simple to setup and easy to use. The pro controller clips install easily, and the magnets make plugging into the stand hassle-free. The amber lights turn green when the controllers are charged, and there's a power button on top of the stand to turn it off when done.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Nielsen",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Awesome for the wii u pro",
      "text": "Awesome for the wii u pro, but unfortunately, does not work with the pro mini. Charging port is inverted on the mini.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay P.",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Solid product",
      "text": "I love this product. It works well with the off-brand Pro Controllers. It keeps the game area free of extra cords, and the contact charge adapter doesn't interfere with game play.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Troyer",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Awesome charger",
      "text": "I was kinda annoyed that I had to buy a charger for my controllers, but after receiving it... im so happy i chose this instead of the individual charge cords! Works great and will stop charging when done... not a continuous charge, great charger!",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Payne",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Easy",
      "text": "Easy to use and easy to setup. Works great. Was not sure about the magnetic hold but have not had a single issues.",
      "rating": 5.0,
      "verified": true,
      "author": "NCGaston",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Love this thing!",
      "text": "Works like I expected (even better) and looks stylish to boot!",
      "rating": 5.0,
      "verified": true,
      "author": "Arvo Bowen III",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Innovative and stylish. Great accessory for the Wii U",
      "text": "Grabbed this due to word of mouth from some friends. As a new Wii U owner this is a very impressive accessory that looks great and does its job very well. The magnetic setup with the adapter that hooks on the control is really cool and is just a top tier accessory.",
      "rating": 5.0,
      "verified": true,
      "author": "^_^",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Recommended for heavy gamers",
      "text": "Looks cool and convenient to use. If you're a serious gamer, having extra controllers charge on stand-by will let you keep going. Well worth the money in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Phan",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Three Stars",
      "text": "Must be turned back on manually every time the power goes out.",
      "rating": 3.0,
      "verified": true,
      "author": "DANIEL W",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Great",
      "text": "These work perfect with our wiiu. Only problem is that the kids took off one of the charging parts from the controller and have lost it.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Five Stars",
      "text": "Less loose wires hanging around and makes charging the controllers nearly effortless.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Lim",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Nice charging option.",
      "text": "So far so good. Like the style, the ability to charge both controllers at once. Gives a nice clean look to an otherwise rats nest of wires.",
      "rating": 4.0,
      "verified": true,
      "author": "Stuart ",
      "helpful_votes": 0,
      "publication_date": 20160106
    },
    {
      "title": "I buy this charger if available for all of my consoles",
      "text": "My quick pros and cons for this charger for both the PS3 and Wii U versions Pros: 1. Ends the cord clutter. Controllers have a place to live. 2. The magnets do hold. The controller can be knocked off, but they do stay in place. 3. Charges completely, quickly. Cons: 1. The lights. They're really bright. I won't have a lot of cords strung out to keep all of my controllers ready, and Nyko makes the best chargers available. I've tried several other brands and not been happy like I am with these. I pick up the charger when I get the console if it's available, or I wait impatiently for it to be released if it isn't available.",
      "rating": 5.0,
      "verified": true,
      "author": "arrowrand",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "works great, I have one for my 360 controllers and ...",
      "text": "works great, I have one for my 360 controllers and bought this for one controller. Haven't been disappointed so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Harris",
      "helpful_votes": 0,
      "publication_date": 20141229
    },
    {
      "title": "The Perfect Accessory",
      "text": "Very cool setup and works wonderfully. I especially like that you have to turn it on to charge so as not to destroy the battery. A must buy for a household with more than one Pro controller.",
      "rating": 5.0,
      "verified": true,
      "author": "Corina",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "Five Stars",
      "text": "This is a great addition to the set. Having this charger is convenient and nice to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Schreier",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Good quality",
      "text": "Happy with purchase. Looks very nice next to my Nintendo wii u. No complaints",
      "rating": 5.0,
      "verified": true,
      "author": "R. Griffin",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "nice sturdy, intelligently built",
      "text": "This is one nice charging station, intelligently built, love the magnetic attachments, the indicator lights, the simple power button at top. Nothing negative to say for me! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Legris",
      "helpful_votes": 0,
      "publication_date": 20140309
    },
    {
      "title": "This thing works great. Glad I found it",
      "text": "Needed something to charge my wii pro controllers as well as store them when not in use. This thing works great. Glad I found it. Looks nice. Charges them quickly too. Great buy!!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Five Stars",
      "text": "great product. super easy to use and charge game controllers.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Natt",
      "helpful_votes": 0,
      "publication_date": 20160217
    },
    {
      "title": "Every charger should come with a base like this one",
      "text": "Every charger should come with a base like this one. Amazing. Super happy. With our other remotes we go through batteries like crazy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Buy it.",
      "text": "I love the magnetic grip. I think all chargers should be handled the way this one handles it.",
      "rating": 5.0,
      "verified": true,
      "author": "Turbojacket",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "The controllers lock in through magnets so they are easy to put in and take out",
      "text": "Quite an innovative design. The controllers lock in through magnets so they are easy to put in and take out.",
      "rating": 5.0,
      "verified": true,
      "author": "J. E. King III",
      "helpful_votes": 0,
      "publication_date": 20150301
    },
    {
      "title": "Nyko Wii U Charge Base Pro",
      "text": "I like the solid contact that this magnetic Charge Base provides as it holds the controller in place. Good quality, fast charging.",
      "rating": 5.0,
      "verified": true,
      "author": "D. L.",
      "helpful_votes": 0,
      "publication_date": 20140112
    },
    {
      "title": "Five Stars",
      "text": "Works great easy for my kids to charge their controllers by themselves.",
      "rating": 5.0,
      "verified": true,
      "author": "Jcaqueline Haines",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Genius design",
      "text": "I love this thing. It's not like plugging in a USB cable was difficult, but the magnetic adapter is genius. Wish they made this style for other controllers. -D",
      "rating": 5.0,
      "verified": true,
      "author": "TechDad",
      "helpful_votes": 0,
      "publication_date": 20160409
    },
    {
      "title": "Five Stars",
      "text": "Works perfect. They only make a few charging docks for wii u pro controllers and this one is awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Abe Castro",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Five Stars",
      "text": "Works great charges fast and lighting indicators let you know charge level",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "Great gadget!",
      "text": "Great product, cheaper than in the Netherlands and works ike a charm. Very happy with the product",
      "rating": 5.0,
      "verified": true,
      "author": "Wim Knevel",
      "helpful_votes": 0,
      "publication_date": 20151209
    },
    {
      "title": "Best",
      "text": "if you have a wii and use the wii u pro controller you need this , it keeps the controllers charged and ready to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Anibal",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Charge and Store!",
      "text": "This is a pretty simple product and a bit overpriced, but it is neat and it works very well! The controllers poke up out of it at a weird angle, making it hard to tell what it is unless you are right up on it.",
      "rating": 5.0,
      "verified": true,
      "author": "KevD",
      "helpful_votes": 0,
      "publication_date": 20130518
    },
    {
      "title": "Works great",
      "text": "I hate having to keep buying batteries. This definitely does the job. They seem to charge quickly and I have had no complaints of uncharged controllers. They are always ready when the need to be.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom in MD",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "Perfect for keeping the remotes charged",
      "text": "Perfect for keeping the remotes charged. My kids remember to put them back, but they never remembered to plug the cords in before. Problem solved.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Starzer",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "Five Stars",
      "text": "Christmas gift for my husband and he just loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20150124
    },
    {
      "title": "This does not work with the Nyko brand Wii U ...",
      "text": "This does not work with the Nyko brand Wii U Pro controllers. The usb is just a centimeter off and it won't fit.",
      "rating": 1.0,
      "verified": true,
      "author": "David Boothe",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Five Stars",
      "text": "HIGHLY RECOMMEND....SO EASY JUST TO SNAP ON & CHARGE...HIGHLY RECOMMEND...",
      "rating": 5.0,
      "verified": true,
      "author": "paul d soape",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Weak magnetic connectors...",
      "text": "In comparison with NYKO's PS4 and Xbox One charging stations, this solution looks cool, but doesn't hold up. A very large plastic clip must be attached to your controller, thus making it bulkier. The clips barely hold onto the base. While grabbing one controller, the other often falls off. Furthermore, it seems as though one of the controllers doesn't charge while both are plugged in.",
      "rating": 1.0,
      "verified": true,
      "author": "Ignite Gaming",
      "helpful_votes": 2,
      "publication_date": 20140910
    },
    {
      "title": "don't get for pro commander controller for the wii u",
      "text": "grate price looks good but it doesn't work with the wii u nyko controller wtf was going on in there head when they made this idk",
      "rating": 3.0,
      "verified": true,
      "author": "L. Reyes",
      "helpful_votes": 5,
      "publication_date": 20131201
    },
    {
      "title": "Does Not Charge",
      "text": "The charging units connects are backwards... So its impossible to hook the controllers to it ... Even when the controller is upside down it will not connect and charge .... Totally disappointed ...",
      "rating": 1.0,
      "verified": true,
      "author": "DeWayne Turner",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Poor design and worse descriptor for controllers charged by this product",
      "text": "Bought this for our son's Wii U Pro Commander controllers by Nyko. The USB adapter to connect the controller to the charger DOES NOT FIT, the port is completely misaligned. The item description DOES NOT specify that the Nintendo branded Pro Controllers are the target items here, not the Nyko Pro Commander products. I've attached photos of the package, model of controllers we have, a shot of the connections, and a shot of the misaligned plug and socket.",
      "rating": 1.0,
      "verified": true,
      "author": "MargieM",
      "helpful_votes": 18,
      "publication_date": 20150115
    },
    {
      "title": "Charging connects were backwards for my",
      "text": "I have the nyko pro wii u controllers and the connections would not work don't know if it was a factory defect but dent them back.",
      "rating": 1.0,
      "verified": true,
      "author": "JK",
      "helpful_votes": 0,
      "publication_date": 20140301
    },
    {
      "title": "Product is not compatible with the Nyko pro commander controllers ...",
      "text": "Product is not compatible with the Nyko pro commander controllers which I understand is not stated on the packaging and is not advertised to be compatible but with very minor adjustments they would be compatible and after sending an email asking that they should consider making an adapter for their controllers they just shrugged it off.",
      "rating": 1.0,
      "verified": true,
      "author": "Maikol",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "... ordered 2 \"Pro Commander for Wii U\" which are great, thought i should grab the NYKO charge base ...",
      "text": "I ordered 2 \"Pro Commander for Wii U\" which are great, thought i should grab the NYKO charge base pro... they're not compatible... i would be more mad but i already exploded when i realized so now im a dark star flying at light speed towards whoever invented this unbelievably retarded charger 0/10000000000000.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Carter",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "WARNING This charger does not work with NYKO Pro commander",
      "text": "Will try to return for credit. Nyko did not respond for proper dongles for PRO COMMANDER. Do not know why there isn't BIG PLAIN LETTERS to let people know about this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Lambert",
      "helpful_votes": 2,
      "publication_date": 20131230
    },
    {
      "title": "doesnt work for neonglow controllers.",
      "text": "Does not work with wireless neonglow controllers I bought for my boys for christmas. The Body was to thick.wish it fit.",
      "rating": 1.0,
      "verified": true,
      "author": "idalberto",
      "helpful_votes": 0,
      "publication_date": 20140318
    }
  ],
  "product_meta": {
    "title": "Charge Base Pro for Wii U",
    "description": "Conveniently and quickly store and charge two Wii U Pro Controllers in a whole new way with Nyko's Charge Base Pro. Utilizing Nyko's patented magnetic USB Charge Adaptors, the Charge Base Pro allows for incredibly easy charging of 2 Pro Controllers. Simply attach the small, lightweight adaptor to the Mini USB port on the controller, and then place the controller into the magnetic charging port. The vertical and collapsible charging dock will suspend and hold the controller while charging it; No additional wires necessary. The Charge Base Pro utilizes AC power from any wall outlet for a rapid recharge faster than USB.",
    "rating": 4.6,
    "feature_bullets": [
      "Rapidly charges two Pro Controllers simultaneously",
      "Store and charge your controllers in one place",
      "Includes two magnetic USB Charge Adaptors for quick and convenient use",
      "Plug into any wall outlet or place conveniently in an entertainment center",
      "Powered by a standard wall plug; no USB port required"
    ],
    "specifications": {
      "ASIN": "B00ANHBI4W",
      "Customer Reviews": "4.6 out of 5 stars145 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#38,057 in Video Games",
      "Pricing": "The strikethrough price is the List Price. Savings represents a discount off the List Price.",
      "Product Dimensions": "7.9 x 5.7 x 2.9 inches; 8.16 Ounces",
      "Binding": "Video Game",
      "Language:": "English",
      "Item model number": "87158",
      "Is Discontinued By Manufacturer": "No",
      "Item Weight": "8.2 ounces",
      "Manufacturer": "Nyko",
      "Date First Available": "December 13, 2012"
    },
    "categories": [
      "Accessories",
      "Chargers",
      "Video Games",
      "Legacy Systems",
      "Wii U",
      "Batteries & Chargers"
    ],
    "price": ""
  }
}