{
  "website_summaries": [
    {
      "verdict": "The Velodyne vTrue is a powerful, bass-boosted headphone pair that is visually striking and quite expensive.",
      "pros": [
        "Powerful audio performance with very deep bass",
        "Doesn't distort at top volumes",
        "Ships with two removable audio cables, one with in-line remote and microphone for mobile devices",
        "Striking design"
      ],
      "cons": [
        "Bulky headphones can feel heavy over long listening sessions",
        "Heavily exaggerated bass not for audiophiles",
        "Too leaky for studio use",
        "Quite expensive"
      ],
      "aspects": {},
      "publication_date": 20130415,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great value when on sale.",
      "text": "Great headphone when connected to a headphone amp. When connected to a MP3 player (iPhone) they sound like trash. Do yourself a favor and buy a cheap Fiio amp to drive these if you plan on using them with your phone. They are the heavyest headphone I own. (BTW not worth the $400 asking price, they are worth the sale price of $80-150. For a $400 set of headphone go look at the B&W P7s. Another great product by Velodyne are the vLeves. Again not worth full asking price but they are nice headphone. For size comparison I placed them next to the popular Logitech G35 7.1 gaming headset in the attached image.",
      "rating": 5.0,
      "verified": true,
      "author": "[EGC]R4MZ3T",
      "helpful_votes": 9,
      "publication_date": 20150207
    },
    {
      "title": "I was hoping for a much better experience.",
      "text": "With high hopes of a great product; I received my unit defective. The Right side extension arm wouldn't lock making the headset irritating to wear. With a sigh, I had to return my purchase. The audio quality was good for some music but had tunnel sounds and too much artificial bass on others.",
      "rating": 3.0,
      "verified": true,
      "author": "GBass",
      "helpful_votes": 2,
      "publication_date": 20150116
    },
    {
      "title": "Superior sound reproduction",
      "text": "Superior sound reproduction, Some of the best headphones you will find for $100.00",
      "rating": 4.0,
      "verified": true,
      "author": "norris keith straughter",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Refurbished set",
      "text": "These headphones are ok. Not impressed by the sound and the design is quite big. Mine had dents in it which let me know they weren't new. Keep in mind there are refurbished products for sale too. I returned and got a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Chege Njoroge",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "These headphones by Velodyne are truly amazing and the value makes them a much better deal ...",
      "text": "These headphones by Velodyne are truly amazing and the value makes them a much better deal than Beats!! The low notes roll on beautifully and the mid and high notes are clear and precise!! Love these headphones!!",
      "rating": 5.0,
      "verified": true,
      "author": "Demetrious Hawkins",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Within a month of receiving these they started falling apart ...",
      "text": "Within a month of receiving these they started falling apart. By the 6 month mark, they were unusable. Because I bought them refurb, Velodyne advised that there was nothing they could do to help us out. I would not advise buying refurb Velodyne anything.",
      "rating": 1.0,
      "verified": true,
      "author": "cheryl",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Gorgeous and sound insane",
      "text": "I am known to love bass... But trying to form an unbiased opinion, I don't think these are too bass-heavy. Songs are so clear that I feel like I'm listening to new recordings. Such separation of elements. I have some very nice in-ear Klipsch buds, but these are my preferred headphones now. I love the look of these. Has totally impressed everyone I've let use them.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob Lentini",
      "helpful_votes": 5,
      "publication_date": 20140818
    },
    {
      "title": "Keep the spare audio cable in your glove box, it doubles as a tow rope!",
      "text": "Solid build, comfy, bassy but not overwhelming. Good pair if you want bass and sound quality/clarity. Being blind would also add to their appeal :) .",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "disappointment!!!",
      "text": "I purchased my pair of velodyne vtrue from Geo-sell. I opened the box and I was disappointed immediately.this things didn't look new to me. They where coverage on some sort of oil and they smell bad.also they had a few scratches here and there. Both adjustments where broken upon arrival which means I could never get a proper seal and this things are really uncomfortable to wear.As for sound. This things sounds average at best ,nothing special about them. Maybe the headphones are fake or use ones sold as new ones. And last If you buy from a unauthorized velodyne seller, you're on your own since velodyne won't cover them which I didn't know when I brought this things.",
      "rating": 1.0,
      "verified": true,
      "author": "Pedro M.",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Garbage, Overpriced, Shame on Velodyne",
      "text": "Terrible headphones. I was so excited when I ordered these headphones but these have been one of the biggest letdowns of my life when it comes to electronics! Velodyne is a great company but they really dropped the ball on these. The sound was muffled, with no highs but pretty decent lows. Terrible build quality! On top of all this, the seller (brandbargain) charged me a 10% restocking fee (which they do not list on their page!) and I returned the product within 2 days of getting it delivered (that's how much I hated it, I didn't even want it around me!) I ended up going with the Bang and Olufsen H6.. they're $399 but so worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "major disappointment",
      "text": "quite poor sound quality in the upper end by the way the bass was excellent too bad about the rest of the sound spectrum",
      "rating": 2.0,
      "verified": true,
      "author": "lillian perel",
      "helpful_votes": 3,
      "publication_date": 20150508
    },
    {
      "title": "Beautiful headphones and sound good BUT",
      "text": "Beautiful headphones and sound good BUT.... They are way too big and they were kind if tight. Returned for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Dennis J. Touriz",
      "helpful_votes": 2,
      "publication_date": 20140929
    },
    {
      "title": "Horrible sound, even w/different amps used",
      "text": "Horrible sound, even w/different amps used! This can't be how they were intended sound, I have $30 Pioneers that sounded better. Maybe because they were used, who knows. Definitely would not recommend these, the fit and finish were exceptional though!",
      "rating": 1.0,
      "verified": true,
      "author": "Kenneth B.",
      "helpful_votes": 3,
      "publication_date": 20141228
    },
    {
      "title": "Four Stars",
      "text": "Underrated! They are bass heavy which is what I wanted.",
      "rating": 4.0,
      "verified": true,
      "author": "stacy",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "This is one of the super hi-end headphones available in the market",
      "text": "This is one of the super hi-end headphones available in the market. However, it must be coupled with a proper headphone amp or mixer to give you the deepest bass line as well as the warm mid-range plus its sweet hi.",
      "rating": 5.0,
      "verified": true,
      "author": "Shigeru Iwata",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Avoid this company LIKE THE PLAGUE",
      "text": "This company make product with unimaginably bad build quality. They simply fall apart with normal use. The worst part is this : \"Upon evaluating the vQuiet headphones you sent, it has been determined that the faulty is not the result of manufacturer defect and therefore the warranty claim has been denied. Let us know if you want the damaged headphones sent back or for us to discard it? The Velodyne Audio Product Support Team\" that is what I got when I tried to return the item!!",
      "rating": 1.0,
      "verified": false,
      "author": "D. FRENETTE",
      "helpful_votes": 6,
      "publication_date": 20150318
    },
    {
      "title": "They worked for me",
      "text": "I actually really like these headphones. I got quite a few others including ATH-50 which are also amazing headphones. But these guys to me are way more comfortable. I can wear these for 8 hours straight without any problems. I would decently buy again.",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20151118
    },
    {
      "title": "The absolute worst sound ever",
      "text": "The absolute worst sound ever!!!!! DO NOT BUY THESE!!!! I had a DFX enhancer and magnet pull hooked up to these and they are terrible. NO treble what so ever.. I've have probably over 250 pairs of headphones in my life and I think these barely beat some 1992 Colby cheapos which were the worst ever!!! Any bottom end Sony's would destroy these with sound capability. I think this company released these as a joke to see what people would say because of the cosmetic beauty. I got screwed 10 fold..",
      "rating": 1.0,
      "verified": false,
      "author": "Stieve B",
      "helpful_votes": 2,
      "publication_date": 20150721
    },
    {
      "title": "Best headphone",
      "text": "Got these refurbished for 140 and is worth twice that. Best headphone I ever tried and best I ever owned. These rendered pleasant deep bass and detailed highs. Great all around headphones",
      "rating": 5.0,
      "verified": false,
      "author": "evil",
      "helpful_votes": 3,
      "publication_date": 20140502
    },
    {
      "title": "Best headphones I've ever owned",
      "text": "I have gone through dozens of styles and brands of headphones over the years, from cheap-o sets to expensive models, never finding anything that sounded the way I thought music ought to sound. That was before I tried the Velodyne vTrue studio headphones. From the time I first put them on, I was hooked. The clarity of reproduction is incredibly vivid, far better than the best I've tried in the past. Not only do these headphones sound great, their construction matches their elegant performance -- brushed aluminum, supple leather earcups, precision cords and plugs. My search for the finest headset is over. I'll never put anything else on my head.",
      "rating": 5.0,
      "verified": false,
      "author": "Bill Perkins",
      "helpful_votes": 10,
      "publication_date": 20130227
    }
  ],
  "product_meta": {
    "title": "Velodyne vTrue Over Ear Reference Headphones- Brushed Aluminum",
    "description": "True sound. True Style. vTrue. vTrue raises the bar for studio headphones, combining Velodyne’s legendary audio technology and unrivaled design to bring a true sound experience to the most discerning of music lovers. Design A forged aluminum design complements our supple leather headband and over-ear cups. Velodyne’s signature shape lends unique styling and beauty. Sound Accurate sound is produced through a 50 mm driver tuned to the exacting standards of Velodyne’s trademark low-distortion bass reproduction. Cable The vTrue features dual 3.5 mm connectors and a tangle-resistant cable in a braided cloth design.",
    "rating": 3.5,
    "feature_bullets": [
      "Uncompromising studio sound quality for the most discerning audiophiles",
      "50 mm drivers tuned to Velodyne's exacting standards",
      "Braided cloth tangle-resistant cables",
      "Dual 3.5 mm gold plated cable connectors",
      "Available in stylish Forged Aluminum & Brown Leather"
    ],
    "specifications": {
      "Package Dimensions": "11.5 x 10.24 x 4.57 inches",
      "Item Weight": "10.6 ounces",
      "Department": "Audio",
      "Manufacturer": "Velodyne",
      "ASIN": "B00A7GIIWY",
      "Item model number": "80-VTRUEAL",
      "Customer Reviews": "3.5 out of 5 stars38 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#5,545 in On-Ear Headphones#9,554 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 14, 2012"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}