{
  "website_summaries": [
    {
      "verdict": "A nice balloon launcher that holds up well and can be used by children, teens, and adults.",
      "pros": [
        "Can handle heavy use",
        "Well built",
        "Straightforward design",
        "Cushy handle",
        "Includes 300 water balloons",
        "Can launch a long way (up to 300 yd., but easy enough for a child to use"
      ],
      "cons": [
        "The distance is based on the strength of the people pulling it back"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Block Party Fun",
      "text": "I purchased this one to replace a similar one I'd purchased a few years ago, but misplaced. This one was better, with longer range. To create a more consistent experience and to make sure that no one got thwacked with an errant rubber band, I chopped up some 2x4's and created this frame for it. If you were playing on a beach, maybe you don't want the frame, but with many people of many sizes, the frame made it even better. I don't know if the balloons went 300 yards, but they sure flew halfway down the block. Everyone loved this thing. I'd recommend without any reservations.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Winkel",
      "helpful_votes": 13,
      "publication_date": 20180818
    },
    {
      "title": "Fun for all",
      "text": "I bought this for my daughter's 8th birthday party and it was a blast. This thing has some serious power. We started with launching water balloons but quickly moved on to golf balls in order to see how far we could launch something. I think we went well over 300yds with the golf balls. As far as \"accuracy\", you're not going to be driving tacks and hitting consistent targets or anything, but it's somewhat accurate in regard to aiming at a general direction. Overall this was an incredibly fun purchase and I would highly recommend it for anyone living in a rural setting!",
      "rating": 5.0,
      "verified": true,
      "author": "NoxNoctura",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Let'er Rip",
      "text": "We have used the 3 man slingshots in the past for water balloons, but wanted to try pumpkin chucking across the river and this was the \"Beast\" to do it. We had adults holding the straps and mixed in kids and adults pulling it back. Worked great on small pumpkins and would send them 100'-150' without much trouble. SPLOOSH! Then we pulled out the old garden tomatoes and these would easily go 200'-300' without any problem. Soooo much fun! Can't wait to try it out this summer on rafters and tubers on the river.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin Kollman",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "It is a beast of a launcher",
      "text": "Bought this for my son's 11th birthday party. Once everyone was instructed on it's use, they took turns launching for distance and then for accuracy. It was definitely in demand once the kiddos got the hang of it. Adult supervision is recommended, unless you don't mind seeing cupcakes launched into the air! The adults enjoyed it too, and it held up to extreme stretching, on occasion a balloon would break during the launch process, but that is only a minor issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Urpilot",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Birthday Party Hit",
      "text": "Bought this for my son's 10 year old Halloween themed birthday party. The kids wrote thier names on mini pumpkins and they took turns launching them. They flew 250 yards plus!! You definitely need a huge open space, but the kids absolutley loved it. I'm not sure about water balloons next summer (and picking up pieces of broken balloon), but for our purpose this product was fantastic. Maybe we'll try snowballs this winter. I would highly recommend!",
      "rating": 4.0,
      "verified": true,
      "author": "Angela Grossnickle ",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Does not go 300 Yards",
      "text": "I like the product a lot. It seems to be made of good material, and was easy to use. The tubing seemed to be of better quality than similar balloon launchers I have used in the past. I don't know about it going 300 yards, I think 100 yards (300 feet) would be a more accurate statement. I would buy again and we had a blast using it in a water balloon fight on our family vacation!",
      "rating": 4.0,
      "verified": true,
      "author": "Bradley Brzuchalski",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Great fun, but buy your own balloons",
      "text": "We had a lot of fun with this slingshot. Seems to be sturdy and made well, but the little bag of balloons that came with it were totally unusable. Couldn't get water in the really tiny things and they would rip. Smallest water balloons we'd ever seen and very thin. Luckily we had a bag of full size balloons we could use. Not easy to hit the target with this so you wipe out bystanders. If you want to stay dry, volunteer to be the target!",
      "rating": 4.0,
      "verified": true,
      "author": "Patcake",
      "helpful_votes": 0,
      "publication_date": 20200613
    },
    {
      "title": "Very Happy!!",
      "text": "These are the greatest sling shots for distance shooting! We use them on a football field and they really throw those balloons! We received them promptly and order was just what I expected. If you have never used thing product before, I highly recommend getting two and enjoy! I would highly recommend the vendor, they make a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Brown007",
      "helpful_votes": 2,
      "publication_date": 20170526
    },
    {
      "title": "Great for baseballs",
      "text": "We love it. In addition to water balloons and tennis balls, we've launched baseballs straight up with it. They go amazingly high and it's been good fielding practice for our bored, season cancelled so far, baseball player. Although make sure you use someplace where the balls can't hit. Could do a lot of damage. We have ours tied to the basketball hoop in the driveway so one person can launch them and then run out of the way lol.",
      "rating": 5.0,
      "verified": true,
      "author": "MBHK",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Stop looking elsewhere, and buy this one!",
      "text": "It's pretty straight forward, and does what it's intended to do. Only reason it's not 5 stars is because it doesn't shoot 300 yards. Great quality, seems very durable, and works great. If it didnt say 300 yards, I would give it all 5 stars. Other than that, it's a great product! If things change after normal use I'll update this post!",
      "rating": 4.0,
      "verified": true,
      "author": "Mike stamper",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Fun, but not for long",
      "text": "Kids love it and had a blast. Until I had to take it away from them out of fear the handle and/or cheap pocket was going to tear. Quality must have gone down over the years. Guessing once they got a bunch of great reviews, the company decided to skimp on the quality and cheapened up. Sort reviews by date and don't go from the 2017-2018 reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "Crafty42",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "It was a lot of fun!",
      "text": "I bought two of these launchers. Took them to the villages in Kenya. The launchers worked flawlessly. The kids had a lot of fun! They launched a lot of balloons. You can pull it back a little way to go a short way, or really pull it back and the balloon will really fly. We could that filling the balloons up too full will make them susceptible to popping during launch. The kids enjoyed the whole experience! It looks like they will last a long time!",
      "rating": 5.0,
      "verified": true,
      "author": "rocketmann",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Great Launcher",
      "text": "This is a great balloon launcher with plenty of power. My boys are in their 20's and just love it. Launches balloons plenty far! We also use it to play Angry Birds in which we launch bean bags at boxes. Works great for that as well. Time will tell how well it holds up, but after a couple weeks so far so good. Very pleased with the product and would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Fun to play with",
      "text": "This is fun to launch water balloons with once you get the hang of it. It’s a steep learning curve to get the balloon to stay on the pouch as you shoot it. The two people holding the sides have to hold it up above their heads to get a good height to it. It’s a little pricey for what it is, but it’s great quality and the Rubber tubes are super thick and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "ZMomUtah",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "One of the better balloon launchers I have used!",
      "text": "Product worked as expected and is great! this launchers balloon pouch is made a stiffer material than others I have used which is a good thing. Some launchers have a very flimsy fabric which wraps around the balloon way to much and then causes it to explode in the launcher rather than releasing it. We consistently were shooting it about a good 150+ yards with three adults a decent sized water balloons. to get to 300 yards, you would need to use smaller balloons as the larger they are the shorter the distance it will go. It would be a bit more difficult for kids to reach near that far but that could also be a Good thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim O",
      "helpful_votes": 0,
      "publication_date": 20170627
    },
    {
      "title": "Wanna see a mischievious Grandson laugh?",
      "text": "A Birthday present for my 9-year-old buddy and partner in crime Russell The Muscle. We launched 40-some balloons. The included balloons were a disappointment. We sought alternative ammunition. By days end, we had soaked or shelled most of the mobile home park! No Animals were injured during this birthday party.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Want to have fun this summer? You only need one thing....",
      "text": "Incredible, and more fun than we've had in years! We broke this badboy out at the family lakehouse and before long we had a crowd from allover the block. This thing brought us together like nothing ever has before! I'm actually on my way to get more water balloons because we've already gone through 50 or so, so STOCK UP!",
      "rating": 5.0,
      "verified": true,
      "author": "Morganational",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "They'll fly!",
      "text": "This launcher worked flawlessly! We used it to launch tennis balls for a giant sized Angry Birds game and it would send those balls at least 100yds with no problem. Then we decided to see how actual water balloons did and I am telling you, this will send them. I didn't measure out 300 yds, but I know for sure they went at least 200yds!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "What a blast!",
      "text": "The kids - small and teenagers alike - had a blast with this at our family reunion. We couldn't believe the distance we got. Next time I'll buy more Bunch O Balloons. We went through hundreds of balloons in no time. We had a contest at the end to see who could gather the most balloon pieces from the field. It was a popular activity for everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "PJo",
      "helpful_votes": 0,
      "publication_date": 20170827
    },
    {
      "title": "Good launcher, didn't last tho.",
      "text": "It worked really well at first but we ended up breaking it. I can't really blame the product because we used three big guys that really stretched the rubber bands to the max. Probably shouldn't have been stretched that far! lol. It was fun while it lasted tho.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Let em rip!",
      "text": "This thing rips them. Balloons that came with just throw out and get the 100 fill at once packs. Also don’t fill balloons too full. The sheer force can cause them to burst in the holder. Also takes a bit getting used to everyone holding it properly. A stand would help this",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald  Jr.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Great slingshot",
      "text": "We use this sling to launch some kick balls for a superhero birthday party and it worked great! Our daughters taking turns shooting them across the yard and their dad catching them. It takes a little learning to place the balls just right into the sling to get a good shot.",
      "rating": 5.0,
      "verified": true,
      "author": "mommyof3",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great Slingshot!",
      "text": "Our youth group has had a lot of fun! We've actually been launching eggs. I raise chickens and we had a long power outage so I had 24 dozen worth of eggs I couldn't sell and didn't just want them to throw away. Well, we launched eggs with this thing and the kids had a great time. We got our eggs to go farther than we ever imagined. The kids had a great time! We can't wait to do water balloons!!",
      "rating": 5.0,
      "verified": true,
      "author": "Juanita R. Dafler",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "It’s Beastly!",
      "text": "I haven’t shot a water balloon yet, but I can only imagine how far they’ll fly! Here’s what I’ve tested and my findings: Nerf Ball @ 75% pull >>> Shot it indoors, and I estimate that the ball was traveling 85-90 mph at 40 ft from launcher. Golf Ball @ 80-90% pull @ 20 degree angle >>> Golf ball travelled 120 yards, easily clearing the distance of a soccer field. I’ve owned 100 and 200 yd launchers in the past, and this is an upgrade. The bands don’t seem much longer than the 200 yd, though. I think they’re just better quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Mishkin37",
      "helpful_votes": 0,
      "publication_date": 20180803
    },
    {
      "title": "Family Fun!",
      "text": "We ordered the Seabillies Beast 300 Yd Water Balloon Slingshot before we went on vacation to a beach house. We got the entire family out on the patio launching water balloons to a target we made on the beach. It was so much fun! We had an absolute blast!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "HOOKS",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Really Fun!",
      "text": "This water balloon launcher/slingshot is really fun! We’ve tried it a few times and are still learning the best ways to launch balloons. It appears to be sturdy and well-made. We will store it out of sun and heat because the tubing may dry out and crack if not cared for properly. Overall, we love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kate's mum",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Hard to keep the water balloon in place, and coordinate the release at the same time",
      "text": "The kids love it. If used properly it works fine and will create a lot of fun. But 300 yards is way out of line. It's a sales pitch like many many many other things (if not all) on today's market. The other con is that it is hard for kids (and adults) to pull the sling back and keeping the water balloon in place. It will require a good coordination of both hands (one hand pulling the sling, other hand reaching over the sling to protect and keeping the water balloon in place, and releasing the sling and water balloon at the same time).",
      "rating": 4.0,
      "verified": true,
      "author": "Gerrit van den Bos",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Rips after one day of use.",
      "text": "This sling shot would be better if the bag didn't start taring the first time we use it. I bought this for my son's birthday party to have some fun launching balloons and knocking over buckets. I order this and after a test run I saw the bag was starting to tare. So, I hurry uped and bought another one thinking it might just be a defective one. Well, the exact same thing happened. It didn't even make it through the whole party.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Good slingshot, but have reasonable expectations",
      "text": "The Beast seems to be well constructed. We have used it a few times, and it worked as you would expect. I don't think you could possibly get 300 yards out of a shot since we had it pulled back about as far as it would go and got nowhere near that. However, it's got some punch to it and is good fun when used responsibly.",
      "rating": 4.0,
      "verified": true,
      "author": "Iowa Family",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Be ready to have a blast.",
      "text": "This thing is awesome. Bought it for a youth group activity and the kids loved it. We shot it well over 200 times with them. The adults, of course, had to test it the night before and we had a blast. It shot well over 300 yards we were hitting right at 350yds consistently. Awesome product. Only suggestion is to get better balloons, bit I didnt buy it for the balloons. Lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "(11 and 14) and they love it. Granted they can not pull it back ...",
      "text": "I bought this for my kids, (11 and 14) and they love it. Granted they can not pull it back like the adults can, but they can still get a balloon to go about 75 to 100 yards easy. They ended up tying each end to the poles of the gazebo to make it so it can be used by just one of em while the other tries to catch the balloon with a net or bucket. Go figure.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie M Ruff",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Endless fun!",
      "text": "Water balloons, small pumpkins, cantaloupe, watermelon, eggs! Fruit and veggie carnage! Slo-mo videos galore! Perfect for a fun afternoon laughing until your stomach hurts launching random, vaguely round objects to see them explode on impact! I’ve never gotten it to go farther than perhaps 100 yards, but boy is it funny to watch an egg travel that far and fast. PRO TIP::: don’t launch directly at another person, that s**t hurts.",
      "rating": 5.0,
      "verified": true,
      "author": "Clara",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "~100 yards from 3 9 year olds",
      "text": "Not sure about 300 yd distance, but with 3 9 year olds they were able to launch balloons about 80 yards. A couple of adults might get 150 yards out of this but 300 seems like a stretch. Regardless, they go super far and the kids are having a blast with this!",
      "rating": 5.0,
      "verified": true,
      "author": "sanjosedad",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "ok",
      "text": "seems to be made of decent durability. packaging was cheap. balloons that came with it were really cheap, half had holes in them and were too small to use. mainly though it doesnt go 300 yards. more like 300ft. we averaged about 90yards",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great Fun!",
      "text": "My family had a wonderful time with the neighbors playing with this water balloon launcher! Great fun on hot days! My husband made it a mobile 1-person launcher by installing poles on the back of a Polaris Ranger and attaching the launcher---a huge \"hit\" so to speak.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerri",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Awesome launcher",
      "text": "Very good water balloon launcher. It was a hit at the lake with the kids and adults. Just wished I bought two of them. Summer just started, so plenty of time for more fun with the launcher. Not sure about the 300yds with three people. But I can launch them by myself no problem, but don’t recommend it. Safety first.",
      "rating": 5.0,
      "verified": true,
      "author": "scubasteve",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Field Day Game/Party Game",
      "text": "My 7th grader wanted this launcher for a school outdoor field day. The kids loved it. Thought it was the best field game ever. We now use it during our pool parties. The kids drive a go kart around and try to hit the person on the go kart with the balloon. Only thing we recommend is the person driving around needs to wear a helmet for when the water balloon hits them in the head.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom of 2 Boys",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Prepare for takeoff!!!!",
      "text": "Just recently purchased this three man slingshot and it did not disappoint. We were launching snowballs till the early AM. They definitely get launched especially if they sit in right. We even sent some massive ice chunks, they didn’t go far but this slingshot is durable even for some bigger projecticles. You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "David Flores",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "The teens had a great time launching their balloons with surprising accuracy",
      "text": "We used these at a family camp for water balloon contest. we needed to hit the Pirate Captain of the team out in the canoes on the lake. The teens had a great time launching their balloons with surprising accuracy. Later they took them out to the baseball diamond and had contest to see who could launch the balloons the furthest. I can see years of good clean fun in store or us. Great product.",
      "rating": 4.0,
      "verified": true,
      "author": "JoEllen",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Fun for the whole family",
      "text": "Product arrived quickly and we had a blast shooting water balloons at the boats on the river. We camp right on a river so we aim at the boats going by. They have fun egging is on trying to hit them.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Sharp",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Great Product. Super fun times!!",
      "text": "We got this for a 13yr old’s birthday. He loved it. It has been used a few times now and it has worked great. Super fun! This will bring hours of enjoyment for both children and adults! It’s a hit at any Summer gathering/party. The Beast 300 is well constructed and appears to be high quality. I’d definitely recommend this product. It's a great value plus you get a bunch of balloons so that's a plus. Make sure you have some space to launch, the balloons really fly!",
      "rating": 5.0,
      "verified": true,
      "author": "MarkN32",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Great for your basic citizen uprisings",
      "text": "this thing will hit 300yds no problem. More importantly, it's fire and forget. Once you load something and fire it you are literally not responsible for where it goes or whom it hits.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Might work for balloons, but not fishing lures",
      "text": "Can not be used for launching lure from the beach.",
      "rating": 2.0,
      "verified": true,
      "author": "Darryl Harvey",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "I recommend the larger launcher for extra fun and being able ...",
      "text": "We bought two launchers to have snowball contests at a family trip to Tahoe. The snowballs launched really well if they were packed tight enough! My three star rating is because a foam handle on one of the launchers split within 5 minutes of starting our game. I've used launchers for years and have never had this happen. I recommend the larger launcher for extra fun and being able to launch larger balloons.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "balloons are useless",
      "text": "The 300 balloons that come with this unit are useless, practically impossible to fill with water and if you are lucky enough to get water in them, they are so tiny they are a joke. Don’t count on using the balloons that come with this unit, get your own.",
      "rating": 3.0,
      "verified": true,
      "author": "Lola",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Great quality. I bought this for my High School ...",
      "text": "Great quality. I bought this for my High School Physics class. I have had others over the years, but they don't last long in the hands of 36 exuberant teenagers. This one is the best I've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy D. Hurley",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Best entertainment!",
      "text": "Absolutely love this slingshot! I used it for giant angry birds for a school carnival and it was the best booth! Make sure to have a big open space or a wall to catch the balls, otherwise you might lose them in someone's bushes. So grab a few friends and go have some fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Hippolover89",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Incredibly fun!",
      "text": "This product was a huge hit at my son's bday party! The adults were the ones using it while all the kiddos watched to see how far they could launch the water balloons! Everyone loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Raine",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Blast a teacher",
      "text": "This has been such a motivation for my Physics classes. They took one look at it and immediately started to use the formulas to find how much force was needed to hit the teacher with a water balloon. It is important to keep students interacting with the tools of science and this slingshot is terrific.",
      "rating": 5.0,
      "verified": true,
      "author": "R Pressey",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Hit of the family reunion!!",
      "text": "Ordered this the first of this week and they arrived two days later, just in time for our family reunion today. It was the hit of the reunion. Impressed with the quality and price. Planning on ordering one or two more and would recommend to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "JJLLBB",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "Great basic launcher, need 3 people to use",
      "text": "Great launcher for all size balloons (this can handle all sizes). Used it with Bunch o Baloons from costco and it can really launch. Holders have to be strong enough, so maybe best for ages 6+. Seems like it will last a long time. Launch over lake, field, off a cliff, it’s super fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Life Saver",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "So much fun. My 7 year old grandson was able to ...",
      "text": "So much fun. My 7 year old grandson was able to do some awesome (really far) launches. He was also able to man one side of the launcher. I doubt a younger child could manage it though. The adults had a blast launching them, too. It is entertaining to watch the fun. Definitely worth the money! Buy one, you won't regret it! .",
      "rating": 5.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Pouch unravels. Rubber bands held up great.",
      "text": "I bought this product a year ago - those did great. We still use them - they've held up great! This item though....we used it a couple times, and the holder/pouch came unraveled and fell apart. Ugh!",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Pangborn",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Better than advertized",
      "text": "We had four different water balloon slingshots during a several hour water battle with grandchildren and neighbors. The Beast 300 yard slingshot was the best of all of them. You need a large area as this launches balloons farther that others. The battle ended only because we used up our 500 balloons. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Score for Grandma",
      "text": "I sent this to my grandson for his 10th birthday. He was so excited he ran right out with it :D Guess that's a big W for grandma!",
      "rating": 4.0,
      "verified": true,
      "author": "Phoenix",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "We won the war....again!",
      "text": "Exactly the weapon we were looking for. Two houses, 322 feet apart, easy target! Yes we had the high ground but this Beast was spot on. Our enemy took multiple hits before they could see through the fog of war and comprehend what was going on and where the onslaught was coming from. The Beast held up perfectly over multiple days and high activity periods of 15-20 water bombs per minute. If you are looking for a superior water balloon launcher this is your product!",
      "rating": 5.0,
      "verified": true,
      "author": "doug dunlap",
      "helpful_votes": 7,
      "publication_date": 20170302
    },
    {
      "title": "keep the sides close together",
      "text": "if you hold the sides or make something for it, be sure to keep it close so when you pull it back, it closes it tightly and send those water balloons sailing.",
      "rating": 5.0,
      "verified": true,
      "author": "pierre klee",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Tons of fun",
      "text": "The Beast Water balloon slingshot was everything I expected when I placed my order. Way better than the homemade ones of my college days long since past. I wasn't expecting it to come with water balloons, so I can't really complain about the balloons that accompanied my order.",
      "rating": 5.0,
      "verified": true,
      "author": "kristian jelinek",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Kids loved launching the balls",
      "text": "We had our AWANA carnival last Wednesday night - it was too cold outside to launch water balloons - so we set up baskets with circles drawn around them and launched wiffle balls. The kids had a blast and totally loved launching the balls. We have a church picnic coming up in a month and hope to launch water balloons - but that will depend on the weather. We built a launch pad to mount the sling shot - worked great",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl A. Detschner",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Long lasting",
      "text": "We’re using these for a slingshot stand for a camp activity shooting small “angey bird” stuffed animals. They straps secured to the post well and lasted over a year until we finally needed to replace the original set",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Sanford",
      "helpful_votes": 0,
      "publication_date": 20190213
    },
    {
      "title": "Ton of fun",
      "text": "I hook the ends to a launcher and it's good for the entire 4th of July day! That being said... they typically only last a year (with a full-day's use) so I buy one every year. I don't believe it goes 300 yards, but far enough for a ton of fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Hiker",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Water balloon launcher",
      "text": "Worked great , my son uses it for a science project. How project was to build a water balloon launcher the could launch a water balloon 150 yard . This one did that easily .",
      "rating": 5.0,
      "verified": true,
      "author": "charles jones",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Look for cracks in the tubing",
      "text": "This sucker is a beast. Only reason I didn’t give it a five is the tubing is unwrapped and after several uses I am leary about using it for fear of a snap and a vicious recoil (think of a tow chain whipping back into your cheek) otherwise it is a cool 1 summer toy!",
      "rating": 4.0,
      "verified": true,
      "author": "A. Alldredge",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Might work for launching solid objects",
      "text": "This thing is not made to launch water balloons 50 yards, let alone 300 as claimed. The balloons (we tried two types to make sure we weren’t doing something wrong) would just burst when launching. The only water balloons we could get to work with this were the ones that barely went any distance. It was much more like a lob or toss... nothing I would call a launch. We were throwing them by hand much farther.",
      "rating": 2.0,
      "verified": true,
      "author": "Larry Merriman",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Works as advertised",
      "text": "It works great. I am not sure how durable it is but seems like it will last a long time if we bring it indoors after use. It launches things super far and our friends and kids had a blast with the launcher.",
      "rating": 5.0,
      "verified": true,
      "author": "Mother of cuteness",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Broke while using it, first day.",
      "text": "This product was a very fun addition to our son's 16th birthday party until it snapped and broke. When it snapped it whipped two of the boys, one on the back and one on the neck. It was so disappointing that it was not better quality. We were looking forward to using it multiple times. I think the band needs to be stronger.",
      "rating": 2.0,
      "verified": true,
      "author": "Crystal Melum",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Best for older kids and adults",
      "text": "I bought this for my kids (ages 15, 8, 5, 4) to play with. The little kids had a hard time using it but it was fun for my oldest. The water balloons that come with it are very cheap and difficult to fill with water. I recommend getting your own balloons to use in it and make sure to really fill them up do they fit into the launcher snuggly. The launcher is good quality and we look forward to using it for many years to come.",
      "rating": 4.0,
      "verified": true,
      "author": "R Bridget Eastman",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Just right and strong",
      "text": "Sting and fun. We used this to send apples flying across the field at our Apple press party. Worked great for it.",
      "rating": 5.0,
      "verified": true,
      "author": "crice",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "ALTERITAVE USEAGE",
      "text": "GOT A 3 PERSON WATER BALLOON LAUNCHER TO USE FOR WORK HAVE A 10OZ THROUGH BAG THIS WILL LUNCH IT FURTHER THAN BY HAND WITH IT I CAN AVERAGE ABOUT 200 TO 300 FEET IN ONE LAUNCH",
      "rating": 5.0,
      "verified": true,
      "author": "william kessler",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Adults too strong",
      "text": "Bought for a party and the adults wanted to launch after the kids.. It broke mulitple times and kept having to tie the bungie in knots. Its kind of lame its only made for kids. Adults like to have fun as well.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181218
    },
    {
      "title": "Tons of fun for the whole family!",
      "text": "Arrived quickly and it is very well made. Very easy to use the hose to fill the balloons and I'd recommend floating them in a bucket or pool of water as you fill them so that they do not break. If you are handy you can build something so that this can be operated by just 1 person.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Woolever",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Works well, great price!",
      "text": "Tested with a light T-shirt (wrapped up with rubber bands) and got 150-200 feet easily, I have no doubt that a balloon would go even further.Very nicely made, looks like good quality fabric and tubing.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Works great!",
      "text": "This water balloon launcher seems very well built. We stretched this thing to the max and it held up very well.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Meyer",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "They love it. I dont know how far it really ...",
      "text": "Bought this launcher for my 13 year old son and his buddies. They love it. I dont know how far it really launches the balloons - but its pretty darn far. Far enough that I am surprised they didnt get themselves in trouble. On a side note it launches eggs even further than the balloons!! .... not that i would recommend doing such a thing... but we are talking REALLY far! Get one! Have fun - Just point it away from my house please",
      "rating": 5.0,
      "verified": true,
      "author": "jdw",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Durable & Great family fun!",
      "text": "We loved this for our families “target practice”! We had a great night with a family of 6 and LOTS & LOTS of water balloons! Durable, good quality fun!",
      "rating": 4.0,
      "verified": true,
      "author": "Jewelz",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Launcher is well constructed and seems like it will last well",
      "text": "Launcher is well constructed and seems like it will last well. As other reviewers have mentioned, it is unlikely you will get them to launch 300 yards, but they still launch pretty well. The balloons that come with it, come free with the purchase of the launcher- but the balloons are terrible. They are the ones that have little stretch in them, making them difficult to tie, and they break easily as you are filling them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jake  King",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Fun for all ages!",
      "text": "We had an end of summer party and the kids we’re launching water balloons at the parents. Easy to use and not expensive at all. It was a last minute suggestion from a friend and I’m glad I found it on Amazon! We are going to see if it will work as a snowball launcher.",
      "rating": 5.0,
      "verified": true,
      "author": "Mar the pear",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "300 yards = 300 feet?",
      "text": "Solid quality, have put 2 bags of red potatoes through it so far. With three adults, we have not got anything to 300 yards. Id say closer to 300 feet, though just potatoes and eggs have gone through it so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "a ton of fun",
      "text": "We bought this for a campout and we had a great time with it. It shot a water balloon pretty far, and held up great.",
      "rating": 5.0,
      "verified": true,
      "author": "Filth and offscouring",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Fantastic Range",
      "text": "If you get the right people handling this thing, you can make your water balloons go FAR and fast. Amazing product if you know how to properly operate it.",
      "rating": 4.0,
      "verified": true,
      "author": "D.M.",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Nails a river barge at 200 yards!",
      "text": "So much fun!!!! We live on the river and sling these balloons half way across the Ohio. Coal barges make a great target. I'm looking to buy 8 more for neighbors. Can I get a quantity discount? I'll trade you for a video of us having a slingshot contest into targets on the river. Awesome product!",
      "rating": 5.0,
      "verified": true,
      "author": "jw",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great Launcher",
      "text": "Powerful enough to get out and surprise somebody. Accuracy definitely a plus. Water balloons supplied are not strong enough to support the power of the launcher. They sent me another pack of water balloons that are the same poor quality as the ones before",
      "rating": 2.0,
      "verified": true,
      "author": "KJ Review",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Quit looking and buy this one!",
      "text": "Replaced an old worn out model. This thing is great! Balloons that come with it are a little on the thin side, so someone with no experience will likely break a lot of them. (tip: make small water balloons with the included balloons) The kids wore the dogs out launching tennis balls. Excellent product!",
      "rating": 5.0,
      "verified": true,
      "author": "Michael J Fox",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Durable and fun for all ages",
      "text": "Well worth the money. Shoots balloons far and the kids had a blast with it. Wont be disappointed. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Great gift for college student!!",
      "text": "What a great gift for my college student! We used it as a family and she can’t wait to bring it back to college! So easy to use and it shoots amazingly far down a football field!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracey Hasse",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "shooting at targets on the bases and it was great, we were able to launch water balloons over ...",
      "text": "Purchased two of these for a obstacle course style run, we bought two just in case one of them got damaged but never even had to break out the second one. We had it set up at home plate of a baseball diamond, shooting at targets on the bases and it was great, we were able to launch water balloons over the outfield fence with some pretty good accuracy too. Really fun, would highly recommend. I will say that the free balloons that came with it did not hold up well as it got warmer outside, but we had our own so it was not a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Simpson",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Easier for adults to use than kids! A lot of fun for all though!!",
      "text": "This is a great launcher. Fun for kids and adults and will send balloons far. Kids had a blast with the launcher, although it was harder for them to pull back and keep the balloons in. Much easier for an adult to pull back and send balloon fast and far! Fun for all!",
      "rating": 5.0,
      "verified": true,
      "author": "JessicaH",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "Great Launcher",
      "text": "Love this launcher. It works as described. My six year old loved playing with it. Handles are comfortable, and it holds the balloons well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Launcher",
      "text": "This launcher is very good. It serves it purpose well. The balloons are a little on the weak side but they are water balloons and I still havent found the most durable water balloons but they are good. The launcher is durable and has a lot of power behind it. We tested it with launching balloons, tennis balls, foam balls, dodge balls, golf balls, and other items. The golf ball is certainly the most dangerous. Over all its durable, easy to use, and works great! I would recommend it to anyone asking.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Strait",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "Awesome product, sure to add some fun to the day!",
      "text": "Awesome good time product! Kids and adults cant wait to take their turn. Little kids just need some practice to find their aim but it shoots super far really far for experienced adults! Good for parties, 'bored' kids and summer holiday gatherings that need some pep! Product is one of the best launchers we have ever used, and that's saying something. Excellent price as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Creepingtime",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Great launcher for adults!",
      "text": "Bought this for some fun family 4th of July games! The adults loved it and it was very user friendly for them. The kids unfortunately couldn't pull back hard enough to launch the balloons. We ended up just having a water balloon fight instead of launching them.",
      "rating": 4.0,
      "verified": true,
      "author": "Erin W Gwilliam",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "This is the greatest thing I have ever ordered",
      "text": "This is the greatest thing I have ever ordered! Entertains kids and adults alike! Purchased it for a 12 yr old birthday party last weekend and we mounted it to two stakes in the ground and launched apples at targets. You could get them at least 300 yards if not farther! The party goers used it for hours, and it has no wear on it all all! Great investment!",
      "rating": 5.0,
      "verified": true,
      "author": "desiree esposito",
      "helpful_votes": 0,
      "publication_date": 20171002
    },
    {
      "title": "Pumpkin launcher!",
      "text": "We used the Beast 300-Yard Water Balloon Slingshot for a fall birthday party to launch pumpkins at targets. It was a hit! It arrived quickly and is durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Twofer",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Great quality and so much fun",
      "text": "This is a fantastic adult sling shot!! We had as much fun as our kids. This product is durable and well constructed",
      "rating": 5.0,
      "verified": true,
      "author": "Momof2",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "The sling shot works great! It is strong and is holding up to ...",
      "text": "The sling shot works great! It is strong and is holding up to the testerone adult fun! My only negative: the balloons that were included with the sling shot were weak, most of them busted before being launched. Also, it would have been nice if the launcher included an adapter to fill the balloons. That being said: the launcher is great, but purchase some premium ammo :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Pattenaude",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Slingshot pocket ripped to shreds after minimal use.",
      "text": "Unfortunately the quality of this product is very poor. We bought this for use at a fall party for the kids. Needless to say by the pictures the slingshot didn’t last. Very disappointed that the product ripped nearly to shreds after a short time of use by kids ages 3-11. Hopeful that the seller will refund our money, as the product was not of quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "300 feet not yards",
      "text": "The manufacturer needs to change the units from yards to feet. My friends and I who have above average strength stretched the bands to the max and were repeatably getting 300 feet. There is some finesse needed when launching so the balloons don't burst. The balloons provided suck big time. Overall, the launcher is good quality and a lot if fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Don Moody",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "250 feet, not 300 yards",
      "text": "This will chuck a lemon 250 feet tops. Not even close to the 900 feet claimed distance. Still fun.",
      "rating": 3.0,
      "verified": true,
      "author": "bluesmann4u",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Super fun and great quality!",
      "text": "Super fun to use on last day of school and years to come- great quality! Launches really far!!!",
      "rating": 5.0,
      "verified": true,
      "author": "tenner14",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Works like a champ!",
      "text": "Made a great gift for the son of a neighbor. Not sure if it actually goes 300 yards, but seriously, I'm not out there with a yard stick. It is what it is and it seems to work just fine. Note: If you store it in a sealing plastic bag when not in use, the rubber/straps will last infinitely longer. You're welcome!",
      "rating": 5.0,
      "verified": true,
      "author": "FrostyTheAirpirate",
      "helpful_votes": 0,
      "publication_date": 20170721
    }
  ],
  "product_meta": {
    "title": "SEABILLIES Beast 300 Yd Water Balloon Slingshot/ Cannon/ Launcher",
    "description": "The beast water balloon launcher kit is the perfect gift for almost anyone, ages 5 to 75! Send it to your college students. Send it overseas to your loved ones in the military. Give it to your children or grandchildren. Buy one for the family. Buy one for you and your friends.",
    "rating": 4.6,
    "feature_bullets": [
      "The beast water balloon launcher kit includes:",
      "300-Yard 3-person launcher",
      "300 water balloons",
      "Instructions",
      "Distance Varies based on size and strength of participants. 300 yards is maximum distance obtained in competition."
    ],
    "specifications": {
      "Product Dimensions": "23 x 5 x 18 inches",
      "Item Weight": "8 ounces",
      "ASIN": "B00AL57GEW",
      "Item model number": "QMC300",
      "Manufacturer recommended age": "13 years and up",
      "Best Sellers Rank": "#17,123 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars1,256 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "April 4, 2019",
      "Mfg Recommended age": "13 - 50 years",
      "Manufacturer": "SEABILLIES"
    },
    "categories": [
      "Squirt Guns",
      "Pools & Water Toys",
      "Toys & Games",
      "Sports & Outdoor Play"
    ],
    "price": 19.99
  }
}