{
  "website_summaries": [
    {
      "verdict": "The Acer Aspire V5-571PG-9814 offer the best all-around processing and graphics performance of any of the 14- and 15-inch touch-screen laptops we've seen in recent months, but packages it in a bland design with middling features.",
      "pros": [
        "Speedy Intel Core i7 ultra-mobile processor",
        "Discrete Nvidia GeForce 710M GPU",
        "Touch screen"
      ],
      "cons": [
        "Awkward proprietary Ethernet/VGA combo port",
        "Middling sound",
        "Short battery life"
      ],
      "aspects": {},
      "publication_date": 20130408,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Laptop But...",
      "text": "It is a beautiful laptop. Windows 8 works best if you are willing to turn your computing experiences over to Microsoft. Tried to use my current email and nothing worked properly. I finally reset 8 in Windows RE wiping out the info I had entered and signed up for an outlook account. Now everything works fine. I hope sometime to modify the Windows 8 desktop to reflect what I want to see but for now, I am okay going to Internet Explorer. I do love the touch screen. The Acer is sleek, light, performs beautifully but I hate mouse touchpads in general and the Acer's one does not change my mind.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20130714
    },
    {
      "title": "have a good anti virus program",
      "text": "i bought it in 2013...great service..and performance ..still working with windows 10...i spilled coffee by accident on my keypad...i bought a new one and change it myself...and the unit is still doing great....sometimes planning on buying a new model...but...nahh...i stay with this old one that is still functioning and keeping me happy",
      "rating": 5.0,
      "verified": true,
      "author": "jose lopez acosta",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Good specs, bad operating system.",
      "text": "Love it, minus Windows 8. Bought this computer for work, and it certainly had the specs, but the tiles interface is too different and non-conducive for productivity software. Loaded the shell interface add a work around to the tiles, and everything is back to normal. Great for mid-range games as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin D.",
      "helpful_votes": 0,
      "publication_date": 20131006
    },
    {
      "title": "College Bound",
      "text": "My son has an interest in studying graphic design and TV/Film. He wanted a laptop that could handle professional editing and design software. I am in the same business and I know it takes a good load of hardware to handle these programs. I spent weeks looking for the right laptop. The way this computer was equipped fit the bill. He had it a couple of weeks before going to school and ran it through some tough workouts and all he could say was, WOW! Performance is amazing. Acer makes good stuff and this machine is at their top of the list. Looks good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerry Wallace",
      "helpful_votes": 0,
      "publication_date": 20130823
    },
    {
      "title": "Piece of junk",
      "text": "Laptop was fine for a couple months and then HARD DISK died for no reason while I was surfing the internet?? I had a Sony for more than 4 years without a problem - this laptop is a piece of junk. The screen is of horrible quality and hurts your eyes after a couple hours using it.",
      "rating": 2.0,
      "verified": true,
      "author": "renebmc",
      "helpful_votes": 0,
      "publication_date": 20131110
    },
    {
      "title": "So far so good",
      "text": "I'm content with it for the most part. There's still a little getting used to Windows 8. The space bar keeps getting stuck. Also the track pad keeps deleting words as I type them. These are little things you'll just have to deal with.",
      "rating": 3.0,
      "verified": true,
      "author": "HonestyMatters7979",
      "helpful_votes": 0,
      "publication_date": 20140531
    },
    {
      "title": "Hoped for more -- Windows 8 is terrible",
      "text": "I have found Windows 8 to be exceptionally frustrating. The transition between touch screen operation and keypad operation often results in loss of info when typing.and becomes especially frustrating when using excel. Found that addition of a wireless mouse helped to solve many of those issues. Battery life is not nearly as good as advertised. I am getting about 3 hours before recharging. The computer itself works as advertised otherwise. Speed is ok -- but not as fast as expected.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott W Gillinder",
      "helpful_votes": 0,
      "publication_date": 20131010
    },
    {
      "title": "Very nice laptop",
      "text": "Gave this laptop to my wife as a gift. Very nice display and worked flawlessly right out of the box. Easy to set up and use. Not a fan of Windows 8, but the touch screen is really nice and the display is very crisp and clear.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick Wakefield",
      "helpful_votes": 0,
      "publication_date": 20130610
    },
    {
      "title": "Great touchscreen laptop",
      "text": "This is a replacement for my old and broken laptop. Item arrived promptly and was as described. Very satisfied with the quality and price of the product. Will not hesitate to buy from seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "Babs",
      "helpful_votes": 0,
      "publication_date": 20130720
    },
    {
      "title": "Good but not great!",
      "text": "Four days after receiving laptop the hard drive failed. Had to ship back to Acer, and took 14 calenders be repaired and shipped back. Overall a good laptop. I mainly purchased this laptop for graduate school. A laptop with similar features would have cost at least $200 more. Do not buy this laptop if battery life is a priority! I would not let my bad hard drive experience deter anyone from buying this laptop.",
      "rating": 3.0,
      "verified": true,
      "author": "Shaun",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Great laptop some malfunctions",
      "text": "the laptop is wonderful. about 95 percent of the time. Then it goes kablooyey for a little while and is good again. its very odd but anyway, great laptop for a college kid like me, wish it came with microsoft office, but oh well. the touch is very smooth and nice. all around its a pretty nice laptop.",
      "rating": 4.0,
      "verified": true,
      "author": "darebel",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "ABOVE THE REST",
      "text": "WE BOUGHT 2.....BEST TOUCHSCREEN ON THE MARKET AND THE PRICE IS RIGHT",
      "rating": 5.0,
      "verified": true,
      "author": "Kyla B. Hagen",
      "helpful_votes": 0,
      "publication_date": 20151208
    },
    {
      "title": "key already broken from keyboard",
      "text": "bought this in april; in october, a key broke with normal usage. I am disappointed in this although the laptop delivers in all other ways.",
      "rating": 4.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20131022
    },
    {
      "title": "Great laptop, hope it works great for long time",
      "text": "I just got the laptop three days ago, everything works perfectly, it makes practically no noise. However, I will wait a few months to update this review since some reviewers have described failures very soon after purchase. I've had a 17\" Apple G4 PowerBook for almost 8 years and it works perfectly even today. I just hope the Acer laptop keeps on working as it is today for at least a few years.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis A.",
      "helpful_votes": 0,
      "publication_date": 20130629
    },
    {
      "title": "It's great! But my wife has a toshiba with lower ...",
      "text": "It's great! But my wife has a toshiba with lower specs and it works faster than this one. From the start...",
      "rating": 4.0,
      "verified": true,
      "author": "Roy",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Not Dependable",
      "text": "I bought this laptop for my daughter for college and the hard drive died 14 months later. Guess what ? It has a one year warranty ! Acer would not budge on a new one. Oh well live and learn. Would not recommend !!!",
      "rating": 1.0,
      "verified": true,
      "author": "J. Braune",
      "helpful_votes": 0,
      "publication_date": 20140828
    },
    {
      "title": "Acer Aspire V5",
      "text": "Like the machine! I think once I master the Windows 8, I will love it. Still have a big learning curve to master all the bells and whistles. Nice display and love the backlit keyboard!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Keary-Taylor",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Week one - pretty nice",
      "text": "I have owned a gazillion laptops...over the last 30 years...and am a spec hound.... now more a reliability hound. I wanted a larger screen, back lit keyboard, i7 quad core with 8 gig ram. I want a large hard drive (photographer) and a clean looking machine. So far this has hit all the marks - will update in a month",
      "rating": 4.0,
      "verified": true,
      "author": "Ginny's Store",
      "helpful_votes": 3,
      "publication_date": 20130318
    },
    {
      "title": "Relly loved",
      "text": "This item is realy, realy, realy good! I loved, it's wonderful, very good, fast. The touch is great, everybody loves it, go crazy when they see. All the function are very good. It's realy wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Jair X.",
      "helpful_votes": 0,
      "publication_date": 20130929
    },
    {
      "title": "very good",
      "text": "well done. no problems, love the features, even the awkward moments of windows 8. capability pays off. I like it a lot",
      "rating": 5.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20130519
    },
    {
      "title": "very nice",
      "text": "It's wonderful. It takes less than a minute to login and logout. Every thing about this laptop is great except typing.. its jumps to (click) the cursor when I rest my hands on the laptop so I need to be very careful while typing..",
      "rating": 4.0,
      "verified": true,
      "author": "Muali Mohan Inala",
      "helpful_votes": 0,
      "publication_date": 20130729
    },
    {
      "title": "Good but could be better",
      "text": "I had to update the driver of the wireless as I lost connection of the wifi. The screen resolution could be better (it is not 1080)",
      "rating": 4.0,
      "verified": true,
      "author": "Sofia",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "Good Product",
      "text": "I choose this product because of the performance features, but I didn't like how does windows 8 works. But the computer is great.",
      "rating": 4.0,
      "verified": true,
      "author": "Joaquin",
      "helpful_votes": 0,
      "publication_date": 20130813
    },
    {
      "title": "It is good, but touchpad is not so sensitive as i tought it was",
      "text": "This computer is awesome, but I missed a touchpad more sensitive. Need to be improved, but for me it is working well.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruno Borges",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "Excellent machine",
      "text": "Beautiful and functional laptop with Windows 8. The touchscreen is very responsive and displays a great picture. Windows 8 is a mess, but that's not Acer's fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Jensen",
      "helpful_votes": 2,
      "publication_date": 20130315
    },
    {
      "title": "ACER is the only real player niow.",
      "text": "Great vidio great sound and excelllent value. Don't get windows 8 without a touch Screen. Very happy with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Ed",
      "helpful_votes": 0,
      "publication_date": 20130508
    },
    {
      "title": "Macbook Killer",
      "text": "If any of your not so smart friends try to talk you into a Mac tell them to shut up. This machine is the best I have ever owned. This machine is a beast and no crapple product can touch this computer. Thin, light weight, and fast with no heat problem. Set this computer on your lap and it runs like a top without burning your legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Corptek Jeremy",
      "helpful_votes": 0,
      "publication_date": 20130527
    },
    {
      "title": "Its Plastic, Battery life sucks & feels a lot Heavier than 5.5lbs",
      "text": "The laptop is plastic and does not feel too sturdy. The battery last about 3 hours before having to plug in and feels a lot heavier than 5.5lbs Overall, the device is ok. It performs well but the touch screen display does not offer a sharp image and at times does not respond, having to \"touch\" a few times before it executes the command. For the price, it's a decent machine.",
      "rating": 3.0,
      "verified": true,
      "author": "Nelson Martinez",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Everyone having WiFi issues with their new acer touchscreen Laptops",
      "text": "I wanted everyone having WiFi issues to know that's it's an easy fix. Go to the acer website [...] and download the newest Atheros wireless lan driver. Once you do that go to System Device manger in your control panel.Goto network adapters and look for the atheros driver goto to uninstall and reboot your computer. Then install the new driver 217v3 once you do that it should run smoothly. I haven't had any problems since I've installed the new driver. Watching movies on this computer is only average. If you look from the right or left the movie becomes unwatchable, you need to look directly in the center. They could have made the screen more vibrant!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 29,
      "publication_date": 20130304
    },
    {
      "title": "Defective by design.",
      "text": "Truly terrible. The wifi is unable to connect to a number of secured networks, and there is absolutely no fix or workaround. This defect should have made the computer a recall. The pre-installed McAffee garbage is worse than ever, and actually blocks Metro apps from updating, and causes a variety of other system anomalies. Thankfully it can be removed. The plastic case was warped just above the keyboard. The odd placement of the speakers on the bottom of the machine make for a very inconsistent audio experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger Luedecke",
      "helpful_votes": 2,
      "publication_date": 20130831
    },
    {
      "title": "its okay",
      "text": "it's okay. just laptop no any extra things. maybe a little bit expensive just fit my condition, but it's not very good",
      "rating": 3.0,
      "verified": true,
      "author": "violet",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "have it for 2 weeks and think of buying a different laptop already!",
      "text": "Windows 8 is killing me. No start buttom etc... the laptop's touchscreen doesn't work properly in many programms. It is a cheap rip of of the aplple mac book but not worth buying it!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ben Wasserstein",
      "helpful_votes": 0,
      "publication_date": 20130609
    },
    {
      "title": "Beautiful machine, wifi doesn't work",
      "text": "it's a shame that this beautiful computer has wifi that doesn't work. The wifi connection constantly dropped out. In doing some research online, this is apparently a common problem. Too bad, but I am not going to waste my time on messing with wifi connectivity when every other device in my home works fine.",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie Fink",
      "helpful_votes": 13,
      "publication_date": 20130214
    }
  ],
  "product_meta": {
    "title": "Acer Aspire V5-571PG-9814 15.6-Inch Touchscreen Laptop (2.0 GHz Intel Core i7-3537U Processor, 8GB DDR3, 1TB HDD, Windows 8) Silky Silver",
    "description": "Acer V5-571PG-9814 Touch Screen Notebook comes with these high level specs: 3rd Generation Intel Core i7-3537U Processor, Windows 8, 15.6-Inch HD Widescreen CineCrystal LED-backlit Display, Multi-touch screen, supporting 10 finger touch, Mobile Intel HM77 Express Chipset, NVIDIA GeForce GT 710M with 1GB of dedicated DDR3 VRAM, 8192MB DDR3 Memory, 1TB SATA Hard Drive (5400RPM), 8X DVD-Super Multi Double-Layer Drive, Multi-in-1 Digital Media Card Reader, 802.11b/g/n Wi-Fi CERTIFIED , Bluetooth 4.0+HS, Built-In HD Webcam, 2 - USB 2.0 Ports, 1 - USB 3.0 Port, 1 - HDMI Port, 1 - LAN/VGA Combo Port, 4-cell Li-ion Battery (2500 mAh), Up to 5-hours Battery Life, 5.51 lbs. | 2.5 kg (system unit only)\n\nAMAZON.COM",
    "rating": 3.6,
    "feature_bullets": [
      "Intel Core i7-3537U Processor 2.0 GHz (3 MB Cache)",
      "8 GB DDR3 RAM",
      "1 TB 5400 rpm Hard Drive",
      "15.6-Inch Screen, NVIDIA GeForce GT 710M",
      "Windows 8, 5-hour battery life"
    ],
    "specifications": {
      "Standing screen display size": "15.6 Inches",
      "Max Screen Resolution": "1366 x 768 Pixels",
      "Graphics Coprocessor": "NVIDIA® GeForce® GT 710M",
      "Chipset Brand": "Nvidia",
      "Card Description": "Dedicated",
      "Graphics Card Ram Size": "1000 MB",
      "Wireless Type": "802.11bgn",
      "Number of USB 2.0 Ports": "2",
      "Number of USB 3.0 Ports": "1",
      "Average Battery Life (in hours)": "5 Hours",
      "Brand": "Acer",
      "Series": "Aspire V5-571PG",
      "Item model number": "V5-571PG-9814",
      "Hardware Platform": "PC",
      "Operating System": "Windows 8",
      "Item Weight": "5.51 pounds",
      "Product Dimensions": "15.04 x 9.96 x 0.96 inches",
      "Item Dimensions  LxWxH": "15.04 x 9.96 x 0.96 inches",
      "Color": "Silky Silver",
      "Processor Brand": "Intel",
      "Processor Count": "2",
      "Computer Memory Type": "SODIMM",
      "Hard Drive Interface": "Serial ATA",
      "Hard Drive Rotational Speed": "5400 RPM",
      "Optical Drive Type": "8X DVD-Super Multi Double-Layer Drive",
      "Power Source": "Battery Powered",
      "Batteries": "1 Lithium ion batteries required.",
      "ASIN": "B00AVYPP7S",
      "Customer Reviews": "3.6 out of 5 stars62 ratings3.6 out of 5 stars",
      "Best Sellers Rank": "#120,493 in Computers & Accessories",
      "Date First Available": "January 21, 2013"
    },
    "categories": [
      "Computers & Accessories",
      "Laptops",
      "Electronics",
      "Traditional Laptops",
      "Computers & Tablets"
    ],
    "price": ""
  }
}