{
  "website_summaries": [
    {
      "verdict": "The HTC 8X is a powerful Windows Phone in a slim, pocket-friendly form factor.",
      "pros": [
        "Excellent balance of size and power",
        "Great design",
        "Sharp screen",
        "Killer Beats Audio"
      ],
      "cons": [
        "Photos are a bit washed out",
        "Lacks high-quality free navigation apps"
      ],
      "aspects": {},
      "publication_date": 20121113,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "I like this phone because the face is large and I ...",
      "text": "I like this phone because the face is large and I can easily see all the apps and messages. It is nice you can pin exactly what apps you want to the start menu (and can get the rest of the apps on another screen if you need them. The camera is a little cumbersome in its use (I am still not comfortable using it), but the photos are good. It is an unlocked phone, but there are many apps that can only be used with AT&T. Not a problems for me because most of these apps cost additional money and I would not use them anyway. Good phone for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150405
    },
    {
      "title": "Great phone.  Easy to use.",
      "text": "Love Windows 8 phones. This is a replacement for my wife's damaged phone. We each have the HTC 8X and love it. My wife keeps up to date with her Facebook contacts and we always know the weather. There are many other apps but we don't really use many of them. As a phone it works great and as a internet hot spot it serves us well. We have the new 10G plan and we tether our computers for internet access. As RVing volunteers we travel most of the country. ATT is available in most of the areas we work, many being remotely located. The ATT plan and the HTC phone is a great combination.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "Great phone with great value for the price",
      "text": "Turned out very well.... Nice build quality, feels great in the hand... I gave it to my teenage sister and I'm not worried about it breaking if she drops it or does God knows what else with it. In my experience it never lags even though it only cost $175. Was able to update it to Windows phone 8.1 by signing up as a developer (don't actually plan to develop anything... I just wanted to get the swipe keyboard and the voice recognition software updates... It's free) which I highly recommend if only for the much improved keyboard. Overall I highly recommend this as a decent sub-$200 phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20140613
    },
    {
      "title": "I liked the phone a lot but unfortunately I could not ...",
      "text": "I liked the phone a lot but unfortunately I could not sign in to my Microsoft accout. I took the phone to a microsoft store and they worked on it for 2 hours and couldn't fix it. So they gave me another phone and took my HTC. So after reading this you make the decision if you want to buy it or not.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike C",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "... used to have this phone with AT&T and I loved it. I left it on an empty shoebox ...",
      "text": "I used to have this phone with AT&T and I loved it. I left it on an empty shoebox on a dresser and it broke when the reverberations from a text message's vibrating was enough to make it fall of the box and down to the floor (don't let it do that without a case). I ordered this replacement, still for AT&T and it worked/ran/charged exactly the same",
      "rating": 5.0,
      "verified": true,
      "author": "Selden",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "I am in love with this phone.",
      "text": "I recently dropped the phone and broke the screen. (It wasn't the phone's fault, nothing could have survived that drop) I took it to a cell phone repair shop instead of buying something else because I loved this phone so much. I thought the adjustment to windows would be difficult but I'm actually very used to it already and don't think I will ever switch back to android or apple. This phone is fast and light and made incredibly well.",
      "rating": 5.0,
      "verified": true,
      "author": "Veronica Westfall",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Loved it for two days!",
      "text": "I actually loved the phone--at least for the two days that it worked. Phone suddenly froze and then displayed an error message. It would not turn off or on, and then it became exceedingly hot to touch. I am really worried about even returning it in the mail!",
      "rating": 1.0,
      "verified": true,
      "author": "P. J. Hazel",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Two thumbs now",
      "text": "Returning item. The customer service people were helpful and professional. The phone would go into emergency only service every time I received text.",
      "rating": 1.0,
      "verified": true,
      "author": "JILL P.",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "Not better than Nokia Lumia",
      "text": "If you want a good Windows phone, go with the Nokia Lumia. This phone is lacks basic apps like the Nokia camera and many others. The camera on this phone isn't good at all, coming from a Lumia 920 and Lumia 1020 owner. Nokia has better phones to me.",
      "rating": 3.0,
      "verified": true,
      "author": "Kamal",
      "helpful_votes": 0,
      "publication_date": 20140225
    },
    {
      "title": "My second windows phone and they were both CRAP!",
      "text": "I will NEVER buy a windows phone EVER again!! I bought two and neither lasted even a year!!! Just a cruddy product! Don't waste the money and the aggravation.",
      "rating": 1.0,
      "verified": true,
      "author": "michelle",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "I hate windows 8",
      "text": "This phone was awaful. I hate windows 8. Difficult to use. Sold it two weeks after I purchased it",
      "rating": 2.0,
      "verified": true,
      "author": "Marisa Stidam",
      "helpful_votes": 0,
      "publication_date": 20160405
    },
    {
      "title": "good",
      "text": "it was a great phone but my phone carrier would not switch it over so I had to send it back. I had no problems getting refunded my money back. They r great to work with. Thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra Burcham",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Great Phone",
      "text": "Great phone. it is exactly as it has been described. Easy to use and affordable. I am really happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "Three Stars",
      "text": "did not like it that much could not download apps.like whatsapp.",
      "rating": 3.0,
      "verified": true,
      "author": "Jose Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Better than his last phone",
      "text": "My son loves! Better than his last phone. (I phone)",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "great looking and solid.",
      "text": "I ordered this for my girlfriend, who prefers the windows phone. The screen is gorgeous, its quick, and it's a great phone. My only complaint is the buttons would be served better if they were raised a little more. It's hard to press them with a phone case on.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenny Caudill",
      "helpful_votes": 0,
      "publication_date": 20150211
    },
    {
      "title": "gave as gift",
      "text": "Got it for my fiance as an upgrade on his Pantech phone. The phone is lovely, we have to get a new SIM card since he still using the big Cingular one lol. So he hasn't made calls yet, but he was able to try out the Wi-Fi and our works great. The seller also sent free headsets and screen protectors. The USB cord was for a different model so it didn't fit. But Big Apple Cellular customer service is EXCELLENT!! Sent out a new one immediately. No issue. Extremely friendly and worth using.",
      "rating": 4.0,
      "verified": true,
      "author": "Patricia F.",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Phone freezes atleast twice everyday. Basic apps don't work and camera quality/focus is horrible.",
      "text": "The phone looks great but the functionality is horrible. From the very first day of use the phone would freeze completely and the only way to make it work again would be to reboot the OS. Many basic apps like youtube and pinterest wouldn't work on the phone. The camera has a weird yellow display (the factory setting) and would not focus. My friends have the same phone and they have never had any issues like this which makes me believe that the phone sold to me was a refurbished phone and not a new phone as promised by the buyer. Very disappointed by the seller and the phone.",
      "rating": 1.0,
      "verified": true,
      "author": "Crucfx",
      "helpful_votes": 0,
      "publication_date": 20140313
    },
    {
      "title": "These are the best phones we have ever had",
      "text": "These are the best phones we have ever had. In the beginning we struggled because they are AT&T phones and we are with another carrier. The strangest thing, we couldn't send or receive media content messages. After going in twice to our carrier with no luck, and them talking about taking extreme measures, a friend my husband works with showed him how to make some changes he found on You Tube and now we are getting our media content messages. The features of this phone are perfect for our needs, LOVE One Note and flashlight.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20141105
    },
    {
      "title": "Worst product ever",
      "text": "Worst product ever, company difficult to work with. The phone had a rebooting problem where it was not functioning. After the company finally \"fixed\" it, it still did not work. Having a lot of trouble getting my money back. Do not buy!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jane Theune-Baillargeon",
      "helpful_votes": 0,
      "publication_date": 20141014
    },
    {
      "title": "Excellent phone for the price",
      "text": "I just received my phone on Thursday and can hardly put it down. LOL I absolutely love it. IThe connection is crystal clear when talking to someone. There are a lot of features and a lot of apps you can download for me. The camera takes excellent pictures.I highly recommend this phone.It definitely is well worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Lala",
      "helpful_votes": 0,
      "publication_date": 20140308
    },
    {
      "title": "Looks like same phone I had",
      "text": "Looks like same phone I had, works the same. Even came with headphones. The beats audio rocks and you can run pandora for 8 hours or more.",
      "rating": 5.0,
      "verified": true,
      "author": "Squaggles",
      "helpful_votes": 0,
      "publication_date": 20150518
    },
    {
      "title": "The camera feature did not work. Battery would not ...",
      "text": "The camera feature did not work. Battery would not hold charge for very long. Had to use speaker for phone.",
      "rating": 3.0,
      "verified": true,
      "author": "Karen Kennedy",
      "helpful_votes": 0,
      "publication_date": 20140906
    },
    {
      "title": "Good!",
      "text": "The product is awesome, especially the screen is large enough to compensate a tablet. The built material is very good and the compactness is pretty decent, which gave me confidence that this can endure my sturdiness. Kind of sad that the product dropped over 30$ within 20 days of purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Siddhartha",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "Don't Bother",
      "text": "Do not buy this phone. I purchased it for my Wife. After taking it out of the box we tried to power it on and it was stuck in a continuous boot loop. We returned the phone and purchased an HTC One Mini.",
      "rating": 1.0,
      "verified": true,
      "author": "Hurricane",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "..",
      "text": "it wont for the life of me let me log in my Microsoft account anyone have any idea how to fix this?",
      "rating": 1.0,
      "verified": true,
      "author": "john",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Good quality and durability",
      "text": "When playing graphical games the phone gets hot during a short period of time but still operates well, also great battery life.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason Theodore",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Good phone.....",
      "text": "Love the phone.....only set back is no mms configuration for simple mobile. Really wish there was a way to resolve this issue FAST.....any suggestions ? ???",
      "rating": 3.0,
      "verified": true,
      "author": "Bee",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Like it!",
      "text": "The cellphone was in perfect conditions, only little scratches on the screen, but it works perfectly, the windows system is incredible, I like it. The camera and the functions of the cellphone also in perfect conditions.",
      "rating": 4.0,
      "verified": true,
      "author": "Gabriel Alvarado",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Perfect!",
      "text": "Love this phone . I had it before but lost it . so when I found this online I was a bit doubtful because it from online , but it perfect ! came a day early , came with charger , everything was good !",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandria",
      "helpful_votes": 0,
      "publication_date": 20140527
    },
    {
      "title": "Horrible sound quality and the mic doesnt work when I ...",
      "text": "This thing is a POS!!!! Horrible sound quality and the mic doesnt work when I talk to people. Waste of my hard earned money. Terrible buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean Piper",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Brand new phone",
      "text": "Phone was brand new, box wasn't even open, delivery quick and I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Highly disappointed!",
      "text": "Phone is defective and won't allow you to login to Microsoft! It keeps saying can't login at this time! I've even tried 5 different WiFi networks! Highly disappointed!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Its Cool.. working as a brand new device",
      "text": "Its Cool.. working as a brand new device.. but battery backup is going down, & there are few minor scratches on the screen. Even a very good device to go with.",
      "rating": 4.0,
      "verified": true,
      "author": "Purva HAttekar",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "excellent",
      "text": "I love this phone.this phone is awesome I would definitely recommend it to someone else. Just upgraded it to WP 8.1",
      "rating": 5.0,
      "verified": true,
      "author": "warren bolt",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Five Stars",
      "text": "Love it!! One of the best smartphones I have ever owned!",
      "rating": 5.0,
      "verified": true,
      "author": "ayjoshi",
      "helpful_votes": 0,
      "publication_date": 20151126
    },
    {
      "title": "So far so good",
      "text": "It's an unlocked phone, I haven't tried it internationally yet, but it came in excellent condition and I can't wait to try it out over seas!!",
      "rating": 4.0,
      "verified": true,
      "author": "Lette",
      "helpful_votes": 0,
      "publication_date": 20131223
    },
    {
      "title": "Great Phone",
      "text": "Great came in nice and clean. Just what I wanted. Just got to figure out how to use my internet.",
      "rating": 5.0,
      "verified": true,
      "author": "Cruz",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "Not the best unlocked phone.",
      "text": "Power button stopped working after 3 days. Design is cool though. There are much better options out there. I got a motorolla phone and it was great.",
      "rating": 2.0,
      "verified": true,
      "author": "Atul Chandra Adhikari",
      "helpful_votes": 0,
      "publication_date": 20140315
    },
    {
      "title": "very good",
      "text": "I love the windows operator system. The phone looks good Great purchase, not too expensive, i like it so far",
      "rating": 5.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "I dislike it",
      "text": "it is not , I was expected. The phone is not working properly. it gets freeze every morning. I don t even know why",
      "rating": 2.0,
      "verified": true,
      "author": "CLAUDE VERTUS JR",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "Five Stars",
      "text": "Nice phone I love it, my favorite sistem in phones",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Ramirez",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "awesome phone",
      "text": "I loved it and im going to get one for my son. I would live a white one. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Tenille vega",
      "helpful_votes": 0,
      "publication_date": 20140514
    },
    {
      "title": "Five Stars",
      "text": "Looks brand new, everything works as to be expected. (:",
      "rating": 5.0,
      "verified": true,
      "author": "Dorothy",
      "helpful_votes": 0,
      "publication_date": 20150114
    },
    {
      "title": "bad deal",
      "text": "Ordered \"new\" att phone. I got a verizon phone in an att case. Makes me doubt the \"realness\" of the phone. the refund was prompt, though.",
      "rating": 1.0,
      "verified": true,
      "author": "LPallatin",
      "helpful_votes": 0,
      "publication_date": 20140614
    },
    {
      "title": "This phone is NOT an AT&T Unlocked phone - is is a Verizon phone and incompatible with most AT&T mobile services",
      "text": "This phone is NOT an AT&T Unlocked phone as advertised by the seller it is a Verizon phone and incompatible with most AT&T mobile services. It boots up with a Verizon logo and Verizon programs NOT with AT&T services and logo. I wish there was a rating lower that 1 Star!! Email does not work on phone Photos by Text does not work AT&T Navigator and other AT&T services do NOT work. Very expensive mistake",
      "rating": 1.0,
      "verified": true,
      "author": "R Michael Parrotte",
      "helpful_votes": 0,
      "publication_date": 20140218
    },
    {
      "title": "Beautiful phone, hate Windows Tiles",
      "text": "Not a big fan of tiles, but the phone is one of my favorites and certainly on par with iPhone 5 and Galaxy S4. You just have to get used to a less than acceptable system user experience. Once you get into the commercial apps though, those are super elegant.",
      "rating": 4.0,
      "verified": true,
      "author": "Julius Wilpon",
      "helpful_votes": 0,
      "publication_date": 20130625
    },
    {
      "title": "Phone not unlocked",
      "text": "The phone was not unlocked as stated on the site. I bought this phone because I needed it unlocked for immediate usage on another phone network other than AT&T. Apparently; the depicted impression on the Amazon site was not factual. Resulting in my time being wasted and money tied down. As such I have to buy another phone from a different website.",
      "rating": 1.0,
      "verified": true,
      "author": "haffiz o momodu",
      "helpful_votes": 2,
      "publication_date": 20140319
    },
    {
      "title": "Works Perfectly. ONLY UNLOCKED FOR AT&T AND T-MOBILE.",
      "text": "Great phone, works perfectly. THIS PHONE IS ONLY UNLOCKED FOR AT&T AND T- MOBILE. Nice costumer service, friendly staff. Overall nice phone!",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 3,
      "publication_date": 20131120
    },
    {
      "title": "The most neat and well designed cover for 8x",
      "text": "I looked around in my office for other covers and this is indeed among the most neat and well designed cover for 8x. I like the dotted section for slip proof grip and the dual tone effect. The cover greatly improved on the bad button press experience of 8x",
      "rating": 5.0,
      "verified": true,
      "author": "Pankaj",
      "helpful_votes": 2,
      "publication_date": 20130701
    },
    {
      "title": "Excellent product, it covered all my expectations. I certainly can recommend this phone as the best I ever had .",
      "text": "Excellent product, it covered all my expectations. I certainly can recommend this phone as the best I ever had .",
      "rating": 5.0,
      "verified": true,
      "author": "thorxon",
      "helpful_votes": 4,
      "publication_date": 20130719
    },
    {
      "title": "Had to return because of defect",
      "text": "I had to return because it is not truly an AT&T device. Because of this my MMS messaging did not work and I could not ready any group messages I was in or send/receive picture messages. After 1.5+ hours on the phone with HTC and AT&T customer support the recommendations from both were to return this item.",
      "rating": 2.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 5,
      "publication_date": 20130823
    },
    {
      "title": "not happy",
      "text": "phone did not have a MEID # so could not be activated. # was not any where to be found.",
      "rating": 1.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20140424
    },
    {
      "title": "HTC 8X",
      "text": "First of all I love this phone. Windows 8 easy to use. Not many apps but enough for me. The problem is, if you get one from anywhere but the US there is no 4G on the phone. I use ATT but can only get 3G. The phone I received was branded Telestra not ATT. It was unlocked and worked fine but be aware of this.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 9,
      "publication_date": 20130924
    },
    {
      "title": "Ok",
      "text": "My phone may turn off and not turn on at all s, olo has lasted me 8 months and no longer works please i need to apply the warranty. I want you to help me solve this drawback. greetings, Byron Tobar Cuesta.",
      "rating": 1.0,
      "verified": true,
      "author": "Pacificard",
      "helpful_votes": 0,
      "publication_date": 20131223
    },
    {
      "title": "great phone",
      "text": "I love this phone, windows 8 is prettty cool to use. I wish it was more popular among the public like the i phone, and samsung phones.",
      "rating": 5.0,
      "verified": true,
      "author": "Hassan Marrar",
      "helpful_votes": 2,
      "publication_date": 20130707
    },
    {
      "title": "Great purchase!",
      "text": "What a great phone! Came brand new and wrapped perfect like we just got it from the store! My grandfather didn't want a new high tech phone and we wanted to get him something he could easily understand. After reading the reviews for this item I was quickly drawn in that this would be perfect for him. It's very self explanatory he is having the best time learning it. On the screen everything it lacked with pictures which makes it easy for him to find anything! Great phone and even greater service ordering from these guys!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Great feel and size, some of the technology could better",
      "text": "pros - slim phone, easy to handle with one hand - the windows interface is user friendly - fairly durable, made of good grip material cons - the screen wraps to the edge, so if you at all, the screen cracks - because of the wrapped screen, it's more expensive to replace the screen than the entire phone - gets stuck in airplane mode and you cannot fix this - this happen to me after a few years and there is absolutely no way to fix this - I ended up switching to Galaxy S6",
      "rating": 3.0,
      "verified": true,
      "author": "Leah Deitrick",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Nice phone",
      "text": "This was my son's first Windows Phone, so it did take some getting used to, but he has enjoyed it and I like tge windows, My Family option where I can monitor his activities. It's a sleek phone & easy for him to keep in his pocket without bulkiness. His last name is Blue, so he personally loves the color as well.",
      "rating": 4.0,
      "verified": true,
      "author": "teacherprof",
      "helpful_votes": 0,
      "publication_date": 20140601
    },
    {
      "title": "This phone is junk",
      "text": "I didn't want to give a star but I had to don't know why. I got this phone about 2 week's ago and the screen is going White on it I have a HTC phone I love it but the HTC Windows phone is junk so learn from my mistake don't get this phone and the seller will not get back to you so I guess I have a brand new phone that is junk. So don't get this phone if you do you will have a piece of junk to",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Nation",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "So far it seems nice.",
      "text": "This phone is just as beautiful as the picture shows it to be. I cant comment yet about how it operates because I havent been able to use it as yet because my current sim card cannot fit the slot in the phone, so I have to buy a new sim. One concern I have is that the pkg shows the phone as locked whereas the details had said it was unlocked which I expect it to be. Once I buy my new sim card I will know for sure about that.",
      "rating": 4.0,
      "verified": true,
      "author": "GCStargirl",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "It's a good developer platform but useless as a phone",
      "text": "I bought the phone two years ago as a developer platform. I decided to activate it through AT&T with a GoPhone sim card I also bought from Amazon. AT&T stated the phone was black listed and could not be activated. Be careful when you buy an unlocked phone. It's a good developer platform but useless as a phone. Four star for the phone minus one for the seller.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Okkerse",
      "helpful_votes": 0,
      "publication_date": 20151124
    },
    {
      "title": "Buyer Beware: Not refurbished as advertised...",
      "text": "Phone was bought as a used/refurbished. Unfortunately it does not stay connected to networks wifi/mobile and reboots frequently. Nice form factor and features but hardware failures are nothing short of annoying...",
      "rating": 2.0,
      "verified": true,
      "author": "R Dean",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Top Rated Cell Phone",
      "text": "One of the best rated phones on the market, bought it for my daughter, but she got bored with it so we sold it, can not say anything bad about it, other then yep it is square",
      "rating": 5.0,
      "verified": true,
      "author": "WHITEPANTHER",
      "helpful_votes": 0,
      "publication_date": 20140711
    },
    {
      "title": "Great phone",
      "text": "Awesome pictures but the APP's are limited.... They do not have as good of apps and many of the existing apps do not work like intended.",
      "rating": 4.0,
      "verified": true,
      "author": "Megaman1",
      "helpful_votes": 0,
      "publication_date": 20140521
    },
    {
      "title": "wonderful product with easy service",
      "text": "This product is fabulous. I ordered 2. One blue. One yellow. My original SIM cards were standard size so my husband cut them down. They take micro SIM cards. As long as you don't cut the metal on the SIM card your in business. At first we had them in upside down. Once we put them in correctly and gave them a minute to load up....badabing....we had the service that we had on our previous phones. These phones run 4G and they are fast and fabulous. I will purchase more in the future. Also this particular seller was FAST I received them within 48 hours! I LOVE these phones and so does my husband!",
      "rating": 5.0,
      "verified": true,
      "author": "HitEmGitEm ",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "REALLY SLEEK!",
      "text": "I REALLY LIKE THIS PHONE ,BUT IT CAME WITHOUT A CHARGER. WHEN I ATTEMPTED TO PURCHASE ONE ,I WAS TOLD IT WAS DIFFICULT TO FIND ONE. IWAS TOLD IT WAS NOT A POPULAR PHONE.STILL I'M HAPPY WITH IT",
      "rating": 4.0,
      "verified": true,
      "author": "Bargain finder mom",
      "helpful_votes": 0,
      "publication_date": 20140204
    },
    {
      "title": "Five Stars",
      "text": "Daughter loves this phone, only issue with MMS messages not going thru.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "Glorious!",
      "text": "Good phone. My second purchase. It's definitely old but it'll do its job right.",
      "rating": 5.0,
      "verified": true,
      "author": "Biftek",
      "helpful_votes": 0,
      "publication_date": 20150808
    },
    {
      "title": "Didn't work.",
      "text": "Phone worked the first day, but when we went to update it, it shut off and wouldn't turn on. We sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Stormy",
      "helpful_votes": 0,
      "publication_date": 20151005
    },
    {
      "title": "LOVE IT",
      "text": "Phone came exactly as promised. Very intuitive and easy to use. No complaints here. It is unlocked. This is a 16GB phone, not 8GB as in the description so that was a pleasant surprise.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonAddict",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "pretty good phone",
      "text": "This is my first windows phone after switching from Android. And I loved it!! It was easy to get used too. Enough Apps for me. Im not a crazy app person though. Customizing the Tiles to fit your personality AWESOME!!! And it's cute!!!! I didn't give it a five only because it is made with Gorilla glass and it slipped from my purse and the screen shattered!!! I can't even get a professional to fix it they said too complicated so now I have to buy a whole new phone :( The screens alone for it are starting at 80 dollars but if a profession can't do it I'm not wasting my time :/",
      "rating": 4.0,
      "verified": true,
      "author": "Christina Fair",
      "helpful_votes": 0,
      "publication_date": 20140408
    },
    {
      "title": "excelent!!!",
      "text": "I buy this phone!!! Is really Good same like the picture, work good and is like new I love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Hernandez",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Perfect in every way",
      "text": "Item as described. Perfect in every way, thank you FIVE STAR SELLER",
      "rating": 5.0,
      "verified": true,
      "author": "OLE",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "excellent",
      "text": "comprehensive application in question, has a large and compact when taken into the hand, pretty useful and complete operating system, no complaints, excellent",
      "rating": 5.0,
      "verified": true,
      "author": "Andreina Vicuña",
      "helpful_votes": 0,
      "publication_date": 20140311
    },
    {
      "title": "life saver",
      "text": "Crushed my phone while on scene with an ambulance and had no insurance cause they charge u all kinds of money for a new phone...awesome to find this for cheaper then insurance cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. OZ",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Four Stars",
      "text": "It was an ok phone. I just can't do another windows phone. So not for me",
      "rating": 4.0,
      "verified": true,
      "author": "tomekia robinson",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Three Stars",
      "text": "It started out okay, but has issues hanging within a year of use.",
      "rating": 3.0,
      "verified": true,
      "author": "David W.",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "My son loves it!!!",
      "text": "My son lost his iPhone and whined when I ordered this no contract phone because it wasn't apple UNTIL it arrived. He absolutely loves it, the tiles, the sturdiness, the color, and the over-all look of the phone. He actually got in trouble for staying up all night personalizing it just for him. Phone came with a cute purple case, but it didn't fit too well, so we ordered a hybrid kickstand case for only about $4 or $5 bucks, which is so convenient when he watches Netflix. Thanks for saving us with an awesome & affordable NO contract phone!",
      "rating": 5.0,
      "verified": true,
      "author": "firstlady",
      "helpful_votes": 2,
      "publication_date": 20140428
    },
    {
      "title": "Five Stars",
      "text": "awsome phone unlocked as advertised unfortunatly it got stolen original boxing and accesories",
      "rating": 5.0,
      "verified": true,
      "author": "Alfredo herrera",
      "helpful_votes": 0,
      "publication_date": 20141019
    },
    {
      "title": "DID NOT WORK!",
      "text": "4/26/14 FINALLY got my phone in the mail and I charge it and boot it up and it wont boot to home screen! Everything looks brand new but the phone will not boot up so I cannot even use it. I have contacted the Seller and lets see how fast this can be replaced or how fast my money can be returned to me. I just hope I am not going to have to wait another week for a new phone!",
      "rating": 1.0,
      "verified": true,
      "author": "Hansen Valladares",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "thank for making me so happy",
      "text": "excellente phone and the price, thank for making me so happy",
      "rating": 5.0,
      "verified": true,
      "author": "julio angel rosario",
      "helpful_votes": 0,
      "publication_date": 20150122
    },
    {
      "title": "love it!",
      "text": "Sleek, simple and sober, I really ecstatic to have this phone. Really good. it never hangs just that slightly less apps because of windows platforms.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Red",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "Great Service",
      "text": "I received the dvd \"HTC 8X Windows 8 AT&T Phone (8GB) - Blue Color - UNLOCKED - NO CONTRACT...\" on schedule and it was in excellent condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Millicent Shields",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Screen is SUPER FRAGILE!!",
      "text": "I chose this phone twice because I love the system, ease of use, awesome pics, great sound. decent battery life and looks good too. I did not get a third one when my second phone was toast from a hug- my screen cracked. I even had a protective cover this time. It said there was a guarantee...It has been 3 weeks and I still have not heard back. I paid $155. The best quote to have it sent in and fixed was $139.",
      "rating": 1.0,
      "verified": true,
      "author": "Cheryl Pyles",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "No SIM card error and random reboots",
      "text": "When I got the phone, phone worked great. Well that changed as of last night. The phone keeps saying no SIM card detected and the phone reboots multiple times per day. I'm not satisfied with this and it seems to be a defect with this model. Google htc 8x problems and you'll see!!",
      "rating": 1.0,
      "verified": true,
      "author": "Willard31",
      "helpful_votes": 0,
      "publication_date": 20140628
    },
    {
      "title": "Confued",
      "text": "When I got this phone it wasn't as described. It was Verizon Wireless instead of at&t. The charger did not work and it was a blackberry charger. However the phone was unlocked, shipped fast, and pretty nice. Just confused on why it came like that.",
      "rating": 4.0,
      "verified": true,
      "author": "FranchescaC",
      "helpful_votes": 0,
      "publication_date": 20130911
    },
    {
      "title": "Excellent Condition & Service",
      "text": "Just confirm color, if with or without box & charger. Otherwise, the whole condition of the device is great. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Iman Ahmed",
      "helpful_votes": 2,
      "publication_date": 20130923
    },
    {
      "title": "Very good looking and stylish windows phone",
      "text": "The phone is sleek and good looking. It is unlocked and can be used with any service provider. Only problem I have was Network sharing not working which is no big deal. Iong batter life as well. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kamesh K",
      "helpful_votes": 0,
      "publication_date": 20140203
    },
    {
      "title": "Great Phone",
      "text": "very light and love the Windows Phone UI! The only thing I do not like is that in direct sunlight it is very hard to see the screen.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130704
    },
    {
      "title": "It was exactly as descibe and looks brand new",
      "text": "It was exactly as descibe and looks brand new i love it and i will buy more from ! ;)",
      "rating": 5.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 0,
      "publication_date": 20131009
    },
    {
      "title": "My favorite HTC phone ever",
      "text": "It is amazing that its touch screen is so soft, so does the back of the phone. It is very easy to operate and unlocked to any Micro SIM cards, convenient to take it and use in different places. I really love the camera, it is so clear and efficient. Love it so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Rouge.Tania",
      "helpful_votes": 6,
      "publication_date": 20130321
    }
  ],
  "product_meta": {
    "title": "HTC 8X 8GB Unlocked GSM Windows 8 Smartphone - Blue",
    "description": "Windows 8 Phone Dual Core 1.5 Ghz S4 Processor Integration with XBox 8GB Internal Memory & 8 Megapixel Camera AT&T Retail Package - Unlocked for use with ALL GSM Networks. NOTE: PLEASE DO FACTORY RESET TO TROUBLESHOOT ISSUES",
    "rating": 3.7,
    "feature_bullets": [
      "Windows 8 Phone",
      "Dual Core 1.5 Ghz S4 Processor",
      "Integration with XBox",
      "8GB Internal Memory & 8 Megapixel Camera",
      "AT&T Retail Package - Unlocked for use with ALL GSM Networks",
      "Unlocked cell phones are compatible with GSM carriers like AT&T and T-Mobile as well as with GSM SIM cards (e.g. H20, Straight Talk, and select prepaid carriers). Unlocked cell phones will not work with CDMA Carriers like Sprint, Verizon, Boost or Virgin."
    ],
    "specifications": {
      "Package Dimensions": "5.9 x 4.2 x 2.7 inches",
      "Item Weight": "4.6 ounces",
      "ASIN": "B00AUWS9VA",
      "Item model number": "htc8xbl",
      "Customer Reviews": "3.7 out of 5 stars169 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#250,967 in Cell Phones & Accessories",
      "Is Discontinued By Manufacturer": "No",
      "OS": "Microsoft Windows Phone 8, upgradeable to WP8 GDR3",
      "Wireless communication technologies": "Cellular",
      "Additional Features": "Camera, Dual-core-processor, Smartphone",
      "Other display features": "Wireless",
      "Other camera features": "Primary: 8 MP, 3264 x 2448 pixels, autofocus, LED flash, Geo-tagging, touch focus, Video 1080p@30fps|Secondary: 2.1 MP, 1080p",
      "Form Factor": "Smartphone",
      "Colour": "Blue",
      "Manufacturer": "HTC",
      "Date First Available": "December 30, 2012"
    },
    "categories": [
      "Cell Phones & Accessories",
      "Cell Phones",
      "Unlocked Cell Phones",
      "All Departments"
    ],
    "price": ""
  }
}