{
  "website_summaries": [
    {
      "verdict": "Stands out for being very powerful, even compared to more expensive models.",
      "pros": [
        "OnePass brush roll technology ensures dirt and debris is picked up the first time",
        "A huge 2-liter canister means you have to empty it less often",
        "A lightweight option at 15 lbs"
      ],
      "cons": [
        "Users say the hose could be longer for more convenience"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "If you are watching your budget, you won't find a better choice – offers what consumers love about Bissell at an unbeatable price.",
      "pros": [
        "A lightweight model at a value price",
        "Its impressive feature set includes a large dirt canister, deep rotating brush system, TurboBrush tool, and washable filter"
      ],
      "cons": [
        "Owners indicated that the tool attachment hose would be more efficient if it were longer",
        "The power cord is also 5 feet shorter than our Best of the Best pick"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A great choice for the homeowner that doesn't have pets or a lot of dirt coming through the door.",
      "pros": [
        "Has a filtration system that makes this vacuum particularly good for people with allergens"
      ],
      "cons": [
        "Won't work as well on hair as more expensive options"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is the second one of these vacuum cleaners that ...",
      "text": "This is the second one of these vacuum cleaners that I've ordered and it broke the exact same way as the first. The vacuum itself is very strong and works well however BOTH of them had a piece break in the exact same place blowing air & dust instead of sucking it in. It's hard to explain however I ordered a second one thinking that it was a fluke or something that we did to the first that caused the damage however the second one has the exact same break. You can see it in the image.",
      "rating": 1.0,
      "verified": true,
      "author": "Tania Kowalski",
      "helpful_votes": 318,
      "publication_date": 20170523
    },
    {
      "title": "Small cord, big clunky, annoying....",
      "text": "I was so excited to get a new vacuum. This one had such a high customer review rating I went with it. Compared to my last vacuum which was a Hoover WindTunnel Air Bagless Upright Corded Lightweight Vacuum Cleaner UH70400 this vacuum is clunky. Worst of all the cord is not long enough to vacuum stworooms without having to move the cord to anew outlet. Ugh. Its going toe annoying to ship this thing back. In my opinion not as good as the reviews would have you believe.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber Avalos",
      "helpful_votes": 4,
      "publication_date": 20181108
    },
    {
      "title": "Poor Man's Dyson.",
      "text": "Very effective cleaner. I looked into the passages and there are two centrifugal separators, 1 washable sponge filter, and then a final fiber filter. After using for several months the fiber filter is still very clean, meaning the separators and washable filter are doing their job. I do agree with several reviews that the vacuum overheats. I avoid the overheating by taking a 10 minute break between every 200 sq ft, which happens to be approx when the canister gets full. For the price it's a great value for small dwellings due to the Dyson-like features.",
      "rating": 5.0,
      "verified": true,
      "author": "Em",
      "helpful_votes": 6,
      "publication_date": 20170708
    },
    {
      "title": "Too difficult to clean the filters",
      "text": "We shouldn't have to bend over to turn it on -- the switch is too far down. It's too difficult to clean the filters. The tank itself is easy to empty. An inner filter is easy to twist off, but tricky to twist back on. I haven't figured out how to clean all the filters without removing screws. It shouldn't be necessary to remove screws to clean. That said, it does a good job sucking up pet hair and dirt, and on bare floors, it doesn't shoot stuff out the back. If this machine were easier to clean, and if the on/off switch was higher up, I'd probably give it 5 stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Pam Gearhart",
      "helpful_votes": 5,
      "publication_date": 20180424
    },
    {
      "title": "Less than 2 years in and it’s useless",
      "text": "This vacuum is used at my work. Carpet tiles and maybe for 500sqft office building. Mostly loose dirt and sand that I’m having to vacuum. In the past year I’ve noticed less suction and more hitting my ankles when I vacuum, so I’m constantly having to go over everything three or four times. There are occasions, random, that I will give a haircut and vacuum the hair and it will stuck in the hose which makes the suction power even less. For $100 I expected a little more.",
      "rating": 2.0,
      "verified": true,
      "author": "annaleah",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "This vacuum blows my balls off!",
      "text": "Bissell came up with a winner! Having a Dyson D.C.-12 that recently broke (motor), I had the budget for an inexpensive vacuum, but needed it to handle carpet, as well as tiled floors, wood panels, and throw rugs. One-pass gets nearly everything! For steps, there's a brush with a separate motor that works better than the Dustbusters of old! To top things off, it's easy to clean and very lightweight. The bottom design also prevents it from grabbing cords and shoelaces, which often get chewed up in other vacuums. Great purchase for my first time researching vacuums!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Tennisballface",
      "helpful_votes": 4,
      "publication_date": 20161219
    },
    {
      "title": "This is AMAZING",
      "text": "Maybe I've only had really cheap vacuums. Maybe I was long overdue for a new vacuum. Maybe I was feeling rather spoiled for having gotten a new vacuum. Either way, this vacuum is amazing. It's quiet, it sucks up all of the pet hair (I have a white Chihuahua that sheds like there's no tomorrow), & there's a place for all of the attachments on the vacuum that it comes with. The cord is super long, & I swear I went over certain areas of my rug just a couple of days prior with a vacuum that I borrowed from someone else, & this vacuum sucked up at LEAST an entire cup of dirt. I'm ecstatic, & I'm in love.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "It's a bissell",
      "text": "This is not a dyson. This is not a shark. It's a good vacuum cleaner for a 400 sq foot home. It's probably good for a home twice as large if there are no pets. My biggest problem is that when I first turn it on, it kicks out a ton of dust. It seems to spit out dust very easily, but it does suck everything out of the carpet, and it's very easy to empty. It's not a great vacuum, but I got it for like $75, and that's well worth it.",
      "rating": 3.0,
      "verified": true,
      "author": "Aaron Dennis",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Scary vacuum",
      "text": "I haven't had this vacuum even for a year yet, and it all of a sudden caught on fire. I had always emptied the canister and taken good care of this vacuum. Total shock when this happened. I only have one carpeted room in the house, master bedroom, and vacuum that room every other day. There is absolutely no reason why it would just catch on fire with so little use. It did really work well and handled nicely before the incident. But, it always was very loud. Will never buy this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "bombaycat",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "Wonder vacuum, pet home, good suction",
      "text": "Before buying this vacuum I read hundreds of reviews and settled on this one. I have a cat and also tons of indoor plants so I am constantly cleaning up dirt and kitty litter. This is the best vacuum I have probably ever used, the bagels system is wonderful, attachments work great, and suction power is super strong. I use it twice a week and have been for 3 months and haven’t noticed it losing suction or anything. Just recommended it to my sister and she also purchased it. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 2,
      "publication_date": 20181020
    },
    {
      "title": "Best vacuum I've ever owned!!!",
      "text": "I've owned this vacuum for over two years. The suction is still AMAZING!!! Both the regular suction and using the hose are insanely powerful. Cleans just as it did day one. I haven't had anything break on me or cease to function correctly in these past two years. The extra mini vacuum attachment works wonderfully as well. I was so impressed with this vacuum, that I bought my mother one as well, and she absolutely loves it. She was astonished at how well it sucks when she used mine and wanted one for her own.",
      "rating": 5.0,
      "verified": true,
      "author": "Borsalino A.",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Bissell's beater bars always break!",
      "text": "This is the second and last Bissell my husband and I will own. We purchased it at the end of November 2015 and the beater bar bit the dust (pun intended 😁) at the beginning of March 2017. It worked really well for the first month that we had it. We vacuum the house once a week and spot clean around my birds and bunnys cages every few days. The majority of my vacuuming is with the wand. I cleaned the beater bar of hair after I vacuumed every single time since the last Bissell we had the beater bar stopped working on it, too. Not impressed, Bissell! Not worth my time or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170508
    },
    {
      "title": "Bissel Vacuum",
      "text": "The suction power on this vacuum is great! (Writing this review after owning for 4 months). I was shedding my hair all over the house and with a new baby I needed a better vacuum for the job. This has pulled through in that area. Where it isn’t ideal (the reason I can’t give it 4 or 5 stars) is because the hose always comes unattached as I’m using it and the attachments for length are sad. You only have about 2 feet of stretch in the hose which makes it very hard to reach in a lot of places.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "powerful and easy to clean",
      "text": "I vacuumed a 8x8 area and couldn`t believe how much it picked up compared to my old Kenmore, so I vacumed the whole 15x15 carpet and thought it was pretty clean but I couldn`t beleive how much dust and dirt this vacuum picked up, it easy to empty and clean, the only thing is I wish the power buttom was up on the handle and the chord came out higher on the handle so I wouldn`t run it over, if you have a old vacuum you have no idea how much suction it`s lost.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 5,
      "publication_date": 20170305
    },
    {
      "title": "Good suction power but messy with hair",
      "text": "Bought it 3 years ago because my last one's belt broke and decided to buy a new budget vacuum. It sucked full container the first time(after a week using the old one) I realized how much dirt and dust I was missing. Here a pic of one from this week...I vacuum every 2 weeks now and still collect this much of dust from the entire house. One thing I hate is that hairs get tangled in the attachable tubes easily when I use it on stairs and sofa~I heard the sealing doesn't exist but my nose doesn't feel anything so whatever it's only $79",
      "rating": 4.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Really Picks Up the Cat Hair!",
      "text": "I'm very happy with this purchase. It is so lightweight that you hardly know you are vacuuming. The noise level is not bad; at least it doesn't bother me at all. It really picks up cat hair. I have a long-haired Persian with much cat hair to vacuum, and this machine readily picks it up. It's so easy to dump the container and put back on the vacuum. And - it really DOES pick up the dirt and hair in one swath across the carpet. The handle lowers easily while vacuuming to get under coffee tables and other furniture. I believe it's as good as any \"pet hair\" vacuum on the market--maybe better--and costs much less.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith G.",
      "helpful_votes": 2,
      "publication_date": 20180328
    },
    {
      "title": "Amazing vacuum!",
      "text": "Like many of the other reviews, we vacuumed with our old one and then tried this one. It was amazing and disgusting all at the same time. We had to empty the canister and vacuum the same room again and still pulled another 1/2 canister of dust and hair (2 small dogs) out of the carpet! I am extremely allergic to dust (I have to wear a respirator to vacuum or dust) and was constantly vacuuming but my allergies never got better. We even had all our ducts cleaned and 6months later, I still wasn't getting better. Now, one month after buying this vacuum, I'm only dealing with seasonal allergies and dust allergies are down to a minimum.",
      "rating": 5.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Much improved cleaning with this",
      "text": "I upgraded to this after using the vacuum my roommate had in our place from I dunno, 1987? So much better. The house has not has such a good vacuuming ever, I had a ball of debris that had been in the house for years this finally sucked it all up. Good price, good attachments, I used the hose for corners and it was good, emptying is easy, putting together isn't bad either. I recommend this, I've only used it twicw but it is much better than the relic I used in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "incognito",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Not good for fine particles",
      "text": "I’ve had this vacuum for a few months now- the only downfalls are dirt and dust gets accumulated right where it dispenses into the canister- which just means it needs emptied with every use which is fine- but recently I had to vacuum up baking soda my little one spilled all over and this vacuum did not do well with the fine particles. I had to use this vacuum and then different one afterwards as this one just shot the fine particles behind the vacuum! I do really like the attachment that came with it though.",
      "rating": 3.0,
      "verified": true,
      "author": "bree",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "This is a 100% worth it!",
      "text": "I have two kids and two cats so as you can imagine, things can get a little dirty around here. I've had a another vacuum that I've been using for the past 6 months or so. I thought it was doing the trick it seemed to clean up any mess that I ran it over. Boy was I wrong! I filled up a full canister and another half a canister on the first run in only two rooms and the stairs. I am so impressed and thankful that I came across this vacuum. I truly hope that it can last for at least a year!",
      "rating": 5.0,
      "verified": true,
      "author": "bohochiick",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "AMAZING!",
      "text": "I have to say WOW! I have hard wood floors and two cats...I also have the Roomba who cleans at night and I can see all the dust and cat hair that the Roomba cleans....but in addition to the Roomba helps, I groom almost every day and before passing the wet mop. So, I just try the Bissell vacumm in just a little area, in the picture from my hand to the left.... basically the walk from the door....and you can see in the second picture how much cat hair the Bissell clean. I am very impressed and can't wait to keep my house better clean. Oh is light weight!",
      "rating": 5.0,
      "verified": true,
      "author": "Giny161718",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "I didn't realize my carpet was so disgusting.",
      "text": "My old vacuum burned out so I needed to get a new one. Based on product reviews and price we went with this one. It arrived, my husband put the peripheries together and we decided to give it a go because, quite frankly our carpet was disgusting and in dire need of some attention. Holy hell I didn't realize how much our old vacuum was leaving behind. With one pass there was a marked difference. I almost wouldn't have believed it if I hadn't seen it with my own eyes. Three passes later we had pretty much accumulated a whole other cat out of the carpet. Never giving this vacuum up.",
      "rating": 5.0,
      "verified": true,
      "author": "A.J.",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Great for dirt, dog hair, and debris",
      "text": "Love this vacuum! Bought it to replace an older and cheaper Bissell and it is not a disappointment. The suction strength is fantastic. It picks up dirt, leaves, and dog hair with no problem from my thick carpet. It is very user friendly and easy to clean and empty the dirt. I was a little surprised that the power button is not a foot pedal, but otherwise everything is as it should be. The noise level is acceptable, especially considering how hard it is working. I feel much more comfortable letting my infant crawl around after vacuuming now.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiner",
      "helpful_votes": 3,
      "publication_date": 20170409
    },
    {
      "title": "If you only knew what your old vaccuum left behind..",
      "text": "WOWZA!! We moved into a new rental house and with our move we purchased this vaccuum. I am beyond thankful that we did.. They supposedly vaccummed and shampoos before we got here.. the floor looked clean enough, but I'm a little OCD and decided whay the heck.. I'm going to vaccuum it before we move our stuff in. OH MY STARS THIS THING... a five star rating isn't high enough. This thing pulled up canister after canister of dust and dirt. I have never been more satisfied with a vaccuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Fantastic vacuum",
      "text": "By far the best vacuum I have ever owned. The suction is phenomenal. My carpet looks brand new every time I vacuum. Only cons are too heavy for a small 60yr old person to lift. Also the center piece in collection section gets particles stuck between it and the casing so have to remove center piece to clean. I hate I have to remove each time (because the pick up is so fantastic). It can be difficult to put back into place",
      "rating": 5.0,
      "verified": true,
      "author": "TST",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Bad vacuum if you use attachment tools",
      "text": "Good vacuum but I'm rating it low for one really annoying feature which also damaged my carpet. Bissell charts all the different features to compare models easily. EXCEPT, on this model, the spinning carpet brush never turns off, even when I'm using the other attachment tools. It damaged my carpet because I was using an attachment and didn't realize the carpet brush was still spinning. I now know that I could have gotten the turn-off-carpet-brush feature in the slightly more expensive model. So, bad job, Bissell. Even if you usually suck in a good way. Would not buy again. Super inconvenient to flop the vacuum on its side every time I need the attachments.",
      "rating": 2.0,
      "verified": true,
      "author": "A B",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "HOLY SMOKES!",
      "text": "Like so many other reviewers I had no idea how bad my previous vacuum was until I vacuumed a small square of my room and saw an unimaginable amount of dust and hair pulled up! I have since vacuumed my room twice just out of enjoying knowing how clean it can get. This vacuum is a steal and am so glad I bought it!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Kelly",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "Better than you would believe!!",
      "text": "I bought one of these for my monster-in law. She said \"this thing is eating my carpet\" She was horrified at how much was in the hopper when she was done. It wasn't eating the carpet, it was eating the dirt that the previous vacuum was missing for years. I bought two of these for home. One for upstairs, one for downstairs. Here it is 4 years later, the both still work excellent and need to be cleaned a lot.... BECAUSE THEY DO SUCH A GREAT JOB!!!!!!! I would give the three of them 10 Stars if I could!!",
      "rating": 5.0,
      "verified": true,
      "author": "Marshall B",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "This vacuum worked well for the first few months I ...",
      "text": "This vacuum worked well for the first few months I had it. It is a cheap vacuum that is made from cheap products. You get what you pay for in terms of price. You will need to wash the filters after every 3/4 uses. You will need to empty it frequently. It is a bit clunky. The attachments seem cheap. Maybe my house is really dusty, who knows, but sometimes, dust will come out of the vacuum when I start it. Literally the opposite of what it’s supposed to do. My overall recommendation would be to pay a little more for something that will last you longer. I will try a different brand this time around.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle Bossler",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Works great",
      "text": "Honestly I'm kind of disguted. We had a vaccum, and knew it wasn't doing the best job of picking up, but didn't know how bad. Assembly on this was pretty easy, took less than 5 minutes. Pretty durable but lightweight as well. It's also not very loud for a pretty larger size vaccum. But the suction.... this thing picked up so much dort and hair I think my carpet got a whole shade lighter. I'm disgusted because I've been walking on all of that dirt. And even though it's not a very expensive vaccum, it definitely works like it's worth a million bucks. Excited to see how it holds up .",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Works pretty good - we've had it for a bit now",
      "text": "Works pretty good - we've had it for a bit now. Not a huge fan of the 'turbo brush'.. It's loud and isn't reaaaallly that big of a convenience. We love the dump canister - SO EASY!! It does fill up pretty quick though (but that could be due to our pets...) Speaking of pets, it works GREAT with pet hair. Only complaint is there really isn't a good way to carry it!! it's so awkward when my wife has to carry it upstairs or down into the basement. Normally, I just do it for her because it's so awkward.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas Morris",
      "helpful_votes": 4,
      "publication_date": 20160523
    },
    {
      "title": "Weak Suction",
      "text": "CONS I wish I would have returned this vacuum. It worked fine for the first 2 months and then it just started to loose suction power. The hose attachment does a poor job sucking up any dirt and the hard floor option is awful. Yes, I have emptied the canister and cleaned the filters. The cord is shorter than my previous vacuum. Not enough attachments. The hose attachment does not even fit in the holder, I have to use the attachment to keep it in place. Turn on/off switch in inconvient place. PROS Smaller frame, lighter than most vacuums. I have an older Hoover that I have upstairs, I will switch them since I use the downstairs vacuum daily.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170510
    },
    {
      "title": "Great vacuum if you’re on a budget - even works on pet hair",
      "text": "Great vacuum for the price! Almost a year later and it still works wonderfully on the carpet in my apartment where I live with 2 roommates, a cat, and a dog. The only thing it doesn’t do well is vacuum on hardwood/tile, despite having a “bare floor” setting. It works on those surfaces, but you’re better off just using a broom or swiffer. Also, mine has gotten clogged up, above the removable canister which is a pain to try and unclog. However I don’t know that this is the vacuum’s fault, it probably wouldn’t have clogged if my roommates emptied out the canister after each use.",
      "rating": 4.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "It's got power!",
      "text": "Selling my house when uh-oh my vacuum broke. So I ran to Walmart and most were $100 or more and when I looked them up on Amazon most had 3 stars or less. Browsed Amazon and thought any vacuum that got almost 10,000 positive reviews was worth buying, and I am really glad I did. This thing has power! I had gone over my carpet only two days before and when I took this vacuum to it I had to empty it almost every room it picked up so much dirt and hair. Very good little vacuum and the price was fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Wayt",
      "helpful_votes": 3,
      "publication_date": 20170501
    },
    {
      "title": "This is an amazing vacuum cleaner.",
      "text": "This is an amazing vacuum cleaner. I am so glad I bought it, it sucks up dust, lint, dirt that I never knew I had in my carpet! It is so lightweight and easy to maneuver. It is smaller than my former vacuum but because it's so light and easy to move around I actually vacuum in less time than with the wider vacuum. I like the fact that I don't have to buy bags, and it's so simple to pop out the dirt container and dump the dirt. Very easy to turn on and the long cord is a perfect length. I have only had it one month but it's been a happy vacuuming month, ha!",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 2,
      "publication_date": 20170403
    },
    {
      "title": "Frustrating design",
      "text": "I really like some of the qualities of this vacuum but I will be exchanging it soon. It's very frustrating because the cord and on/off switch are located in bad places. I had to tie the cord up high so it would stay out of my way. In addition, the hose has to be jammed into the machine or it just pops out at inconvenient times. The little cord clip up on the handle doesn't work at all. You have to search for the on/off switch every time because it's located in such a weird place. Pros- Good suction-light-not too loud Cons- see above.",
      "rating": 3.0,
      "verified": true,
      "author": "Payton",
      "helpful_votes": 2,
      "publication_date": 20170416
    },
    {
      "title": "Good",
      "text": "I've had this for over a year and it's still working perfectly. The included attachments make vacuuming the mattress or small spaces easy. There is a cleanable removable filter and you can remove the canister with the vacuumed dust and empty it quite easily. There is also another filter than is not cleanable and must be purchased and replaced but I haven't replaced it. It doesn't look extremely dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell Wong",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Exceeds Expectations!",
      "text": "A great value. Even if it were 50% more it would be a good deal. But for the current price(around 90 US dollars) it is a GREAT deal. If you have an old vacuum and are debating, debate no more. I was flabbergasted at the amount of dust just my living room had! The other reviews were so good I decided to save 200 bucks and not by the dyson. So far, I am happy with my choice. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie W.",
      "helpful_votes": 4,
      "publication_date": 20170404
    },
    {
      "title": "Bad vibration and noise even though it's barely used",
      "text": "While I bought this a year and a half ago I rarely use it. I only have a small portion of my home that's carpeted. So it's not seen much use. Still it took a crap on me.Bad vibration and excessive noise. Just like many others seem to have. Hoses are clear which pretty much leaves the motor as having an issue. I can spend a few hours trying to see if it's possible to fix but I'll just get a new vacuum. This worked great for the money. Until it didn't. Kind of pissed off now. Buy price, buy twice I guess.",
      "rating": 1.0,
      "verified": true,
      "author": "Agave",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "Painful to use!  Would rather try push a car!",
      "text": "This vac is terrible. It has great suction! If I could only use it! It is SO HARD to push it's impossible to use. When I told my husband he was thought I was exaggerating. Then he tried it! After a few expletives about the difficulty, he understood my frustration. Adjusting the height dial made no difference. Maybe it's broken but there's nothing I can do except eat the cost and next time buy something else! Great suction is only great if you can use the vac!",
      "rating": 1.0,
      "verified": true,
      "author": "TairenSoul",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Impossible to keep clean.",
      "text": "Hate it. The attachment stopped working after 2-3 uses. It is impossible to keep clean. The bin at the bottom empties easy enough but tons of crap gets stuck in the top part to the point it stops working. It is so difficult to get the debris out of the filter section. It is so gross!!!! Got rid of it after a few months.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Henry",
      "helpful_votes": 2,
      "publication_date": 20180728
    },
    {
      "title": "Works even better than expected!",
      "text": "It’s excellent for the price! However, there is absolutely no option to turn the brush spinner off. You can turn it down to the bare floor option but it doesn’t stop the brush from spinning. Overtime this will obviously damaged the mechanism of the machine. So I have to tilt it on a angle when on hardwood floor mode while I’m using the hose so the brush isn’t slapping the hardwood floor. Works fantastic on the carpet. The hose is very short in length but the suction is strong and this vacuum is worth every penny. Love that I can empty it right into the trash too! The filter is even washable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Highly recommended",
      "text": "Holy mother of suction!!! This is only my my second ever brand new vaccuum. The first was a biased and lasted only a few uses before suctions was useless. Even new it wasn’t half as good as this! I can’t believe the fair that has been lingering in my rugs and am soooooo impressed by this vaccuum. I used a few times and noticed the suction seemed to be reduced. I was disappointed until I realized the reservoir was full. One quick dump and we were back in action.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "No hard flooring spots it out behind it!!",
      "text": "I have mostly wood floors and low pile rugs, it doesn’t work with the wood floors at all even on the hard floor setting it just spits it out behind me. It barely moves on the rugs it’s very difficult to push. So now I have to figure out how to take it apart and send it back how fun. This vacuum is great if you only have carpet and it’s just the right pile length. It works great on my floors in the basement which are just plain carpeting. I’m really disappointed. I guess I shouldn’t be for this price",
      "rating": 2.0,
      "verified": true,
      "author": "play4ever",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Great suction",
      "text": "I love this vacuum!! Omg..seriously this is the best vacuum I’ve ever had...I’ve had A Kirby , Filter Queen, and several Sharks (both of which tore at the hose connection where the head pivots)... I vacuumed the family room as soon as I got it and must admit I was horrified when I saw the basket ..full of dust , sand , and cat hair..wth?? Would buy again in an instant!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindi Hollingsworth",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "Poorly designed- don’t recommend",
      "text": "The problem with this vacuum cleaner is the design. As seen in the picture, the dirt, dust and debris has to get past the filter which is at the top of the container. The debris always backs up here, meaning that one can never go more than 5 minutes of vacuuming before having to remove the container and empty it. We’ve had it six months and I already had to disassemble the bottom part of the vacuum where the brush is and put it back together. I would not buy this again and would not recommended it.",
      "rating": 3.0,
      "verified": true,
      "author": "Thom M. Stark",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Don't waste your money!",
      "text": "I clean houses by profession and this is hands down the WORST vacuum I have ever used! It takes me 3-4 times as long to do floors with this now. It spits things right back out onto hard floor surfaces and it takes several passes over regular carpet and don't bother trying to vacuum high carpet. I had to use all of m bodt weight to move it forward amd pulling it back wasn't much easier. It is ridiculously loud. So much so that a regular client asked what was wrong with my vacuum. I only use Bissel products and this was a huge disappointment and inconvenience.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 3,
      "publication_date": 20170703
    },
    {
      "title": "only 1 of 2 filters is washable",
      "text": "We just received this vacuum and haven't had a chance to use it yet. After buying vacuum bags and filters for our old vacuum, we were hoping to find a model with no ongoing maintenance expenses. This model seemed to fit the bill till we received and realized that while the pre-motor filter is washable, the post-motor filter still have to be replaced every 2-6 months. Very disappointing that this isn't listed anywhere that I could find in the product details.",
      "rating": 3.0,
      "verified": true,
      "author": "TE",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Disappointing features",
      "text": "Other reviewers were right: the on/off switch is in an awkward place, the attachment hose is so tight it is almost worthless for nearly any distance beyond its length. I am disappointed. On the subjective end, it is too heavy for me to carry up and down stairs w/o a struggle. Best feature: the bagless feature. It is very easy to remove and replace and very clean to use. Since there have been so many complaints over the same problems I'm having, you'd think that they would have redesigned it by now",
      "rating": 3.0,
      "verified": true,
      "author": "Hilma A.",
      "helpful_votes": 2,
      "publication_date": 20170703
    },
    {
      "title": "Wish I'd purchased a Dyson",
      "text": "I had a Dyson before this and had to leave it behind when I moved because it wouldn't fit on the moving truck. I loved my Dyson. But reviews said this Bissell was about as good for less than 1/3 the price of a Dyson. I've been using it a year and wish I'd bought another Dyson. It's rather small so you have to bend over to get to the power switch, and I wish it had a longer handle for using the floor attachment. It stays very dusty so is not air tight. It's so lightweight that it constantly falls over, either hitting the furniture or you. I wouldn't buy it again,",
      "rating": 3.0,
      "verified": true,
      "author": "Midnight Star",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Bissell 9595A CleanView Bagless Vacuum with OnePass",
      "text": "So far, so good! I bought a $700 vacuum cleaner several years ago, and it completely stopped working. Rather than have it fixed (repairs are so expensive), I decided to buy a different brand. I bought a bagless one with the \"ball\" and 1) I couldn't put it together and 2) it was really heavy, so I bought this one instead and for about $200 less that the \"ball\"-type vacuum cleaner. Very happy with this one. More expensive doesn't always mean better. Even if this breaks and have to buy another, I'm still ahead of the game.",
      "rating": 5.0,
      "verified": true,
      "author": "CSACH",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "This VACUUM is Serious and down for BUSINESS!! This is the One you've been looking for!",
      "text": "I'm VERY happy I bought this! It cleans so well and quick! You think your floor is ok then you use this and its full so fast and your floor looks amazing!!!! It's like hardcore!! I love a good vacuumed floor. It's a Serious vacuum and the price is great! Only thing is that it is a bit heavy but I'd buy it again. I've had many vacuums in my life and this is the one I've been looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "Yasmine Vine",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Here's the thing",
      "text": "Here's the thing: the Bissell is not as sexy and sleek as the Dyson. And yeah, the cord is slightly shorter than I'd like. Here's the other thing: it's a fraction of the cost and the suction is far better. It's really well built, easy to empty, comes with a turbo brush that has become my go-to for cleaning carpeted stairs - and did I mention that it's a fraction of the cost of the Dyson and has better suction? Great machine. Great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "WhatHey",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Happy with purchase after research",
      "text": "I was looking and looking for a great vacuum that wouldn’t break the bank. I vacuumed the house with the old vacuum, then vacuumed again with this Bissell - OH MY! I had to empty the container (NO BAGS!) three times.. three times AFTER vacuuming with our old one. Happy with the suction, quick transition between bare floors to thick carpet, and ease to clean. The main filter is washable and easy to wash clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Kita",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Good value, great vacuum!",
      "text": "I have been using this vacuum for almost two years and still have no complaints. This thing can really pick up the pet hair (three cats and a dog). Its super easy to clean and maintenance and pretty light overall. I carry it up and down stairs with ease. The spinning brush attachment is great for furniture and getting pet hairs off everything. I have recommended it to friends and family so why not here too.",
      "rating": 5.0,
      "verified": true,
      "author": "Nate",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "For Under 80 Bucks, A No-Brainer!!!",
      "text": "I had been agonizing for over 6 months, looking for a replacement for my dead Kenmore canister. Looked in both retail and online stores, all the reviews I could find, etc. It was pretty confusing, as there are really too many choices available and you'll find plenty of good and bad reviews for any one of them. I finally chose the #1 Amazon Best Seller and couldn't be happier with it!!! Sure, it is lacking a couple of features that you'll find on more expensive models, like high beams, but the vacuum works like a champ and the dust bin is easy to empty. Only time will tell how durable it is, but it's sure off to a great start!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Accutron",
      "helpful_votes": 0,
      "publication_date": 20170113
    },
    {
      "title": "This is a must buy!",
      "text": "I love vacuums and have spent a LOT of money on the “latest and greatest” ridiculously expensive ones. I hired a house cleaner and was amazed at how well my carpet looked. It was fluffy and shiny. So I had to ask what vacuum she was using. And it turned out to be this one! Wha? Seriously? I bought it and am always amazed at how much dirt and hair it picks up.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Suction is KILLER",
      "text": "Omg! I had to stop and IMMEDIATELY REVIEW! I wish I could take a video. My furball sheds heavy and this vacuum does better than anything I've bought for her shedding. Way better than any brush tool I have in my closet. 2 passes and it's gone. I've never seen anything like this. The actual vacuum grips the floor like I love it. It may not work for older folks that are not very strong. The suction makes it sort of hard to push. But!!! I'll take it because it seriously has some power!",
      "rating": 5.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Will clean the vacuum more than you clean with it. Clogs easily.",
      "text": "Lots of books and crannies collect dirt and fur requiring it to be taken apart with a screwdriver and cleaned. Has to be done at least one a month to maintain suction. Hose appears long but is so tightly coiled that when extended it pulls the vacuum over causing damage to walls and floors. Would not recommend to anyone with pets. I have one small dog and a cat and this unit could not handle the fur. Not even sure it’s worth sending to college next year with my son. Wish I had bought another brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mary Kay Shrake",
      "helpful_votes": 2,
      "publication_date": 20190602
    },
    {
      "title": "Sucks it up... and shoots it out the back!!!",
      "text": "This is definitely a 3/5. I don’t understand all the positive reviews! If you clean barefoot pay attention to the chunks of play dough and Cheerios and particles that fly out of the back of this thing and pelt your shins and feet! I’m so annoyed by it! Looking for a new one. It’s been 6 months and it had done this since day 1. Maybe people don’t vacuum barefoot or in shorts because I hate feeling the garbage hit my legs!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Xiomara",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "Better than any Dyson I've bought.",
      "text": "Omg, this is the best vacuum I've ever bought, definitely better than any Dyson I've bought. It's very easy to unclog if something gets stuck in the hose, if it starts to lose suction, all you have to do is wash out the dust filter and it'll be like you just unboxed it. It's OK for hard wood, just will throw back really small particles like cat litter; which to me isn't a problem cause it can be swept into a pile and you can then use the hose to pick it up.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney",
      "helpful_votes": 4,
      "publication_date": 20161226
    },
    {
      "title": "I'm not as in love. It's clunky and slightly difficult for a short ...",
      "text": "My husband has asked me twice now to purchased a second one so we'll have another if this one ever dies. I'm not as in love. It's clunky and slightly difficult for a short chick but I manage. Very basic machine but it really does have shocking suction. The attachments are extremely basic and work, but I'm not blown again. EDITED 1 YEAR LATER 12/2017... It has lost all suction and now spits things back out. I am currently shopping for another new vacuum because this guy is useless now.",
      "rating": 2.0,
      "verified": true,
      "author": "ashleydeleted",
      "helpful_votes": 2,
      "publication_date": 20170216
    },
    {
      "title": "Good, but can't turn off beater bar",
      "text": "This is a solid vacuum for people on a budget, but has three caveats. 1- The beater bar can't be turned off 2- At around 5' the flexible tube isn't really long enough to be useful (plus the beater bar is on the whole time your using it) 3- The wheels are kind of shoddy. They rattle and overall are just kind of flimsy That being said as long as you don't intend to vacuum on hardwood floors, or don't care about your floor/ live in an apartment, then this is a great vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "mason",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "I'd buy it in the store, if price wasn't an object.",
      "text": "The vacuum seems to be great. But two things immediately stood out. First of all, this one had been used before. Had dirt/dust in the canister. Don't know how or when, but even the filter was dirty. Second, not one thing was in the box, or on the box. My address, and that is it. No directions, instruction manual or warranty card. Nothing, period. Ok, it's a vacuum and not that hard to figure out how to put together. But surely \"something\" would come in the box. So my review isn't dinging the product s much as it is the experience. First time I've ever had an issue with ordering from Amazon.",
      "rating": 3.0,
      "verified": true,
      "author": "Simplyhere",
      "helpful_votes": 4,
      "publication_date": 20160817
    },
    {
      "title": "Best Bang for the Buck... and then some!",
      "text": "I used to sell vacuum cleaners so I like to think I have moderate knowledge on quality vacuum cleaner. When looking at the main functions of a cleaner; suction power is priority number 1. This vacuum cleaner competes, if not, surpasses all the big name cleaners in suction power. The bag-less function works perfectly. The turbo brush attachment works great on stairs. I have had this for 2 years and have NO COMPLAINTS. Best bang for the buck out there.",
      "rating": 5.0,
      "verified": true,
      "author": "MidwestGent",
      "helpful_votes": 4,
      "publication_date": 20160520
    },
    {
      "title": "Great vacuum cleaner",
      "text": "The base of this vacuum cleaner is very sturdy and surprisingly good quality. I'm really happy with all of the attachments and it's cleaning power. The one-pass technology gets almost everything--much better than my old Walmart special which barely had any suction at all. I use it to clean the hardwood floors in my apartment. One thing to keep in mind--empty it outside so you don't re-dust your house with dirt when emptying the chamber. Went to town on the rugs in my roommates' rooms and it picked up a ton of dirt. A great buy for $65. It is a bit bulky, but I really love this vacuum. So excited I'm about to give it another spin.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Its throwing dirt and dust!",
      "text": "I am very disappointed in this I bought it knowing that I was going to be moving into a place with carpeting where's I had wood floors before the whole time I am vacuuming it is throwing dust all over my house and all over the vacuum itself it is covered in a white film of dust and now the window is closed for me to return it and I am very upset because I had just moved into my new place and just started using it",
      "rating": 1.0,
      "verified": true,
      "author": "Keri O.",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "dust flys out of the wand holder when in use.",
      "text": "Iv'e had the vacuum for about One year. The price point was a plus as it was bought for my mother. I eventually inherited the vacuum. I have pets and the suction is amazing! So amazing the machine usually falls over or hits me in the head when vacuuming high places or the stairs. The wand hose which is too short and attaches to the bottom of vacuum has to be pulled out when using the wand, which is weird design because dust and dirt blow out of wand holder hole. Does anyone else have this problem? Vacuum is always dusty on the outside. Would not recommend and can't wait to purchase another Dyson Animal for my cleaning needs!",
      "rating": 2.0,
      "verified": true,
      "author": "L. Lopez-Wellborn",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "1 year later...",
      "text": "After 1 year Review. The main vacuum spit a lot of trash back out the last 6 months. It would tangle hair really bad in the brushes. The final stab to the heart was the snapping of its plug. One of the teeth snapped off completely yesterday. I did not like the vacuum very much as it always smelled like rubber when turned on. Happy to have a reason to buy another. Invest in something a little better. Don’t waste your money on this garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Stephanierez",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "It's like they set out to design the worst vacuum ever.",
      "text": "You know when something is so awkward and cumbersome to use that you cringe at the thought of it? You can feel that if you buy this vacuum. I've felt it for over a year now. The product design is awful, from the switch location to the top-heaviness to the clunky shape and inferior materials. Suction power is not good enough. Emptying it is a filthy experience. I've finally decided I'm done with this piece of junk for good. Getting another Oreck.",
      "rating": 1.0,
      "verified": true,
      "author": "svenskaflicka",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "I’m having issues with my hardwood floors",
      "text": "I have mostly hardwood with a few area rugs and a carpeted basement. It seems to work on carpet fine however when I use it on hardwood it literally shoots all the stuff It vacuumed up out onto my legs to the point where it’s painful. Almost comparable to when you get hit with and edge trimmer for grass. I have it on the right setting, have checked that all the parts we’re assembled correctly however there is no difference",
      "rating": 2.0,
      "verified": true,
      "author": "Kymm Spillane",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Several Important Details Missed",
      "text": "The vacuum is relatively light in weight and maneuvers well. The cord is quite long, however, the hook device that adheres cord to vacuum, to prevent tripping, is weak and the cord falls off regularly--useless. A notch to grab or hand grasp on the lower part of the machine, which aids in lifting up and down stairs, is nonexistent. The suction is erratic, sometimes it responds perfectly to the different surfaces and other times the suction is so strong the vacuum will not move.",
      "rating": 3.0,
      "verified": true,
      "author": "Mo Kay",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Lightweight",
      "text": "This machine is powerful but lightweight. I've had many machines that were far more expensive but didn't do as good a job at vacuuming. The only two things that I would like is a cord release and a dusting brush, other than that, I think it's a great machine. Also the website is extremely easy to use, which is most unusual compare to most web sites.",
      "rating": 5.0,
      "verified": true,
      "author": "honey2010",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Great Purchase",
      "text": "This vacuum is a tough little cookie,,,,,I'm amazed at the amount of dust, dirt, pet hair is pulled from my carpet......My son has a dyson funny thing is its the same color as mine and thought it was a bissell, They both moved, pulled dirt out the same..... the only difference is the price which is HUGE very pleased with my purchase,,,,, read complaints about attachments not staying in place..... I have no issue.....however if I was to advise I would suggest the automated rewind..... other then that this performs very will on both carpet and floors",
      "rating": 5.0,
      "verified": true,
      "author": "martin martin",
      "helpful_votes": 0,
      "publication_date": 20180224
    },
    {
      "title": "I don't want this vac anymore",
      "text": "I don't love this cheesy vacuum. It has great suction and a long cord and holds a lot of dirt. But it's definitely cheap. For example, the brush doesn't stop turning even when it's stood straight up like other vacuums. This means when you're using attachments the brush is beating up your carpet while it's standing in one spot for a long period of time. The hose doesn't fit very well in its resting place in the back. And the power switch for some reason is down low and just out of reach enough to make me mad every time I feel around for it. I'm going to give it away and find something different.",
      "rating": 2.0,
      "verified": true,
      "author": "Sumarie",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Deep cleaning vacuum cleaner",
      "text": "Pro:1 sucks really well and it is good for both hardwood floor as for carpet 2 the recipient where dust is stored gets easily out and you can wash it fast. Cons: 1 it is VERY LOUD. I can hear it from 300m away and if you live in an apartment building you have to be careful 2 it is very heavy to pick up and move around especially because of reason no. 3 which is an incredible long power wire (which in itself is not bad, but when you have a small apartment is a hassle) I do recommend it for it's capacity to clean in depth and fast.",
      "rating": 4.0,
      "verified": true,
      "author": "Marian Tataru",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "2 years old and falling apart",
      "text": "This product was deceivingly nice and worked well (at first). Within 6 months pieces started breaking off. It was usable without the broken pieces so we kept using.It’s now been a couple of years and the piece that holds the hose just broke off. Have never had a cheap vacuum cleaner that messed up so easily. Manufacturer has not contacted me about the defects This is one of those instances where I can say that you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Ash",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Good Vacuum Except for Hose Length",
      "text": "Great vacuum as far as vacuuming floors & carpet. The pet hair attachment works well too. It’s all good & I would give it a 5 star rating except that the hose is so short that it doesn’t reach anywhere at all without tipping over the entire vacuum. It doesn’t stretch out much either. I cannot use it to clean the cobwebs out of the corner of the room or to vacuum ceiling fans even in rooms with short ceilings. I would not buy it again for that reason & would not recommend it to anyone. It’s unfortunate because otherwise it’s a very good vacuum.",
      "rating": 3.0,
      "verified": true,
      "author": "L. Hisle",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Not good at all",
      "text": "Have two German Shepards and wanted something to do my bedroom rug with. Worked great the first time. Emptied the container and then it started spitting dust into the air and out the sides. I used once more and did the same thing. Plus smelled like burnt rubber.",
      "rating": 2.0,
      "verified": true,
      "author": "z.beedle",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Easy assembly, suction is great",
      "text": "Lots of reviews say this vacuum is heavy. It's lighter than my old one, so I don't think it's heavy at all. Feels just a little cheap, like lightweight plastic, but they may just be trying to save on weight. Suction is great! Only time will tell if my long hair & 2 cats will big this thing down. I've pretty much decided that I will have to buy a new vacuum every 3 years or so. It was very easy to assemble",
      "rating": 4.0,
      "verified": true,
      "author": "no_deadbeats",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "AWESOME",
      "text": "Owning an indoor rabbit is super messy so I decided to treat myself to a nice vacuum and I could not be happier with this one. I LOVE the fact that it has different settings for different types of surfaces/carpet types. As you can see in the before and after pictures, the vacuum did an amazing job. I used the smaller attachments and they had all the suction power of the main body of the vacuum so they did a great job of cleaning out the nooks and crannies near the fence and cage.",
      "rating": 5.0,
      "verified": true,
      "author": "ngan",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Good start but not a long-term solution.",
      "text": "I bought this vacuum June 2016. I wanted to love it, and I did - for the first year. After that time period, the vacuum started randomly dropping things it had picked up. Despite periodic self-repairs and a vigorous cleaning, the vacuum now inexplicably kicks dust out the front of the body and leaves random dust bunnies and huge dust prints on any surface I may ever so lightly bump. And definitely be careful not to hit the vacuum too hard or any wall (think carrying up and down stairs) - you may as we not have cleaned up. I hope this is a “just me” problem, but buyer beware.",
      "rating": 2.0,
      "verified": true,
      "author": "edpv",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Meh",
      "text": "I’ve owned this for a year now and I’m looking for another vacuum. It’s not easy to use the attachments and I need them a lot in order to clean under the couch because I have a toddler. When I use it, the hose will fall out of the vacuum! It’s such a pain. Also, it’s very difficult to empty this container. Lots of dirt collects at the top and that means you have to stick your hand in there and remove the clog every time. I hate touching all that dirt. I’ve had way better vacuums. I miss my shark navigator.",
      "rating": 2.0,
      "verified": true,
      "author": "E. Morgan",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Amazing vacuum",
      "text": "OMG OMG OMG. What a fantastic buy! Super power, easy to use, replaced a 10 year old Bissell and immediately made a huge impact with cleaning power. Pros: everything Cons: I would have liked the power cord to be another 10 ft longer, and the wrapping arms a little different. You have to stand on your head to unwrap and wrap cord up, but otherwise, this is one smooth, powerful machine that makes cleaning up after 2 furry dogs and 2 cats a breeze. Filter designs, cleaning, etc are all top notch and replacements are inexpensive. Highly recommend this",
      "rating": 5.0,
      "verified": true,
      "author": "Been there, tried that",
      "helpful_votes": 3,
      "publication_date": 20151116
    },
    {
      "title": "Fantastic power for a very reasonable price.",
      "text": "Could not be happier with the performance of this vacuum. Really amazed at how much dirt, hair and dust it pulls up out of the carpets. Not bad on the bare floor either! The little turbo attachment is great for the couches and the stairs. Only wish is for a longer hose for reaching all the stairs without having to haul the machine up or down to finish the job. But overall best vacuum I've ever used!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Loved at first, disappointed now",
      "text": "When first arrived it worked fantastic. Over the month it lost suction, even after I clean the whole vacuum out the suction power wasn't there. I have hardwood floors and all it does is kick the dirt behind the vacuum making me vacuum the same area multiple times.",
      "rating": 3.0,
      "verified": true,
      "author": "Serrina Alley",
      "helpful_votes": 2,
      "publication_date": 20190428
    },
    {
      "title": "Love this Vacuum Cleaner!",
      "text": "This vacuum replaced a silly Dirt Devil, and I am happy I did it. Lightweight, does my carpet and wood floors beautifully. I have a cat so that was a great test to see if it picked up any cat hair. It did! My place is so nice and clean, and yes, I love the accessories that cleaned all the places that you may not always get to. Thanks Bissell for making an affordable, great vacuum cleaner :)",
      "rating": 5.0,
      "verified": true,
      "author": "jrs",
      "helpful_votes": 2,
      "publication_date": 20170701
    },
    {
      "title": "Great Buy",
      "text": "This is a great vacuum. It sucks up so much dust and dirt and dog hair I'm amazed. I've never purchased a vacuum before and I wasn't sure how much I should spend. I had seen others that were much pricier and wondered if it was really worth it. Well this vacuum is proof that you don't have to spend hundreds of dollars just to get your floors clean. I definitely recommend this vacuum to anyone it's a great buy",
      "rating": 5.0,
      "verified": true,
      "author": "Tae",
      "helpful_votes": 2,
      "publication_date": 20170514
    },
    {
      "title": "Waste of Money!",
      "text": "I bought this vacuum in April and it broke within a couple weeks. It makes a really loud, grating noise, emits a horrible smell when running, leaks dust back out of the bottom, and when in use the hose that carries the dirt to the can will shock you if you touch it! It seems very unsafe and just plain doesn't work properly. We had the vacuum before this for years, but I'm replacing this new one within months. I will not be buying Bissell again!",
      "rating": 1.0,
      "verified": true,
      "author": "S. Bowman",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Its eh quality",
      "text": "Clumsy to use, a pain and messy to empty, clogs easily, suction is mediocre. Don't get if you have pets. For a single person who lives alone and doesn't really have much dirt they're dragging in, it's fine. But for a family with pets, get something more durable with more suction power. This vac really made me miss my Dyson. When I can afford to, I'm replacing this vac which I've had about 2 years now. I'll save it to give to one of my kids when they get their first place on their own.",
      "rating": 2.0,
      "verified": true,
      "author": "Dawn Dyson",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Cleans like a dream",
      "text": "This was exactly as Pictured couldn’t have asked for anything better! Thank you great product! I just moved into my apartment and when I vacuum the carpet once the vacuum was done there was so much sand and dirt and hair in the canister that you could not see in the carpet. It is the best vacuum ever. I actually passed on a Dyson stick vacuum at the suggestion of my beautiful sister for this one and I do not regret my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Whit",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Shoots dirt out the back, into my feet and across the room",
      "text": "Worked for minimal light use for first 8 months, then only 2 months after I started vacuuming every week things went horribly wrong and the thing started shooting debris out the back to hit my feet and scatter all the way across the freshly-vacuuumed room. Creates FAR more work than it solves, at this point. If it was just mine, fine. Based on other reviews, I’m not having a unique experience. I can’t recommend this vacuum, and now have to buy a new vacuum. I’m disappointed, and do not feel that I got my money’s worth.",
      "rating": 1.0,
      "verified": true,
      "author": "L. Hubertus",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Love this vacuum!",
      "text": "It's reasonably priced and performs great. Not the best on hardwood, but I generally use a broom for those anyway. I have a cat and it picks up her hair without a problem. Great for getting dirt and dust that's deep in the carpet. I've been using this for about 2 years now and I'm still happy I went with this pick. Keep the filters clean and it'll keep up the original performance.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "For the price I don't think you'll find anything better. It has some great suction but there's one ...",
      "text": "For the price I don't think you'll find anything better. It has some great suction but there's one huge issue I have that prevents me from giving it a 4/5. The hose is way too short. Like it's not even long enough to stand up and use it unless you hunch over. The vacuum is constantly tipping over and I have to re-position it all the time when using the hose. If that hose was longer it would be a definite purchase but I'd go with something that has a longer hose if you use it a lot.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "I really dislike this vacuum",
      "text": "I really dislike this vacuum. I vacuum my carpet and can still see little flecks it missed. When I use the wand, it has so little suction I might as well not even be vacuuming. The vacuum can't even pick up small dirt in my carpet, so picking up something like a Cheerio is hopeless. I can't wait for this vacuum to break... I don't know if I'll even be able to wait until then to buy a new one. UPDATE: February 24, 2018 The vacuum died completely today. I’ve never been happier to throw a vacuum in the trash. I’m going back to a Shark.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Russell",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Like Fisher Price for adults!!! Finally",
      "text": "My Bissell vacuum arrived today and I just unpacked it and put it together. Yes I am excited..I am a 66 year old lady who doesn't do well with mechanical things...like putting a new vacuum together. Let me say even with the small hard to see photos of how to put the vacuum together I DID IT EASILY!! IT SNAPPED TOGETHER SOOO EASILY. I have to give it 5 stars and just ran it quickly for 5 mins. I will update my review as I use it. But right now Iove it. Thank you Bissell and Amazon for making it easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Dbshell",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "GREAT PRICE/ GREAT/SUCTION/GREAT VACUUM",
      "text": "My Oreck started acting up & we decided we were tired of putting $$ into it yearly. So found this vacuum on line, red all reviews, & decided to give it a try. LOVE IT. I could not believe all that it has picked up. Hopefully it will last for a long time. It was easy to put together, easy to remove the canister for emptying the dirt. You won't be sorry.!! Great price too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "It sucks.  It blows - in your face.",
      "text": "It blows in your face while you're vacuuming - blows any loose dust around. Doesn't do edges well or corners. Can't get far under furniture. More of a backache than the canister type - heavy and not well balanced. Not pleasant to empty when it gets 1/2 full because the dust flies - even doing it outside which is pretty much a must. unpleasant to use. small sponge filter that is washable but gets very embedded with dust - dirty to clean before washing to avoid clogging a drain. Neither of us likes it - giving it away.",
      "rating": 1.0,
      "verified": true,
      "author": "KMC",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Great suction and no hassle emptying container ..",
      "text": "I am very happy with this vacuum cleaner. The suction is great. It really cleans. Emptying the container is an easy job. I don't have to suffer. One click on the button and all the dust falls into the garbage bag. No hassle, no problem. The video is also very helpful. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam W.",
      "helpful_votes": 2,
      "publication_date": 20180329
    },
    {
      "title": "A Seriously Flawed Product",
      "text": "This is the worst product I have purchased on Amazon and certainly the worst vacuum I have ever purchased. There are MANY design flaws. Bottom line - every time I use the vacuum I have to take it apart to get the dirt, pet hair, etc, from around the filter and all parts - dirt flies everywhere; it is disgusting! read the other reviews that spell out all the flaws as they are 100% spot on... I have never had a product that is this defective - obviously I am very disappointed... and also I will be calling customer service as well- this is completely unacceptable",
      "rating": 1.0,
      "verified": true,
      "author": "Marilyn R Crawford",
      "helpful_votes": 0,
      "publication_date": 20181229
    }
  ],
  "product_meta": {
    "title": "Bissell 9595A CleanView Bagless Vacuum with OnePass",
    "description": "The lightweight vacuum features OnePass Technology with a powerful suction and innovative brush design. Bottom Easy Empty dirt tank and a washable foam filter make maintenance simple. The premium attachments provide faster and more effective cleaning so you can get on with your day.\n\n * Weight: 15.1 lbs\n * Cyclonic System for long-lasting, powerful suction\n * TurboBrush tool for stairs, furniture, upholstery, and more\n * Easy Empty dirt tank, multi-level filter, and washable foam tank filter",
    "rating": 4.2,
    "feature_bullets": [
      "Fast and easy cleaning in a lightweight vacuum with powerful suction and innovative brush design that cleans more on the initial pass",
      "Innovative brush design rotates down into the carpet to clean more on the initial pass",
      "Cyclonic System for long lasting, powerful suction. Bag Type : Bagless",
      "TurboBrush tool for stairs, furniture, upholstery, and more; Dirt Cup Capacity: 2.2 L",
      "Easy Empty dirt tank, Multi Level Filtration, and washable foam tank filter. Note: Please refer user manual attached below for item installation and troubleshooting steps. Hose Length: 6 inch. Brush System: Rotating Clear Window"
    ],
    "specifications": {
      "Product Dimensions": "12.5 x 13.5 x 44 inches",
      "Item Weight": "15 pounds",
      "Manufacturer": "BISSELL HomeCare, Inc.",
      "ASIN": "B00AZBIZTW",
      "Item model number": "9595A",
      "Customer Reviews": "4.2 out of 5 stars15,377 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#31,707 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Upholstery, Stairs, Furniture",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "2 years.",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Home & Kitchen",
      "Upright Vacuums",
      "Vacuums",
      "Vacuums & Floor Care"
    ],
    "price": 82.47
  }
}