{
  "website_summaries": [
    {
      "verdict": "A generous feature set, rugged construction, and warm, detailed sound with powerful bass guarantees the V-Moda M-100's strong appeal for audiophiles with a flexible budget.",
      "pros": [
        "The feature-rich V-Moda Crossfade M-100 is exceptionally durable, includes an inline remote and microphone, and can fold into a compact bundle"
      ],
      "cons": [
        "The M-100's substantial price tag may deter shoppers on a budget"
      ],
      "aspects": {
        "Design": 9.0,
        "Features": 9.0,
        "Performance": 8.0,
        "Value": 8.0
      },
      "publication_date": 20121212,
      "rating": 8.3,
      "source": "cnet"
    },
    {
      "verdict": "The V-Moda Crossfade M-100 over-the-ear headphones provide powerful bass and crisp highs in a comfortable design.",
      "pros": [
        "Powerful, sculpted audio performance with deep lows and bright highs",
        "Removable cable can be plugged into either earcup",
        "Stylish, comfortable design"
      ],
      "cons": [
        "Boosted bass sound signature is not for those seeking a reference-style headphone pair"
      ],
      "aspects": {},
      "publication_date": 20140602,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Exciting headphones for enthusiasts",
      "text": "Took me almost five years to eventually buy these. Glad I finally got them. Exciting sound signature for audio enthusiasts at a competitive price. Pros: - great punchy bass - incredible build quality - great accessories included, carry case, shareplay cable etc. Cons: - headband can get uncomfortable after extended use - basic cups are not comfortable, highly recommend buying the XL pads as they are much more comfortable and more isolating - as with most overear headphones, can get hot under the pads",
      "rating": 5.0,
      "verified": true,
      "author": "Goran",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Great product but a little bit tight",
      "text": "It has been almost a year since I bought this product. At first I was amazed at how great the sound was. Truth be told, I had never bought a proper pair of headphones ever, so this was a big step forward. The only downside of it, is that I feel that it is quite tight on my head. I get headaches after wearing them for more than an hour. I tried stretching the material as V-Moda also suggests, but it hasn't worked as far as I can tell. All in all, great product, just make sure you don't have a huge head like me :)",
      "rating": 4.0,
      "verified": true,
      "author": "Steef",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "Second V moda headphones for myself and I'm still satisfied.",
      "text": "After 4.5 years of using my Crossfade LP headphones (still performing strong) I decided to try M 100. Sound is better overall. Bass still deep but more controlled in my opinion. Sound stage is bigger and clearer.",
      "rating": 5.0,
      "verified": true,
      "author": "Siro",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Simply sublime!",
      "text": "Are these headphone good value for money? No I'm sorry they are not. But what I can say is I can never go back after using them as the music coming from them is simply sublime, like nothing I have ever experience before. I bundled mine with the Fiio Q1 AMP & DAC and it just adds that extra something to the music that seems to get an even better experience from these already amazing headphones. Bass is the best part of these with tight but thumping lows plenty to make bass heads happy but also not too over the top that someone who prefers a flat signature would be against it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mario",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Hi-End Sound!",
      "text": "These headphones I used for everything! Very durable! Sound quality is on a very high level, you got to balance with all tones, crisp sound and deep bass. I use an amplifier to extract the richness of sound from these headphones. I found at this moment better headphones at the same price, but don't regret these ones because for people who listen to music every day, and enjoy it, that's the best choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Lukas",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "All you need in a portable headphone",
      "text": "From the build quality, to the crazy thumping bass( that doesnt affect the acoustics) the sound is 5 star thr customer service is on point, they fold smaller than my hand and have a super strong exo skeleton case to throw in your bag, the cables are both very thick and durable, and the customisable plates is fantastic change the colour of your earcups for as little as 20 pound The one and only downside tobthe headphone is if i wear them for more than 2 hours i feel a little pain on the top of my ear but is fixed when taking them of for 10 mins",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Not worth the crazy price but they are amazing for sound and bass",
      "text": "Not worth the crazy price but they are amazing for sound and bass. I wish they were cheaper, the sound quality is out of this world though but you need to ask yourself, is sound that important to you? If you are expecting out of this world performance then I would be careful as head phones can only get so good. It does cancel out noise incredibly well but adds nothing to gaming which I see is a popular question people seem to have.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Richards",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "Is broken",
      "text": "The item itself, looked wonderes! The only Issue own that it was missing parts of the package/ a headpiece was totally broken from the inside. The right part of the headpiece is not playing anything, tried with different cord, and still nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Albert",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Absolutely outstanding combined with the Audioengine D1 DAC and Tidal ...",
      "text": "Absolutely outstanding combined with the Audioengine D1 DAC and Tidal Hifi. Incredibly impressive all-around sound quality and exceptional bass!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Thomas D. Day",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Amazing",
      "text": "Months after owning these and I am so impressed, love the compact travel case! For over ear headphones they are nicely compact, only problem was the jack adapter, it wasn't a right fit",
      "rating": 5.0,
      "verified": true,
      "author": "Frazer",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Excellent",
      "text": "Brought for a present for my son who produces music. He says they are fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Mum of four ",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Great headphones.",
      "text": "Very nice product. I was looking for an upgrade, coming from a pioneer headphone (CDJ500), the V-Moda are great for indoor and outdoor activities. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Constantinou",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great value buy",
      "text": "Bought this for my son after he had researched the product. He is totally happy with the sound quality which has the correct amount of base and clarity.",
      "rating": 5.0,
      "verified": true,
      "author": "lisa",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Three Stars",
      "text": "Everything is good execept for audio quality feels a bit flat/ too much bass compared to my sennheisers",
      "rating": 3.0,
      "verified": true,
      "author": "brandon",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "I would recommend however having either a high quality player like a ...",
      "text": "Takes a few days to get used to how they sound then it's pure bliss from there on in. I would recommend however having either a high quality player like a fiio or a HTC m8,m9 to use them with as although they are 38ohms you need proper power or even on max volume they are a bit quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Spoonmonkey3",
      "helpful_votes": 0,
      "publication_date": 20150905
    },
    {
      "title": "Brilliant Sound!",
      "text": "Brilliant sound,clear and good thumping bass,no complaints with these headphones.I would recommend them. They are defo worth the money now",
      "rating": 5.0,
      "verified": true,
      "author": "Ian McGarvey",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Be patient",
      "text": "Lovely deep bass after about 50 hours of burn, needs to be worn in alittle before they become amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Lall",
      "helpful_votes": 4,
      "publication_date": 20150918
    },
    {
      "title": "Amazing, but needed the xl pads",
      "text": "Amazing, but needed the xl pads, now they're literally the perfect headphones. Great engaged sound, pack up small and great quality",
      "rating": 5.0,
      "verified": true,
      "author": "Jonny Schmidt",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "A god in the hierarchy of headphones",
      "text": "Exceptional sound quality. This also pleases my need for a lot of bass while not mudding out the mids and Highs. This is truly a modern audiophile's dream come true.",
      "rating": 5.0,
      "verified": true,
      "author": "Steen",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Good for home",
      "text": "Good for home, very good bass reproduction and extremely loud. However, these aren't particularly brilliant for use on a mobile phone - these are really designed for use on a hifi from my experience with these (or at least with an amplifier in the mix). As I had spent so much on these cans and not able to hear a word of the music on my commute on the London Underground, if this is not what you are doing you will be happy with these.",
      "rating": 4.0,
      "verified": true,
      "author": "Ikhlaq Shah",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Meh",
      "text": "I don't think it's worth the price. Bass not that great, my beats by dr.dre, which everyone seems to be hating here, have greater bass and sounds just as good.",
      "rating": 3.0,
      "verified": true,
      "author": "Gaby",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "I bought these a year ago and one of the ...",
      "text": "I bought these a year ago and one of the speakers has stopped working already. save your money, absolute rubbish.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 3,
      "publication_date": 20150810
    },
    {
      "title": "DEAD ON ARRIVAL",
      "text": "DO NOT BUY THIS ITEM The item came defective right out of the box not only that when I contacted V-Moda they asked me to ship the item to the US AND they didnt give me returns label so I had to pay to return it BUT I didn't EVEN USE THE HEADPHONES ONCE SUCH A DISAPPOINTING EXPERIENCE DO NOT BUY FROM THIS BRAND JUST SAVE YOUR MONEY",
      "rating": 1.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 2,
      "publication_date": 20170404
    },
    {
      "title": "The sound is amazing. They feel good",
      "text": "I've had these for 3-4 years. The sound is amazing. They feel good, once you buy the XL cushions for $20. They look nice. Even the build quality is nice except for one minor detail. The plastic clips that hold the cups to the band. They are made out of plastic. Those clips broke and I thought hey I paid a hefty price for these I could get more replacement clips. Wrong! They don't make replacement clips. What they will do is offer a discount to buy another pair of headphones. I think they could last a lifetime, I wish they would but, the plastic will only hold up for a couple of years.",
      "rating": 1.0,
      "verified": true,
      "author": "Trevor Heim",
      "helpful_votes": 41,
      "publication_date": 20180402
    },
    {
      "title": "Very Strong",
      "text": "These headphones are the most sturdy headphones I have ever seen. Their sound quality is unrivaled. They don't have active noise cancelling but the passive noise isolation from the frame works fairly well. I would recommend these if you are rough on headphones. I was buying a new pair of headphones every month or two prior to getting these. Now I've had the same pair for nearly a year and a half. Granted I paid about the same for these as I would have paid for 10 of the cheap ones I had been using. They also work well with my studio mixer and Rode NT1-A Microphone. This combination is the bees knees for youtubing.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Great Headphones",
      "text": "Unless you buy a separate \"mini amplifier\" you will not like the sound that much. I highly recommend the FiiO E10K USB DAC and Headphone Amplifier (Titanium). It has an option for additional bass. These V-Moda headphones have clear sound quality. However, with a \"Mini Amplifier\" these V-Moda Cross Fade M-100 will sound louder. Powerful bass. If you have a laptop computer, I recommend purchasing and downloading the BOOM 3D from Global Delight's website. This Boom 3D will increase and improve your overall audio output of your laptop computer. The Boom 3D has an equalizer and surround sound effects. The V-Moda 's overall sound is very good. I do love my V-Moda Crossfade M-100 headphones! I",
      "rating": 5.0,
      "verified": true,
      "author": "JEZ",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "If you can afford them, get them.",
      "text": "I went to Best Buy, Walmart, Target, Fred Meyer, Guitar Center, and a few small stores that had headphones, and tried every set of headphones I could. These V-Moda Crossfade M-100 headphones beat them all! These are not cheap, but they blow away ANY headphones I tried that cost less, and anything more expensive was not worth the cost difference. Beats have NOTHING on these! Plus, V-Moda are actually metal, and you can customize them with different shield plates if you want. My girlfriend bought some Audio Technica headphones, and after listening to my V-Moda Crossfades she returned her's and bought a pair of V-Moda's for herself. I can't recommend these enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin J.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Great customer support",
      "text": "The headphones are great, good quality and look really nice! I also have to give a shout-out to their customer support. I've had these almost two years which is how long the company warranties them. The hinges broke on one of the ear pieces so I went to the website and made a warranty claim. They quickly responded with the information I needed to send them,including a copy of proof of purchase in the box. Once they received the headphones, they fixed them within a day or two and sent them back. It was so easy! So, props to the company for standing behind their product and honoring the warranty hassle-free!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Great sound but need XL ear pads",
      "text": "I love the sound quality of these headphones. In my humble opinion, they meet the audiophile standard which admittedly is a moving target. The cords are well made and durable - should last a long time. One complaint: just about everyone who reviews these phones recommends purchasing the XL ear pads because the standard pads run small. I can validate that recommendation. They fit and sound a lot better with the XLs. Why not ship them that way or at least give the buyer a choice.",
      "rating": 4.0,
      "verified": true,
      "author": "Karl",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Sloppy bass response.",
      "text": "I hought these to replace my Grado SR125's because I needed a closed back set of phones. Frankly, they don't stack up. They're well made and comfortable enough. But the sound is muddy, especially in the low midrange and upper bass. They lack the presence I'd grown accustomed to with the Grados. So I'll be exchanging for a set of Beyerdynamic's. If you can tolerate an open back setup Grados should definitely be considered.",
      "rating": 3.0,
      "verified": true,
      "author": "Dark Matter",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Lived up to the hype",
      "text": "I very much enjoyed unboxing these beautiful headphones after months of researching and finally pulling the trigger. I can't say they are better than one headphone to another because like most people i don't have infinite money or time to go out and buy all the nicest headphones to compare. But I will say that the build quality, compactness, sound quality, and overall day to dayness of the m100's are worthy of a 5 star review and certainly lived up to my expectation. Although if you are looking for something with a lot of bass I would suggest searching elsewhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Jentoo",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "That poor dad of mine...",
      "text": "My dad needs hip surgery so he's going to be laid up for a while. He wanted a comfortable pair of headphones that had a good seal, where durable enough to sleep in, won't fall of when he did manage to sleep, and blocked out the world with clear sound. As my wife (Dr. Destructo) hasn't been able to kill her five year old crossfades, I suggested these. He's in love. No longer can his wife wake him up at eight in the morning while vacuuming on top of his head, slam-dunking plates into the dishwasher, or asking him whatever random thoughts roll into her head. Just peaceful silence. The case is very nice as well. I'm jealous!",
      "rating": 5.0,
      "verified": true,
      "author": "Truck_Driving_Pottymouth",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Amazing sound",
      "text": "amazing sound from these cans, i also have the v-moda in-ear headphones which have amazing sound, but they hurt after prolong use, these work perfectly for hours of use without hurting the ears. I crank up the volume and bass from itunes on the computer with EQ enabled and bass and treble on high and the mid at the bottom, the sound is beautiful, no cracking in the bass or treble, the sound is very crisp and clear. I have tested bose and beats but these sound much better than them. Its like a high quality machinery in motion on a smooth surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Rizwan",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Fancy build; faulty quality",
      "text": "These brand new headphones look very cool and seem sturdy, but the sound was totally scratchy and static. It was also not even close to the quality of Bose or Sony headphones in this pricerange. Sorry, cool concept, but really overselling it. And the detachable fashion plates? Gaudy.",
      "rating": 2.0,
      "verified": true,
      "author": "Dat",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "Ever had a screw loose in your head?",
      "text": "With these headphones that seems likely. I had these headphones for a little over year before 2 screws came out of the hinge holding one of the speakers on, so now it dangles by the cord. Reading other reviews, I'm not the only one. I ordered some replacement screws, but it would have been better if V-MODA would use a locking nut, some loctite, or something to keep the screws from backing out, because they cost far too much to have such a preventable failure.",
      "rating": 1.0,
      "verified": true,
      "author": "Game Junkie",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Best headphone quality for the price.",
      "text": "This is a great set of headphones that rival some of my more expensive music headphones from Sennheiser. Not too expensive, very durable, comes with a convenient hard case and additional headphone cable. They feel great on the ears and although there is no active noise cancellation built it, the suction to the ear is very sufficient making plane trips a lovely experience. Dollar for dollar, this is actually my second pair of this pair of headphones. Great bass, mids and highs that make them terrific for gaming, music or wanting to get some peace and quiet.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Andrews",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Absolutely a great product.",
      "text": "I freaking LOVE these headphones. Combined with a bass-booster or a good amp, the bass is seriously on-point. Bassheads, you'll love them! The fact that they compact into such a small size is AWESOME for travelling around. I listen to them on my way to work everyday as I commute through the busy downtown area and then pack them up when I get to work. They're comfortable, the sound is fantastic, and I LOVE the whole design. 10/10 would recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "The Overlord",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Almost perfect. Sound quality is amazing",
      "text": "Almost perfect. Sound quality is amazing. Build quality is top notch. However, if V-MODA is going to include an inline microphone, they should use a quality component. The inline microphone is just plain garbage. The recording quality of that microphone is one of the worst I've ever used. Fortunately, there's the V-MODA BoomPro upgrade that makes all the difference. Also, for my head and ears, I found that the V-MODA XL Memory Cushions were necessary for proper comfort and sound. Honestly, I think the XL memory cushions should be included with the M-100. For the price paid, I suspect the original cushions don't really cut it for most customers.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan McGeary",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Great with behind the ear hearing aids!",
      "text": "I haven't owned a non-hearing-aid specific pair of headphones since they started making them. These are the first pair of over the ear headphones that are ACTUALLY COMFORTABLE! I did end up buying the XL cushions just to be extra sure they'd be comfy. It doesn't push my aids into my head and hurt after hours of use. Not only are they t-coil compatable, I can FEEL the bass which is SO SO so... dude.. so nice. I can finally wear a headset with a mic that works really well. I can't *really* tell you how good the audio is since I'm... we'll... hard of hearing. But it sounds great to me and I can hear everything clearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Angelina Ravani",
      "helpful_votes": 0,
      "publication_date": 20190923
    },
    {
      "title": "Subjectively brilliant",
      "text": "The modulation of sound by these headphones suits me perfectly. I do not like too much bass and I enjoy clarity in mid-tones. These headphones deliver. Uses these are perfect for: video recording in noisy environments, casual listening to music, additional sound deadening over ear pods or in-ear headphones on long flights or days.",
      "rating": 5.0,
      "verified": true,
      "author": "Folger",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great headphones.",
      "text": "Love these headphones. This was my first real investment in an expensive pair of headphones, and they've completely ruined all of my cheap earbuds for me. Even my sound bar doesn't give me the level of distinction and depth of sound I get out of these. My only issue with them is the clamping pressure, but that's gotten better over time and really only bothers me when I wear glasses and the V-Modas.",
      "rating": 5.0,
      "verified": true,
      "author": "TaylorPretzel",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "Don’t waste your money",
      "text": "The company says it has a year warranty. After 4 mos the sound stopped working in one ear. The company had me ship them to them and then refused to fix them. Offered me 20% off anything else. Don’t waste your money. Who wants a company who doesn’t stand by their product at this price point?!",
      "rating": 1.0,
      "verified": true,
      "author": "Marie B",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Blown away.",
      "text": "I own 3 different monster headphones. I think beats are bass heavy/bass only garbage. I finally decided to upgrade to the next level. V-MODA M-100 is 10 levels above anything I have listened to before. It brings the music \"forward\" and you feel more immersed in it. Some people say the bass is less on these than beats and monsters, but that is simply not true. It's much more sharp and real vs muffled rumbling. The mids are incredible and the highs are very clear. This may just be the last pair of headphones I will ever buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Whiskey Tango Foxtrot ",
      "helpful_votes": 2,
      "publication_date": 20160322
    },
    {
      "title": "Great basshead phones, but the headphone cord is lousy.",
      "text": "Great phones for hip-hop and rap. I tried out the LP2 and the bass was too bloated on those. The M100 have just the right amount of tight bass without overwhelming the entire sound. Also, I found with the LP2, the bass was distorted. I don't find that with the M100s. I also enjoy the M100s with other genres, but these really shine with hip hop and rap. They seal outside noise well. Although not a deal breaker, the reason for the one star deduction is the cheap headphone cord with the VModa locking mechanism. This means the only other cord option is the overpriced $30 VModa coiled cord.",
      "rating": 4.0,
      "verified": true,
      "author": "Dagger",
      "helpful_votes": 3,
      "publication_date": 20150210
    },
    {
      "title": "Great Sound, but uncomfortable fit for people with larger ears.",
      "text": "Excellent sound. I am a bass head, and M-100 headphones have the type of full bass sound that I enjoy. But beware that the headphone ear cups on these are a little small, and if you have bigger ears like myself, they will start to feel uncomfortable after wearing them for several hours. Because of that, I would not purchase the M-100's again. After hearing the Blue Lola's at CES 2016, I think they will be the next headphones I buy at this same price point. The Lola's are super comfy, sound even better than the M-100's in my opinion, but most people would not consider the Lola's \"portable\".",
      "rating": 3.0,
      "verified": true,
      "author": "ScottUSA",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "The absolute BEST!",
      "text": "This is my second pair of VModa headphones. I absolutely LOVE them! They sound great, fit perfectly, and feel amazing. They are not noise canceling but noise isolating. I wear these while DJing, and I can isolate what I'm listening to in the headphones even in the loudest of environments.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Ramos",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Beats are actually terrible headphones.",
      "text": "Is there 6 stars? Do your research. Compare them to Bose, Sennheiser. Beats are actually terrible headphones... if you don't know that check out crutchfield and do a comparison to other 300 dollar headphones. It ends up a close battle between quality other brands listed but I love these! Good price, customizable look, headphones detach/insert either side, can add gamer mic, replace ear pads, absolutely great sound, feel tough, look cool.... case looks/feels like Batman's armor. 6 stars, seriously.",
      "rating": 5.0,
      "verified": true,
      "author": "A.S.",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "You'll never want another brand of headphones again",
      "text": "Best soundstage I've heard for under $300. Best build quality I've owned. Best sound quality over all for an un-powered set below $300. Honestly, these are the best headphones I've ever had. I had the earlier version of this model for years, I only upgraded because V-Moda seriously earned my dollars with their incredible product. Oh yeah, SUPER comfortable, and if you've got giant ears they sell bigger pads on the cheap!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Berger",
      "helpful_votes": 2,
      "publication_date": 20161207
    },
    {
      "title": "Gift",
      "text": "I got these for my friend. The pads are a little smaller than I expected for 'over ear' headphones and they are pretty tight(not the MOST comfortable after a few hours, but still doable)...but in due time that should dissapate. The quality of the sound and item are still on point with my expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Spaceman Chris",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Using headphones for studio work",
      "text": "After almost 25+ years in multiple Sonys, I made the switch after using friends. I enjoy them a lot. I'm running them into an audio interface into a desktop only. I also purchased the xl over the ear cushions to help with noise cancellation. I also purchased the Pro Coil and the Boom Pro Mic. The only negative thing is that I found that the Mic is not combinable with the Pro Coil. That's a disappointment because I then have to switch everything up if I want to play video games. I also put my Astro A50's and my Turtle Beach headsets on the rack and decided to 100's with the Boom Pro mic attachment for gaming.",
      "rating": 4.0,
      "verified": true,
      "author": "Joe C",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Ouch",
      "text": "I love these headphones! The difference is night and day. But the cushions are so dang thin. I started getting a rash on my ear from having contact with the grill for too long of a period and it HURTS!! I’ve ordered the XL cushions replacement and am still waiting for the order to even ship. Why is this even a separate product? Otherwise I would’ve rated 5-stars. If not for how good it sounds, this would’ve been 1-star.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "These. Are. Amazing!",
      "text": "After many hours of research I ended up with the V-MODA Crossfades and I regret nothing. They sound AMAZING and can handle some serious input. They do tend to squeeze the head a bit more than I would like and even the extra XL memory foam cushions barely help. This stores really nicely as it folds up snug into its included protective case. The \"Cross Fade\" function works quite well where you put one input per ear via audio jack. Also includes a microphone cable and a share play cable that is simply a long cable with a split where it plugs into the source providing a female port for a fellow listener to partake.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Corum",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "These headphones are absolutely fantastic. The one and only flaw is the comfort ...",
      "text": "These headphones are absolutely fantastic. The one and only flaw is the comfort aspect. They feel absolutely fantastic on the head. But, they are not so comfortable on your ears. I have medium sized ears, and they sit right up on the cover of the drivers. It is a hard surface, so after about 30 minutes of continuous wear, they do start to become painful on the brim of my ears. I would recommend getting the V-moda XL memory foam ear cushions, as they make a world of difference. Other than that, these headphones are absolutely perfect. They sound amazing and they are tiny and very mobile. 5/5 (with the XL ear cushions)",
      "rating": 5.0,
      "verified": true,
      "author": "Dalasaurus_Rex",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Awesome headphones 👍👍",
      "text": "Had to these shipped to Afghanistan in 2014. and to this current year 2019 I've used and abused them they still sound as good as the first day I brought them",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Great sound, one side didn't lock in purchased through Amazon Warehouse",
      "text": "Purchased this through Amazon Warehouse, which I have had some good luck with in the past. This time there was a minor issue that effected the headphones so I am sending them back. Had some nicks on the band and grease on the ear pads, which I could clean and live with. But one side where it adjusts doesn't lock. It slides in and out freely. This made adjusting them an issue. Other than that they sounded great.",
      "rating": 4.0,
      "verified": true,
      "author": "Jcjwebster",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Mmmmmm....sex on ears",
      "text": "I've been some what of an audiophile for almost 15 years, and I've never heard anything like these headphones before. After pairing it with the ASUS XONAR sound card on my PC, holy crap. Do these headphones and yourself a favor and AMPLIFY THEM! You will be very happy to notice a HUGE difference. I listened to them just plugged in to my iPhone and there is no comparison. They fold up in to nothing, and seem very well constructed. The ONLY bark I have about these headphones is that for \"over the ear\" headphones, they still rest ON my ears, not over them. Hopefully v-moda will be coming out with larger ear pads soon. Other than that, amazing!",
      "rating": 5.0,
      "verified": true,
      "author": "quiXilver",
      "helpful_votes": 3,
      "publication_date": 20130911
    },
    {
      "title": "Worth the hype!",
      "text": "Okay so I'm no audiophile but I believe anyone can tell that this pair of headphones delivers some quality sound. After reading so many reviews here on Amazon, YouTube reviews, and etc, I can say they live up to the hype without a doubt. Pros: Sounds amazing after breaking them in Cons: Depending on the person (like me), the ear cushions my be uncomfortable for you after an hour or two of use. Also, the cord is really short. Additional notes: Keep in mind you need to break them in for at least 12 hours, so expect the m-100's to sound average until they're broken in.",
      "rating": 5.0,
      "verified": true,
      "author": "Dyemare",
      "helpful_votes": 2,
      "publication_date": 20140924
    },
    {
      "title": "Warning: for bass fetishists only!",
      "text": "In terms of the engineering, these headphones are a work of art. I'll give them that. But the sound was so bass-heavy as to make them worthless for me. It may surprise V-MODA, but I actually like hearing *all* of the instruments in a mix, not just the ones with the lowest frequencies. I listened to tracks in a variety of genres (folk, jazz, rock, pop), and in many of them the vocals were close to inaudible, drowned out by painfully loud kick drums and electric basses. I just don't understand why people do backflips over these. I went with Audio Technica ATH-MSR7GM instead; they're incredible. Unless you have a bass fetish, I'd recommend checking them out.",
      "rating": 1.0,
      "verified": true,
      "author": "Don Gately",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "Great headphones! Wonderful build and quality",
      "text": "Great headphones! Wonderful build and quality. The only reason for not giving it a 5 star rating is that the audio is almost a little too clinical. The highs are clear, and the bass is really quite low. It's got the best frequency range of any headphones I've ever listened with, but in the midst of all that, it doesn't have much warmth to it. The sound doesn't fill my ears as much as I'd like. But if you don't mind a slightly clinical and cold sound then add another star. If you mostly listen to acoustic or classical music, add another star. Overall these are great headphones, the last star just depends on preference.",
      "rating": 4.0,
      "verified": true,
      "author": "Micah Tribelhorn",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "I'm very happy with these headphones",
      "text": "I did a lot of research before buying these headphones and even returned a pair of Momentum headphones that I had tried before this pair. The sound on these is phenomenal - truly the best I've had. It comes with two detachable, fabric cords - one with a microphone and one that's just a simple AUX connection. These are very well constructed and seem very durable. The case that is included is pretty impressively solid. Overall, I am very happy with the purchase I made and would recommend these headphones to anybody that cares about having quality sound and a well designed headphone.",
      "rating": 5.0,
      "verified": true,
      "author": "Kacie",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "its finally here",
      "text": "I had a issue with fed ex, the driver didn't come but said they did, so I had to wait an additional 2 days to the original wait to get it. but the product is amazing and im not going to let the shipping companies mistakes ruin a good review of these perfect headphones, they are well built, extremely sturdy, and the sound is crazy, both the bass and audio volume are crazy, first time ive ever turned my computer down to 50% volume, and everything is extremely crisp. the cord is well built, and the jack is a very beautiful gold, these will last you quite some time. if I ever have failure I will update this review",
      "rating": 5.0,
      "verified": true,
      "author": "joseph",
      "helpful_votes": 3,
      "publication_date": 20140211
    },
    {
      "title": "One of the best purchases I've ever made.",
      "text": "Before buying this I was in love with the ATH-M50's. They were amazing, but this is on another level. I absolutely love the sound signature of these. I won't go in depth about the sound signature as others already have and they are far more eloquent and descriptive than I could ever be. However, I can say that the build quality is EXCELLENT and the sound is AMAZING. One of the best purchases I've ever made.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Ball",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "I love these headphones",
      "text": "I have gone through 18 headphonea in a year due to my clumsiness and my dogs disdain for anything that has my attention more than them. These are the best headphones I've ever had in my life! The sound quality is amazing. The hinges are made of steel and the entire equipment is super sturdy. As much metal as the headphones contain, they are really lightweight on your head. They're worth the money and a kidney in my opinion.",
      "rating": 5.0,
      "verified": true,
      "author": "Gee",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "AMAZING Bass when paired with amplifier",
      "text": "I paired these headphones with a Fiio amp and they provide great bass quality. Without the amp it's impossible to fully appreciate these headphones, the amount of bass that comes out of these relatively small cans is impressive. Getting the XL cushions is an absolute must for longer listening sessions, they are far more comfortable than the original ear cushions. Overall a great pair of headphones, durable and great sound quality. For the best experience, definitely pair these with an amplifier and some sound equalization adjustments on your device to increase bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Trent Eisenberg",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Great sound reproduction w/ powerful bass",
      "text": "These are the nicest headphones I own by far, and I can safely say they were money well spent. They aren't exactly neutral, with a heavier, more pronounced low-end, but this suits me well for the style of music I listen to. They aren't so bass heavy as to muddy any of the other sounds, but present enough to have a nice punch on the bass line. To the audiophile looking for perfect audio reproduction these definitely wouldn't cut it, but there are many other options in that category. These headphones are excellent, however, for listening to newer music which demands more bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter Knoble",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Amazing sound, superior build quality",
      "text": "I got tired of over priced, over hyped having y headsets that were made of cheap plastic parts that broke (turtle beach worst offender), and I also appreciate high fidelity sound for music. The construction is top class, entirely made from light but incredibly strong metal, no plastic parts. With the option to add the V-moda pro gaming headset boom mic, I'm never ever buying turtle beach/Astros again. Not that I'll need to think about it for a while as these things are built to last and have fantastic warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Flemo",
      "helpful_votes": 0,
      "publication_date": 20160908
    },
    {
      "title": "WOW!",
      "text": "Just received my new pair of M-100 today. I have spent a lot of money over the last several years on headphones. Klipsch Image One(II), Dre Beats Studio and Executives, Monster DNA, I was happy at the time of these purchases but after receiving my V-Moda M-100 I feel ripped off by all these perpetrators. These things are bad to the bone! Build Quality is Top Notch, The sound is mind blowing. The warranty is 2years with a 50% off Lifetime Immortal if things ever go bad. Not enough companies stand behind their products anymore. Way to go V-Moda you have made a convert of me. V-Moda for life!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20131227
    },
    {
      "title": "Best I've ever owned.",
      "text": "I can't say enough about these headphones. They are simply the best sounding and most comfortable headphones I have ever owned. I wear these all day when I get home from work and have zero discomfort. To my ear they have a great sound balance. Don't ask me to get technical because beyond general description of the sound I have no idea what I'm talking about. All I can say is they sound great, so long as the audio is high quality. Some of my older 360 games sound like they were made with cheap recording equipment. Not the fault of the headphones though.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Schinlaub",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Awesome!!!!",
      "text": "These are the best sounding headphones i ever had or heard. At first i didnt hear much difference between these and the LP version, but once they burned it it is night and day difference. At the discounted price of 164 that i got them for it is a steal. You wont be disappointed.....And they are built like a tank, light and not bulky. The only thing i changed on them is the earpad cushioins, i use the XL version as i already had them on the LPs, its just a matter of preference.",
      "rating": 5.0,
      "verified": true,
      "author": "leandro buttarazzi",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Excellent",
      "text": "I replaced a pair of Sony MDR-V6s with these, and while I could go on and on about how music 'sounds' and what it 'feels' like and a bunch of other subjective nonsense I can for certain say that these headphones are comfortable. I wear glasses, and unlike the MDR-V6s these Crossfades do not pinch my glasses to my skull and remain soft but snug for hours. Very nicely built as well, although (especially coming from the Sonys) the cord is quite short for desktop use. Lucky for us V-Moda saw fit to include a 'share' cable, which you can use as an extension instead. They sound nice too.",
      "rating": 5.0,
      "verified": true,
      "author": "PacificaPinch",
      "helpful_votes": 3,
      "publication_date": 20130327
    },
    {
      "title": "Worth the Money",
      "text": "These cans are a bit pricy but overall im satisfied with them. I have owned Beats Studio, Audio Technica M50x, and some Monster Ncredibles. The M50x are the best of the bunch as far as sound quality goes but the VModas feel much more comfortable. With that being said i still would recommend these to anyone looking for a brand new set of cans. If price is an issue buy the M50x's they provide better sound at a much cheaper price. If you care about looks and comfort while listening to music go with the M-100's.",
      "rating": 4.0,
      "verified": true,
      "author": "ulises",
      "helpful_votes": 0,
      "publication_date": 20161117
    },
    {
      "title": "Best $300 i spent on headphones",
      "text": "I usually don't like spending over $100 for headphones and I was really skeptical paying $299 for headphones but I was like heck why not and I don't regret paying $299 for these. These are big and heavy looking headphones but they are really comfortable ( If they aren't at first they will once you break them in). These headphones are stylish and in my opinion looks a lot cooler then Beats by Dre headphones with its almost all metal build. These headphones fold which makes them a lot better transporting them since they fit in a small case I can easily put in my bag.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Dunn",
      "helpful_votes": 3,
      "publication_date": 20131012
    },
    {
      "title": "Lackluster",
      "text": "this prosuct was rather disappointing thats not to say it is bad, but I feel there are much better options for the money. The comfort on these headphones is lackluster. The noise cancelation is okay and I haven't had any problems with that aspect of it.",
      "rating": 3.0,
      "verified": true,
      "author": "Dawson",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Amazing headphones",
      "text": "Truly some of the best headphones I have ever owned, has lasted my over 4 years now with no issues. Only complaint is the default ear cushions were to small and very painful, I switched to the big ones which have held up well. I just don't see why they don't come included in the box, or be an option to have a version of these headphones with them pre-installed, seems like quite a few people have had issues with the default ones as well. That aside, definitely worth the buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "Fantastic build quality",
      "text": "As an example of how good the build quality is for these, I slammed my head into a big wall-mounted box with these on about a week after buying them. Headphones are fine, with a line of paint missing from the side. I love how the cans snap up into place for easy carrying, and the perfectly-sized carrying case that comes with it. Everything about these headphones screams good design, and the sound quality is great. There's also an included splitter for plugging a second pair of headphones in, which is great for teaching friends how to DJ.",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Excellent quality at a reasonable price!",
      "text": "Bought these for my husband who is very picky about his audio. He really likes them, but says they aren't 100% noise canceling. I am not sure any headphones are, but I don't know much about that kind of thing. The earpieces were too small for him (he's a big guy), but the xl headphones weren't very expensive and easy to change out. I also like that you can personalize them with different graphic plates, etc. Overall, a great value - excellent quality at a reasonable price.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa W.",
      "helpful_votes": 0,
      "publication_date": 20161109
    },
    {
      "title": "Perfect headphones.",
      "text": "Only the best heaphones for gamers and audiofiles who want quality with sound and appearance along with comfort and customizability. These headphones are top notch and well worth the price. The cord is nice and long although it comes with 2 so you can use the shorter one. The long one comes with a splitter so you and your partner can plug in together. These are super comfortable and fold up nicely to be super compact. Ive. Had mine for over a year now and take them everywhere. I recommend this product 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Morreale",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Outstanding headphones",
      "text": "Pros: Near perfect sound reproduction with punchy bass and detailed highs. Very compact. Outstanding build quality from the strap/drivers to the woven kevlar cables. Attractive, but not in-your face style. Three (3!) people can listen to the same audio source wearing their own headphones with these (plug on each cup and a cable splitter included). Cons: I occasionally note muddy mids in bass-heavy rock/pop music. Original ear-pads were comfortable for short listening sessions, but hot spots occurred where my ears hit the drivers; the XL pads (available on the v-moda website for $20) completely fixed this with no change in audio quality or headphone appearance.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin O.",
      "helpful_votes": 3,
      "publication_date": 20140127
    },
    {
      "title": "Amazing headphones. Worth the $.",
      "text": "I've had mine for over three years and all I can say are amazing things! I haven't had any problems, and have logged so much time into their use ranging from gaming to vigorous music binges at high volume. I've worn them out in freezing pouring rain and the blistering heat. I've even dropped them so many times. They are still holding strong. Even the original cord it came with is in working condition, only having minor aesthetic problems. By far the best headphones I've ever experienced. Blows anything out of the water. 9/11 would buy again or recommend to another. V-Moda, keep doing your thing you beatiful company!",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 0,
      "publication_date": 20160920
    },
    {
      "title": "Headset gets better with age.",
      "text": "This headset only gets better and better. I've had my V-Moda Crossfade M-100's for 4 years and they did take some breaking in but now I wouldn't trade them for anything. They have great range and spacial depth. It wasn't so much apparent when they were new but after time they sound like nothing else. I use them daily with my phone and computer. I also have some bluetooth headphones but they don't compare. I use this headset withand have upgraded the pads with.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecil Adams",
      "helpful_votes": 0,
      "publication_date": 20131212
    },
    {
      "title": "Great job V Moda",
      "text": "At first I didnt know what to think about the sound sig of these cans. They are so bass heavy compared to the Beyerdynamic T 70s Im used too. But now that Im used to them, I really like them. They are heavy on the bass, but not muddy, more precise. Great job V Moda! Anyone who says they are not good for rock are wrong. They sound fantastic. I cant believe you can get this good of quality for this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Backpacker",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "Been using it for 5 years and still going strong",
      "text": "I love everything about these headphones. I've been using them every day for five years. I had to replace the ear cups once, and the cable twice due to fraying, but they still work like new. I can't recommend these highly enough for people who like durability without sacrificing top notch sound.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Good Sound... plastic parts fall off",
      "text": "I bought a pair about 18 months ago... I don't use them all that often (maybe 3-5 times a month). Today, I put them on just as I always do and the plastic parts on one side fell off. I've enjoyed the sound these produce ... however, for the price I paid I'm wondering - why utilize cheap plastic parts... sigh.",
      "rating": 2.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Fantastic long-lasting headphones for bass heads and audiophiles.",
      "text": "I've had these headphones for two years and I'm a V-Moda fan for life now. The bass response, comfort factor, everything is perfect. Haven't had any issues at all with these and you can really feel the punch that the dual 50 MM drivers provide. I'm aware there are newer and wireless models available, but I see no reason to upgrade at this point.",
      "rating": 5.0,
      "verified": true,
      "author": "Arrowslice",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Cable malfunction",
      "text": "The headphones are great however one of the cables malfunctioned shortly after using it and only 1 earpiece plays sounds correctly. I have to keep the button on the cable pressed in for It to work properly, I don't like walking around with a paperclip on the cable. It did come with two cables but the second oned is for tandem listening and is longer than I would like to travel with.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170411
    },
    {
      "title": "These headphones sound amazing!! I listen to mostly rock and metal ...",
      "text": "These headphones sound amazing!! I listen to mostly rock and metal music so if you like bands such as Deftones, Breaking Benjamin, Blessthefall, Silverstein, All That Remains, A Day to Remember then you'll love these! I've been messing around with the sound equalizer on both my laptop and my phone with these connected and they sound phenomenal with everything. I bought the refurbished ones from V-Moda direct and I couldn't even tell they were refurbished and completely forgot all about it until I logged on to leave a comment.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20150829
    },
    {
      "title": "Phenomenally well constructed and beautifully sounding piece of art!",
      "text": "It took me 3 tries to find the right headset but my persistence certainly paid off! The Crossfade M-100 are phenomenal. They're a tank when it comes to build quality. They sound as good as headphones I've tested more than 2x the price. They provide a great cord I can use in any of the two earcups, they provide an inline jack to plug in a 2nd headset, the packaging was awesome and the overall experience was, well, amazeballs. Well done V-MODA!",
      "rating": 5.0,
      "verified": true,
      "author": "jhwhiteh",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "CHECK out the m50x first before deciding to buy this",
      "text": "Unless the you think that the design is worth $150 more then the Audio Techic m50x don't buy it. The sound is very close to each other and it u need to buy the XL pad (which is $25 more) in order for it to be comfortable. The built quality are the same.",
      "rating": 3.0,
      "verified": true,
      "author": "DDKST",
      "helpful_votes": 27,
      "publication_date": 20160410
    },
    {
      "title": "Solid DJ headphones",
      "text": "Very high quality headphones. Comparable to any DJ headphones. Solid construction. Clamshell case included. We use them for DJ work, and these surpass my current DJ headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Gonzales",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Good sound quality",
      "text": "Good sound quality, can add a mic attachment to use for Voice over Internet (P-something?). Sturdy as heck, they look good, and are comfortable. Every so often I need to stretch out the headband so they don't clamp onto my ears, but they're designed for that (check the V-Moda website, they specifically recommend this - obviously don't yank as hard as you can).",
      "rating": 5.0,
      "verified": true,
      "author": "David Arron",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Sound is awesome!",
      "text": "I has a set of Beats by Dre studio executives that needed to be replaced. The sound stopped working in the right ear after a year and a half, for no reason at all. Did a lot of research before I invested a hefty sum in another over-ear headset. All signs pointed to this pair and I can see why. The sound is better and the quality feels fantastic. Plus it doesn't need batteries to induce noise cancellation as the Beats did. Just plug and play.. or plug and listen I guess. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Garcia",
      "helpful_votes": 2,
      "publication_date": 20140618
    },
    {
      "title": "The 30 Sony headphones work just as well",
      "text": "They’re ok. I have 5 stars because my 30 buck Sony’s sound the same. I’m always hoping for really awesome sound and a bass adjustment but they’re ok. I bought them for 100 and would never pay 250 like they have them at Guitar Center.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly L.",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Best headphones I've owned",
      "text": "Great design, comfortable, and, most importantly, GREAT sound! I use these for all types of music genres and they sound super clear with all of them. Also, since they're closed-back headphones, I can use these on an airplane and neither have to hear the noise from the airplane nor bother anyone while I'm blasting my music.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt M.",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "V-Moda Crossfade M-100 Over The Ear Headphones",
      "text": "V-Moda Crossfade M-100 headphones are absolutely awesome. Best sound I have ever had the privilege of listening too. I listen to a lot of the Rock 'n' Roll Oldies from my past. Its as if I'm listening to brand new music and you can hear all of the vocals as well as all of the instrumentation in a wonderful new and very pleasing way. Great choice on my part. Magnificent workmanship on the V-Moda Crossfade M-100. Thanks for the privilege and the many hours of listening pleasure.",
      "rating": 5.0,
      "verified": true,
      "author": "Murrel Lowry",
      "helpful_votes": 2,
      "publication_date": 20140905
    },
    {
      "title": "Sound-wise they sound a tad bit better than my ATHM50s",
      "text": "Just got these and have been wearing them for about 5 hours now. All I can say is OUCH!!! I have tried straightening the headband several times and even with them barely making any pressure on my ears they still hurt. I have the V-MODA XL Memory Cushions ordered will update on how it feels. Sound-wise they sound a tad bit better than my ATHM50s. I feel as though the ATHM50s were a bit more \"sound proofing\" than the M-100s. :( I should have just ordered the ATHM50s Update: The V-MODA XL Memory Cushions make all the difference. Now I'm able to wear the headphones hours at a time without my ears hurting.",
      "rating": 3.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 3,
      "publication_date": 20150210
    },
    {
      "title": "Take comfort into account when buying these",
      "text": "There is no doubt these are one of the best headphones out there, however the padding on the earcups are minimal which leads to the drivers poking at your ears. To solve this problem v moda sells the xl pads but i think if it was a design problem the xl pads should be included with the headphones. It would have been 5 stars if it wasn't for comfort. My advice is do not buy this headphones without getting the xl pads immediately at checkout.",
      "rating": 4.0,
      "verified": true,
      "author": "JTECH",
      "helpful_votes": 2,
      "publication_date": 20150320
    },
    {
      "title": "These are fantastic headphones. I use them with my Xbox one ...",
      "text": "These are fantastic headphones. I use them with my Xbox one and PC for gaming. The memory foam ear cups are a must as they are soft and plush on your head. Quality cables and design for sure. I also changed out the side plates. Shown is the m100's with the extra memory foam ear cups and matte black side plates.",
      "rating": 5.0,
      "verified": true,
      "author": "Larryw",
      "helpful_votes": 2,
      "publication_date": 20160818
    },
    {
      "title": "Best headphones ever",
      "text": "I am an electronic DJ, and have played with many different sets of phones over the years. These are by far the most comfortable set I have ever owned, and the sound quality can't be beat. The only drawback that I could see for a DJ is that there is no swivel for easy one eared monitoring. I never take my phones off so for me it's not an issue, but I could see whee it may be for others. Pros Great highs and mids with no muddling Very comfortable Cons No swivel Low bass",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 2,
      "publication_date": 20131225
    },
    {
      "title": "Excellent headphones, great experience.",
      "text": "Fantastic headphones. I bought these for the punchy and they're just right. Very crisp quality throughout all my music library. Very comfortable, I never feel like I have to take them off to give my ears a break. They're easy to fold up and has a nice storage/travel case. It comes with two cords, one standard length (black) and the other is extra long (Red/black), both of which are made from very high quality fabric. The black cord even has a switch that allows you to control music skipping when you're listening to an ipod. High recommend these headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "Orgasmic sound",
      "text": "As a college student who has no business buying a pair of these, I highly, highly recommend them. The first bass drop literally curled my toes. I've owned Bose and Sonnheim headphones... These are my preferred. The bass is a bit tweaked up, but it feels like you're driving next to the Escalade with spinners. I'm very, very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "JackalSwitch",
      "helpful_votes": 3,
      "publication_date": 20150905
    }
  ],
  "product_meta": {
    "title": "V-MODA M-100-U-SHADOW Crossfade M-100 , Shadow",
    "description": "Color:ShadowCrossfade M-100 are the world's first crowd sourced, lightweight metal, noise-isolating headphones. The modern audiophile sound signature is the winner of 20+ Editors' Choice Awards, including CNET & Voted #1 Headphones by DJ Mag back to back. Over 40% of the world's top 100 DJs use the Crossfade M-100 on stage, on the road and in the studio.\n\nFROM THE MANUFACTURER\n\n\nUSA Today Reviewed.com named the Crossfade LP2… \"2012 headphones of the year\"\nCrossfade M-100 raises the bar for both precision audio and rock-solid engineering…Why M-100?  * Superior Sound Unrivaled Durability Comfort, Customization, Style Compact Portability Detachable Microphone & Audio Cables \n   \n\nSuperior Sound \n\"I completely fell in love with the Crossfade M-100s\" -Gizmodo\n\nImmersive 3D Soundstage… evokes the experience of a live performance\nClean Deep Bass… feel and hear the precise vibrations of your music without bloated boom or a muddy mid-range\nUltra Wide Clarity & Vivid Midrange… hear lifelike vocals, crystal clear cymbals and crispy hi-hats\n\n- - -\n\n\"the sound here is excellent\" -NY Times\n\n\"M-100s are incredible... There's nothing I'd recommend more\" -Popular Science\n\"M-100s totally knocked me out... the sound was remarkably open and spacious, a rare feat\" -CNET\n\nview M-100 awards and reviews\n\n- - -\nM-100's explosive sound is created by: *  50mm Dual-Diaphragm Driver (Patent Pending): Inner and outer rings separate the bass from bleeding into the mids and highs Master Crafted Materials: More expensive driver and components than peer headphones at this price range Modern Audiophile Tuning: Crowdsourced alongside the producer and audiophile community to fine tune the sound and ergonomics Analog Noise Isolation: Naturally cut out the distractions of jet engines, crying babies and crowd noise No Batteries or Artificial Processing: Powerful, pure sound without the two extra digital-to-analog conversions of battery powered headphones that pollute the purity of your music Minimal sound leakage: Immersive sound for you without bothering others view details Consistent Driver Quality: The spectacular Crossfade sound is quality tested at 6 frequencies to maintain stricter consistency than the competition, often by an order of magnitude\n\nDurability: Built to Last\n\"One of my top passive on-the-go headphones of choice, for both its sound and durability\" -Head-Fi Founder, Jude\n *  Virtually Indestructible STEELFLEX Headband Steel Frame and Interchangeable Aircraft Grade Metal Shields Exoskeleton Form-Fitting Case Tested Beyond Military-Level Quality MIL-STD-810G Test Standards * Kevlar Reinforced Cable/Plug Bend: Cables and 45-degree plug can bend over 1 million times (100x industry standard)\n    * Concrete Drop: Survives 70+ drops on concrete from 6 feet (10x industry standard)\n    * Headband Bend: Steelflex can bend 10+ times flat\n    * Environmental: High and low temperatures, humidity, salt spray and UV exposure\n   \n   \n\nComfort, Customization, Style\n\"VMODA started the idea of fashion headphones in 2004…\" -Stereophile + Innerfidelity Editor, Tyll\n\n *  Inspired in Italy, Styled in Hollywood: Stylish colors and metal beats plastic headphones 4+ Years of Ergonomic R&D: Resulted in an ergonomic headband and hexagon shape that contours to the natural lines of your facial features and minimizes gaps Supple BLISS Memory Foam Cushions: Naturally forms to your ears to provide ergonomic comfort and noise isolation for extended listening sessions Optional Custom Shield Kits: Laser engrave your logo, favorite team or change your shield color Optonal Cables & Ear Cushions: Choose from a variety of color and feature options so that you have a different headphone than everybody else\n\nPortable Exoskeleton Case\n\"First full-size, audiophile-friendly headphone we've seen that you can really take anywher\" -Sound + Vision *  CliqFoldtm Hinge: Swiss-like hinge mechanism precisely folds the headphones into the impossibly small exoskeleton case (patent pending) Exoskeleton V-STRAP: Organize your cables and 1/4\" adapter as well as a USB Flash Drive and Fader earplugs via the V-STRAP system Carabiner Clip: Safely store your headphones on the outside of your bag for quick access\n\n\nview larger Detachable Cables: Make the Call. Share the Vibe.\n *  Dual Inputs & V-CORK: Mix two sources at the same time or daisy chain headphones with your friends; the included V-CORK seals & protects the unused input SpeakEasytm Mic Cable: Specially tuned for voice recognition and calls in the noisiest environments, the button control universally works with all 3.5mm smartphones and tablets including Apple, Android, Windows, Kindle and Blackberry SharePlaytm Audio Cable: Share your music on a ride or DJ tandem without adapterss Optional BoomProtm, CoilProtm & 3-Button Cables: Extend your functionality with a professional-grade boom mic for gaming and Skype, a locking extended coiled cable for musicians or a 3-button mic cable for Apple in a variety of colors\n\nWhich One is for You?\n\nCrossfade M-100Crossfade LP2Crossfade LPCrossfade M-80\nwhite silvermatte black\nshadow\nmatte black\nnerogunmetal black\nchromerougewhite pearl\nshadowwhite pearlTypeOver-Ear Over-Ear Over-Ear On-Ear Sound Signature M-Class \"Modern Audiophile\" LP-Class \"Live Play\" LP-Class \"Live Play\" M-Class \"Modern Audiophile\"\n\n\nCharacter audiophile balanced, precision bass, vivid mids, crystal clear ultra wide highs, 3D sound stagerefined vibrant bass, vivid mids, vivacious highs, 3D sound stagevibrant bass, vivid mids, vivacious highs, 3D sound stagebalanced, precision bass, vivid mids, crystal clear highs, 3D sound stageDriver M-100 Dual-Diaphragm\n50mm LP2 Dual-Diaphragm\n50mm LP Dual-Diaphragm\n50mm M-80 Dual-Diaphragm\n40mm SteelFlex Headband Passive Noise Isolation Exoskeleton Case CliqFold Dual Inputs SharePlay SpeakEasy Mic CoilPro Compatible (not included) BoomPro Compatible (not included) Kevlar Reinforced Cables • 1-Button SpeakEasy mic cable\n• SharePlay audio cable • 3-Button mic cable\n• Extended Audio cable • 3-Button mic cable\n• Audio Only cable • 3-Button SpeakEasy mic cable\n• 1-Button SpeakEasy mic cableCustomization reveal shield kit gunmetal shields included\nreveal shield kit reveal shield kit reveal shield kit Warranty 2 Year + Immortal Life 50% 2 Year + Immortal Life 50% 1 Year + Immortal Life 50% 2 Year + Immortal Life 50% View / Compare the entire V-MODA Product Line World's First Crowdsourced Headphone\n\"UNIQUELY DEVELOPED alongside online audiophiles, musicians, editors - a true collaboration.\" -Head-Fi Founder, Jude\n\nV-MODA is the authentic music brand that fuses fashion and function. Headphones are an essential tool for mobile producers and musicians who require unparalleled performance delivered reliably, night in and night out. The founder of V-MODA, also a producer and DJ, designed the Crossfade series to deliver professional sound yet withstand even the rigorous needs of globetrotting travelers. V-MODA's professional pedigree is shown through a clear history of innovation: the Hex design, product, drivers, CliqFold, SharePlay, CoilPro, SpeakEasy, 45-degree plug, V-CORK, packaging and accessories are all patented or patent pending.\n\nThe M-100 was master crafted by the people - over 200 online audiophiles, editors, artists, DJs and Grammy-winning musicians collaborated for years on the tuning and features. V-MODA utilized hundreds of prototypes to gain feedback from the collective masterminds of the best in the business to create a versatile crowd sourced headphone. Satisfaction Guaranteed\nTwo-Year Warranty - Immortal Life Program - 60-Day Test Drive Guarantee: Each M-100 purchased from a Verified Reseller is backed by a 2-Year V-MODA Premier Warranty, more than double the industry average. In the unlikely event you run over your headphones with a tank, with the V-MODA Immortal Life Program, you get 50% off a replacement for a lifetime. V-MODA is so confident the M-100 is a superior headphone, it even offers an unrivaled 60-day test drive guarantee. Technical Details\n *  What's included: Crossfade M-100, Exoskeleton carry case, caribener, Kevlar reinforced SpeakEasy Microphone control cable, Kevlar reinforced SharePlay audio cable, 1/4\" pro adapter, V-CORK (2), instant six-star support code, V-MODA Sticker Type: Over-Ear Circumaural Frequency Response: 5 - 30,000 Hz Sensitivity: 103 dB @ 1kHz 1mW Microphone Sensitivity: -42dB @ 1kHz Impedance: 32Ω Weight: 280g",
    "rating": 4.4,
    "feature_bullets": [
      "Award-winning M-Class sound tuned by over 200 audiophile aficionados. Connectivity Technology: Wired",
      "Patented 50mm Dual Diaphragm Drivers to separate bass from mids and highs",
      "Compact design for easy transport"
    ],
    "specifications": {
      "Item Weight": "9.9 ounces",
      "Product Dimensions": "4.5 x 7.04 x 9.5 inches",
      "ASIN": "B00A39PPCG",
      "Item model number": "M-100-U-SHADOW",
      "Batteries": "1 Product Specific batteries required.",
      "Customer Reviews": "4.4 out of 5 stars2,729 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#1,383 in Over-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 21, 2012",
      "Color Name": "Shadow",
      "Connector Type": "3.5mm to 3.5mm",
      "Size": "One Size",
      "Battery type": "Lithium",
      "Color Screen": "No"
    },
    "categories": [
      "Over-Ear Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 174.72
  }
}