{
  "website_summaries": [
    {
      "verdict": "Durable steel mesh square veil that can be tied down with drawstrings or attached to a bee suit with included zipper.",
      "pros": [
        "Strong steel wire mesh prevents beestings",
        "Good peripheral vision and ventilation",
        "Elastic secures top of veil onto helmet",
        "Includes complete zipper that can be sewn onto your bee suit or jacket to secure veil instead of drawstrings",
        "Square veil folds flat for easy storage"
      ],
      "cons": [
        "Must purchase helmet separately"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works well...",
      "text": "Product works well and has a 2 part zipper so it can be sewn onto a light jacket or bee suit. Seems to be well made and durable. Since I am one of those that doesn't like using a full suit or jacket being in such a hot and humid area it works great for me. If bees are aggressive, I can throw on a windbreaker or light jacket and continue on.",
      "rating": 4.0,
      "verified": true,
      "author": "victor",
      "helpful_votes": 9,
      "publication_date": 20140414
    },
    {
      "title": "Just OKAY",
      "text": "It works, but if you're going to buy one opt to buy the one that comes with the jacket or suit. It has a zipper attachment at the base of the vail, when tucking it into my shirt it can sometimes gap (ouch!). If you get the combo jacket/veil then you won't have this problem. Also, the helmet/veil doesn't sit perfectly and slides around - and when you're up to your elbows in a hive, this SUCKS!",
      "rating": 4.0,
      "verified": true,
      "author": "Verified",
      "helpful_votes": 6,
      "publication_date": 20151121
    },
    {
      "title": "Wasps and bees can't get in... I like that!",
      "text": "Gave me the confidence to dig around out in my yard where wasps regularly nest among the plants and cactus. I had a cactus grove that needed removing and I knew there were wasps in there... They buzzed around me and I would have ran like hell if not for this protecting my face and neck.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Copeland",
      "helpful_votes": 3,
      "publication_date": 20141025
    },
    {
      "title": "Works well for quick checks",
      "text": "Works well with the hat I also purchased. When not neededing the full bee suit it protects yout face.",
      "rating": 5.0,
      "verified": true,
      "author": "BEVERLY",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "A Mosquito Repeller",
      "text": "This is a Christmas gift for my son-in-law who is an absolute mosquito magnet in the summer! He is always complaining about being attached when he cuts the grass in the summer, so we will see if he wears this, and if it helps. Never thought I would find one of these, let alone as a lightening deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Zhenya's Muse",
      "helpful_votes": 2,
      "publication_date": 20141218
    },
    {
      "title": "great protection, but difficult to find the right hat/helmet.",
      "text": "Finding a hat/helmet that fit was a pain in the butt. Why doesn't mann lake sell the helmet pictured. I tried 3 hard hats, but I did not have a wide brim hardhat and I had to rely on duct tape to secure the veil to the helmet. I tried several other brimmed hats in my collection of headwear before settling on one of my heavy leather hats with 3\" brim which worked great, but I would have preferred to get the wide brimmed hardhat pictured, Mann Lake should sell the helmet pictured if they want to really make this product 5 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "jeff",
      "helpful_votes": 6,
      "publication_date": 20141130
    },
    {
      "title": "Poorly designed bee veil.",
      "text": "This is a poorly constructed bee veil - I found it too difficult to manage when placing a cap or hat in the center and in putting it on and off. I had to return it due to its impractical design.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "Very usful.",
      "text": "Worth the cost and very easy to use and work with, and would purchase again if needing another. Thanks again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20140115
    },
    {
      "title": "Quality Product",
      "text": "This is a good large size bee shield. The neck is long enough that you can tuck it into your shirt. No bees got in. Good visibility, Great price. Does not come with a helmet, must purchase separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Mason Johnson",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "Works great.",
      "text": "Had to replace a very old one. Love this veil works great and is easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "DSP",
      "helpful_votes": 0,
      "publication_date": 20180304
    },
    {
      "title": "great hood",
      "text": "This is a great product. I am happy witht he quality of the veil. I got it with a zipper so I can use it on my jacket or suit but for now I have been just putting it on without anything to zip it to. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Strider",
      "helpful_votes": 2,
      "publication_date": 20140612
    },
    {
      "title": "I bought the Mann lake suit with the cheeper head ...",
      "text": "I bought the Mann lake suit with the cheeper head net. This one is advertised with a Pith helmet which doesn't come with the head net. The advertising doesn't tell you that. Second, you would think the zipper would zip into the Mann Lake suit. No, the zipper is sewn in backwards so that you cant do that.",
      "rating": 2.0,
      "verified": true,
      "author": "Wing Whacker",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "It does the job, I got it because it ...",
      "text": "It does the job, I got it because it was inexpensive. Im not using it with a full suit, wish the veil was a little longer.",
      "rating": 3.0,
      "verified": true,
      "author": "deholtsl",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Item is useless without the",
      "text": "this item does NOT come as shown. this is very misleading. Item is useless without the helmet",
      "rating": 1.0,
      "verified": true,
      "author": "E. Walker",
      "helpful_votes": 3,
      "publication_date": 20141204
    },
    {
      "title": "Three Stars",
      "text": "Product need a helmet the picture is deceiving, make sure you say without a helmet please. thanks",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 3,
      "publication_date": 20140823
    },
    {
      "title": "Works as described. Didn't come with plastic part at ...",
      "text": "Works as described. Didn't come with plastic part at top. My own fault for missing that in the description.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Hale",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "KC",
      "text": "I made a water fall out of wood and rock in my back yard. It is the almost exact size of a bee tenders bee hive. They really didn't cause much problem (Bee scientist try to figure out why bee populations are down. When you scare Americans about the danger of African Bees they take action, mine where dossal and didn't bother my Border collie) but I am moving and they had to go. GREAT VEIL TO HAVE AROUND FOR BUG KILLING! reasonable cost but zipper on the bottom is only good if you have a suit to zipper too.",
      "rating": 4.0,
      "verified": true,
      "author": "FIREGURU",
      "helpful_votes": 4,
      "publication_date": 20140430
    },
    {
      "title": "Five Stars",
      "text": "Nice when you just need something to protect your face from the bees",
      "rating": 5.0,
      "verified": true,
      "author": "Yellow Bees",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "Fast Service",
      "text": "Glad to have it... will order more , when in need.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Burns",
      "helpful_votes": 0,
      "publication_date": 20141023
    },
    {
      "title": "Perfect",
      "text": "This veil arrived as described and on time. My wife is looking forward to using it as she begins her new hobby.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Miller",
      "helpful_votes": 4,
      "publication_date": 20140126
    },
    {
      "title": "Deseiving PIcture",
      "text": "I Sent it over to Uruguay as a present and the user got really disappointed, picture is deseiving. Did not like it at all",
      "rating": 1.0,
      "verified": true,
      "author": "sofia guidobono",
      "helpful_votes": 2,
      "publication_date": 20141204
    },
    {
      "title": "I was stung on both sides of my neck while ...",
      "text": "I was stung on both sides of my neck while inspecting one of my aggressive hives at least 14 times using this same model of veil that I purchased from Mann Lake. The bees attempted to get thru the ventilation areas too. It is not a safe piece of equipment to use for beekeeping.",
      "rating": 1.0,
      "verified": false,
      "author": "ChowOwner",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Looks great, tried it on",
      "text": "Looks great , tried it on , and it fix great , we'll be getting our Bees this coming spring.",
      "rating": 4.0,
      "verified": false,
      "author": "Northsman",
      "helpful_votes": 2,
      "publication_date": 20140718
    }
  ],
  "product_meta": {
    "title": "Mann Lake CL110 Stingless Binding Square Folding Veil with Zipper",
    "description": "This square veil is constructed of 10 mesh steel wire. It folds flat and has stingless binding. Helmet is required. Comes with both halves of the zipper so you can sew it on your suit. Measures 10-5/8-inch length by 10-3/8-inch width by 8-1/2-inch height.",
    "rating": 4.3,
    "feature_bullets": [
      "This square veil is constructed of 10 mesh steel wire",
      "It folds flat and has stingless binding",
      "Helmet is required",
      "Comes with both halves of the zipper so you can sew it on your suit",
      "Measures 10-5/8-inch length by 10-3/8-inch width by 8-1/2-inch height"
    ],
    "specifications": {
      "Product Dimensions": "10.63 x 10.38 x 8.5 inches",
      "Item Weight": "8.8 ounces",
      "Manufacturer": "Mann Lake",
      "ASIN": "B00B8L5I66",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "CL110",
      "Customer Reviews": "4.3 out of 5 stars61 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#75,298 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Farm & Ranch",
      "Beekeeping Supplies",
      "Garden & Outdoor"
    ],
    "price": 28.9
  }
}