{
  "website_summaries": [
    {
      "verdict": "Completely plant-based, this quality dry dog food is suitable for both vegetarian and vegan diets.",
      "pros": [
        "Contains a good mixture of healthy pulses, fruits, vegetables, and grains",
        "Plant protein comes from chickpeas and peas, so it has a lower glycemic index than many other vegan dog foods",
        "Uses vegetables from quality non-GMO sources",
        "Owners report their dogs find this kibble extremely palatable"
      ],
      "cons": [
        "Pieces may be too large for very small dogs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The only food that stopped my dog’s lifelong itching.",
      "text": "I’m on my second bag of Halo vegan dog food. I mix it with pumpkin and herbs and vitamins from her holistic vet and her lifelong itching is finally gone. I’ve tried raw, all organic, etc and nothing worked until this... I only wish I knew of this sooner. I thought it was immoral to feed my dog only veggies but thirteen years later and permanent eye damage ( scratched cornea, etc) she is now at peace. Please do not hesitate to try this for your little pooch if they suffer from allergies. This could be the answer to your prayers.",
      "rating": 5.0,
      "verified": true,
      "author": "amnesiantoinette",
      "helpful_votes": 57,
      "publication_date": 20180202
    },
    {
      "title": "My dog's farts no longer smell!",
      "text": "Fantastic-- it cleared the air, literally. As a Frenchie owner I have dealt with really awful & frequent farts from my little Sophie. She still farts, but the farts don't smell!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 57,
      "publication_date": 20170504
    },
    {
      "title": "For Love & Money",
      "text": "This is a great, wholesome food for my sweet 12-year old pooch. She's been on this food for about four years and is thriving! No more skin issues. Perfect weight. Lively as a puppy. I've read some complaints about the price, but this is definitely a product worth paying for. In other words, for the love of my dog, the environment, and for my piece of mind - - It's worth every penny! Besides, my finicky dog loves this food. I serve this with a whole cup of water in it, and it stays crunchy and she drinks all the water. By the way, we also give her Vegan treats called Max & Ruffy's. Also highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "TreeSFS",
      "helpful_votes": 20,
      "publication_date": 20160308
    },
    {
      "title": "Our dogs actually love to eat this more than their Orijen puppy kibble!",
      "text": "We have been feeding our dogs a blend of 50/50 Orijen large-breed puppy kibble and vegan dog food for over a year. This is their favorite vegan dog food. We plan to transition them to a 75/25 or maybe a 100% vegan diet eventually, but have been waiting as they are both developing puppies (one is a Cairn terrier and the other is a Golden retriever). Both are happy and healthy and actually prefer this kibble even over their meat kibbles. I only wish it came in larger bags.",
      "rating": 5.0,
      "verified": true,
      "author": "EveryoneIsAnotherYou",
      "helpful_votes": 9,
      "publication_date": 20170211
    },
    {
      "title": "Lots of fiber!",
      "text": "I used this to supplement the homemade dog food I feed my girls. They seem to like it but.... It goes right through them. Lots and lots of poop. If you do feed your dogs this, don’t do it for their dinner meal unless you plan to walk them late. I woke to poop everywhere.",
      "rating": 1.0,
      "verified": true,
      "author": "JoJo222324",
      "helpful_votes": 6,
      "publication_date": 20181111
    },
    {
      "title": "her eyes are no longer yellowish and the blood test proved that she is in perfect health. I recommend Halo to any dog owner ...",
      "text": "My dog loves it. My dog is 10 yrs old and for the past two years has been on a plant based diet. She had cancer so I decided to change her diet. It worked. She is much more energetic, her fur is shiny, her eyes are no longer yellowish and the blood test proved that she is in perfect health. I recommend Halo to any dog owner who cares about your dogs health.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 7,
      "publication_date": 20180312
    },
    {
      "title": "Product rancid",
      "text": "I'm disappointed that there was a return window for this product as I was waiting to be almost done with the previous food before opening the new bag. It smells of rancid oil and my dog won't eat it. Now I'm stuck having paid and still need a new bag. I also don't want to order another bag for fear it will also be rancid. I will have to go back to the previous brand for now and I know it's not recommended to switch foods often due to potential gastrointestinal distress.",
      "rating": 1.0,
      "verified": true,
      "author": "MoJo JoJo",
      "helpful_votes": 6,
      "publication_date": 20180822
    },
    {
      "title": "My dogs had no adjustment period.",
      "text": "My dogs have traditionally eaten Blue Buffalo for the last 5 years after I heard about all the lawsuits aimed at Purina Dog food brands causing stomach cancers and other ailments. I bought a bag of this vegan dog food to see if my dogs will like it. I wanted a way to make my dogs healthier because of a recent vet visit to one of my dogs. I poured the first bowl and all 3 of them were eager to try this food. This food is relatively pricy compared to other brands but it’ll still be cheaper in the long run with less emergency vet visits.",
      "rating": 5.0,
      "verified": true,
      "author": "Flossie Dickey",
      "helpful_votes": 3,
      "publication_date": 20180613
    },
    {
      "title": "Just Received & Opened - Rancid!  Returning 🤢",
      "text": "Just received and opened the bag - It is rancid! Returning immediately. It is not healthy to sell food in this state. I was searching for a veggie dog food for one of my dogs as he is a real vegetable lover and I thought this could be a good thing for him. However, this is not something that is fit to be ingested.",
      "rating": 1.0,
      "verified": true,
      "author": "CCandZG",
      "helpful_votes": 4,
      "publication_date": 20190128
    },
    {
      "title": "The only vegan kibbles my dogs will eat",
      "text": "My puppies love this food especially if I soak them in some warm water beforehand for about 5 minutes. This softens them up and the dogs have a better time eating them. We have tried other brands of vegan and vegetarian kibbles and they will not even think about eating them. When I gave them a bowl of the Halo brand kibbles they devoured it unlike anything I've seen before. Will be a repeat customer of this brand thank you HALO.",
      "rating": 5.0,
      "verified": true,
      "author": "Trimpanzee",
      "helpful_votes": 8,
      "publication_date": 20161031
    },
    {
      "title": "Awful smell",
      "text": "I ordered this product last week and it arrived very quickly. I opened the bag up only to notice a very strong horrible smell. I requested a new bag that came in two days later only to notice the same smell just not as strong. I was really hoping it was just the one bag that had the smell but unfortunately it was both bags. I’m not sure what is causing this issue but my dog would not go near it and I don’t blame her. I had high hopes for this product but was highly disappointed instead.",
      "rating": 1.0,
      "verified": true,
      "author": "Taylor J",
      "helpful_votes": 3,
      "publication_date": 20190209
    },
    {
      "title": "worst taste ever!!!",
      "text": "when i put small amount of this food in their bowl they both my GSD didn't even wanted to go close to bowl, they didn't even like the smell Then i tried this (Please don't try - i don't feed ice cream to my GSDs) - i mix plan vanilla ice cream with this food assuming that my GDSs will like - guess what?? they didn't even put their tongue in bowl mixed with ice cream.. They love ice-cream and that is the only reason i added ice cream to see if they can finish that small amount ...",
      "rating": 1.0,
      "verified": true,
      "author": "Vick",
      "helpful_votes": 3,
      "publication_date": 20191009
    },
    {
      "title": "Dog won’t eat it",
      "text": "I really wanted to like this. The ingredients are great. I got this for my 5lb Chihuahua and she doesn’t eat a whole lot so the price doesn’t bother me, a $20 bag would easily last a month and that’s great for high quality food. However, she barely eats it. I’ve tried putting broth over it and she only takes a few bites a couple times a day. It smells fine to me, so she must just not like the taste. Unfortunately I won’t be ordering it again due to this, but I wish I was as I really want her on a plant based diet.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Extremely picky Chihuahua eats it",
      "text": "Super picky Chihuahua likes it so it's a win. You seriously shouldn't be allowed to review a product you've never bought. It's misleading. Some dogs are allergic to animal products, some need plant based food for other dietary restrictions. And some, like mine, are extremely picky. I'm glad my dog likes this because the ingredients look good. I always read the ingredients to my pets' food and try to get the best quality ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa D.",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "My dog had pretty bad digestive issues",
      "text": "My dog had pretty bad digestive issues. I'm talking bloating, bloody diarrhea, vomiting. I tried a lot of food. Some more expensive than this and some prescribed by her vet. They worked for a little bit, and then back to the same thing. It's been about a year now since I switched her to this food and she has had ZERO issues! Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 6,
      "publication_date": 20170520
    },
    {
      "title": "Good for skin issues",
      "text": "Both our vet and pet dermatologist recommended cutting out animal protein for dogs' skin issues. The small kibble is perfect for small dogs and they seem to like it. There have been no changes to their poo since we introduced this food. We think it is helping with itchy allergy-prone skin, but will have to see how things go over the next few seasons. Update: Definitely less overall itchiness.",
      "rating": 5.0,
      "verified": true,
      "author": "New Cleats",
      "helpful_votes": 10,
      "publication_date": 20150904
    },
    {
      "title": "My dogs love Halo!",
      "text": "I had been searching for something that would help eliminate my rescued 12 year old Schipperke/Chihuahua dog's allergies. They have gotten so bad that he has needed allergy shots, and at times, even that wasn't helping. His belly at times was red, inflamed and had a loss of hair. I have been using Halo Vegan Dry Dog Food, Garden Of Vegan Recipe for some time now and while he still has allergies, he has improved. He has a beautiful coat, good stools -- and he loves it! Sophie has also seen great benefits. THIS is my go-to dry food.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny_Marshes",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "His weight stays good and just had his blood tested and it's \"perfect\" ...",
      "text": "I have 110 pound Staffordshire Terrier with a host of allergies ..He has been eating this for some time and Loves this food !! His weight stays good and just had his blood tested and it's \"perfect\" at 13 years old .. The vet said whatever you are doing do not change a thing .. Love my dog and want him to be and stay healthy ~",
      "rating": 5.0,
      "verified": true,
      "author": "CC Shopgirl",
      "helpful_votes": 4,
      "publication_date": 20171110
    },
    {
      "title": "The food had gone rancid",
      "text": "We usually buy the 21 lb bag but needed it to arrive more quickly, and the 21 lb bag would take several weeks, so we sprang for this expensive 4 lb bag. But when we opened it, it smelled very strongly, like rancid oil, and our dog wouldn't eat it. We tried sprinkling various other foods on top (freeze-dried powder, canned wet food), but our dog still wouldn't go near whatever was in this bag!",
      "rating": 1.0,
      "verified": true,
      "author": "Red Zeppelin",
      "helpful_votes": 2,
      "publication_date": 20190615
    },
    {
      "title": "DONT BUY! Food was spoiled.",
      "text": "Wish I could give this zero stars. I unfortunately don’t have the bag anymore so I can’t return it. It smells like paint thinner!! Made my dog sick!! We usually feed V dog but I liked the smaller kibble of this one. NEVER AGAIN will I order anything but v dog for my poor pup.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Old Dog Loves It",
      "text": "Had to switch from my previous “grown and processed in USA” premium dog food after reading Amazon reviews on it that said sourcing had changed to overseas and other pet owners were also experiencing their pet refusing to eat the food as had my ten year old cavalier who had been eating it for half her life. Researched and called other companies and decided to go with Halo. My dog took to it right away with no gradual introduction and no longer skips meals.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxie'nMe",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Smells toxic...",
      "text": "I’m returning. I opened and it smells really bad! Is what it is supposed to smell like since it’s her first bag, because I am transitioning her to vegan to be like mommy. I wouldn’t eat that though. Sorry. I’m just going to go to petco and see if that’s any better.",
      "rating": 1.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 3,
      "publication_date": 20181207
    },
    {
      "title": "Amazing product!!!",
      "text": "I made the switch to Halo vegan for my 20lb Boston Terrier who has been eating the \"Chicken Soup\" brand of dogfgod for 8 years. I transitioned him for 7 meals (half old and half new). For the past 3 weeks he's been eating just the Halo. He loves it. And it completely agrees with him (no gas or loose stool). I am so happy I found this product.",
      "rating": 5.0,
      "verified": true,
      "author": "chlohan",
      "helpful_votes": 5,
      "publication_date": 20161213
    },
    {
      "title": "Just right for my dog",
      "text": "I adopted a dog that had horrible food allergies and for 12 years he was getting the wrong food as he was allergic to beef as well as other meat products. He's been on this now for over a year and I feel it's the best food for him. I also mix a bit of Natural Balance vegetarian canned in his food along with some canned pumpkin. This is the best food for him to be on.",
      "rating": 5.0,
      "verified": true,
      "author": "Tanya",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Outstanding food, especially for those with allergies and digestive problems",
      "text": "Cured my dogs allergy and bowel issues that I spent thousands on trying to address with an animal dermatology clinic and veterinarian. My dog loved the food and has been thriving on it for a couple years now. I use this and the halo garden of vegan wet food together. My little dogs poops are regular now and his hair has grown back in areas that went bald due to inflammation from allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "I’m amazed- my frenchie looks beautiful again...",
      "text": "I had to write a review for this dog food! My French it has clean eyes! I couldn’t believe it- after 3 months on this she no longer has runny dark crap under her eyes!! She’s had that for years- I knew it was the food but tried several brands- to no avail. I went vegan last year and decided to try for my dogs- both LOVE this stuff and best of all it shows!",
      "rating": 5.0,
      "verified": true,
      "author": "Carie Y ",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "BAD BAG",
      "text": "Okay, after reading some of the reviews this is starting to make sense. Let me begin by saying I’ve been feeding this food to my dog for a long time and it works perfectly. I recently ordered a smaller bag in between Subscribe and Save shipments. I noticed my dog was not eating it... and the smell was off. I just opened the new 10lb bag I received and my dog ate it immediately. I don’t know what was wrong with the small bag but apparently I’m not the only one that has experienced this.",
      "rating": 1.0,
      "verified": true,
      "author": "Elizabeth Peterson",
      "helpful_votes": 4,
      "publication_date": 20190305
    },
    {
      "title": "My dog stopped liking this food.",
      "text": "At first my dog liked the food but then stopped liking it so now I am mixing it with her regular kibbles. I will not be ordering it anymore, I don't see the reason to buy this if the dog doesn't like it.",
      "rating": 4.0,
      "verified": true,
      "author": "UJT",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "It's good food.",
      "text": "Pets are a bit skeptical of it at first, but gradually add more to their food and they eat it. Given it's vegan, I tried a piece, and it tasted like veggie dog chow. I only wish things like these were more affordable, and I wish this was also organic. At the end of the day, feeding pets home-cooked food just like you make is best, I say.",
      "rating": 4.0,
      "verified": true,
      "author": "Lex",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "The third try was the charm :)",
      "text": "So first off I tried two previous vegan dog foods before trying this one. My dog did not like either of them and one which was VDog (i thought that was going to be a winner.) So I was beginning to feel like a premade vegan dog kibble wasn’t gonna work for us. But I am so glad that I went ahead and gave this one a shot because she loves it. I just add a little coconut oil on top of it and she goes to town. I’m so happy I gave that a try and I feel good knowing that I’m feeding her good food, that she enjoys and no other animals had to be harmed for it.",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Kelly",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "My dog loves Halo!",
      "text": "My dog loves this brand. The wet and the dry! Since she’s been eating plant based, her rashes have gone away and she’s never looked better! Thriving at 9y/o",
      "rating": 5.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 3,
      "publication_date": 20181205
    },
    {
      "title": "Made with a lot of healthy ingredients",
      "text": "I question why spinach is in there when supposedly spinach is a food you're dog shouldn't eat. However, when I asked my vet, he said it was fine for them and you just don't want them eating spinach in excess. My dog's not crazy about it, but he'll eat it, mixed with a variety of other \"real\" food I mix with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ricky",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "My white pit bull seems to have a lot less skin allergies with this brand.",
      "text": "My dogs love it but I add home cooked food too. I love that's it's vegan. My dogs have been vegan for several years now and super healthy!!!! This brand is more expensive then the other brand we used but my white pit has much better skin with Halo than the other brands and less itching, redness allergies ect. .",
      "rating": 5.0,
      "verified": true,
      "author": "moxieann",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Dogs love it",
      "text": "I’ve been concerned because my 10 and 6 year cavaliers have been having loose stools whenever I take them off EN special diet food. I remembered feeding my bischon a vegetarian diet and it not only kept him healthy but got rid of eye and mouth stains caused by animal protein. Decided to try Halo and it’s been a great success so far. Great firm stool and stains going away and wow do they live it. Looks like it will be our new go to food.",
      "rating": 5.0,
      "verified": true,
      "author": "Kloeylee",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Smells off and dog won't eat",
      "text": "We wanted to like this dog food, as we're plant based, but it smells off and our 7 year old chihuahua won't touch it. Not exactly a rancid smell, more like an oily smell. Our bag was purchased in December 2018 and the expiration date was July 2019.",
      "rating": 1.0,
      "verified": true,
      "author": "captainhand",
      "helpful_votes": 2,
      "publication_date": 20190119
    },
    {
      "title": "Happy vegan pups!",
      "text": "My vegan doggy loves this food. He had some tummy issues with V-Dog, so I was super excited to find out that he enjoys this and that it doesn't upset him in any way. The other, non-vegan dog in the house even prefers this to his normal food! And the health benefits were noticed by the vet, who said he couldn't believe how well my guy is for his age.",
      "rating": 5.0,
      "verified": true,
      "author": "JDS",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "CGEC",
      "text": "It's great food but BEWARE!!!!!! I have bought two bags from Amazon and both have arrived dated a month out on expiration date. The second replacement bag was just as bad you open it and it smells like plastic and funky and my dog doesn't want to go near it. AMAZON NEEDS TO ADDRESS THE EXPIRATION DATE ISSUE. Other than that...my dog did like to eat it with great fiber results.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Vegan Kibble.",
      "text": "My 2 little dogs readily accepted this dry food. Its not a part of their daily diet as I use Dr Harveys raw vibrance with a scrambled egg. However, when I need a house sitter, this is what they’re fed simply for the convenience. It’s smells nice but they do seem to have more stools. No diarrhea. It’s still a processed kibble but better than all the rest due to the vegan ingredients.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Quality plant-based food at a good price",
      "text": "My dog loves this dry kibble, it's more calorie dense than the previous meat based food that she ate (Orijen brand), which is preferable since my dog needed to put on weight. She get excited every time I bring out the bag. She has put on 5lbs since I switched and her coat is looking great. Since this is a plant based food it is less expensive per pound than similar quality meat based food, so it's good for both my wallet and my dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Five Stars",
      "text": "Our two Australian Shepards love this stuff. It has a very impressive ingredient list and this is the first dog food I've personally sampled. It didn't taste like much to my palate but the dogs love it which is more important. It makes me feel good feeding them quality food. No crap in this bag that couldn't even qualify for hot dogs or sausage.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent Hanna",
      "helpful_votes": 3,
      "publication_date": 20171202
    },
    {
      "title": "Our pups love this food!",
      "text": "I haven't decided whether or not my dogs should eat a strictly vegan diet. I'm still on the fence. If I could be convinced that the diet would cure my pups of their allergies and digestive issues, I'd be on board. Until then I'm going to stick to feeding them a couple of vegan meals each week as sort of a cleanse for their system. My dogs love this food. It's a dark green color, but the ingredients in it are top-notch. I'm already a fan of Halo products, so I was excited to find that they make a vegan variety. Extremely affordable. Amazon's price is comparable to Petco's.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ Wallace",
      "helpful_votes": 4,
      "publication_date": 20140728
    },
    {
      "title": "Best for food intolerance",
      "text": "Our Great Pyr mixes have skin sensitivity & food intolerance (rice & chicken). Even w grain free minimal ingrediant diet, they still had stool issues. Now their poops r good. I will say tho that this dry food is far less rich & fatty so we give a little extra. We still give a bit of wet w meat in it just bcuz its hard for me to believe that vegan was the answer all this time. But it is working.",
      "rating": 5.0,
      "verified": true,
      "author": "Misati",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Excellent",
      "text": "My dog loves this food and had no problem switching from a lesser brand. He was previously very picky and did not like kibble. I picked this vegan option to get more nutrients and fiber in his diet when he had very soft stools. It has worked well, plus he enjoys it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Quality",
      "text": "A bit expensive but great ingredients and quality product. Our dog enjoys it and she has a healthy weight and gut since her switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Diabetic Dog loves it!",
      "text": "My diabetic dog loves this! I mix it with his glycobalance food (1/2 cup each). Best part is that I was able to lower his insulin dosage about 2 notches. 🙌🏾 He won’t eat just this food alone, but I’m sure he’ll get there eventually. He won’t eat his glycobalance without it mixed in now.",
      "rating": 5.0,
      "verified": true,
      "author": "Babygurlblu91",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "High quality, but too small of kibble for my vacuum dog",
      "text": "This brand is good, our dog likes it (but she also likes goose poop so...), however the kibbles are too small for us! I wish they varied the kibble size so that we could choose-my dog inhales these small kibble (even with a \"slow feeder\" bowl). I would love to buy this product again, but I will have to go to another brand with larger kibble.",
      "rating": 4.0,
      "verified": true,
      "author": "Chelse P.",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "**** the last star would be there if this product was organic",
      "text": "If it were organic it would get 5 stars but over All my dogs love this food and it is really the healthiest dog dog food I can find on the market. My dogs choose this over the dog food with meat in it. My dog literally picked out the meat food and spit it out to just eat the vegan kibbles when i had the 2 mixed during transitioning their diet..",
      "rating": 5.0,
      "verified": true,
      "author": "courtney",
      "helpful_votes": 0,
      "publication_date": 20190910
    },
    {
      "title": "Excellent dog food - but just went up over 5 dollars!!",
      "text": "My dog loves this and the ingredients are high quality. Cruelty free. BUT THERE IT HAS GONE UP 5 BUCKS IN ONE WEEK? Will purchase elsewhere. Shame on Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Louise",
      "helpful_votes": 6,
      "publication_date": 20160818
    },
    {
      "title": "My dog loved it...until she didn’t",
      "text": "My dog loved this food for a few weeks but then was over it. I had purchased a lot so I’m mixing it with another food and she now eats around this food. It’s kind of making a mess in my kitchen but I don’t want to waste it. I love that’s its vegan and healthy, and comes in small bags.",
      "rating": 4.0,
      "verified": true,
      "author": "Luna Lovegood",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "Rancid smell",
      "text": "The first bag that was shipped had an awful odor. Smelled like rancid oil so we had a 2nd bag shipped and same thing. I buy the Halo Vegan Wet food and my dog loves it however the dry, I do not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 2,
      "publication_date": 20190328
    },
    {
      "title": "Now for the bad news. Our dog is now a poop machine",
      "text": "Wow. When transitioning our 70 pound greyhound to this kibble, she decided she was only going to eat the vegan kibble and she left the chicken kibble in her dish untouched. She loves the stuff. Now for the bad news. Our dog is now a poop machine. She's producing at least 3 times the volume of feces, and she needs to go out far more often. She can't make it through the night without a 3am deposit. We live in Brooklyn, NYC and need to leash walk her whenever she needs to go, so this kibble is not going to work for us.",
      "rating": 4.0,
      "verified": true,
      "author": "James A Spahr",
      "helpful_votes": 4,
      "publication_date": 20160801
    },
    {
      "title": "My dog loves it",
      "text": "A little expensive for the size bag My dog loves the new flavor He is allergic to lots of thing especially chicken and it’s byproducts Will by more and add to the other vegan dog food I currently use monthly for half the cost",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Cutrer ",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "I haven't tasted it, but my dog likes it.",
      "text": "I haven't tried it personally, but my dog just switched to this food and seems to like it just fine...and wants more. I weighed him before I started this food to track any weight loss he might have (wouldn't hurt him to loose a few pounds). He's also an older dog with some health concerns so I'm hoping a vegan diet helps eliminate some of his problems.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Marlow",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "My dog loves this, but beware.",
      "text": "Very good nutritional product. Our Boxer loves it, and our vet says he is extremely healthy on a vegan diet. If your dog is not used to this type of food, it will produce very loose stool, with an extreme urgency to go when processed. This, of course, can lead to accidents, so be aware.",
      "rating": 4.0,
      "verified": true,
      "author": "hilary",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "This is my second order",
      "text": "My vet said I needed to put my little doggie on a diet. I have lowered her intake to 2/3 a cup a day with some added chicken jerky. Skinless boneless. She loves it. And is back down to her required weight.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert C.",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "2 paws down 👎👎",
      "text": "Our dog did not like this food at all and refused to eat it. Vdog was much better and a much higher quality food.",
      "rating": 1.0,
      "verified": true,
      "author": "Jos88",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "My dogs love this food",
      "text": "We’ve been cooking for our dogs for years and due to some upcoming travel had to switch to a commercial food. We weren’t sure they’d like store bought food, but they LOVE this stuff. So far they’ve done well on the food, looking healthy with no tummy troubles.",
      "rating": 5.0,
      "verified": true,
      "author": "Adair M",
      "helpful_votes": 0,
      "publication_date": 20190705
    },
    {
      "title": "My schnauzer thrives on this food",
      "text": "After years of allergies and weight issues, Finally dog food that works. My dog is 7 years old and been feeding Halo vegan food for past 3 years. I call her freegan. She is vegan and gets Stella and Chewies patties for free ( which is raw protein dog food) so I feed my dog Halo and put one pattie on the top so she gets meat too. Other kibble with meat meals gave her allergies and she had other health issues ( eyes, paws) Now she only gets check ups and vaccines . Happy and healhy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon junkie ",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Healthy Quality dry dog food",
      "text": "My dogs love Halo Vegan Dry dog food. It's the only dry food I would recommend to other dog lovers.",
      "rating": 5.0,
      "verified": true,
      "author": "Onokai",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Warning! May make your dog sick!!!",
      "text": "This made my dog very sick. Will never but this product again",
      "rating": 1.0,
      "verified": true,
      "author": "TruthBeTold",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "Kernels are extra hard but my dog enjoys the food",
      "text": "I picked this food due to it having no meat \"meals\" of any kind. I'm not opposed to my dog eating meat, but I want her to eat quality meat. I feed her this vegan food and give her quality canned meat dog food. The kernels of this dog food seem to be extra hard. She had trouble chewing them at first (she's only 5 pounds). But she got used to it and eats it just fine now. She seems to like it as well as any other dog food.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen ",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "no more loose stool",
      "text": "My italian greyhound didn't like it at first, when I mixed it with his old blue buffalo.. then I mixed it with pumpkin, now I give it to him plain and he loves it.. just took him a bit to get used to I guess :) he has had problems with loose stools which gave him gland issues and caused scooting.. but now they are nice and firm and no more scooting :D",
      "rating": 4.0,
      "verified": true,
      "author": "Jennie",
      "helpful_votes": 5,
      "publication_date": 20150530
    },
    {
      "title": "We have a winner",
      "text": "I've tried several different kinds of vegan and vegetarian kibble for my Chihuahua, and he really loves this one. He has a lot of allergies and seems to tolerate this one just fine. It's also a small-sized piece of kibble, and seems to be easier for him to chew. He also has a lot more energy since starting him on Halo, and he's got a very shinycoat and good breath. Very pleased with this product!",
      "rating": 5.0,
      "verified": true,
      "author": "riotnrrrd",
      "helpful_votes": 5,
      "publication_date": 20150218
    },
    {
      "title": "yummy! but smells funny",
      "text": "I would give it 5 stars if they would sell a bigger bag so i could save some money! My vegetarian dog loves it more than the other brand we were buying. I also make some food for her so this is about 50% of her diet. It is a smaller kibble which doesn't matter to my 80 pound lab. But easier for my kitten to steal... he has balls!",
      "rating": 4.0,
      "verified": true,
      "author": "Omen",
      "helpful_votes": 5,
      "publication_date": 20150711
    },
    {
      "title": "Dog liked it",
      "text": "My dog liked this food quite a bit. He also likes green veggies (we buy a topper to put on his regular food). I would recommend it but I’m not sure the ingredients are the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Yoot",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "3 Strikes Your Out",
      "text": "I have 3 Chihuahuas...none of them would touch this food...they actually would go hungry than eat this...so I gave it to my chickens..end of story.",
      "rating": 1.0,
      "verified": true,
      "author": "P.♡R.C.",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Smells horrible",
      "text": "I’ve purchased this brand before in store and my dog loved it. I ordered this from Amazon and it’s smells like DEATH, my dog is wont even eat it.",
      "rating": 1.0,
      "verified": true,
      "author": "J Ralph",
      "helpful_votes": 2,
      "publication_date": 20190122
    },
    {
      "title": "My Labradoodle stopped itching and no more eye and ear infections",
      "text": "My Labradoodle is 10. I've tried about 40 different, expensive, high quality foods over the years; raw, lamb, etc... He has always had eye and ear infections, chews on his paws and just over all itchy. After changing his food to Halo Vegan all of this has stopped. He seems happier and has much more energy. A 10 year old dog that acts like a puppy. My only regret; that I didnt find this years ago?",
      "rating": 5.0,
      "verified": true,
      "author": "L.W.",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Anyone Else Having Trouble With The Smell?",
      "text": "Need a little advice here. So far, the reaction has been lukewarm. I put a healthy dose of goat milk on each serving, because after having a pup who endured 13 months of chemo, goat milk is a staple for all tummies. We have some serious skin issues with the other doggies in the house, so really trying to move everybody to veggie and fish based foods. This one smells a little chemical-like? My boxer isn’t having it.",
      "rating": 3.0,
      "verified": true,
      "author": "Marlene",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Our dogs favorite food - and they’re picky!",
      "text": "Our dogs devour this and one of them is THE pickiest eater ever. Need to focus on the nutrients and not where they come from. Dogs are omnivores and in the wild eat meat, if they’re lucky, one x week or once every two weeks. I highly recommend this kibble.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate D.",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Canola Oil",
      "text": "This product would be perfect if it did not use Canola Oil.",
      "rating": 3.0,
      "verified": true,
      "author": "Duranimal",
      "helpful_votes": 2,
      "publication_date": 20181003
    },
    {
      "title": "The only food my dog eats",
      "text": "We've adopted a dog a couple of months ago, and at first he wouldn't eat much. However, after a couple of weeks, he got used to it, and now he would jump all over the place waiting for the meal times. This dog food is supposed to provide all the daily required nutrients, so I'm confident he's getting everything he needs to be healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "Fabio",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Healthy and tasty dog food",
      "text": "My dog and even my cats love it ! The product arrived ok. Flavor still good, no fancy smell or anything. It has been a week since my dog started eating it, and his skin and hair changed a lot for better ! And he doesn’t smell as bad as before. That’s a big one! And we tried all major brands, because he also got tummy troubles.",
      "rating": 5.0,
      "verified": true,
      "author": "Lila Janette",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Good for my dog who is allergic to everything",
      "text": "Expensive but the only food my dog is not allergic to. Inconsistent quality. Sometimes super fresh and sometimes not. I don’t like that but can’t change his food because of allergies.",
      "rating": 4.0,
      "verified": true,
      "author": "Harlem Renaissance Woman",
      "helpful_votes": 0,
      "publication_date": 20190929
    },
    {
      "title": "Love it",
      "text": "My dogs get constipated due to their special dietary needs so I mix it in with their other dry food and a bit of water. I’ve seen positive results. It doesn’t make them go to the bathroom, it just adds a fiber like bulk, and softens their stool. My dogs seem to be requesting their food more, so I think they like the taste.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Peck",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Happy to find this!!",
      "text": "My dog can’t break down protein so she developed bladder stones. After a costly surgery to remove the stones I had to put her on a costly RX formula of food. It just became too costly for me. I started researching and found this product. I was impressed at all the wonderful natural ingredients! My dog is a little older so I put Vegetable broth in with it and she devours it! So far so good with her!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Craig",
      "helpful_votes": 2,
      "publication_date": 20180205
    },
    {
      "title": "Dogs like it, has funny smell",
      "text": "My dogs do well with this food, but it has a distinct smell of rancid oil when you open the bag. It doesn't seem to bother them, though, they gobble it up.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "My dogs digestive issues turned around after feeding her this.",
      "text": "Love this product. So thankful to find this. My dog's digestive issues improved after using this.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 2,
      "publication_date": 20180512
    },
    {
      "title": "She loves it even more than meat-based food.",
      "text": "We were quite surprised that our maltipoo didn't miss a beat transitioning to this vegan food. She loves it better than the high quality meat-based food we were feeding her and her skin condition is improving for the first time ever. Same for the Halo vegan canned food. She's normally so picky and just loves this!",
      "rating": 5.0,
      "verified": true,
      "author": "V.L.",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "My dog won't eat this kibble.",
      "text": "I've been mixing this new kibble in with her food. I have to coat the kibble with soft food or mix it with scrambled eggs so that she will eat it and she still manages to pick out and discard some pieces.",
      "rating": 3.0,
      "verified": true,
      "author": "Cynthia Draper",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Truly Vegan",
      "text": "I've got an 8 yr old mini-schnauzer and she's had food allergies since she was just a few months old. I used a different brand for 7 yrs with no complications until a few months ago. After several trips to the Vet and lots of $$$ spent on blood tests, I decided to replace her food. Sure enough! that's what it was. As soon as I put her on the Halo Vegan food, her weight, mood and health renewed.",
      "rating": 5.0,
      "verified": true,
      "author": "BMRgirl",
      "helpful_votes": 4,
      "publication_date": 20140525
    },
    {
      "title": "This is the first vegetarian formula that she has enjoyed with out too much fussiness",
      "text": "My pooch is extremely sensitive to regular kibble and various types of meats. This is the first vegetarian formula that she has enjoyed with out too much fussiness. It does not have the pungent odor of some veg formulas and seems to be easily digestible. It is pricey but worth it for my dog’s well being.",
      "rating": 5.0,
      "verified": true,
      "author": "J C",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "She Loves This!",
      "text": "I tried so many different foods. My nearly 6 year old girlie has had recurring skin issues and this food is a dream come true. No issues at all with it so far and she absolutely loves the taste and in my opinion more energetic than she’s been in a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Love",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "I use this food and add in fruits and veggies and they love it! It's been difficult to find a good ...",
      "text": "I have been vegan for a year and now have decided to have my dogs (all 4) go vegan as well. They have lost weight and have more energy now. I use this food and add in fruits and veggies and they love it! It's been difficult to find a good that all 4 will eat too. Will be ordering more!",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Barton",
      "helpful_votes": 2,
      "publication_date": 20170914
    },
    {
      "title": "Helps with digestive issues",
      "text": "I have a dog with IBS and she has a hard time digesting food with too much protein. This is easy on her stomach and she loves it. She never leaves anything in the bowl and she is a picky eater. Glad Halo has such a wide variety to choose from. Thinking about trying the can food version of this as well. She has been eating this for three weeks now and hasn't had to take her steroid medicine to calm her stomach since she started this food. She used to need it every other day.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Revier",
      "helpful_votes": 4,
      "publication_date": 20140506
    },
    {
      "title": "Happy dogs happy dog mom",
      "text": "Love this vegan no grain dog food. TMI but my dogs have more consistent bowel movements too now which is a sign of good digestion! I'm hoping once we have filtered out all their old food with grains (always mix as to not upset the dogs stomach while transitioning over) they will be less itchy.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela M",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "Great option for picky eaters",
      "text": "Our dog loves this stuff! After continuously snubbing other, non-vegan dog foods for years, we thought we would try him on a plant-based formula. He has been eating this stuff for around 3 years now and has never been healthier, or happier with his food!",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Spoiled Smell",
      "text": "Product has a spoiled smell could not use, discarded product, my dogs would not eat it",
      "rating": 1.0,
      "verified": true,
      "author": "Pamela H.",
      "helpful_votes": 2,
      "publication_date": 20181102
    },
    {
      "title": "The best!",
      "text": "I've always fed my small maltise with this and she's NEVER been sick, her eyes have no black disgusting mucus glued around the eyes. I would never change her food.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice",
      "helpful_votes": 4,
      "publication_date": 20160731
    },
    {
      "title": "Great addition to regular dog food.",
      "text": "I bought this because my dog LOVES this in the canned stew and I was being lazy in purchasing this so I didn't have to mix the stew with his food each day. He doesn't like this as much. I think maybe the dry version takes away some of the taste. He continues to eat it though and I feel better that he's getting some veggies in his diet.",
      "rating": 4.0,
      "verified": true,
      "author": "Coastal1",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "Food loving dog won’t eat it. Weird smell",
      "text": "Weird smell. Not sure if it’s the flax or canola or if it’s actually rancid like others were saying. Our dog eats EVERYTHING but gave up on this after a few days unless it was mixed with at food. Going to see if we have better luck with another vegan brand.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190311
    },
    {
      "title": "A healthy choice!",
      "text": "My vet recommended that my two overweight dogs went on a vegan dog food to help with weight control, as well as keep their coats shiny. So far, so good! I love that Halo made such a nutritious blend and offers dogs a diet rich in plant sources. I noticed soon after that their energy level had increased and this has certainly helped with their digestive issues.",
      "rating": 5.0,
      "verified": true,
      "author": "KELLY",
      "helpful_votes": 4,
      "publication_date": 20141110
    },
    {
      "title": "Choosy Dogs Choose Halo Vegan Dog Food",
      "text": "My dog loves this food. I have referred this dog food to so many friends and family I deserve a commission. My friend tried to give her dog another brand of dog food waiting for this one to arrive and the dog didn’t eat for 2 days waiting for Halo to arrive.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Good, but price keeps going up",
      "text": "My dog loves this brand. It's more affordable than V-Dog, but...I keep seeing the price go up and thats really unsettlig for someone who doesn't make a lot of money like me.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "I've switched my dog to this",
      "text": "She was eating Wysong before, but I wanted something with a bit better ingredients while not paying way more. The kibble is small enough and she likes it!",
      "rating": 5.0,
      "verified": true,
      "author": "MelWheaten",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Awesome kibble and natural!",
      "text": "My dog loves this kibble, working on her losing a few pounds and she really seems to love the small kibble and vegetarian which is great quality",
      "rating": 5.0,
      "verified": true,
      "author": "R. Chaiken",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Do not buy!",
      "text": "This product made my dog sick; great sounding ingredients, lots of product for your money, but her health deteriorated slowly until we finally figured out it was the food",
      "rating": 1.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Delicious and healthy alternative!",
      "text": "My dog loves it and I appreciate the vegan option. We alternate between this and castor organics beef and sweet potato. We found 2 great palatable products we feel great about giving her.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "My dogs LOVE this!",
      "text": "I alternate V-Dog with Halo, and I don't know which my dogs love more. My one dog is a little fussy, but he eats this (and V-Dog) up like candy. They can't wait for meal time! Both dogs love it, and they are healthy and happy (and that's the most important to me). There's no gassiness, and their poop is very easy to clean up! I just wish it came in a larger bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaxncooper",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Natural vegan meal",
      "text": "Best vegan dog food around. Organic and natural selection ingredients. Always the best for my vegan dog Spike! (rat terrier)",
      "rating": 5.0,
      "verified": true,
      "author": "rolandontheriver",
      "helpful_votes": 0,
      "publication_date": 20200419
    }
  ],
  "product_meta": {
    "title": "Halo Vegan Dry Dog Food, Adult Garden of Vegan Recipe",
    "description": "Size:4-Pound BagHalo’s Garden of Vegan is a great alternative for a protein-sensitive dog because it doesn’t contain any meat, dairy, corn, or wheat. This complete, daily, non-meat diet for dogs nourishes with protein-rich plant-based ingredients like peas, chickpeas, pearled barley, and oats. Made with non-GMO fruits and vegetables, Halo Garden of Vegan is part of a healthy holistic alternative diet—especially for families with a vegan lifestyle or those whose dogs are sensitive to specific ingredients—meat, dairy, corn, or wheat. And, unlike other vegan brands, Halo avoids rice, a less expensive and lower protein alternative. Halo also has dog food options for other special diets, including puppy food, small breed dog food, senior dog food, and grain free dog food.",
    "rating": 4.4,
    "feature_bullets": [
      "Vegan recipe nourishes with protein-rich, plant-based ingredients",
      "An alternative to a meat-based diet that delivers the same essential nutrients and is complete and balanced for adult dogs",
      "No meat, dairy, corn, or wheat for dogs with ingredient sensitivity",
      "Wholesome, non-GMO ingredients, no artificial colors, flavors, or preservatives",
      "Plant-based diet that is great for dogs who are sensitive to animal proteins"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.5 x 8.75 x 13.5 inches; 4 Pounds",
      "Item model number": "36026",
      "Date First Available": "July 24, 2012",
      "Manufacturer": "Halo, Purely for Pets",
      "ASIN": "B00BACFRD2",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Dogs",
      "Dry",
      "Pet Supplies",
      "Food"
    ],
    "price": 19.99
  }
}