{
  "website_summaries": [
    {
      "verdict": "Can work well as an alternative to topical treatments, though some owners may need to replace the collars sooner than 8 months.",
      "pros": [
        "Many owners report good results from this flea and tick collar, lasting several months (though not quite 8 months for some)"
      ],
      "cons": [
        "A few reports of adverse reactions to the product, including rashes and behavior changes",
        "Several owners report limited effectiveness, or that the collar doesn’t repel fleas or ticks",
        "Only 2 sizes available"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "It's pricey, but it will get the job done successfully and protect your dog from flea and tick bites.",
      "pros": [
        "Will provide eight months of continuous protection from fleas and ticks",
        "Also kills lice",
        "Contains no odor, which is nice for dogs who like to sit on your lap",
        "Adjustable collar works for all sizes of dogs",
        "Continues to work when wet"
      ],
      "cons": [
        "Far more expensive than other dog flea collars",
        "Some dogs are sensitive to it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Australian Shepard develops alergic reaction",
      "text": "Our Australian Shepard developed severe itching and became very irritable after installing this Bayer Flea and tick collar. She started running into walls in our home and became very delirious. Contacted Bayer on their emergency telephone number on a Sunday afternoon and they were very helpful. Had to bath Zoey three times with Dawn detergent and remove the other collar off of Gabby, who had no reaction, but had the oil from the Bayer collar. Poor Gabby also had to be bathed three times with Dawn detergent. After three more days Zoey fully recovered. Be very careful with this collar. It put us through pure hell.",
      "rating": 1.0,
      "verified": true,
      "author": "TravelingMan",
      "helpful_votes": 517,
      "publication_date": 20170625
    },
    {
      "title": "Buyer beware",
      "text": "I used on my 24 lb cockapoo for 2 1/2 years with no problems. I felt the collar was a great product. The last time I put the collar on, within hours he began vomiting and having diarrhea. He stopped eating and drinking. Several visits to the vet over the course of 3 days for blood work, fluids, antibiotics, and observation left him continuing to deteriorate becoming more lethargic and incontinent. Following a 3 am web search, finding other dogs with bad reactions to the seresto collar, I removed the collar and bathed my dog. By 5 am he was eating and drinking. Remember that this is a pesticide. All anti flea/tick products are pesticides.",
      "rating": 1.0,
      "verified": true,
      "author": "patricia ashley",
      "helpful_votes": 442,
      "publication_date": 20161217
    },
    {
      "title": "Poison is poison.",
      "text": "Yes this works. No ticks. But also almost no dog as well. Major skin reaction on ears and neck. Wish I took pictures. Bleeding etc. Even the vet thought it was mites etc. nobody wanted to blame the collar. But I took it off, despite living in tick central, and a week later it all cleared up. Proof enough for me. Poison is poison.",
      "rating": 1.0,
      "verified": true,
      "author": "Bhima das",
      "helpful_votes": 103,
      "publication_date": 20160906
    },
    {
      "title": "Severe reaction from our Pet.",
      "text": "As dog owner you are committed to your furry friend to keep him or her healthy. Please make sure after you place the collar, that your pet has no reaction to components in it. Our Yorkie get severe reaction to it and luckily I noticed skin reaction and severe irritation with wet secretion after 3-4 days after the collar has been applied. I should not say it is bad product, but be aware that your pet can have problems with.Immediate removal and switching to different product can save headaches from getting your pet sick.",
      "rating": 1.0,
      "verified": true,
      "author": "SJJ",
      "helpful_votes": 146,
      "publication_date": 20170607
    },
    {
      "title": "Use it right away, your dog may be allergic to it, don't wait until to late to return it",
      "text": "I didn't put the collar on my dog until I'd had it a couple of weeks. Big mistake! Turns out she's allergic to it. Non-stop scratching. I gave her a bath thinking the collar simply didn't work, but she didn't have any fleas. It's the collar. It's my opinion that it's too strong for her. \"For dogs above 18 lbs\" is a pretty wide range. My dog weighs about 28 pounds. My friend's dog weighs 70, but they should both wear the same size collar? Doesn't make sense.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelley A. Mccoy",
      "helpful_votes": 35,
      "publication_date": 20180807
    },
    {
      "title": "I think the collar is worth the money based on what I have seen",
      "text": "I was skeptical about this collar because of the price, It has been about a month since I put it on Buddy and I have not seen a flea or tick on him since, plus he had a bad case of red inflamed belly skin and constant ear scratching that has cleared up, probably caused by some kind of mite. He is very active, roaming all night on our acreage and swimming in the pond all the time. I was using topical drops, but they seemed to have no effect. Even it only lasts a couple of months instead of the claimed 8 months i would say it is worth the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 34,
      "publication_date": 20180501
    },
    {
      "title": "My Dog Has Fleas!!!",
      "text": "Darn! My dog has fleas! This product was highly recommended by two friends of mine, who love it. I must have got a bad one, because my dog got fleas while wearing it, and she still has fleas several days later. I bathed her before, I put on the collar to eliminate fleas and start fresh and flea free. I comb her every day, several times a day, with a flea comb, which is not easy since she is a long haired Australian shepherd. I waited to too long for a return, so I'm going to leave it on, and keep combing her. I really wanted this product to help!",
      "rating": 2.0,
      "verified": true,
      "author": "Mandolina Moon",
      "helpful_votes": 22,
      "publication_date": 20180611
    },
    {
      "title": "Lab had a bad reaction!",
      "text": "This item may work, but a few days after putting it on my 75lb Black Lab, he began acting very weird. My Lab is typically very hyperactive, very happy, playful and FULL of energy. He had a bad reaction to this product, he became very skiddish, his eyes were droopy, he seemed very sick. Within hours of taking it off he showed signs of improvement, it took about a week for him to be back to his normal self. We went back to K-9 Advantix II.",
      "rating": 1.0,
      "verified": true,
      "author": "Nikki10ann",
      "helpful_votes": 24,
      "publication_date": 20171004
    },
    {
      "title": "A eight month collar that barely lasts six months",
      "text": "I’ve been purchasing this color every six months for my dog, a Siberian Husky. They claim to be An eight month collar and I replace it every six months and yet my dog still is having family issues after three months. Initially this wasn’t an issue however I don’t know if the dogs become a custom to it so it’s becomes less effective or I just got a bad batch but it is too expensive to not work every time for at least six months",
      "rating": 2.0,
      "verified": true,
      "author": "Retired US Marine",
      "helpful_votes": 11,
      "publication_date": 20190503
    },
    {
      "title": "After wearing this collar, my dog stopped eating and ...",
      "text": "After wearing this collar, my dog stopped eating and was not herself. She is sensitive to flea meds but I thought I would try this one. I sent it back after almost a month and they gave me my refund, no questions asked.",
      "rating": 2.0,
      "verified": true,
      "author": "Prime For Life",
      "helpful_votes": 26,
      "publication_date": 20170123
    },
    {
      "title": "I have this on my dog about 2 weeks and his neck has broken out in a terrible rash and his behavior has changed",
      "text": "If I could give a zero rating. I would. I was apprehensive about purchasing this because I was concerned about some of the side effects. I have this on my dog about 2 weeks and his neck has broken out in a terrible rash and his behavior has changed. He is out of control for no reason and he has never acted like this. I removed the collar and would never recommend this product to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "Kimber",
      "helpful_votes": 16,
      "publication_date": 20170712
    },
    {
      "title": "Doesn’t work on ticks for our dogs. Useless",
      "text": "Doesn’t work for ticks on our dogs here in Maine. Have it on 3 dogs 2 large and 1 small. Since the collars been on my small dog has had 2 ticks attached to her and one of my large dogs had one that had been on her for at least a few days. I can say for certainty these collars are just for show now and don’t do anything for dog ticks or deer ticks in Maine.",
      "rating": 1.0,
      "verified": true,
      "author": "JLK",
      "helpful_votes": 9,
      "publication_date": 20180524
    },
    {
      "title": "9 days in, and found a tick 2 inches from the collar. Pfff",
      "text": "Take a look at the photo. She has been wearing the collar for 9 days, way more than enough time for the collar to be 100% effective. Then how does a tick implant itself just 2 inches from the colar, and live? If the tick was on her tail, I could be more forgiving, but this is a joke. Still scratching from fleas too. I didn't buy the collar from the cheaper resellers, to avoid getting scammed by a fake product. This was sold and fulfilled BY AMAZON. There is no excuse for this. The collar is innefective.",
      "rating": 1.0,
      "verified": true,
      "author": "IA",
      "helpful_votes": 299,
      "publication_date": 20170604
    },
    {
      "title": "Watch Out For Reactions!",
      "text": "I have been using these collars for years and they keep the fleas at Bay but the last time I put the collars on my two, one of them started itching uncontrollably so I took the collar off. Then the other one started to itch, I thought it was just the season because it was March in the south everything is in bloom. But my husband suggested I take it off and see what happens, so I did. She stopped itching! All's I'm suggesting is that you watch out for any kind of reaction. You never know what kind of reaction your babies might have. Now I have to buy the ridiculously expensive flea prevention from the Vet.",
      "rating": 1.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 4,
      "publication_date": 20190403
    },
    {
      "title": "Seems to work for some but not for us",
      "text": "Last season the fleas did not respond to Frontline and many friends recommended this collar. This year as it has begun to warm up, my indoor/outdoor dog began suffering with fleas again. I bought this collar and she has worn it for 3 weeks. I see fleas on her within inches of the collar itself. It is not deterring and if it is killing them it is doing so slowly and I’m combing them out before they succumb to the collar chemicals. It seems to work for some dogs, but I feel like I wasted $54 as I am still looking for solutions to help my dog.",
      "rating": 1.0,
      "verified": true,
      "author": "L. W.",
      "helpful_votes": 6,
      "publication_date": 20180228
    },
    {
      "title": "Poisoned my Dog",
      "text": "Wish i could give 0 stars. My dog had the same collar purchased from tractor supply. When it was time for him to get a new one, I purchased this one since it was on sale. When I put it on my 1 year old Australian Shepherd, he began vomiting hours later. He became incredibly lethargic and couldn’t even lift his head off of the ground. Not sure if it’s a bad batch, or if the ones purchased on Amazon are different than the real brand. But it poisoned my dog and I’ll never purchase again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kaitlynn",
      "helpful_votes": 4,
      "publication_date": 20200402
    },
    {
      "title": "Defective item?",
      "text": "We were a big fan of Serestro collars for several years until this one. It had to have been either defective or something else because even days after application, you could still see a bunch of fleas on my dog. It wasn't doing any good. We ended up checking with the vet and went with Nexgard. That resolved the issue fast.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason G",
      "helpful_votes": 4,
      "publication_date": 20190428
    },
    {
      "title": "NO THANKS Seresto! Did nuke them, now does NOTHING!",
      "text": "We have used Seresto for the past couple of years to great effect. I have recommended Seresto collars to everyone! When Spring came we bought new collars, premptively, and we still got fleas. Even worse we have more fleas now than 2 months ago! I even bought a new batch of collars, thinking something was wrong with those we bought in February. But we have even MORE fleas. Now I am going to have to treat the house and yard! (we do not have carpets or upholstered furniture to harbor fleas in, so nothing to blame there.) Our beds and closets will need stripped and washed even at this point! Thanks for the EPIC FAIL Seresto!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20190426
    },
    {
      "title": "Didn't Work At All",
      "text": "I flea bathed and combed my dog, as well as treated floors, furniture and bedding, and even my yard, before applying the collar. This is the first time I've ever dealt with fleas and I didn't want the horrors of a full blown infestation so I went overboard at the first sign of them. Within a week of applying the collar, my dog was scratching. At first I thought it was a sensitivity to the collar but when I got out the flea comb... fleas again. I removed the collar, did a full bathe and retreat, put the collar back on and the very next day, fleas were back. This product might work for some dogs but definitely not mine.",
      "rating": 1.0,
      "verified": true,
      "author": "M.B.",
      "helpful_votes": 5,
      "publication_date": 20171017
    },
    {
      "title": "Doesn’t work",
      "text": "Previously bought the product and it worked great. Collar number 2 has been on for 2 months with no water exposure and my dog now has fleas. She is so uncomfortable and is bit all over her belly, armpits and other common flea areas. She is a very anxious cattle dog and is beyond stressed and constantly itching. It’s impossible to contact the company to get a refund. I now have to buy other products for all my animals and products to treat the whole house. Very disappointed and definitely wouldn’t buy the product again.",
      "rating": 2.0,
      "verified": true,
      "author": "peony",
      "helpful_votes": 2,
      "publication_date": 20190902
    },
    {
      "title": "The only flea protection I would trust for our dogs",
      "text": "We live in the South and have been using these since 2012, they're so much safer than top spot (which can burn sensitive skin and cause itching) and oral (which are known to cause seizures in so many dogs, especially the combo HW/flea pills). We even use these on our epileptic dog and she has never had an issue. All 3 of ours have incredibly sensitive skin and severe allergies to flea bites. We have never had issues with any of them having rash, itching, seizures, or even any signs of discomfort at all. In 8 years of use, we've never seen a flea or tick on our dogs, on us or anywhere in the house. Just a great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Mcclain-howell",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Great, but not for all dogs..!",
      "text": "I have used this, otherwise excellent tick and flea collar, on three of my dogs. On one of them the results were horrible. It burned his skin and hair right off and created a very bad skin condition on him. However, this has worked very well on the other two dogs I have. Therefore, be careful and keep a close eye on your dog around the neck area to ensure she/he will not have a reaction to this collar.",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Sanchez-Osorio",
      "helpful_votes": 4,
      "publication_date": 20180813
    },
    {
      "title": "This product caused a flea infestation in our house.",
      "text": "Our dog trainer heard stories about this product causing seizures in dogs, so she made her clients promise not to use it. My mom stopped using our completely different flea medication instead. We developed a massive flea infestation. Thousands of new fleas were on our two dogs every day. I got hundreds of flea bites. I got fed up and ordered seresto, thinking it would be the best thing, based on their advertisements. It didn't do anything. I tried shaving their necks. We've given it a week. Still nothing. Seresto should not be on the market.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Expensive, but effective at stopping fleas",
      "text": "These things are more expensive than they probably should be, but it seems all flea treatments are expensive. I used to use the Frontline drops, but there were side effects (kids can't be around the dog for 12 hours, the dog acts funny for the first 24 hours, etc.), and I was looking for a better option. This has proven to be just as effective, but it doesn't have any of those other side effects. The collar seems to be effective for about 3-4 months, then I will see our dog start scratching again. A day after putting on a new collar, the scratching stops.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Mizell",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Surprisingly Effective and Consistent Flea Repellant",
      "text": "I didn't expect great results from a flea collar but I had tried the dips and they just weren't consistent. They would work well initially but the fleas always made their way back well before the treatment expiration period. So, in frustration I tried this based on the positive reviews I had read and am glad I did. It took about 2 weeks for all evidence of fleas to disappear and stay gone. Living fleas will die within two hours of collar application but the nits will remain. When they nits hatch, they are weakened within a few minutes and killed within two hours, leaving no time for mass reproduction. Recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 10,
      "publication_date": 20151202
    },
    {
      "title": "I love the Seresto collar",
      "text": "I love the Seresto collar. I am on my 3rd collar & have had no problems whatsoever & I feel better not having to put a topical on him. Any time I find a tick on my dog it is already dead. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Peebsmom",
      "helpful_votes": 10,
      "publication_date": 20170307
    },
    {
      "title": "Caution if a thick undercoat - medicine may not be absorbed",
      "text": "Last year, at the recommendation of my vet, I switched to a Seresto collar on my 75 pound Great Pyrenees without problem. Purchased a new collar this year. Found 2 living engorged dog ticks on the floor of my home. My dog had both Lyme and anaplasmosis (a similar disease associated with diarrhea and vomiting). The vet commented that in some dogs with a thick undercoat like Great Pyrenees, the collars are not effective. I am back on Advantix 2 with direct skin application-a product that had been successful for my Pyr for several years.",
      "rating": 1.0,
      "verified": true,
      "author": "JB Stonington",
      "helpful_votes": 3,
      "publication_date": 20180714
    },
    {
      "title": "Works minimally -- nothing like previous purchases of Seresto.",
      "text": "I thought I had done my homework to purchase from a seller of genuine Bayer Seresto, however after having used this collar on my long-haired dog, I find it works nowhere near as well as previous Seresto collar purchases. The collar repels fleas from the area right next to it, but not from her tail end or underside. Previously, it was a miraculous success. This collar is either a counterfeit or Bayer has drastically changed the formula. It's confusing, because the tin, package printing, contents and seals all appear to be legit. (And yes, I treated all pets in house, cleaned environment, gave time for many weeks of the flea lifecycle to pass, etc.)",
      "rating": 1.0,
      "verified": true,
      "author": "Fireflyfaster",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Buyer Beware",
      "text": "We used to like this collar. However, over the last few month our dog started to have a bad reaction to it. At first we thought it might be an infection or allergies and we had all kinds of expensive testing done. We also changed the dogs food several times in case that was the source of the rash. But the skin rash kept coming back and getting worse. Our vet then suggested switching to an oral flea/tick medication. It's been a few months now and the skin rash hasn't returned. We will never use this product again and we wouldn't recommend it to others. Our only regret is that we didn't realize that this collar was the problem sooner.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 6,
      "publication_date": 20171120
    },
    {
      "title": "Likely counterfeit; certainly defective",
      "text": "As other have reported, this collar did not work. We put it on our dog in March. Three ticks in the last two months, whereas previously through two seasons with collars purchased from vet, our dog had no ticks. I no longer have packaging so cannot verify, sorry to say. This is dangerous both for our dog and for her humans, especially as we have lots of deer along with their deer ticks.",
      "rating": 1.0,
      "verified": true,
      "author": "Lynda M.",
      "helpful_votes": 4,
      "publication_date": 20180722
    },
    {
      "title": "Good product",
      "text": "1st time using this kind of product on my large dog, Weimaraner. I usually used Program, a once a month pill. I couldn’t get Program and my Vet told me to get this. They said they were finding the other products you squeeze into skin on the dog were not very effective anymore, in their opinion. My dog does not seem to be reacting to this. He does seem to be having allergy problems such as biting feet and scratching ears. Some breakout of tummy skin. I believe from our high pollen count. I will have to monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Hankemeier",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "I really had high hopes",
      "text": "I was really hoping I had found something that would finally work to kill my dogs fleas. I have tried topical with no results and decided to do rit this collar. It’s been almost 3 days and my dogs still have fleas and still scratching like crazy. I had to actually take off one dog b cause she got a rash from the collar. Looks like I will have to go to the vet and get a oral prescription pill since those always worked in my the past but not easy to administer. Seems like this product works great for some people but I was not one of those lucky ones.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele M",
      "helpful_votes": 4,
      "publication_date": 20180113
    },
    {
      "title": "Waste of a lot of money!  FLEA INFESTATION",
      "text": "My dog still has fleas! I wasted my money on this Just took my dog to the groomer have to spend hundreds of dollars because of a flea infestation. The grooming tech said He had thousands of fleas on him. I want my money back. I have filed a claim with the company who makes the collar as well I’m sure this was a defective product or perhaps a fraudulent product. I will call amazon customer service to request a refund. I am so disappointed. My dog is suffering because of a flea infestation when he had a collar that was supposed to prevent this from happening.",
      "rating": 1.0,
      "verified": true,
      "author": "TBS",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Lyme's Positive",
      "text": "This product did not protect our dog from Lyme’s. She lost complete mobility in her hind quarters, tested positive for Lymes and is undergoing treatment. $600 in vet bills later she is just beginning to walk again. This collar was purchased April 27 so should have still been effective. This is the third time I purchased this method of flea and tick control. We are switching to oral prevention.",
      "rating": 1.0,
      "verified": true,
      "author": "Julie Berry",
      "helpful_votes": 6,
      "publication_date": 20180926
    },
    {
      "title": "Scary Situation",
      "text": "This is my second collar for my dog. The first one was fine. This one my dog had 3 days of vomiting diarrhea and her body was covered in hives/welts and chunks of fur came off her, she now has patches of fur missing. I'm not sure if this one had more chemicals in it or not but now I'm afraid to use it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 4,
      "publication_date": 20180914
    },
    {
      "title": "It works for 6 months",
      "text": "This is my second seresto. They say it should last for 8 months but I plan to purchase one every 6. At 7 months my first collar became ineffective having found 5 ticks on my dog in a week. But as soon as I replaced it the ticks did not attach again. Thanks Amazon for the quick delivery. I find the collar easy to put on and cut to size. And there is no noticeable scent or residue. One recommendation, make sure the collar is put on as instructed. If it is too loose it will not work.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonbeam",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Didn’t work for my 4 (6/2020)",
      "text": "Very disappointed.... Ordered 4 (6/2020) hoping they would stop the itching, biting, redness...hasn’t stopped. After being on over 72 hrs, absolutely no sign of stopping. Still red bumps, biting, scratching, scooting butt....already do the advantage multi monthly, premium salmon dog food, omega supplements, special allergy shampoo from the vets.....only outside to play and potty, then back inside. Still putting on Bacitracin Zinc ointment on their sore red bumps/spots, Benadryl at night so they can sleep better....so wanted these collars to work. Not sure if it’s bc I ordered thru here and not the big online animal company, but these are duds...and @$45 x 4, to expensive to not work.",
      "rating": 1.0,
      "verified": true,
      "author": "AJ is Peachy",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Don’t believe all of the reviews",
      "text": "I hear all these people talking about how their dog has a reaction but you shouldn’t buy something for your dog if they have a reaction which I know you don’t know that but don’t give the company a bad review because your dog has an allergic reaction my dogs are just fine I have 4 dogs and it’s the best thing I have ever bought for my dogs . I about to order one more because my beagle rolled his face and neck in a dead animal 🤦‍♂️ so u can’t wash it it’s been about 4 months so I’m only loosing half of my money considering it last 8 months for me .",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Poison to our dog! Caused vomiting & diarrhea",
      "text": "My English Lab has this Soresto collar in for 1 month and after a month, we noticed he would vomit every night, his mood became subdued, and then he had bad diarrhea for almost a week. After an emergency visit for X-rays and blood work and multiple vet visits and more xrays and drugs, he was still having symptoms. Then I googled side effects at of this collar and it listed diarrhea, vomiting, dizziness. We took it off right away and have him a bath and the next day, we stopped vomiting and started coming back to normal. We were poisoning our dog :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200603
    },
    {
      "title": "not that good anymore",
      "text": "I have used Seresto for years.. they have always been worth the extra money and lasted longer than any other product out there.. not this time.. I am 5 months into an 8 month collar and the dogs are covered in fleas.. the yard is sprayed regularly and have never had any issues before now.. I will have to find another collar that works.. I don't like the drops afer having a dog act strange after applying them.",
      "rating": 2.0,
      "verified": true,
      "author": "Robbie M.",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Didn't work.  The fleas just moved to his hiney.",
      "text": "The collar didn't work. While there are no fleas right under the collar, they just moved to his extremities. In fairness, the drops also stopped working. ( He's 21lbs with medium length hair. ) Fellow dog owners tell me that fleas can get immune to specific treatments and maybe that's the case. (I don't know.) But this collar was a total waste of money -- and it wasn't cheap! I think I've tried all the retail treatments -- my next step is some super high prices prescription treatment from the vet. If that doesn't work -- I feel really sorry for my sweet pup. He's being tortured now.",
      "rating": 1.0,
      "verified": true,
      "author": "Toomuchnoise",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Maybe it’s a fluke and",
      "text": "I previously bought a collar from eBay which was fake (my stupidity for buying off eBay). I then bought one from petsmart which was 100% realand worked very well. The last one I purchased from amazon. It doesn’t work at all. I have lots and lots of fleas on my dog. Have been spraying the house and spraying my dog trying to get rid of them. Have no clue why this one collar doesn’t work but am starting to suspect it’s either defective or a fake. Taking dog to vet to put on oral medication because I’m unwilling to buy another expensive collar that doesn’t work. Very puzzled as Amazon has been really trustworthy in my opinion.",
      "rating": 3.0,
      "verified": true,
      "author": "Shariike",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "They must have changed their ingredients...",
      "text": "I have been using Seresto collars for six or more years. I purchase some from Amazon and some from an authorized retailer on another site over the last two years and they have not been working! Either Bayer changed the ingredients or the fleas in my area have become immune. These collars are absolutely worthless. My dogs have the same amount of fleas whether they are wearing the collars or not.",
      "rating": 1.0,
      "verified": true,
      "author": "Bridget",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Work great",
      "text": "I loved this! It worked well for two years (different collars of coarse as they only last 7-8 months) before my dogs skin issues finally caught up with us and we had to stop using the collars. If your dog has a history of sensitive skin you’ll want to check under the collar every day or so to make sure they aren’t developing the rash other reviewers mention, but otherwise these are great!",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Not what they used to be or counterfeit.  Either way unsatified.",
      "text": "Have used this brand collar for 3 years and never had an issue. This last set are not working. Read about counterfeits and you could contact Bayer so they could check. Contacted Bayer and was told that was not true. After answering lots of questions, they blamed us for the dogs getting fleas. Said if they are bathed more than once a month that you have to change the collars out at 5 months and not 8 months. We never had this issue before so I lean to this as covering themselves. Guess we will be looking for a different manufacture of flea collars now because over 120$ for collars that do not work (for us) is not an option.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve K. Pearson",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "The best purchase for all three dogs.",
      "text": "This product is amazing. After spraying our yard over and over my mastiff was miserable, we just could not get rid of fleas, biting flies and mosquitoes. I purchased this on recommendation from a friend. I bathed the dogs, and when they dried added their new collar. Within about a week the itching just stopped, they look happier, they are not scratching all the time. PLEASE DO NOT CHANGE THIS FORMULA (unless you are going to make it a little stronger for the dogs that live in rural places). ***NOTE: I recommended this collar to a friend who bought a cheaper version with the same name and IT IS NOT THE SAME PRODUCT.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela in Texas",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Nothing works for my pup",
      "text": "I tried Seresto last year and my pup still had ticks crawling and latched on. I switched to NexGard, flea/tick shampoo and sprayed him before walking the trails at a nearby state park, and he still gets ticks. Nothing works. But I think he's having stomach issues with the NexGard, so I'll stop that for a couple of months to see if that's causing it. I'm trying Seresto again, but with low expectations. Ticks in Rhode Island are active year round now. Is it climate change? It was never this bad, and I spent days as a kid exploring the woods near my home, rarely ever seeing a tick.",
      "rating": 1.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "No longer a fan",
      "text": "After the cat version caused my cat to get hot spots, this dog collar did the same to my dog(her 2nd collar). The collar is just not worth the discomfort and prolonged chemical exposure anymore. This product is easy and convenient for the pet owner and it does work (if it doesn’t cause chemical burns) but after more thought and consideration, I will turn to natural solutions. I don’t want constant chemical exposure to cause later problems for my animals. It’s not worth “convenience”.",
      "rating": 2.0,
      "verified": true,
      "author": "Michaela",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Sincerely believe this collar killed our dog!!! DO NOT RISK YOUR PET!!",
      "text": "My German Shepherd began to have lethargy, breathing issues and a subcutaneous mass on her throat where collar was. My husband took it off at two months, but not soon enough and she died after three months of initiating use of this collar. Our other two German Shepherds, who didn't have this collar but have had the same food and environment were fine. They are all three adults, but our girl deconditioned at about two months of use and it was awful!!!",
      "rating": 1.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Not the same quality of product I bought before.",
      "text": "I've had these collars for a little over 4 months & my dogs constantly have fleas on them. I've bought these in the past with no problems so I'm not entirely sure what was wrong with these collars this time. For as expensive as they are & only 4 months into use I am VERY disappointed as well as my dogs... For someone on a budget who has to save for esstienals like this & to not have them work what so ever..its very frustrating.",
      "rating": 1.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 3,
      "publication_date": 20181115
    },
    {
      "title": "I used to trust these collars but my latest collar doesn't seem to be working...",
      "text": "The last seresto collar I bought for my dog does not appear to be working like the previous ones. I keep finding attached ticks engorged with blood. I have been using these on him for years and I only found dead ticks on the floor of the house or amongst his fur, never attached and NEVER ENGORGED WITH BLOOD!! Now I am worried that my best friend might have contracted a tick born illness and according to my vet I have to wait 3 months before its worth starting any sort of testing or treatment?! I am not pleased!!! The packaging appeared to be different for this collar, what did you sell me Jeff Bezos, a Guandong provincial knock-off?!?!",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Why the flea?",
      "text": "I am loyal when I find a great product however very disappointed with this purchase. I have used this collar for several years and never had a problem. Wanted to save a little money so ordered it here instead of my vet’s office. Big mistake!! In three months my baby has went from the occasional flea to covered in fleas... now I realize that he will get the occasional flea from his trips outside but our faults sense of security has been blowed with this purchase. It is not working properly, I have wasted my money, tortured my poor baby in the process!",
      "rating": 1.0,
      "verified": true,
      "author": "Pjoiner42",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "BEST Flea and Tick solution on the market!",
      "text": "This product is great! Our dog has very sensitive skin and the chemicals in most flea and tick medicines bother her. This collar changes all of that and works extremely well. We've been using them for two years now and in those two years have found exactly one tick which was barely attached to our dogs belly and DEAD. She has never had fleas. We live in the deep woods of Virginia where fleas and ticks run rampant. For example, my husband had 4 ticks last year from working outside, my dog had 1 that was dead. Maybe I should buy my husband a collar too!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren R.",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "A+ it works. Careful when you subscribe and save!",
      "text": "THIS SELLER HIKES PRICES! Subscribed to save and seller has continuously raised and lowered prices almost charged me double the original subscribe price! Did not get an alert of price change product review below. Just a warning to be careful when you are “subscribe and save”. No smell and have not submerged in water. I usually leave on 1 of 2 of my dogs for about 7-10 days then move to second pet. Gave to friend so he could use for a week and he says it’s working. I usually keep these for about a year. When not being worn just sits on fireplace as a deterrent. A+ it works.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack H.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Not USA product, did not work on my dogs",
      "text": "I purchased three of these and could not figure out why they did not work for my dogs. I kept reading great reviews online but one review I read mentioned that sometimes these products are not manufactured in this country and don't work the same. Well, I checked and this was a foreign product! I had no idea when I bought it. I thought I was saving some money but it was a total waste of money because it did not work! Be careful and check for country of manufacture!",
      "rating": 2.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 2,
      "publication_date": 20180705
    },
    {
      "title": "Doesn’t work for ticks!",
      "text": "I first gave my dog a bath and then put on the collar. I have had it on my dog for a week. And today I have removed 5 ticks from deep imbedding in his skin. I thought this was a flea and tick collar? Obviously it is not working on ticks for my dog. NOT HAPPY! I have a 95lb German shepherd. I will look for another product after this COMPLETE waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Beware of fake product",
      "text": "I have purchased Seresto collars from amazon in the past and always been pleased with the product. I have heard of fraudulent products; however, given how difficult it is to get tick preventative during lockdown I continued to order. I received two products and one clearly is a dud. I have pulled 4 ticks off my dog since putting the collar on two weeks ago. When the collar is actually working, the ticks wont attach and you will find the ticks on the dogs fur. I am very disappointed about the money I wasted on this collar.",
      "rating": 1.0,
      "verified": true,
      "author": "K. Murphy",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Seresto Flea & Tick Collar Works Great!",
      "text": "I have been buying collars for the last 3 years. I have bought 3 collars in total. Collars are rated for 8 months of use. Yet the product packaging says that at 8 months the collar still maintains a 90% effectiveness. This being the case, if you plan so that the 8-month expiration arrives during the season of the year when Flea & Tick activity is least, then the Seresto Collar may last up to 10-12 months still being effective. This makes the Seresto Collar an exceptional value. Note that dogs should be inspected for pests frequently toward the end of the Seresto Collar life cycle.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Regular Guy",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Too much for 65 lb Plott Hound, not enough for 95 lb Lab",
      "text": "I live in Florida where fleas and ticks are no joke, and you have to be very careful what you buy. I've had several products not work at all (Frontline Plus, etc), unfortunately Seresto was not a good fit for my dogs. It caused irritation on my 65 lb Plott Hound, so I can only assume the strength was too much for her, even though I bought the appropriate size. And yet the correct size for my 95 lb black Lab wasn't enough, because I ended up finding fleas and ticks on his hind quarter area. I found another product that works perfect for the 3 dogs I have now.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Does the job!",
      "text": "I starting getting seresto collars for my pets last summer and love them! The whole time they are on I don't see even a sign of a flee or tick. On one of my cats the collar fell off and he immediately got ticks. It is well worth the extra money up front to not have to worry about flees or ticks for so long, or wondering when the last time you put the liquid stuff on. I have and will continue to highly recommend these to anyone with pets!",
      "rating": 5.0,
      "verified": true,
      "author": "DeAnna",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Works but died far too quick for the $$$",
      "text": "I'm very disappointed. The collar worked like a charm, didn't just kill fleas on my pup, but within a day or two, the fleas in my carpet and furniture, also gone. Unfortunately, the effects lasted just a bit longer than 3 months. Now I'm looking for something that isn't purported to last 8 months, doesn't cost $55 and works for most of the time the manufacturer says it does. I didn't save the packaging, of course, but I'm going to contact Bayer anyway. Fingers crossed for some kind of satisfaction from them, but I'm going to have to buy another brand in the meantime - not going to risk another infestation! SO disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Nikki Kim",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "100% works for us quick detail black lab owner",
      "text": "We have a black Labrador = swims daily Hikes in the woods off leash daily, we live in the Pocono mt. Infested w ticks. We started using seresto a year and half ago and have had no mire ticks on the dog!! (We used to pull them off him daily while using other products) We replace it every 3 months since he swims daily... not taking a chance of it losing effectiveness. We also spray his legs and under belly w off backwoods deet to help deter the bugs.... vet said thats better than getting lyme... 100% proof they work for our dog No rash, not itchy at collar site no issue!! Thank u seresto!",
      "rating": 5.0,
      "verified": true,
      "author": "BREATH2",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Variable",
      "text": "Over a few years I have purchased and used six of these collars on My dog. Each time I have found embedded ticks well short of eight months. Most often between five and six months. That doesn't mean that the collar worked before that period. Not finding ticks before that time period could well be seasonal or weather related. You can only know about the ticks that you find. Until this year I have rarely found a tick during the warmer monthd. My current collar was purchased and attached April 2019. Since then I have pulled off three very alive and attached ticks. Two were fully engorged one very close to the collar. Not good.",
      "rating": 3.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190630
    },
    {
      "title": "Works on some ticks, not on others.",
      "text": "We have used Seresto collars for our dogs for three years. At first, it seemed like they were magic... the dead ticks just dropped onto the floor. Last year and even more this year (after changing the collars more frequently than the promised time) some ticks seem to die and others bite and remain alive and engorged. It is mystifying but we can only intuit that somehow some of the ticks are immune to whatever the agent is in the collars. Anyway, we have taken to brushing out the dogs carefully after every walk and not depending on Seresto to take care of the ticks. Our dogs do not like water much so that is a non-issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs. Farr",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Amazing product",
      "text": "Awesome awesome awesome. Would buy again and again. We have two large dogs. One medium and one small. We bought three and thru contact we only needed to buy three. The smallest dog gets the benefit just by being around the others. No more fleas problem. Maybe a few here and there from outside but they definitely don't infest like they used to.",
      "rating": 5.0,
      "verified": true,
      "author": "chris van over",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Great Product, Great peace of Mind!",
      "text": "Have been using this product for 8 Years. Though it might be a little high in$$, it's worth the peace of mind! With the out break of deer ticks, and dog ticks, I might find one or two attached. But rest assured they are dead! My little guy is Twelve now and switching to a collar was difficult. But it works and he has a clean bill of health! I take it off during baths and put it right back on. It starts working right away! Remember, if it is really hot and for your dogs protection, I suggest renewing it in 7 months ( 8 months in should be replaced), but use your judgement!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms I",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Effective but rubbed off a patch of fur",
      "text": "Five starts for the tick repellant aspect--we moved to a tall grass tick-heavy area of NC for one summer and while I found a few on my dog's fur I never found one attached to her. Only docked a star because it had to be tight enough to fit under her regular collar, which had to be fitted enough so that she couldn't slip out of it, which led to the Seresto collar rubbing some fur off in a patch on her neck. I ended up only using it for three months because of this but maybe a dog with thicker fur or a different collar setup would not have the same problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Pretty good so far!",
      "text": "Not sure if if is water resistant because I just take it off when I shower my dog. Ok so I have a few fur babies in my house. 3 dogs and two cats to be exact. I was strugging with a flea problem(flea season) and needed it to be taken care of once and for all. Got the cat and dogs Seresto collars and was skeptical at first but I have to say it works! I started seeing dead fleas around where my pets were sleeping within a few hours. I took care of the fleas in my yard and inside the house too (using diatomaceous earth).",
      "rating": 5.0,
      "verified": true,
      "author": "Yasmine A",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Your dog should submit the review...",
      "text": "I have used these collars in the past with smaller dogs...worked for about 6 months...ok...but not the 8 month expectation. Order 2 collars for my small adult pups & e collars for my large pups (8 mo old lab mutts). A couple of days later, only one of the large pups has a viable collar...the others have been ripped off during play. I was able to salvage one, but it did not last long. I did tighten the collars using the typical \"stick your finger under it\". 2 of 3 collars have been destroyed...$100 down the drain...going back to Bravecto.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Fur Insurance fur your pet",
      "text": "I have used these collars for both our dog and cat for a few years now. Our dog spends a lot of time in a fenced in yard hunting and playing and rolling all over the green grass in prime tick flea season. I have been impressed that I have never spotted a flea EVER on him, and the only ticks I’ve seen on him are dead ones. The cat is indoor mostly but in the past are dog has brought in fleas that she was infested with. She wears here’s fur insurance and it is working out fine. I just wish they weren’t so expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "Cakeview LLC",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "So Far So Good",
      "text": "I had a hard time justifying to myself the cost of these flea collars. Now however, I'm glad I did. We bought two for our dogs and within a couple of days you can see the difference with the dogs. They seem much more calm. They're happy. My wife's happy and that makes me happy. The instructions say they are water repellent. You don't have to take them off for water. It just says not to bathe the dog more than once per month. If they last as long as they say they will I will be happy to recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Thomas",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Bumper year for ticks - first time not one found on our dog",
      "text": "We have a natural area behind our house and travel to the a cabin in the woods nearly every weekend during the summer. We used Frontline for over 10 years and tried the pill version last year with the same results...ticks still bit and are always transported on their body. This collar has prevent ALL ticks from staying on the dogs body. In 2 months of hard use, I have yet to even see a tick on my dog. This collar is very much worth trying as a first stage protection to keep ticks and bugs off your pet. I would still use a medicine that will kill if they remain on board and bite, like Frontline as secondary.",
      "rating": 5.0,
      "verified": true,
      "author": "Ringo",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Nothing else works for my dogs !",
      "text": "I wish there was something more affordable to help my dogs during this time of the year. If you have a few dogs, this can be quite cost prohibitive. I’ve used these in my dogs for years now and I noticed that it is most effective on the first few months of use.. and if you have to buy one for the dogs, you also have to do the same for the cats (we have 3).. the cats seem to be the source of the fleas because they wander out in the neighborhood. Overall, happy with the effectiveness of the Seresto. Just wish they’d be more affordable!",
      "rating": 4.0,
      "verified": true,
      "author": "S Santiago",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "MY DOG HAS LYME ~ WEARING THIS COLLAR SINCE MAR 1",
      "text": "Dog was diagnosed with Lymes today at the vet. I'm very disappointed to say the least. Bill was $600 and I'm not sure if this will be the only treatment. I can provide the vet bill if anyone wants to question this. He has been moving a lot more slowly the past couple of months and I was concerned. Took him today. He has been wearing this collar since the day I received it. I feel like unless you get the collar at the vet you cannot trust what is being sold to you. EXTREMELY UPSET.",
      "rating": 1.0,
      "verified": true,
      "author": "Valerie L",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Best flea/tick prevention on the market",
      "text": "I've bought these 3 years in a row now. They work absolutely perfectly. We live on 50 acres with lots of fields, woods and swamp and these keep all the fleas and ticks away on our 2 dogs. They seem to last longer than the promised 8 months, too. We put them on in early Spring once we see the first ticks. Then they stay on til the snow sticks. If you're counting on the little reflective things on the collar though, don't. Those don't work. But hopefully that's now what you're buying it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Don't buy from amazon",
      "text": "I am very upset. It has been not even 5 months and I'm already finding fleas on my dog. I have never once before had an issue with the seresto collars and have been buying them now for years. I am very careful and make sure the collar doesn't get wet so there is no reason for it not to be working. I will never buy one from amazon again since I'm having to spend another $60 to repurchase a product I should have easily got another 3 months out of.",
      "rating": 1.0,
      "verified": true,
      "author": "Elisabeth Agee",
      "helpful_votes": 2,
      "publication_date": 20200523
    },
    {
      "title": "Not a single tick or flea.",
      "text": "I will buy these over and over! They work exactly as advertised. No scent, no weird powdery residue, and absolutely not a single tick or flea. I absolutely hated using those monthly oily applications and then trying to keep my water obsessed dogs out of puddles or the lake for a few days. This goes on and they go right back to their normal activities. I just wish that regular collars were easier to find that looped these in underneath instead of having two collars (this and their regular one). I’ve found them, but they are rare.",
      "rating": 5.0,
      "verified": true,
      "author": "KCayea",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "It seems to ATTRACT ticks.",
      "text": "I have read raves and rants about this collar, I am the later. Due to a recent move to a wooded area I needed a tick preventative to pair with Trifexis. Having dogs that swim quite a bit I did not feel a topical would suffice. I feel I have found even MORE ticks than before, some resting against the collar. It now seems my dogs get reactions to the tick bites, swelling, open sores that do not heal and become infected. I guess we will be switching to a Heartgard/Nexgard combo. I really wished this product would have worked but most definitely not for my two Westies.",
      "rating": 1.0,
      "verified": true,
      "author": "Meldoy G.",
      "helpful_votes": 5,
      "publication_date": 20161102
    },
    {
      "title": "Collar not effective",
      "text": "I purchased the flea collar for my 26 lb Schnauzer and it have not been effective at all. We have given this dog 4 baths - one each week to get rid of active fleas. Have sprayed the yard (3x) and bombed the house since he started wearing the collar. He is still covered with fleas in spite of having worn the collar since it was delivered. We did remove it when we bathed him. Is there any chance that the collar may have been in a batch that was defective? This collar was highly recommended by friends as being effective - but it doesn't seem to be working for us.",
      "rating": 1.0,
      "verified": true,
      "author": "Donna Kliewer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Made my dog sick",
      "text": "I have an almost 2 year old English mastiff. She had been puking violently and had this on for less than 24 hours. Took it off and no issue. After further review, I'm pretty sure it is the collar. She was with us 24/7 even outside and didn't get into anything that she could hav eaten. After we took it off, it was almost like she thanked us. Definitely do not recommend after this experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Té",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Did not live up to claims.",
      "text": "I purchase a collar for my dog. It was the second one since I felt the first one had done the job. She has had it about one month and today I found a tick on her head. She has never had a tick since I have had her (6 yrs.). I always used a product that was placed on her back but it was oily and I thought the collar would be just as good. I am really disappointed that the collar didn't do the job and I will go back to the other product. I thought that I was doing the right thing even though it was rather costly but if it doesn't work the cost is immaterial.",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara A. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "No mo’ fleas!!",
      "text": "We have a 24 lb Cavachon. We’ve used the Seresto flea collar for the last four years. It is as effective as advertised. The first year we used it, he was eaten up with fleas and had two ticks. We lived on a golf course and because of the pesticides they used, fleas/ticks were immune to the traditional Harts flea medicine we had been giving him. We gave him a flea bath and put the collar on him. Immediate results! And, this collar doesn't have an odor like other flea collars.",
      "rating": 5.0,
      "verified": true,
      "author": "Happy Wife",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "I didn't learn",
      "text": "I've bought this product 3 different times and you'd think I would've learned! The first time i purchased and used on my dog it worked great. Fleas gone by the next day. The second time absolutely nothing happened so I thought it may have been a bad batch after being so great the first time. This third time I was greatly disappointed all over again. My dog is still itching even after a flea bath combined with the new collar. I dont recommend buying this product. Unless you want to gamble recieving a properly working product vs. a dud. Oh side note- the kind for cats gave my cat a huge open wound on his neck that almost got infected.",
      "rating": 2.0,
      "verified": true,
      "author": "Sadie",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "ZERO STARS",
      "text": "I just got my collar delivered a few minutes ago and when I opened the box I could tell the collar was used. It smells like dog, it has dog hair on it and it's stained. It's absolutely disgusting and I am so pissed that it was sent to my house. Definitely don't recommend buying this product. I recommend purchasing these from Chewy or your veterinarian.",
      "rating": 1.0,
      "verified": true,
      "author": "Monèt",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "It works!!",
      "text": "This really works! My guy is a 120 pound Golden Retriever/German Shepherd mix and he is a flea magnet. Even with Frontline on he still managed to get fleas and we tried everything to get rid of them - 12 different shampoos, more Frontline, Capstar, and at least 6 different sprays and NOTHING worked. It did take a good 4-5 days of him wearing the collar until he was completely flea free but honestly within 24 hours I noticed a difference. Do not let the bad reviews stop you from trying this. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda B",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "My vet recommended and it works!",
      "text": "My vet recommended this particular brand as the only flea collar that is truly effective. Since it has been warm, the fleas are coming back and my neighbors dog (who I dogsit daily) had an outbreak. My dog hasn’t had a single flea in him. We go to the mountains and hike, the ticks have stayed off him as well. I’m very happy because I’m nervous about what’s in the pills and the oils that you put on the skin down the back make my dog very lethargic.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "It works",
      "text": "Be sure you buy Seresto collars from a reputable dealer. There are so many fakes out there that you simply would not believe it. The real thing works well.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 2,
      "publication_date": 20200702
    },
    {
      "title": "What should I do?",
      "text": "I've purchased many of these collars for my cats and dogs. For whatever reason, this collar is not working. My newest dog, a 2 yr old wire fox terrier mix, has had this collar on since it arrived at my home. She continues to scratch so I looked for fleas. Lo and behold, there are fleas still on her after all this time. I really couldn't believe it because all other collars worked beautifully. I'm not sure what to do. This morning I tightened the collar to see if this would help, although I don't want it too tight. Currently there is a finger between the collar and neck of dog.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina Alston",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Love Seresto Collars!",
      "text": "I've been using this Seresto collar for my husky & german pointer for years. German pointer loves to swim and the collar still works. German Pointer also has sensitive skin issues with liquid flea treatments so this is perfect. Doesn't have a bad smell. It lasts 6-8 months. I'd rather pay for these collars instead of 1-3 pills a month from the vet that is $70 or more and only lasts one month against fleas. If I go to the vet then Im charged $70 or more per dog! So paying to have 2 of these collars and it lasts 8 MONTHS! You end up saving your money! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bri",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Works great - no fleas, no ticks",
      "text": "We were having an increase in ticks on our dog, so we were recommended this collar. As soon as we put it on her, she did not get another tick the rest of the summer. We are now on our third collar and she has had 1 tick on her but it doesn't attach, it was just dead on her fur. We swear by these and replace them about every 6-8 months. We have used them on her in different states and with different dogs around and she has not had fleas since we started using them either. I would definitely recommend as long as the dog does not have allergies to anything in the collar.",
      "rating": 5.0,
      "verified": true,
      "author": "April Johnson",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Quit working after four months",
      "text": "We purchased this item in June and it quit working in September. I’m not sure if it was a counterfeit but it seems to have failed for months into an eight month service. Our dog has begun itching himself raw.",
      "rating": 2.0,
      "verified": true,
      "author": "Inga",
      "helpful_votes": 2,
      "publication_date": 20200918
    },
    {
      "title": "Hands down THE best tick and flea repeller on the market !!",
      "text": "Easy to fit and trim. Light and thin enough not to interfere with regular collar. Works extremely well, as good if not better than the chewable or liquid form of tick/flea repellents on the market. We have massive infestations of ticks in spring and again in late summer. Our dog gets into them constantly. This kills them quickly if they bite and ultimately repels them so the dog isn't constantly bringing ticks into the house.",
      "rating": 5.0,
      "verified": true,
      "author": "sk-cjg - NH",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Doesn't last 8 months",
      "text": "I don't know if there are limitations for this collar. I have had it on my German Shepherd, weighing almost 90 lbs., for 4 months now. I would find the occasional small tick on her (which you would have thought I was killing her when I pulled it off), but now I am seeing several fleas. The are usually on her underside near the back legs. She mostly stays inside, but I walk her 3 times a day. I'm not sure if it worth the cost if it only lasts 4 months. I will check into other options.",
      "rating": 3.0,
      "verified": true,
      "author": "S. Humphry",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Fantastic Product, Best on the Market",
      "text": "Either this thing really works or we got incredibly lucky. Last year I found one, ONE tick all summer on my dog while wearing this collar. Easy to adjust, not sticky or smelly, no residue, and appears to be comfortable. It's removed for bathing and the dog doesnt do water so cant speak on its water resistance capacity but we were super happy with the performance last year and reordered for this year!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Really great",
      "text": "I’ve used these for several years in a row and get one each spring. For me, it is easier than the liquid medication because you don’t have to remember to keep doing it and it isn’t dangerous for the dog at all if they lick it. The first time I got it, ticks fell off my dog and were dead. We hike outside about every other day and my dog loves being in the woods, swimming, and tall grass and if I ever find a tick on her, they fall off right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Lana Thomas",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "Beware of allergic reaction",
      "text": "I was sold on this product until my dog developed a rash on her head and hives all over her body after only wearing for 24 hrs. 3 weeks after removing the collar, 2 vet visits, 2nd round of steroid medication, and 2 weeks of antibiotics and my dog still has a mild rash on her head. This collar ended up costing me a lot of money, even after returning it and getting my money refunded. Now I have to be worried about what all the steroids are doing to my dog!",
      "rating": 1.0,
      "verified": true,
      "author": "RunBike",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Shocked I found ticks after only 4 months of use",
      "text": "Purchased this in December of 2018 to use for the spring/summer/fall season. Kept it sealed in package until I unwrapped it at the beginning of spring. Have used before in the past with good results so I am a little shocked. My dog has only had this color on for about 4 months now, and this evening I had to remove 2 ticks on his belly. We are outside a lot on walks or playing in the grass. I live in North Carolina so there are a lot of ticks. For the price of this product I would expect to at least make it to the winter season before having to purchase again for the following years warm seasons.",
      "rating": 2.0,
      "verified": true,
      "author": "Shawn Smallwood",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Does not work",
      "text": "My poor dog is still covered in bites after using for nearly a month. I called customer service and the first time they told me to give it another week and call back. I called back and they claimed it was just fleas that she picked up that hadn't died yet. My cats have been fine with their topical medicine but unfortunately it is not available for dogs. That has proven to me that it is not just an issue with fleas that are still dying. Aside from that, the product claims to repel fleas, so it obviously does not do that if it only works once they bite.",
      "rating": 1.0,
      "verified": true,
      "author": "beintrees",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Wow",
      "text": "Since we moved to the country, I was pulling 4-5 ticks a day off my dog. I was skeptical, but this collar is amazing. Has been on for over a month and not one tick. I do take it off for baths as I hear it doesn't last as long. I will buy this again. No side effects, no smell. We are all happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "A complete waste of money",
      "text": "A complete waste of money. Got this for our 55-lb Husky mix after trying two different topical liquid flea treatments with limited success. Gave her a thorough flea bath, washed all her bedding, and vacuumed the house thoroughly before fitting her with the collar. After a couple of days, fleas were back. Gave it a few weeks to work, but her flea problem continued to get worse. After almost two months, we were getting dozens of fleas off her daily with the flea comb. Worse than ever before. Gave her a flea bath, tossed the collar, and went back to the marginally effective topical treatments.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191005
    }
  ],
  "product_meta": {
    "title": "Bayer Animal Health Seresto Flea and Tick Collar for Dogs, 8-Month Tick and Flea Control for Dogs",
    "description": "Size:Dog- Over 18 lbsThe Seresto 8-month flea and tick collar for large dogs provides continuous 8-month flea and tick protection. Unlike oral flea and tick prevention products that require fleas and ticks to bite your pet to work, Seresto flea and tick collar for large dogs kills fleas and ticks through contact—no biting required. Seresto flea and tick prevention is also available for cats. Seresto flea collar for dogs is water resistant and remains effective after swimming, shampooing, or exposure to rain or sunlight. (Dogs must not be bathed more than once per month. For dogs that swim once a month or more, the control duration is reduced to five months for flea control, and reduced to seven months for tick control.) Seresto Flea and tick collars for large dogs contain two active ingredients: Imidacloprid to control flea infestations and flumethrin to repel and kill ticks. These active ingredients are slowly and continuously released in low concentrations, spreading from head to toes, even the tail, over your dog’s coat and skin. Seresto 8-month flea and tick collar for large dogs can be used alongside other identification collars. Avoid the hassle of messy monthly treatments and get the effective protection of Seresto flea and tick collars.",
    "rating": 4.1,
    "feature_bullets": [
      "Provides 8-months of continuous flea and tick prevention",
      "Seresto flea and tick collar for large dogs works through contact, so fleas and ticks do not have to bite your dog to die",
      "Veterinarian-recommended flea and tick prevention for dogs in a convenient, odorless and non-greasy collar; No need for messy monthly treatments",
      "Starts to repel and kill fleas within 24 hours of initial application",
      "Flea and tick collar for large dogs also helps treat and control sarcoptic mange and kills lice"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "4.75 x 4.75 x 1.5 inches; 2.08 Ounces",
      "Item model number": "86030594",
      "Date First Available": "January 28, 2013",
      "Manufacturer": "Bayer Animal Health",
      "ASIN": "B00B8CG602",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Flea & Tick Collars",
      "Dogs",
      "Pet Supplies",
      "Flea & Tick Control"
    ],
    "price": ""
  }
}