{
  "website_summaries": [
    {
      "verdict": "The height and sturdy construction make these a versatile choice.",
      "pros": [
        "12 x 24-inch construction",
        "Perfect for CrossFit or training for parallel bars",
        "Extra thick rubber on feet ensure that the bars won't move during workouts",
        "Made with commercial grade construction",
        "Comes with a lifetime warranty"
      ],
      "cons": [
        "An expensive option compared to other push-up bars"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Gets the job done, but unsure how long they will last",
      "text": "Sturdy steel that is cheaply bent and not well finished. Arrived with surface rust inside and around many areas. Finish was rather slippery, making it more difficult to use. Welds are hideous, incomplete, and lots of slag (sharp bits that were not removed during any form of cleaning process). Repainted & wrapped with bike tape, they do the job.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20180218
    },
    {
      "title": "Ideal functional strength training!!",
      "text": "Great workout for your core!! I like to cross train when possible and like to dabble in different forms of fitness and found parallette workouts to be extremely tough, yet extremely beneficial as you get older. It strengthens your core, arms and back; giving you functional strength. The quality of the device is awesome. I can definitely hold someone that is 300 pounds plus. The only downside is that I wish the bottom supporting beams were lower to the ground. I've stubbed my toe a couple times rushing through a workout, but I guess it teaches me to be in better control of my body.",
      "rating": 4.0,
      "verified": true,
      "author": "Tango",
      "helpful_votes": 9,
      "publication_date": 20170110
    },
    {
      "title": "Consistently Ship Defective Goods",
      "text": "I returned the first batch due to misaligned holes drilled in one of the feet as well and the holes in the parralleletes being too widely spaced--couldn't get the bolts in. Then on the second attempt the flange/foot of one of the bars was full quarter inch shorter than all the other feet, couldn't even see the hole with the other bolt secured. Extremely disappointed and irritated at my time being wasted. No QC seems to be done on their products, they just pack it and ship it apparently.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike mentele",
      "helpful_votes": 6,
      "publication_date": 20181003
    },
    {
      "title": "Didnt come with any hardware, poor communication with manufacture",
      "text": "They are ok, they have some finish defects. Welds seem fine. Didn't come with any bolts to attach the tops to the bases, had to raid my tool box for some loose bolts to assemble it. All emails and calls to the manufacture to get the bolt size and thread went unanswered. Wish they were a bit taller for bar crunches, but good for pushups and floor sit dips. I am not up to the level of L sits yet. Honestly my rings are more useful, but I will incorporate them into my workouts so I do not have to constantly change my ring heights during sets.",
      "rating": 3.0,
      "verified": true,
      "author": "Matt S.",
      "helpful_votes": 3,
      "publication_date": 20180317
    },
    {
      "title": "Solid pair of parallel bars",
      "text": "Very solid pair of parallel bars that I bought as a gift for my boyfriend. He says that they are stable and support his weight during workout without any fear of tilting or shifting. The item was very, very easy to assemble (did it in less than 5 minutes) and came with an Allen wrench so no additional tools are required. The joints were neatly welded and the paint job was fine, with no chipping or peeling observed. They're a little pricey but based on my research, they are a good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Two consecutive defective items in Mar 2020.. giving up on this seller",
      "text": "The first item had misaligned holes (picture 1), making them impossible to assemble. Since the manufacturer was slow to respond to request to replace the one base tube, I replaced the entire product only to receive a second defective item (picture 2) which quite ridiculously has a broken tube not attached to the bottom plate, rendering the bars uneven, unsafe, and utterly unusable. Both shipments had cosmetic defects that I was willing to overlook had they been the only defects. I really wanted to love this product but am disappointed as 8 days after my original order date as a prime member, I am still p-bar-less :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "These appear to be sturdy and well-built",
      "text": "These appear to be sturdy and well-built, however I became suspicious when the plastic bag enveloping the product had rusty-colored powder. As I began to assemble it, I noticed a couple of spots where the paint had come off and the rust appeared.",
      "rating": 2.0,
      "verified": true,
      "author": "Dan Knutson",
      "helpful_votes": 19,
      "publication_date": 20170217
    },
    {
      "title": "Just but it NOW!!",
      "text": "Wow what can I say? Oh yes.!!! I worried at first that this product would not stand up to my gym expectations. NO Problem !!! Best small sized parallettes I have ever purchased. They have been used by 100lb to 300lb people everyday for months. It's a no brainer. Great product, great price and great experience. Thank you Ultimate body. TrainerFit is on board with this product for life.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Durable, does not wobble",
      "text": "Easy to assemble and doesn't shake a bit even when doing handstand pushups. Good height to swing from L-sit to planche. Design I'd give 4/5 stars though because the caps at the end fall off easily. I don't really move the bars that much though so the loose caps are not that much of an issue and I could just hot glue them in. Bars feel thicker than a pullup bar, but still a good thickness for a sturdy grip. The metal isn't really slippery.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonRanger23",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Not level when when tightened all the way",
      "text": "I have to leave the screws loose or else the whole thing is uneven. If i put my whole weight on it then it kind of evens out. if I do push-ups or anything less than about 100 lb of body weight it becomes uneven. I have to leave some ones loose to make it even out which I shouldn't have to do for this product at this price range. (basically of the 8 places that are screwed in , I keep 3 of them loose to balance it)The places that are suppose to screw into the base are slightly bent back like how a lens would look.",
      "rating": 1.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20180822
    },
    {
      "title": "Strong and secure",
      "text": "These parallettes are extremely sturdy and the rubberized feet keep them from moving during use. They work effectively on both hardwood and carpeted floors. I use them mainly for working on jump backs and jump throughs for yoga and strengthening postures for handstand, and the boys I nanny for use them for gymnastics drills (as a stand in for the pommel horse, among other things) as well as handstands and they love them as well!",
      "rating": 5.0,
      "verified": true,
      "author": "ChynnaBob",
      "helpful_votes": 2,
      "publication_date": 20151209
    },
    {
      "title": "I love these paralletts!",
      "text": "After last year's shoulder surgery I have been motivated to stabilize and strengthen my repaired shoulder. My yoga instructor got me hooked on handstands and then he recommended these paralletts. I love them! Sturdy, great grip and I can hold a handstand for 30sec!! Awesome for body strength aka functional strength and shoulder stabilization!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaro Snopek",
      "helpful_votes": 4,
      "publication_date": 20150816
    },
    {
      "title": "They're paralettes",
      "text": "They are what they say they are. Sturdy construction, it takes about 3 minutes to assemble both of them, they're portable, and they're not particularly heavy. The feet are sufficiently wide that if you want to get crazy with calisthenics (like hand stands), they shouldn't move under you.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Edrington",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Secure and stable, works well for practicing press-ups",
      "text": "I bought these paralletes to make it easier to practice inverted press-ups without putting excessive pressure on my wrists. I feel secure with my weight fully on them. When my hands are sweaty, the bars feel slippery but it hasn't been significant enough of an issue to motivate me to wrap the bars in athletic tape (which I may do at some point).",
      "rating": 5.0,
      "verified": true,
      "author": "Darin D",
      "helpful_votes": 3,
      "publication_date": 20160803
    },
    {
      "title": "Want abs and shoulders, buy this!!",
      "text": "4 months of using these and my abs and shoulders are popping!!! I work at it 3 times a week and I’m thrilled with my strength progress but even more so the muscle definition I’ve gained in abs abs shoulders!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tim G",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Got a defect?",
      "text": "One of the bars isn't balanced... not sure what to make of it had to stuff paper underneath it to balance but still.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 3,
      "publication_date": 20170130
    },
    {
      "title": "Great product, nothing better for this price out there",
      "text": "Good price, excellent finish, strong high quality material, much better than other premium brands. I use it at home to keep myself in shape, I was impressed with the quality of this product, you won't find anything similar for a better price. I wish I would have found it before. I do recommend it to other fitness enthusiast customers.",
      "rating": 5.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "A slight wobble",
      "text": "These are solid but wobble slightly. I don't know if that has anything to do with my skills tightening nuts or not. I use it on carpet so it's not a big deal.",
      "rating": 4.0,
      "verified": true,
      "author": "David Edwards",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Calisthenics on point",
      "text": "Great qual and item to help train triceps, core strength and what ever else you can figure out to do with this",
      "rating": 5.0,
      "verified": true,
      "author": "KEV",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "One good, one crooked.",
      "text": "The materials and construction and everything is otherwise OK, but one of the handle mounts is crooked so I have to put something under one corner. Guess I got unlucky with the quality control.Seems somebody else posted about the same issue so maybe this happens from time to time. Otherwise seems sturdy.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170828
    },
    {
      "title": "Five Stars",
      "text": "sturdy and functional, just don't know how long the rubber feet are going to hold up",
      "rating": 5.0,
      "verified": true,
      "author": "AMAZON SHOPPER",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Very happy, ex-gymnast/USMC approved",
      "text": "I was bummed not to see a review about these when i saw them, but I took a risk. I'm extremely happy with them. If you want to build and get some functional training these are made very sturdily for some off the wall workouts. I used to be a gymnast and want to get back to ( or close to) what I use to be able to do. I'm well on my way with these. Packaging was great and all the nick naks were there. Even a tool to put it all together. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri N",
      "helpful_votes": 33,
      "publication_date": 20131031
    },
    {
      "title": "and now they're perfect.",
      "text": "High quality, work as intended. Only complaint is they are finished with a very slick finish. I just took some coarse sandpaper to them. Took a couple minutes, and now they're perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Parker",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Heavy duty and easy to assemble",
      "text": "Love them. Perfect size and stable. You can train on them without the filling they’ll break or move. Easy to assemble. Only keep the away from humidity as the will show some rust in a few months.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Kane",
      "helpful_votes": 0,
      "publication_date": 20171212
    },
    {
      "title": "Solid",
      "text": "Have to put these together, but it was very easy and comes with all hardware, took about five minutes. Nice touch is the rubber corners on the base, won't scratch floors for use inside",
      "rating": 5.0,
      "verified": true,
      "author": "JDogg",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Completely satisfied!",
      "text": "Exactly what I expected! The exercises that you can do with this is endless! Completely satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Pennywise the Dancing Clown",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Love these!",
      "text": "Great height for working the core and parallel work. The handles are slick when you sweat on them, I wrapped mine in atheletic tape to give me some friction. Great sturdy, stable parallettes.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle S.",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Good size for my height (I'm 5\"8\") and hand size",
      "text": "Good size for my height (I'm 5\"8\") and hand size, feels durable enough to handle a few times my body weight, safe enough to use for calisthenics.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon CustomerTop Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20160909
    },
    {
      "title": "Four Stars",
      "text": "I would love it if it didn't come with some rusted spots.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruno Raimondo",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "AMAZING workout for all of your upper body",
      "text": "AMAZING workout for all of your upper body. It may look easy, but don’t be fooled. I do 6 sets at 10 second holds (trying to do an L sit) and I am sore and ready for more!!! Work your way up and keep trying! Fast workout.",
      "rating": 5.0,
      "verified": true,
      "author": "dane",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Came on time!",
      "text": "Thank you all is well. It was fairly easy to put together! Thanks a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "Jon-Mark Wilson",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Great product. I thought the price seemed steep for ...",
      "text": "Very solid. Great product. I thought the price seemed steep for a pair of simple bars but....nope. Worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Thomas",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Very stable...",
      "text": "Just as described; fast shipping!! We have been having so much fun with these bars. Very stable; great from a wonderful workout!",
      "rating": 5.0,
      "verified": true,
      "author": "Sephmore",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Great",
      "text": "Good quality, perfect height for a variety of movements including handstand pushups and seated dips, very stable.",
      "rating": 5.0,
      "verified": true,
      "author": "B-Ro",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "very sturdy and can support my weight",
      "text": "very sturdy and can support my weight. try some basic exercises on it and hopefully will develop strength. good height also and should last for some time. thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Leal",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Five Stars",
      "text": "Awesome... kids can't stop playing on it. Works for me too. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Quality!!!!",
      "text": "These are big and sturdy! I think these would last through the zombie apocalypse!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "and very sturdy. I'm glad I bought it",
      "text": "This product is bomber, well made, and very sturdy. I'm glad I bought it, and I would highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "Great",
      "text": "Excellence piece of equip added to my arsenal of gym equipment!",
      "rating": 5.0,
      "verified": true,
      "author": "Ski152",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "SOLID - No need to go rogue",
      "text": "Solid product. Thought about “going rogue” but SO glad I bought this instead. Took me about 4 minutes to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "Tbro",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "A nice addition to your home work outs",
      "text": "An interesting product. It adds another dimension and variation to my work out routine I use it for push-ups and plank exercises Next I am going to try it for hand stands. Don F Los Angeles",
      "rating": 5.0,
      "verified": true,
      "author": "Don F--Los Angeles",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "They're good.",
      "text": "Overall, I was pretty happy with them. The construction and everything is good. I kind of wish I purchased a pair where the supports are thinner. When swinging from L-sit to shoulderstand I occasionally smash my foot on the support.",
      "rating": 4.0,
      "verified": true,
      "author": "Darren",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "As sturdy as described and no issues with grip slipping.",
      "text": "As sturdy as described and no issues with grip slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "o-fromrockville",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Five Stars",
      "text": "Very good, quality material. Very sturdy and easy to put together. Would recommend to others.",
      "rating": 5.0,
      "verified": true,
      "author": "KoryC",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Very sturdy construction and easy to put together",
      "text": "Very sturdy construction and easy to put together. Nothing more to say really. Great for doing hand stand push-ups.",
      "rating": 5.0,
      "verified": true,
      "author": "anthony",
      "helpful_votes": 0,
      "publication_date": 20151007
    },
    {
      "title": "It is unstable and came damaged with a dent in ...",
      "text": "It is unstable and came damaged with a dent on the lower end of the bar with a sharp metal piece in the dent. I almost cut my finger from it because I didn’t see until I used it. It is on the lower part of the bar. Also imbalanced and moves around when you shift weight. The bars mount is not even",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180217
    },
    {
      "title": "Great for callisthenics",
      "text": "This product is extremely sturdy. I had been looking for good priced parallettes for a while and was unsure if they would be too low to start off with but they are PERFECT. I have had friends and family try them and they they seem to work for people even as tall as 6\"3!! It is ideal for anyone wanting to do their own calisthenics at home or anywhere else as they are quite simple to carry around. Anyone at any level interested in calisthenics should buy this product. Very impressed with this product :)",
      "rating": 5.0,
      "verified": true,
      "author": "Supaman",
      "helpful_votes": 6,
      "publication_date": 20150316
    },
    {
      "title": "These are awesome for the price",
      "text": "These are awesome for the price. I've seen a lot more expensive version and these are just as good if not better",
      "rating": 5.0,
      "verified": true,
      "author": "Jill Carlile",
      "helpful_votes": 0,
      "publication_date": 20170315
    },
    {
      "title": "Very sturdy",
      "text": "Very easy to assemble. It took me about 5 minutes, and I am glad that I purchased these opposed to making my own. They are very sturdy .",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20170414
    },
    {
      "title": "These things are awesome. I don't necessarily use them often",
      "text": "These things are awesome. I don't necessarily use them often, but I'm glad I purchased them every time I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian M.",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Four Stars",
      "text": "I'm able to do several different exercises for my arms and core in a short amount of time.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorraine B",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Very sturdy construction, but it slips on wood",
      "text": "Very sturdy construction, but it slips on wood. They should improve the gums on the sides so that they have more friction with wood.",
      "rating": 4.0,
      "verified": true,
      "author": "Ramon Ruenes",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "... were a bit low but it is still a good piece of",
      "text": "The bars were a bit low but it is still a good piece of equipment",
      "rating": 3.0,
      "verified": true,
      "author": "ARTxSWk",
      "helpful_votes": 0,
      "publication_date": 20141117
    },
    {
      "title": "stable, well made, heavy.",
      "text": "these work well, metal is a bit hard on the hands and they are heavy to carry around. very stable.",
      "rating": 4.0,
      "verified": true,
      "author": "sfm",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Well made and functional",
      "text": "I like the non-padded grip bars. These are heavy-duty parallettes that will stand up to any kind of workout. I recommend them highly.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal Bentley Morton",
      "helpful_votes": 0,
      "publication_date": 20140322
    },
    {
      "title": "Five Stars",
      "text": "Very sturdy, well built, easily assembled/disassembled, strong enough to practice planche on it",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "This is a very well-built piece of equipment. The ...",
      "text": "This is a very well-built piece of equipment. The downfall is the finished product. Mind was delivered with chip paint and rust showing through.",
      "rating": 3.0,
      "verified": true,
      "author": "Michele Cady",
      "helpful_votes": 7,
      "publication_date": 20170107
    },
    {
      "title": "Fun!",
      "text": "Easy to assemble and really sturdy. They also work good on surfaces that aren't completely flat - bring them out in nature! I recently tried homemade wood parallettes that were lower to the ground, not nearly as fun as these. The only con was that the screws had a strong odor from the grease (I believe) but that is dissipating. I've gotten so much enjoyment out of these in just one week.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Kisthart",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "Professional Grade parallettes that perform above its price tag! Just get them!",
      "text": "I've used parallettes in a gymnastics gym, and it was hard to find affordable parallettes that didn't cost a fortune. This pair made by Ultimate Body Press is professional grade quality. Heavy, solid steel. I own their ab wheels, and I am convinced of the high standards that this company upholds. Well worth the money, and performs well above its price range, Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Christian Wolff",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "These are fantastic. Very well made",
      "text": "These are fantastic. Very well made, they do not move at all and the height and length are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "sparklyrobot",
      "helpful_votes": 0,
      "publication_date": 20150921
    },
    {
      "title": "Parallettes",
      "text": "Sturdy construction. This item is as advertised. Large rubber pads stops any slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlakos",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "I'm still a weakling but these have been great for the kids who love gymnastics",
      "text": "I'm still a weakling but these have been great for the kids who love gymnastics. They're sturdy and work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Great design it I got botched set I guess",
      "text": "Not leveled once assembled. Great design it I got botched set I guess. It’s wobbly when you planking it",
      "rating": 2.0,
      "verified": true,
      "author": "Psilo ",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "xtremely well made and works well. My only issue ...",
      "text": "xtremely well made and works well. My only issue is that one of the bars isnt perfectly flat on the floor so it rocks a bit while you are using it...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "Very happy with my purchase",
      "text": "Very happy with my purchase. This is a very sturdy product. Perfect grip size, dimensions, and clearance for my 5'11\" 165 lb frame. A bit pricey I think, but I suspect these will last a very long time. Glad I chose these rather than any of the others. You will not regret.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151016
    },
    {
      "title": "Love them.",
      "text": "Exactly what I wanted. They are heavy duty, I received them on time, and they work great. They have definitely expanded my workout routine.",
      "rating": 5.0,
      "verified": true,
      "author": "WolfmanRandy",
      "helpful_votes": 0,
      "publication_date": 20140404
    }
  ],
  "product_meta": {
    "title": "Ultimate Body Press Parallettes XL Push Up Stands 12x24 inch",
    "description": "ULTIMATE BODY PRESS PARALLETTES 12X24 INCH\nThe new 12\" tall steel Parallettes from Ultimate Body Press bring modern height and exercise versatility to parallette design. Our ultra stable, T-bar risers provide ample room for your feet and legs to pass through so you can focus on form and get full extensions for better workouts every time. The sturdy 24\" long, 1.5\" diameter U-shaped handles are ultra stong and eliminate interference with shoes and clothes so you can focus on form and repeition. Extra-thick heavy rubber feet assure stability on all floor types and support any weight.\n\nBETTER WORKOUTS EVERY DAY\nStart with full workouts from day one doing push ups, dips, shoot throughs, tucks and more. Bring your gym training home and make fresh progress on L-sits, handstand push ups, and planches. Get the gear designed for you and your workouts. Order your Ultimate Body Press 12\"x24\" Steel Parallettes today.\n\nSHOP WITH CONFIDENCE\nAt Ultimate Body Press our passion is providing high quality affordable fitness equipment for real workouts that fit your spaces and how you like to exercise. We are proud to serve your gym needs and want to meet and exceed your expectations for customer service. If you need any assistance with your purchase, customer service has complete resources to assist you and is available by phone or email during regular business hours Monday-Friday.",
    "rating": 4.4,
    "feature_bullets": [
      "12\" tall x 24\" long Parallettes for improved clearance and enhanced movement progression",
      "Easy pass through 'T-Bar' risers are ideal for CrossFit HIIT style exercises",
      "1. 5\" diameter U-shaped handles and thick non-skid rubber feet for increased stability",
      "Ideal for commercial fitness centers and home gyms of any size"
    ],
    "specifications": {
      "Product Dimensions": "24 x 10 x 12 inches; 15 Pounds",
      "Item model number": "PBAR",
      "Department": "Unisex-adult",
      "Date First Available": "January 17, 2013",
      "Manufacturer": "Ultimate Body Press LLC",
      "ASIN": "B00B2NXN30",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Strength Training Equipment",
      "Pushup Stands",
      "Exercise & Fitness",
      "Sports & Outdoors",
      "Sports & Fitness"
    ],
    "price": ""
  }
}