{
  "website_summaries": [
    {
      "verdict": "A good combination whiteboard that also sports a bulletin board for quick notes and reminders.",
      "pros": [
        "Whiteboard uses an easy-to-clean melamine surface that doesn’t take much to maintain",
        "Bulletin board has a cork backing for extra durability and repeated use",
        "Can be the perfect solution for a small office needing a community board"
      ],
      "cons": [
        "Limited whiteboard real estate makes it a poor choice for home or school use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Lorell Bulletin Board",
      "text": "After considering the negative comments, I decided to order it anyway. I am very glad that I did. It arrived on time, with no damage or markings. I was able to easily mount it upside down with the marker tray inverted on the top. It matches kitchen cabinet nicely. The reason I only gave it a 4 is because the faux wood finish looks like it would mark easy if one is not careful with it.",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 3,
      "publication_date": 20170507
    },
    {
      "title": "Good Board - Manufacturer's Sticker on Frame Can Cause Damage to It.",
      "text": "Board is very attractive and is functioning great at this time. One complaint is that a clear sticker with the Lorell emblem was placed on the wood portion of the frame. When removing it, it pulls up the dark varnish. I opted to leave the sticker on the frame as it is less noticeable since the type color on the sticker is black and the frame is dark then to leave a patch of bare light colored wood if peeled off with the varnish attached.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160516
    },
    {
      "title": "Love it",
      "text": "I love this item for sticking up notes/ reminders and writing my appointment/ meeting",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia Williams",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Decorative and functional!",
      "text": "Well-made product! Exactly as described. Used Command Strips instead of the hardware provided (which appeared to be extremely sturdy). I just did not want to deal with drilling any holes. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "SJHum",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Product arrived damaged",
      "text": "Very disappointed. Product arrived damaged. For the price I paid I would expect an undamaged dry erase/cork board. I could and should have bought a metal frame which was cheaper and lighter. Learned a valuable lesson.",
      "rating": 1.0,
      "verified": true,
      "author": "Gizmo",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Exactly what I needed",
      "text": "Exactly what I needed. I like to list what I have coming up and my husband prefers a calendar and the ability to pin appointment cards so this gives us both.",
      "rating": 5.0,
      "verified": true,
      "author": "Rmoore",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Good Size",
      "text": "It sits on my desk pried up against the wall. The size is perfect. It helps spur productivity. On the right, I'll list things that I need to get done. On the left cork side, I leave motivational quotes and recent notes.",
      "rating": 4.0,
      "verified": true,
      "author": "Dom",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Arrived in a box the size of a large man, broken in 4 places",
      "text": "This arrived in a box that was large enough for me to fit in. And despite the ridiculous amount of wasted packaging, it was broken in four places.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Great product.",
      "text": "Awesome value. Don't try to take the label sticker off though. It will peel away the laminate. :/",
      "rating": 4.0,
      "verified": true,
      "author": "working mom",
      "helpful_votes": 4,
      "publication_date": 20160328
    },
    {
      "title": "Doesn't erase well. Good price for what you get.",
      "text": "I wish this came with whiteboard cleaner and that it was magnetic. As you can see at the bottom on our board the blue is impossible to remove, even with several types of cleaners. We used the adhesives instead of the mounts. Very sturdy. It's an okay purchase for the price. I wouldn't purchase it again though based solely on the trouble we go through every time we want to erase something.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer McCollum",
      "helpful_votes": 0,
      "publication_date": 20201204
    }
  ],
  "product_meta": {
    "title": "Lorell Bulletin Board Combo, Dry-Erase/Cork, 24\"x18\", Mahogany Frame (LLR84270)",
    "description": "Combo Dry-Erase Board offers two ways to get your message posted and read. Half is a nonmagnetic dry-erase board with a melamine surface where you can write, erase and rewrite notes, reminders and more. The other half features a cork bulletin board where you can pin invitations, tickets, reminders and other bits of vital information. Combo board includes a marker tray and is highlighted with an elegant Mahogany finish frame made of medium-density fiberboard.",
    "rating": 4.2,
    "feature_bullets": [
      "Half is a dry-erase board with a melamine surface where you can write, erase and rewrite notes, reminders and more",
      "Other half is a cork bulletin board where you can pin invitations, tickets, reminders and other information",
      "Includes a marker tray",
      "Half Is A Dry-erase Board With A Melamine Surface Where You Can Write, Erase And Rewrite Notes, Reminders And More",
      "Other Half Is A Cork Bulletin Board Where You Can Pin Invitations, Tickets, Reminders And Other Information",
      "Includes A Marker Tray",
      "Combo Board Includes A Marker Tray And Is Highlighted With An Elegant Mahogany Finish Frame Made Of Medium-density Fiberboard"
    ],
    "specifications": {
      "Manufacturer": "S.P. Richards Company - Commercial",
      "Brand": "Lorell",
      "Item Weight": "4.23 pounds",
      "Product Dimensions": "26.22 x 20.2 x 1.38 inches",
      "Item model number": "LLR84270",
      "Color": "Mahogany",
      "Number of Items": "1",
      "Manufacturer Part Number": "LLR84270",
      "ASIN": "B00B0AS76I",
      "Customer Reviews": "4.2 out of 5 stars25 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#23,101 in Office Products",
      "Date First Available": "January 12, 2013"
    },
    "categories": [
      "Office Products",
      "Presentation Boards",
      "Office & School Supplies",
      "Dry Erase Boards"
    ],
    "price": 25.49
  }
}