{
  "website_summaries": [
    {
      "verdict": "Stylish dog ID tag that has an embossed paw print on one side and text on the other side.",
      "pros": [
        "Design allows for up to 4 lines of text on the back side of the tag",
        "Uses a laser-engraved printing design that ensures the text will be readable well into the future",
        "Contains a stainless steel design with a mirror finish to provide a stylish look",
        "Offered in 2 sizes of tags"
      ],
      "cons": [
        "Small size of round tag is almost too small at about 1 by 0.9 inches"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The letters have faded",
      "text": "It's been about a year since I've had these tags for both of my dogs and they have both become faded to the point you can't read the lettering. The material itself is 30 there are no cracks or breaks on the tags but I'm going to keep looking for dog tags that can retain the lettering for a longer amount of time",
      "rating": 3.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 28,
      "publication_date": 20171126
    },
    {
      "title": "Love it!",
      "text": "It's the perfect size for my kitten! The letters are clear and easy to read. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Sakura Chan",
      "helpful_votes": 27,
      "publication_date": 20170321
    },
    {
      "title": "So many options on Amazon-I’m glad I picked this one",
      "text": "Spent way too much time looking at tags on Amazon after losing my dog’s collar & tags. Very happy with this purchase. I got the small size, perfect for my 10lb terrier. Great quality, adorable & love that it had room for address & phone number. I of course found my dog’s collar the day after receiving this but just switched out old name tag. Happy customer. Would reorder-great price. Also, I received my tag in a small envelope, protected but not I over packaged. Also came with a 10% off coupon for their other personalized products. I’m a frequent Amazon & online shopper & am always amazed at how much waste some things come shipped with.",
      "rating": 5.0,
      "verified": true,
      "author": "APositiveMind",
      "helpful_votes": 15,
      "publication_date": 20171209
    },
    {
      "title": "Nice, but the tag silencer liner comes off",
      "text": "Love the tag itself; very classy and durable. The tag looks great, but the rubbery, glow-in-the-dark, noise-proofing liner can be pulled off of the metal tag and dangle separately. Our dog really wanted to chew the rubber liner, so she was always getting it loose from the tag and I was always fitting it back onto the tag. I figured she'd eventually lose interest in it, but within a week it got caught on something and broke off. She wears the beautiful metal tag now without the liner and that's fine, but I wouldn't bother ordering a liner again.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Rock",
      "helpful_votes": 9,
      "publication_date": 20181119
    },
    {
      "title": "Top quality ID tag",
      "text": "After going through various tags available from Amazon and Ebay, decided to pay slightly more for the Paw Print. No regrets as its made of metal (not aluminium) with a classy chrome finish. The letterings appear to be laser etched in black which makes it very readable. The embossed paw print on the opposite side is of high quality. It's the perfect ID trinket addition to give our Goldendoodle's collar that designer's look! Only time will tell how long it will stay this way. For now, looks like it will do an admirable job.",
      "rating": 5.0,
      "verified": true,
      "author": "Rott boy",
      "helpful_votes": 10,
      "publication_date": 20170829
    },
    {
      "title": "Beautiful and functional",
      "text": "My dog's tag arrived about the time it was promised (maybe even a few days early) and I was quite satisfied with the appearance and thickness of the metal. The dog is pretty active so I'll know in a few months how well it wears. One thing I noticed was that AFTER placing the order, the confirmation message implied I had chosen the Arial font for the tag. I don't remember seeing a font choice. Arial is a fine choice for readability. But if I had a choice for my little West Highland Terrier, I might have chosen to put her name in an ornate blackletter font. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "T. W. Trussell",
      "helpful_votes": 4,
      "publication_date": 20170316
    },
    {
      "title": "Its really cute but make sure you choose correct size!",
      "text": "I was unhappy but I guess it was my fault for not reading the size and realizing I could've chosen a smaller version. I got the regular size and it's huge! Ide say a half dollar coin size. Def. For a really big dog ex. like a Labrador, mastiff, or golden retriver. Don't think ill be using it on my dog which is a rat terrier mix. NEW REVIEW I rebought a new tag in the small size it's perfect it's looks really cute. I didn't have issues with the engraving being off centered or anything visually unappealing. Would purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Ely",
      "helpful_votes": 15,
      "publication_date": 20170823
    },
    {
      "title": "This is jewelry-like quality.",
      "text": "I searched and searched for the perfect tag for our new male cat when I decided upon this one. I know you're thinking...a tag is a tag, but this one is so nicely designed. The paw print almost sparkles, it's weighty, and just a good, solid tag with good quality engraving. Was delivered very quickly. This cat has never worn a collar & tag before & he took right to it. It looks awesome on him. I'm happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Louie",
      "helpful_votes": 4,
      "publication_date": 20170906
    },
    {
      "title": "Good quality; works perfectly for our cat",
      "text": "Very happy with the size small, stainless steel paw print tag. I was worried it would be too heavy or large for our cat, but he's taken to it just fine (never had a tag on his collar before). See photos. The stainless steel feels durable and good quality. The paw design is done nicely. We opted for just name and 2 telephone numbers (3 lines) on the size small tag, and they fit fine. The etching of the characters, with a little blackened color, looks good and contrasts nicely against the steel, and are very readable. See 2nd pic. We would definitely order from this tag maker again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181018
    },
    {
      "title": "Cute little tag, great quality, BUT...",
      "text": "Lovely little tag, but a mistake by the engraver turned this purchase into a real pain. Note the extra characters at the end of the phone number which was not on the form I submitted. Would really like to put this on my dog’s collar - the quality is great. But not like this.",
      "rating": 3.0,
      "verified": true,
      "author": "F. M.",
      "helpful_votes": 6,
      "publication_date": 20171125
    },
    {
      "title": "Beautiful tag!",
      "text": "The pawprint design is really cute, and the high shine polished stainless steel makes it look pricey but it's not. The engraving doesn't seem very deep but fairly easy to read, and the photo made it look like it would be heavy but it's nice and lightweight. Customer service is superb! I accidentally ordered the regular size but wanted the small one, so I contacted the seller and they said no problem and sent me the small size. It arrived sooner than expected. Very pleased with my purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Sk34",
      "helpful_votes": 5,
      "publication_date": 20160310
    },
    {
      "title": "Best pet identification tag!",
      "text": "It's a BEAUTIFUL tag! It was bigger and bolder than the online image looks, and it was absolutely perfect. I purchased it for a pet sitting client after being uncomfortable that his dog had no source of identification. I received it just as she was being picked up in a cute package that even included the keyring. Little did I know until she came back a couple nights later that the ring around the tag GLOWED IN THE DARK! Just another added great surprise. I definitely loved it, and so did her Dad! I will definitely purchase here again rather than using the kiosk machines at big retailers",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Perfection",
      "text": "My most recent surrender is a 3 year old 4lb chorkie. She acts like shes 100 most days. Her owner was elderly and very sick, she surrendered Daisy (now pancake) to us for both their own goods. Shes so tiny as she takes after the apple head chi and tags seemed impossible but here we are rocking the Hawt pink metal!! Its light weight but durable. A wonderful $8 spent to know if she ever wonders away, she'll be able to get back home. Tho I doubt she wonders, she never leaves my side.",
      "rating": 5.0,
      "verified": true,
      "author": "TacoSparkle",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Eventually it will break at its weakest point",
      "text": "I ordered two of these for two different dogs. The metal hole at the top of tag (where the metal ring goes through that it constantly rubs against) will very slowly wear and eventually the tag will fall off. This happened after 3 years on one, and 5 years on the other. See attached picture for an example. Rather than pay $9 for this one, I decided to purchase a similar tag from a different seller for $3 that is also personalized and looks to have at least the same durability.",
      "rating": 2.0,
      "verified": true,
      "author": "S & J",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Love this!",
      "text": "I actually purchased this to hang from my rearview mirror. We had rescued a dog that I immediately bonded with and loved to death. But he hated my husband and bit him three times, so we had to return him to the rescue. I was heartbroken and wanted something to remember him by. This is the perfect size to hang from my mirror. It would also be perfect for a dog’s collar (as it’s meant to be used!) and I will definitely order another when we get a puppy at the end of October!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Print wearing after only a month",
      "text": "The front, sparkly paw is cute and so far the glitter is holding in place. The issue is the print on the back, with the important info, is scratched and lots of the black ink inset have already worn off. I expect this kind of wear over time, but this is after a month, and our dog doesn't even wear her collar all of the time. And this is with the rubbery tag silencer which I thought would've protected it a bit. This item is not exceptional, especially considering the price.",
      "rating": 3.0,
      "verified": true,
      "author": "R Proctor",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Good for my dog",
      "text": "Ordered this same dog tag with a different seller. It was like $18 with the other seller and it was prime but when my dog lost it I couldn't find a reason to spent another $18 on a new one. She's wearing a $8 dollar dog tag that is the same exact replicate. Very nice would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Albertha",
      "helpful_votes": 5,
      "publication_date": 20171020
    },
    {
      "title": "Top quality and super cute!!!",
      "text": "I decided it was time to look for a new tag with a silencer because my dog gets up in the middle of the night and wonders around. I couldn’t be happier with the tag I ordered. The weight is not too heavy, buy still very sturdy. The silencer really works at eliminating all sound and even glows in the dark. The font comes engraved and is a good readable size. I love the glitter paw on the front. It has that extra touch of cuteness. The tag also came a few days early which was a major bonus. Great company!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cris Jackson",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Every pet owner should seriously consider this product!",
      "text": "This tag is so great! Extremely well made of durable material and I absolutely love the tag silencer as it glows in the dark so the fur baby can always be seen! From now on, all of our four legged family members will have these tags. I purchased the name tag as well as the microchip tag. One of my best purchases! Thank you for your excellent customer service and for such a great product. You even delivered before the promised date. Can't get any better than this!",
      "rating": 5.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "The tag silencer cover broke off",
      "text": "I bought this with the cover it came with, and about two days the cover broke off, the cover isn't that sturdy or durable at all, but the tag itself is pretty good, it fairly easy to read what's on there and is built well. So if you are planning on buying this, there is no need to get the Tag Silencer cover it comes with, just get the tag, and that will be more than enough. I would give this a 4.5 out of 5 as a rating due to the cover being so easy to be broken off.",
      "rating": 4.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Durable!",
      "text": "We bought these for all of our dogs after one of them got out and the neighbor who found him could not read his tag. These are SOOO much better than the ones from chain pet stores. The engraving does not rub away or chip off. And they easily wash off, so months later, I can still read it perfectly. They also arrived quickly and all the engravings were accurate (despite our dogs silly names). Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Angie H",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "I love it, especially the cute dog paw on the other side!",
      "text": "Our family just added a new Pom Pom Bichon to the family! He is adorable and we love him so much....He will be getting the ID Chip put into him this May, but we also wanted him to have an ID on him too....When I read the good reviews, I decided to get one, it arrived within 3-4 days....and when I saw it...I loved it! I bought the bigger one and it seems to be a good size. I love the paw print on the one side. It seems to be good so far after a month having it....I would recommend getting one of these!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa the shopper",
      "helpful_votes": 5,
      "publication_date": 20160322
    },
    {
      "title": "Only the best when it comes to your dog ID",
      "text": "Our new Lab pup chewed her Rabies tag into being totally illegible! Armed with the knowledge of her destructive abilities, we ordered one of these each for our two dogs. Happy when they arrived! Nice thick bullet-proof metal! The old Pet store “machine tag” that we replaced for our older dog wasn’t as thick as these. Good product! Also, make sure you get your dog embedded chip-identification at the Vet.",
      "rating": 5.0,
      "verified": true,
      "author": "kewalo surfer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great purchase! Very pleased.",
      "text": "It's the second time I order these tags for my three small size dogs( shihtzu) The previous ones are still ok because the engraving is deep enough for the writing to last. I don't live in the USA and I can't find this type of tags at home, so I order them when I travel and have them delivered to a friend's address. At first I was worried that there would be mistakes because the info is in Spanish but everything is perfect! Since my dogs and tags are small and contain a lot of information, the writing is also small but readable. I'm happy with this purchase and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20190810
    },
    {
      "title": "Jewelry For My Pups",
      "text": "Bought several of these tags for my first fur baby for all of her collars and harnesses. Just bought the first one for fur baby number 2 and I’m sure as she gets bigger we will be purchasing more for all her gear as well. We get so many compliments everywhere we go as these tags truly look like a piece jewelry. Well made and just the right size. Totally recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie M",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Have already reordered!",
      "text": "My cat's collar came off, with her Paw Print Pet Tag on it, we could not find it. I ordered another because these are easy to see, easy to read, durable, and cute. They don't scratch up easily either. We found the collar eventually, but I now have a tag on both collars so that she's always got one on. I'll be reordering another for my dog's collar so he has one on each also. These are the best tags I've ever bought. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "The quality is very nice otherwise. Bought this to protect the finish and ...",
      "text": "Bought this for a new puppy we're getting. Haven't put it on him yet so I can't talk to the laser(?) engraving durability. The quality is very nice otherwise. Bought this to protect the finish and engraving.",
      "rating": 5.0,
      "verified": true,
      "author": "Titan",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "GoTags Paw Print Round Stainless Steel Pet Tag",
      "text": "This is the second GoTags Paw Print Round Stainless Steel Pet Tag purchased. The first one was for my Lab which Passed Away from Cancer in 12/2019. I received this one for a new Lab Puppy we will get next month. The quality if exactly as the first Tag and the workmanship is exactly. If you want a Tag to last order from GoTags you will not be disapont.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Bickers",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "I give this GO TAGS ID five stars!!!",
      "text": "WE LOVE THIS TAG for our little Chihuahua dog, at first we thought it might be too big, from the photograph shown for her size, but it's perfect, just a little smaller than her license tag. I had bought her a pretty little pink heart before at the pet store and she some how chewed the engraving off because it was a cheaper surface, this is beautiful and quality stainless steel. looks like it should last her lifetime! I would highly recommend this product and the company. , it was delivered right away, in the regular USPS mail. and looks great on my little pampered pooch! Thank you GO TAGS!!!! From one satisfied customer :)",
      "rating": 5.0,
      "verified": true,
      "author": "S Ames",
      "helpful_votes": 2,
      "publication_date": 20151212
    },
    {
      "title": "Great Dog Tag!",
      "text": "This tag is bright, easy to read, easy to put on a dog collar, and should be durable because it's stainless steal, not aluminum. It seems to make more clinking sounds than previous tags, because it's slightly heavier, but it has also warned me of the seizures my older dog has started having, so I'm thankful to have it on her. Very cute and very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Galigraphics",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Readable text and tag protector factory installed",
      "text": "The tag is so cute and my little Poochie Baby looks so stylish! I really like the \"bling\" on her collar as well. I was concerned that the tag protector might be difficult to attach to the tag and clip or that it might fall apart, but it is sturdy and readable. I did forgo the included ring for something more substantial. I'm very happy with the purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "sleepingmoon",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Ok",
      "text": "I bought 2 for my beagles. They are nice but much bigger than I wanted/expected. Engraving is good. The guard to go around the dog tag glows in the dark. However, it comes off and after stretching it around the dog tag several times it tore for one of my dog's. The attachment piece you use to connect to the dog collar is not very strong and if you happen to accidentally clasp the dog leash onto it, it'll break the dog tag connector. Obviously they're not made for that intent BUT I had to take a better quality clasp from old collars and they wouldn't have broken.",
      "rating": 3.0,
      "verified": true,
      "author": "Doctor AVB",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Good pet tag, but Silencer doesn't work",
      "text": "This is a good pet tag. It is easy to read. I'm giving 3 stars because of the plastic silencer that goes around the tags. The tags slip out of the silencers. I bought two tags and silencers. Both are attached to the dog collars using the O-rings. The silencers, however, slip off the tags on both dog collars. (Basically, the pet tag comes out of the plastic silencer piece.)",
      "rating": 3.0,
      "verified": true,
      "author": "K. B.",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great quality and an excellent price!",
      "text": "not only was the Paw Print Round Stainless Steel Pet ID tag exactly as described, it was even better in person. the quality is top notch and i doubt i will need to replace it unless it gets lost. the verbiage i requested was exactly as i asked and the shipping was really quick! i would highly recommend both the tag and the seller to my friends, family, or anyone who needs a good quality pet tag.",
      "rating": 5.0,
      "verified": true,
      "author": "QueenKong",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Really nice dog tag.  Sturdy, but not too heavy.",
      "text": "This is the second time I have ordered these tags. The first was for my little Yorkie. I needed a tag that was small and lightweight yet could hold all of the information I wanted to include. This is perfect. The right size, clear printing, I was delighted. When my daughter adopted brother and sister pups, I did not hesitate to order two more for them. They are just as perfect as mine. She was delighted too!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "engraving is shallow",
      "text": "At first I was impressed with how fast I recieved my tag, I got it at least a week before it was suppose to arrive. However, the engraving is not very deep and it took me a little bit to see it was actually engraved and not just printed on. I'm a little worried it won't take long before it's too worn to read. Other than that it's very light and looks great.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Oops!",
      "text": "My Paw Print dog tag came today, and I was thrilled with the appearance...until I read the address. The house number was one digit off, sadly. I can't prove whether it was my mistake or the printer, but at least the phone number, street and city are correct so I think there is a 99% chance if my Margie puppy ever runs off she could be returned. But I was disappointed. I hope the one that I sent a friend as a gift will be accurate. It is quite attractive at least.",
      "rating": 4.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Recommended 10/10",
      "text": "Love this name tag! Engraving looks just like the photo in the listing. The purple glitter paw is beautiful! The color is so vibrant and sparkly. My large 3 month old puppy plays hard and it has held up so far. I like how it was shipped- minimal packaging. It came in a thick, square envelope. Definitely will buy more!!! Recommend 100%",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Stays in great shape and easy to clean!",
      "text": "My 11 week old German Shepherd puppy got the red tag and it's really easy to see the name and shiny red paw when she walks to us. she's still a little unsure of the sound, so i should have gotten her the silencer. It's only one extra dollar to order the silencer, but if you don't order it with the tag you can't buy it alone which is a bummer. Besides that, i love it and will buy it again! With the silencer :).",
      "rating": 5.0,
      "verified": true,
      "author": "ramona wood",
      "helpful_votes": 0,
      "publication_date": 20200724
    },
    {
      "title": "A SOLID CHOICE...",
      "text": "... much better than the run-of-the-mill tags the local shops crank out in 5 minutes! It's sturdy without being inordinately large, and our 3.5lb pup immediately took it in stride! He likes it 'cause it doesn't clank against his food dish; we like it 'cause all the text is on one side, against his chest, protected from abuse; and several neighbors have commented on its uniqueness. Overall, two thumbs - or paws! - up!",
      "rating": 5.0,
      "verified": true,
      "author": "Joey",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "The tag is great but the customer service was even better.",
      "text": "I love this tag for my puppy. We needed another tag for her so we could have our address on her collar. We will see how it holds up over time as she is teething and tends to chew her rags- we’ee Trying to train her not to. I will say the first time through I received the envelope from the seller but no tag. It must have somehow fallen out in the mail. I think part of the envelope got ripped. I got in touch with the seller via and they sent me another. Now Little Bear has all her tags on her collar and we couldn’t be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Pet tag",
      "text": "This name tag is so cute! It is durable, light weight, so easy to read and the paw is shiny. What more can ya ask for. I bought a pink one for my older puppy and loved it so much I got a eight week puppy and got this purple one for her. If your looking for a great name tag for your new pet dog or cat I recommend this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Zens",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "SHIPPING TAKES ****WEEKS!!**** Beware!!!",
      "text": "Tag is nice but shipping takes FOREVER! This is the second one I’ve ordered (got a new kitty) and it’s late too. The first one got “lost in the mail” so they resent; all in all it took almost a full month from time of payment to receive. I’m now at a week again and also past the shipment due date. I’m guessing it’s going to be another day three weeks to receive like last time. Won’t order again. Don’t give an estimate on delivery knowing you can’t fulfill!!",
      "rating": 2.0,
      "verified": true,
      "author": "BoostedMommy",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "All dogs should have these.",
      "text": "Very happy with this purchase. I think I bought 4 of these. My dogs don’t wear collars in the house/yard, I placed name tags with our address, 2 phone numbers, Dog’s name and other info on collar along with rabies tag, Trupanion ID, attached collar to leash and hung by the door. They are ready to go in 5 seconds instead of searching everywhere for their things.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "Well made, easy to read. Very pretty",
      "text": "I absolutely love this tag. I had bought two before from different company's. This one bar far, is the best. The letters are bold and clear, very easy to see my dogs name and my number if she ever gets loose. Very durable and sturdy. Simply put, wonderful. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 2,
      "publication_date": 20180214
    },
    {
      "title": "I like the idea ...",
      "text": "I like the glow-in-the-dark silencer idea, but it keeps slipping off the metal tag. It's a bit annoying to have to fix all the time. The tag itself and the engraving is good quality (though some of the engraving is covered by the silencer), no issues with rust or scratching. Overall it's a good product and I don't regret my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Very nice product and I've been pleased.",
      "text": "Really well made and I've been pleased. I've actually ordered two, because on the first I got carried away with filling in all the available characters and this made it too small to easily read if trying to hold onto an active lost dog. On the second one, I just stuck with the minimum info on the two central lines of text for the largest size of letters. The silencer really does work and only came loose a little bit once and was easily put back in place.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "I really like them",
      "text": "I bought two of these, one for each dog, and I think they're really well made and look great. Have you ever tried to get something off those little ring clips? This seems sturdy to me.. I doubt I will replace them. The names came out great and the little paws are awesome. I would get again. If I dont have an update here then its still going well!",
      "rating": 5.0,
      "verified": true,
      "author": "Higrpwd",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Fast, easy, good pricing, and durable",
      "text": "These are the most adorable and best fitting name tags for the price ive found anywhere. Ive looked locally and you can't even find these at local pet stores. I looked for this shape and you cannot find them engraved anywhere for this price. I highly recommend these. And they don't take long to make at all!",
      "rating": 5.0,
      "verified": true,
      "author": "Meli G",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "These tags are perfect",
      "text": "Not only are these tags the perfect size for my animal companions, they are easy to read, have complete contact information (they are microchipped) which makes my occasional escape artists easier to find. Some may not take animals to have chips checked, but they will read the tags. I am grateful for these and they are very attractive, too. A small but pleasing point.",
      "rating": 5.0,
      "verified": true,
      "author": "Sumers101",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "The quality is not up to par!",
      "text": "This tag has been a disappointment because it looks like it's made with a higher quality of metal but it's not. Its weight is probably that of a dime and the rubber that goes around the tag is always falling off so it looks tacky. I will not order from here again. I'm all about quality and this one skips a beat or two!",
      "rating": 3.0,
      "verified": true,
      "author": "K.d.Snow",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "So Pretty!!!",
      "text": "I purchased this tag for my pretty kitty Hopey. I thought I ordered the purple, however, when it arrived it was blue. I contacted the company and they immediately sent me the purple replacement with no charge and did not ask for the blue one to be returned. (This was apparently my mistake.) Any company that is willing to do that is A-OK in my book. I am very pleased with the product. The paw print just sparkles in the light and it is so sturdy. Hopey walks around so proudly displaying her new bling! I will definitely order more tags for my pets from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Kiefer",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "It came apart",
      "text": "Within 2 days, the plastic around the name came off and the ring bent out of shape and I found it laying on the floor. It's made cheap. It looks great, but what good is it, if my dog keeps losing it?",
      "rating": 1.0,
      "verified": true,
      "author": "good grief!",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Arrived Before Expected! Quality Work",
      "text": "The produce was nicely done, very pretty tags. My feedback more relates to the seller. They were quick with the order, accurate, and they have a really nice envelope that they sent the tags in. They apparently have put in some extra effort to make their products look good. Appreciate that!",
      "rating": 5.0,
      "verified": true,
      "author": "RSH",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Skip the Tag Silencer",
      "text": "The tag silencer only lasted about a week before it tore and started to come off. So skip that add-on. Otherwise it's a very nice product and good quality. I have a smaller cocker spaniel though, and the 1 1/4\" diameter tag that I ordered is also a little too big - note she's only 17 lbs so a medium size dog may do fine with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Flyerette",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Ordered a Pair of Small Paw Tags",
      "text": "We ordered a pair of the paw print tags in size small for our little kitties. The information on the back of the tags is legible and accurate and the tags themselves are quality. They are quite shiny and polished and it took the kitties awhile before they would leave the tags alone, but the tags themselves are great. The kitties in the photos are about eight months old - the black cat is average cat-sized, and the tuxedo kitty is a little smaller than average.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Rubble",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Amazing Quality Control, Durable, and Glows Bright!",
      "text": "Loved this tag and the company is super observant because in my request, I had a typo and they caught it and asked before production. Very impressed. The glow part slides off quite a bit but we have a beagle who is full of energy. The glow part is super bright and 5 minutes for an outside bathroom break and it is supercharged. Works very well and very durable!",
      "rating": 5.0,
      "verified": true,
      "author": "SacredMoonfire",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Well made tag",
      "text": "We only just received this tag. It looks well made, the lettering seems deep enough to survive use but I don't have much experience with it yet. It looks great, is small and light enough to work very well with our 50# dog. Other tags have irritated her skin but this is small enough to not be a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "brad  Lewis",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "CUTE little tag!!!",
      "text": "Great, easy to read tag purchased for my 4 pound pup! Great costumer service. My pup has a Hawaiian name so when I submitted his name they contacted me immediately to inform me that they couldn't prink Hōkū to asked if they could replace it with Hoku. Happy that they took the time to ask before printing. I agreed. Shipped quickly!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbea G",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "I love them and it is not some flimsy metal for ...",
      "text": "I ordered one for each of my dogs. I love them and it is not some flimsy metal for the price point. It would have cost me double at Petsmart and not as cute. If you are looking for a nice dog tag I would recommend these!!! (everything was spaced nicely and spelled correctly too)",
      "rating": 5.0,
      "verified": true,
      "author": "alittlesexy6",
      "helpful_votes": 3,
      "publication_date": 20170422
    },
    {
      "title": "Super Tags: Functional AND Attractive",
      "text": "These tags are awesome. I had ordered tags from another vendor and they felt flimsy and very very small. These are substantial in size and weight without being overbearing and are beautifully engraved. I am so much happier with these than the other ones that I ordered as I feel like they will last. I did order other clasps that allow me to change them quickly from one collar to another and I am happy I did that.",
      "rating": 5.0,
      "verified": true,
      "author": "FrequentFlyer",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Very cute",
      "text": "I love these. They are just as pictured. I ordered three of the larger size with the silencer. The larger size is a bit big on my 30lb dog but I was able to get both my number and my husbands in the engraving. The font is easy to read and the tags stand out. The silencer comes in handy at night if I get out of bed. I see the dogs glow and don't step on them. Lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "It’s what I expected",
      "text": "It shows the name and your dog the cellphone numbers of my mom and I and a great way to get your dog back to you I have both on the tag just in case my puppy ever got lost, I would have peace of mind that some would be nice enough to give him back to me. He’s a angel from god.",
      "rating": 5.0,
      "verified": true,
      "author": "Lady Bon",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "The perfect tag",
      "text": "I thought I had already reviewed these tags, but this is long overdue. Awesome quality and fast shipping. I’ve ordered a few of these now and the size is perfect, the text is legible and clear, and the paw design looks great. If you’re considering any other tags, you’re probably spending more money for a lower-quality product. This is my go-to tag for all our pets and I couldn’t be more satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "KR Nick",
      "helpful_votes": 0,
      "publication_date": 20180928
    },
    {
      "title": "Good Looking",
      "text": "This is a small size tag, so it is great for small dogs. The writing is small, so it can be difficult for some people to read, and it is NOT engraved, so the letters will eventually wear away. The tag looks great, however, and it suits our needs for our little Havanese.",
      "rating": 4.0,
      "verified": true,
      "author": "K. M. Stark",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Cute paw print design",
      "text": "Arrived early and the blue paw print is very pretty and shiny. The engraving is kind of dark and a little hard to read if you use up all the allotted letters (which I did). It’s nice and small and doesn’t bother my cat at all. I feel safer knowing that if he gets lost, it will be easy to contact us when found.",
      "rating": 4.0,
      "verified": true,
      "author": "HappyMom23",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "BEAUTIFUL! Very nice quality and great customer service! PERFECT!",
      "text": "This tag is really nice. It's easy to read for someone like me who needs reading glasses. You don't need glasses to read this tag. The text is bold and it really stands out. I was surprised by the great quality as well. We love the paw print and the glow in the dark silencer as well. Thank you so much. I give this my absolute highest recommendation!",
      "rating": 5.0,
      "verified": true,
      "author": "Audioforge",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Nice quality, and look to it.",
      "text": "I just received my pet tag, and I'm happy with the purchase. It seems to be of good quality, and looks really nice. I wanted a blank tag, but the options don't let you add it to the cart unless you type something in one of the lines. Thankfully, they did send me a blank one, along with a second one that had \"leave blank\" engraved lol. I'd recommend this product if you're looking for a cute tag for your pet or a key chain.",
      "rating": 5.0,
      "verified": true,
      "author": "Spork420",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Smaller but nice",
      "text": "Tag was a little smaller than I anticipated but is still clear to read and looks good. Only docked one star as the hole to attach to the ring is very small. Did not fit the thicker ring I have my dogs' tags on. It does come with a ring that fits however it is thinner and I'm not sure how sturdy it is.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "One Great Tag",
      "text": "Saw, ordered and am impressed. Well Made, print is super, smooth, no jagged edges, all of the desired information was there as ordered. This will not be my only purchase, any friend or family member will receive one as a gift for their pet, I like it and it is a great gift.",
      "rating": 5.0,
      "verified": true,
      "author": "TL, Gig Harbor",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Great tag",
      "text": "I ordered the smallest size for my 9lbs Maltese. He doesn't wear collars only harnesses, but I put a collar with a tag on him when traveling. Since he is not used on something dangling on his neck I wanted a tag that is thin, lightweight, and discrete. This tag is all of that. And a great price! Can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Perkonx",
      "helpful_votes": 0,
      "publication_date": 20190424
    },
    {
      "title": "Great tag",
      "text": "I have moved three times in the last couple of years and have ordered this same tag again and again for my dogs. Easy to read, they get lots of information on the tag, even the small tags, so I feel comfortable my dogs if found will be brought safely home.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill R",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Adorable!",
      "text": "Love these!! I took a picture of the two sizes side by side a quarter so others could compare the sizes more easily. The silencer that comes with the large one really does work! I didn't really think it would but it's amazing how much clinking it takes away. I only wish the small one came with one too",
      "rating": 5.0,
      "verified": true,
      "author": "Cait",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "Excellent quality. Exactly what I ordered.",
      "text": "This tag is the perfect size for my large dog. I was able to fit his name, and my address and phone number on it. The quality of the tag and the ring are very good. The tag also has a nice weight. It doesn’t bend and does not feel cheap. I ordered the tag without the silencer. I like how it jingles just a little bite (not too much) so I know where my dog is. I also love the paw print on the back of it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Allison",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great quality, fast shipping!",
      "text": "I’m so happy with this product! My tag arrived 2 days early and is so cute. The engraving is clear and easy to read, it’s filled in black so it’s very easy to see. The silencer does exactly what it’s suppose to! My only wish is that it came with a jump ring as the hole on the tag is too small to attach to our tag clip as is. We found a spare so no biggie but good to know it doesn’t have one. So far we are very happy with our purchase, would definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Glsdoesgels",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Very happy with the result!",
      "text": "Tag came in earlier than expected. Have only had it for a few days but first impressions are very good. Seems a lot more durable than inscribed tags at a chain pet store. Attached to the collar very easily and very easy to read. Did not purchase the rubber outer ring but it doesn't seem to make much noise when our pup is walking around. Probably could have gone with the small for our specific little guy but the regular is not overbearingly big on him. Overall, very happy so far.",
      "rating": 5.0,
      "verified": true,
      "author": "DPierce",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "SMALL TAGS ARE TINY",
      "text": "I like the quality of the tag and the printing on it, but the small tag is way to little. My dog is 15 lbs so the small tag is miniscule on him and gets lost in his fur, it is best for dogs 10 lbs and under. There are only 2 sizes offered so I thought the larger tag would be too big. I suggest that the company offer another size and give a better description of the small tag so that people with dogs that are small, but more than 10 lbs don't make the mistake of ordering it.",
      "rating": 3.0,
      "verified": true,
      "author": "Agent007",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Fine jewelry for your dog!",
      "text": "We bought two different tags (for two different collars) for our puppy on Amazon and both are amazing and well worth the money. This one, though, is my favorite. The tag itself is heavy and well-polished, about as thick as a quarter, and the engraving is of fine jewelry quality. I ordered this (and the other tag, which I also have reviewed) on Thanksgiving Day and received it on Monday. This is certainly well worth your consideration, and if your experience is like mine, you won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Borchers",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Small, Yet Solid",
      "text": "The size is small, which is good for not getting in your dog's way when wearing it. The print or engraving is also of high quality and does not fade. I've bought 3 of these tags already for multiple dogs and I would not hesitate in buying more, as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Excellent quality",
      "text": "Received within six days of ordering (fast!). Tag is a good size, with nice detail and color. Lettering is clear. Much better quality than what I could have made at the pet store. Great product and will not hesitate to order again from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "Trail Runner",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Sparkles and clarity and silencers, oh my!",
      "text": "Great product! Clear lettering, beautiful ✨ sparkles, quick delivery. No complaints at all. Love the option of adding the tag silencer- so worth it. I think the dogs love not having to hear their tags banging against food and water bowls as much as we do!!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Collins",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Sturdy, Quick Shipping, and Good-Looking",
      "text": "These are by far the best pet tags I’ve ever purchased. I went through several different types of printed and engraved tags before giving these a try. (Hey, my pittie pup plays hard!) I am still on that first tag and it has lasted longer than all of the others combined. I’ve purchased three of them in the last year (two large tags for dogs and one small tag for a cat) and they have all arrived ahead of the estimated delivery date and can still be read without issue. They’re also pretty dang cute.",
      "rating": 5.0,
      "verified": true,
      "author": "Mal",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Beautiful Tag",
      "text": "Nicest looking dog tag ever. Too early to tell on durability (for the price, I ordered two anyways). This tag is like a nice piece of jewelery for my pup. ***Also got the silencer which helps immensely. Just wish the silencer came in other colors as I’m not fond of the white/glow in dark.",
      "rating": 5.0,
      "verified": true,
      "author": "caribella",
      "helpful_votes": 2,
      "publication_date": 20171231
    },
    {
      "title": "Looks great",
      "text": "The only reason not a 5 star is because the flimsy metal ring this comes on to attach it to the collar was a little too big and when it got caught on something my dog tore it right off bending that little metal ring. I put a new ring on it, which was a little smaller and now it looks and works great.",
      "rating": 4.0,
      "verified": true,
      "author": "M Hicken",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Highly recommend for your fur baby",
      "text": "These are so nice. The lettering is clear and a good size to read. The stainless steel silver is shiny and the paw print is very nice sparkly color. I ordered a red one and a blue one. I highly recommend these. The guality is great and so is the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Essential For Your Pet",
      "text": "I love these name tags! I bought two of the silver ones for my cats and I included their names and my phone number, in case they ever get out of the house. The tags are very easy to read, durable, and sturdy. They are a little bigger than I thought they would be but, they're actually the perfect size! I ordered the Regular size with the Tag Silencer so they won't make any noise. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Kay Corona",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Great Little Tag",
      "text": "This is a great tag. It's decorative, easy to read, and seems to be solid quality. My only concern is that the hole is a bit narrow. It's fine for the ring that they supply, but if you want to use it with something other than the supplied ring, it might not fit.",
      "rating": 5.0,
      "verified": true,
      "author": "John Canales",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Not Engraved as Advertised",
      "text": "The tag itself is nice and appears of good quality. It says that the lettering in engraved, but it is not. It is printed on top. I anticipate it will rub off in due time. The letters were also printed very close, so it is hard to read. Not a long name either Fuzzy.",
      "rating": 2.0,
      "verified": true,
      "author": "krisera",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Awesome, would certainly purchase from this seller again!",
      "text": "The seller has great communication and was extremely responsive to a question I had and corrected the issue immediately with courtesy. Great quality and I like the reflective ring for not only reducing the clanging against their rabies tags but also locating them easily in the yard at night since our pups are black and the bands glow in the dark. Awesome, would certainly purchase from this seller again!",
      "rating": 5.0,
      "verified": true,
      "author": "icronin",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Great product!",
      "text": "Great personalized product and a great price! Easy to read our phone numbers should our dog wander off. My daughter adores that her GS puppy has a glittery purple paw print to easily identify her as being a girl dog. Cute and practical!",
      "rating": 5.0,
      "verified": true,
      "author": "Nasel_7",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Love it❤",
      "text": "Alright so I will eventually update this for durability. (She managed to break the last tag I bought her off). But I have a year old huskey and this tag is a nice size to be seen for her and I love the colored paw print. I didnt get the original one, but the customer service is top notch and I did end up recieving the second one that was sent. The envelope it comes in is adorable and the engraving is nice and dark.",
      "rating": 5.0,
      "verified": true,
      "author": "Shy Girl",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Rings like a bell",
      "text": "Overall this looks really nice and the price is great. But the way it rattles on my dog's collar (not when he's necessarily shaking) as he walks around is loud. The silencer is a solution but they get dirty easily. Note that my dog has fur, not hair. The other name tags I've had in the past are slightly thicker and heavier and thus don't ring like a bell.",
      "rating": 3.0,
      "verified": true,
      "author": "Gobears81",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Cute ....",
      "text": "Not as thick as shown in the photo but strong (it won't bend). The engraving is nicely done but imo the tags are a bit pricey for their size. Also, it would be nice to see these in a satin finish so they won't show fingerprints. Other than that, the tags are cute. Love the engraved paw print. Thanks!",
      "rating": 4.0,
      "verified": true,
      "author": "MCSlady3",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "Great name tags!",
      "text": "Very nice name tag. Very readable and silent. Plus it glows in the dark. We no longer step on our 5 and 12 year-old Golden Retrievers on the way to the bathroom at night. They glow! When their names rubbed off their collars we decided to add these for safety. Works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Lover",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Good tag-holds up well",
      "text": "I have this tag for my cat as well as my 4lb dachshund. It has held up great and the words have not worn off at all. My husband did hook the dog’s leash to the ring that came with it and when she yanked suddenly, the ring came apart. But that isn’t the fault of the tag. Just make sure you hook the leash to the color tab.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Cute, and sturdy",
      "text": "Perhaps thinner than I imagined, these are nonetheless quite sturdy, long lasting, and correctly engraved. I only wish companies still did the type of engraving that penetrates the tag surface - AND that tags of this size could still be used for SIX lines of text; I've got identical tags purchased a decade ago with those specifications. Still, these are very functional, practical, and cute - and if they help my dogs get home, perfect!",
      "rating": 4.0,
      "verified": true,
      "author": "mamafirebird",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Awesome tag from great seller",
      "text": "This is a wonderful tag and I really wasn't expecting that because of such a cheap price. The seller was very quick responding to the emails I sent and received it before I was told I would. I have to say, this tag is an awesome tag and especially for the price and I recommend this tag to anyone wanting to get one especially with the excellent work and I have to thank the seller for the awesome product at very cheap price and was exactly what is in details, so grateful to seller and I will be ordering more in future from this seller!",
      "rating": 5.0,
      "verified": true,
      "author": "SOS1880",
      "helpful_votes": 0,
      "publication_date": 20160830
    },
    {
      "title": "Very Pretty and Easy to Read",
      "text": "This is a very nice dog tag. It's shiny with a pretty, sparkle paw imprint. My dog's name and our contact information is in a bold, black font that's easy to read. I'm glad I purchased this. It also looks very cute on my dog's collar.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Worth the money!",
      "text": "I think they are nice for the price. I love how thick they are and the glittery paw print is sooo upscale looking. I bought 3 so we will see how they hold up over time. The silencers are a complete waste however. They do not stay on tag and I ended up having to discard the silencer.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191125
    },
    {
      "title": "Fantastic ID Tag. Very Well Made!",
      "text": "Took and extra 2 days to arrive to me but I really like the ID Tag, and silencer. It’s really made well and has a special covering over the glitter so it doesn’t shed or fade. I would order again, just know that delivery takes a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Raja Magic",
      "helpful_votes": 0,
      "publication_date": 20200730
    }
  ],
  "product_meta": {
    "title": "GoTags Paw Print Round Stainless Steel Pet Tag for Dogs and Cats, Personalized with 4 Lines of Custom Engraved ID, in Solid Stainless Steel and 5 Enameled Colors: Blue, Green, Pink, Purple and Red",
    "rating": 4.8,
    "feature_bullets": [
      "Stylish and durable, this stainless steel pet ID tag features a cute embossed paw print design in a polished mirror finish surface. Your dog or cat's sparkling character calls for a unique pet tag. To see all our pet ID products, click on our brand name GOTAGS above the product listing title.",
      "Available in 2 sizes: Small (approx. 1 x 0.9 inches) and Regular (approx. 1.4 x 1.2 inches).",
      "Available in solid stainless steel and stainless steel with glitter enamel filled paw in one of 5 sparkling colors: Blue, Green, Pink, Purple and Red.",
      "When selecting Regular with Tag Silencer the tag comes with a glow in the dark tag silencer that helps eliminate noise and protects the finish and engraving, extending the life of the tag.",
      "All tags are laser engraved with up to 4 lines of personalized text. Extremely durable, easy to read and permanent. To order select your color and size from the above choices and click CUSTOMIZE NOW to add your personalization details."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "1.97 x 1.97 x 1.97 inches; 1 Pounds",
      "Item model number": "B00BK307HW",
      "Date First Available": "February 23, 2013",
      "Manufacturer": "GoTags",
      "ASIN": "B00BK307HW",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "ID Tags & Collar Accessories",
      "Dogs",
      "Pet Supplies",
      "ID Tags",
      "Collars, Harnesses & Leashes"
    ],
    "price": 8.95
  }
}