{
  "website_summaries": [
    {
      "verdict": "Satisfyingly comfy on day one—this is what climbers will likely say the moment they slip into the Rogue VCS. That said, the shoe has more to give beyond comfort. Yes, it is a gear that has a lot to offer when it comes to grip and crack climbing performance. This beginner-friendly 5.10 piece, however, comes with a few flaws, the most unflattering of which has to be its bleeding upper. Nonetheless, the Five Ten Rogue VCS has enough positives to be considered a worthwhile investment",
      "pros": [
        "The Five Ten Rogue VCS climbing shoe is incredibly comfortable, according to quite a number of reviewers",
        "Many of those who have climbed in this Five Ten rock shoe say that it sticks like a champ on a variety of surfaces",
        "Based on several reports, the Rogue VCS is a highly recommendable climbing shoe for beginners",
        "It deals with cracks remarkably well, some of those who have purchased it say",
        "A few users are impressed with the Rogue VCS’ quick break-in period",
        "This is a super-sensitive piece of footwear, says a tester who has sent projects in it multiple times"
      ],
      "cons": [
        "According to numerous sources, the upper of this rock climbing shoe bleeds",
        "Its heel-hooking ability is not very convincing, a couple of customers claim",
        "An expert is not happy with the tongue of the Five Ten Rogue VCS (men’s and women’s)",
        "He said it has a habit of sliding around and bunching"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 8.6,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fit is tight, but that should be expected",
      "text": "I normally wear an 11-11.5 in \"casual\" shoes and per the recommendation of a few other reviews I ordered a 12. The first time I wore them I was a bit worried because they were very tight on my toes, but after climbing in them a couple of times they have stretched a bit to conform to my feet and fit very well. Appears to be made of high-quality materials. I have only worn them a handful of times, but each time I wore them for several hours and haven't had any issues with the material turning my skin blue like some others have mentioned. Perhaps this is something that comes with more time/exposure.",
      "rating": 5.0,
      "verified": true,
      "author": "Artur S.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Runs small but performs well.",
      "text": "My foot is a 9 wide, so in regular shoes I tend to wear size 10 sneakers. I ordered several pairs of Five Ten shoes, and they seem to fit on the small side. I ended up having to go with a size 11. That being said, once you find the right size, these work incredibly well. I'm very happy with them. I'd say you might want to size upto get the right fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Leif Jacobson",
      "helpful_votes": 4,
      "publication_date": 20190805
    },
    {
      "title": "Vendor is selling poor quality products",
      "text": "The shoes themselves would probably be fine, but whoever the vendor is sold a total dud. These were apparently “brand new” and the left foot seams are already falling apart. This is completely unsafe.",
      "rating": 1.0,
      "verified": true,
      "author": "Julia Liu",
      "helpful_votes": 3,
      "publication_date": 20190902
    },
    {
      "title": "I purchased the size USA 8. 5 / Euro ...",
      "text": "I purchased the size USA 8.5 / Euro 41.5 and they fit perfectly. I typically wear a running shoe size USA 8.5 or 9.0.",
      "rating": 5.0,
      "verified": true,
      "author": "Freeflying1",
      "helpful_votes": 5,
      "publication_date": 20180105
    },
    {
      "title": "Good Gym shoe",
      "text": "I mostly boulder and only in the gym, the shoe fits great, hasn't turned my foot to blue yet. solid shoe from a beginners point of view. I'm working v3's and 5.11's and have not had any issues with these shoes. break in was a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Dust4star",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Great shoes for the price",
      "text": "Wear a 10 in street shoes got these in a 9. Pretty tight at first but feeling a lot better after 3 climbs. Still kind of tight in the toes but not unbearable. If you don’t mind sacrificing comfort for performance a size down is doable. If you like a more relaxed fit I’d say get the same size as your street shoes. Overall these are pretty legit shoes for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Badeaux",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "order at half to full size smaller",
      "text": "i am new to climbing, but these shoes do give me a lot of confidence. After a few sessions, i noticed that these shoes stretched a bit (i guess the break-in period). i'm personally not bothered by my feet turning blue because i wear socks when climbing. all around, i think this is a good beginner shoe.",
      "rating": 4.0,
      "verified": true,
      "author": "Damien L.",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "5 and they fit absolutely perfect. New climber and I really love the way ...",
      "text": "I usually wear a size 12.5 or 13 shoe, ordered these in 12.5 and they fit absolutely perfect. New climber and I really love the way these feel on small holds and just the overall stickyness",
      "rating": 5.0,
      "verified": true,
      "author": "travers woodward",
      "helpful_votes": 3,
      "publication_date": 20180420
    },
    {
      "title": "Love these shoes",
      "text": "Love these shoes, they are super comfortable and have finally broken in for me. Fit was perfect, and as advertised!",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur Liao",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Run large for 5.10",
      "text": "Bought two sizes smaller than my normal shoes and it feels like im swimming in the climbing shoe. I've had many pairs of 5.10 shoes and size 12 always fit prefect after broken in. These shoes feel to big to begin with.",
      "rating": 2.0,
      "verified": true,
      "author": "Khyl",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Satisfied",
      "text": "I love my new climbing shoes! They do exactly the job I need them for. I highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Devon Roberts",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Good shoes at food price",
      "text": "First time buying climbing shoes. I bought a half size larger than my normal US shoe size and they fit great. I got the blue ones and color did not rub off on my feet as has happened to some other reviewers.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Great beginner shoes",
      "text": "Great beginner shoes. Fit really tight at first but after 3 months of climbing avidly they stretched a full size and are little loose around the toes. Highly recommend these shoes.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "So far so good",
      "text": "Good comfortable snug fit. I ordered my shoe size for this particular brand after reading other reviews. Should stretch out. Will updatein tune",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Great rock climbing shoes!",
      "text": "These shoes fit exactly as they should. They are comfortable and great to climb in.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolynn Tatum",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Great value",
      "text": "I wear street shoe 12 and ordered 12.5 and they fit well, pretty snug but will go a half size smaller next time. Not pro shoes but great intro level, hence the price 👌🏼",
      "rating": 5.0,
      "verified": true,
      "author": "John Brothers",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Nice shoe",
      "text": "5.10 rubber is unmatched. I've tried other brands and nothing feels as sticky. I bought these because 5.10 stopped making the intro coyote shoe. I've been climbing for 3 years pretty often. This shoe has allowed me to be more technical on smaller rocks. I will say though, at first the shoe was very tight. i wear size 10 climbing shoes and these took about 10 climbs to really wear in. They are still a touch too tight for my taste but certainly wearable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160901
    },
    {
      "title": "Great beginner shoes.",
      "text": "I have been renting shoes for my son for a year now. Works for him. Kinda loose but he has skinny feet.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "They fit very well and are perfect. They were somewhat stiff when they first arrived",
      "text": "These shoes were exactly what I was looking for. They fit very well and are perfect. They were somewhat stiff when they first arrived, but that’s every shoe, after wearing for a week they were perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Williamson",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Great shoes for a better price than the 5.10 outlet store in Redlands ca.",
      "text": "Rock climbing shoes that fit nice, break in nice and come off super easy with just two Velcro. Great product. [...] Thanks you.",
      "rating": 5.0,
      "verified": true,
      "author": "Melanie A Maraghy",
      "helpful_votes": 2,
      "publication_date": 20160804
    },
    {
      "title": "Not worth the buy anymore. These barely last. ...",
      "text": "Not worth the buy anymore. These barely last. Got a hole in the toe after 5 months. Just not durable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jun H.",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "comfy",
      "text": "I bought the same size as my sneaker and I'm glad i did. my feet are pleasantly comfortable and if they stretch just a bit I will be able to enjoy wearing them all day without scrunched up toes.",
      "rating": 5.0,
      "verified": true,
      "author": "Preston",
      "helpful_votes": 2,
      "publication_date": 20140521
    },
    {
      "title": "high postage for returns",
      "text": "Bought size 14 for my son (he usually wears size 14), unfortunately they were too small. I returned them and ordered a size bigger and they were too large. The shoes are good quality but to send the shoes back was $17.50 postage - twice. I realized this after I had already ordered the 2nd pair.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Brown",
      "helpful_votes": 2,
      "publication_date": 20170902
    },
    {
      "title": "They don't make them like they used to",
      "text": "They aren't putting that much rubber on the souls of these anymore. I've been getting these shoes for years and they have begun to skimp on the rubber thickness, leaving you looking for a re-soul rather quickly. Jerks. Other than that, very comfortable and relaxed climbing shoe. Not terribly good for edging, but I prefer comfort over performance and these are the best. Good for long multi-pitch days.",
      "rating": 3.0,
      "verified": true,
      "author": "A roth",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Five Stars",
      "text": "Very fantastic shoe! Toe is a little offset but I love that personally!",
      "rating": 5.0,
      "verified": true,
      "author": "Travis",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Good shoe, but not for me",
      "text": "Don't get me wrong, it is a great shoe, but it did not work for me because of how my feet are. I need a more symmetrical shoe (my second toe is longer than my big toe on both feet) with more camber than this shoe gives. Other than that, it was a good fit and snug. My normal shoe size is around 9.5, so I got a 10, and it was a pretty good fit otherwise. The velcro straps made it so convenient to put on and take off periodically if my feet needed a rest.",
      "rating": 3.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 2,
      "publication_date": 20150818
    },
    {
      "title": "Five Stars",
      "text": "Great shoes! I haven't had any problems with them turning my feet blue... Yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Five Stars",
      "text": "Great for climbing fits like a glove, got it just when I was supposed to... Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "karen zofcak",
      "helpful_votes": 2,
      "publication_date": 20140815
    },
    {
      "title": "so-so",
      "text": "Not impressed - below the level of quality I expected from 5.10. The fit is way, way too big - I normally wear 10.5 and the 10 I bought are way too big - looks I should have bought 8 or 8.5. Didn't bother returning and I'm stuck with them, I hope they'll shrink while washing. They are more comfortable than most climbing shoes, but the rubber and shape are not good enough for technical climbs where everything counts. I'm using them for warm up - for serious attempts I'm using 5.10 Anasazi VCS. For similar price there are better options (5.10 Moccasym), so I don't recommend the Rogue.",
      "rating": 3.0,
      "verified": true,
      "author": "Doru C",
      "helpful_votes": 3,
      "publication_date": 20150305
    },
    {
      "title": "Good pair of shoes for beginners",
      "text": "Good pair of shoes for beginners, my foot is very wide and these fit me well before they stretched and now that they have stretched they feel amazing",
      "rating": 5.0,
      "verified": false,
      "author": "the pickleking",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "A shame.",
      "text": "These were the most comfortable shoe I've ever put on, but they were a little large. I had to return mine because Amazon wouldn't replace or honor the price I bought it at. A shame. But they were amazingly comfortable.",
      "rating": 4.0,
      "verified": false,
      "author": "L",
      "helpful_votes": 0,
      "publication_date": 20160920
    }
  ],
  "product_meta": {
    "title": "Five Ten Mens Rogue VCS-M Rogue VCS-m",
    "description": "Five Ten, the Brand of the Brave, is a leader in performance, high-friction footwear. From downhill mountain bike racing to rock climbing, from wing suit flying to kayaking, Five Ten makes footwear for the world's most dangerous sports. The Redlands, California-based company has been producing cutting-edge designs and proprietary Stealth rubber soles for nearly 30 years. With the help of top national and international athletes and guides, combined with a world-class rubber-testing and R&D facility, Five Ten is the shoe brand of choice for the world's most exciting athletes.",
    "rating": 4.4,
    "feature_bullets": [
      "Heel sling shot rand",
      "Reinforced arch",
      "Outer Material: Synthetic",
      "Sole: Gum Rubber",
      "Closure: Hook and Loop",
      "Shoe Width: D mens_us",
      "Dual hook-and-loop strap closure",
      "3.5mm Stealth C4 Rubber sole",
      "Weight: 7.9 oz (224g)",
      "FiveTen offers flexibility, fit, and precise footing in this performance climbing shoe."
    ],
    "specifications": {
      "Package Dimensions": "30.48 x 20.32 x 10.16 cm; 187.11 Grams",
      "Date First Available": "20 Nov. 2013",
      "Manufacturer": "Five Ten",
      "ASIN": "B00DB49F44",
      "Item model number": "Rogue VCS-M",
      "Department": "Men’s"
    },
    "categories": [
      "Fashion & Athletic Trainers",
      "Climbing Shoes",
      "Shoes",
      "Sports & Outdoor Shoes",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": 81.74
  }
}