{
  "website_summaries": [
    {
      "verdict": "The $159 ultraflexible Withings Body Scale, once the pinnacle of home weight measurement, is losing its edge in the face of better competition.",
      "pros": [
        "With modern good looks, the Withings Body Scale tracks weight, BMI, and body fat percentage over time",
        "Data is stored in the cloud and the scale supports many third-party fitness solutions"
      ],
      "cons": [
        "Despite an inferior build quality, the Body Scale is more expensive than the Fitbit Aria",
        "Its interface is not as intuitive, and Withings' online tools are basic"
      ],
      "aspects": {
        "Design": 7.0,
        "Features": 7.0,
        "Performance": 8.0
      },
      "publication_date": 20120522,
      "rating": 7.3,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "My scale has a hard time getting a pulse reading ...",
      "text": "My scale has a hard time getting a pulse reading. It takes two or three times to get the reading. When it does get a read it reads 20-50% lower then my actual heart rate. I'm in contact with Withings customer support but haven't had any luck with a solution. Update- Amazon replaced my faulty scale after I spent over two weeks emailing Withings. The replacement scale doesn't perform any better. Beware! Withings has an F rating with the BBB.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 32,
      "publication_date": 20150208
    },
    {
      "title": "Really disappointing. Changes unit of measure on its own constantly in a humid bathroom.",
      "text": "This scale worked great for about three months, until I started stepping on and seeing that the unit of measure had randomly changed. It started as a minor annoyance, but it now occurs after every shower. I sit here and watch my scale scroll through and reselelect the unit totally on its own. Almost every time I want to use this scale I have to pick it up and change the unit again. Withings support was no help at all, they refused to acknowledge it as a widespread issue when people across their forums are complaining of the same. Will never buy another Withings product.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam Caplan",
      "helpful_votes": 6,
      "publication_date": 20161013
    },
    {
      "title": "Not recommended",
      "text": "I liked this scale at first. I've had the scale less than 1 1/2 years and the weight varies constantly. This morning it said I weighed 7 lbs. That is pretty common. I gave it time to reset and then it read my weight. Yes, the batteries have been changed. This morning while weighing myself, in 13 minutes of weighing, I lost almost a pound. Would not recommend this scale. Been in contact with Customer Support. It's out of warranty and they're offering me a 25% discount. Why would I want to pay another $100 (after a discount) for another scale that won't work after 1 1/2 years? Just beware of this item.",
      "rating": 1.0,
      "verified": true,
      "author": "lindusha",
      "helpful_votes": 6,
      "publication_date": 20160514
    },
    {
      "title": "Eats batteries like mad by waking up every hour to randomly change units",
      "text": "This thing worked great for a year or two, but then (as many other reviews have said) it got weird and started switching randomly between kg, lbs, & stone pounds. So now, despite us rarely using it, it still needs its batteries replaced multiple times a year. (Honestly I don't actually know if the battery issue and the unit change issue are related.) This is a common issue, so even if you only need the thing for a year or so and don't care if it gets weird after that, I encourage you to take your business elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Malcolm Ocean",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "This $100+ product won't last long!!!",
      "text": "This $100+ product won't last long!!! Mine was faied around 2 years. After searching online, it looks a LOT was failed around 1 year. Custom service is not helping as only provide a 25% off coupon for replacement. They have all the diagnosis data showing it was malfunctioning early. Also, they claim the warrantly is one year, even through the link on amazon shows 2 year.  \"Our warranty period within most of Europe is two years. As per American law, our warranty period within the United States is one year. We are sorry for any inconvenience this causes.\" Well, definitely will end my relationship with Withings.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna W",
      "helpful_votes": 3,
      "publication_date": 20161020
    },
    {
      "title": "Unreliable when paired; nearly impossible to re-pair",
      "text": "A frustrating tap-dance to pair the bluetooth and wifi initially, and once paired, the scale unreliably updates from that point on. Do not let it run out of batteries -- once the power is drained, you can't get it to re-pair with your phone. At all. Even if whiping the app from the phone and trying again (I have android). Of the smart scales I've tried (I've also tried the fitbit and a generic) they all suffer from just terrible interfaces and poor technology support. Much easier and cost effective to get a regular \"dumb\" scale that measures BMI, as you'll be entering the measurements manually in your phone most of the time anyway.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Stumpf",
      "helpful_votes": 3,
      "publication_date": 20170509
    },
    {
      "title": "Be aware of product reliabilty",
      "text": "I owned this scale for for a little over 12 months until it started operating erratically, changing weight units constantly and running down the battery. Customer service was responsive and helpful, and agreed that the hardware was probably defective. However, since it was several weeks out of warranty, all they could offer was a 25% discount on a new one! I decided to pass on the idea of possibly having to buy a rather expensive (about $150) scale that may need to be replaced every year or so. Good functionality when it's working, it just seems to be unreliable.",
      "rating": 2.0,
      "verified": true,
      "author": "bill_va",
      "helpful_votes": 3,
      "publication_date": 20160530
    },
    {
      "title": "Looks great but does not last very long",
      "text": "Looks nice and convenient phone app but it does not last very long. The settings started resetting itself (lb -> kg). It would also light up on it's own. Put in fresh batteries (90%), reset it back to factory (disassociate product), check for updates (nothing) and still the same issues. This is happening at least 3 times a week. The readings also fluctuate within a minute. I would step on the scale and my normal weight would increase by 5 lbs and bodyfat increase 2%. Step on the scale again and weight and bodyfat would fall back in range (5 lbs & 2% less). My Tanita body scale lasted over 10 years with no issues. Very Disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Wrigley Guy",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "DO NOT WASTE YOUR $$$",
      "text": "DO NOT WASTE YOUR $$$. Horrible Product!!! I did not workout at all for 2 weeks straight. But, I did weight myself every morning and sometimes multiple times. The scale shows me losing weight every day which, was clearly not the case because I actually ate more those 2 weeks. The scale is also very inconsistent. I measured myself 3 times and it was off as much 3lbs from one test to the other. DO NOT WASTE YOUR $$$.",
      "rating": 1.0,
      "verified": true,
      "author": "Yeng Thao",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Nokia/Withings scales are desgined to fail.",
      "text": "Don't waste your money. As others have stated, these have engineered obsolescence. Mine worked fine for roughly 16 months. Then it started eating batteries at a rate of 4 per month. The only tech support I was offered was \"move it close to the wifi router, don't use it on carpet.........buy a new one\". It's not located on carpet and is within 30ft of the router. I found it shocking that the second tech support response I received was a sales pitch.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20170711
    },
    {
      "title": "This weight loss surgeon recommends this product highly.",
      "text": "As a weight loss surgeon I know that if patients measure it they will manage it. I want all my patients to get a device in order to measure their weight weekly. This not only does that, but checks the pulse as well as body fat. It also gives a weather report- not needed but cute. So when patients have surgery I have them start on this scale. If I want to know their heart rate this will give it to me. They can set me up to see their progress. This with their watch is the combination I am recommending to my patients this year.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Terry Simpson",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "A little gimmicky and inaccurate on fat",
      "text": "Works great as a scale. But the fat monitor on this one constantly reports 8 percent higher than other scales. And based on my body, there's no way it's accurate based on the percentage it's giving. I've heard that not all ethnicities report fat the same way, and I'd say this one just doesn't work for me. The only ethnic setting is Asian, and that definitely didn't work for me. And if I tried the athletic setting, the data was even more off but in the wrong direction. That paired with it not having the same other metrics like other non-smart scales do, like my really good EatSmart scale, and this is just a waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "IZ",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Scale broke after 2 months. Great until Then...",
      "text": "The scale was fine at first but now randomly changes weight parameters from pounds to stone to kilos, etc... NONSTOP! I will look over when Im brushing my teeth and the scale is changing to stone... I really dont know why its just random. Customer service is nonexistant except for an email that sai I should try to get my money back from Amazon since they sold it to me... Stay away save your money and get a fitbit scale. Got working again now its broken again... NEVER AGAIN!",
      "rating": 1.0,
      "verified": true,
      "author": "William Waldron",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Cool, but not what I was expecting for the price",
      "text": "Considering the cost of this, somewhat disappointing. For $150 I was expecting a scale that could do wonders. It takes your weight very well - I like how it forces you to stand in the middle. The body fat function is frustrating - it usually doesn't work and varies wildly day to day. Pulse only works if you aren't wearing socks. It was a hassle to set up - kept having to be reset. And it sometimes sends to the wrong phone. Cool, but not the best impression of a luxury-priced brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian Lehman",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Good Scale",
      "text": "I bought this scale to work in conjunction with with a Withings Activite Pop activity tracker. The scale works as expected and makes it sort of fun to track your weight. You can configure what the scale shows you every time you weigh it (e.g. have it show you the temperature highs and lows for the day). The scale easily integrates with weight watchers. Also, it looks pretty nice. The air monitoring is pretty useless. It works I just don't see the point of knowing the air quality of my bathroom. I don't fault the device for that though as it seems to be fully capable of measuring it. It's not the scales fault that it's useless knowledge.",
      "rating": 5.0,
      "verified": true,
      "author": "127001",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "It is nice to live in a time where products like this exist, and work!",
      "text": "It took a little bit to get the family all registered/activated and recognized on the scale, but now that we are, this is awesome. It recognizes who is standing on it, and it is really great to have our individual info uploaded to the site to track our progress. We really like this. As far as consistency goes, I would say it is a little better than some, and a lot better than others. It isn't 100% every time (if you get on and off 3-4 times you will get slightly different readings), but for the most part it is really good, and I would say it has an acceptable margin of error.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "as well as several other features easily available on other scales",
      "text": "So it works.... I'm not very impressed for the price. The only reason I wanted this scale was to integrate with Fitbit which all it will allow me to do at this time is integrate your weight... booo! The features on the scale are lacking for sure. You don't have any bone mass... as well as several other features easily available on other scales. Support for basic questions is lacking too... I've waited 7 days so far for two questions and I haven't received a response. I've noticed that the app and the website take as long as 24 hours to update the scale at times... Personally I wouldn't recommend this device.",
      "rating": 2.0,
      "verified": true,
      "author": "Casey Hill",
      "helpful_votes": 0,
      "publication_date": 20150426
    },
    {
      "title": "The company was purchased by Nokia and the usefulness of the app is not as good. I much prefer the old Whithings app",
      "text": "I've had this scale for a few years now and it has worked well for me. It does take a little time to get it set up but after a few false starts it worked well. The company was purchased by Nokia and the usefulness of the app is not as good. I much prefer the old Whithings app. I have waited for updates but so far no luck. I would purchase the scale again with the original Whithings software but not with the Nokia version. Do your research before buying.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph A Dandona Jr",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "WARNING: Product life is less than 2 years!",
      "text": "WARNING: DO NOT BUY THIS PIECE OF JUNK! I can't believe all of the reviews saying the product life of this scale is one year and then it dies. It's true, although mine lasted less than two years before it completely died. No customer service options to fix it. Over $100 for a useless brick. While it worked it was great.",
      "rating": 1.0,
      "verified": true,
      "author": "LoveToRead",
      "helpful_votes": 0,
      "publication_date": 20171120
    },
    {
      "title": "Bad when it worked and now broken",
      "text": "After slightly over a year, this scale stopped working at all. The weight measurement now always tells me to lean forward as I see it quickly drop about 50lbs in the process. It never comes up with an accurate weight--the one things a scale *must* do, it no longer does. The warranty on these is one year for a reason... they will break after that time. Even when it *worked* the only accurate measurement was weight and syncing usually failed. Don't waste your money on this. Custom support offered me a 25% discount on a full priced replacement (it'd be cheaper to just order another off Amazon).",
      "rating": 2.0,
      "verified": true,
      "author": "C. Leak",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Good scale -- don't buy for the features",
      "text": "An attractive, expensive, apparently accurate scale. I can't vouch for the temperature readings or the carbon dioxide readings (neither of which is important to me, and neither feature influence my purchase decision). I also cannot tell whether the body fat number is correct. It seems to vary without rhyme or reason. The heartbeat readings appear useless. The scale frequently declines to make a measurement, and most of the time the measurement it does give is obviously inaccurate -- it appears to default to \"53\" I haven't thought it was worth the trouble to return it, and the weight measurement seems accurate.",
      "rating": 4.0,
      "verified": true,
      "author": "genie",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "does not support 5gHz wifi.",
      "text": "very challenging setup. took me two days of fiddling to work it out. constantly got wifi errors. finally discovered that it does not support 5GHz wifi, so I had to reconfigure my router to broadcast in 2.4ghz and 5ghz. even then i got errors and had to set up a fixed IP address for the scale. there is a bluetooth only option but you have to go through a laborious pairing process every time you upload the data: push the pairing button on the scale, go to setting on your iphone, pair the scale, then go into the withings app. frustrating and time consuming. for a product this expensive it should just work.",
      "rating": 2.0,
      "verified": true,
      "author": "sfcity",
      "helpful_votes": 0,
      "publication_date": 20150307
    },
    {
      "title": "Even handles my fat arse...",
      "text": "Best scale I have had so far, like that you can set up multiple profiles for different people, everyone that comes over has to try it out. The weight is really accurate. The body fat percentage measurement is nice, but I wouldn't rely on it as its pretty different almost every time I step on it. I like that it keeps track of everything for you via an app. I am trying to get into better shape and am a techy so I wear a wristband tracker as well and this synchs very well to a lot of different apps. Anything that will help you stay motivated to lose weight is a win.",
      "rating": 4.0,
      "verified": true,
      "author": "Shuoink",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Avoid!!!",
      "text": "Wow is this scale terrible! I have the scale on a carpet and it switches units of measure daily. The switch on the bottom of the scale to change units of measure is nearly impossible to activate by hand. I'll dumping this scale very soon and I wouldn't wish it on anyone else. OK, I vented, now going back to pushing that terrible button, trying to get it to register so I can switch the units of measure back to pounds. Errrrr!",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas Andrea",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "It just works, no hassle.",
      "text": "This is the one to buy. Absolutely 'set-it-and-forget-it'. I set up the scale with my galaxy s6 and my wife's HTC m9 back in about 2 months ago. The only thing we have had to do since then is step on the scale. It automatically saves everything, without fail. You don't even need to tell the scale who you are, it knows (based on relative weight). The CO2 feature is interesting, and I am actually sorta surprised by the body composition measurements-- they seem pretty accurate, which was very surprising.",
      "rating": 5.0,
      "verified": true,
      "author": "J de North",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Good looking scale",
      "text": "Good looking scale. Pretty good app to go along with it. I only have two beefs with this scale, even combined I don't think its worth taking a star off: 1. The body fat calculation only works for those who are signed up with an account on the app. That's fine for me because I use it every day, but if a friend wants to use it, I think its dumb that they can see their weight but the body fat doesn't register. 2. Took a bit to get it to sync, the instructions were easy but it couldn't maintain a connection. Its been working fine for a few months now so I'm not concerned.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan C. Dorn",
      "helpful_votes": 0,
      "publication_date": 20140726
    },
    {
      "title": "Not worth the money.",
      "text": "Very flakey performance. Keeps switching from US pounds to other measurements and has to be manually reset over and over.",
      "rating": 2.0,
      "verified": true,
      "author": "Jefffrey A. Lampert",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Nice Scale",
      "text": "I had to do the setup twice after taking out the batteries. Second time worked; machine would not sync with server site. Delay to upload info is general norm. All in all it works well and brings new insight into health review. Nicely built. Btw: I emailed support after the first install didn't work; I figured it out myself being rather technologically proficient. No response so far after many days. I wont discount the machine review for that reason, because I got it to work; however, a non-techie might have a hard time with setup if any twists occur.",
      "rating": 5.0,
      "verified": true,
      "author": "LongTimeAmazonUser",
      "helpful_votes": 0,
      "publication_date": 20150112
    },
    {
      "title": "Don't waste your money",
      "text": "As a lot of reviewers are saying on here, this scale is not built to last. I have owned mine for just over two years. About six months ago, it started changing the units of measurement on it's own. While brushing my teeth a few feet away, I would see it light up on its own, bring up the units menu, and select the next unit of measurement. Very frustrating to step on the scale expecting pounds and finding it in kilograms. Have been in touch with Nokia who now owns Withings. The only offered me a 25% off coupon since the scale is out of it's one year warranty. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "atmos77",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Inaccurate and Overcomplicated",
      "text": "Purchased this scale looking for something that would seamlessly upload my weight and other vitals to a profile or app to help me track progress towards goals. After some setup frustration (not intuitive setup at all) seemed to get it working. Problem was when testing, I weight myself six times in a span of 10 minutes and came up with six different weights with a variance of over 5 pounds. Also body fat measurements changed wildly too. I'm returning it because the whole point was simple AND accurate weight tracking. Manufacturer should focus on accurate measurement before adding all the bells and whistles.",
      "rating": 2.0,
      "verified": true,
      "author": "Gerald McGrew",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Great product, great support",
      "text": "I have owned this scale for about a year and it works well. Set up is easy. You can track multiple people. The app links with all of the popular apps such as fitbit, mapmyfitness, etc. Batteries last about a year. Recently, when I replaced the batteries, the display of the weight was shown upside down and no other features worked. I e-mailed customer support and received a reply in under 5 minutes. The fix was to remove the batteries for 30 seconds and to reinsert them. This fix worked like a charm. This is a great product with great support and I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith R. Kaminski",
      "helpful_votes": 0,
      "publication_date": 20160107
    },
    {
      "title": "Steep price but worth it.",
      "text": "The initial pairing with your phone is a bit of a pain, the buttons are on the bottom and very small. However once you have gotten passed the initial pairing it works great. Once you weigh yourself it automatically sends the information to your phone (as long as your Bluetooth is on). The Withings app pairs easily with the fitness app of your choice or you can use it to track other fitness information. If you aren't looking for a scale that syncs up with all of your other fitness data this might not be the product for you at this price.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Myers",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Great scale but don't like to change batteries.",
      "text": "I like the scale. It helps me keep track of my weight every morning and informs me if I'm keeping control of my weight. The only problem is that it uses batteries. I would prefer not to use batteries but I did buy a set of the Panasonic rechargeable batteries and their charger and that helps with the cost. I still don't like the inconvenience of changing the batteries. This is why I gave this 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob C.",
      "helpful_votes": 0,
      "publication_date": 20170409
    },
    {
      "title": "Wrong Weight",
      "text": "Do not purchase this scale. While trying a new diet, I thought I was seeing success in weight loss. I find that after a weeks of the new regiment, my scale decided to jump to my original weight and present an error. It didn't recognize me due to the weight increase. I've now lost weeks of potential progress due to a misleading scale. Aside from the scale, you will find that the support is also lacking. I would advise purchasing a scale from a different company.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Great product but Heart Rate Monitor Needs Update",
      "text": "The scale works really well as does the connectivity to the phone app for active tracking of data for the user (Weight, Fat Mass, Pulse, Air Quality). However, the heart rate (Pulse) sensor on the scale is on average 30-40% higher then that reported on the iPhone. I use the built in functionality of the heart rate monitor, through placing your finger on the flash, on my iPhone 6 Plus via the Withings App. I've since disabled the heart rate monitor on the scale so to not skew the trend timeline.",
      "rating": 4.0,
      "verified": true,
      "author": "John Saunders",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "This has turned out to be a great purchase. It was relatively quick and easy to ...",
      "text": "This has turned out to be a great purchase. It was relatively quick and easy to set up on our wifi network, and having it record weight (which is the most relevant, and probably the most reliable, part of the data) is a great convenience. I'm half-blind without my glasses and I can read my weight perfectly well without my glasses, too. I also like the fact that it interacts with Apple's HealthKit and look forward to improvements in the functionality of HealthKit in the future. Overall highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JN",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Nokia Sucks Don't Buy This",
      "text": "Do not but this product. It stored pairing and three isn't any support of any kind. Ok not sure how Addison is allowing them to sell this product. The link for support results in a 404 link error. NOKIA SUCKS",
      "rating": 1.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Works fine if internet is near",
      "text": "I bought this as a companion to use with fitbit and myfitnesspal app. Works fine but my % body fat and pulse don't really change that much, so it's a bit of a waste. In retrospect, I should have just bought a regular scale. I did have to move it closer to my wireless router to get it to work consistently. Batteries seem to last around 4 months. I do like that you can have multiple accounts so other users don't get to see your progress of lack thereof. Account doesn't register for small kids <50lbs. May be user error.",
      "rating": 4.0,
      "verified": true,
      "author": "April Barr",
      "helpful_votes": 0,
      "publication_date": 20140413
    },
    {
      "title": "Showed great promise, but couldn't figure out who was whom",
      "text": "Showed great promise for us to do the IoT, quantified-self, but couldn't tell the difference between my 185lb roommate and 145 self. Was easy enough to setup and worked well with the app, but for the whole two different people thing. It's supposed to automagically figure out who is whom based on body weight, fat %, and other characteristics, but didn't work in our case. In the end I had to return it.",
      "rating": 3.0,
      "verified": true,
      "author": "Fred",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Interesting product, not perfect",
      "text": "This is an interesting product. The weight seems accurate and consistent. The body fat is high, compared to my gym. The pulse is high compared to my Withings blood pressure cuff. But the ability to automatically log and keep a record of weight is appealing. Had I to do it again, I would probably just get the scale. It is possible that by adjusting some of the settings I can get a better body fat reading. I still need to explore that. The reading us consistent, so likely useful for measuring change and trends, which is useful in itself I think.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20140613
    },
    {
      "title": "Keeping me on track for weight loss",
      "text": "Set up took about 5 minutes. It's easier to set up if you have the scale next to the phone. I was going to knock a star off because the documentation is pretty minimal, but the set up was so easy that it really didn't matter. Sleek looking. Easily recognizes the difference between users and syncs the weight to my phone nearly instantly. Using it with the MyFitnessPal on my Android to track calories and weight loss. Easy-peasy!",
      "rating": 5.0,
      "verified": true,
      "author": "Phbrowne",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Awesome scale with careful placement.",
      "text": "Really cool scale. Nice help in tracking. \"Carpet feet\" are basically useless, resulting in large (3-5 lb) variations in readings, and even regular feet are sensitive to flooring changes. I'm using the basic feet on a linoleum bathroom floor, and I've found that the floor can be a little springy in some places. If I move the scale out of the little divots it's created in the linoleum, my weight measurement will fluctuate by 1-2 pounds up or down. As long as I keep it sorted, it will accurately note changes down to 0.1 lb.",
      "rating": 5.0,
      "verified": true,
      "author": "flgatorfan",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Accurate scale Body fat measure is good. Cons",
      "text": "Pros: Accurate scale Body fat measure is good. Cons: Randomly stops syncing with app and website. Really bad at picking up pulse. You have to go through the whole syncing exercise every time you do a battery change -- poor design. Annoyingly, they place all the serial number information UNDER the batteries, which forces you to resync every time that you you want to see the serial number. Dumb.",
      "rating": 3.0,
      "verified": true,
      "author": "TexasCyclistg",
      "helpful_votes": 2,
      "publication_date": 20141208
    },
    {
      "title": "GREAT scale! I've used this nearly every day for ...",
      "text": "GREAT scale! I've used this nearly every day for 11 months now. Easy to set up and use. It does go through a set of batteries about every six months. And, the Wifi doesn't reach very far (I set up a second wireless access point at that end of the house for this to work). The weight seems quite precise, the bodyfat about as accurate as any other home scale. The rainy weather warning seemed rather useless to me, but I was able to configure it to stop showing that.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael V. Raffety",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Works really well",
      "text": "After a minor problem getting the body analyzer to connect to my household Wi-Fi network, everything went well. We use it each morning when we get out of bed to measure our weight and pulse rate. When checked against other scales, it is quite accurate. The data are sent immediately to my iPhone app which provides a very nice record of weight changes. It also recognizes myself and my wife individually based on our weights. Is nicely designed and operates very well. I have had no problems except the initial slight problem and would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "IanK",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Great scale/gadget!",
      "text": "Great scale. I would have given it 5 stars, but integration with Windows Phone isn't all that great, but I do understand why that is. I love the ability to track your weight and fat mass. It can also recognize different members in your family, as long as there is a large enough weight difference between each person. The Withings dashboard/website is easy to navigate, too. I use the scale multiple times per day and log into the Withings dashboard daily.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy J. Harnish",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Goodlooking but inaccurate scale",
      "text": "First look is great. Bad accuracy, shows 10+ pounds less weight, some times 20 pound less than real one, compared with two diff scale at doctors office. Also it takes 30 seconds plus to display weight after you step on it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tech Guru",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Does not work as advertised and will break",
      "text": "It constantly changes the scale from lb to kg to lb stone, which drains the batteries extra quickly. It also cannot be factory reset (the directions do not do anything), and the app does not consistently sync with Apple Health. Avoid this overpriced mess.",
      "rating": 1.0,
      "verified": true,
      "author": "JustSomeGuy",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Great looks, bad accuracy",
      "text": "After more than a year using this device, I now give it a \"2\" for weight and networking. It keeps losing sync, which is why it gets only a \"2\" in the weight tracking area. However, the real problem is that the body fat measurement is terrible - more than 10% higher than it should be (that is, it reports 36% when it should be 25% based on about 4 other devices, including a professional measurement at my gym). For that reason, it gets a \"DO NOT BUY\". A device may or may not have fancy features, but first it has to be accurate.",
      "rating": 1.0,
      "verified": true,
      "author": "An engineer",
      "helpful_votes": 0,
      "publication_date": 20130805
    },
    {
      "title": "Good idea, poorly executed.",
      "text": "I have owned this scale for just over 3 months. Easy set-up and syncing. Scale worked fine for first 12 weeks but over the last two weeks the scale is buggy at best and unusable at worst. One day it measures in \"pounds\", next day in \"Stones\" and even throws in \"Kilograms\" occasionally. There is a button underneath to set unit measure but it works poorly and it can take a minute or two to recognize touch. I have also experienced wide weight swing readings in back to back weighings. As much as 5 lbs. Wanted to return but Amazon only offers 30 day window. Withings Scale is a good idea poorly executed. Not recommended.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160801
    },
    {
      "title": "Connects and integrates, but does it weigh accurately?",
      "text": "Painless, seamless Android installation, ditto integration with MyFitnessPal. It weighs about 5% heavier than my other digital scales, alas. Those were two different brands and weighed within a couple of ounces of each other, so likely were more or less accurate, though they refused to communicate with anything and one of them crashed my server. They've been returned. Will update this review after using the scale for several days.",
      "rating": 4.0,
      "verified": true,
      "author": "PsychReader",
      "helpful_votes": 0,
      "publication_date": 20160329
    },
    {
      "title": "Meh",
      "text": "It's just meh. Sometimes when I step on it, it will give me a weight that bears no resemblance to what it actually should be. 8 lbs. 48 lbs. 90 lbs. I'm a 6', 182 lb dude, I go up and down a couple of pounds here and there. Sometimes it just doesn't work and you need to step on and off a few times. I had no problem linking it and setting it up on my network, the application and website was a breeze. It's just that the product is .... meh. Looking back at it, I wouldn't have purchased it and now see it as a waste of money. It's not reliable.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric F.",
      "helpful_votes": 0,
      "publication_date": 20140523
    },
    {
      "title": "Every one of these I’ve owned has developed problems",
      "text": "When it works, it’s a great scale. Easy to use, customizable screens, and the ability to create profiles is great. But the first one I got developed an issue where it turns on and cycles the units (lb/kg/stone) for hours, killing the battery. I sent it back and Withings sent a replacement. A few months later it showed the same defect, and they won’t replace it anymore. They did offer me 20 percent off a new one, but I’m not about to end up paying 180 percent to get yet another product that’s broken.",
      "rating": 3.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20160422
    },
    {
      "title": "Only one downside",
      "text": "I use this in a home where there are multiple people, and everyone can see your weight, they need to make it to where the app allows you to set a pin code or something so only you can see your weight in the app.",
      "rating": 4.0,
      "verified": true,
      "author": "TexasBlingMommy",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Good but not great",
      "text": "I like the sleek look of this item & have had it for a while. Was a pain to set up more than 1 profile when we finally got that worked out it ran out of batteries & you have to go through the set up process again. Speaking of batteries this thing goes through them very often. I do like the app & how you can customize the metrics you wish to see.",
      "rating": 3.0,
      "verified": true,
      "author": "CCato",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Love this scale. Combined with the mobile and web app its fantastic.",
      "text": "I bought this scale to replace a cheaper scale I had bought previously really just hoping to get more accurate numbers for tracking, however I ended up using the web and mobile apps to track and sync with MFP (myfitnesspal) and it became so much more. The motivation I get from seeing the changes and ease of use in both tracking and connecting the other things I used it great. Nothing without spending hundreds if not thousands of dollars is gonna be 100%, but the scale comes close enough I can keep things tracked and adjust my intake and exercise to reach the next level.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike B",
      "helpful_votes": 0,
      "publication_date": 20131214
    },
    {
      "title": "Very disappointed!",
      "text": "One would expect a $150+ scale to at least measure weight with consistent accuracy. I tested the accuracy multiple times, and each time this scale failed miserably. Readings varied from -15 to +19 pounds. Absolutely unacceptable for any scale, much less one that is advertised as technologically advanced as this one. I purchased an EatSmart basic model for about $20 or $30 and have been perfectly satisfied! I'd rather manually input accurate readings than have inaccurate readings synced automatically.",
      "rating": 2.0,
      "verified": true,
      "author": "Conor Fox",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Started fantastic, ended miserably.",
      "text": "When I bought this product it worked great. Loved it. However, a year later it just stopped working one day. When you get on the scale now the numbers go crazy and bounce all over the place and never give a final reading. Seems for $100+ product it should last longer than a year especially when there are other products out there with higher ratings selling at half the price. Now it's just a digital paperweight; worthless. I don't recommend buying one if you're looking for even the most basic product longevity.",
      "rating": 2.0,
      "verified": true,
      "author": "Joshua R. Cole",
      "helpful_votes": 2,
      "publication_date": 20160816
    },
    {
      "title": "Best investment I've made for weight loss and overall health. Amazing app to go with it.",
      "text": "Best investment for weight loss thus far. I love the app and the interface. It's really easy to set up and it has been wonderful to use. I felt like it had some issues reading my heart rate sometimes but all-in-all it's been great. I've owned this for over 1 year now and would recommend it to anyone and everyone looking to keep better track of their overall health (weight, heart rate, fat %, air quality in home). It also gives you a quick weather forecast too.",
      "rating": 5.0,
      "verified": true,
      "author": "MD",
      "helpful_votes": 0,
      "publication_date": 20150827
    },
    {
      "title": "Sync never worked, support is non-existent",
      "text": "I don't usually leave reviews, but I think it's worth making an exception in this case. I was able to use it as advertised for a month, then it stopped syncing. It's been nearly a year now, and there have been software updates and multiple support emails and resets, but the software never finishes pairing or synchronizing. I paid $120 for a \"smart\" scale without any smarts. Horrendous purchase, steering clear of Withings/Nokia in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170821
    },
    {
      "title": "EXCELLENT",
      "text": "I still have this scale 4 yrs laters and it works GREAT! I cannot believe I have already had it 5 yrs. Not a scratch on it and never had any issues with it at all! It's a very nice scale :)",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Excellent product, works exactly as stated.",
      "text": "Flawless setup with my iPhone 5. Updated itself and re-started smoothly during setup in about 5 minutes. Recognizes 2 people and shares data almost instantly with phone app and web page. Using on tile floor in upstairs bathroom approx 35 feet from 1st floor Airport Extreme with no problems. 10 seconds on the scale completes the cycle perfectly every time. We weighed ourselves about 27 times the first night and consistently achieved weight readings within .1 Lbs. . Hoping for a dedicated iPad HealthMate app but the iPhone app is very usable 'til then.",
      "rating": 5.0,
      "verified": true,
      "author": "Vito M. Deangelis",
      "helpful_votes": 0,
      "publication_date": 20130427
    },
    {
      "title": "Good Bathroom Scale",
      "text": "Bought this 5 years ago - still works and is accurate. Just use it as a scale, no bluetooth attachment. Might be a bit expensive for a bathroom scale, but its lasted a long time and beats the cheap spring loaded scaled.",
      "rating": 5.0,
      "verified": true,
      "author": "BobW",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Accurate, ease of use, and stylish!",
      "text": "I was hesitant at first to purchase it, however after using it for the first couple of months I have been extremely pleased with the product. I love the fact it synchs with an app on my phone, which provides trending data and has pushed me to gain milestones towards my weight and exercising more. Additionally, the measurements of my body fat, heart rate and weather alerts for rain are major plusses. I also like the fact that it checks the quality of the air in the room. Adding the Pulse to the mix helps round out monitoring my sleeping patterns and has resulted to me to assess and improve my exercise habits ultimately benefiting my health.",
      "rating": 5.0,
      "verified": true,
      "author": "Marshall Day",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "Wireless logging of weight makes tracking simple",
      "text": "The big feature is the online interface and app that shows how your weight/body fat %/height/BMI are tracking over time. I definitely think it is worth the extra money over a $30 scale if you're interested in monitoring your wellbeing over time. With 3 people in the household at significantly different weights, the scale doesn't usually have a problem identifying who is on the scale. If it can't figure it out, then it defaults to a blank person and allows you to manually assign the user. The CO2 and heart rate monitoring is less meaningful. It isn't a resting heart rate since you have to stand up an walk over to the scale.",
      "rating": 5.0,
      "verified": true,
      "author": "Tortoise",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "Worked well for ~9 months, then completely stopped.",
      "text": "After less than a year of use, the WS-50 stopped working. I tried replacing the batteries but it would not turn on no matter what I did. Before that, I enjoyed the scale and the integration with the Withings app. The weight was consistent and while the body fat % was useful. I will give Withings another shot, but 9 months seems like an awfully short life span.",
      "rating": 2.0,
      "verified": true,
      "author": "JWH",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "... for a few years and finally upgraded to the smart scale. Not sure all the extra info is ...",
      "text": "We have had a withings scale for a few years and finally upgraded to the smart scale. Not sure all the extra info is necessary but it sure is fun to have a quantified life! The CO2 sensor takes a couple of days to work correctly as at first, it told us we were basically suffocating in our own CO2 which worried me at first - it eventually zeroed itself out and its kinda cool to see it rise at night when we have the door shut. Graphs on the app are so useful.",
      "rating": 5.0,
      "verified": true,
      "author": "J Dog",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "None of the Company’s devices give accurate measurements",
      "text": "I have purchased the Withings Pulse, Smart Body Analyzer, and Blood Pressure monitor. None of the devices from the company give accurate measurements. The Smart Body Analyzer - AKA a scale, is off by a full pound for weight and the heart rate measurement is off by a full 30%. The Blood Pressure product is off by anywhere from 10% - 20%. I’m sure the Pulse is just as inaccurate, just give the heart rate measurement a test with it. Give these products a pass, they are a waste of your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Danman",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "... version of this scale I have is a little better than this one",
      "text": "I think the first version of this scale I have is a little better than this one. I have had some inconsistent weights like 10-20 lbs off and when that happens re-seating the battery to power cycle the scale corrects it. The heart rate monitor has only given me a good heart rate a handful of times and most times it just fails to detect it. I was going to put scale in bedroom but my carpet wouldn't play nice with the weight readings even when using the carpet boots. I think the air quality test works ok but not entirely sure. Wifi connectivity still seems solid. Still a good product but needs some polishing of these extras.",
      "rating": 4.0,
      "verified": true,
      "author": "Dennis Pearson",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "It seems like a small thing",
      "text": "It would rank significantly higher, but there seems to be a bug that they aren't acknowledging...let alone fixing...where after 4-6 months the device spontaneously changes the units for displaying/measuring weight. It seems like a small thing, but it's annoying as hell. Even more so for a $150 scale. You will see others complaining about it and the pat responses from Withings asking if 'anything is touching the bottom'. As though the button is inadvertently being pressed by something. It's not. For anyone that's worked in tech, you should recognize the repeated question as the Withings equivalent of Dev saying 'it works on my machine'. Rather, than an actual attempt to debug.",
      "rating": 2.0,
      "verified": true,
      "author": "Mike Silva",
      "helpful_votes": 2,
      "publication_date": 20160707
    },
    {
      "title": "Great scale and app!",
      "text": "I love this scale (as much as you can LOVE a scale). I get instant feedback on weight as well as history right at the scale. Later I will log into my account on my phone to review all the metrics. This scale and app feeds information right to myfitnesspal app as well. It is a great motivator to see the changes historically even if it is not always good. Really happy with the purchase and would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer117",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Pretty happy with it",
      "text": "Pretty happy with it. The body fat measurement is questionable and has a lot of variation as was to be expected from previous experience with Tanita, but still useful monitory trends even if the number it self is questionable. Most importantly I like not having to remember to log my measurements. The Web UI and data analytics could be much better, but since it is web bases software, hopeful they will make improvements.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Flory",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "Setup fails on Android devices",
      "text": "I was unable to complete set up of the WS-50 on any of my Android devices. Instead, I borrowed an iPhone and was able to complete the setup. On Android, the Withings App hung at the \"Set up WiFi\" screen. Once the WS-50 was configured, I was able to use the Android app to monitor collected data. Also, the Withings app is not available for iPad. Only iPhone. the Withings documentation is wrong. Until Withings fixes the Android app I give this one star. Until they fix the app to be available on iPad or correct their documentation I give it one star. If you have an iPhone it will probably work fine for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20140202
    },
    {
      "title": "So I'm very happy with the scale so far",
      "text": "I've had the scale now for almost a month. I was reluctant to purchase this model after reading some reviewers having to sync the scale with their phone to weigh themselves. No such thing for me and my iPhone 6, I just bring my phone to the scale's location and weigh myself and it automatically syncs with my phone and then with myfitnesspal and Garmin Connect ( I own a vivoactive). So I'm very happy with the scale so far.",
      "rating": 5.0,
      "verified": true,
      "author": "mmp1953Top Contributor: Running",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "nice scale",
      "text": "Nice scale, I really do not care about the other measurements just weight and the fact that it can upload the data that is where I go south with the star system. On there site where you set up your account to track your progress (and yes I connect to my other devices too) I find changing things on there interface very tedious, the user interface could and should be a lot easier. if it where not for that I would give it more stars. I also wished it interfaced with health vault the website says it does but I have not been able to do that yet",
      "rating": 3.0,
      "verified": true,
      "author": "sammy",
      "helpful_votes": 0,
      "publication_date": 20131126
    },
    {
      "title": "Not as good as I thought",
      "text": "I was really looking forward to this product but found it disappointing. Setting it up ran into errors several times, the startup guide contains minimal information so you have to start googling or looking at videos and FAQs online to actually find out how it works because the interface is not very intuitive. The air quality monitoring for instance... you're supposed to activate it pressing the button in the middle (which is not mentioned in the manual) but this doesn't always work and you have to press it really hard (unless I was given a faulty one)",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Howard",
      "helpful_votes": 0,
      "publication_date": 20150612
    },
    {
      "title": "2.4GHz ONLY!",
      "text": "NOTE: 2.4GHz ONLY! Check the Tech Specs link here to also see if your phone is supported.  The setup was pretty easy, but make sure you have 2.4GHz Wi-Fi at home. As a wi-fi geek I switched my home wi-fi router to 5GHz, but had to re-enable 2.4GHz just for this device. It works well and as expected though, so no complaints, just wanted to warn you guys!",
      "rating": 5.0,
      "verified": true,
      "author": "beforethebop",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Good for weight, body fat measurements wildly inaccurate",
      "text": "The scale was easy to set up. The app is helpful and easy to use. The body fat percentage values are wildly inaccurate... on the order of 5% differences per day. If you want something just for weight, this is fine. If you want body fat measurements, this is not the scale for you.",
      "rating": 3.0,
      "verified": true,
      "author": "evocatus",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "The app and the Withings site makes it easy to see the how you are trending because it ...",
      "text": "It's a nice-looking scale, and it works well. The tracking features are where it stands out. I used to have issues pairing it with my iPhone, but that seems to have resolved itself with a recent update, so it's frustration-free. I've been using it since January of 2014. The app and the Withings site makes it easy to see the how you are trending because it graphs your progress on a smooth curve over time. Both are easy to use. At least for me, the bodyfat calculation tracks fairly closely with much more expensive impedence sensors, such as the InBody. Not every measurement is accurate, but if you average them over a couple of weeks, you'll be in the ballpark.",
      "rating": 5.0,
      "verified": true,
      "author": "pdxmbridges",
      "helpful_votes": 0,
      "publication_date": 20170214
    },
    {
      "title": "DO NOT BUY",
      "text": "Weight readings were all over the place. One day the scale would read around my normal weight, the next it would read 20 pounds lighter for absolutely no reason. I informed Withings of the problem and they replaced the scale with one that did the exact same thing. Paying 150 dollars for a scale you would think it would do - even competently - the basic task of weighing objects. When I told them the replacement scale didn't work either they just kept offering replacements and refused to give a refund. Horrible company, horrible product.",
      "rating": 1.0,
      "verified": true,
      "author": "Jonathan King",
      "helpful_votes": 4,
      "publication_date": 20160317
    },
    {
      "title": "The best scale I have ever owned",
      "text": "After doing lots of research on smart scales I came to the conclusion that the Withings WS-50 Smart Body was the best, and I wasn't wrong. It accurately keeps track of your weight, body fat %, heart rate, and air quality, it then syncs that info to the app on your smart phone or device and slows you to keep track of your goals. It also can sync with different smart phone apps to have them all work together like my fitness pal which will then automatically update your weight. It is absolutely wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "I got this because of its automatic sync support with ...",
      "text": "I got this because of its automatic sync support with MyFitnessPal and that works really well. I step on the scale every morning after taking a shower and with no extra effort my weight is logged into MyFitnessPal. My only complaint is that a few times I've noticed that moving the scale around will cause the measured weight to change +-1 lb or so.",
      "rating": 4.0,
      "verified": true,
      "author": "Arjun",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Perfect fit for families and techies",
      "text": "The Withings scale is a perfect fit! Linking the scale to my Withings app was quick and painless. I love how quickly the scale reads all of my available measurements (it is unable to decipher your BMI or heart rate if your feet aren't bare). To top it all off it recognizes who is using it and if someone new steps on to the scale, the app gives you the option of registering that user and recording their journey as well. The Withings app also connects with MyFitnessPal accounts (and many other apps) to help me make correlations between my daily activities and food consumption versus weight fluctuations",
      "rating": 5.0,
      "verified": true,
      "author": "dashy",
      "helpful_votes": 0,
      "publication_date": 20131118
    },
    {
      "title": "Works fine overall.",
      "text": "Scale works and give lots of information. Only issue is that it switches from pounds to kilomiters to stones on it's own. I can change it but have given up and just wait to see what it will use next time. Could be an issue for some people. I watched it switch from pounds to kilometers while no one was touching it. It just decided to change.",
      "rating": 4.0,
      "verified": true,
      "author": "Meg Silvern",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "OK for tracking your weight, bur poor in accuracy",
      "text": "If you want to track your weight in a easy way, this is a good device. How ever it's not very accurate. I weigh myself few times in the same time, and I got different weight and fat ratio numbers up to 0.5% - 1.5% difference. I guess it's due to the way/position you stand on the scale. Besides,WiFi setup could be a little bit difficult, depending on your computers/tablets/phone. I had hard time to set up the WiFi with my win8 laptop and android tablet/phone. I end up using my wife's old win7 laptop to successfully set up the WiFi connection.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy Jeng",
      "helpful_votes": 0,
      "publication_date": 20130914
    },
    {
      "title": "Would not buy again! Failed in 4 months",
      "text": "Just an average scale. This scale worked well right out of the box in Nov. it is now March (4 months) and it will not stay connected to the app. I have tried everything. I can be standing next to the scale with the phone in my hand and get a message to check that the scale is “turned on and in proximity” ridiculous!",
      "rating": 1.0,
      "verified": true,
      "author": "Jayhawk1989",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Be mindful of issues before purchase.",
      "text": "I initially really like the product. However, the scale only last 15 months. Its a lot of money for a scale that will not calibrate properly anymore. I have done all the required updates, changed the batteries, etc. I am technologically savvy. My basic scale for the last 15 years, the one that cost 10 bucks is working properly. Its unfortunate, but i would be mindful when purchasing this scale, until they address the calibration issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160829
    },
    {
      "title": "Love it",
      "text": "Week one. I like it a lot. Don't make the mistake I made though. Set up ONE account (as the instructions say) then set up individual users and THEN make them independent. I'll update more as we get used to it and use it daily. Update: 09/28/20 4yrs and still going strong. Wifi can be a little wonky. I've had to reset it twice in 4 yrs so I'm not complaining.",
      "rating": 5.0,
      "verified": true,
      "author": "deg",
      "helpful_votes": 0,
      "publication_date": 20160605
    },
    {
      "title": "\"Just works\" once setup!",
      "text": "I love this scale. It works well. And it is frustration and hassle free once you get it setup. I would give it 5 stars, but the setup needs to be streamlined. It was difficult getting two people in the same household setup to send data to two separate accounts on our iPhones. If you want to setup multiple people on the same account, that is easy to setup. But setting up separate accounts took about an hour to get working. You'll need to setup separate accounts if you don't want to be able to see each other's data. Once setup, the scale recognizes the person and sends the data to the appropriate account automatically.",
      "rating": 4.0,
      "verified": true,
      "author": "Kurt A. Zoglmann",
      "helpful_votes": 0,
      "publication_date": 20131029
    },
    {
      "title": "Scale is actually worth the heft asking price.",
      "text": "This thing () has been review to death and I certainly don't have anything new to add. Pros: It does everything it claims and it does it well! Cons: The Withings apps are pretty awful. Their website is better, but if you're used to FitBit, you'll be disappointed on an Epic scale. The bright side is they really have no way to go but up, and I have noticed steady improvement. Leaving this as a 5star, because the scale itself earns it.",
      "rating": 5.0,
      "verified": true,
      "author": "HNP",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Bad and broken product. Avoid.",
      "text": "Broke a little after a year. When it worked, it had a terrible UI and had to constantly be re-joined to my WiFi. Ate through batteries too. The app is nice, but you don't have to own bad Withings hardware to use it. I got a cheap blood pressure monitor and scale and just enter the measurements daily. My doctor's EMR software can import my readings automatically.",
      "rating": 1.0,
      "verified": true,
      "author": "Yinon Bentor",
      "helpful_votes": 5,
      "publication_date": 20160517
    },
    {
      "title": "Good information / Should be rechargable",
      "text": "The scale itself synchs well with the apps and connects easily with an iPhone. I like the multiple user feature, and the accuracy with which it recognizes the individual users. The battery life is not great however, and for the price a charging feature would have been a better option. The heart rate sensor also seems to be finicky - it works some days and not others. Consistency and sensitivity seem to need some improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen Smith",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Great Scale for Fitness Tracking",
      "text": "This scale is perfect. I have integrated it with all of my other fitness applications on my iphone so I can track my overall health, weight, and exercise. The scale also reminds me when I am making progress or need to put a little more effort into my weight loss. I am quite pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Tea With Lia",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "It is a love hate relationship",
      "text": "It is a love hate relationship. I hate where I am, but at least I can track it. I wish profiles were a little more private, and that it could do difference measurements - so that you could hold your pet and get their weight subtracted from yours. The way pet measurements could work (if they implemented it) would be to assign an unknown weight to your pet, held by, one of the other members.",
      "rating": 5.0,
      "verified": true,
      "author": "Annette Thomas",
      "helpful_votes": 0,
      "publication_date": 20150303
    },
    {
      "title": "Junk - barley lasted a year and now won't read ...",
      "text": "Junk - barley lasted a year and now won't read fat mass or heart rate. Customer support says the only way to fix it and they are \"kind\" enough to offer a 25% discount on another one. Save yourself some trouble and buy something else. My Tanita scale lasted 10 years and was still working when I replaced it with this one. This is poorly designed to last!",
      "rating": 1.0,
      "verified": true,
      "author": "Tarek K. Dhanani",
      "helpful_votes": 0,
      "publication_date": 20151017
    },
    {
      "title": "Easy Setup, fast sync, great App!",
      "text": "This scale is by far the best I've owned - with near-instant syncing with my Withings App as well as LoseIt, it's been so easy to use. Multiple user support works quite well also. I will say the heart rate seems to not read quite well, given that I have to lift one foot to indicate which user, so when I put it back down, it's attempting to take a heart rate reading and either gets it really low or not at all. I'm not in it for the heart rate tracking, so I still really love the scale.",
      "rating": 4.0,
      "verified": true,
      "author": "MattSTKC",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "This is a great product. The minor glitch is not worth a star off.",
      "text": "This is a great product. This, the app, and a running program (RunKeeper) have been essential in helping me lose weight and to increase my average speed substantially. The only issue that I have is that, when I connect on Bluetooth and Wi-Fi, it does not stay connected. I have to do the same thing again every time that I want to connect. I would like to know how to make the connections either permanent or automatic as is the case with my BMW.",
      "rating": 5.0,
      "verified": true,
      "author": "Koernerlaw",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "Best scale ever!",
      "text": "I am extremely happy with this scale! I purchased the very first withings scale they made years back and it still works perfectly fine, however I wanted all the new features like the temperature, carbon dioxide, the forecast and the easy synchronization to the health app. Very beautiful and high-tech.... I would recommend this to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Fitness",
      "helpful_votes": 0,
      "publication_date": 20150220
    },
    {
      "title": "Amazing scale! Keeps me honest.",
      "text": "Love this scale! The only reason I give it 4 stars is because I generally feel like I have to change the batteries too often. I love love love the integration with other apps I use, especially including My Fitness Pal and Jawbone UP. Also LOVE that we can all track and integrate separately. My daughters and sister is it and it know automatically who each of us are.",
      "rating": 4.0,
      "verified": true,
      "author": "Tamika",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Bought this two years ago over the course of the ...",
      "text": "Bought this two years ago over the course of the last six months it has just kept reporting increasingly inaccurate body fat reading. It now says I'm 70% fat! That's for a 200 pound guy who does weight lifting on a regular basis.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominic Filion",
      "helpful_votes": 2,
      "publication_date": 20180320
    }
  ],
  "product_meta": {
    "title": "Withings Smart Body Analyzer, Black",
    "description": "Color:Black\n\nMANUFACTURER'S NOTICE\nThe scale interface is designed to help users center on the product to obtain accurate readings. Users who attempt to avoid accurate readings by rocking on their heels or toes will see values fluctuate.\n\nFROM THE MANUFACTURER\n\n\nSee more",
    "rating": 3.6,
    "feature_bullets": [
      "Sorry, Withings no longer provides support, updates or repairs for this product. Please visit our website for the latest product launches and news."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.8 x 12.8 x 0.9 inches; 4.4 Pounds",
      "Item model number": "WS-50",
      "Batteries": "4 AAA batteries required.",
      "Date First Available": "February 28, 2013",
      "Manufacturer": "Withings",
      "ASIN": "B00BKRQ4E8",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Medical Supplies & Equipment",
      "Home & Kitchen",
      "Health Monitors",
      "Digital",
      "Health & Household",
      "Body Weight Scales"
    ],
    "price": 90.0
  }
}