{
  "website_summaries": [
    {
      "verdict": "Handy choice when you need to use the roller over a large area or a hard-to-reach area.",
      "pros": [
        "Roller makes use of 10-inch wide strips of tape, which gives you a lot of coverage area",
        "Roll attaches to a telescoping handle that can extend to 43 inches in length",
        "Uses alternating colors in the tape layers to simplify removing sheets"
      ],
      "cons": [
        "Far more expensive than handheld-sized lint rollers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good value and essential in my household",
      "text": "A life saver for my vacuum. I have very long hair, so I go over my area rugs with this before vacuuming. The biomass of each of my hairs make my dog's fur a mere detail. In short: buy this if you have long hair and tend to shed. Your vacuum will thank you for it. Mine threw me a party just last week.",
      "rating": 5.0,
      "verified": true,
      "author": "Desert Wryter",
      "helpful_votes": 9,
      "publication_date": 20180311
    },
    {
      "title": "Total waste of money!",
      "text": "Epic fail for a product! Worst sticky roll ever made. No starting line on roll to find where to peel. Not worth paying postage for returning. Total crap. Do not waste your money on this product!",
      "rating": 1.0,
      "verified": true,
      "author": "Elisa Marathas",
      "helpful_votes": 8,
      "publication_date": 20181109
    },
    {
      "title": "Wish I could return it!",
      "text": "Once you use the roller, you have to touch the \"easy to peel\" roller with dirt, dust and hair all over it. The roller does a great job of picking all this up however I don't want to then touch it to get the next sheet ready! And it definitely is NOT \"easy to peel\". Can't find the edge to start peeling and it rips many times once you do start to peel. Very disappointed in the product and to make matters worse, it isn't eligible for return so I'm stuck with it!",
      "rating": 1.0,
      "verified": true,
      "author": "Amy P. Giguere",
      "helpful_votes": 5,
      "publication_date": 20190209
    },
    {
      "title": "Sticky but not so easy to use",
      "text": "It's a bit big and hard to peel off to the next layer of tape. It's actually kind of a hassle. Don't really love it. If i had to choose again, I would not get this one. But it does pick up things well. So it does serve its purpose~ it's just really annoying when you want to next to the next layer of tape.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180820
    },
    {
      "title": "So useful!",
      "text": "I love this mega roller to pick up hair. My husband and I shed so much hair and it's always a hassle to bring out the vacuum. This makes it easier to clean up. I also love how easy it is to peel of the outer layer of the adhesive. I find that other rollers it might rip and hard to grab. This was made to peel easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Rosanne K. Lee",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "I can't believe I spent $14.95 on this",
      "text": "This is the worst roller in the world. If each layer was a dollar bill, you'll end up throwing $5-$7 in the trash each time you peel. This product defeats its purpose, a quick clean up is now long and frustrating and requires a tool to help separate layers.",
      "rating": 1.0,
      "verified": true,
      "author": "Emma",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Disappointed",
      "text": "We have two Maine Coon cats who have very long hair and shed a great deal. We have been using Evercare roller products for several years and have been very pleased with them until now. The new \"mega\" sized roller refill sheets seem to have much less sticky power than past products. This means that we must use at least two to three sheets for every one we used in the past. We zip through a 50 sheet refill very quickly. This has become a very expensive endeavor as Evercare products are not inexpensive. We are not sure what to do moving forward.",
      "rating": 2.0,
      "verified": true,
      "author": "PLC",
      "helpful_votes": 27,
      "publication_date": 20110102
    },
    {
      "title": "If your dog sheds and you have carpet, this is for you.",
      "text": "Having long hair dachshunds, I couldn't live without this roller. This Mega Roller is very strong and picks up really well, makes my carpet look new and clean. It also cleans up crumbs and other stuff that comes in on shoes, from wood floors and tile. I have tried other options but nothing I have found works as well as this. Quick and easy cleanup!",
      "rating": 5.0,
      "verified": true,
      "author": "ExPat",
      "helpful_votes": 4,
      "publication_date": 20160720
    },
    {
      "title": "Works pretty good picking up bunny fur",
      "text": "Works pretty good picking up bunny fur. The long handle makes it easy to use on all surfaces and under furniture. The sticky tape goes edge-to-edge so it snugs right up against your baseboard, getting the fur that likes to hide from your broom and vac. I gave 4 stars because it is difficult to remove a layer of used sticky tape - wish it was perforated and easy to strip off.",
      "rating": 4.0,
      "verified": true,
      "author": "NonnieTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "If you have a shedding pet you need this!",
      "text": "A friend recommended this for cleaning pet hair off a couch. Price was good so tried it out. This thing is amazing. I use it on all furniture, rugs, stairs, everything. Picks up dog hair so easily and sheets and easy to remove.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew McFaddin",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Great Product",
      "text": "I bought this to use on small area rugs. My vacuum cleaner would pull the rug into the brush part. This is perfect for the small rugs",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth Smith",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Me=0 Mother=100",
      "text": "This is the refills for the Mega Cleaning Roller w/ 3-Foot Extendable Handle. These refills are crazy expensive but essential if you intend to continue using the system. See my review on the Cleaning Roller w/ Extendable Handle. I think it's the silliest thing in the world- my mother thinks it's the best thing created since sliced bread. Buy them now as I can't imagine this whole system will be around forever. As far as the \"pet\" labeling...that's called marketing- it's a lint roller. Enjoy!!",
      "rating": 3.0,
      "verified": true,
      "author": "Music Man",
      "helpful_votes": 2,
      "publication_date": 20140726
    },
    {
      "title": "Not enough strips.",
      "text": "You can go thru 25 sticky strips in no time. Extra refills cost a lot. But it does pick everything up",
      "rating": 3.0,
      "verified": true,
      "author": "Reba's Mom",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Perfect for shedding pet hair!",
      "text": "Fantastic for pet hair and lint! You can't beat it for shedding animals! Only challenge was figuring out how to tear off the sheet for a new one. It comes off in a spiral not like the sheets of a hand held lint roller. Sheets are extremely sticky, just what I was looking for!",
      "rating": 5.0,
      "verified": true,
      "author": "DEBRA EBERITZSCH",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Evercare Large Surface Mega Roller - not worth the price",
      "text": "This is not worth the price. Does not pick up dog or people hair very well. Sticky pads are difficult to remove when you are finished using it. Like a giant lint roller for your clothes, but doesn't work as well.",
      "rating": 1.0,
      "verified": true,
      "author": "V Annette Spandrio",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Works good , but...",
      "text": "Taking off the used paper is super hard to do.. it ends up wasting a lot of new paper.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "not vertically like the handheld version",
      "text": "This is fabulous. I use it to clean under furniture where my vacuum cannot fit. It can be used in tight spaces between the wall and furniture. Just press down if there isn't room to roll. Remember that the used sheets tear off diagonally, not vertically like the handheld version.",
      "rating": 5.0,
      "verified": true,
      "author": "IfixuriMD",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "How this product aids people with disabilities to keep up their housefeeping",
      "text": "I have a bad back and using the lightweight wide mega roller is a very great help.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "It works.",
      "text": "It's exactly like a paint roller only has a sticky surface. I was able to get the dust off of my carpet out from under my bed, which is too heavy for me to move, and my vacuum would not reach. I can't afford a new vacuum with that feature so I went this route, and it works. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Legomaniac",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Could Be Better",
      "text": "I am writing this review in hope that Evercare has an employee reading Amazon reviews. I find it very difficult to locate the appropriate place to begin removing the previous sheet. This is time consuming and unnecessary. I consider it a serious product fault and hope it will be corrected in previous versions of this roller. I would also ask whether this roller provides the extra-sticky pet roller sheets. this would also be a great improvement..",
      "rating": 2.0,
      "verified": true,
      "author": "Connecticut Grandmother",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Good product, could use design improvement.",
      "text": "I like this product overall. It works nice that it's big and I can lint roll my carpets with it. It's also really sticky so it picks up a lot. However the only problem I have with it is how the sticky sheet are shaped. When you peel off a sheet it comes off like in a curvy fashion. This makes it difficult to get the whole sheet off and also it makes it so long hairs get stuck to the next clean sheet you're trying to reveal. It should just be a straight tear and I think it would be improved.",
      "rating": 4.0,
      "verified": true,
      "author": "Nora gehin",
      "helpful_votes": 0,
      "publication_date": 20160924
    },
    {
      "title": "Not bad",
      "text": "Very odd to remove each paper when dirty. The new paper below gets dirty as well when you're using the first one. Great idea but needs improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "Neenah",
      "helpful_votes": 0,
      "publication_date": 20180825
    },
    {
      "title": "Decent.",
      "text": "The base comes loose easily and has to be retightened a lot when using. Picks up a decent amount of hair but it gets filled up pretty quickly and is so yucky to remove, especially when I can’t seem to find the right corner to pull to release.",
      "rating": 3.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "good product",
      "text": "too expensive and a little difficult to peel off or change sticky sheets otherwise good product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Great product",
      "text": "Love this (used with the long handled device) - handy for just about everything on the carpet!",
      "rating": 5.0,
      "verified": true,
      "author": "thinktwice",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "BiG iS BeTTeR",
      "text": "TheSe STiCKY RoLLS R AWeSoMe!!! I HaVe a LoNG STiCK 4 THeM To uSe LiKe a BRooM...i HaVe a WHiTe PoMeRaNiaN iN a PReDoMiNaTeLY BLaCK HouSe & THeSe CoMe iN VeRY HaNDY iN BeTWeeN VaCuuMiNG...THeY R a LiTTLe DiFFiCuLT To PuLL aPaRT So i uSe a oLd SCHooL MeTaL NaiL FiLe To SePaRaTe eM...oTHeR THaN THaT THeY MaKe THe DoG HaiR SiTuaTioN and CRuMBs & DuST a BreeZe...i uSe eM oN ouR BeD tOo ;)",
      "rating": 5.0,
      "verified": true,
      "author": "💜ALiSiN💜",
      "helpful_votes": 0,
      "publication_date": 20140908
    },
    {
      "title": "Gah!  So great!  And I love the swirl!!!",
      "text": "I absolutely LOVE this roller!! The refills are the same as what's on the original, which means they work like a charm. With a dog and two cats, I can't have enough jumbo hair rollers!!! I know some people have an issue with the swirl removal design, but I LOVE it! It's soooo much easier and you're never left with a partial tear or it trying to hang on at the end. LOVE the swirl!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Hayward",
      "helpful_votes": 0,
      "publication_date": 20140330
    },
    {
      "title": "... these as a gift a few years ago and loved it so much I bought this new one to ...",
      "text": "I received one of these as a gift a few years ago and loved it so much I bought this new one to give someone else. They are light weight and really do the job picking up cat hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Ellen Maryland",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "hate that I need this thing",
      "text": "I hate even more than I have not seen this particular brand in any store for over 6 months. I had to resort to buying it online. But I got it on the weekend. That was pretty awesome. Oh and I like it because I really have no other way to remove my hair and my dog's fur from stuff. So, I merely need it. Don't really enjoy having it.",
      "rating": 4.0,
      "verified": true,
      "author": "KhouriTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "Great finisher",
      "text": "I am a property manager, so I know how important it is to have a unit spotless This thing picks up any kind of hair or debris a vacuum missed.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Thankful for This Product",
      "text": "The perfect solution for having a clean carpet/floor and any other surface you want to roll it on. So thankful that these are available to keep my Evercare Mega Cleaning Roller with 3-Foot Extendable handle in operation . Great product. Great back saver. Great cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat O",
      "helpful_votes": 0,
      "publication_date": 20151213
    },
    {
      "title": "Wish it was made more sturdy",
      "text": "It broke from the roller to the rod, after two weeks of use. Great idea, just poor construction",
      "rating": 3.0,
      "verified": true,
      "author": "Kristi Gonzales",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Yes, yes, yes to Mega Roller!",
      "text": "Dear Mega Pet Roller... Yes I love you. You pick up everything. Hair, dirt, bird detritus, bits of whatever is filling my life. Sure, peeling off your layers is super gross, but that was stuff on my floor so I can't be that freaked out. Seriously, you get everything off my floors. Don't use on carpet. Bad idea.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss Kerbin",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "Luv these.  Still looking for a strong version.",
      "text": "I've been using these for 3 years at our vacation rental. After we've had pets as guests, we use these on the carpets. It's amazing how much hair and stuff these pick up even after an extensive vacuum. We go thru a lot of them. I'd like a commercial grade version and one 18 inches wide so I send less time rolling the carpets.",
      "rating": 5.0,
      "verified": true,
      "author": "Md95062",
      "helpful_votes": 0,
      "publication_date": 20130615
    },
    {
      "title": "Love this item!",
      "text": "I love this item. I had 1 previous and when we broke it immediately ordered another. We had the first one for several years!",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "We don't have any pets at the moment, but ...",
      "text": "We don't have any pets at the moment, but the humans in our household shed as much hair as my old Brittany Spaniel. This roller picks up what the vacuum cleaner misses without the noise.",
      "rating": 5.0,
      "verified": true,
      "author": "StudioVRM",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Pain to remove used roller sheets",
      "text": "Maybe I'm missing something but it is an amazing pain to remove a used sheet from the roller. Almost not worth the effort. Won't buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Randolph",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Bumpy roller",
      "text": "Product is bumpy so it doesn’t roll smoothly. Layers are stuck together, so more than one comes off when trying to get to new sheet.",
      "rating": 3.0,
      "verified": true,
      "author": "JoAnn Garza",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "You Need These if you Purchase the Evercare Mega Roller",
      "text": "If you are buying the Evercare Mega Cleaning Roller--you need to purchase these. With every cleaning--you will use at least one sheet, if not more. I always like to have this refill on hand. I use my Roller a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "M. C.  Hart",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "Super STICKY",
      "text": "I LOVE this !!! Its super sticky and picks up all my cats hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Great for the beach!",
      "text": "I use this at my beach home and it does a great job picking up the sand.",
      "rating": 5.0,
      "verified": true,
      "author": "Michele Leach",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Evercare Large surface pet roller refill",
      "text": "I found this once at our local Target store but was unable to purchase the refill. I have a white colored lab who sleeps on our bed. Every morning I use this roller it's perfect size to remove pet hair in large areas. Shipped promptly. I will reorder again..",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Fez",
      "helpful_votes": 0,
      "publication_date": 20130221
    },
    {
      "title": "Excellent product for what it was hired to do. I wish it had more sheets per roll",
      "text": "Very simple and convenient. 5 stars if there were more sheets per roll.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris Powell",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great item compared to others!",
      "text": "We use these a lot. The picture is poor quality - does not accurately depict the large size of the roller. We use this vs. many different types of rollers for pet hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie W Payne",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Great for pet hair!",
      "text": "This works really well, Just like your regular pet roller, but for the floor. We use it on our bjj mats after we sweep and it really gets all of the leftover hair up. Glad we got this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20150302
    },
    {
      "title": "Life savers",
      "text": "I have an extremely hairy cat. He leaves hair everywhere. I've had several cats before both long hair and short hair and none were as bad as this one. These have been life savers.",
      "rating": 4.0,
      "verified": true,
      "author": "Janelle",
      "helpful_votes": 0,
      "publication_date": 20150412
    },
    {
      "title": "No headline to enter",
      "text": "It broke within 2 weeks. The one that I had Before this one lasted a few years.",
      "rating": 1.0,
      "verified": true,
      "author": "Joanne Allen",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great for picking up stuborn animal hair",
      "text": "My animals shed like crazy and this product works very well in helping keep my house clean. I've used it on the couch and bedding to lift animal hair. It's the best roller I've used to date. I'll definitely buy these again.",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda Gillis",
      "helpful_votes": 0,
      "publication_date": 20140722
    },
    {
      "title": "I've used these before and they work great.",
      "text": "I have two older house cats and our male is a longhaired Siamese....he sheds like he has downy fur! I use the pet roller on furniture, clothes and the bedcovers. This product does the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah D Adams",
      "helpful_votes": 0,
      "publication_date": 20140525
    },
    {
      "title": "Great for pet hair",
      "text": "Love this for picking up what my Shark vacuum cleaner and daily Roomba misses. It's quality and not think masking tape.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Bledsoe",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Perfect with animals",
      "text": "We have 2 cats and this is perfect for picking up cat hsir",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanette Long",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Best option for cat hair control",
      "text": "I've used many things to manage cat hair all over the place. I always come back to this item for size and effectiveness.",
      "rating": 5.0,
      "verified": true,
      "author": "DMB",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "Love it!",
      "text": "Could not do without these. I vacuum and follow up using this on the area rug to clean up the American Eskimo fur every day, sometimes twice. Life saver!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Appleby",
      "helpful_votes": 0,
      "publication_date": 20150319
    },
    {
      "title": "I love these, I use for the small rugs and ...",
      "text": "I love these, I use for the small rugs and the one small patch of carpet I have in the exercise room. It makes my life so much easier. I hate to vacuum and these are just the ticket!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Harmon",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "Refills are great",
      "text": "These are a must for the mega roller tool! They pick up everything from grass to animal fur!!! They are getting harder and harder to find in retail stores!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Starlyshopalot",
      "helpful_votes": 0,
      "publication_date": 20140625
    },
    {
      "title": "Great Buy!",
      "text": "I bought this refill when I got the roller. I will buy more. The sheets are easy to peel. Had no problems. It really works great on carpet and furniture. Must have if you have pets!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20110830
    },
    {
      "title": "Sticky sheets",
      "text": "i like it. just the size I needed. It is like taking a sticky paper sized sheet to your lint covered items.",
      "rating": 4.0,
      "verified": true,
      "author": "Orrajan Adnerb",
      "helpful_votes": 0,
      "publication_date": 20150616
    },
    {
      "title": "Great for pet hair pick up!",
      "text": "Love love these! Have a small dog and use these in my bath and in my bed to pick up pet hair. They are wonderful anywhere a vacuum won't quite do the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Dreamgirl95",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "Great",
      "text": "This is great for picking up feathers from my parakeet! No need to sweep every day now. Any bird owner should have these.",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy A  Barber Doyle",
      "helpful_votes": 0,
      "publication_date": 20140529
    },
    {
      "title": "Great price.",
      "text": "Use these all the time since my dog sheds year round. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "leeker",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Buy LoLa products,,, instead.",
      "text": "sheets tear unevenly, does not fit the roller that amazon advertised this with.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer A. Jamison",
      "helpful_votes": 0,
      "publication_date": 20150715
    },
    {
      "title": "Four Stars",
      "text": "really hard to rip off the old paper for a new one.",
      "rating": 4.0,
      "verified": true,
      "author": "Sue Moss",
      "helpful_votes": 0,
      "publication_date": 20151116
    },
    {
      "title": "Great product",
      "text": "I love this roller refill. It picks up cat hair and cat litter with no problem. I am so glad that I bought it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20130806
    },
    {
      "title": "Love love love these.",
      "text": "I love these lint rollers. I use it once a week on the couch and area rugs to pick up dog hair the vacuum leaves behind.",
      "rating": 5.0,
      "verified": true,
      "author": "olivia colon",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Great",
      "text": "I highly recommend this product if you have a pet. We couldn't live without this item since we have a dog and a cat.",
      "rating": 5.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "Five Stars",
      "text": "Have a shedding cat and this is the bomb for using on floors prior to vacuuming.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Cross",
      "helpful_votes": 0,
      "publication_date": 20150317
    },
    {
      "title": "ok",
      "text": "I thought I would love this to get the cat fur off the couch its not easy to peel the paper off to use again",
      "rating": 3.0,
      "verified": true,
      "author": "Joilanda Cosby",
      "helpful_votes": 0,
      "publication_date": 20130417
    },
    {
      "title": "Have one that we used and need another one",
      "text": "Like for use on floor and it does a great job and easy to use, will be buying more in time.",
      "rating": 5.0,
      "verified": true,
      "author": "4723",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "... evercare large surface mega pet roller refill is a fine product.",
      "text": "The evercare large surface mega pet roller refill is a fine product.",
      "rating": 5.0,
      "verified": true,
      "author": "JMcG",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "What a Fabulous Invention!",
      "text": "After my 2 year old finishes playing out in the grass, this roller cuts my cleanup time in half! I'll be back for more.",
      "rating": 5.0,
      "verified": true,
      "author": "Marlyss S.",
      "helpful_votes": 0,
      "publication_date": 20140418
    },
    {
      "title": "great product",
      "text": "This is a great product for anyone who has a cat that sheds every week. It is the best way to get rid of cats hair.",
      "rating": 5.0,
      "verified": true,
      "author": "jay kanter",
      "helpful_votes": 0,
      "publication_date": 20140511
    },
    {
      "title": "Five Stars",
      "text": "Best sticky pad I have found. Threw away the vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "RichardAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Evercare Mega Roller",
      "text": "I've bought these Evercare big rollers at Walmart for a while and really liked them for picking up cat hair. They work better than a vacuum cleaner. Walmart quit carrying them so I went to Amazon and like always I found what I needed. The ones I received have more sheets and actually ended up costing me less...even after shipping charges...than buying them at Walmart. I will definitly buy them again from this supplier. Delivery was right on time and I am well pleased....ct from Texas.",
      "rating": 5.0,
      "verified": true,
      "author": "ct",
      "helpful_votes": 0,
      "publication_date": 20110529
    },
    {
      "title": "Great product. I am very well please with the ...",
      "text": "Great product. I am very well please with the way it picks up everything, especially cat hair. That's what I purchased it for and also to pick up threads from my carpet where I sew. I also bought a long handle so I would not have to bend over to roll it. Thanks Evercare!",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy Allen",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "Four Stars",
      "text": "I like this for the car and quick clean up",
      "rating": 4.0,
      "verified": true,
      "author": "Marilyn Crumbliss",
      "helpful_votes": 0,
      "publication_date": 20141012
    },
    {
      "title": "Review for Evercare Large Surface Pet Roller Refill",
      "text": "I would recommend this product to anyone bored with the smaller lint removers first of all. Secondly, it's a great product for larger areas like sofas and chairs ESPECIALLY if you have animals. Small lint removers are good too. The only problem I found is that I couldn't find the refills at local pet stores.",
      "rating": 5.0,
      "verified": true,
      "author": "linda feder",
      "helpful_votes": 0,
      "publication_date": 20140113
    },
    {
      "title": "they are fine for very small areas",
      "text": "they are fine for very small areas. hard to get the full piece off of the roll and fills up very fast. i can say i do like the no bending and easy to roll and get what i need picked up.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170505
    },
    {
      "title": "If you have long hair...",
      "text": "This works well mostly. But you will get long hair twisted around the end that you will need to cut away frequently. Removed a star for the bad design at that location. But I am happy to not be lugging a vacuum cleaner around for a quick cleanup.",
      "rating": 4.0,
      "verified": true,
      "author": "V. Jackson",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Fabulous!",
      "text": "This works so well across any large surface, like the back seat in the car, on a bedspread, and it's great on the kitchen and hardwood floor, AND works well on carpeting. With this, I don't have to vacuum quite as much! A must have!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Spencer",
      "helpful_votes": 0,
      "publication_date": 20131221
    },
    {
      "title": "Works Great!",
      "text": "I currently own 4 dogs and 3 cats. I bought these to do my carpeted stairs with after vacuuming. They work great to get any remaining animal hair that you don't always see.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky Jane Johnston",
      "helpful_votes": 0,
      "publication_date": 20130204
    },
    {
      "title": "Great Idea! But Roller is hard to peel.",
      "text": "This works; however, I can't find the way to peel to get to the next layer. I took a knife to it and was incredibly frustrated! Why it can't be like regular rollers for lint is beyond me. They taper towards a triangle..Bad design.",
      "rating": 1.0,
      "verified": true,
      "author": "Nutragirl",
      "helpful_votes": 3,
      "publication_date": 20130908
    },
    {
      "title": "Three Stars",
      "text": "pr0duct hard to tear off to start a new sheet,sheets don't last long.",
      "rating": 3.0,
      "verified": true,
      "author": "BRIAN FEENEY",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Cat and Sewing room must",
      "text": "Between the cat hair and the strings and scraps on the sewing room floor this is a real time saver. It also picks up pins and needles before they get stuck in the carpeting.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda Campbell",
      "helpful_votes": 0,
      "publication_date": 20130920
    },
    {
      "title": "GREAT PRODUCT",
      "text": "This product is reat at picking up dog hair. I use it all the time on my daughter`s bed. Saves me time allowing me more time todo other house chores.",
      "rating": 5.0,
      "verified": true,
      "author": "AMELIA",
      "helpful_votes": 0,
      "publication_date": 20130219
    },
    {
      "title": "Great item and fast supplier",
      "text": "Great item and the best for dog and cat hair. It is fast and easy because it is so big.",
      "rating": 5.0,
      "verified": true,
      "author": "Jazzy Blue",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Have been using this product for years and all of ...",
      "text": "Have been using this product for years and all of a sudden it disappeared locally...so thank you so much for still carrying it",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Perry",
      "helpful_votes": 0,
      "publication_date": 20141026
    },
    {
      "title": "great quick fix",
      "text": "Very good lift but had heard time with stuck on hair...",
      "rating": 4.0,
      "verified": true,
      "author": "Mariah McLead",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "very satisfied",
      "text": "very satisfied and will buy this product again. The only thing that I don't like would be that there are not enough sheets on the roller",
      "rating": 4.0,
      "verified": true,
      "author": "Kathy Wiles",
      "helpful_votes": 0,
      "publication_date": 20140222
    },
    {
      "title": "When your floors need a fresh look in a hurry.",
      "text": "I have been looking for this refill for the past year or so. It is great when floors and carpet need a quick pick- up.",
      "rating": 5.0,
      "verified": true,
      "author": "joan HOLLAND",
      "helpful_votes": 0,
      "publication_date": 20140501
    },
    {
      "title": "like to clean up pet hair",
      "text": "but it is hard to start to take of used paper ! Ore is there a trick to it ??",
      "rating": 4.0,
      "verified": true,
      "author": "L.A.Lacey Dolls",
      "helpful_votes": 0,
      "publication_date": 20140415
    },
    {
      "title": "Excellent",
      "text": "works great. 18 more words required so I have to blab on about nothing until five four three two one",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20130313
    },
    {
      "title": "Not worth the money",
      "text": "The item broke the first time I used it... I pretty positive it was partly broken when it was delivered",
      "rating": 1.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "BEST PURCHASE EVER.",
      "text": "I have 1 cat, 1 dog and a black area rug...so you can imagine how many times a day I vacuum when I can't stand the hair. This thing is literally one of the best purchases I have EVER made 😆 So serious...it's so nice not to have to get on my hands and knees to use a small roller on my rug. Already purchased more refills because I use it so much. HIGHLY recommended for anyone with pets 🙌 I've used it on the tile in my bathroom also. If you've been thinking about buying one of these...just do it. It's definitely worth it :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20170401
    },
    {
      "title": "Great for my vacation rental cabin",
      "text": "I own a vacation rental cabin. We occasionally host guests that bring their dogs and I wanted something to help clean the dog hairs off furniture and bedding. The extra-wide lint roller works really well and is easy to peel off to get to the next layer. I was so impressed with the adhesive roller that I bought the same brand in the small size for our personal use. The long pole allows us to easily roll across the top of a king bed, picking up bits of lint/hair that I hadn't even seen. My housekeeper was so impressed with it that she bought one to use in some of the other homes she cleans. Definitely recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Shinnick",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "a must with dogs",
      "text": "I have two dogs (husky coats) and a long hair cat. Needless to say I live under a layer of pet hair. I'm always embarrassed when people come over and sit on my couch, then stand up covered in pet hair. These large rollers keep my couch hair free! Lets' be honest, amount of hair is reduced greatly not gone 100%. But I no longer have to be embarrassed to have people sit on my couch and I can sit wearing black.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Perfection! Dog hair removal in seconds!",
      "text": "Friggin awesome! I kept re-washing a king size quilt on our bed because our dog sheds and I can’t breathe! Bought this gem and I roll it on at night... de-fur our blankets and sheets in seconds... and bam! No dog hair and I’m breathing. Also ... I was going insane washing the sheets and quilt every other day. This takes the crazy out of sleeping in a bed near any dog. Super sticky. I’m sold!",
      "rating": 5.0,
      "verified": true,
      "author": "Sa & Ry",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "This is awesome!!! Cleans more than pretty hair.",
      "text": "Not only does it clean up pet hair easily, we recently used it for a \"glitter mop\". Glitter was accidentally dropped on the floor and this fabulous roller cleaned it all up! It even got glitter off of an area rug! We like it so much that we just ordered refills.",
      "rating": 5.0,
      "verified": true,
      "author": "geekmommy",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "OK Product",
      "text": "Works well but will be expensive when you add in all the refills. It takes 2 sheets just to do my short runner rug in the living room. Of course I guess it would also depend on how much you use it and what you use it for.",
      "rating": 3.0,
      "verified": true,
      "author": "Suzy",
      "helpful_votes": 4,
      "publication_date": 20170424
    },
    {
      "title": "Just what the doctor ordered!!",
      "text": "I have three cats, so this was a blessing in disguise. The extra width makes the hair removal on furniture a breeze. If there is a lot of hair, I use my silicone brush first, then finish up with the roller. Does a great job!",
      "rating": 5.0,
      "verified": true,
      "author": "GHBRN",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Multifunctional",
      "text": "Works on many different surfaces and comes in handy quite often. A bit pricey, so that i always buy a few at the very least. Still, i have been using these for years, with no issues and i highly recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "Truer Reviewer 2019",
      "helpful_votes": 0,
      "publication_date": 20191031
    }
  ],
  "product_meta": {
    "title": "Evercare Large Surface Mega Roller with Expandable Pole, pack of 1",
    "description": "Style Name:RollerThe evercare large surface Mega Roller features a 10-inch wide Roller and expandable pole to quickly and effectively remove debris from furniture, bedding, stairs, rugs and more. This roller includes 25 sheets of alternating green and white colored layers for easy peeling. Save time and skip the vacuum! Additional refills available (model 617127).",
    "rating": 4.3,
    "feature_bullets": [
      "10\" Wide Roller surface coverage with 25 sheets",
      "Features expandable pole for easy Reaching",
      "Quickly remove debris from furniture, stairs, rugs and more",
      "Extra sticky tape to pick everything up!",
      "Pole comes with a 5 year Warranty"
    ],
    "specifications": {
      "Product Dimensions": "2.5 x 7.24 x 13.2 inches",
      "Item Weight": "1 pounds",
      "Manufacturer": "Butler",
      "ASIN": "B00BSE86RG",
      "Item model number": "617128",
      "Customer Reviews": "4.3 out of 5 stars337 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#15,029 in Pet Supplies",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Batteries Required": "No",
      "Included Components": "Lint roller"
    },
    "categories": [
      "Dogs",
      "Home & Kitchen",
      "Hair Removal Mitts & Rollers",
      "Grooming",
      "Pet Supplies"
    ],
    "price": 22.06
  }
}