{
  "website_summaries": [
    {
      "verdict": "The Teva Minam river sandal received a lot of positive points from outdoorsy people. They particularly commended its comfortable assembly, snug fit, and laudable traction. However, others were displeased with how the upper’s padding caused skin chafing. All things considered, the Teva Minam is still a worthy choice for day hikers who prioritize comfort and fit above all.",
      "pros": [
        "An overwhelming number of Teva Minam users appreciated how comfy the sandals were",
        "The majority applauded the gear’s glove-like fit",
        "Its sturdy build exceeded the expectations of many adventurers",
        "This hiking sandal’s grip on wet and dry surfaces was commendable, according to several consumer reviews",
        "A few buyers spoke positively about its dependable arch support",
        "Several outdoor enthusiasts reported that the Minam dried quickly after being exposed to water",
        "This Teva product didn’t need a lot of break-in time, as mentioned by a couple of purchasers"
      ],
      "cons": [
        "A handful of owners disliked how the upper material caused skin irritation when the sandal was worn",
        "A lone user was annoyed when the Teva Minam’s pull tab constantly comes in contact with the heel"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": 9.8,
      "source": "runrepeat"
    }
  ],
  "customer_reviews": [
    {
      "title": "Very Disappointed with the company CHERNYAK",
      "text": "I would never buy from the Chernyak Co.again.. The above Teva waterproof sandal was bought August 29, 2018. The sandal strap broke which I believe the shoe is defective. The store I purchased these from refuse to repair or replace the sandal. Teva’s are sturdy built. This should not have happened. The supplier should return these to the manufacturer and replace the sandal. I’m very disappointed in the way they handled this complaint.",
      "rating": 1.0,
      "verified": true,
      "author": "Sandra R. Hope",
      "helpful_votes": 7,
      "publication_date": 20190419
    },
    {
      "title": "Only one complaint.",
      "text": "So these fit wonderfully, I modified mine, took some soft leather and custom made my own insole or footbed. Feels better than man made material. The front buckle on the comfort adjustment does have a tendency to put some uncomfortable pressure on your big toe if worn tightly.",
      "rating": 4.0,
      "verified": true,
      "author": "Arson Montoya",
      "helpful_votes": 3,
      "publication_date": 20180710
    },
    {
      "title": "Ok, not Great.",
      "text": "These shoes are the same as I purchased 5 years ago. This new part seems to have cheaper materials used to make them. I will not buy anymore Teva sandals until I see them in person.",
      "rating": 3.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 3,
      "publication_date": 20200114
    },
    {
      "title": "A bit small and hard to put on.",
      "text": "I should have ordered the exact same model that I bought two years ago. These don't fit right no matter how I adjust them. Also, they are hard to get onto my feet no matter how much I loosen the straps. Not sure I want to jump through the hoops to return them, so I already ordered a pair of the ones I'm sure I like. Oh well, lesson learned.",
      "rating": 2.0,
      "verified": true,
      "author": "ronmon",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Did My Feet Grow?",
      "text": "This is the second pair of Teva sandals, of this style, that I have owned. They seem to be high quality, but this pair (size 12) is shorter than the last pair (size 11.5) they are replacing. I'm not sure if the sizing is running smaller now (my old ones are at least 5 years old) or these were just mismarked. Whatever the case, be aware that they may run smaller than expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Bassman",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Reasonable price, very durable, fits perfectly",
      "text": "These things are very comfortable, and seem to last forever. I started out just wearing them around the house, out to the store, etc. Then I started wearing them to bicycle (I put in about 75-100 miles per week) - great. Now I wear them for just about anything that I can get away with - church, relatives' houses, restaurants, etc. As a matter of fact, this is my 2nd pair. Nothing was wrong with the first pair, they are just a little beat up from the biking.... Now I have dedicated the first pair to biking only, and wear the new pair for \"nicer\" outings. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim D.",
      "helpful_votes": 0,
      "publication_date": 20200926
    },
    {
      "title": "Great sandal, great support, great quality, just fix the big toe pad at the strap.",
      "text": "I love Teva sandals! The only thing I would change, and this is the Only reason for 4 stars, is because of the big toe pad. It needs to be longer and/or larger. The strap rubs my big toe because the pad gets turned under.",
      "rating": 4.0,
      "verified": true,
      "author": "path501",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "The best sandal Teva makes, if you're asking me",
      "text": "And you're reading my review, so you might as well be. This is the best sandal Teva makes, I think so because it's got great arch support, the straps are the perfect width to keep it on your foot, especially in water, without the straps cutting into your foot. These are my typical daily wear for about 7 months out of a year, and I replace them every year. I like these a lot.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Bagley",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Minam Sandals are good",
      "text": "This is my 2nd pair of Minam sandals. The first pair lasted about 4 years with regular wear. The fitting guide works well and resulted in a perfect fit for me. I have wide feet so fit was very important to me. The sandals are sturdy and can be adjusted to the foot as one might expect. Although the price is high for sandals, the quality of construction is excellent in my opinion. I would happily recommend them to others.",
      "rating": 5.0,
      "verified": true,
      "author": "skilly'sfolly",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "I love these sandals!",
      "text": "This is my third pair, same make and model. The fit like a glove. Actually, they fit better than my gloves. Durable in the ocean, sand or around town.",
      "rating": 5.0,
      "verified": true,
      "author": "John L.",
      "helpful_votes": 2,
      "publication_date": 20180402
    },
    {
      "title": "Best sandals I've ever owned!",
      "text": "These are the only \"sandals\" I have not given away. I have high arches and with my podiatrist inserts in my shoes, i have ordered 2 more for storage when they wear out. The best for high orthodics. I highly recommend these for anyone with this, not moderate or flat footed. I hike all over the woods, beaches and all over the world, they are the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark G",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "Excellent quality and very comfortable",
      "text": "These are the type of sandals you can wear without socks and being very comfortable and tried all kinds of terrain. Also great for a long periods of standing I had no issues with knee or hip pain",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good sandals, but a little pricey.",
      "text": "I like the Teva sandals because they have 3 adjustment straps, so you can get a good fit. They are a little pricey for \"just sandals\", but they usually last quite a while and are well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "nice looking sandals but front strap is painful and they smell like rubber",
      "text": "I love the look. What I hate is the rubber smell that doesn't go away and the front strap is absolutely painful on the top of my foot. Again, great looking sandal just smelly and painful.",
      "rating": 1.0,
      "verified": true,
      "author": "Ross",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Worth every penny",
      "text": "These are the best ever. We bought my husbands first pair in New Orleans in 2013 and the back strap just wore out. 7 years is good for a sandle thy is worn daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Dara Tyler",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "He expects they will be perfect for lake fishing and getting the inflatable boat launched ...",
      "text": "These are actually a present but I had him try them on so I’d have time to get something else if I had to. They fit well after ordering down half size as others suggested. He expects they will be perfect for lake fishing and getting the inflatable boat launched without slipping.",
      "rating": 5.0,
      "verified": true,
      "author": "Reader1",
      "helpful_votes": 0,
      "publication_date": 20171218
    },
    {
      "title": "TEVA Minam Sandals",
      "text": "This is my third pair which I wear every day during the summer. They are worn in my home, or outside. They are cool like other open toe sandals, and have proven to hold up well. I don't use them for long walks or hikes preferring something with a more secure fit. However, I wear them under normal activity every day. This their pair just arrived this week, and I am wearing them now. Good pricing through Amazon, and quick delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe C.",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Nice but smells like plastic",
      "text": "iv'e had them for two weeks and cant get rid of the plastic smell. iv'e left them outside for a couple of days and they still smell. i can be at work all day get home open the door and smell them in the whole house.",
      "rating": 3.0,
      "verified": true,
      "author": "richard bertino",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Teva's are very comfortable",
      "text": "I wore my first pair out and got a second pair. These are the most comfortable brand of sandal on the market for men. I'll always have a pair of Teva sandals.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Great Sandle",
      "text": "This is the second pair that I've had if this sandle. Great fit, comfortable, would buy again. (Dog at the first pair they had lasted over 4 years)",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Wilson",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Good customer support",
      "text": "Had ligament pain on my right foot after 3 months of use. The company/seller refunded me despite being out of the return policy. Customer support was excellent. Product was not made in China, I believe it was made in Vietnam.",
      "rating": 4.0,
      "verified": true,
      "author": "happyman",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Usual Excellent Teva Quality",
      "text": "Have owned Teva sandals before and this pair shares same fit and quality of materials as them!",
      "rating": 4.0,
      "verified": true,
      "author": "John H. formerly of La Grange, IL",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Good value",
      "text": "This is my second pair of Teva’s; love them! Not cheap, but more than your money’s worth.",
      "rating": 5.0,
      "verified": true,
      "author": "Nutman3",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Excellent Value, If A LIttle Overpriced.",
      "text": "This is my 4th set of Tevas. Superior quality and great fit. Maybe a little expensive but you get what you pay for. The biggest problem i have with the older ones is the Velcro weakens with age to the point where the straps will not hold. I hope thy have improved that aspect.",
      "rating": 5.0,
      "verified": true,
      "author": "James A. Mercer",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Best Tevas I've ever had.",
      "text": "Best Tevas I've ever bought Excellent quality soles. Great support and good traction",
      "rating": 5.0,
      "verified": true,
      "author": "School Of Body Arts LLC",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Nice Sandals",
      "text": "Quite satisfactory in all respects except more expensive than comparable items.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan M. Ruben",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Comfortable, long lasting and effective anti-microbial",
      "text": "This is the second pair I have owned. I loved the first pair that lasted a long time (and I still use, but the antimicrobial seems to have depleted). Haven't had a chance to break these in yet, but don't anticipate any issues based on my previous purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "Good water shoes",
      "text": "Use them to kayak in regularly. Good fit and value.",
      "rating": 5.0,
      "verified": true,
      "author": "Warsaw Wizard",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Very Comfortable",
      "text": "These sandals are very comfortable. I don't normally wear sandals so was pleasantly surprised at the comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Novotny",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Quality not what it used to be.",
      "text": "It was a nice sandal, but broke way to soon for the money",
      "rating": 1.0,
      "verified": true,
      "author": "James",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Materials were not as expected",
      "text": "My husband had me order these because the description indicated the straps were leather. They are not. He might have kept them anyway if they hadn't been too small.",
      "rating": 3.0,
      "verified": true,
      "author": "justfitz",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Four Stars",
      "text": "straps do not extend long enough they just barely fasten",
      "rating": 4.0,
      "verified": true,
      "author": "Jan Munly",
      "helpful_votes": 0,
      "publication_date": 20170615
    },
    {
      "title": "My do all sandal",
      "text": "I really like these sandals! My girlfriend had a pair and kept talking about how good they were. So she bought me a pair to try. Like them so much, i bought both my kids a pair. Very comfortable, hold tight on your feet even when wet, and look good. I were them all the time. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Hull",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Great qualty",
      "text": "This my 2nd pair 1st pair lasted years of heavy use this the best sandel",
      "rating": 5.0,
      "verified": true,
      "author": "gary bennett",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Teva sandals are the best",
      "text": "Teva has always been top 'o the line in my opinion. Sole gives excellent support yet comfortably flexes. Very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "00000",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Good, nice arch support.",
      "text": "Overall work well. Would like a full pad all under the strap not to have a blister under the strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeff Dils",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "My husband loves these. He says they are really ...",
      "text": "My husband loves these. He says they are really, really comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Pooder",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Disappointed",
      "text": "I’ve worn Tevas for 20 years, these were the first to let me down. The straps frayed after six months and then torn where they attached to the sole.",
      "rating": 2.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Comfortable!",
      "text": "My husband loves these Texas! They are so comfortable. He took them on a trip to the Grand Canyon. They were new but didn’t cause any blisters!",
      "rating": 5.0,
      "verified": true,
      "author": "Cools",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Great quality and durability",
      "text": "I buy a pair of Tevas every couple of years and get great use out of them. I wouldn't hesitate to buy these.",
      "rating": 5.0,
      "verified": true,
      "author": "Dead Mike",
      "helpful_votes": 0,
      "publication_date": 20180223
    },
    {
      "title": "Great buy!",
      "text": "Well made not cheap like Wall Mart. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Not as good as Taochi but not bad",
      "text": "not a bad sandal was looking for a Taochi but this one will do",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Great product!!",
      "text": "My third pair of these over the years. Wear them so much I wear them out. Love the fit and consistency, and the have nice traction around and in the drink!! I appreciate that I can order online and the size is always true!!",
      "rating": 5.0,
      "verified": true,
      "author": "John Zeneski",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Tabs at toes can be uncomfortable.",
      "text": "The padded tab inside the strap easily folds out of position and is then uncomfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Sharkman",
      "helpful_votes": 0,
      "publication_date": 20180527
    },
    {
      "title": "Five Stars",
      "text": "excellent quality super comfortable so much so i almost forget to take them off before going to bed!",
      "rating": 5.0,
      "verified": true,
      "author": "motegap",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Good Quality Sandals",
      "text": "The shoe is comfortable and we'll made. The strap near the toes is a tad thinner than I would like but it was the first pair of sandals I have ever bought. Would be better for short walks and lounging than a long hike.",
      "rating": 4.0,
      "verified": true,
      "author": "Dirk",
      "helpful_votes": 0,
      "publication_date": 20160726
    },
    {
      "title": "Comfortable and stylish",
      "text": "I bought the shoes for my husband and he loves them. He threw his old cheap Sandals in the garbage. Comfortable and he enjoys wearing them.",
      "rating": 5.0,
      "verified": true,
      "author": "cj",
      "helpful_votes": 0,
      "publication_date": 20160712
    },
    {
      "title": "Best Tevas ever",
      "text": "I love these. My last pair of Tevas broke after many solid years of use and when I tried these on I wished the older pair would have broke sooner. These are incredibly comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Cofer",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Better than others",
      "text": "Tried trendy chacos and they hurt my feet. These do not. Fit well and are cheaper to boot! Not trying to be punny either!",
      "rating": 4.0,
      "verified": true,
      "author": "D. Bryan",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "I’m quite satisfied with this purchase",
      "text": "I’m quite satisfied with this purchase. I wear these Teva sandals on a daily basis. The first pair I purchased in 1994, had lasted twentyfour years until this Spring. I’m looking forward to years of wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Regis A. Collins",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "Too narrow for my feet",
      "text": "The sandals were to narrow for my feet. I have never had this issue before so I'm not sure what happened. I'm returning them.",
      "rating": 1.0,
      "verified": true,
      "author": "chad weber",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "A must have to go on vacation!",
      "text": "I purchased these to go on vacation to Mexico and they for sure came in handy. Its hard to walk in flip flops all day and they provide good support.",
      "rating": 5.0,
      "verified": true,
      "author": "Cesaro",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Five Stars",
      "text": "Excellent fit and value. About half what the outlet was.",
      "rating": 5.0,
      "verified": true,
      "author": "M. L. Wilson",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Great product",
      "text": "These replace an identical pair I had that were great and finally wore out after much heavy use/abuse.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen N.",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "They last",
      "text": "My first pair lasted 21 years. I have every expectation my second pair will last as long.",
      "rating": 5.0,
      "verified": true,
      "author": "george schofield",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "good traction for boat use but fits a bit small",
      "text": "Well built, good traction for boat use but fits a bit small.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20170516
    },
    {
      "title": "Love em!",
      "text": "My favorite sandal for the past several years. Fit true to size and break in very quckly.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerry",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Good quality and very comfortable",
      "text": "Teva always produces quality products and these sandals are no exception.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff H.",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Great shoe.",
      "text": "This shoe replaced the exact shoe my husband wore out. He loves them and they fit well and are durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Moontide",
      "helpful_votes": 0,
      "publication_date": 20170318
    },
    {
      "title": "My go to sandals",
      "text": "I've worn these all summer and when I vacation in Florida. Teva are my go to sandals with Chaco a close second...",
      "rating": 5.0,
      "verified": true,
      "author": "M. Williams",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "Great for the $$$.",
      "text": "Good solid fit...easily adjusted. Good arch support. This is my second pair.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Five Stars",
      "text": "Good fit. Dry fast when wet. Good grip on wet surface.",
      "rating": 5.0,
      "verified": true,
      "author": "Old Man Walking",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Not very good for the price.",
      "text": "These Teva sandals fell apart at the sole in 3 months.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary C.",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Five Stars",
      "text": "this is the second pair of these, first pair lasted about 5 years of hard use.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "For some reason The material is like sandpaper I’ve got blisters all over my feet",
      "text": "For some reason The material is like sandpaper I’ve got blisters all over my feet ,",
      "rating": 1.0,
      "verified": true,
      "author": "AR",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Five Stars",
      "text": "Most comfortable Sandler I own. And I own a lot!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Heie",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "They are so comfortable, I promised myself I would buy another pair",
      "text": "I bought an identical pair last December. They are so comfortable, I promised myself I would buy another pair. So I did.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Corbus",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Happy with these sandals.",
      "text": "I have had a similar pair of sandals for years..They were excellent..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "Owned 4 pair of TEVA Look and grip great",
      "text": "Abit too snug, Owned 4 pair of TEVA Look and grip great thought",
      "rating": 4.0,
      "verified": true,
      "author": "Rick N",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Stay with the Classic!",
      "text": "My last pair is over a decade old. I expect this pair to last as long!",
      "rating": 5.0,
      "verified": true,
      "author": "WPS-Ohio",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Three Stars",
      "text": "Teva has a few minor hot spots that will probably go away over time.",
      "rating": 3.0,
      "verified": true,
      "author": "Al from Largo, Fl",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "An old glove tells you if you've gotten fat or not,",
      "text": "I replaced an exact pair that were umpting years old. I knew what I was getting. They are Very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Custome9r",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Comfortable Quality Sandals!",
      "text": "Great sandals have 2 pair and wear them everyday all summer long!",
      "rating": 5.0,
      "verified": true,
      "author": "Tsikusr",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "Great sandals",
      "text": "My. Husband loves these sandals for fishing tournaments. Great arch support and comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "He is happy with them",
      "text": "Bought for my husband. He is happy with them, but probably should've exchanged for 1/2 size smaller.",
      "rating": 4.0,
      "verified": true,
      "author": "G&T DavisTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "What it look like",
      "text": "I had purchased a pair before, so I knew exactly what I was getting, I love Teva",
      "rating": 5.0,
      "verified": true,
      "author": "ruth velasquez",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Five Stars",
      "text": "I love these sandals. I wear them everywhere and they are great!",
      "rating": 5.0,
      "verified": true,
      "author": "Grover C. Oliver",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Five Stars",
      "text": "comfortable, sylish and I never want to take them off",
      "rating": 5.0,
      "verified": true,
      "author": "Gene Moore",
      "helpful_votes": 0,
      "publication_date": 20170221
    },
    {
      "title": "... little big but my son says they are very comfortable.",
      "text": "A little big but my son says they are very comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanine Bailey",
      "helpful_votes": 0,
      "publication_date": 20180309
    },
    {
      "title": "Very comfortable",
      "text": "The most comfortable pair of sandals I have ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Bruszewski",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Great sandals but I had to get two pair",
      "text": "Great sandals but I had to get two pair. They tend to get stinky if you wear them every day.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Five Stars",
      "text": "so far so good. fit well and looks great. thumbs up!",
      "rating": 5.0,
      "verified": true,
      "author": "pgoody",
      "helpful_votes": 0,
      "publication_date": 20170408
    },
    {
      "title": "Comfortable and affordable",
      "text": "I don't think I can go back to standard sandals after purchasing these. They are very comfortable, dry quickly and have plenty of location to adjust how snug they fit. If i had a complaint it would be that the padding that covers the straps near the front of the shoe can fold over if you don't pay attention and become uncomfortable. This is easily fixed but can get annoying, outside of that I have nothing negative to say. I did manage to pick these up during a sale which helped to influence my initial purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Smith",
      "helpful_votes": 0,
      "publication_date": 20160822
    },
    {
      "title": "Five Stars",
      "text": "Fit good for my feet. Light enough to walk around all day.",
      "rating": 5.0,
      "verified": true,
      "author": "DT",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "COMFORATBLE SANDALS",
      "text": "Teva Men's Minam Sandals are the only sandals that I can comfortably wear all day long.I have lived with peripherial neuropathy,specifically in my feet,for years.I highly recommend this sandal for anyone that has foot problems and whose soles are very sensitive to pain.",
      "rating": 5.0,
      "verified": true,
      "author": "douglas edwin durham",
      "helpful_votes": 9,
      "publication_date": 20140921
    },
    {
      "title": "Great sandals. Very comfortable",
      "text": "Great sandals. Very comfortable. Fit is too large. You probably need take off a full size. E.g., I wear a 9/12 but should have gotten a 9 or even an 81/2.",
      "rating": 4.0,
      "verified": true,
      "author": "M.L.",
      "helpful_votes": 4,
      "publication_date": 20160624
    },
    {
      "title": "Last for roughly a year...",
      "text": "I thought they were of high quality and they were, for about a year. Then hiking they snapped, both sides :( I'm sad cause I really liked them.",
      "rating": 1.0,
      "verified": true,
      "author": "KATANAsan",
      "helpful_votes": 3,
      "publication_date": 20171203
    },
    {
      "title": "Comfortable sandal, even when active in them all day",
      "text": "Wear these all the time and they are comfortable. I even wear when I was on my feet all day walking around without any break-in period. The one nitpick would be the pull tab in the back, that may annoy you a tiny bit until they break in. However after about 6 weeks with them I would recommend them.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonGuy2929",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "My favorite shoe",
      "text": "I have tried numerous open toed shoes, looking for both fashion and function and this is my favorite. I used the last pair for 5 years, wearing almost every day! I highly recommend this product to anyone who wants a quick access/removal product, breathable design and cool look.",
      "rating": 5.0,
      "verified": true,
      "author": "8 Bit Tech",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Gave me a blister one time from the rubbing of ...",
      "text": "Gave me a blister one time from the rubbing of my heel to the back velcro latch area. Might be because it wasn't tight enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Lok-Tin Yao",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Too large, and somewhat narrow.",
      "text": "Way too large. I brought two pairs, one is 9 for my husband, and one is 11 for my father-in-law. The pair(9) fits like 11. The pair(11) is way too large to wear and has to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Wind",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Comfortable!",
      "text": "These are perhaps the most comfortable sandals I've ever owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Deacon Blues",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "wow",
      "text": "Can't say enough bout how great these sandals , or Amazon is!!!",
      "rating": 5.0,
      "verified": true,
      "author": "crazygeorge",
      "helpful_votes": 0,
      "publication_date": 20140816
    },
    {
      "title": "These are a very low end Teva product. The ...",
      "text": "These are a very low end Teva product. The strap has no hand hold on the end so you have to peal the strap loose with you finger nails. the padding against your skin is small and uncomfortable at times.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Great product - high quality, long lasting sandal",
      "text": "You can't go wrong with a Teva purchase. This pair was bought to replace a pair that lasted almost 10 years. My only complaint is not product related but packaging. These were ordered as a Christmas gift and the package it was shipped in very clearly identified it as a shoe purchase and the box was taped with one single line of tape which and the box was slightly opened and damaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Elizabeth Mathey",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "They were a size too big. Didn't return them ...",
      "text": "They were a size too big. Didn't return them because I wore them around the house. I would by the next size lower but the price went back up. I'll just have to settle with having them too large and will probably give them away.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaime",
      "helpful_votes": 0,
      "publication_date": 20160704
    }
  ],
  "product_meta": {
    "title": "Teva Minam M's Sandals Men",
    "description": "The Teva Minam Sandal has the following features: This Teva sandal for men is a comfortable outdoor sandal with a rubber sole and footbed, which is anatomically shaped. The shoe features a Shoc Pad, which provides sufficient cushioning under the heel. This sandal features a long, looping foot strap on the instep with an adjustable buckle. The outsole is made of Spider Rubber which provides great grip on slippery and uneven terrain. Specifications: Teva outdoor sandal for men A long, looping foot strap with Velcro closure Soft synthetic leather footbed Spider rubber outsole Tags: sandal, outdoorsandal, men sandal.",
    "rating": 4.4,
    "feature_bullets": [
      "Waterproof leather upper",
      "Microban zinc protection helps prevent odors",
      "Outer Material: Synthetic",
      "Inner Material: Unlined",
      "Sole: Rubber",
      "Closure: Hook and Loop",
      "Heel Type: low-heel",
      "Shoe Width: Medium",
      "Padded heel with encapsulated ShockPad technology for added -marking rubber sole",
      "Hook and loop closure"
    ],
    "specifications": {
      "Product Dimensions": "25.4 x 38.1 x 15.24 cm; 1 Kilograms",
      "Date First Available": "10 Jun. 2013",
      "Manufacturer": "Teva",
      "ASIN": "B00C6WU1VI",
      "Item model number": "4289_Noir (Black)",
      "Department": "Men's"
    },
    "categories": [
      "Shoes",
      "Sandals",
      "Men's Shoes",
      "Shoes & Bags"
    ],
    "price": ""
  }
}