{
  "website_summaries": [
    {
      "verdict": "If you want a reliable platform bed frame, it's an acceptable choice. It provides stability and height but may be a bit noisy.",
      "pros": [
        "Solid construction",
        "Larger owners say it's supportive and stable",
        "Precise height and ample space underneath for storage",
        "Easy assembly"
      ],
      "cons": [
        "Has a tendency to squeak, usually after several weeks or months of use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Easy to assembly",
      "text": "Easy to assemble. Reasonably priced, sturdy and quiet. Decent ground clearance for underbed storage but not too high that it would be hard get on and off of. I used some 1/2in; plywood and drawer slides to mount a shelf under it - I dimensioned everything such that my roomba could still get under the shelf. I wish that a drawer system like this were somehow provided as an option with a bed frame like this but oh well my DIY solution works fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Yangorang",
      "helpful_votes": 134,
      "publication_date": 20170610
    },
    {
      "title": "Won't Honor Their Own Warranty",
      "text": "It is a great product and I got three of these already. One of them started swaying no matter how many time you tightening the screws and now it is broken. All three are still within warranty period but they won't honor it. Had given them all the info they wanted including pictures and that was over a month ago. So buyer beware",
      "rating": 1.0,
      "verified": true,
      "author": "Sir Guy",
      "helpful_votes": 95,
      "publication_date": 20170915
    },
    {
      "title": "it was very easy to put together",
      "text": "WOW, I am a 350lb man and this thing doesn't even budge no matter what kind of activity is going on. Has not bent at all after about 2 months of use and I don't think it will ever. I have a Serta iComfort mattress and can not feel the steel bars whatsoever, it is ways ahead of a box spring and bed rails. It is no contest. Plus, it was very easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "BUCC",
      "helpful_votes": 23,
      "publication_date": 20160921
    },
    {
      "title": "Warning:  Manufacturer Will Not Support Product Sold on Amazon",
      "text": "We purchased this frame and within a year, both support hooks broke. We contacted the manufacturer, Zinus, and they said they couldn't honor the 5-year warranty on the product because it was sold through Amazon, and further through another seller that wasn't a partner of Zinus. Zinus refused to even sell us the part that broke. In my opinion, this represents one of the worst customer service experiences I have had with any vendor including Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 7,
      "publication_date": 20200701
    },
    {
      "title": "Squeaks/Noise",
      "text": "The only reason I bought a new frame was because my old box spring was making too much noise. I bought the Zinus in hopes that it will solve my problem. It did, but after a month or so, I started hearing squeaks. It's not as bad as my old frame, but they do sure advertise a lot on the noise free or engineered to be silent type of bed frame.",
      "rating": 1.0,
      "verified": true,
      "author": "CJ",
      "helpful_votes": 12,
      "publication_date": 20171101
    },
    {
      "title": "lasted less than 2 years",
      "text": "I bought this January 2017, At first it was just what I wanted. I even recently bought a mattress from the same company because I liked this frame. Once the new mattress went on though the frame broke where the lower supports were welded. Just beware I don't know how long this will last you. Update. I tried the warranty and they said they did not have any in stock and they would not give me my money back. As you can see they are still selling it though. Do not buy this they don't stand behind it and it fails with lousy welds.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20181205
    },
    {
      "title": "but this thing was all bad for us",
      "text": "I realize I'm in the minority, but this thing was all bad for us. Bed comes in two easy to assemble pieces. One of the pieces was completely bent (see pic). No damage to packaging. Looks like it came straight from zinus like this. We have a tuft and needle mattress (buy one, it's awesome!) and it slides like crazy if you even bump it slightly.",
      "rating": 1.0,
      "verified": true,
      "author": "pbwonderx",
      "helpful_votes": 14,
      "publication_date": 20170711
    },
    {
      "title": "BEWARE....support bars began snapping off before even a year after after purchase",
      "text": "This Big and Tall frame was not made to last. It couldn't even make it through the first year without falling apart. The metal support bars are just literally falling off. So many have just broken off at the ends where they just must not have been welded well enough that it just sways under any kind of weight. We purchased this for our teenaged boy. It says that the frame can hold 500lbs of normal use but unfortunately it couldn't even withstand half of that weight with normal use. I wouldn't recommend this frame and I certainly don't think it was designed to be stronger with heavier weights....not even sure it would hold up under lighter weights.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristy J",
      "helpful_votes": 3,
      "publication_date": 20190907
    },
    {
      "title": "Super easy to assemble",
      "text": "I just assembled this today but I was quite happy. It was super easy to put together for a full size and seems quite sturdy. I’m glad I went for the elite which has thicker bars and inset legs so you don’t stub your toe. Only thing to make this better would be if it had a lip to keep the bed better in place. I was able to purchase the separate headboard brackets and attach my headboard as well. Double the space underneath the bed as well. I’ll update review if anything changes, but so far quite and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "ginger1123",
      "helpful_votes": 2,
      "publication_date": 20200306
    },
    {
      "title": "Broken welds",
      "text": "I purchased this bed frame in 2017 because it was advertised as heavy duty. It was great until recently when I noticed it was feeling a bit less solid. Upon inspection the weld in on of the legs had broken. By the time my replacement arrived and we took it apart the weld on two legs had broken and as we disassembled it the other two broke as well. I was just lucky it hadn’t collapsed. I know another reviewer mentioned this same issue. I gave three stars only because it did last 3 years but I wouldn’t call it heavy duty at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Tina M. Hilton",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Fantastic bed frame and company!",
      "text": "We love this Elite SmartBase Mattress Foundation. It was so easy to assemble and it is very sturdy and well made. My understanding is that you don't need to use a box spring with this foundation, however, I still wanted to use the box spring and the mattress so I did have a little issue of the box spring sliding on the frame since we do not have a headboard or side rails to stop it. I fixed that issue by ordering the headboard brackets and attaching them upside down at the foot of the bed frame. Now everything stays put (see photo).",
      "rating": 5.0,
      "verified": true,
      "author": "CEH",
      "helpful_votes": 2,
      "publication_date": 20190402
    },
    {
      "title": "6 Month Review! Summary: Solid, and we're still pleased as punch!",
      "text": "Updated 6-month review For: \"Zinus Demetric 14-inch Elite Mattress Bed Foundation\" sold by \"Miguel Ecom Store\" purchased May 31, 2019 and shipped to Atlanta, GA. TMI: Six months later and this 6'-230lb guy with his 5'10\"-185lb -beautiful- wife (don't tell her I revealed her weight online) are still very pleased with our choice in this bed frame. It still doesn't shake, rattle nor squeak (even when we're trying! *wink!*) And the storage space underneath is sublime (It saved my retro game collection from the dumpster and it finally moved her \"when-I-get-back-down-to-my-high-school-weight\" wardrobe that's crowded half our closet for twelve long years)!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Nichols",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Exactly what we wanted!",
      "text": "LOVE IT! It's super sturdy with lots of room underneath. We found no reason to add a board underneath and we have 400 lbs of adult, 150 lbs of dog, and 35 lbs of kid on it regularly. It is too tall for a mattress and box springs, though, so beware. We had a memory foam mattress on the way but it had t arrived so we put our standard mattress on it sans box spring and it was hard as a rock. With memory foam, though, it's perfect and not too tall.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 5,
      "publication_date": 20171123
    },
    {
      "title": "Sturdy. Cheap. Not as quiet as they say.",
      "text": "This thing is alright for the price. It holds a lot of weight. I’ve had 4 people on here before. It’s really easy to assemble and to move around because it folds and isn’t super heavy to carry. The main complaint and the reason it’s no 5 stars is is that it’s not as quiet as it’s advertised. I tightened the hell out of it the little twisty things. And I have someone over from time to time and I had to be worried about my roommates hearing the frame squeak like crazy while we were going at it. Kinda sucks.",
      "rating": 4.0,
      "verified": true,
      "author": "Mist",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "2 XL twin frames=King (and king has pieces to connect them). both fold easily for moving/storing.  Very strong and sturdy.",
      "text": "If you want two XL twin frames, I suggest purchasing the king-sized. The king is the same as two Twin XL frames and includes something that attaches to two frames. but the King size is less expensive than the two XL twin frames. I love that they fold flat and was delighted that the king was two XL twin frames for ease of carrying/moving, storing. Very strong and sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "OrganicBeauty",
      "helpful_votes": 8,
      "publication_date": 20161221
    },
    {
      "title": "Frame broke after 30 months",
      "text": "This bed has a five year warranty but after only 2 1/2 years one of the welds broke. The warranty is prorated so it is not worth $33.00 to package the frame up and ship it back to get the warranty coverage. This frame was correctly installed and has not been moved since. I will avoid all Zinus frames in the future.",
      "rating": 1.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 4,
      "publication_date": 20181123
    },
    {
      "title": "Decent frame. Doesn’t last forever",
      "text": "It was a good bed for the first 2 years. Then the support beams starting to loosen and become unwelded causing the bed to lean. Contacted customer service to see about the 5 year warranty. Started the warranty process and never heard back so I guess I’ll be ordering a new bed frame",
      "rating": 2.0,
      "verified": true,
      "author": "Smithlat ",
      "helpful_votes": 2,
      "publication_date": 20200712
    },
    {
      "title": "DO NOT BUY! BROKE IN 3 MONTHS",
      "text": "Didnt even last 3 months! I bought this for my son and it's already broken. Its hanging on by a thread and I'm super disappointed because I've bought this brand before and never had an issue. Plus it's a big and tall item! It should be able to hold a normal sized child without breaking. Severely disappointed and upset about this. I actually would like my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Tiana",
      "helpful_votes": 2,
      "publication_date": 20191023
    },
    {
      "title": "Owned 2y+ Still pleased. Sturdy.",
      "text": "Have owned over 2 years now and still couldn't be happier. This is a very solid frame and well worth buying over any other, even if you don't \"need\" the capacity this offers, get it and it will last that much longer. Of note, I do actually \"need\" the heavy duty and I just inspected the frame and there is no bending, warping, or other issues I have had in the past. I will say I use it to sleep on and not as a bouncy castle.. so keep realistic expectations vs activity level and you'll be happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Norry",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Perfect with some slight tweaking",
      "text": "We purchased this to use in my son’s room with a full size mattress. It was easy to assemble and the mattress fits great. I was not sure the support for the mattress would be what we wanted though so I took the advice of others in the comments, and we went to the hardware store. We purchased peg board and had it cut to fit our dimensions and then came home and zip tied it to the frame. This worked perfectly and makes for a very well-supported and comfortable bed. The height is great too. Not too low at all and great space underneath so it is easy to vacuum or store items.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Great purchase go for it!",
      "text": "This thing is awesome we were bought it to replacw the stupid wooden feet on our bed were breaking and we wanted something more solid. It fit within our bed frame, and we opted to use our box springs on top with our mattress (we call it bed mountain). This is well worth it. Sturdy strong can be taken apart it is two pieces so that you can really clean under the floor, and goes back together easily. This is a great purchase if you sre looking for a good solid bed base! We have had it almost 3 years now!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Simplistic assembly, sturdy, and practical",
      "text": "We selected the Zinus Demetric frame both to provide adequate support for large adults sharing the queen size mattress in our guest room, and to allow under-bed storage of items stored in \"banker boxes.\" We also ordered brackets for a head board and foot board, and the brackets were very easy to install. The slots in the brackets didn't align well with the mounting holes in the head and foot \"boards,\" but the latter are orate steel/iron of antiquated vintage, so that wasn't surprising. As a result, we were able to bolt through only hole/slot combination per corner. So, depending on your own head and foot boards, some creativity.-- or some drilling-- might be required.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Nice black and sturdy!!",
      "text": "It work for exactly what needed... we moved to a place and our box spring wouldnt fit up the stairs so we decided to buy this. And the only thing is oir mattress slips on it so we had to order a non slip thing as well. But its very sturdy and has lots of storgae room underneath for things. Was very easy to set up simple.instructions no tools required. And the size isnperfect inordered a queen size and a queen size came!!. Very happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "D.Patrick",
      "helpful_votes": 7,
      "publication_date": 20160723
    },
    {
      "title": "Not bad but not great.",
      "text": "Purchased this on October 22, 2017 now it is 12.3.2019. When I woke up this AM I noticed a squeaking noise as I got out of bed. It seems one on the welds on a leg support has broken. Dec 31st 2019 update.... Now I have 5 weld points that have snapped. Looking for something better....",
      "rating": 1.0,
      "verified": true,
      "author": "tweeter53",
      "helpful_votes": 2,
      "publication_date": 20191203
    },
    {
      "title": "Recommended",
      "text": "Just set it up. Could not have been much easier. No tools needed. Just a few wing nuts. Like setting up a cot. Feels sturdy. Noiseless so far. Folds in half. Good for apartment living and moving ease. I got five guitars and a suitcase to fit under this thing. I put a Zinus headboard and a skirt for it. Looks like a good high quality bed with the 12 in memory foam mattress. Now hopefully It doesn’t collapse in the night. Kidding. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Decent bed frame",
      "text": "First off, I'm neither big nor tall, but my husband is more than twice my size, so we've had our share of issues with beds. Our old box spring had gotten to the point where it would groan if I so much as sneezed, and we were afraid of waking the kids every night when we'd get into bed (just from trying to get comfortable... anything else would've woken them for sure), so I thought we'd give this a try. It was super easy to set up and barely made a peep at first. We're a few months in, and it does make a little bit of noise if my husband moves around a lot, but nothing too bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Kari",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Extremely easy to take apart and put together. Also no noise after 3 months",
      "text": "this frame took literally 10 minutes to fully assemble. You don't really even need instructions. It supports my mattress really well and after 3 months I haven't heard any noise coming from the frame. It can be disassembled and transported very easily as well. This was an excellent purchase and while it is a little pricey the ease of use and quality of the product deserve 5 stars from me.",
      "rating": 5.0,
      "verified": true,
      "author": "john heckman",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Great bed frame",
      "text": "This is the 2nd Zinus SmartBase I’ve purchased in the last 6 months. I purchased a twin sized one for our den/study in February and was very pleased with it, so when it came time to replace the bed frame in our master bedroom, I didn’t hesitate to buy another Zinus. The frame is easy to put together, super sturdy and so quiet(no squeaks/groans when sleeping or rolling over). Having the room underneath for storage is a bonus. I also purchased the brackets so we could attach our headboard and it looks great. I highly recommend !!",
      "rating": 5.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Way Better Than Anticipated",
      "text": "I bought this mattress base after a wooden slat broke on my bed frame. It arrived folded down and took up less space than I anticipated it would. Once the box was opened, it took me less than a half hour to set up and was super simple. A bonus was that this base fit INSIDE my old bed frame so I didn't need to buy another one. It provides a firm foundation for my memory foam mattress. I've had it over 6 months now and it only squeaked ONCE, I tightened up one of the bolts and it stopped. I am really impressed with the quality and durability of this mattress base.",
      "rating": 5.0,
      "verified": true,
      "author": "VenereVeritas",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Ok",
      "text": "Edited Jan 21,2019. Already broke. This is in a spare bedroom with only 1 guest having slept on it. I went to move it to change the sheets and the legs collapsed!! The little thin hook that holds it together just snapped off. I have contacted the company for a replacement piece, I will upgrade review if they send me a replace in a timely manner. If this is the heavy duty on, I’d hate to see the cheaper one. This one doesn’t seem very durable. I honestly can’t see this one lasting too long. For the price I paid, I expected a more solid piece.",
      "rating": 1.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "best model",
      "text": "So not going to lie. If you are a heavy set person this is the frame for you. This thing is sturdy, and the added middle legs make it confident. This thing is rocksolid no sounds or problems as well. We even gave it a test drive and it was perfect. I would recommend however to get a rug cling (the foam material used to keep rugs from sliding on hardwood) since the mattress (foam) can slide with little effort it however doesnt budge once you are on top. I am pretty confident that the 1000 lb weight limit is spot on.",
      "rating": 5.0,
      "verified": true,
      "author": "stephy.hime",
      "helpful_votes": 4,
      "publication_date": 20170213
    },
    {
      "title": "No complaints",
      "text": "I've been using this for 3 months now. My husband put this together and it was super easy enough that my Tim Taylor-esqe husband had no complaints and didn't try to \"make it better\". I'm mostly bedridden, I spend like 20+ hours a day on this. I also have a 100lb dog that jumps on and off it all day. I was worried about squeaking, there's been none. I was worried about the mattress sliding around, it's been minimal (even with catapulting canines). The legs are recessed so I haven't broken any toes yet. So far, I have zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Aura",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Excellent for small bedrooms!",
      "text": "Bought the first frame for one child out of necessity and ended up buying a second for our other child because there is so much under bed storage! I can fit four VESSLA Ikea rolling storage bins, plus more under this frame. Plus when something gets lost under the bed, even my super claustrophobic husband can muster up the courage to squeeze under there for a minute..... There's that much space!!! I also appreciate that most of the metal edges are rounded off, which helps prevent bruises.",
      "rating": 5.0,
      "verified": true,
      "author": "A.Mom",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Sturdy and No Creeks, though missing a few bolts and screws",
      "text": "This is surprisingly very sturdy and appears well made. Absolutely no creeking or noise and does an excellent job of supporting the mattress. Easy to set-up. This should be 5 Stars but mine arrived missing two sets of screws and bolts. I triple-checked the packaging to see if it fell off. It was just missed on their end during final inspection or assembly. So I had to go to Home Depot to get two pairs to complete. Wasn't happy about that and was an inconvenience. Otherwise, it's a nice product and I'd purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "disappointed",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "This thing is a beast!",
      "text": "While this frame isn't necessarily pretty, it sure gets the job done. I have guests who've put a combined weight of 620+ pounds for several nights at a time and they LOVE this frame, they couldn't wait to tell me how solid it feels. I've attached a headboard to it (brackets sold by the same manufacturer) and that process was painless. I recommend this frame to anyone who needs an extra-sturdy bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Just as described!",
      "text": "I got this frame to go into a utility trailer we are making into a camper that we can still use as a trailer for hauling stuff. the frame is very sturdy and easy to assemble- fold out legs lock down and ready to go! that easy! to take down unlock legs fold down lay flat to store. Great product sooooo happy I found this Great price and very high quality product! I would buy again. You could use this in a home full time and not need a spring mattress very comfortable, I got the queen and 2 of us was not a problem very comfortable no squeaks or noise of any kind and VERY stable!",
      "rating": 5.0,
      "verified": true,
      "author": "sunlite",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Excellent bed support",
      "text": "Relatively straightforward to assemble, although I had to get a hammer to tap some of the arms into place in order to latch them onto the bars they attach to. Not a big deal. This is a VERY sturdy bed support system. No moving, shaking, wiggling, or noises no matter what you do in bed. The recessed feet are the icing on the cake. No stubbing your toes. Ever! I don’t know why I kept my old rickety bed frame so long.",
      "rating": 5.0,
      "verified": true,
      "author": "lmk823",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Peaceful sleep!",
      "text": "When we moved to our down-sized home we brought the double bed from the guest room and it squawked and squeeked all night long. My daughter recommended this platform bed frame, a new concept to us. Out went the box spring and we hauled the platform bed frame upstairs, step by step, unfolded and secured it in about ten minutes next to our bed. Next we whisked the frame under our mattress and were amazed at the better quality of sleep. My husband was skeptic about the difference a platform bed frame could make until this morning. What a great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Works well!",
      "text": "We have had this one for 2 months. Prior to this I had a full size one for 2 years, my daughter a twin for 2 years, and our son a queen for 1+ years. All of them have done well by us. The King size is doing very well for my husband and I as well. Combined we are under 400 pounds, and we sleep on it, rest, fold laundry, and yes... you know what too! It works well, and having just moved, we can fit our suitcases underneath it well, as well as several storage containers. It's wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "rdm76",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great Bed Spring Replacement.",
      "text": "As can be seen, by the photos it gives a great amount of space to fit things under the bed (from my fist/ground up to my elbow. It fits the new bed that I got along with this perfectly a King Sized mattress. Oh, my spirit was the assembly easy as can be! It could not have been any easier. Simple Simon, easy peezy. Although, I do have to push my bed up against the wall from time to time as it moves a little bit from time to time, but outside that it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200615
    },
    {
      "title": "Sturdy and Solid",
      "text": "Sturdy and Solid. Been two months since I have started to use it. I used the heavy duty moving boxes to avoid mattress sagging. Check out the photos.",
      "rating": 4.0,
      "verified": true,
      "author": "Rocky",
      "helpful_votes": 27,
      "publication_date": 20160408
    },
    {
      "title": "What’s Up With the Crazy Price Increase???",
      "text": "I purchased 3 of these in 2016 and now the price has gone up 150 bucks!! That is absolute robbery. Good frame at 110 bucks or even 150. Definitely not worth 260 bucks. I was going to purchase two more but at this price - I’ll pass. Crooks!!",
      "rating": 3.0,
      "verified": true,
      "author": "Ms. D",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Super easy and perfect for new heavy matress!",
      "text": "This seems so well made Had this over 2 months now. Very heavy matress and its perpect. And NO SQUEAKING!!! It is a bit high so you have storage space under the bed. But if you are short and have a thick mattress like us you might need a little step unless you plan on taking a running jump! A very well made product and took about a minute to set up. Fair warning, it's not light weight. so you might need help taking it up stairs or out of the box. But it just unfolds and you put on the wing nuts and your done.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Using with a Sleep Number Bed",
      "text": "I have a king size sleep number bed that is 5 years old; when I moved a piece of the plastic base it came with broke and instead of getting another, I got this base. I have never felt a more secure base...solid in every direction. I did get a no slip pad, but I doubt this would have slipped at all. It is truly strong and I love that you do not stub you toe because the legs/supports are set back enough. It came as promised, was packaged nicely, and very easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Sweetsmom",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Solid",
      "text": "The base is extremely solid. Assembly is just flipping some levers down and tying together some thumb screws. My only complaint is that on a king which is comprised of 2 XL twin units, tying the two frames together is done by two crossways screws BUT the hardware for the main center hinge interferes. You can either have the frames slightly offset from each other which looks goofy, or what I did was just get a strip of plastic from McMaster and use it to space. Beyond that, it's rock solid. If it's going to fail it'll be at a weld, and at that point it's not design but fabrication that's at fault. No wiggle, no shaking at all.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris H",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Perfect frame for bed in a box.",
      "text": "We bought this for a 14\"foam mattress since we live in a very old house and couldn't get anything bigger than a full size bed up the stairs. Have you ever tried sleeping in a bed with 2 people, 2 cats and 2 dogs? A full doesnt cut it. We upgraded to the king. This frame was perfect for our bed in a box option. Assembled in about 30 minutes and right in the room. No fighting with tight, curved stairs. It's very heavy duty and doesnt squeak or move once tightened properly. PERFECT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Nyree M",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "I highly recommend it!",
      "text": "This was a great purchase. I thought I would need a new mattress but after putting this under my mattress, it felt as if I had a new mattress. Meaning that it was the box spring that needed to be replaced. This actually works better than a box spring as this does not bent over time as the wooden box spring did even though it was good quality. I highly recommend this to anyone who thinks they may need a new mattress. I would try this first. The existing mattress now feels more supportive and I feel great after sleeping on this combo.",
      "rating": 5.0,
      "verified": true,
      "author": "Mihir M Patel",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Just amazing",
      "text": "This is probably my favourite company for bed frames and the accessories ever. They really have the customer in mind. They even give you a Zinus brand rachet that works effortlessly. It took maybe ten minutes to put together? Everything literally snaps into place because the screws are pre-installed you just need to tighten them. It's great. The bed I had before CREAKED, it was so incredibly loud but this one is so quiet! I'm only about a month in and will update if it starts to creak. I paired this with the Zinus brand box spring even though it isn't required and the Zinus bed frame end brackets turned upwards to hold everything in place well.",
      "rating": 5.0,
      "verified": true,
      "author": "Quietgoose",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Lasted 18 months",
      "text": "The good Easy to assemble No tools needed The bad. The welds for the support bars broke down after 19 months. We bought a new bed frame and while disassembling this one what looked like one support bar was nearly all of them. A light touch when I went to unscrew the bar and it broke off in my hand. I would say it was my tightening of the screws but it was the actual weld that snapped. The platform part still works and is perfect. It's just the legs and support that snapped off. So any good handy person could make new legs and use this as the platform and it would be perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "Raven",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "I will never buy a traditional  bed frame or box spring again!",
      "text": "I will NEVER buy a traditional bed frame again and good bye box springs!! I bought the queen size frame, put it together myself in under 10 minutes without any tools. Does not make any noise, squeaks or banging at all. My husband is 6'4\" 300 lbs. I am 5'5\" 140 lbs and it offers great support for both our sizes. If you have an awkward stair case or hallway that you struggle getting your traditional box spring and frame through, toss them out and buy this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Really Disappointed",
      "text": "It seems sturdy and strong, but it has begun to squeak like hell after a little over a month. I'm 6'2\" and a little under 300lbs and I'm not violently tossing myself onto the bed, and it's only me on it but it still squeaks. It squeaks at the middle of the middle piece of the bottom half, and as far as I can tell it's the only place where it squeaks. I hope that's not a weak point in the design that will eventually break, but I have no choice but to think that as it has shown it's weakness very early into me owning it. I'll contact support see what they say; maybe it's a manufacturer defect.",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 2,
      "publication_date": 20170923
    },
    {
      "title": "Sturdy frame",
      "text": "This frame arrived in time and was easily put together. Mattress fits perfectly. Love the extra storage under the bed. Quiet, while turning and tossing on mattress. Husband cut a piece of thin plywood, and used a non slip pad on the frame, no slipping or sliding of mattress while getting in or out of bed. Thank you, Zinus. this is the 3rd mattress frame we've purchased. A queen size for our son, a twin size for grandson, and full size for husband. All are holding up well. no need for box springs.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Maynard",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Sturdy, good quality, good buy!",
      "text": "We bought this bedframe earlier this year. I waited to write my review to see if it would stand the test of time... AND IT DID! Its extremely sturdy, great quality and I love the height. My son loves this bed. I bought an extra large twin because he's quite tall, 6'5 and he still fits his entire body in the bed, yay! Not feet handing over, lol. I am so happy with this purchase. I bought myself the full size which is equally great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Isa",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Well made but may make your mattress firmer than a boxspring",
      "text": "We had 2 rooms with bed bugs and threw out the boxsprings. We bought these instead of replacing the boxsprings. I would recommend the 14\" for beds up to a queen but I bought the 18\" more sturdy one for the King mattress. We do not have memory foam mattresses so your mattress is a little harder with these frames. However, our King mattress is well made and you don't really notice a difference. However, it will be more firm with less expensive mattresses. Also, very easy to assemble and carry. It only took minutes. It also fits inside a wooden frame to the entire bed set. I was worried it would not fit but it did with both beds.",
      "rating": 4.0,
      "verified": true,
      "author": "Sheri C.",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Can handle a big guy .",
      "text": "If there was one improvement, it would be great if there was an optional adapter for a hook style head board. As it is, it is a sturdy frame that went together great. My wife an I are in our mid-seventys and it took 20-30 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "KWD",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "\"Big and Tall\" 14 inch frame",
      "text": "This frame is awesome. I've had this frame for almost a year and I have no complaints. Also i just recently moved and taking it apart and putting it back together was super easy. I was originally concerned because our foam mattress is VERY heavy (I cannot move it on my own), but the thick bars are holding up good. I weight 280 and always throw myself on the bed and I haven't had any problems. (let me tell you i wrecked the original wood boxes that came with out bed). Considering the price, im surprised the quality of this frame is so good. I recommend this if you are bigger than your average person, or well for anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Randomreflex",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Nice frame, well worth the extra cost to have silence during sleep.",
      "text": "I was tempted to go with one of the cheaper SmartBase foundations, thinking they might be good enough, but who knows? Quiet sleep time is priceless, so $40-50 more than the cheaper ones is well worth the investment if its going to be squeak free! The old frame was terrible. It would make noises every time one of us moved or got in/out of the bed. We've had this for 3 1/2 months and have had wonderful, silent sleep time. Restful, uninterrupted sleep is so important for good health! Plus, it was very EASY to unfold and lock the legs into place and it's very stable...doesn't move at all!. Love the extra storage room underneath as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Very sturdyband well made!",
      "text": "I bought the \"big and tall\" version and I am very satisfied. It is super sturdy, made very well. I wish I had read all the reviews before attempting to put it together. The roundish \"nuts\" threw me off. Couldn't figure out where the bracket should clamp to the bolt ( admittedly I'm not the sharpest knife in the drawer). For those of you mentally challenged like myself - the latch goes below the \"round nut\" AND the wing nut. Once I got past this challenge it was a breeze to assemble. I have a regular mattress with a bunky board underneath it. It's great! Don't hesitate to buy this bed frame.",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "Squeaky",
      "text": "Squeaky. It started out well. Easy to assemble. Sturdy. Still sturdy but after 3 months the squeaking has become worse and worse. Now at every little turn. It was advertised as quiet otherwise I guess this is what you'd expect from this kind of bed base, but all these good reviews? Now I am considering trashing it and going back to solid boxspring. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "moon",
      "helpful_votes": 4,
      "publication_date": 20170628
    },
    {
      "title": "Feels like a tank, Super easy to assemble",
      "text": "literally just unfold it, unfold and hand tighten the screws on the outside first and then the middle and done, haven't tested it for long but it definitely holds up to some rough play if you know what I mean lol update 12/8/2019 this thing while sturdy and super easy to assemble is most definitely not quiet in any way what so ever. This thing is loud and will let your neighbors and anyone in the apartment or in the hallway know what it is you're doing",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Lack of quality control.",
      "text": "Ordered three of these for my family. Two arrived in perfect condition. The third one arrived bent up with sharp edges in the bent area. For as much money as these cost, I expect some quality control. The damage does not appear to be from shipping, but from manufacturing end. Very heavy, so not worth the effort to return. Just have to hope no one gets hurt. Makes me question the durability of these frames. Good luck getting one that is not shipped out to you already damaged.",
      "rating": 2.0,
      "verified": true,
      "author": "odie",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Very Sturdy",
      "text": "This was perfect. I have a beautiful antique wood bed a size between twin and full. I wanted to go to a full size mattress but did not want the height of an added box springs as it would conceal too much of the headboard. This frame does not require the use of a box springs, when it arrives you only have to unfold it and use the locking mechanisms. I put a bed skirt on it and pushed it up next to the wood head board. Added some felt and spacers behind the head board to protect the wood and wall. It is beautiful.",
      "rating": 5.0,
      "verified": true,
      "author": "B Howard",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Great bed frame, sturdy, quiet, easy set up.",
      "text": "This is a fantastic bed frame. We had the usual regular metal frame with box spring set up, and got rid of that for this frame. Super quiet, doesn't squeak, very sturdy, and took less than ten minutes to set up. I don't leave five star reviews often, but this deserves it.",
      "rating": 5.0,
      "verified": true,
      "author": "JBoydTop Contributor: Baby",
      "helpful_votes": 7,
      "publication_date": 20160912
    },
    {
      "title": "One year review.",
      "text": "Absolutely able to handle heavy weight. I was very concerned this wouldn't do the job but a year in and I'm very happy. We paired this with a memory foam mattress from Ikea and haven't had any regrets.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Easy Assembly and sturdy!",
      "text": "This was such a piece of cake for me to put together (all by myself and with a sprained ankle even!) I almost cried in relief. Zero tools needed (hooray!) and the thing is mad sturdy. I also purchased the bunkie board by this same brand to accompany this base as recommended by other reviewers also easy to put together. I would recommend buying a bunkie board or some type of particle board to place underneath. This is the third memory foam platform bed I've had, and the foam will eventually leak through the slats if you don't have something.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Excellent bed frame",
      "text": "This bed frame is amazing. It is so strong. I swear you could park a tank on it. Plus it’s quiet which is very important since I’m a light sleeper and when my wife gets out of bed I never wake up. The nice thing about a frame like this is not needing a traditional box spring so instead I can fit all kinds of stuff under the bed making it a great storage area and since my house is small this frame is perfect. This one cost a little more than some of the others but well worth the money. This one will last for years.",
      "rating": 5.0,
      "verified": true,
      "author": "B.Brad",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Good bed, but can a little lower than advertised.",
      "text": "Had this product about a week now and I do believe that it is probably more durable as the last one I bought from another manufacturer. The biggest issue I have is the height. My last one I had from the other company had just under 14 inches of clearance and this says it has 13. But it’s actually just under 12. That dont sound like a lot but if your a tall person it can really make a difference. I wish I would have purchased the 18 inch model.",
      "rating": 3.0,
      "verified": true,
      "author": "Tim Ward",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Zinus 14 in Elite “Big & Tall” model",
      "text": "My husband is 6’7 and his feet would always hang off the end of the bed, this frame and paired with our king size mattress finally fits him! We love this sturdy frame so much we’ve bought it in a size king and 2 twins for our kids. If you want something strong and solid for jumping on the bed or several teenage boys sitting on it playing a game system (our fun household lol) then this frame is for you! Highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "April S.",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Poorly designed legs",
      "text": "My teenage boys rough house in their rooms and have broken 3 of these frames in one year. They fu replace them but it’s nit an easy process. The frame is study metal. The legs are cheap and buckle and buckle under pressure. Don’t waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Faith Griswold",
      "helpful_votes": 2,
      "publication_date": 20191226
    },
    {
      "title": "Great Product",
      "text": "My husband and I purchased this smart base foundation a few months ago and we absolutely love it. Neither of us had ever owned a bed base like this before and was only used to box springs. We were a little nervous as to how it would work and hold up and so far, a few months into owning this base we have not been disappointed. It's one of the best purchasing decisions we've made regarding bedroom furniture. It sets up in minutes and is very sturdy and supportive for your mattress. It's also extremely quite, it doesn't squeak or produce any noise at all. You can't beat the price and quality you'll receive with this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Still no squeaks after 18 months",
      "text": "After over a year of use by a pretty big dude, this bed frame is still strong and sturdy and doesn't make any noise at all. Plus, there's no assembly required. Upon opening the box you just unfold it and you're done. Makes it easy to move, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank Discussion",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Product Name Correct, Item not like Picture",
      "text": "The item did not match the pictures. What we received has the same name as the product listed, but it came in two pieces requiring us to screw it together. While this doesn't sound all that bad, it basically ruins the \"silent\" part of it as the hinge screws now touch + rub, and it changes the dimensions of the unit. This is basically $50 more expensive than just buying it already as two units and adding your own 4\" wing nut + bolt.",
      "rating": 2.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Strong smart base",
      "text": "We've been using this with a purple 4 king mattress and it hasn't squeezed at all. It's been 4 months so far. Out combined weight is 430 plus 220 for the mattress. Definitely holds up so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Hex",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "Better than I was hoping",
      "text": "So, I purchased this due to the reviews saying it was good for heavier people. Both my partner and myself are a bit on the heavy side and have done all manner of things on the bed and it's still standing strong almost a year later. One of the best bedframes I've ever purchased and will be looking for this brand when / if we ever upgrade to a larger bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Gabrielle",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Not like an old fashioned boxspring, but not bad.",
      "text": "I remember the days where boxsprings were more than just slats on a wooden frame. Since those wooden slats and metal frames became the two standards I haven't had a great sleep unless I slept on a couch. I originally had a Leesa matress set with a \"boxspring\" and frame. No surprise, one by one the slats on that thing were breaking. I got this frame to replace it and it's definitely an improvement. It's easy to move so I can rearange my room when I feel like it, and I can put the matress against the wall and lift the frame to vaccum the carpet underneath. It's still not a legitimate boxspring, but it's the best I've had since.",
      "rating": 5.0,
      "verified": true,
      "author": "Nail",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Easy and effective",
      "text": "I'm a klutzy young lady and this product was very easy for me to install. I use a regular mattress on top of it. I was so glad to be rid of my old box spring that I happily dragged it out to the curb myself. My boyfriend didn't have to do a thing! I put plywood over the base to increase sturdiness and comfort. Some people may have used peg board but, the wood cutters at Lowes informed me that peg board wouldn't be durable enough material. The plywood added comfort to the base. I've definitely been sleeping better and enjoy the extr storage space.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolyn",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "No problems, so far",
      "text": "Bought this to go with the 'Signarure Sleep 13 inch independently encased coil pillow top mattress'. They work together well. A friend had one and had problems with the mattress slipping around all the time. This one has only been used for about 7 nights, by my son who came to visit. He did not experience that problem. I bought the 'headboard brackets' to go with this, thinking I could install them in the corners to keep the mattress in place, but have not tried that. I have not found any flaws or problems with this 'Elite Smart Base' product.",
      "rating": 4.0,
      "verified": true,
      "author": "LittleGreyDog",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "This is a great, solid folding twin metal frame",
      "text": "This is a great, solid folding twin metal frame! Appears well made & quiet. Be aware there is only 13\" clearance to store plastic bins under, so do not get 16\" tall large bins!! This is a mistake I made. If the risers I have do not work well, I will get smaller bins. Having a folding frame will now allow me to have an extra bed that I can keep in my closet, until needed. For now, I am using it as my main foundation, with a folding mattress & memory foam, to try out. I am thinking about buying another one, as soon as I feel it will work well, for me.",
      "rating": 5.0,
      "verified": true,
      "author": "N. C.",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Easy to assemble!  Level up to the Elite, it’s worth it!",
      "text": "Easy assembly, no tools required! I am 5’3” and moved it up a flight of stairs and put it together myself. It was a work out, but doable. An extra set of hands would’ve just made everything easier. One thing, if you put a bedskirt over it, your going to want a second person to help. The frame is powder coated so the bedskirt slipped right up with the mattress when I slide it on. Mattress is not budging though and neither is the frame. Glad I paid the extra $40 for the Elite version, definitely well worth. Guessing this will last me a lifetime!",
      "rating": 5.0,
      "verified": true,
      "author": "PaperAngell",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Decent quality but no style",
      "text": "I purchased three bases and they seem sturdy enough and well made, but they are not attractive. They actually seem a little too wide and deep for a standard twin mattress - leaving an uncovered lip all around the edge of the mattress which may prove to be a nuisance. The mattress seemed to slide around on the oversize surface. These were a substitute for a much more stylish base that I have ordered in the past which featured broad, round tube legs at the four outside corners. The mattress does not slide on that model. Both models provide functionality in regard to under bed storage, but I greatly prefer the tube leg model.",
      "rating": 4.0,
      "verified": true,
      "author": "The Adkins Family",
      "helpful_votes": 0,
      "publication_date": 20170118
    },
    {
      "title": "Now that I bought it, why didn't I buy it sooner?",
      "text": "We bought this for our king size bed. YOU GUYS. I actually sleep now. No more weird awkward squeaking when my husband or I move, no more waking up crabby, no more feeling like one side isn't as supported. The best part is that it fit perfectly inside the \"frame\" of my bed so you can't see it at all and my bed still looks like, well, my bed.",
      "rating": 5.0,
      "verified": true,
      "author": "sblackbear",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Sturdy, noiseless, easy to assemble",
      "text": "I set this up very easily. It is sturdy, no noises while lying on the mattress on it. Has nice guards on the bottom of the legs. I am on vinyl floors so it is easy to move for cleaning or making up the bed (I have it against a wall) but am not noticing movement when I am lying on it. NO NOISE at all. I wish I had a reason to buy it again right now. It was worth reading all the reviews on multiple frames before I bought this one. No regrets at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy L",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "The strong, silent type!",
      "text": "These are wonderful! Well designed and extremely sturdy. I place them inside my headboard/footboard frame, so that neither my mattress nor this foundation even touches the frame. Entire bed is now completely quiet. No squeaking, rattling or motion. So no wear and tear on my bed frame either. A bed skirt fits perfectly, without the usual frame impeding the corners. Mattress may tend to slide, so I zip-tied rug grippers onto foundation. The recessed legs can keep you from stubbing your toes. A great product. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Sharp consumer",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Good base",
      "text": "Quiet, sturdy, foldable for easy moving, not too heavy, compact, storage space underneath. I sliced up the box it came in to put under the mattress in the area that gets body weight on it, but that's probably not necessary. The mattress slides easily when there's not weight on it, so move the bed by pulling on the frame, not the mattress. When there's weight on it, it doesn't slide. It's a slight bit longer than the mattress so might peek out a bit, but you can put on a bedskirt or move the mattress a little.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Reid",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "Perfect for heavy weights.",
      "text": "This frame is amazing if you need something \"big kid friendly\" my fiancee is 6'3\" and 300 lbs I am 5'3\" 130 lbs and this frame doesn't budge, flex or squeak! It is perfect for the foam mattress. The only thing I would wish to change is to add an anti slip function of some sort. Either rubber grips on the top surface or raised border on top to stop the mattress from sliding around.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina A. Vacca",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Rock Solid",
      "text": "We love these frames. We have one for our queen size bed and we bought two more for our daughters' beds. These things are super sturdy, easy to set up and break back down, and after a year or so still completely silent, even during \"extra-curricular\" activities (and we are very tall and very heavy). There is also the added bonus of storage space underneath for bins 12\" and shorter. I am here buying another for our guest room. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Bay Area Mom",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "What I wanted",
      "text": "The unit came when promised but the shipping box was really torn to shreds and the bag of bolts for assembly was missing. Called Zinus and they promptly sent me replacements. Service couldn't be better or faster. By the way, the frame is exceptional, very strong, no squeaks but I did order a no slip topper for the frame as my mattress is none flipping and the bottom has a very slick cover. Not the frames fault but the mattress maker...name brand...Great Frame...",
      "rating": 5.0,
      "verified": true,
      "author": "buetre",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "A good sturdy product",
      "text": "A good sturdy product. Easy to set up. Reasonable weight to move around. Does not fully support a foam mattress like a Tuft n Needle that we have. The bars are too far apart. Needs to be retrofitted with what we call \"strapping\" up in Maine for better support. The strapping, which is cheap 1x3 basically, goes between the supports. An easy fix. My reasoning for using this versus luan plywood is that I still want the mattress to breathe through the bottom to reduce the tendency for foam mattresses to \"sleep hot.\"",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170616
    },
    {
      "title": "Very sturdy and tons of storage space!!",
      "text": "I was extremely nervous to buy this frame. Our previous frame was a cheap mall furniture piece of -. Our mattress is seriously heavy-( It takes three people to change the sheets!) So buying a frame that wouldn't fall apart and wouldn't break the bank was a challenge. It's pretty easy to put together (8months pregnant and did it myself). I was apprehensive to hop on top once hubby put the box spring and mattress on. It's been about a month and i couldn't be happier. There's also tons of underneath storage that fit 12-13\" tall storage containers which maximizes my small apartment space tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "Shoddle",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Supports futon mattress well",
      "text": "I had a futon frame that broke. Since it was for the guest bedroom, I tried finding a replacement, but didn't find a frame, and only a frame, that i liked that a reasonable price with shipping. I could have bought a frame and mattress, but what would I do with the extra mattress? Plus, the mattress I have is a higher quality and therefore thicker mattress. This came up in my search and works well. It supports the futon mattress fully, is a better height for guests, doesn't squeak and provides extra storage. So far, I haven't begrudged the extra floor space / lack of a couch.",
      "rating": 4.0,
      "verified": true,
      "author": "WyBibliophile",
      "helpful_votes": 6,
      "publication_date": 20140409
    },
    {
      "title": "Good price , good frame , reliable",
      "text": "I’m over 500 lbs and I’ll be honest very few beds last forever for me . This one has lasted longer than most . I’ve bougjt it twice , I might even buy another to keep in storage . The problem is when you add a second person and ( cough , cough ) physical activity shall we say lol , that’s when you can expect some supports to pop but , I wasn’t shocked and it’s still a very sturdy , comfortable frame .",
      "rating": 4.0,
      "verified": true,
      "author": "Jon in Chicago",
      "helpful_votes": 2,
      "publication_date": 20180715
    },
    {
      "title": "**Buy this foundation!!!!**",
      "text": "I absolutely love this mattress foundation! We are two larger adults probably weighing in close to 500lbs together and really have no issues with it. We replaced our old wooden box spring with this and couldn't be happier, we have a 11\" memory foam mattress that we just put directly on top of it. Pros- - completely silent - extremely sturdy - easy assembly - very affordable - provides ample under bed storage - great for memory foam mattresses Only con- - mattress moves around but would be easily fixed with a mat!",
      "rating": 5.0,
      "verified": true,
      "author": "Glsdoesgels",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Exactly what I was looking for",
      "text": "I purchased this metal foundation about a year ago. I have to say I am very pleased with it. Overall durability is excellent, assembly was very easy. The only reason I gave this a four star review is because yes, your mattress can slide around a little. But this is easily remedied by placing something in-between your mattress and the frame. Hopefully the manufacturer can make a new model that has the top of the foundation covered in a non slip material. I would happily purchased that model as well.",
      "rating": 4.0,
      "verified": true,
      "author": "MaO",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Solid and easy to assemble.",
      "text": "It took me less than 15 minutes to put this together once I took it out of the packaging. Although it came with instructions, I was able to put it together without even looking at them. Once assembled, it's as solid as a rock. One caveat: My foam mattress slid around on it, but it did that when I had box springs too. I'd recommend getting some anti-slip liners to put beneath the mattress.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "This frame exudes quality. I love it.",
      "text": "While waiting for delivery, I wasn't 100% sure if this frame was worth the extra it cost over other brands and other types. There are cheaper kinds out there that have wires instead of thicker beams and I didn't want to get those. So I took a chance and got this and I'm so glad that I did. This frame feels very solid and I can feel the quality. Assembly was easy too. I'm 100% satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Hokie High",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Just plain good",
      "text": "So nice I bought it twice. I had owned this bed frame for almost 2 years and was very happy with it. When I moved to another state I \"lost\" a lot of my stuff. So I bought the same frame again. I've had the 2nd one nearly 2 years now and I am still very happy. It doesn't squeak it's held up well and the height is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhiannon",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Great so far.",
      "text": "This was incredibly easy to setup and provides great support. Not having legs at the edges to run into is a godsend! I haven't had a problem with the bed sliding, but that will depend on your type of mattress. A mattress pad is cheap enough. The only question is long term reliability. I'll update if anything ever goes wrong. If you're looking to buy a metal frame, this is the one to buy!",
      "rating": 5.0,
      "verified": true,
      "author": "music man",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Slats too far apart, mattress sags through the frame",
      "text": "I bought this to use with my new Avocado Green mattress, but had to return it because the slats are much too far apart and so the mattress sagged badly (bulged through the slats even with nobody on the bed). It was very easy to set up and I like the bare-bones design, so it might work perfectly well if you're planning to put a box spring, boards, or some other support material on top of the frame, but it didn't do what it is presented as doing (\"box spring replacement\" is right in the title!).",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Great, Sturdy & squeek free frame!",
      "text": "I was worried about ordering this frame after reading the reviews, but... Folks listen to the Big & Tall people (6ft & over 200lbs). This is a GREAT bed frame! It does not move or squeak even during \"Couple-time\" and has ample storage for the cats super highway underneath. I even bought the brackets to mount my headboard. Works very well and at a Great price for the bundle under $125.00.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth W",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "I love this bed frame!",
      "text": "I love this bed frame! I have had it for over five months. It is made from strong, sturdy material and does not need a box spring. I have a Queen size memory foam mattress and it works perfectly. This frame is also tall enough to store larger than normal items, such as clothes baskets and medium sized boxes, if you so choose. The frame was fairly easy to put together, by following the enclosed instructions. The frame legs are rubberized, which has not harmed my floors and the frame does not move when you move.",
      "rating": 5.0,
      "verified": true,
      "author": "Determined Publishing",
      "helpful_votes": 0,
      "publication_date": 20180709
    }
  ],
  "product_meta": {
    "title": "Zinus Demetric 14 Inch Elite SmartBase Mattress Foundation for Big and Tall, Platform Bed Frame ,Sturdy , Noise Free , Non Slip, Queen",
    "description": "Size:Queen| Pattern Name:SmartBaseThe Next Generation Bed Frame - The SmartBase Elite Mattress Foundation by Zinus. The SmartBase Elite eliminates the need for a box spring as your memory foam, spring or latex mattress should be placed directly on the SmartBase. Uniquely designed for optimum support and durability the strong steel mattress support has multiple points of contact with the floor for stability and can support up to 500lbs. of evenly distributed weight. With plastic caps to protect your floors and an innovative folding design to allow for easy storage, the SmartBase is well designed for ease of use. Worry free 5-year limited warranty. Another comfort innovation from Zinus. Pioneering comfort. A footboard is not applicable for this product",
    "rating": 4.7,
    "feature_bullets": [
      "The smartbase elite eliminates the need for a traditional box spring and bed frame",
      "14 inches high with 13 inches of clearance under the frame for valuable under bed storage space",
      "Steel bed frame provides solid support for up to 4400 pounds Of evenly distributed weight",
      "Low stress, easy assembly in minutes with no tools required",
      "Folding design allows for easy storage and movement through tight staircases and doorways"
    ],
    "specifications": {
      "Product Dimensions": "80 x 60 x 14 inches",
      "Item Weight": "46.9 pounds",
      "Manufacturer": "Zinus, Inc",
      "ASIN": "B00BWC1X3S",
      "Item model number": "SM-SC-PRSK-14Q",
      "Customer Reviews": "4.7 out of 5 stars4,189 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#12,873 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Max Weight Recommendation": "4400 Pounds",
      "Is Assembly Required?": "Yes",
      "Warranty Description": "5 year limited manufacturing warranty.",
      "Batteries Required": "No"
    },
    "categories": [
      "Bed Frames",
      "Furniture",
      "Home & Kitchen",
      "Bedroom Furniture",
      "Beds, Frames & Bases"
    ],
    "price": 259.04
  }
}