{
  "website_summaries": [
    {
      "verdict": "Super-light hook-on high chair that still has a weight limit that is similar to other brands.",
      "pros": [
        "Fits tables up to 2\" thick and has a weight limit of 33 lbs",
        "Has padded back support and folds small enough to carry in a diaper bag",
        "Suitable for indoor or outdoor use",
        "Available in several colors"
      ],
      "cons": [
        "The 2\" thickness limit means this chair won't work with a fair number of tables"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Broke under light use",
      "text": "Used perhaps 20 times with out 5 month old. Went to clamp the chair to the table and noticed that the chair wasn't tightening. After investigating it looks like bolts are not threaded directly into the aluminum block. there is an extra component that is inserted into the aluminum block that acts like a thread for the bolts to screw into. Well... this little piece came out and good luck getting it back in. Very disappointed since this was working really nice however 20 uses within one month and the item breaks... unacceptable. If this get remedied I will update. For now 1 star.",
      "rating": 1.0,
      "verified": true,
      "author": "Ivan Trushin",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Love this chair",
      "text": "We agonized over which chair to buy. I am glad we picked this one. It is small and compact (took it on a plane trip and it fits easily in luggage). It is also very safe and sturdy. It clamps onto our wood table with a lip and seems like it would fit most tables because the clamps are adjustable. Messes can be wiped off with a damp cloth. Also, I've seen reviews about the leg holes being too small. My baby's legs are pretty chunky (10 months right now) and the leg holes seem fine. He likes to sit in it. I love this chair!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B",
      "helpful_votes": 3,
      "publication_date": 20171221
    },
    {
      "title": "Very durable.",
      "text": "This thing is dope. Our 7 month uses this on our dining table. It’s super easy to pack away. The only reason why I didn’t give this thing five stars is because it doesn’t fit on everything. Glass tables or anything too skinny are a no and tables with edges are a no and too thick of tables are a no. We went to some different travel settings and we couldn’t use it because the tables just weren’t compatible with it. We had to bring the bumbo for backup. This is super easy to clean and our baby loves being able to kick her legs",
      "rating": 4.0,
      "verified": true,
      "author": "Victor Lau",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Broke while in use - could have seriously injured child",
      "text": "We’ve had this a little over a year. My 26 lb 22 mo was in it and I noticed the zipper coming apart and she started slowly sinking. I grabbed her quickly and she was unhurt. I thought maybe my kids had touched the zipper and done something so I took it apart, lightly wiped it down and reassembled. The zipper seemed in tact and fine. The next day I put it back on and put my toddler in it and within a couple minutes the entire zipper came apart and my daughter was left dangling upside down at the counter. I was within steps of her and grabbed her but she could have been seriously hurt. Would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "lindseybh",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "A Must-Have for Feeding the LO!",
      "text": "Our LO has recently started on solid foods, and thankfully this chair fits both at our dining room table, and at our kitchen island. It is easy to set up, easy to move, easy to clean! No chance for little fingers to get pinched anywhere. It took a while for our LO to hold himself up in the chair, but after a few weeks of working on it, he's a pro now! Its got a sleek look to it, and its transportability is a lifesaver!",
      "rating": 5.0,
      "verified": true,
      "author": "SMR",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Poor Quality and Unresponsive Manufacturer",
      "text": "After only a week of use, the poor quality stitching on the waist strap retainer is coming undone. I tried to go through the manufacturer warranty process when I noticed the stitching was coming undone and received a confirmation email then nothing else. Sent 2 follow up emails throughout the week and still no response. Finally processed the return through Amazon since I'm still in the return window but will not be replacing with the same product. Opted to take the refund and buy the Fast Table Chair instead. I do not recommend this product due to the poor craftsmanship and the unsupportive customer service from the manufacturer.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "great portable high chair",
      "text": "This is small, compact, and very sturdy. I do not see why anyone with a table would not want this. Our only issue is the biggest/smallest table it can hold onto, our table is a hair larger some of the patio tables at our favorite restaurants are too small. We are going to make a table and will take that into consideration when building. We leave this in my truck for our 4 month old. We are going to buy one for home, too, when she is eating solids.",
      "rating": 5.0,
      "verified": true,
      "author": "Grizzzly",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Make the buy!",
      "text": "Just got it today! Right at dinner time to do it was perfect! Installed it to the table in less than a minute. Sooo easy and compact! Going to make traveling with my kids so much easier! Will most likely but another for my youngest. My daughter jumped around in it and was pushing on it as well while seated and it didn’t budge! Very happy buyer here!",
      "rating": 5.0,
      "verified": true,
      "author": "Nicholas Voeltz",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Can’t be used on tables with under lip edge",
      "text": "The arms are not long enough to fit on dining room tables or coffee tables that have a support lip ... first time I put my grandson in it to see if it was ok it snapped and fell (I caught him) but it’s wonderful for like a Bar but I purchased for specifically he could set at thanksgiving table with the family didn’t happen he was in bassinet and our family thanksgiving pic is missing one the arms need to be longer and able to clamp on to tables with a support edge!",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca L",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Amazing product",
      "text": "We absolutely love the two pods we bought on Amazon for our twins! We have taken them all over the place, to family's house for holidays, on vacations and we keep them in our car when going to restaurants in case the high chairs are terrible, broken or filthy. We are taking them overseas this summer because they are so compact which is their most impressive feature. They are SOOO sturdy and easy to set up. The thick rubber doesn't damage tables. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "HeelanCoo",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Easy to use and lightweight",
      "text": "I bought this before a trip with my 1 year old and was so glad we had it. It's super lightweight, very easy to assemble and just a great solution all around. My daughter is petit so I wasn't worried about other reviewers noting that the leg holes were too small...seemed fine for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Ingrassia",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Amazing, until the zipper broke",
      "text": "We absolutely loved this clip on chair. We bought it just over a year ago for a trip and have been using it to dine out ever since. Which is why I'm so bummed that the zipper just broke, making it unusable. We are well under the weight limit and have owned for just over a year. I'm hoping that customer care will resolve the issues quickly as we are traveling out of town next week and were planning on taking this gem with us.",
      "rating": 2.0,
      "verified": true,
      "author": "Melisssa",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Not secure",
      "text": "Echo of other one star reviews. We loved this chair, until the zipper split one night and my daughter fell through the center. She was not yet 30 pounds, and this chair states a weight limit of 33 lbs.",
      "rating": 1.0,
      "verified": true,
      "author": "Mamareview",
      "helpful_votes": 3,
      "publication_date": 20170822
    },
    {
      "title": "Worth every dollar",
      "text": "This product is excellent. Spent 6 months traveling south east Asia and Australia with a 6 - 12 month old, and this proved invaluable. It is certainly lightweight, but extremely strong. Easily packed into either our baby backpack as carry-on luggage, or into our medium sized suitcase as checked luggage. Simple to use, wide range of application in terms of table thickness, no issues to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Bowles",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Necessary Seat for the Dynamic Family",
      "text": "This. This is amazing. We have used it for about a month and LOVE it. We keep it in the car and it’s perfect to use when out and about. Small enough to carry with us (carry tote a total plus), it secures it tables safely without huge lips that take up table space. Out little one can sit AT the table with us and we few he is very secure. There is a belt to hook on the inside for further safety. If you are a family that likes to still go out and be social, you NEED this item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret C.",
      "helpful_votes": 0,
      "publication_date": 20190419
    },
    {
      "title": "Great for travel and eating out",
      "text": "More afforadable than other competing products, light and great quality! I've been using it for months now- I've been able to use it at restaurants and in laws' home. I've even been able to use it on a bar height table when I couldn't get seating in the dining area. I took it on vacation when bringing a high chair is not feasible to use in the Airbnb. Very easy to clean and comes with a thin carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "April Perez",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Her parents love how portable it is",
      "text": "Purchased this for my granddaughter. Her parents love how portable it is. It sets up quickly and works well. Don't have to use a high chair which allows more room at the table. Works on all kinds of tables.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Richards",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "So far, so good. Small and compact!",
      "text": "Bought this for an upcoming trip we are taking. It's very compact and light, so far so good. I may just put this in the car and take it to restaurants since we have a full size high chair in the house. Good product, I'd recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley S.",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Bonding Time All the Time",
      "text": "We LOVE this seat! It's a permanent fixture in our kitchen. Both our kids have sat in it and are snug and secure. It's great when you have to prepare meals or clean up with your baby close for supervision and chatting (you chat and they babble).",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce Blair",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "So Light!",
      "text": "This product is super light and will go with us on trips including air travel, which is why I chose this make and model. Will fit into a carry on or backpack nicely. Product opens larger than 2 inches although may not function as safely when openedmor than 2 inches. Se attached photo.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Hard to clean",
      "text": "We love mountain buggy products but this one has a huge flaw. While it does hold on well to our table, is easy to use, and strong, it is not easy to clean. You cannot complete take the seat out so you can’t put this in the washer. I spend a fair amount of time cleaning food off the seat because the material seems to hold onto it.",
      "rating": 3.0,
      "verified": true,
      "author": "amcayanan",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Chair broke after five months",
      "text": "I bought this chair in January, and the zipper stopped working correctly a couple of days ago. My 16 month son was in the chair when the zipper came unzipped, and he was dangling off the table inches from the floor.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa Parker",
      "helpful_votes": 5,
      "publication_date": 20170619
    },
    {
      "title": "it's nice to have as many restaurants don't have high chairs ...",
      "text": "This is a very convenient chair to have, my only complaint is that it doesn't fit on tables with thick sides. Anything more than about 2 inches and you can't use it. Overall, it's nice to have as many restaurants don't have high chairs or they are disgusting. It folds very compactly and it was great to travel internationally with.",
      "rating": 4.0,
      "verified": true,
      "author": "J Edwards",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Five Stars",
      "text": "Very high quality, spend the extra couple bucks over wally world. Update (9/5/2017): I want to reiterate how awesome this product is as we go into our 3rd year using the product. If you are outside a lot camping or something similar this is a must have for babies and toddlers. Our toddler is 2.5 years old and is getting close to the limit on this but it doesn't show any signs of stressing or sagging. The only rub is that one of the \"feet\" that is screwed on fell off as it became loose. Just make sure to tighten those up a few times here and there.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Best purchase",
      "text": "This is the one thing I have purchased for my grandchild that is used more than anything else! Better than a regular booster seat because it puts your child above the table height so he/she doesn't constantly put their mouth on the edge of the table and fits almost any table. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan H",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "BEST PORTABLE HIGH CHAIR EVER",
      "text": "This bad boy has been our life saver when going out to eat and when traveling! It was given to us as a gift and we have since purchased more for others! Hands down, best little travel chair out there. Super durable and very hard for our active little one to get out (hint: remove any chair from under them so they have nothing to stand on)! If I could, this would be the only baby gift I would ever get anyone!!!!!! It folds up and fits into a perfect little carrying bag. Don't waste money on anything else.",
      "rating": 5.0,
      "verified": true,
      "author": "James W O'Neal",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Best high chair for travel!",
      "text": "This is the best portable high chair! I love how small and light it is. We brought it to Europe for our 15-month old. It worked well at our in-laws house where there wasn't a lot of extra space at the table, and also at restaurants. We've used it extensively at home too. It's super easy to use and easy to clean. The leg holes are a little small, so it might not be as comfortable for a chunky baby.",
      "rating": 5.0,
      "verified": true,
      "author": "alyssa",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "I really like how versatile this chair is",
      "text": "I really like how versatile this chair is, will be perfect for traveling, I also like that you can put the cover in the wash (which I have already done, and did not affect the color at all and cleaned it thoroughly). My only complaint is that my babe sits pretty low, but she IS only six months old, I just wish there were a cushion or something that you could adjust the height. But overall I am happy with the product and feel it is worth the money.",
      "rating": 4.0,
      "verified": true,
      "author": "SNL",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Best bang for your buck!",
      "text": "Not only is this appealing to the eye, it is highly functional as well. At first, it seems too light to be a steady clip-on highchair. Boy, was I wrong. The clamps are industrial grade, with rubber tops that keep that bad boy in it's place, and baby safe. It is compact as it folds flat, so taking it on the go is easy peasy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Wasilewski",
      "helpful_votes": 4,
      "publication_date": 20160728
    },
    {
      "title": "i bought a couple more to give as gifts",
      "text": "good design, light, quick to dry, perfect for travel but good enough for daily use. only downside is the limited thickness of table this can be mounted on. i like this so much i bought more to give as babyshower gifts. all seem very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Extremely practical",
      "text": "We brought this with us on a 3 week trip for our 8 month old. It fit in our stroller so it was with us for the spontaneous meal times. Everywhere we went people stopped us to tell us how cool it was or ask us where we got it. Waiters and waitresses were also very pleased. I was hesitant to use it initially. I was worried restaurants would be worried it would ruin the tables or something but literally every place we went someone told us how amazing it was. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "NBox",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Great chair for thinner counters or tables",
      "text": "This is a great chair. It’s comfortable for my son and pretty easy to clean. The one downside is it doesn’t fit thicker tables or tables that wou have to get it around a wide edge. That excludes a lot of traditional extending dining tables",
      "rating": 4.0,
      "verified": true,
      "author": "David and Megan Ash",
      "helpful_votes": 0,
      "publication_date": 20190101
    },
    {
      "title": "Great purchase",
      "text": "We love it. It latches very securely and holds our child well. We bring it everywhere with us. It helps to be able to mount it on the side of the table rather then at the end of the table at restaurants. The only problem is taking her out of the seat. It is very difficult to pick her up and keep her from catching her feat and lifting the seat.",
      "rating": 4.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Great seat",
      "text": "This is a great seat! We get so many questions about it when we’re out. Our son is 25 pounds, 2 years old, and we’ve been using the seat for 6 months. Great for all kinds of tables and countertops. It can take two people to get him out sometimes as the leg hold openings and a bit tight and catch on his shoes but this hasn’t been a problem for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Best purchase I’ve made",
      "text": "This is one of the best purchases I have ever made. We use it all the time. We had to travel over Christmas to family who didn’t have a high chair so we brought this and it was perfect, it’s great for restaurants and coffee shops. My baby likes to be part of the action and this lets him be part of the group! I love this and it’s so easy to take apart to clean as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Pelland",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Great for grandparents",
      "text": "This great for me as a grandmother. I can fold away and hang up when not in use. Very portable and cane take with me instead of using public high chairs that may carry germs. Easily wipes off and I havre zipped off in. Ordrer to clean more thoroughly. I do wish I could throw it in the wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra Price",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Perfect!",
      "text": "Love it. Thankfully it arrived in time for our trip. Close call! Compared to the ones I saw in the store this is much more compact. I love that it allows my kiddo to sit at the table with us. We are staying in an apartment on vacation and it has been great! We haven’t moved it around but it would be easy. As other reviewers note, the leg holes are a bit small but our 11 month old is pretty lean, so works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "xds58",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Doesn’t fit all tables.",
      "text": "Very disappointed with this purchase. Bought it for travelling purposes. It fits very snug around my sons thighs it makes it really hard to put him in and take him out but not only that, it doesn’t fit on all tables. It works well on kitchen islands but when we try to put it on dining tables it doesn’t fit on many of them. My friend had a different brand and it was much more flexible with table types. So I say if you will use it for restaurants or kitchen islands it’s fine but know that t doesn’t fit all kinds of tables.",
      "rating": 2.0,
      "verified": true,
      "author": "ANDREW M COOK",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "This is super tiny and my chunky 20 pound eight month old ...",
      "text": "This is super tiny and my chunky 20 pound eight month old baby boy did not fit into the leg holes! Returned",
      "rating": 1.0,
      "verified": true,
      "author": "Stefanie ",
      "helpful_votes": 3,
      "publication_date": 20170718
    },
    {
      "title": "Now I can cook in peace.",
      "text": "It seeems like the cover can be taken off and washed in machine. I bought it intended to use when eating out, while trying it out in our Kichen counter, my son loves it so much that he refuses to come off. Later, he even asked to be put back on. He is a very active child, so this chair must be comfortable and give him a different view. I’m very happy to have purchased this chair.",
      "rating": 5.0,
      "verified": true,
      "author": "Florian and Lisa Voss",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "One of the best products for baby I've purchased",
      "text": "One of the best products for baby I've purchased. Use it several times a week at small group for dinner or at restaurants. So compact, light, easy to set up. I also have not run into a table I can't use it on yet, which was what I feared before purchasing. Like it better than the chicco caddy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Gold Jane",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Great but wish the clamps opened wider",
      "text": "I really like this except I wish the clamps could open a little wider, it doesn’t fit on my dining table, but it does on the kitchen island at least",
      "rating": 4.0,
      "verified": true,
      "author": "BrennaLynn",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "I love it.",
      "text": "I love this chair. It makes taking my son to restaurants much easier. He is a very large 6 month old. He sits a little low to the table but it works for now. I expect it to continue to serve us well for months to come. The carrying bag makes transport into the restaurant easy.",
      "rating": 5.0,
      "verified": true,
      "author": "HRB",
      "helpful_votes": 0,
      "publication_date": 20170513
    },
    {
      "title": "BEST THING EVER!",
      "text": "I never write reviews, but I love reading reviews before I purchase something. This is one of my top 5 baby products and I use it constantly! It is so sturdy, light weight and sits your baby high up to whatever surface unlike a normal highchair at a restaurant. We have had this for 5 months and we have used it more times than I can count. You won't regret this purchase...I am going to be purchasing this as a shower gift for all of my future mama friends!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah W.",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Love this chair",
      "text": "Love this chair. It is so light weight for taking with you. My grand daughter loves it and it fits my table that has a lip 6\" under the table. It fits on the table before the lip. It does not fit my daughter's table which has a lip on the outside edge of the table. The chair is well made and very sturdy when clamped down. Easy to put the table and take off.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Torres",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Game changer!",
      "text": "Definitely the more secure one tried this and another one and this is definitely a more solid frame. I feel super secure putting my baby in it and didn't have a problem with a gap or anything and he didn't have to lean forward so much to reach. Definitely a keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "J&E",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Great chair",
      "text": "Love this seat. We use it on our counter top island so that our 7 month old can join the family and it travels with us to various places. It's safe for wood surfaces too as the clamps have rubber. Our son seems a touch small for it yet but the straps are adjustable and fit to his size. It should last for a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Edub007Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "good 4 travel",
      "text": "Generally, we're pleased with this purchase. The seat is a little deep and it's OK sized now that our little guy is 11 months old. Prior to that he sat pretty far down - was well supported but it was more difficult to reach the table. Also the attachment is somewhat shallow so it doesn't work well with tables that have a skirt close to the edge of the table. Works great on our table, our concrete counters, and most restaurant tables. Very light weight and folds easily for travel",
      "rating": 4.0,
      "verified": true,
      "author": "Rain City Mama",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Incredibly dangerous",
      "text": "This had been our go to high chair for travelling. However, this past weekend, my 24 lb son FELL THROUGH when the zipper have out. We have only been using this for 6 months, probably 5 times total. It was one of the most horrifying things I have experienced as a parent. There are no backup safety mechanisms in place, in the event that the zipper fails, like ours did. I would absolutely not recommend this product, for the safety of anyone's child.",
      "rating": 1.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Easy to use and secure",
      "text": "This is perfect for the babe to eat at the counter while I am in the kitchen. Super secure and she seems comfortable. I haven’t yet but I plan on taking it along when we eat out. Folds up easy and into a little travel bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Lacy",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Really good, but not great.",
      "text": "I think this is a great option as opposed to a regular high chair. My toddler loves being at the same level as us. I bought another similar chair before this one that was a little too large to travel with. This one is so compact and easy to bring anywhere. There are a couple issues though. It doesn't open up enough for a number of tables that have a lip (including ours at home) and it is really, really annoying to get his feet and shoes out of the holes. And as his feet get larger, I imagine it's only going to be more difficult. It's actually a two person job to get him out.",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Perfect travel seat",
      "text": "Simply awesome. Little bucket seat was perfect! Easy to \"install\" (just tighten the winches) and extremely sturdy. Little peanut loved sitting right up at the table, and folds flat to travel! I saw other reviews that said there wasn't enough padding--well, there's no padding but with the design of the seat you don't need it. My whole family said they wished they made adult seats like this! :)",
      "rating": 5.0,
      "verified": true,
      "author": "J. Jessup",
      "helpful_votes": 0,
      "publication_date": 20141212
    },
    {
      "title": "Game changer",
      "text": "This highchair is so perfect for a small area. Instead of having a highchair in the way just clip it on your table! Awesome for traveling also: bring to the in-laws and clip it on the table.",
      "rating": 5.0,
      "verified": true,
      "author": "Bethani Hendrickson",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "This chair has been so useful from restaurants to friends houses",
      "text": "This chair has been so useful from restaurants to friends houses. Even when places supply high chairs they are usually too low for my petite 9 month old so this chair allows her to be closer to the table. Deducting a star because it doesn't work on tables that are thicker or those with an apron.",
      "rating": 4.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Makes for great spontaneous picnics!",
      "text": "These chairs are awesome. We always take it on trips. Easily clamps to nearly any kind of table.",
      "rating": 5.0,
      "verified": true,
      "author": "tig",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Easy, sturdy, clean",
      "text": "This is fabulous. You can put baby right up to the table with you. No worry about sitting in a dirty high chair. And it’s very stable and easy to set up. It folds flat and is easy to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Martin",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "great high chair!",
      "text": "this has been perfect in our kitchen...it's very sturdy and well made and will be going with us on vacation. it doesn't need a lot of space to hook onto, which is nice. some seem to have very long clips that need a wide surface and this is not one of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin Rhee",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Best highchair!",
      "text": "Love this highchair! It saves me so much space in my dining area. When it gets dirty (which is often) I can unzip it and wash it. I use it everyday 3 times a day. I’ve had it awhile and it’s still going strong!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Hawthorne",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great for travel",
      "text": "Great for travel - wish I could take the seat apart to wash but it does wipe off well. We baught it foe travel but use it everyday because out house is small - it looks great on thr table. Other then not being able to wash it I totally recommend this. Make sure it will fit on your able though just by fluke it will work with my...I can flip the table lip up in one section and it will work.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah G",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "I love the concept of having my grandson sit at the ...",
      "text": "I love the concept of having my grandson sit at the table with us, rather than a high chair. It is lightweight and easy to transport. It is completely safe, as it has clamps that you tighten to secure it to the table, and a safety strap to keep your baby in. The only drawback is that I have problems getting my grandson out of it. For some reason the canvas-type seat seems to pull up with his legs making it difficult to get him out.",
      "rating": 4.0,
      "verified": true,
      "author": "Kay",
      "helpful_votes": 0,
      "publication_date": 20170429
    },
    {
      "title": "Just What I Wanted!",
      "text": "The seat looks just as pictured. It is very sturdy, easy to install, and exactly what I wanted. The carry bag could be nicer. I definitely will never use it...cheap, cheap, cheap. Now I'll have to buy a bag.",
      "rating": 5.0,
      "verified": true,
      "author": "megaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "quick, sleek and easy to use",
      "text": "This thing is AWESOME. We took it on a cruise and it was perfect for our 6 month old who could sit up but for long without back support (regular high chairs weren't working for him just yet). We now take it to any restaurant for use so we know he's in something clean. It folds flat and requires minimal fuss to get setup/taken down.",
      "rating": 5.0,
      "verified": true,
      "author": "Cati",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Must have for restaurant goers",
      "text": "Super convenient. Absolute must have for the little ones. Never worry about finding a high chair. We get comments all the time. Our 3 year old is a tad too big for it now but we have been using it regularly since he was able to sit up on his own. Now our daughter has assumed control. This is a great item to leave in the car especially. Its a bit heavy to carry around unless you know you will need it though.",
      "rating": 5.0,
      "verified": true,
      "author": "Parabellum",
      "helpful_votes": 0,
      "publication_date": 20150717
    },
    {
      "title": "Great but claws won’t fit all tables.",
      "text": "Worked so well with my baby at other’s houses or restaurants. Claw won’t fit all tables though.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandra Saracho Fravel",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Great portable highchair",
      "text": "Love this chair. We used it all summer on our patio table so we could dine outside. Great for traveling also, folds flat. I hate bulky baby stuff, and this is nice and streamlined. Just wipe down to clean, or you can hose it off outside if it gets really bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristin DeKay",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Compact and very sturdy",
      "text": "Love that the clamp doesn't require a lot of counterspace and VERY sturdy. However it is a little hard to get my child in and out because the leg holes seem to not stay in place when I pull her out. The other Chico brand I bought was too bulky but the seat itself is nicer.",
      "rating": 4.0,
      "verified": true,
      "author": "Elyse",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "One of our favorite baby items.",
      "text": "I love this! We can use it at the bar top in our toy hauler and it's a total space saver. I should have gotten this a long time ago!",
      "rating": 5.0,
      "verified": true,
      "author": "Familylife",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "Absolutely love it!",
      "text": "This is amazing! The only downside is that it can't be used on tables with glass tops. We bring this everywhere and love that it folds down flat. It's easy to clean, fits in the diaper bag and is relatively lightweight. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "jgraves77",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "You will LOVE this!!!",
      "text": "Ok...this is a MOMMY MUST HAVE!!! I cannot say enough about how easy this has made it for our little one to have her own little spot wherever we go! This is one of the things I wish I had when my older kids were little!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne Snell",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Extremely solid, sturdy",
      "text": "This thing is amazingly sturdy and solid. We thought our son (who is strong) would be able to push against the table and slide the highchair off our counter, but there's no chance. I can't even do it. Much better than buying a $250 Stokke high chair. For now, anyways.",
      "rating": 5.0,
      "verified": true,
      "author": "T. J. Marshall",
      "helpful_votes": 0,
      "publication_date": 20171214
    },
    {
      "title": "Best product to buy!!!!",
      "text": "Best baby product out there! Our 8 month old crawled out of restaurant high chairs. This seat has been a lifesaver.",
      "rating": 5.0,
      "verified": true,
      "author": "Krista Roth",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Very disappointed that when we went camping we couldn't hook it ...",
      "text": "I tried this chair on a picnic table and our table at home, the chair didn't fit on either one of these. So far, the only thing that this chair fits on is our Island in our kitchen. Very disappointed that when we went camping we couldn't hook it to the picnic table. Other than that, very portable, very compact, would easily fit in a suitcase and not even take up much room at all.",
      "rating": 3.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Love it",
      "text": "This chair is awesome. Our six-month-old loves it! She's a bit on the smaller size (14-15 lbs), but the height is perfect for her. I love how portable this chair is - no more having to worry about where baby is going to be when we go someplace!",
      "rating": 5.0,
      "verified": true,
      "author": "vr2109",
      "helpful_votes": 0,
      "publication_date": 20170526
    },
    {
      "title": "Awesome seat",
      "text": "We take it everywhere, even use it at home. Doesn’t damage tables. Holds baby well. Small and compact at restaurants. Easy to clean. Baby likes it too.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "My 1 y/o does not like being set apart in a high chair and this ...",
      "text": "This has made dining out with a little one much easier. My 1 y/o does not like being set apart in a high chair and this is the perfect solution because now he can be a part of the action with the rest of the family. I keep it in the car under the passenger seat so we always have it. Wipes clean easily and is very stable when attached to the table as directed.",
      "rating": 4.0,
      "verified": true,
      "author": "Candice P.",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "Love it",
      "text": "Love this product. Easy to use and child sits next do you at the table vs in a dirty restaurant high chair",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "saw a couple using this for their baby at dinner... ordered at dinner",
      "text": "love this chair - perfect can go at the end of the table or in the booth - or at our breakfast bar. it is perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie Laffoon",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "Best baby purchase we’ve made",
      "text": "We love this chair. I bought it to use on vacation and it was so easy to pack and bring with us. Since getting home we now have it attached to our island counter and it’s a great way to have her in the kitchen with us. It is very easy to clean and to take on it off. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Fischer",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Must have",
      "text": "Great product. We discovered it because a friend had it and it’s awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "SS",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Perfect, low-profile, option",
      "text": "Perfect, low-profile, option. Easy to set up and use. We have a family of 8 so we needed to be mindful of space. This fits nicely to our table so everyone can sit down together. We don't have to worry about leaving it attached because it takes up little space.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelli",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "LOVE",
      "text": "Love this chair! Super sturdy, has not come loose at all on the table (paranoid mom here) and is semi-easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "Alexander Urquilla",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Best high chair we have ever owned",
      "text": "We love this high chair! It’s compact, baby is right next to us when we eat, and we don’t have to deal with a giant contraption of a high chair. It travels easily when we go to visit the grandparents, go out to eat, and even works great out camping. HIGHLY RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Incredibly solid and secure",
      "text": "Love this! Bought for grandchildren visiting and restaurant visits. Fits perfect at the island, very sturdy! Unobtrusive, like a big high chair, baby is super secure in it. Also folds so nice and in a carrying case for travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Mertz",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Nice seat, wish it seated our baby up a little higher.",
      "text": "This is a pretty great clip on seat, though the seat is pretty low compared to the table level, and there is no adjustment. When our toddler is sitting in this seat, the table top comes to his chest.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Get it!",
      "text": "Love it! Top quality! Less expensive than other brands but just as good or even better!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great seat, but small holes for legs",
      "text": "Seat mounts great but design and diameter of leg holes make it hard to get baby in and out and to fit in the seat. Our baby is 13 months and 21 lbs",
      "rating": 3.0,
      "verified": true,
      "author": "frank spindler",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Such a great clip-on chair!",
      "text": "A friend of ours had this for their LO and we instantly loved it. We looked at some of the other ones-they were a bulkier and more difficult to set up. The hooks turn in, folds together in 2 seconds. I can do this one handed while holding the baby. So much more simple than the other clip-on ones.",
      "rating": 5.0,
      "verified": true,
      "author": "PaiL",
      "helpful_votes": 0,
      "publication_date": 20150912
    },
    {
      "title": "It is very easy to set up and hauls nicely in the supplied ...",
      "text": "Use this thing everywhere, including in our home. It is very easy to set up and hauls nicely in the supplied bag. It is more compact than any other brand I have tried. I have purchased another 2 of these for my friends. Definitely a must have, much better than any others on the market that I have tried.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20150216
    },
    {
      "title": "Easy to transport",
      "text": "Great for travel or just an extra seat at the table instead of using a high chair all the time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "This is an idral seat to have when you live ...",
      "text": "This is an idral seat to have when you live in the city and space is limited. It's very compact. Big space saver. We have it attached to the bar overlooking the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180518
    },
    {
      "title": "Lifesaver!",
      "text": "Lifesaver! I leave these in my car for my twin babies. When we go to Grandma's house, restaurants, vacation, etc we have a high chair!",
      "rating": 5.0,
      "verified": true,
      "author": "Zachary B.",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Extremely satisfied with this well-designed product",
      "text": "Excellent product. Comes in a nice tote bag into which it fits snugly. Love the fact that it is collapsible for efficient space saving storage. Very sturdy frame. The clasps are of good quality and i have never had trouble with it in restaurants. I used it as a seat for my child's first birthday and it was a great idea because she was able to sit in it securely while we posed for photos!",
      "rating": 5.0,
      "verified": true,
      "author": "ahsannasha",
      "helpful_votes": 0,
      "publication_date": 20150817
    },
    {
      "title": "Great for most tables",
      "text": "Love this chair for at home or at restaurants. Way better than having to use a high chair and it is very secure. Only problem we have had with it is it not being able to attach to some tables due to how thin they are or if there is too large of an over hang under the table. It is very portable and comes with a carrying case which is nice.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin d.",
      "helpful_votes": 0,
      "publication_date": 20141207
    },
    {
      "title": "Very nice quality",
      "text": "This is the best chair to take with you ! Your babies don’t have to sit in dirty restaurant chairs! We have 2",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Roth",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Perfect portable highchair",
      "text": "I read the reviews for this high chair prior to purchasing this high chair. I originally purchased a portable high chair at a local store and found my countertops weren't deep enough for it to clasp to. I'm so impressed and happy with my purchase. My daughter loves it bc she can watch me cook too!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "This looks like a great product I was sad that I had ...",
      "text": "This looks like a great product I was sad that I had to return it. I have a 2\" thick marble table and the chair did not open far enough to hook onto table. Very disappointed because I was looking forward to using this chair.",
      "rating": 3.0,
      "verified": true,
      "author": "ajg006",
      "helpful_votes": 3,
      "publication_date": 20150202
    },
    {
      "title": "Great quality, but won’t fit a lot of tables",
      "text": "Works great for our counter, but it will not fit at our dining room table, or most restaurants. Great quality and easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181021
    },
    {
      "title": "5 stars for Mountain Buggy!",
      "text": "Great chair for baby on the go! Easy to clean. My husband and I can eat comfortably and have our baby sit still with her food.",
      "rating": 5.0,
      "verified": true,
      "author": "Catracha xica",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Chair is sufficient, however does not have a tray ...",
      "text": "Chair is sufficient, however does not have a tray and is not machine washable. These are big cons, wish I had spent a little more money and got the Phil and Teds.",
      "rating": 3.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "Awesome. Easy to pack and travel with",
      "text": "Awesome. Easy to pack and travel with, although it didn't fit in my carryon baggage. Super easy to set up, clean, and use.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer E. French",
      "helpful_votes": 0,
      "publication_date": 20170928
    }
  ],
  "product_meta": {
    "title": "Mountain Buggy Pod Clip-On Highchair, Flint",
    "description": "Color:FlintNeat, petite, and ready to eat. The POD portable highchair is a smaller, lighter and easier addition to the table, at home and away. The POD is extremely versatile with the ability to clamp to most tables and bench tops, making it perfect for indoor and outdoor use. Manufactured with a strong aluminum frame (the same material our buggy's are manufactured from), clamps are safe and robust with non slip grip pads and has a padded back for enhanced postural support to keep your child comfortable for longer. Extremely compact so the POD fits easily into hand bags, buggy gear trays or compact storage. Weighs a mere 2.2 pounds, has a maximum seat load of 37 pounds, includes a recyclable carry bag for the family that is on the go and comes in three colors (black, flint and lime). This product is intended for children able to sit up unaided and up to a maximum weight of 15kg",
    "rating": 4.5,
    "feature_bullets": [
      "Clamps on to most tables and bench tops; 0.8\" up to 2\" thick and suitable for indoor and outdoor use",
      "Weighs just 2.2 pounds and has a compact fold to fit easily into diaper bags, purses, and buggy gear trays",
      "Comes in three colors (black, flint and lime) and includes a recyclable carrybag",
      "Aluminum frame with padded back support, a shoulder harness system and robust aluminum clamps with non slip grip pads; Holds up to 37 pounds",
      "Not suitable for use on glass top tables, tables with loose table tops, table leaves, single pedestal tables, card tables, camping tables, or tables with rounded or beveled edges or lips"
    ],
    "specifications": {
      "Product Dimensions": "12.2 x 13.4 x 9.8 inches",
      "Item model number": "POD_V2__7",
      "Is Discontinued By Manufacturer": "No",
      "Target gender": "Unisex",
      "Maximum weight recommendation": "37 Pounds",
      "Material Type": "Metal",
      "Number Of Items": "1",
      "Style": "Modern",
      "Batteries required": "No",
      "Is portable": "No",
      "Item Weight": "2.2 pounds",
      "ASIN": "B00BMNW9R6",
      "Customer Reviews": "4.5 out of 5 stars461 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#18,774 in Baby",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Booster & Hook-On Seats",
      "Baby Products",
      "Highchairs & Booster Seats",
      "Baby",
      "Feeding"
    ],
    "price": 59.99
  }
}