{
  "website_summaries": [
    {
      "verdict": "With its long lens and compact size, plus extras like built-in Wi-Fi and GPS, the Nikon Coolpix S9500 is a very good point-and-shoot travel companion.",
      "pros": [
        "The well-priced Nikon Coolpix S9500 has an impressive zoom range for its size and weight",
        "It has a full assortment of automatic shooting options and can capture HD movies as well as slow-motion clips",
        "Built-in Wi-Fi allows you to directly send photos from the camera to iOS or Android devices"
      ],
      "cons": [
        "Picture quality drops off indoors or in low-light conditions",
        "Autofocus can be finicky under those conditions as well as when fully zoomed in",
        "If semimanual and manual controls are a necessity you're out of luck, and its flash is poorly placed"
      ],
      "aspects": {
        "Design": 8.0,
        "Features": 8.0,
        "Performance": 7.0,
        "Image quality": 7.0
      },
      "publication_date": 20130917,
      "rating": 7.4,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Nice little camera",
      "text": "This was purchased for our 13 year old grandson. We selected this particular model from the many available primarily because of the size of the zoom and also that it has a rechargeable battery. Although some reviews seem to favor regular AA's, we know the amount of disposables would be hefty. I purchased an additional battery and separate charger so that he always has enough for extended use. This camera has all the bells and whistles you could need but the best thing is the quality of the pictures, which are excellent for a camera this size and price range.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 3,
      "publication_date": 20140128
    },
    {
      "title": "Rarely focuses in low light.",
      "text": "Not impressed with this camera. I use this to take pictures inside and outside, and inside, it will not focus reliably. I am constantly getting the \"red square\" indicating I do not have focus lock when I'm shooting in low-light. And by low light sometimes that means with the window open and the room light on. I constantly have to move it around to a scene where there is some contrast before it will lock. The infrared beam is clearly projecting, but it doesn't seem to be helping much. I have everything set to auto, and my older Canon had no problems at all taking these shots. The Canon would focus in complete darkness. Very disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "The Sagebrush Kid",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "S9500 is REally Nice!",
      "text": "I love this camera. I am a semi-professional photographer, and this camera is my go to when I dont want to carry my large SLR Nikon. This takes really nice low light pictures without flash even with an F3.4 lens. ISO up to 3200, macro mode, 16 scene modes, adjustable white balance, GPS, WI fi compatable ( to send to other device) and selectable 99 focus points> If you are pretty familiar with camera operations, you should enjoy this camera. If new to photography, this camera is still suitable, if you take the time to read the manual, or just put it on auto mode and shoot. Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Arrow Flight",
      "helpful_votes": 0,
      "publication_date": 20140212
    },
    {
      "title": "Very cool camera!",
      "text": "I have a Nikon 3100, but I hate lugging it around. This is exactly what I was looking for. I wanted high definition as well as a strong zoom. 22X...... Boo-yah! I had read that some folks could hear the motor focusing while they were taking videos. I haven't noticed that concern so far. Very happy with this dandy little camera. My son asked for my opinion on a camera. He also bought this camera, and is also very happy with it's diversity. He lives in the Rockies and has kids, so has multiple opportunities to use the various capabilities of this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 2,
      "publication_date": 20131030
    },
    {
      "title": "Great camera",
      "text": "I almost hate to admit that this camera takes photos that seem every bit as good as my old Nikon D70 digital SLR! Very nice camera. The only negatives, as others have pointed out, are: (1) The GPS functionality is always on once it is activated -- even when the camera is off. This tends to drain the battery when you least expect it and (2) the pop-up flash always seems to strike my fingers. But these are minor annoyances, really.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Ford",
      "helpful_votes": 0,
      "publication_date": 20150322
    },
    {
      "title": "Great camera",
      "text": "My workhorse camera is a Canon dslr with a couple of nice lenses but there are times that I don't want to haul around the big camera bag. Canon doesn't have a handheld comparable to this Nikon, and I'm very happy with the pic quality. The optical zoom is amazing, I was able to get a close up of a face on stage from the opposite corner of a high school theater. You can't go wrong with this camera. The only drawback is that the charger is fairly large considering it's just a USB plug.",
      "rating": 5.0,
      "verified": true,
      "author": "Colorado Cruiser",
      "helpful_votes": 0,
      "publication_date": 20140122
    },
    {
      "title": "Great Camera",
      "text": "I bought this for my wife for her trip to New York City with her two daughters and two granddaughters. We have a full size Nikon but she wanted a small compact one. She was extremely pleased with it along with the features that the girls figured out. There were not shortage of pictures on the trip and many of them came back to me in near realtime. She still favors this over the full size camera. I would strongly recommend it or the newer replacement if one already exists.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Thornton",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Nikon S9500",
      "text": "Nice little camera. Doesn't look like it but the color is rough and easy to grip, we were expecting a slick anodized body that slipped out of our hands but it grips nicely. The Wi-Fi is kind of hokey, it downloads slowly with my iphone 5 but it is a nice little feature if you don't mind a few minutes to set it up each time to take selfies or to wait for that perfect shot. Lots of built in features including exposure adjustment to help lighten up darker shots.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Lovatt",
      "helpful_votes": 0,
      "publication_date": 20140227
    },
    {
      "title": "Goog condition",
      "text": "I ready had one and brought this one for replacement ,this product has been discontinued. I recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "alpha",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "Awesome camera",
      "text": "I already Nikon Coolpix s 6500 12 x wide fullHD. With wi fi. But s9500 is a miracle. If you like travelling, taking a lot of photos then forget where you had taken them, then this is the camera you need. Thanks to the GPS feature, you keep track of your own trip with date and time. If you are planning to purchase a camera, go for it. You wont regret!",
      "rating": 5.0,
      "verified": true,
      "author": "FACTS MAY AT TIMES BE FRUSTRATING",
      "helpful_votes": 5,
      "publication_date": 20130901
    },
    {
      "title": "Great product combining both quality you get for the price",
      "text": "Wonderful quality product for the price. Great portability and ease of use while still providing a great picture is all a plus",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin C.",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "Great camera, great picture.",
      "text": "This takes a great picture and I can't believe the close up view/picture I can pull in with the zoom! I bought 2 extra batteries and SD card but in 2 weeks of a lot of use I think I charged the battery twice. I was expecting to charge it daily since it was getting used a lot but that wasn't necessary (I over prepared myself with taking 2 extra batteries from another review I read once). I am glad I took extra batteries just in case though.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Decent used camera",
      "text": "Bought this product used. Works well and received in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "JJLEX",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "I have always had a Nikon Coolpix and they are usually great cameras.",
      "text": "This camera was okay but I had a defect. The zoom kept getting stuck in the open position. The company gave me a prompt credit and offered to send me a replacement or another model. I opted to do a little more research. I have always had a Nikon Coolpix and they are usually great cameras.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara Modeen",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Not as good as expected",
      "text": "Lot's of technology in this. Case seems cheaply made, to cut on costs. Do not like the pop up flash (preferred the built in of my old Lumix), particularly as it pops up right where I usually put my left index finger. Standard pictures are generally good. But the flash, at shorter ranges, frequently leaves the picture over exposed. Have had some issues with focus and sharpness, beyond what would be normally expected, on higher zoom shots. Got a good price on this camera, but would not buy it again.",
      "rating": 2.0,
      "verified": true,
      "author": "John S",
      "helpful_votes": 2,
      "publication_date": 20131227
    },
    {
      "title": "Takes very nice photos!",
      "text": "I bought this camera so that I would have a small digital camera for traveling (I normally use a Nikon D7100 DSLR). I have been particularly pleased with how fast it focuses. The thing I like the least about the camera is how the flash pops up...it seems like it could easily break. I am careful with it though, so hopefully that won't happen. I have only had this camera about a month, so far I really like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Linty",
      "helpful_votes": 0,
      "publication_date": 20130829
    },
    {
      "title": "Awesome!!",
      "text": "Easier to use than my full size digital SLR camera. Small enough to put in pocket. WiFi enabled to see photos/edit on iPad or iPhone without having to go home to upload and post on social media using Nikon App. Sync's with GPS without wait before taking photos. Great photo quality. Cons: None at this time Would recommend to friends and family",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald W. Dvorsky Jr.",
      "helpful_votes": 3,
      "publication_date": 20131003
    },
    {
      "title": "Tiny package with grand features",
      "text": "bought this for travel. So small it is easy to tote. Love the GPS - can see where we were on vacation! and I replaced another brand camera - The batteries last on this camera I was prepared to change frequently and I did not have to. Beautiful photos and great zoom I am over the top happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Darbys Mom",
      "helpful_votes": 4,
      "publication_date": 20131017
    },
    {
      "title": "Odd focusing in low light",
      "text": "I've owned several Nikon Coolpix cameras and wanted this one for its high zoom capability. Unfortunately, the camera's inability to focus on things in low light caused me to return this one. I also did not like the pop-up flash which was located exactly where you hold the camera. This camera might be suitable for someone who wants to adjust settings, but if you are looking for a true point and shoot that auto focuses quickly, this is not the camera for you.",
      "rating": 2.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 4,
      "publication_date": 20130816
    },
    {
      "title": "Fine Small Camera - Some Auto Focus Problems",
      "text": "Some auto focus problems on certain settings, but with practice these are not an issue. This small camera works great. Beats cellphone cameras all hollow, IMHO.",
      "rating": 4.0,
      "verified": true,
      "author": "Ron C.",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "... the case for the old model It is a great size and overall I like the",
      "text": "The lens when extended does not open all the way and you have to do it manually got this instead of the new model because I was going on a trip a week before the new version came out Also I had multiple batteries and the appropriate charger as well as the case for the old model It is a great size and overall I like the camera",
      "rating": 3.0,
      "verified": true,
      "author": "Sheila Gallagher",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "Overpriced piece of crap.",
      "text": "First of all, a big thanks to Amazon for selling this for $50 more than Best buy and then not allowing returns for this junk Nikon calls a camera. Flimsy construction and terrible controls. The flash pops up whenever it feels like it, and it is positioned terribly. More often than not your hand or finger will be over it when you actually intend to use it. I only had it for about two months before the OLED screen completely failed rendering the camera totally useless. I should have stuck with Canon and I will never buy a Nikon again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon sucks",
      "helpful_votes": 2,
      "publication_date": 20131226
    },
    {
      "title": "Nikon Camera",
      "text": "I cannot say this enough...I LOVE MY NEW CAMERA !!! I previously owned a Nikon digital camera for 4 years with absolutely no problems until recently when it would not hold a charge & would shut itself off in the process of using it...I love taking pics of family & friends, scenery, & just plain life...when I had the option of getting a new camera, I searched all the Nikon options...then narrowed the list down by doing research on the best fit for me & my needs ! LOVE LOVE LOVE this camera !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Schultz",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "... this camera for real estate photos and find it excellent because it has a \"backlight\" setting which enables you ...",
      "text": "I use this camera for real estate photos and find it excellent because it has a \"backlight\" setting which enables you to shoot toward windows and pick up the objects outside through the window. This enhances indoor shots.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "DavisMax - they are a GOOD COMPANY to work with!",
      "text": "I complained about DavisMax...but after getting to the right person the problem I had with customer service was addressed. I appreciate that they didn't just stop talking to me - they stayed in contact and made sure I was satisfied. THANK YOU DavisMax for addressing my concerns",
      "rating": 5.0,
      "verified": true,
      "author": "L. Grendahl",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Great iPad/iPhone app as well!",
      "text": "I'm very pleased with this camera in all areas mentioned in other reviews. One thing I haven't seen mentioned is that there is a Nikon app for iPad and iPhone that syncs up with the camera (its called \"Nikon Wireless Mobile Utility\"). It's really easy to use once you have it set up. Basically you can view and save all your photos on your iPad via wireless network. This app makes it unnecessary to remove your SD card from your camera, The days of dragging and dropping files are over!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt P",
      "helpful_votes": 0,
      "publication_date": 20140107
    },
    {
      "title": "Great Camera",
      "text": "Well, for me, this camera is as close to having a full size SDLR as I could get on my budget. It takes great photos and the 1080p video looks beautiful. Lots of different options for individually creative shots. I highly recommend this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt717",
      "helpful_votes": 2,
      "publication_date": 20130922
    },
    {
      "title": "Great Camera for the Price",
      "text": "An excellent camera! It has so many features one would like such as: when shutting the camera down the eye automatically closes and protects the lens, so easy to use, lightweight, durable, great wide-angle zoom. I put a clip on the case and carry on my side or on a hook suspended from either fishing or motorcycle riding gear. It also has a long-lasting battery, but I purchased an extra one which easily stores in a pocket on the camera case. The size is ideal for travel and pictures quickly download.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ Rodgers",
      "helpful_votes": 0,
      "publication_date": 20131217
    },
    {
      "title": "broke after a month - never really worked that well",
      "text": "I have an older version and thought it was time for an upgrade. I should have followed the rule of if aint broke don't fix it. Anyway after two weeks the battery would not charge so had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "J Dog",
      "helpful_votes": 3,
      "publication_date": 20140125
    },
    {
      "title": "Shutter stopped working.",
      "text": "It was Ok but the shutter button started acting up and stopped working after 1 1/2 years.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul S.",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Very nice camera",
      "text": "Hubby is crazy about this camera. All features work fine. Would make the flash brighter, and put it's mechanism in a location on the camera that doesn't hit your finger that holds the camera steady.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Olson",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Nikon COOLPIX S9500 Wi-Fi Digital Camera with 22x Zoom and GPS",
      "text": "- Super zoom - size is suitable - must have memory card for storage - quality of videos are great - easily adjusted settings - I recommend for non professionals photographers",
      "rating": 4.0,
      "verified": true,
      "author": "Amr Arafat",
      "helpful_votes": 0,
      "publication_date": 20131229
    },
    {
      "title": "Good pictures and features",
      "text": "We've had this for over 1 year. Battery will not keep charge, so when wife pulls from purse it will not work. Also, she is left handed and the flash pops up awkwardly for her. Good pictures and features, otherwise.",
      "rating": 3.0,
      "verified": true,
      "author": "NGM",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Great camera",
      "text": "I have several Nikon cameras including a small S630 & a large SLR I wanted something as small as the 630 with more functions & better zoom. The 9500 fills my need perfectly. The one I purchased is refurbished but looks & functions like new. I couldn't be more pleased",
      "rating": 5.0,
      "verified": true,
      "author": "BO",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "it is cool and perfect potable with you",
      "text": "I like it so much, since it is very convent to take anywhere. The photos is very good, and the lens is very useful to use in any circumstance. It also have many functions to make photo taking very convient.",
      "rating": 5.0,
      "verified": true,
      "author": "huangfeihong",
      "helpful_votes": 0,
      "publication_date": 20131231
    },
    {
      "title": "looked for a while",
      "text": "couldn't find a camera for someone technologically challenged. this one seems to have less adjustments (many can be done automatically) and it produced super pictures! the flash seems to be popping up a lot. battery did not hold the charge very long. be careful you are not pushing the video button. i will have to read up more on this for long trips. just bought the camera..so far, so good. i need to do my homework too.",
      "rating": 4.0,
      "verified": true,
      "author": "barbara thomas",
      "helpful_votes": 0,
      "publication_date": 20140217
    },
    {
      "title": "Will have to return",
      "text": "Immediately the lens cover didn't open and I had issues with camera on my entire trip to France. It is so disappointing because I bought it just so I could have great pictures on my trip.",
      "rating": 1.0,
      "verified": true,
      "author": "zeusqueen62",
      "helpful_votes": 2,
      "publication_date": 20131214
    },
    {
      "title": "fantastic",
      "text": "the last camara i had people kept saying me the pics were not good, with this one, everytime i hear commpliments about the pics!! the zoom is great!!",
      "rating": 5.0,
      "verified": true,
      "author": "daniella",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Great camera",
      "text": "It's perfect! It's everything I wanted in a compact camera. It takes great pictures, including action shots. I brought it to a Red Sox game and the people behind me couldn't believe how clear the shots were. Looking forward to taking lots of pictures of my new grandbaby with this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "nomosob",
      "helpful_votes": 2,
      "publication_date": 20131011
    },
    {
      "title": "Nikon with GPS",
      "text": "I love this camera. I bought it just before we went to Disneyworld in Orlando. It took the most amazing pictures and videos at night. The details were so vivid and clear. It's easy to use. I would recommend it to everyone.",
      "rating": 4.0,
      "verified": true,
      "author": "Arlene",
      "helpful_votes": 0,
      "publication_date": 20140125
    },
    {
      "title": "Is not compatible with Samsung Galaxy S3",
      "text": "I bought this camera mainly for the WiFi feature. I wanted to be able to upload my pictures to social media sites when I take them. I love the camera size, zoom and the pictures. However, it states you can sync with your smartphone, but it does not tell you it will not work with all of them. So make sure your phone is compatible before you buy it. If I would have known this issue with the Samsung phone, I would not have purchased it in the first place.",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara Holmes",
      "helpful_votes": 0,
      "publication_date": 20140328
    },
    {
      "title": "Fantastic Point and Shoot!",
      "text": "This camera takes amazing pictures. This easily beats my two previous Sony cameras of similar size. The pictures are more focused and the color is amazing. Great point and shoot.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian M",
      "helpful_votes": 0,
      "publication_date": 20131127
    },
    {
      "title": "Better than expected",
      "text": "My wife comments \"boy does this take great pictures!!\". The options work great, like close up, zoom, panorama etc. The only draw back is the location of the flash, It is where you put a finger to hold it.",
      "rating": 5.0,
      "verified": true,
      "author": "Someone",
      "helpful_votes": 3,
      "publication_date": 20130602
    },
    {
      "title": "new camera",
      "text": "i had the previous model which i just wasnt happy with so reverted to the model before that, then met a fellow traveler who had been given this by friends and loved it - i saw her pictures and decided i needed to get this.......and i am very happy with it - gave my other one to my sister. Would highly recommend it for good quality point-and-shoot with great zoom ABC, Boonton, NJ",
      "rating": 5.0,
      "verified": true,
      "author": "ANNE BLACKWELL COLLINS",
      "helpful_votes": 0,
      "publication_date": 20130709
    },
    {
      "title": "Great camera for casual use",
      "text": "Great camera for casual use. Easy to use, nice photos, wide array of options--or set to \"auto\" and shoot winners every time. Grab for this camera over and over.",
      "rating": 5.0,
      "verified": true,
      "author": "WryEye",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "One Star",
      "text": "It stopped working shortly I got it for no - it charges up but will not take pictures",
      "rating": 1.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20150430
    },
    {
      "title": "Great pocket size digital camera.",
      "text": "Got this for my husband and he really enjoys using it. It takes super pictures and is very easy to use. The ability to transfer pictures wirelessly is a great feature. I would highly recommend this camera for anyone wanting a small digital camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparkle Plenty",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "The camera likes to take blurry pics. Overall its ...",
      "text": "The camera likes to take blurry pics. Overall its decent but I've had a lot of issues with Nikon in the past and think it's time to try something else.",
      "rating": 3.0,
      "verified": true,
      "author": "Shawn Gillie",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "Batter problem",
      "text": "The camera battery will not stay charged. Put it into the camera and it looks as if it is fully charged and within 10 photos it dies. I ordered 2 additional batteries and they do the same things. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "KathleeG",
      "helpful_votes": 9,
      "publication_date": 20130911
    },
    {
      "title": "Why did I choose this rating?",
      "text": "Recently purchased the Nikon CoolPix S9500 for a gift. First the service was excellent and on time tracking was great. Secondly, this the third Nikon camera that I have purchased and the quality is really unbelievable. Took pictures the other night of the Empire State Building and the colors were just spectacular. Love this camera.",
      "rating": 5.0,
      "verified": true,
      "author": "DIana Gutta",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "This is a great little camera",
      "text": "I love this for my point and shoot camera when I do not want to carry all my gear. I love the GPS feature and all the effects. It's light and compact.",
      "rating": 5.0,
      "verified": true,
      "author": "Lois B.",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "nikon coolpix s9500 wi-fi digital camera",
      "text": "I love my new camera:) It has met and surpassed all my expectations I wanted in a digital camera. I still have to learn more about its features and look forward to doing so. I am so happy my friend suggested this camera to me. She bought one and used it on a vacation cruise in New Zealand and was very pleased with it. I love the zoom feature the most so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Sue Markowski",
      "helpful_votes": 0,
      "publication_date": 20140124
    },
    {
      "title": "Great camera for the price",
      "text": "I love this camera! This is the second Nikon I have owned and love the quality of picture that it takes. The zoom allows you to get in very close without losing clarity of the picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy Graham",
      "helpful_votes": 0,
      "publication_date": 20140103
    },
    {
      "title": "This camera occasionally looses all settings. You will need ...",
      "text": "This camera occasionally looses all settings. You will need to constantly check if the GPS is on if you want this feature. Back from a trip only to discover 800+ photos with no GPS data. Even an iPhone records the GPS location without problem! The main reason I bought this camera is because of the GPS. Additionally there is no way to turn the flash off permanently, it keeps comming back on--other than museum mode. Also the camera want's to use the flash when it is not needed. Buy a second battery and charger, make sure you have the charged spare battery with you, the charge may not last the day.",
      "rating": 1.0,
      "verified": true,
      "author": "D. Grassi",
      "helpful_votes": 0,
      "publication_date": 20141001
    },
    {
      "title": "Lens had dust speck inside",
      "text": "Camera works fine, however it came with a dust speck inside the lens. I had to use a vacuum to remove it instead of returning the camera. Examine the lens closely with a flashlight before you use it.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve H",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "Great Camera",
      "text": "I purchased this camera after my wife dropped my Nikon s9300 with the lens extended. I loved the s9300 and am very happy with the s9500.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20131224
    },
    {
      "title": "camera defective",
      "text": "original camera did not operate......replacement camera did not operate both returned to vendor. Contacted Nikon who could not correct the problem",
      "rating": 1.0,
      "verified": true,
      "author": "bill caldwell",
      "helpful_votes": 3,
      "publication_date": 20140316
    },
    {
      "title": "disappointed",
      "text": "Unfortunately the wifi feature was not easy to set up and use, which is one of the reasons I bought this camera. And after comparing the photos from this camera to the photos from my iphone 5s... they looked pretty much the same. And my iphone is way more convenient to upload photos to sites like shutterfly or instagram and facebook.",
      "rating": 2.0,
      "verified": true,
      "author": "mpanas",
      "helpful_votes": 0,
      "publication_date": 20140624
    },
    {
      "title": "best point and shoot on the market.",
      "text": "We originally had ordered this camera to have on our wedding trip. unfortunately do to shipping restraints it was never received. We did finally get one though and it is simply amazing. It takes fantastic pictures and has a tremendous amount of options for such a small camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave-az",
      "helpful_votes": 0,
      "publication_date": 20140224
    },
    {
      "title": "Four Stars",
      "text": "Good camera for my teenage son or anyone... Decent pics!",
      "rating": 4.0,
      "verified": true,
      "author": "Jan Jan",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "zoom on in to this great deal",
      "text": "Wow, what a great camera! Awesome wifi and picture quality. The 22x zoom is really precise, truly amazing and something to see!",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Love it had S8100 and upgraded to S9500 what a difference",
      "text": "LOVE IT I had S8100 and loved it too...This one is a little faster and has great timing... I had my other camera for over 6 years and it was time to upgrade, and I still have it.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Teets",
      "helpful_votes": 0,
      "publication_date": 20141031
    },
    {
      "title": "Super",
      "text": "I love this camera. It is a wonderful addition to the SLRs that I have. It is quick, responsive, and takes wonderful pictures",
      "rating": 5.0,
      "verified": true,
      "author": "Rajiv Chopra",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "Wonderful buy, great price.",
      "text": "This camera is better than your standard snap and shoot. And I got it refurbished for about $100 less than what they have listed price at Best Buy. I love its recording capabilities and the microphone on it for You Tube videos.",
      "rating": 5.0,
      "verified": true,
      "author": "DC 423",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "camera",
      "text": "camera is great. need to learn a lot more about it but the zoom is amazing and the shots are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Liskiewicz",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "What Happened?",
      "text": "The camera started out great but stopped working after 3 months. In fact I should check on getting a refund.....",
      "rating": 1.0,
      "verified": true,
      "author": "KK",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "great size",
      "text": "excellent small sized camera , Great zoom (22), Great pixels (18). Lots of optional features and settings. Will be my travel camera for sure",
      "rating": 5.0,
      "verified": true,
      "author": "russel g watson",
      "helpful_votes": 0,
      "publication_date": 20140517
    },
    {
      "title": "Great Camera",
      "text": "This little camera takes great pictures, tucks in my purse so I always have it with me and is a ton of fun to use. It's perfect for an amateur picture taker like me.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorraine S. Nolan",
      "helpful_votes": 0,
      "publication_date": 20140331
    },
    {
      "title": "Shutter sticks",
      "text": "I bought this Nikon because I liked my last one. However, the shutter would not open on my old one, so I replaced it with this one. Now, I have used the new Coolpix for one vacation, and the shutter is sticking on this one. I have had it less than 2 months and I am going to Peru in a couple weeks. I'm not happy to say the least.",
      "rating": 2.0,
      "verified": true,
      "author": "James A. Mulvany",
      "helpful_votes": 0,
      "publication_date": 20140425
    },
    {
      "title": "excellent camera for both snapshots and video",
      "text": "This camera exceeded my expectations. The pics are sharp and clear and the video surpasses my camcorder videos by far.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Travis",
      "helpful_votes": 0,
      "publication_date": 20140220
    },
    {
      "title": "Great size",
      "text": "The pixels . Email and the size convenient of this camera were the deciding factor in choosing this camera over other models and makes",
      "rating": 4.0,
      "verified": true,
      "author": "Hill girl",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Satisfied owner, thousands of pictures later!",
      "text": "A great little camera, shoots close up s better than expensive DSLR !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie",
      "helpful_votes": 0,
      "publication_date": 20140928
    },
    {
      "title": "Cool, new gadgets",
      "text": "I upgraded from a Nikon Coolpix 8000; what a difference! I am so happy that I purchased this product! It has many of the \"bells and whistles\" of much larger cameras!",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa A. Wohl",
      "helpful_votes": 0,
      "publication_date": 20130906
    },
    {
      "title": "Unable to connect",
      "text": "Unable to connect to wi-fi. Multiple attempts. Frustrating... Not even instruction manual!! Will not buy from them again!!!!!!",
      "rating": 2.0,
      "verified": true,
      "author": "nilo valdez",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Have not been used much as yet. However the ...",
      "text": "Have not been used much as yet. However the covers for the ports are a bit tricky to re-close and manoeuvring around the flash is a bit awkward.",
      "rating": 4.0,
      "verified": true,
      "author": "Trini Mum",
      "helpful_votes": 0,
      "publication_date": 20140717
    },
    {
      "title": "Great Camera",
      "text": "I love the Zoom Lens on this camera. Worth the money. Easy to carry and store. Pictures are clear and the video works great.",
      "rating": 5.0,
      "verified": true,
      "author": "CP",
      "helpful_votes": 0,
      "publication_date": 20140322
    },
    {
      "title": "Cool Camera",
      "text": "Great photos from an easy to use camera at a reasonable price. My lady loves her Christmas present. Buy it",
      "rating": 5.0,
      "verified": true,
      "author": "Kokopelli",
      "helpful_votes": 0,
      "publication_date": 20140119
    },
    {
      "title": "Point and shoot gift camera",
      "text": "My wife loved the red to match her red cell phone and the strong zoom lens. I like the easy controls and the lens cover. It makes good photos that allow my wife to be creative.",
      "rating": 4.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20131228
    },
    {
      "title": "Awesome Camera",
      "text": "I have an older Nikon Coolpix so I am sold on Nikon. This newest model far surpasses my old one, but I won't let it go of it, as it still gives me good photos. The features of this S9500 make it so easy to take any photo any time of day or night and you can clean up the pic easier. It is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Ramshaw",
      "helpful_votes": 0,
      "publication_date": 20140427
    },
    {
      "title": "Excellant , easy to use.....",
      "text": "This is my fifth Coolpix and I wasn't disappointed. I like a small quality camera to carry in my pocket when I'm using my old trusted d-5000 Nikon...........",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Talmage",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Does not have some of the features of earlier models.",
      "text": "It does not have the continuous picture feature that is on the S9300. I am going to try it again a few times and may then return it to you for reimbursement.",
      "rating": 2.0,
      "verified": true,
      "author": "LAWRENCE B. MOSS",
      "helpful_votes": 0,
      "publication_date": 20130628
    },
    {
      "title": "Five Stars",
      "text": "I am very satisfied with the quick reply from seller and product is great",
      "rating": 5.0,
      "verified": true,
      "author": "YOGA",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "OK camera but with problems",
      "text": "This camera has a few problems. First it doesn't have a view finder. That might not seem like a problem till you go to somewhere like the beach were you are submersed in light. You can not see the screen in these conditions so you can't frame the picture. Second,when using the zoom the camera has a hard time getting focused. This is a real problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert Chance",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "Took it to spain and got lovely pictures",
      "text": "I bought this camera for my trip to spain. I came home with amazing pictures. I was able to zoom to frame my pictures perfectly. Several of the cathedrals had a no-flash policy. The camera was up to the task. I took plenty of inside pictures. I even turned the flash off in some buildings when I could have used it since it did such a good job. The only real con is that the GPS can't get a signal inside. Outside it locks on really quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Bhroam Mann",
      "helpful_votes": 5,
      "publication_date": 20130529
    },
    {
      "title": "great camera for the price.",
      "text": "Love this camera has the bell & whistles anybody should ever need. Smaller size but takes excellent pictures. Great for people who do not want to carry around a large camera.",
      "rating": 5.0,
      "verified": true,
      "author": "jim streuber",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "No Complaints",
      "text": "I liked the product that I purchased. No complaints with it. It met my expectations. I would endorse it to others",
      "rating": 5.0,
      "verified": true,
      "author": "Red Wings",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Ease of Use",
      "text": "Love the ease of operating the camera and the compact size to carry in my pocket, purse, around my wrist, etc. The rich red color is easy to spot when laid down. We've taken several beautiful pictures on an eastern carribean cruise and other activities in Florida",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Hallett",
      "helpful_votes": 0,
      "publication_date": 20140219
    },
    {
      "title": "This was to be a used \"Like New purchase\" The ...",
      "text": "This was to be a used \"Like New purchase\" The camera has obvious visible drop damage and the camera will not turn on or charge. very unhappy with this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151129
    },
    {
      "title": "Five Stars",
      "text": "I am sure this is a great camera, but I didn't buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Arachne",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "hate flash location",
      "text": "Hate where the flash is located. Cannot hold camera and take photo when flash pops up. What happens is a very out of focus photo!",
      "rating": 3.0,
      "verified": true,
      "author": "Debby",
      "helpful_votes": 0,
      "publication_date": 20131227
    },
    {
      "title": "Five Stars",
      "text": "Love this camera. Everything is their description was 100% true.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Justin Butts",
      "helpful_votes": 0,
      "publication_date": 20150417
    },
    {
      "title": "WI-Fi does not work",
      "text": "great pictures, but case is cheap plastic and Wi-Fi does not work, I would look for a different brand, not worth the money",
      "rating": 3.0,
      "verified": true,
      "author": "Reynaldo",
      "helpful_votes": 2,
      "publication_date": 20130830
    },
    {
      "title": "Great pictures, great versatility",
      "text": "In its size category this is a fine camera with plenty of extra features. I especially like the 22x zoom along with its compact size.",
      "rating": 5.0,
      "verified": true,
      "author": "George Schalla",
      "helpful_votes": 0,
      "publication_date": 20140223
    },
    {
      "title": "Not a very good camera, the focus :(",
      "text": "I am sorry to say that this is the lowest quality Nikon I have ever purchased. I wish I had read the other reviews first. I agree, the focus on this is very bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul G Bolen",
      "helpful_votes": 0,
      "publication_date": 20131011
    },
    {
      "title": "THE RIGHT GRIP !!",
      "text": "It is quite simple... I can turn it on...Take the picture... Then turn it off ... While using only one hand !!! It is the only camera that has a grip for my right thumb to hold, and not a bunch of useless knobs in the way.",
      "rating": 5.0,
      "verified": true,
      "author": "John Petz",
      "helpful_votes": 0,
      "publication_date": 20140102
    },
    {
      "title": "Nothing surprising",
      "text": "Pros: +Image Quality +Zoom +You can pause the video recording Cons: -Battery life -Wired Charger -No focus when you zoom in videos",
      "rating": 3.0,
      "verified": true,
      "author": "JuanDavid",
      "helpful_votes": 0,
      "publication_date": 20131226
    },
    {
      "title": "Lense cover",
      "text": "lense cover now will not close and open properly, seems to stick in about quarter, now the battery with not hold a charge for long. love the camera, but will have to look at another at this point",
      "rating": 2.0,
      "verified": true,
      "author": "james white",
      "helpful_votes": 0,
      "publication_date": 20130826
    },
    {
      "title": "Good value.",
      "text": "It is difficult to always get sharp pictures. If you want very high-level quality photos you will need to post process the photos in an editing app, like Photoshop. But, for mediocre shots, this is a great camera. Just do not expect this camera to take the same quality photos of a much higher end camera.",
      "rating": 4.0,
      "verified": true,
      "author": "BornInVA",
      "helpful_votes": 0,
      "publication_date": 20131206
    },
    {
      "title": "nikon coolpix s9500",
      "text": "always been a Nikon man needed some thing small to travel with and this was the best love it should have thougth about this before",
      "rating": 5.0,
      "verified": true,
      "author": "papi",
      "helpful_votes": 0,
      "publication_date": 20130919
    },
    {
      "title": "a good buy",
      "text": "I'm very happy with this camera. What a zoom! For my casual use I got the best camera for me. the pictures are hi def and so clear.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronnie K",
      "helpful_votes": 0,
      "publication_date": 20130908
    }
  ],
  "product_meta": {
    "title": "Nikon COOLPIX S9500 Wi-Fi Digital Camera with 22x Zoom and GPS (Black) (OLD MODEL)",
    "description": "Color:BlackFROM THE MANUFACTURER\n\n\n\n\nPacking a large zoom lens into a small and stylish body is a specialty for the cameras of the Ultra-Slim Zoom collection! Update your look with a variety of colors and styles, and get high quality photos from up close or afar.\n\nShare the sights and sounds of your travels like never before.\nMeet your new favorite travel companion, the ultra-slim, fully connected COOLPIX S9500. With the versatility of a 22x zoom super-telephoto lens, the superb image quality of an 18.1-megapixel low-light CMOS sensor and the extreme convenience of built-in Wi-Fi® and GPS, capturing and sharing the sights and sounds of your trip has never been easier. Shoot a stunning panorama landscape, then instantly share it—along with the exact location it was shot—to your smartphone or tablet. When you get home, explore your photos and videos on an interactive map and relive the adventure step by step, shot after shot.\n\n\n\n\n\n\nGET CLOSE FROM AFAR\nCAPTURE DISTANT IMAGES WITH A 22X WIDE-ANGLE TO TELEPHOTO NIKKOR GLASS ZOOM LENS\nEvery COOLPIX is designed around a genuine NIKKOR glass lens, the legendary optics that have made Nikon famous. The COOLPIX S9500 features a 22x zoom NIKKOR lens that takes you from wide-angle group shots to telephoto close-ups in an instant. And don't worry about a little camera shake—lens-shift Vibration Reduction helps keep the shot steady even when your hands are not.\n\nSHARE AMAZING PHOTOS IN AN INSTANT\nBUILT-IN WI-FI® FOR EASILY SHARING YOUR SHOTS ANYTIME, ANYWHERE\nThe COOLPIX S9500 makes it easier than ever to share beautiful views of your world. Take a great shot and instantly send it to your compatible smartphone, tablet, or any compatible Wi-Fi® device. Then use your smart device to email it, text it, or upload it to your favorite social networking or photo album sites—share it the same way you normally share online. Your friends and family will be amazed by the shots you share!\n\nSEE WHERE YOU'VE BEEN\nBUILT-IN GPS, MAPPING, ELECTRONIC COMPASS AND POINTS OF INTEREST (POI) FOR CREATING AMAZING PHOTO JOURNALS\nRelive the excitement of your travels in a whole new way. The COOLPIX S9500 records the exact location of each shot you take, so you can follow the path of your adventure and every stunning view along the way! Share your photo journeys on Google Earth™, Google+™ and other social media sites, or with the included Nikon View NX2 software. Built-in mapping and Electronic Compass also helps you navigate unfamiliar destinations, and Points of Interest (POI) show you nearby photo-ops like scenic lookouts and historic landmarks. The COOLPIX S9500 is the ultimate travel companion!\n\n\n\nSUPERIOR LOW-LIGHT PERFORMANCE\nHIGH-PERFORMANCE CMOS IMAGE SENSOR LETS YOU SHOOT WITHOUT A FLASH\nImagine being able to shoot without a flash at weddings, concerts, parties—anywhere your flash normally fires. You won't have to interrupt a moment to capture it, and your photos and HD videos will look more natural and true to your memory. The COOLPIX S9500 performs so well in low light situations that, in most cases, using the flash is optional. Of course, when the lighting is extremely poor and you need a flash, it'll be there. .\n\nTURN SOME HEADS\nSLEEK, STYLISH DESIGN THAT FITS IN YOUR POCKET\nForm and function can play nicely together, and the COOLPIX S9500 is proof. Ultra-thin and lightweight, it fits comfortably in your pocket or purse. But you won't want to hide it there—every time you pull out the COOLPIX S9500, you can expect someone to comment on its good looks. Consider it a stylish accessory for your already fashionable life.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPREMIUM ACCESSORIES\nNikon EN-EL12 Rechargeable Li-Ion Battery \n\nThe EN-EL12 is a rechargeable Li-ion battery providing 3.7v and 1050 mAh of power to select Nikon COOLPIX digital cameras. COOLPIX Black Leather Case\n\nThis Nikon S Series Leather Case (Black) is a fitted, horizontal camera pouch made to carry a Nikon Coolpix S6000, S8000, S8100, S9000 and P310 digital cameras. It is carried by the original camera strap or belt loop.",
    "rating": 4.2,
    "feature_bullets": [
      "Versatile and slim",
      "a 22x zoom lets you shoot close-ups even when you’re far from the action",
      "Share amazing photos in an instant with built-in Wi-Fi",
      "Built-in GPS records the location of each shot you take",
      "so you can follow the path of your trip and every view along the way",
      "18.1 MP CMOS sensor for exceptional image quality and enhanced low-light performance",
      "Ultra-thin and lightweight to fit in your pocket or purse"
    ],
    "specifications": {
      "Product Dimensions": "4.33 x 1.22 x 2.36 inches",
      "Item Weight": "7.2 ounces",
      "ASIN": "B00B7N9BRW",
      "Item model number": "26418",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.2 out of 5 stars276 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#118,532 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 28, 2013",
      "Manufacturer": "Nikon"
    },
    "categories": [
      "Electronics",
      "Digital Cameras",
      "Camera & Photo",
      "Point & Shoot Digital Cameras"
    ],
    "price": ""
  }
}