{
  "website_summaries": [
    {
      "verdict": "An affordable BB cream with clean ingredients that is ideal for those who want a very natural look.",
      "pros": [
        "Vegan and cruelty-free",
        "Contains mineral pigments that adjust to skin's color",
        "Moisturizing formula provides a dewy finish and a natural-looking glow",
        "Very sheer coverage"
      ],
      "cons": [
        "Those looking for more coverage will be disappointed"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I use this because I hate wearing foundation",
      "text": "This is not a heavy coverage product. I use this because I hate wearing foundation, but still like to have something give me a helping hand in looking (somewhat) human. I am very pale, but have some pink and red spots on my face. It doesn't cover your acne, but I've found that it definitely evens out your skin tone and helps to reduce redness. It smells very pleasant as well and, with a little bit of concealer on the high plains of your face, gives a nice natural look.",
      "rating": 5.0,
      "verified": true,
      "author": "FeatherpinTop Contributor: Eye Makeup",
      "helpful_votes": 75,
      "publication_date": 20180710
    },
    {
      "title": "Fantastic product!",
      "text": "This is most definitely a primer not a BB cream. I love primers because they don't add color, just a good base for your makeup to stick. What i love most about this product is the chemical and toxin free!!! Found product on Think Dirty app,rated completely safe with no toxins or harmful chemical AT ALL!!!!! I am completely in love. Price is amazing for what you get. I will never go back.",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie H",
      "helpful_votes": 26,
      "publication_date": 20180906
    },
    {
      "title": "Meh. 😕",
      "text": "It's okay. This is for people with really good skin cuz it doesn't cover anything. I prefer bare skin over this. Doesn't even my skin tone. Pros: pretty design, vegan, pretty shimmer Cons: doesn't really soak in, feels kinda oily on the skin, feels/ looks cakey and doesn't blend well, smells kinda funny. Overall wouldn't buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Yan and Justin",
      "helpful_votes": 34,
      "publication_date": 20170919
    },
    {
      "title": "NOT for fair skin",
      "text": "Not for fair skin (I'm a redhead)--made my face look dirty. Otherwise I like it a lot. Gave it to my mom, who has a more average skin tone. Looks beautiful on her!",
      "rating": 3.0,
      "verified": true,
      "author": "Starligh06",
      "helpful_votes": 23,
      "publication_date": 20181222
    },
    {
      "title": "Color different than I expected but I like the product",
      "text": "It goes on easily but the color is a bit yellower than I expected. Other than that I'm happy with the product. I am over 60 and my skin is a bit dry. It's not too dewey looking but not matte and dull either.",
      "rating": 4.0,
      "verified": true,
      "author": "Geri",
      "helpful_votes": 21,
      "publication_date": 20180427
    },
    {
      "title": "it matches a redhead skin tone better than many other BB creams I’ve used.",
      "text": "I read some reviews that said this BB cream didn’t work well on redheads. I’m a redhead and very much disagree with that. Great for anyone who wants light coverage- you just glow with it on- and for anyone who wants peace of mind that they are using something that’s not full of toxins.",
      "rating": 4.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 7,
      "publication_date": 20200124
    },
    {
      "title": "Natural, light, dewey coverage!",
      "text": "This BB cream adds subtle dewiness, and looks very natural. I'm in my mid-50s and prefer this to matte make up that often looks too obvious on mature skin. Lightweight coverage so doesn't fully cover age spots, but love the subtle glow.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20200512
    },
    {
      "title": "Great product",
      "text": "Love this! I find foundations too heavy on my skin this is perfect and light and evens out my skin tone. I use just this and a mineral base powder and it makes my complection look great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20171105
    },
    {
      "title": "Very pretty/medium coverage/great value!",
      "text": "I love this B.B. cream! I’d been using Origins tinted moisturizer for months which also works very well and doesn’t have a bunch of harmful crap in it. I decided to try this Pacifica moisturizer and was pleasantly surprised for the value! I love they’re products bc they’re dye free & cruelty free. This gives great coverage and looks flawless with a bronzer/powder over top. Only downside is it doesn’t have any SPF so I’ll probably switch back to Origins come summer.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Slate",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Leaves a weird residue on my skin!",
      "text": "I really wanted to love this BB cream because it was the most natural I could find at a reasonable price. I have been trying to go lighter on my makeup routine by using more sheer foundations but this was waaay too sheer. It was more of a weird waxy moisturizer. I would not purchase again :(",
      "rating": 3.0,
      "verified": true,
      "author": "Hollie",
      "helpful_votes": 2,
      "publication_date": 20190103
    },
    {
      "title": "Sheer coverage",
      "text": "I really liked this product at first. I had been looking for a new natural cc cream after being disappointed by the lack of quality products I started receiving from physicians formula. This product blends well into my skin and is very light weight. I wish it provided a little more coverage. It is more sheer than I prefer. If you have a very even skin tone this product would probably work perfectly. I am going to try this brands foundation to see if that provides me with anymore coverage.",
      "rating": 4.0,
      "verified": true,
      "author": "irongiant224",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Sucks",
      "text": "Yes, bb cream is supposed to be light-weight, but this is so light that it makes no difference on your skin. Really just adds shimmer/glitter.",
      "rating": 1.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 2,
      "publication_date": 20191229
    },
    {
      "title": "Sheer glowy coverage. Blend blend blend!",
      "text": "I love this so much! I have freckled, light skin and using this in combination with one of their moisturizers has made my skin \"happier\" :) the other reviews are right as far as this being sheer, but it gives a nice glow. I literally replaced all my makeup with Pacifica products. Highly recommended especially if you want to show off your freckles while making your skin look and feel \"happy\".",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 3,
      "publication_date": 20180223
    },
    {
      "title": "I mostly like this product",
      "text": "I mostly like this product, but be warned: it is definitely light coverage, as other reviewers have pointed out. I've had trouble finding a EWG recommended BB Cream that's also non-comedogenic, which this fits, but I wish the coverage was less sheer. Another heads-up: the color looks pretty dark coming out of the tube, but blends with my light/fair skin tone very well.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura McLean",
      "helpful_votes": 3,
      "publication_date": 20171220
    },
    {
      "title": "This is a great BB cream better then others I've tried and its ...",
      "text": "This is a great BB cream better then others I've tried and its non-toxic which is what I wanted this product gives you a glow which is probably why I like it so much if you are trying the no make up look",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Seller review- incomplete information on the page .",
      "text": "I would like to review the seller of this product. This is my first to purchase Pasifica bb cream and I didn’t know it’s come in 3 different shades . ( Nothing about shades was in advertising) I had received # 6 which is medium and this is shade to dark for my complexion. I would need # 11 light. Also tube had come without box ( as pictured) .",
      "rating": 3.0,
      "verified": true,
      "author": "Ivetta K Lapkina",
      "helpful_votes": 0,
      "publication_date": 20201028
    },
    {
      "title": "TRULY GOOD STUFF",
      "text": "A little of this goes along way on your face does not give you that make up or powdered look just gives you a natural glow and really that’s what we all want it does not increase any signs of creases around the eye but actually blurs away wrinkles and imperfections",
      "rating": 5.0,
      "verified": true,
      "author": "holly bergman",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Just ok",
      "text": "Considering the price, this product is just ok. It has super sheer coverage which I usually love. Having oily skin, I'm used to reapplying at least once later in my day. Sheer coverage is preferred for multiple applications and the product doesn't build up or transfer. BUT, this product gets greasy on it's own and has a creepy glitter shine, not a glow. It looks beautiful when used as a primer/moisturizer layered up liquid foundation and mineral powder. Definitely not the worst product, but ultimately it doesn't fulfill the intention of a light wear BB cream.",
      "rating": 3.0,
      "verified": true,
      "author": "Marie S.",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "not shade matching at all",
      "text": "i have fair skin and bought this because someone else said that it worked for fair skin but this showed up orangey and 3 shades darker than my real skin tone and the shimmer was obnoxious. I threw it away after trying a few times to see if i was applying it wrong but it just did not match and i can't use the product",
      "rating": 2.0,
      "verified": true,
      "author": "AA",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Yellow Hues - No Thanks",
      "text": "I wanted to love this product! But.... as other reviewers warned (and I regretfully didn’t listen) it’s YELLOW. I didn’t even finish applying it to my face to know the tone was way off. I’m not sure how much worse it would be with oxidation, I didn’t wait to find out, I promptly returned it. Try Maybelline, half the price, twice the quality. I gave it 3 stars only because the consistency was decent and if you are yellow-toned this might work for you!",
      "rating": 2.0,
      "verified": true,
      "author": "Natalie Lauren",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Super happy w the sheer coverage",
      "text": "This is my favorite product of its kind. Light and sheer, evens out tone and brightens, and does not cause my rosacea to flare at all. I wouldn't recommend for anyone wanting mid-heavy coverage. This is probably my 6th tube, at least, over these years and I plan to keep using it.",
      "rating": 5.0,
      "verified": true,
      "author": "jen s",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Love Pacifica Products!",
      "text": "I love Pacifica Products. That is all I use and I have sensitive skin. I am 67 and take care of my skin as it is very sensitive.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "The best for medium skin tones!",
      "text": "It's so hard for me to find a good in-between shade for my skin -- I normally wear \"medium olive\" and most BB creams are too light or too dark. This cream gives a nice coverage that's lightweight and brightening, and totally buildable if I need more coverage. It's also a huge plus that it's chemical free and all natural! I love Pacifica.",
      "rating": 5.0,
      "verified": true,
      "author": "Josie Fitz",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "It's all glitter and no color.",
      "text": "I wanted to go for a more natural approach when it came to foundation and all i got was glitter all over my face, especially in the sun. I see this more of a highlighter than anything.",
      "rating": 3.0,
      "verified": true,
      "author": "Lori orellana",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "I like it!",
      "text": "I like this cream. I used it in place of foundation. I used a little concealer with it and I felt like it made my skin look nice and luminous. I wasn't going for thick full coverage though. I am not particularly fond of weighty makeup so if you're like me, this may be the product for you! Also, it doesn't break me out but I don't wear it everyday either.",
      "rating": 5.0,
      "verified": true,
      "author": "MISSREE00",
      "helpful_votes": 0,
      "publication_date": 20181224
    },
    {
      "title": "Good product",
      "text": "I like this! It’s very lightweight. Took off a star because in the heat, it gets a little greasy. With a good setting powder I don’t have that problem though. Overall, good quality for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Lauren Pierce",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "Nice",
      "text": "This has been a rare find where I can get the nutrients that my skin needs and not getting an allergic reaction. Very happy how light feels and how fresh stays all day long.",
      "rating": 5.0,
      "verified": true,
      "author": "Vivian Garcia",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Very sheer coverage, small tube",
      "text": "More like a light glow. I only want to cover a bit of redness. The ingredients are fine, and the price is right. I would buy it again and again. A larger size would be nice, however.",
      "rating": 5.0,
      "verified": true,
      "author": "Price McLaughlin",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "I have worn this for years and was very happy to see that I can get it on Amazon ...",
      "text": "I have worn this for years and was very happy to see that I can get it on Amazon for less because the store I bought it at discontinued it. I like it because it does NOT accentuate my wrinkles, like most foundations! It gives my face a suttle glow and I constantly get compliments and questioned about the brand. I do wish it had more of an SPF factor, but I can just add a color-free powder from Brushonblock.",
      "rating": 5.0,
      "verified": true,
      "author": "jbarr",
      "helpful_votes": 0,
      "publication_date": 20180720
    },
    {
      "title": "Disappointed",
      "text": "I use other Pacifica products that I like but I was disappointed in this product. It’s a little greasy. It doesn’t spread easily on the skin and value wise, very small for what they charged",
      "rating": 2.0,
      "verified": true,
      "author": "Drtvgal",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Subtle glow",
      "text": "This gives a nice subtle glow and brightens my skin. In direct sunlight it has a little glittery shine which I don’t like, and when I kiss my kids the sparkles rub off on them. It’s very lightweight and overall I’m happy with this as an affordable mineral option.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie L",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "silky smooth",
      "text": "This brand is new too me, i love the BB cream! it covers great and leaves your skin hydrated. It doesn't feel like i am wearing makeup. I choose this brand because it is vegan and cruelty free! I have some more products on the way from Pacifica and i will def. order more from this brand since it is very affordable as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz_sxm",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "It doesn't have sunscreen, it's only tinted moisturizer",
      "text": "It was disappointing that this didn't have sunscreen. It's only a tinted moisturizer. It's a great product and I did like it a lot, but BB creams are supposed to have sunscreen, so this should not be called BB cream.",
      "rating": 3.0,
      "verified": true,
      "author": "claudia",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "dont buy if you need coverage",
      "text": "well all the comments in the reviews are true. no coverage at all. i have pimple scars and disappointed that it didnt do any coverage. I dont know if i can still return",
      "rating": 2.0,
      "verified": true,
      "author": "Xtia",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Not for mature skin",
      "text": "I was very disappointed as this is vegan and I use other pacifica products. It's cakey and made my skin look more textured than without it. Definitely not for mature skin as it is not moisturizing and settles into fine lines. As others have said, it doesn't blend well. The color is a little off as well.",
      "rating": 2.0,
      "verified": true,
      "author": "cloudshade",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Exactly what I had been looking for!",
      "text": "Thanks to Amazon I have finally found my favorite Pacifica brand Alight Multi-Mineral BB Cream! I have been using this product for about a year and needed to replenish my dwindling supply but was unable to find it locally at Target or Ulta as neither carry this product in their stores any longer. I use very little makeup and do not like foundation and this BB cream fits my needs with very light coverage. I will definitely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20161112
    },
    {
      "title": "Great product",
      "text": "I really like the feel to the product and don't notice any scent to it at all. Just wish it covered a little more, but overall, I would buy it again!",
      "rating": 4.0,
      "verified": true,
      "author": "E. dutenhaver",
      "helpful_votes": 0,
      "publication_date": 20201119
    },
    {
      "title": "Feels like traditinal liquid makeup.",
      "text": "Did not improve the look or feel of my skin, settled in fine lines to be more pronounced. Would be ok for a spot coverage but not overall for my older skin.",
      "rating": 3.0,
      "verified": true,
      "author": "Faye",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Holy Grail",
      "text": "I have ordered this 4 times already. It gives a nice glow (especially when added to a glow serum). Smells great. Also I have seen improvements in my skin since I have started using it. AMAZING",
      "rating": 5.0,
      "verified": true,
      "author": "enzos",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "Warning: Not skin friendly",
      "text": "This BB cream will only heighten the texture on your face and given the color spectrum is not meant for fair/pale skin. As someone with combination skin this made by face instantly look very oily and burned upon application to the face. If you have sensitive I would not recommend. Not good for; Textured skin Sensitive skin Fair or Deep toned skin Combination/Oily skin Acne prone skin",
      "rating": 2.0,
      "verified": true,
      "author": "Tatiana d'Entremont",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Works well as a primer",
      "text": "This product works well as a base under foundation, but doesn't do much on it's own. It has a bit of shimmer to it as well. Very hydrating so if you're oily or need more coverage you may not like it on it's own. It scores low with the EWG, that's why I purchased & continue to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah Tice",
      "helpful_votes": 0,
      "publication_date": 20181030
    },
    {
      "title": "Perfect for sensitive skin",
      "text": "I’ve got fair and sensitive skin and this bb cream has worked wonderful. No oily itchy skin-just the right amount of dewy. Might need to apply twice if it’s an active day.",
      "rating": 4.0,
      "verified": true,
      "author": "WineandCheese",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Good price & fast shipping",
      "text": "I love this very light BB cream.. even's out my complexion and feels like a moisturizer! So easy for everyday use",
      "rating": 5.0,
      "verified": true,
      "author": "Makana",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Light",
      "text": "I wasn't sure if I should buy it. However, it turned out to be perfect for me. Vert light coverage which I love",
      "rating": 5.0,
      "verified": true,
      "author": "Yla",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Not so good",
      "text": "Not pigmented well, doesn’t offer even the slightest minimal coverage, and no color options. This is a great line normally but I am very disappointed with this",
      "rating": 2.0,
      "verified": true,
      "author": "Jojo L.",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Lots of Sparkle; Little Coverage",
      "text": "This product is more moisturizer and little to no coverage. It’s also very sparkly. I ended up mixing it with a thicker foundation, but won’t purchase it again.",
      "rating": 3.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20201127
    },
    {
      "title": "Zero coverage",
      "text": "This is not an actual BB cream, its like a face lotion with some brown tint. I've used actual BB cream and it is supposed to even out skin by lightening darker areas damaged from sun or acne scars and provide very light but build-able coverage. The only thing this has going for itself is that its vegan and cruelty free",
      "rating": 2.0,
      "verified": true,
      "author": "Anonym0us",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "I mix it with another CC cream for better coverage. Blends well but just seems kind of ...",
      "text": "Doesn't really do anything except add highlight all over. No coverage of blemishes and imperfections. Not buildable. I mix it with another CC cream for better coverage. Blends well but just seems kind of pointless.",
      "rating": 2.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Love this product",
      "text": "MY FAVE! Please don’t stop selling this- I have a hard time finding anywhere other than Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "amazon2020",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Great product!",
      "text": "I love this product and the few other products I've tried from this brand. They are clean of junk, reasonably priced and they actually work.",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline van Tol",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Great product for a great price",
      "text": "I wear minimal makeup and wanted something lightweight that also was moisturizing. This was perfect! I also like how it adds a nice glow to my face (but nothing that looks unnatural). My skin can get oily/shiney looking with certain moisturizers but this one does not seem to have that effect which is really nice. Def would buy this product again",
      "rating": 5.0,
      "verified": true,
      "author": "Lizzie",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Love",
      "text": "Great - light coverage but gives you a moisturized illuminated glow and evens out skintone - I like this better than full coverage as I feel it doesn't settle into fine lines or look cakey",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "My favorite foundation",
      "text": "I've used this for years. It's lightweight and brightens up your complexion. ; )",
      "rating": 5.0,
      "verified": true,
      "author": "White Raven",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Don’t buy",
      "text": "Feels heavy to achieve look or color multiple layers then it looks like clown makeup",
      "rating": 3.0,
      "verified": true,
      "author": "Lois Woods",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Unsure",
      "text": "Possibly paxifica changed the product as previous purchases deemed different. Is now so sheer almost non coverage. Used to be a little more visable, shimmery, sun kissed glow look. Now appears almost non existant.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Hydrating - Minimal Coverage",
      "text": "It's very sheer - practically translucent. My skin is very blotchy so I would have preferred more coverage. It's very hydrating and has a pleasant scent. I wear it every day over my moisturizer.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 3,
      "publication_date": 20160215
    },
    {
      "title": "Excellent product at a good price",
      "text": "Pacifica Cream is a product my wife has been using and likes quite a bit for 3 years now. The price is right in line with any retailers we looked at, at the lowest part of the range. Im hoping we can get it again for less than the $16. pricing, at which point, we'll get several.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Martinez",
      "helpful_votes": 0,
      "publication_date": 20161023
    },
    {
      "title": "Love this stuff!",
      "text": "This is my second bottle. I love this stuff! Super lightweight, moisturizing, and gives me a youthful glow! Makes it look as though I'm not wearing makeup but my skin is even and smooth. And the best part is vegan and cruelty free!",
      "rating": 5.0,
      "verified": true,
      "author": "Logan Maxwell",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Better options out there",
      "text": "Wife said it had very sheer coverage, oxidized immediately to a darker shade than desired and caused her skin to break out. Would not recommend if you have semi-sensitive or fair skin.",
      "rating": 2.0,
      "verified": true,
      "author": "TIM DEVLIN",
      "helpful_votes": 0,
      "publication_date": 20170816
    },
    {
      "title": "I love how this just feels like I'm wearing lotion and ...",
      "text": "I love how this just feels like I'm wearing lotion and nothing else. It is very light weight and is not meant to conceal. It makes my skin feel very moisturized.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonflower",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Beautiful coverage",
      "text": "This BB cream is great for light coverage that is not harmful! Love this stuff and will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Good staple product",
      "text": "Great over sunscreen for minimal makeup days, but also works as a primer under light weight foundations as well as powder foundations. This is my third tube of this. Whenever I run out I find myself missing it when I go to other products.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Morelewicz",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Not for me",
      "text": "It felt very greasy to me and had no coverage, not even a tint. Gave it a second try then tossed it.",
      "rating": 1.0,
      "verified": true,
      "author": "Michelle Clark",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "A great and dependable product",
      "text": "It is dependable and well priced. I trust it to be good for my skin",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Chandler - Author",
      "helpful_votes": 0,
      "publication_date": 20201121
    },
    {
      "title": "Not complaining....",
      "text": "The product came in a large envelope from Amazon, but wasn't in the pink box pictured. It was just the tube, which did have a seal, so it's fine. But the box has more information on it and I was going to give this as a gift so I would've liked the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201118
    },
    {
      "title": "Okay product",
      "text": "Moisturizing, very light cream! My face is very shiny after application! It’s not bad after make up is applied but I would not wear it alone!",
      "rating": 3.0,
      "verified": true,
      "author": "Casey Crisp",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "It gives you a great glow but no coverage!",
      "text": "I love that the bb cream is vegan and cruelty free. It gives you a glow. But offer no coverage. I would def use a concealer with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Bella",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Lightweight",
      "text": "This is a SUPER light coverage, and I was expecting a bit more. Other than that it’s great! It’s lightweight, goes on smooth, and stays put throughout the day. It’s moisturizing without being sticky, and awesome for dryer skin!",
      "rating": 4.0,
      "verified": true,
      "author": "Holly Axe",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "great product. feels lightweight on your skin so it's ...",
      "text": "great product. feels lightweight on your skin so it's great for those who don't like the feel of heavier makeup on them. matches skin tones amazingly well!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin M.",
      "helpful_votes": 2,
      "publication_date": 20170131
    },
    {
      "title": "From Ghost to Glowing!",
      "text": "I've used this product for a years now. I'm PALE and love the subtle glow of color that it gives me without being orange or showing fake tan lines. I have super sensitive skin too and it does not aggravate my acne, but it's enough moisturizer to keep my dry skin under control too.",
      "rating": 5.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Love it.",
      "text": "Love it.. just not as much coverage as I would prefer. But beautifully smooth, no caking, no irritation. Pacifica is one of my favorite brands.",
      "rating": 4.0,
      "verified": true,
      "author": "Violetz",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Don't buy if u live ur face!",
      "text": "Don't buy! It burned my face, an I have dry ashy patches all over my face, too harsh on skin, especially around the thinner pieces like my eye kids an under eye, my skin looks crapey an dry an old horrible experience an now trying to find something yo repair my skin",
      "rating": 1.0,
      "verified": true,
      "author": "Kim P\nKim P",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "Nice!",
      "text": "So nice!! Covers the skin in a light shimmery veil",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Jade",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "One of my favorite BB creams of all time",
      "text": "One of my favorite BB creams of all time! Great for the summer when my skin is changing color a lot and I only need light coverage!",
      "rating": 5.0,
      "verified": true,
      "author": "Aleah",
      "helpful_votes": 2,
      "publication_date": 20170629
    },
    {
      "title": "Disappointed",
      "text": "The BB cream doesn't feel like it is moisturizing my skin at all. The color doesn't blend with my skin tone. Not very happy with this product",
      "rating": 3.0,
      "verified": true,
      "author": "florihei",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Love Pacifica and this product",
      "text": "Love Pacifica and this product. It's definitely not \"full coverage\" but it's perfect for someone like me who wears minimal make-up on a daily basis and needs just a sheer coverage. It adds a nice shimmer and glow while letting your skin breathe.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Orange skin",
      "text": "I don’t really care for this product it make my skin look real orange. Maybe I just bought the wrong color. But either way it doesn’t look good on me at all.",
      "rating": 3.0,
      "verified": true,
      "author": "channing",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Fine for everyday use and if you have great skin",
      "text": "Provides Sheer coverage and will even out skin tone and minor redness, but if you need to cover a blemish, you may not like it. I use it for daily wear and like its light feel.",
      "rating": 4.0,
      "verified": true,
      "author": "Quemado",
      "helpful_votes": 2,
      "publication_date": 20170818
    },
    {
      "title": "Lightweight",
      "text": "Very little coverage, no sunscreen. Hard to see the point. Love this company’s other products though, and it smells nice.",
      "rating": 3.0,
      "verified": true,
      "author": "Suclaire",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Make my face look brighter and more youthful",
      "text": "I've been giving a lot of compliments on how bring and youthful my skin looks when I wear this product. I would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Not full coverage at all but perfect for a healthy glow",
      "text": "Very light, radiant look! Makes my skin very soft! Not full coverage at all but perfect for a healthy glow!",
      "rating": 5.0,
      "verified": true,
      "author": "kdiz",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "This foundation is slightly orange, not really for pale skin tones.",
      "text": "Honestly a good product but was too dark for me by about two shades. I saw other reviews saying it wasn't dark on pale skin but for me that wasn't the case. I mix it with a foundation that I had which was too light and it's perfect.",
      "rating": 3.0,
      "verified": true,
      "author": "Ceasar",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Love for",
      "text": "One of my fav all natural makeup products. I’ll never be without",
      "rating": 5.0,
      "verified": true,
      "author": "MeggyV",
      "helpful_votes": 0,
      "publication_date": 20201103
    },
    {
      "title": "Love it",
      "text": "I am very happy with this product, it’s Light weight and goes on smooth. Looks really natural.",
      "rating": 5.0,
      "verified": true,
      "author": "Teacher ",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "Perfect for summer",
      "text": "Lightweight and moisturizing. Doesn’t feel cakey at all. You definitely need a concealer for even the lightest blemish though.",
      "rating": 4.0,
      "verified": true,
      "author": "Danielle Hallberg",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "5 stars",
      "text": "Loving it so far. My sister recommended it, have been using it everyday. Will be buying again.",
      "rating": 5.0,
      "verified": true,
      "author": "jhj",
      "helpful_votes": 0,
      "publication_date": 20170503
    },
    {
      "title": "Minimal coverage",
      "text": "Provides minimal coverage so if that is what you are looking for,its good for that. It is smooth and easy to apply.",
      "rating": 3.0,
      "verified": true,
      "author": "sterling",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "If you want to throw away the money, buy this",
      "text": "This is the worst BB cream I've ever bought. No coverage And this is yellow color, It is better to give $15 to the homeless than to buy this product",
      "rating": 1.0,
      "verified": true,
      "author": "LA prince ",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Horrible, don't buy this product!",
      "text": "After using this on face my face is burning♨️😣😣😣, it feels like something stink all over the face. Skin look dry, sheer means no coverage at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Munia N.",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Won’t buy again",
      "text": "Chalky and does not go on smoothly, you need to use at least a nickel size amount for full coverage. Does not cover up or even tone like other bb creams",
      "rating": 1.0,
      "verified": true,
      "author": "Kate",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Cheap option but not worth it",
      "text": "Pros: vegan/ cruelty free, cheap price, somewhat shimmery Cons: coverage is way too light, more resembling a tinted moisturizer. Does not last well for long time wear (over 6 hours)",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20191202
    },
    {
      "title": "I love this brand",
      "text": "I love this brand, but felt this was a bit too shiny on my skin. I prefer their CC cream and use that one everyday.",
      "rating": 4.0,
      "verified": true,
      "author": "CW",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Nope. Not for me",
      "text": "I didn't like this product at all. It broke me out along my forehead and jawline. Won't be repurchasing any time soon.",
      "rating": 1.0,
      "verified": true,
      "author": "Debra",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "WAY TOO ORANGE",
      "text": "WAY ORANGER THAN DISPLAYED. Tried on and looked like I was from Jersey Shore. Waste of money.",
      "rating": 2.0,
      "verified": true,
      "author": "Felicity P",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "I love this brand of makeup!",
      "text": "My favorite makeup product! Blends perfectly and lives your skin so beautiful !",
      "rating": 5.0,
      "verified": true,
      "author": "amanda buckner",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "No coverage",
      "text": "It really adds NO coverage as mentioned in some of the reviews. Its only effect is adding a bit of sheer to the skin",
      "rating": 3.0,
      "verified": true,
      "author": "Ekaterina Ledyaeva",
      "helpful_votes": 0,
      "publication_date": 20201114
    },
    {
      "title": "Love it!",
      "text": "First encountered this product when receiving it in an IPSY sample box. Loved the lightweight feel and the illumination look.",
      "rating": 5.0,
      "verified": true,
      "author": "Cynthia",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Love this product",
      "text": "Can't purchase it where I used to buy it. Guess It'll be on line from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "sheila gonzales",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Faulty Cap",
      "text": "After the first use I could never get the cover on again. Makeup was good other than it was hard to keep it from drying out or leaking in my makeup bag.",
      "rating": 3.0,
      "verified": true,
      "author": "alison tames",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Love it, it seems to somehow adjust to your ...",
      "text": "Love it, it seems to somehow adjust to your skin tone, if your natural skin tone is not too dark, which mine is, as I am tanned, however it adds a pinkish hue :)",
      "rating": 5.0,
      "verified": true,
      "author": "laura caputo",
      "helpful_votes": 0,
      "publication_date": 20180610
    }
  ],
  "product_meta": {
    "title": "Pacifica Beauty Alight Multi-Mineral BB Cream , 1 Fl Oz",
    "description": "Pacifica's Alight Multi-Mineral BB Cream is a true multitasking miracle that hydrates, primes, illuminates, and perfects while leaving a sheer bare skin finish Specialized mineral pigments that instantly adjust to your skin shade allow one color to work for many Formulated with jojoba esters, sweet iris leaf and damascus rose leaf cell extracts, coconut water, kelp and hyaluronic acid All Pacifica products are 100% vegan, and cruelty-free Pacifica color is formulated without: animal testing, animal ingredients, gluten, phthalates, parabens, sulfates, propylene glycol, mineral oil, petroleum, peanut oil, triclosan, and other ingredients you do not want on your skin, (plus all the good ingredients your skin craves) One shade works for many",
    "rating": 4.3,
    "feature_bullets": [
      "Great for anyone who wants a sheer natural look with a little luminocity",
      "All-in-one mineral bare skin tint",
      "ngredients We Love: floral stem cells, coconut waterm, and hyaluronic acid",
      "Shade-matching technology",
      "Formulated without: parabens, phthalates, silicone, mineral oil and petroleum. 100% Vegan and Cruelty-free"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "0.8 x 2.2 x 5.6 inches; 1.6 Ounces",
      "Item model number": "SG_B00BBFR3RQ_US",
      "UPC": "701930823478 687735301055 885491900875",
      "Manufacturer": "Pacifica Beauty, LLC",
      "ASIN": "B00BBFR3RQ",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Creams & Moisturizers",
      "Skin Care",
      "Face",
      "Beauty & Personal Care"
    ],
    "price": 15.99
  }
}