{
  "website_summaries": [
    {
      "verdict": "Whether you love Kettle Brand chips or are looking for a variety pack of single-serve bags for lunches, snack-time, and more, this box of 30 bags offers value in multiple flavors.",
      "pros": [
        "Garners enthusiasm from Kettle Brand chip lovers who like to try some of the most popular flavors, as this pack of 30 contains 4 – BBQ, Jalapeno, Sea Salt & Vinegar, and Salt & Pepper",
        "Convenient 1.5-ounce snack-sized bags"
      ],
      "cons": [
        "You may not like all of the flavors, but this 30-pack is still a good deal"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Too much Jalapeno",
      "text": "I like the variety pack for the most part, but why does it have to have double the Jalapeno chips? They're not my favorite and the Husband can't handle spicy food at all, so even though they're not at all spicy by my standards, Husband won't touch the Jalapeno chips, so I'm stuck with them. I wouldn't be complaining if it had the same number of Jalapeno chips as every other flavor, but DOUBLE Jalapeno chips? Come on!",
      "rating": 3.0,
      "verified": true,
      "author": "Mara Hodges",
      "helpful_votes": 24,
      "publication_date": 20190203
    },
    {
      "title": "Deliciously Awesome Value",
      "text": "Extremely happy with this purchase. Saw it in a lighting deal and snagged it up. Portions are perfect for my lunches. I personally love the jalapeño flavor so super happy I came with double. I highly recommend this value pack since it seriously comes out to about $0.50 a bag!!! I'm not sure why people give this a low rating simply because of double jalapeño flavor. It clearly states how many of each flavor in the describe AND image. Either way, I'm satisfied and happy.",
      "rating": 5.0,
      "verified": true,
      "author": "StephieJolls",
      "helpful_votes": 16,
      "publication_date": 20190718
    },
    {
      "title": "Way too many Jalapeno flavors",
      "text": "I love Kettle chips, but this one has twice as many Jalapeno flavors as everything else. No one else in the family will east those because they're so hot, so I'm the only one that will eat those, which means I don't usually get to eat the flavors that I actually like. I wish the flavors were evenly distributed or even more heavily distributed on the other 3 flavors. We won't be ordering again since we don't like the flavor that makes up 40% of the box...",
      "rating": 2.0,
      "verified": true,
      "author": "Donna",
      "helpful_votes": 14,
      "publication_date": 20170110
    },
    {
      "title": "Expiry Date too Close",
      "text": "At first I was completely satisfied with this product. I absolutely love chips and it's great that there are alternatives that are not deep fried. However when I happened to see the expiration date on the bag, I realized that it is expiring in a couple of days. The last thing I'd expect when buying something at FULL PRICE is an expiry date that is so close. How am I supposed to finish 20 bags in 2 days?",
      "rating": 2.0,
      "verified": true,
      "author": "Soraya Darwish",
      "helpful_votes": 24,
      "publication_date": 20160214
    },
    {
      "title": "Crisp and Tasty",
      "text": "We ordered this pack for our son. He doesn't like jalapeno, so we ended up with half, as half of them were jalapeno. They were crisp and tasty. Some jalapeno flavors have a funky aftertaste, these do not. Honestly, I think our son would have liked them had he tried them. A hint of heat but just enough to tell you what you're eating. The bags are good sized- and were fresh. The cheese flavored was a huge hit.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 5,
      "publication_date": 20190823
    },
    {
      "title": "Chips are fantastic - packaging is crazy",
      "text": "Seriously, the bags are so tough that if you don't use scissors, you will end up pulling so hard on the bag that the chips will spray all over the ground. Not good for vendors at events. You will be giving refunds. But the chips themselves are super tasty.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181026
    },
    {
      "title": "Empty chip bag lol",
      "text": "Love this brand of chips.... one of the bags was just air 🤷🏻‍♀️",
      "rating": 4.0,
      "verified": true,
      "author": "Lena Walker",
      "helpful_votes": 6,
      "publication_date": 20190804
    },
    {
      "title": "Read to see the assortment",
      "text": "Didn't read the description that stated these come with TWELVE of the Jalapeño chips. Who needs 12 bags of Jalapeño chips?! I don't think anyone even ate one of the bags of the Jalapeño. Disappointed these weren't a more universal selection of chips.",
      "rating": 3.0,
      "verified": true,
      "author": "Brandy",
      "helpful_votes": 4,
      "publication_date": 20180708
    },
    {
      "title": "Kettle Chips mixed bag",
      "text": "I have ordered these twice and noticed the first box had 13 bags of Jalapeno and 3 BBQ and mixed amt of the others. I kind of expected equal amts. Luckily my family likes the Hot ones, on the other hand my wife doesn't al all. My second order the mix was more equal but exactly. Good chips fast delivery. On the bad side, My second order was delivered on a Sunday before 8AM! I feel that is too early for some people who can only sleep in on the weekends.",
      "rating": 5.0,
      "verified": true,
      "author": "Zane Giles",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Equal amount of each flavor",
      "text": "I think it would be a better variety if you had equal amount of each flavor . Having twice as many jalapeno as the other flavors reduces the variety I would rather have 6 Jalapeno and another flavor or you could remove the jalapeno and give two other flavors that would be 5 stars to me and think would be a good option",
      "rating": 4.0,
      "verified": true,
      "author": "Rich Rouquette",
      "helpful_votes": 0,
      "publication_date": 20191013
    },
    {
      "title": "Noooooo they're stale!",
      "text": "I figured small bags would stay fresh longer than an open big bag and also help with portion control (in theory). I chose this mix because it contained 2 of my favorites - salt and vinegar kettle chips and spicy tortilla chips. Big disappointment. Both were stale to the point of being inedible. The plain chips and pretzel chips, however, were fine (go figure). Each type of chip had a different expiration date, but none were expired and the bags were sealed. How does this happen?",
      "rating": 2.0,
      "verified": true,
      "author": "D. Buss",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Over-satisfied",
      "text": "I needed to spice up my life during this quarantine, so i bought this. I’ve only had jalapeño prior to this purchase, but all these flavors are good. Not overwhelming at all. If you’re reading reviews for a box of potato chips, you’ve already made up your mind",
      "rating": 5.0,
      "verified": true,
      "author": "ivan",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Way too much salt",
      "text": "I like a salty chip as well as most but these have at least 2 times the salt of an ordinary chip and all you taste is salt. I don't know if it's just the batch I got or what but I can't hardly eat these with the overly salted flavor. I tried each flavor in the box but really all I taste is salt.",
      "rating": 1.0,
      "verified": true,
      "author": "Terry Morris",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Delish, larger bags than in grocery store, but too many jalapeno flavored",
      "text": "These are a good value and delish. They are packaged well for shipment (although, strangely, they required a UPS signature for last delivery!). My only complaint is that they should include equal number of bags of each flavor. There are too many jalapeno flavored bags, which are my least favorite. I have reordered a few times despite this limitation.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Soggy chips",
      "text": "Several of the bags had soggy chips. Yuck. My kids quickly gave up and wouldn’t take any of them. I got a huge box. What a waste.",
      "rating": 1.0,
      "verified": true,
      "author": "mmad",
      "helpful_votes": 2,
      "publication_date": 20190606
    },
    {
      "title": "Delish!",
      "text": "Package arrived double boxed so no damaged chips and the snack size is perfect for lunches. My family likes these because they are quality and seem to have a bit more in the packages than those bought in a grocery store. I gave four stars because I was expecting there to be equal packages of each flavor but there was twice as many Jalapeno chips as any of the other flavors listed.",
      "rating": 4.0,
      "verified": true,
      "author": "ElenaD3LV",
      "helpful_votes": 2,
      "publication_date": 20170527
    },
    {
      "title": "To: Whoever packages this “variety” pack",
      "text": "Great product BUT WHY is variety so imbalanced?? One NewYork Cheddar flavor, 5-6 BBQ and Sea Salt — and the rest (15-20) Jalapeño!!?? Not cool. Balance it out Kettle folks!",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Sheehan",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Too many jalapeño",
      "text": "I like this product, but I’m disappointed that they thought it was best to have only 6 of 3 flavors and 12 of jalapeño. Seems a bit uneven to me. Would probably make more sense to have 32 bags and do 8 of each. If you really like jalapeño chips, this is for you. I won’t buy again until they even it out.",
      "rating": 3.0,
      "verified": true,
      "author": "Jane Doe",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Love the Jalapeno chips!",
      "text": "I try not to buy this too often because it's addictive. Don't prefer the salt and vinegar but my son loves it and hates the jalapeno, so we get along! Not a lot of chips in the bag so no need to feel guilty about it. It's good stay-at-home-from-covid snacks.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan H.",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "These went quick...",
      "text": "The flavours were fine and they all arrived safe. They were well liked because it they went quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Georgie Porgie",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Nice mix of chips",
      "text": "Great mix of chips but unfortunately the box was taped a lot and six bags were missing so I received 24 out of 30 that I paid for, so not sellers fault but the box says what they are and looks tamerped with - glad they are individually packaged.",
      "rating": 4.0,
      "verified": true,
      "author": "Stacey",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Love, love",
      "text": "I love these chips. I love the jalapeno. I especially got this configuration (as specified) because of the high jalapeno ratio. They were fresh and delicious. I compared the cost to Sam's.com. Same cost. Amazon's free shipping wins!",
      "rating": 5.0,
      "verified": true,
      "author": "TheCrozetParaclete",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Everything fine until eating \"Salt & Vinegar\"",
      "text": "All the flavors were good until I ate from the \"Salt & Vinegar\" bag, which floored me with the overwhelming \"vinegar & salt\" flavor. If I had known how very distasteful it would be, I would not have ordered the chips. I am entirely dissatisfied with the chips , & would ask for reimbursement for the 6 bags of \"Salt & Vinegar\" in the form of 6 bags of \"Salt & Black Pepper\" coupons or credit to my Amazon account.",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory M. Vaughn",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "is tha gud good sh**.",
      "text": "is good i bought 2 box's and now im back 3 months later with some info, DON'T GO ON KETTLE COOKED ONLY DIET , at the end of the second box i was having stomach pains for days litterally made me throw up most times i drank water , it would come back up and now i have to eat health bars for months F!",
      "rating": 5.0,
      "verified": true,
      "author": "Devo H C",
      "helpful_votes": 2,
      "publication_date": 20170912
    },
    {
      "title": "Bags open at the seem",
      "text": "I am on a subscription for this product so that my kids would have them just for lunch this is my second box and this box came and a lot of the bags are opened at the seem I am not happy I didn't open them right away because we had chips from another order.",
      "rating": 2.0,
      "verified": true,
      "author": "Director of business",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Defective chip bags",
      "text": "I love this variety pack and thought it was a good value. However, upon opening A few of the bags I realized there was only like 5 chips in some of the bags. A few of the bags were deflated and you can tell from the get go something wasn’t right. This is not ok!",
      "rating": 2.0,
      "verified": true,
      "author": "Angie Olmedo",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Stale, watch out",
      "text": "It was a waste of money and bad for the environment because I couldn't eat the chips they were all stale...",
      "rating": 1.0,
      "verified": true,
      "author": "Melanie W.",
      "helpful_votes": 3,
      "publication_date": 20180917
    },
    {
      "title": "Good but Do Not Care for the Tropical",
      "text": "The fiesta box was good, but a little disappointed with the tropical salsa flavor, was very bland. It should be taken off the boxes and just keep the other 3 flavors. Recommended but just don't expect much on the tropical.",
      "rating": 5.0,
      "verified": true,
      "author": "Esmeraldas12",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "If you don't have will power, stay away of these",
      "text": "These were so fresh and crispy I had to use a lot of self control not to eat 2 or 3 bags at a time. The pack had 12 Jalapeño and 6 of each of the others. Loved them all and am going back to order another box.",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "My delivery drivers love these chips",
      "text": "I keep a box of snacks outside my front door for delivery drivers, and I always include some of these chips in the box. My drivers seems to like them better than most of the other snacks that I leave out.",
      "rating": 5.0,
      "verified": true,
      "author": "James Astro",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Not My Taste",
      "text": "The flavors were either too strong or too weak depending on the bag. Spice is not a flavor and I feel like they went over board with the seasoning of the chips to the point where they're very unpleasant to eat. I didnt really enjoy any of the flavors and now im stuck with a bunch of bag of chips.",
      "rating": 2.0,
      "verified": true,
      "author": "Dwayne Jaye",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "The assortment of chips were great",
      "text": "These chips were kettle cooked and that was wonderful I got an assortment pack, the jalapeño chips were very hard for our family if you like hot order the jalapeño all the others were special in their own way I would have given it five stars except I changed it to a four because of the chips that were too hot which is really my opinion and not the companies problem",
      "rating": 5.0,
      "verified": true,
      "author": "JSS",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Mostly excellent to good chips that aren't too salty, however the vinegar were too sour.",
      "text": "We are chip fanatics. So, how did these fair on our opinions? The potato chips were fresh and mostly whole. They were very crisp and had good thickness being neither too thin or thick. Our favorite flavor, being unanimous, was sea salt and pepper. Those were excellent! But, was there a flavor not liked? Yes, the vinegar and sea salt was too sour. There are vinegar flavored potato chips out there we do like, just not this one. The jalapena was good, but barbeque was ok, not at all bad, but just fine. I like the fact the chips weren't too salty like most of the top brand potato chips.",
      "rating": 4.0,
      "verified": true,
      "author": "southern heritage",
      "helpful_votes": 0,
      "publication_date": 20150516
    },
    {
      "title": "Great chips.",
      "text": "I do like these chips. Although if I was to get this again, I'd only get the BBQ ones. I love Salt and Vinegar chips. But these are way salty to the point of my ankles swelled up, and they never swell when I eat that flavor. The Jalapeño chips are good. The only bad thing is the flavor of the chips tend to stay in the mouth way past you actually eating them. The salt and pepper chips are not bad. I do recommend only getting the flavor you know you like.",
      "rating": 4.0,
      "verified": true,
      "author": "MPLIM",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Open bags",
      "text": "About 1/3 of the bags in this box were open and the chips were spilled out in the box. It must have been like that for sometime because there are oil stains throughout the bottom inside of the box.",
      "rating": 2.0,
      "verified": true,
      "author": "C+M",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great for family dinner",
      "text": "We have Sunday family dinners and this Sunday we had smoked ribs, baked beans and potato salad. The variety of chips and the individual packages make them perfect for our outdoor social distance dinners.",
      "rating": 5.0,
      "verified": true,
      "author": "peter sanchez",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Open bags and not a lot of chips for the money",
      "text": "Most of the packages in this box are cracked open. Out of the ones that make it most of them have barely any chips in them. I opened on bag and it have 2 chips. You read that right. Two chips in a bag. Look elsewhere and don’t buy these.",
      "rating": 1.0,
      "verified": true,
      "author": "Dizzle",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Good taste, decent ingredients",
      "text": "Great tasting chips. Not the cheapest, but it makes it up with the flavor and ingredients. I like the benefit of having smaller portion bags to help with freshness and calories control.",
      "rating": 5.0,
      "verified": true,
      "author": "DiM",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Pregnancy Brain.",
      "text": "So I remember thinking about ordering these. But I don’t remember actually ordering them (Pregnancy brain). I’m not unhappy though. I got some chips. I love the brand. They’re perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "I usually love these chips",
      "text": "The bags were not sealed on the side. As they sat for 3 weeks the glue used to close them or the heat seal failed and the product became limp, soggy. Too late to return. I believe a carton of chips should last longer than a month.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Cable",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Good thing husband likes Jalapeño",
      "text": "The box has mostly Jalapeño and not a single pack of Sea Salt and Vinegar, so bit if a mixed bag, so to speak, for variety pack. The other chips are good, but a true mix of bags would have been nice. Thank you!",
      "rating": 4.0,
      "verified": true,
      "author": "Mariann R.",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Chips are good!",
      "text": "Chips arrived on time and safely packed. Tried the Jalapeno and they were tasty. Not too hot. The issue is I only received 29 bags. There were only 5 Sea Salt not six. It is always difficult to get a correction for missing food items.",
      "rating": 3.0,
      "verified": true,
      "author": "Faye B",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "Love Kettle chips",
      "text": "Got a great price on July lightning deal. But as someone else commented, there are too many Jalapeño flavored. They should even out the number of bags per flavor. Those jalapeño don’t hit till you stop eating, so just keep eating them. HOT!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Some bags were opened",
      "text": "Kettle makes a great chip, but some of the jalapeno flavor bags were completely open in the back. It appears that the glue holding the bag together failed. We had to discard them.",
      "rating": 2.0,
      "verified": true,
      "author": "Lostinbooks",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Yummy, diverse flavors",
      "text": "I tried these at Jimmy John’s. They are tasty compliments with sandwiches, for snacks. The jalapeño is a nice spicy accent with plain meals. Nice to crumble and add to casseroles.",
      "rating": 5.0,
      "verified": true,
      "author": " La Smurf",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "So delicious!",
      "text": "Great deal for these chips! I got them in April and they don't expire until September 2020, so anyone that is afraid they are going to get stale chips, I can say that the box I got was perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Crunch with mild flavor.",
      "text": "Box arrived slightly crushed but kettle chips are hearty. Great flavor, not too strong on spice. Chip qty in bag seems to have shrunk but could be settling. Overall, satisfied with the variety.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin P.",
      "helpful_votes": 0,
      "publication_date": 20200328
    },
    {
      "title": "Kettle is King",
      "text": "Loved the freshness, crispness and flavor. It was shipped in the original manufacturers packaging. Sizeable quantity for larger families not offered in retail stores.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyndirella",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "Too many Jalapeno Flavored Chips",
      "text": "I would have given a 5 star review if the package did not come with so many of the Jalapeno Flavored chips. Don't get me wrong, the chips taste great but I wish they would add less of the Jalapeno Flavored chips. The price is on point for the amount of chip bags that you get in each pack. I recommend these chips.",
      "rating": 4.0,
      "verified": true,
      "author": "shoppin' gal",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Most bags were busted open.",
      "text": "Love these chips, unfortunately most bags were busted open at the seams when it Arrived. They need to add something to the box so the bags don’t move around as much during transit.",
      "rating": 3.0,
      "verified": true,
      "author": "Mrs. P",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Variety and spicy",
      "text": "My favorite chips in a variety I can share. Jalapeno chips that are actually a little spicy. Salt and pepper crinkles that are yummy. My daughter's favorite is the salt and vinegar.",
      "rating": 5.0,
      "verified": true,
      "author": "SharonsRose13",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "No",
      "text": "This was disappointing. Way too salty and the flavors taste odd. I enjoy Mexican flavors and this was not it. Kettle your bbq and regular salt flavor are good. Please stick to that and not this",
      "rating": 1.0,
      "verified": true,
      "author": "Lola",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "very good quality and flavor assortment (3 of 4)",
      "text": "Good variety pack of excellent quality chips. jalapeno and salt & pepper are my favorite flavors. The barbecue is also very good. Less enthusiastic about the salt and vinegar, but it's good for a salt and vinegar flavor.",
      "rating": 5.0,
      "verified": true,
      "author": "R Bull",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Yum!",
      "text": "If you like spiceh ships, this is your box! The tropical salsa are THE BEST! I kind of wish they have a box of JUST THOSE. But they're all good. Perfect for lunches.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Barrett",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Why so many jalapeño packs?",
      "text": "The chips are great, but why does each variety pack have so many dang jalapeño packs??? The jalapeño are good, but I don't need 12 packs of them and only 6 of the others.",
      "rating": 4.0,
      "verified": true,
      "author": "Karóbahúzó",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Good quality and great value",
      "text": "The quality is very good and the value is great at time of the C19. Most other sellers sell it at a higher price, which is ridiculous. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Serena Ma",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "FINGER LICKING GOOD",
      "text": "These are the absolute best chips out there. Love the convenience of delivery with amazon and the quality of the chips are never compromised, always fresh and great portion sized bags. I only buy these from amazon, you should too.",
      "rating": 5.0,
      "verified": true,
      "author": "Sib",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Delicious",
      "text": "My husband loves these chips! No matter how big the bag I buy, he will eat the whole thing. Having these small bags handy we’re perfect so he still had his chip, but not too many. They were fresh and tastey.",
      "rating": 5.0,
      "verified": true,
      "author": "lorraine s quizaman",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Do Not Recommend",
      "text": "Wow! Talk about stale potato chips...these were awful. I can’t recommend. Price, shipping, availability doesn’t compensate for the poor quality.",
      "rating": 2.0,
      "verified": true,
      "author": "KD Murray, M.D.",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Yummy",
      "text": "Great for portion control. I liked all the flavors and found them to be fresh and crisp. They are also gmo free. Would order again as a treat.",
      "rating": 5.0,
      "verified": true,
      "author": "NoID",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Mixed flavor chips with good size packed",
      "text": "They have few varieties flavor chips in a box . I like almost all of them except vinegar flavor chip is savored. Good package box . It taste fresh and delicious .",
      "rating": 4.0,
      "verified": true,
      "author": "Rejoice",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "The variety was okay",
      "text": "You certainly get a lot of chips but the variety was just okay for me. There were more jalapeño and salt and vinegar chips then the others. Almost twice the amount. Those are my least two favorite in the pack. Maybe a more even mix would be better.",
      "rating": 3.0,
      "verified": true,
      "author": "JW1970",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Where are them bbq?",
      "text": "I love kettle brand chips but the box came only with 3 bag of bbq flavor out of the 30. Very disappointing but everything did taste amazing.",
      "rating": 3.0,
      "verified": true,
      "author": "Ze",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "back seal running down the chips were not seals got alot of open bag chips",
      "text": "Be careful alot of the chips were unseals in the back part as if the seal wasnt sealed, not what anyone needs at this time gross and very concerning",
      "rating": 2.0,
      "verified": true,
      "author": "Niknac",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Eh",
      "text": "The flavors are great, very strong. Of course, you've probably had them before. Were they worth the bulk buy...? No. But they were good",
      "rating": 4.0,
      "verified": true,
      "author": "Eli Vincent Schroeck",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Delicious chips in serving sizes to save me from myself",
      "text": "I can't stop eating these chips so the smaller packs are a life saver that satisfy with just the right amount of yum. Good value too.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Gekcho",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Not an even assortment",
      "text": "There’s 12 bags of Jalapeño flavor and 6 bags of each of the other 3 flavors!! Why on earth wouldn’t there be a more even distribution of the flavors?!",
      "rating": 1.0,
      "verified": true,
      "author": "Janell",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "Good!",
      "text": "I like these chips. They arrived and weren't all crushed up. Flavors are great. Husband really likes the Jalapeno. I enjoy the black pepper. All of them are good and have great crunch!",
      "rating": 5.0,
      "verified": true,
      "author": "Ranchgal35",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "they are ok",
      "text": "I didn't look closely enough as the bags are just 1 oz, they have a decent flavor but many in the bag being baked are hard to chew up, I was disappointed over all",
      "rating": 3.0,
      "verified": true,
      "author": "C. Reed",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Keep looking, dont waste your money",
      "text": "I bought these because I was half asleep and saw a notice that they were available and almost sold out. I should have gone to sleep. There is nothing special about these chips and most of the bags are more than half empty. What a rip off. They are bland, even the jalapeno ones are bland. I gave the rest away. Will not repurchase",
      "rating": 2.0,
      "verified": true,
      "author": "bmedic",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "SOME CHIP BAGS NOT SEALED",
      "text": "I have ordered this item in the past with no issues. However this shipment had a problem. All the Jalapeno flavored chip bags side seal were open. The bags were sealed at the top, but the back of the bag seal was wide open.",
      "rating": 3.0,
      "verified": true,
      "author": "MIKE B",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "They are great chips",
      "text": "These chips are great. Kettle chips have never disappointed me. I wish they have an option for me to mix and match what I want. I really enjoyed the BBQ and Jalapeno favor.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Hu",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Great chips but a few bags were squashed",
      "text": "A few bags were squashed flat and had lost air. We ate those first. Not sure how this can happen as the carton was fully intact.",
      "rating": 3.0,
      "verified": true,
      "author": "Baz",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Excellent flavors. You will not regret buying these chips I promise",
      "text": "Love the varieties and flavors of these chips I can’t find them in the store they are very good and addictive, I recommend you try these you will definitely like them.",
      "rating": 5.0,
      "verified": true,
      "author": "LORRI",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great Chips, Lots of my least favorite flavor.",
      "text": "Classic box-o-chips, right down to the \"heres twice as much of our least popular flavor\". This is great if you or someone in the house likes the Jalapeno flavor. if you don't you will either grow to love it or toss a quarter of the box. Kettle is one of my favorite brands of chips. The flavors are strong, the chips are really crunchy, and a small bag can really hit the spot. Ingredients are simple, and aside from being potatoes cooked in fat, they seem healthy enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Nick P",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "The real deal",
      "text": "More bags of jalapeño flavor per box of these variety Boxes - less of the other flavors. Wish we could choose which flavors we wanted more of and that there was more variety but good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle González",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Jalapeno is 40% of total and I like that!",
      "text": "My favorite chips collection, and lucky for me I like jalapeno (because it's 40% of the box). If you're not into spicy or sour flavors (jalapeno, vinegar, or pepper) then this package is not for you. If you are, then you'll like it! My kids eat the barbecue flavor only and can go through the salt & pepper one. There are 12 jalapeno, 6 sea salt and vinegar, 6 salt and pepper and 6 backyard barbecue.",
      "rating": 5.0,
      "verified": true,
      "author": "Incommunicado",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "TOO MANY jalapeño flavor!",
      "text": "Better read the fine print... WAY TOO MANY jalapeño flavor. There are double the amount of jalapeño, which i do not like at all! Won’t be buying again!",
      "rating": 3.0,
      "verified": true,
      "author": "Lauren Palmieri",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Delicious chips",
      "text": "I was excited to receive my large box full of 30 packs of Kettle chips. I appreciate the variety and portion control.",
      "rating": 5.0,
      "verified": true,
      "author": "Nails",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Missing packs",
      "text": "There were only 28 in the box. Ordered it for a group of 30 and it has 2 missing.",
      "rating": 1.0,
      "verified": true,
      "author": "Nas",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Kettle brand is great my definite go to addition to a sandwich .",
      "text": "If u love that kettle brand chip then this variety pack is for you especially if u have not tried the other variety they have ...product arrived On time and as advertised would buy again from this seller ...already planning on having the sea salt n vinegar variety tomorrow for lunch with a tuna salad sandwich mmmmm lunch time or anytime its all gravy!!",
      "rating": 5.0,
      "verified": true,
      "author": "jamie",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "Always fresh and delicious",
      "text": "Great product! Always fresh and delicious. Jalapeno is the favorite in my home and I wish there were more in the box.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Reid",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Mostly good but open bags in box",
      "text": "These are great for lunches at home or for work. But in the last box that I purchased, there were 4 open bags in the box!",
      "rating": 4.0,
      "verified": true,
      "author": "Frank J. Crow",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Read description carefully before you order",
      "text": "Chips are of excellent quality but I do not care for the jalapeno flavor and too many of these are included. It is clearly listed in the description, I just prefer the salt & vinegar flavor instead.",
      "rating": 4.0,
      "verified": true,
      "author": "Helen888",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "The best chips in the world",
      "text": "Other than having too much of one flavor than the rest they came fresh and packaged well. My family loves this brand and the flavors. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "EJ",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Must have!!",
      "text": "Super excited I found these for $5!! My husband and kids love them! And cheaper than going to a main grocery store.",
      "rating": 5.0,
      "verified": true,
      "author": "Virginia",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Bad delivery",
      "text": "Food good But delivery sucks, how would you like to find a food idem on top of your dirty trashcan👎😡😡😡😡",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara Young",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "great office snack",
      "text": "very popular with the crew, I'll think about buying another box or two in the future. the jalapeno seemed to be the last part of the box that was left by the last day. they were darn tasty though!",
      "rating": 5.0,
      "verified": true,
      "author": "funkbear85",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Please take me off the order each month.",
      "text": "I didn’t like these chips almost all of them were hot chips I didn’t like the banquet ones so I’m going to try others I’ve already ordered for April.",
      "rating": 2.0,
      "verified": true,
      "author": "Patricia A. Raymond",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Took a while and was worth",
      "text": "Great crispy potato chips with lots flavor; delivered somewhat later than originally. Guess they did fry them especially for me 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Helmut Steinberg",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "YUM!!!!",
      "text": "I’m very please and satisfied thank you for not letting me regret spending my money... tasty and yummy and fresh thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Sunev",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "The flavor of the jalapeño chips were little to none..",
      "text": "The jalapeno chips mostly tasted like regular potato chips. I'm not sure if that's how they come but they barely had any flavor. All the other chip variants had the correct flavor though",
      "rating": 3.0,
      "verified": true,
      "author": "Tyler M",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Good",
      "text": "Not enough of my favorite ( salt vinegar) might not order again for that reason, but product it self is good",
      "rating": 4.0,
      "verified": true,
      "author": "EA",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Salt and pepper is the worst flavor imaginable",
      "text": "Great chips. Except for salt and pepper. If there is a hell the only flavor they have is salt and pepper. Which taste neither like salt and pepper but what I imagine dried raccoon **** taste like.",
      "rating": 2.0,
      "verified": true,
      "author": "jason cargill",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Great chips but unequal numbers",
      "text": "Zero idea why, but every time we order we get way more jalapeno flavor than any other, so we stopped buying. Just wish they'd provide an equal number of each flavor.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Rekenthaler",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Yummy!",
      "text": "Ordered a few times. Always fresh, and great variety of flavors! Definiely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Marie",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Uneven Amount of Flavors! :(  WHY?",
      "text": "Very few plain chips and too many jalapeño, cheddar and BBQ. Was not happy with this purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Beanage",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "Missing chips",
      "text": "The Salt and Pepper was not in the box. It was instead replaced with more Jalapeno chips.",
      "rating": 3.0,
      "verified": true,
      "author": "Sabrina  O'Connor",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Mmm good",
      "text": "Great chips and I enjoy all of the crunchy flavors in this box. I especially like the cheese ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Bad delivery",
      "text": "Don’t usually have an issue with getting theses delivered but today the box was beat up bad, so I’m going to cancel my monthly delivery. These are my husbands favorite but it’s just a box of crumbs this month. They are good chips just wish everybody handling the box would have taken better care.",
      "rating": 5.0,
      "verified": true,
      "author": "Omaha",
      "helpful_votes": 0,
      "publication_date": 20200728
    }
  ],
  "product_meta": {
    "title": "Kettle Brand Potato Chips Variety Pack, Sea Salt & Vinegar, Krinkle Salt & Pepper, Backyard BBQ and Jalapeno, 30 Count",
    "description": "Flavor Name:Variety Pack Salt & Vinegar, Salt & Pepper, Backyard Barbeque, and JalapnoHot fun in the summer time (or anytime)! Here's an entire variety pack of Kettle Brand Potato Chips fun led off by a dozen bags of our zesty Jalapeno, and then six bags each of our wind-whipped Sea Salt & Vinegar, earthy sublime Backyard Barbecue and basically delightful Salt & Fresh Ground Pepper. It's your own family adventure in a, easy to store pantry box.",
    "rating": 4.5,
    "feature_bullets": [
      "6 Sea Salt and Vinegar, 6 Krinkle Cut Salt and Fresh Ground Pepper, 6 Backyard Barbeque and 12 Jalapeno bags",
      "1.5 oz single-serve bags are great for snacking on-the-go",
      "Your favorite flavors of thick-cut, crunchy kettle cooked Kettle Brand potato chips",
      "All natural ingredients: Non-GMO Project Verified, No MSG, No artificial colors or flavors",
      "Certified Gluten Free, No trans fat, Kosher"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "20 x 15.75 x 7 inches; 4.3 Pounds",
      "Item model number": "109402",
      "UPC": "600682782364 084114125927",
      "Manufacturer": "Kettle",
      "ASIN": "B00CWYM3OI",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Chips & Crisps",
      "Grocery & Gourmet Food",
      "Snack Foods",
      "Potato"
    ],
    "price": 16.98
  }
}