{
  "website_summaries": [
    {
      "verdict": "Affordable, expandable set that holds up to considerable travel and baggage handling.",
      "pros": [
        "Wheeled carry-on has a smooth with low-profile wheels",
        "Polyester/PVC material blend has high tensile strength",
        "Top and side carry handles on both bags for the ultimate convenient design",
        "Available in a wide variety of identifiable prints"
      ],
      "cons": [
        "Telescopic handle can feel a bit flimsy, and frame can be crushed if too much pressure or weight is applied"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Prop 65 warning right on tag",
      "text": "I was disappointed that this luggage had a prop 65 warning right on the tag, yet Amazon lists no warning. Had I known, I would not have purchased this. I believe it to be misleading people. It should be listed for people to take into consideration. Possible reproductive harm and cancer? Wonderful. If I could give zero stars, I would. If you are not concerned about that warning, then it looks like an ok product. Definitely get what you pay for. It looks ok on the outside but cheap lining and smells like chemicals on the inside. Would probably air out in a few days. I'm sending this back.",
      "rating": 1.0,
      "verified": true,
      "author": "Chasesmommy",
      "helpful_votes": 291,
      "publication_date": 20180709
    },
    {
      "title": "Very nice set!",
      "text": "We bought this luggage set as our carry-on for my two year old during an international flight. She just loved pulling in around the airport by herself. The vibrant colors are beautiful, The zippers were strong and held up great. It seems like an overall sturdy wonderful luggage set. The small bag easily slips over the long handle of the taller bag, making it easy to pull both of them together. There are several zippered areas to store smaller items, including a flat one for books. We were very pleased with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 45,
      "publication_date": 20161218
    },
    {
      "title": "\"Warranty\" is a $25 per occurrence and bag fell apart on first use! Photos",
      "text": "One of the bags fell apart on the first use! The divider that separates the main compartment from a side one has come apart. I can not see where to get it replaced and even through it has a 5 year warranty (they require you to send them $25 handling charge BEFORE they do a thing, if they do) the bag is not worth $25. So the 4 bag set after the FIRST use is a 3 bag set. Please see the photos showing the issue. If they step up and fix the issue I will update this review, but for now its sadly a one star review for both the warranty policy and construction.",
      "rating": 1.0,
      "verified": true,
      "author": "liVVi",
      "helpful_votes": 18,
      "publication_date": 20180429
    },
    {
      "title": "Not balanced properly.  The wheels are off or something.",
      "text": "UPDATE: Very disappointed that as other reviewers stated, it is not balanced properly and at the Atlanta airport I had to keep stopping and fixing the little bag and the set kept tipping over!!! Then after all that, a dang zipper broke on the little bag!! Argh!!!!! I travel frequently and this is the first time I've had issues with unbalanced carry on tipping over!",
      "rating": 1.0,
      "verified": true,
      "author": "*Rock Star*Top Contributor: Painting",
      "helpful_votes": 28,
      "publication_date": 20161128
    },
    {
      "title": "PERFECT!!!",
      "text": "My daughter is 8 and absolutely LOVED this set.. Perfect size for her.. We went on a week long trip and everything fit!!!",
      "rating": 5.0,
      "verified": true,
      "author": "T_Nifong",
      "helpful_votes": 163,
      "publication_date": 20150609
    },
    {
      "title": "and was disappointed before I even left the house",
      "text": "Was really looking forward to my trip, and was disappointed before I even left the house. While I was putting stuff in the smaller bag, noticed the material on the handle was fraying. Didn't even take it with me cuz I was afraid the handle would break. Then the suitcase kept falling over. Should have listened to other reviewers who complained about the same thing. I even tried to take stuff out so the weight would be evenly distributed. Still tipped over. Ended up taking old duffel bag on the trip instead. Returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Tori A.",
      "helpful_votes": 10,
      "publication_date": 20180801
    },
    {
      "title": "it is relatively almost like a makeup bag",
      "text": "I ordered this product and find the smaller piece to be so small, it is relatively almost like a makeup bag. The larger piece is ok, but it will not stand by itself after packing, so you cannot carry it easily. This set would be ok for a child that is having an overnight, but for adults wanting to pack light for a plane trip, it is awful. Very misleading in the description, but I guess you get what yo pay for. I would not order again.",
      "rating": 1.0,
      "verified": true,
      "author": "David F.",
      "helpful_votes": 10,
      "publication_date": 20180715
    },
    {
      "title": "Spend an extra ten bucks on something worth while",
      "text": "Telescoping handle broke after second use. That extra bag is pretty much worthless. As you can see on the image, the hooks on the side for the shoulder strap are positioned too low, so if you try to use it, it just basically flips upside down. And its a weird size. Too small for a gym bag, too big for an overnight bag. What do I do with it? Well I use it as a small gym bag, and I have to put the strap kinda through the handle in order to keep it positioned upright. Then again, it was super cheap, so what did I expect?",
      "rating": 1.0,
      "verified": true,
      "author": "Merschenary",
      "helpful_votes": 16,
      "publication_date": 20170123
    },
    {
      "title": "My daughter loves this set",
      "text": "Bought this for my 8 yo daughter who has outgrown her \"Dora\" suitcase that she had as a young kid. She loved it and is thrilled to not have to wheel Dora through the airport anymore. Was amazed at the quality for the price. Not only is this a very cure bag set, but it is something I can see her using for years. She loves the design and the color, but I love the quality and functionally of the set. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 14,
      "publication_date": 20170326
    },
    {
      "title": "I LOVE LOVE LOVE this luggage",
      "text": "I LOVE LOVE LOVE this luggage! It's super light and super cute. I shared an image of it on social media and tons of friends are ordering it as well. Thank you! I'm very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Sparklemama",
      "helpful_votes": 11,
      "publication_date": 20180210
    },
    {
      "title": "Love these bags for my Grandchildren!",
      "text": "I purchased several sets of these for my Grandchildren ages 3-7. The smaller bag is perfect for overnight stays at my house. A nice size that fits a lot of stuff including a favorite blanket and stuffed animal. The larger bag is perfect for weekend trips and more!",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa",
      "helpful_votes": 6,
      "publication_date": 20190805
    },
    {
      "title": "Great buy!",
      "text": "Bought this set for a trip to Hawaii and I was a little worried to see how it would hold up since reading some reviews of this set. Pros: -Package came quickly and was well packaged so there was no initial damage. -Design pattern does not look cheap -Wheels spin freely so they work well when dragging behind -Large and plenty of space in each bag Cons: -Only one thing that could be improved on this set is the handles. They feel a little flimsy but still work flawlessly. Overall: -A great set for the money that will last for many trips.",
      "rating": 4.0,
      "verified": true,
      "author": "michael w",
      "helpful_votes": 12,
      "publication_date": 20160804
    },
    {
      "title": "Very sturdy, awesome bag!",
      "text": "Loved my bag! Held enough for a 2 week vacation and loved the fact that the smaller bag slides over the handle of the other one so you only have to pull the one bag. Loved it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 29,
      "publication_date": 20150716
    },
    {
      "title": "Rockland luggage",
      "text": "The luggage is amazing! Its okay to carry on your trip and it looks big enough for me to carry a weeks worth of clothes! :) ***Update*** now since I went on my trip the case can not fit a week's worth of clothes! It can only fit like 4. The only good thing about the suitcase is it big enough to fit on the train overhead and the planes overhead",
      "rating": 5.0,
      "verified": true,
      "author": "kelsey",
      "helpful_votes": 14,
      "publication_date": 20170330
    },
    {
      "title": "Perfectly",
      "text": "I feel super lucky and blessed to have gotten these. Awesome price and high quality. I still can't believe my three-year-old asked for these for her birthday this is what she wanted above anything else and she has been so happy and she has played with them put her items in zippered it up and carried / wheeled it around the house they are very durable. And work great. It was a 2 piece set and the smaller piece that attaches to the handle also has a strap. These would work great for traveling. Dont mistake my review that they are toys they are actual Luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "MK Perfectly pretty",
      "helpful_votes": 2,
      "publication_date": 20191109
    },
    {
      "title": "Cutest Zebra print Luggage Set!",
      "text": "My set of luggage arrived yesterday. I open the box and I was expecting a strong odor from all the other reviews that I had read and there wasn't any. This is the cutest set of luggage I've ever seen! They look like they will hold up, although I haven't gone anywhere yet. I purchased them in advance for overseas trip to Australia next spring, but I'm sure I will use them before that. I will leave extra feedback if anything goes wrong but I'm very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne L. Ryden",
      "helpful_votes": 7,
      "publication_date": 20170720
    },
    {
      "title": "Overall decent",
      "text": "The luggage is about what I expected. It was purchased for my toddler daughter, so everything fit well. The suitcase came with a travel lock but no key. I checked all compartments and it's definitely not included, and the lock was locked onto the zipper when the luggage arrived. The other reason I'm giving the product 4 stars instead of 5 is because of the very strong chemical smell emitting from the luggage. I aired it out for over 24 hrs and sprayed febreze on it. Still has an unpleasant smell 2 weeks later. The size of the luggage is great, the handle works well, and the extra bag was nice to have to pack toys for our trip.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristen Frost",
      "helpful_votes": 3,
      "publication_date": 20181221
    },
    {
      "title": "Used one time and small bag's handle ripped off",
      "text": "I bought this for my daughter to pack her own luggage because we were taking her to Disney before her transplant surgery... The Large bag was great and remains in excellent condition, however after only using it one time the smaller bag that came with it did not hold up and the handle on one side ripped off. I would have loved to give this a good review but after just one use it should have held up much better. I won't be buying luggage from this brand again unless they can convince me otherwise. This year I bought luggage from American Traveler... I really wish I could have given this set a better review",
      "rating": 2.0,
      "verified": true,
      "author": "Jeremy M.",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Sized for an overnight stay",
      "text": "Omg😲!! This suitcase is too small, it's shorter than my end table!! I ordered this set for my trip, thinking I could fit four days worth of clothes in it and I CAN'T😔!! I l💓ve the size of the carry-on bag and it's really cute but the suitcase is a big disappointment👎!! I will be sending it back and hopefully a bigger one will be sent in time for my trip🤞!!",
      "rating": 1.0,
      "verified": true,
      "author": "Nikita",
      "helpful_votes": 12,
      "publication_date": 20170423
    },
    {
      "title": "Excellent luggage set",
      "text": "It is exactly as shown and I love it. I am using the larger size as well as the smaller size as my carry on to Disney World. I was able to pack enough clothes (I tend to over pack), shoes, snacks, etc. amongst the two. I’ll even have enough space to pack my souvenirs I bought in the larger one as well. It comes with very small locks and keys but I didn’t use those because the keys are very thin and I felt that if I used too much force to unlock the lock, the key would break. But other than that it’s a great 4 piece luggage set and the price was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jojo0611",
      "helpful_votes": 3,
      "publication_date": 20181021
    },
    {
      "title": "Super cute! It’s exactly what I wanted!",
      "text": "This is super cute! I travel a lot for speaking and leisure and I wanted something carryon size but cute to travel with and this is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie L",
      "helpful_votes": 5,
      "publication_date": 20190508
    },
    {
      "title": "Nice luggage set",
      "text": "I purchased these to use while I am taking a few weeks each month to care for a friend. Just enough room to take a couple pants, shirts, and accessories. The small one holds all the bathroom stuff, etc. It seems very durable - have used it 3 times now and I really love the colors. Stands out!! Would recommend for the great price.",
      "rating": 5.0,
      "verified": true,
      "author": "Ila L Rodgers",
      "helpful_votes": 2,
      "publication_date": 20200306
    },
    {
      "title": "Great",
      "text": "We just ordered these for a trip to Turks and Caicos. My girlfriends handle was slightly broken and was a mild annoyance for her, so I can see why some reviews are poor. Clearly these are cheap because not much attention is paid to production. With that being said, these were more than worth their value and held up very well. They were the perfect size, and actually fit everything we needed comfortably for a 5 day trip. If you’re planning on only using carry on, these are the bags for you. If you are checking bags, you should definitely go for a larger size.",
      "rating": 5.0,
      "verified": true,
      "author": "Kyle Vincent",
      "helpful_votes": 2,
      "publication_date": 20190213
    },
    {
      "title": "I hope the pretty pattern will bring a smile to a little girls ...",
      "text": "Bought it as a gift for a church that is providing suitcases to foster children. Most of these children show up with their belongings in a plastic bag so the suitcases are a big help to them. I hope the pretty pattern will bring a smile to a little girls face during a very difficult time.",
      "rating": 5.0,
      "verified": true,
      "author": "HL08",
      "helpful_votes": 10,
      "publication_date": 20161201
    },
    {
      "title": "Ordered for young kids - perfect size!",
      "text": "I ordered two of these luggage sets. One in bubblegum pink and one navy with gold trim. After looking high and low for suitcases for a 4 and 5 year old, I decided to get something that had cute colors that they would be excited about, but that could grow with them. So many of the other luggage options out there for kids were covered in characters they wouldn't even care about in 6 months. These suitcases are going to be perfect for them - they're perfect for kids or if you want a very small carry on bag. Can't beat the price either!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren T",
      "helpful_votes": 2,
      "publication_date": 20181213
    },
    {
      "title": "Get it, or you'll regret it!",
      "text": "I was taking a vacation this super and was in desperate need of some affordable, yet quality luggage. Seeing as how my boyfriend and I were also traveling together for the first time, I also wanted something cute and fashionable, while also being practical and not too childish. This suitcase nailed every requirement! It was light weight, fantastic quality, wheeled very well and I loved how the carry-on bag has a strap on the back so you can hook it right on top of your suitcase and carry both bags with one hand. If you're looking for the perfect carry on luggage, this is the one for you!",
      "rating": 5.0,
      "verified": true,
      "author": "Erin Nicole ",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Not 21\" tall as advertised... much smaller",
      "text": "I purchased this set because the size met the carry on specifications of my airline perfectly. However, when the luggage arrived it didn't look quite right. After further inspection I found that a tag on the luggage said the height of the roller was 19\", not 21\" like it's advertised. I took out a tape measure, and like I thought, this luggage is not 21\" tall... 19\". When you're trying to fit two weeks of clothes in one carry on every inch counts. Not impressed. Returned immediately. Thanks for nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "TheAmazingMrsA",
      "helpful_votes": 10,
      "publication_date": 20151205
    },
    {
      "title": "Does not stand up when packed.",
      "text": "While there is nothing wrong with the luggage itself, I was no aware that it will not stand up when packed. You are constantly having to prop it against your leg or something else while waiting at the airport. Both pieces are carry on size. This does not mean these 2 pieces plus your purse. The bigger one is your carry on, and the smaller one is your personal item. I wish someone had mentioned that the roller luggage does not stand up when packed. If you travel much at all you want to go ahead and get one with 4 spinner wheels that stands up.",
      "rating": 3.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 5,
      "publication_date": 20170319
    },
    {
      "title": "NOT for frequent travelers",
      "text": "You receive what you pay for. First time I used the hand bag, I opened the center zipper and it just came off in my hand. There was nothing to stop it from separating. Very, very poor zippers and stitching. The collapsible handle is very, very flimsy and twists in your hand. It is also very short which makes it difficult to pull behind while walking. You will constantly be kicking and tripping on the suitcase. I have used this carry on four times since buying and it just will not hold up for frequent flyers. Should be fine for the occasional traveler though, as long as you temper your expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "clint sanderson",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Handle torn first trip",
      "text": "I purchased these for a flight on spirit airlines. It complied with their strict carry on sizing. I have only used this for one flight so far, but the smaller bag had the carry handle tear out of the seam on the first day, first flight. I only had a small purse, a small book, and a couple granola bars inside. It was not packed full, or with heavy items. I hope that the main bag holds up for more flights. With the cost of the carry on and checked bags, I hope to use it more.",
      "rating": 3.0,
      "verified": true,
      "author": "Kathy in Maryland ",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Great value - met size reqts for European low-cost airlines",
      "text": "For the price and value, great! Wish it was 4-wheels instead of 2 but again, good value for the low price. I got it specifically to meet the carryon luggage size requirements on European budget low-cost airlines - smaller than that of US domestic airlines. Worked well for that. This luggage system also held well for a 1.5 week of travel across 3 countries. No damage. But still wish it had 4 wheels for easier maneuverability.",
      "rating": 4.0,
      "verified": true,
      "author": "AmazonShopper",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Great value Suit Case",
      "text": "This is a set for light travel. It is made well and withstood my 19 throughout his trip. We did not have to check his bag it was able to carry on. Almost every trip we have to replace his suitcase this one did great. The suitcase fit everything he needed for a 4 day trip with 2 days of air travel for a total of 6 days. Thank for amazing products that didn't break the bank.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer strawn",
      "helpful_votes": 2,
      "publication_date": 20190514
    },
    {
      "title": "Tempting price...but you get what you pay for.",
      "text": "This did not even last a 12 day trip that included car, air, and cruise ship travel. The zipper broke on the smallest suit case that was very lightly packed and the largest was a total disaster after the last plane ride. The outer material ripped off the interior framing of the suitcase and had huge zipper problems as well. Amazon was great at rectifying my problem but there is a good possibility if you use this for air travel that during the hustle and bustle of it all you are very likely to lose some of your items due to poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Lots of Birthdays",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "Cheap and it shows",
      "text": "I ordered the charcoal--it was more of a greenish gray. The straps and borders are a BRIGHT orange. It definitely did not match the colors in the photo. The luggage itself is very flimsy and thin. The handles are very low quality and I had some difficulty getting them to retract. They felt as if they would bend in two with the smallest amount of pressure. The smaller piece of luggage is paper thin and very small. If you're using this for a kid to attend sleepovers, it's probably fine. It's certainly not grown-up luggage.",
      "rating": 2.0,
      "verified": true,
      "author": "Whitdiggity ",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Size does matter, I should have measured better!",
      "text": "Carry on size limit = standard domestic carry-on luggage size is 22” x 14” x 9”, which includes the handle and the wheels This bag is 19\"H x 13\"W x 7.5\" expandable 2 \" with 2 corner wheels Wouldn't think that couple of inches would matter - it really does! I could almost fit this suitcase into my old one. So wont be using this for the trip I purchased it for. Can't return it as I am past my return date by a few days! The additional personal bag is nice and I may use that, but again; it is substantially smaller than allowed. Nice bag otherwise, maybe I can use it for a weekend bag?",
      "rating": 3.0,
      "verified": true,
      "author": "DanaC",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Love the set so much I bought 2!",
      "text": "Loved this luggage! Bought a few sets and they held up perfectly for a family of 5 on an international trip with a few plane changes. The patterns are classy and distinct - we could pick out our luggage the minute it popped onto the conveyor belt. They are good sizes, the smallest rolly bag CAN be used on most airlines as a carry on. The dimensions on it list it is about 1 or 2 inches too big so I was a little worried I'd have to check it, but it fit perfectly in the overhead bin and not a single flight questioned my use of it as a carry on.",
      "rating": 5.0,
      "verified": true,
      "author": "PryncesPhD",
      "helpful_votes": 5,
      "publication_date": 20161103
    },
    {
      "title": "PERFECT!",
      "text": "I have gotten so many compliments on this set and constantly refer it to those that I know travel often. This is the perfect set for organized travelers. It is spacious and extremely durable! I love how practical and easy to use it is. The carry on bag is the perfect size to maximize overall available usage. I have used it and borrowed it out frequently for two years. This set has gone on many domestic and international travels and it still maneuvers smoothly with no broken zippers, rips, or tears! I cannot give enough praise and will happily reorder when the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Cute inexpensive luggage set",
      "text": "Great little suitcase set. As other reviewers mentioned it does tend to tip over sometimes, depending on how you pack it, but I didn't find that to be a problem if I was mindful about positioning it properly so it could lean against something. The size was just right for me and fit everything I needed for a week in Hawaii. The separate tote bag fits nicely over the roller bag handle and held my tablet, snacks, chargers, cords, book, water bottle, etc. The purple print is cute and easy to spot on the luggage carousel. Great value for the price. Time will tell how durable it is but so far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana Traydon",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Great and cheap carry on!",
      "text": "We traveled with delta and really needed some carryons. I searched based on size and price and these were a steal nonetheless. I was able to fit a weeks worth of clothing for a trip and it was great. It would if been easier to have a bag with 4 wheels due to having a toddler but that’s my bad since we had 3 carry ones plus 3 personal items and only to adults and one 4 year old. But definitely great if your able to pull your own luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith Flores",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Very satisfied",
      "text": "My only complaint is there was a luggage lock missing. That did not matter since I was using as carry on only. They were perfect for my trip to Montana. I ordered 2 sets. They expanded nicely. Plenty of pocket room. They stood out at the airport. If you travel regularly this might not work for you as the inside material is cheap and could breakdown. But for a once a year vacation this made sense for me. I couldn’t find a better deals in stores with Coupons’s.",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth taylor",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "PERFECT DIMENSIONS AND WEIGHT",
      "text": "So many airlines are requiring specific weight and dimensions for your luggage if you want to carry on. I never minded that until I was going to Europefor 3 weeks. This is perfect. Light weight and I packed it perfectly with the help of the compression packing bags. We self checked in and sailed through with both pieces. We went from country to country and never paid for luggage.",
      "rating": 5.0,
      "verified": true,
      "author": "DEE",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Pink Luggage",
      "text": "Everything looks good on this. Its a good cheaper luggage. Will do for what I am using it for. Smaller than I was thinking but that was my fault I didn't pay attention to the size listed. The only thing I have to say is the tag on the luggage that says \"Ok to carry-on\" \"new airline restrictions permit two carry-ons per person\" is not right. I work for an airline and you are only allowed 1 carry-on and 1 person item. You could not carry 2 of these onboard with you. That tag is misleading to people who are not familiar with flying.",
      "rating": 5.0,
      "verified": true,
      "author": "krodgers01",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Nice!!",
      "text": "Bought four of these luggage sets all in different colors/patterns to be easily discernible from each other’s and from other people’s luggage. I was so glad that they had so many options to choose from! That was definitely the hardest part, picking out which ones to get! The price on these is amazing! I must say I was a bit skeptical about how they would turn out being at that price but We love them! The colors are vivid and just like they are pictured. They are light, a little over 5 1/2 pounds each for the suitcases and about a pound and a half for the bag, but seem plenty roomy for what we are needing. Would definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheanna",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Tippy Trippy",
      "text": "First off, the zippers on the tote bag were misaligned, susceptible to splitting. The bag pulled okay, unless you hit a bump, then it tipped to one side. But the WORST thing? It does NOT STAY UP!! Even when the suitcase is empty, it falls forward. This was very awkward in the airport, especially when you really needed it to stay up. I liked that the tote had a strap to slip over the handle, BUT that made the bag even MORE unstable. I ended up going to Walmart and purchasing a bag with 4 wheels, a little cheaper, but WAY more stable. Save your money. Go to Walmart.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul. Lueders",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Very Good Luggage but a very big BUT....",
      "text": "It's my own fault. Didn't actually looked at the dimensions that this luggage is small enough to use as a carry on. I thought I was getting a check in sized bag but that's no fault of the manufacturer. His dimensions is right there I just failed to utilize it. Quality is pretty darn good. Zipper seems heavy duty enough to handle clothes that needed standing on to zipper up. Other than my own fault, this is a good product and I still have a good use for it so it's not going back.",
      "rating": 5.0,
      "verified": true,
      "author": "Filipino Power",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Love the color, cute design",
      "text": "Initially, I had bought these for my grandmother as she was about to go visit some family relatives. Ufortunately in my haste, I didn't check the measurements so the suitcase itself ended up being a bit too small for her to use, but the bag (that came with it) she absolutely loved! So of course I gave her that and I ended up keeping the suitcase for myself. Overall, atleast it worked out for everybody! Oh and for (visual) measurements-I'm roughly 5\"2 and the suitcase (with the wheels on) came up just slightly above my knees.",
      "rating": 5.0,
      "verified": true,
      "author": "Magüis",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "It has a lot of space and very light weight",
      "text": "I really love using these items. They have so much space. The little bag is very deep and wide, I literally fit 16 bottles of 8 fl oz bath and body works lotion in it plus a few other items. They also have two other compartments to put stuff in. As you can see from the photo the suitcase is really deep which gives you a lot of space to put more stuff. You also have a zipper compartment in the inside which I always have filled to the max. And you have to compartment on the outside. Anytime I travel for a few days I always use these two items.",
      "rating": 5.0,
      "verified": true,
      "author": "Antionette",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Enough room to pack for a week!",
      "text": "I was looking for a new suitcase and I wanted something that was easy to move, looked good and had a second matching bag and came across this one. I usually travel to California once or twice a year for a week and was looking for a suitcase that had enough room to pack clothes inside for a week and let me tell you this has room for an entire week's trip. I love that it even has a handbag that matches the suitcase as well. I got this color because it looks sleek and beautiful. It moves easily and is light weight as well, LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "arber",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Great for the money, but will see on durability",
      "text": "This two piece set was very inexpensive. I purchased it when I was in a pinch...my old one broke and I needed something next day. Amazon delivered on it's next day promise so this was the bag for me. Measurement are accurate - make sure you check the size...it's on the smaller size. The roll bag lower quality than the smaller bag. The outside pockets on the roll bag are small and the material inside is very thin. You can see through it. The smaller bag is nice quality. I've been using it inside another suitcase for my toiletries.",
      "rating": 4.0,
      "verified": true,
      "author": "HTHONLINE",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "We would buy this again!",
      "text": "We bought these for a family vacation for our daughters. The suitcase was the perfect size for flight carry on and easy to maneuver through the airport. We used the smaller bag for books, tablet, etc. while on the plane. Love how the smaller bag slides easily and securely over the handle for transit so it's one less thing to keep track of. Seems fairly durable but we did not check this suitcase so it didn't undergo any rigorous handling. Great purchase for the money!",
      "rating": 5.0,
      "verified": true,
      "author": "SLH",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Held up well, easily identifiable",
      "text": "Wanted a feminine luggage set to take a trip without my family. I wanted something that would be easy to identify. This set meets criteria for carry on and personal item. It held up well and easily held 2 weeks worth of clothing and necessities. I checked the suitcase even though it met carry on requirements because I wanted to bring my own shampoo and conditioner and can’t fit enough in the 3-1-1 baggie. The checked bag held up well to being tossed about. The smaller bag fits over the handle of the suitcase for easy toting around. It’s a great set. I’ll be using it again in a few months for another trip.",
      "rating": 5.0,
      "verified": true,
      "author": "HarleyQueen",
      "helpful_votes": 2,
      "publication_date": 20171220
    },
    {
      "title": "Stitches coming undone",
      "text": "My daughter saw this luggage and immediately wanted it to use for her trips to her dad's. I received it promptly the next day (today). We opened it together and were disappointed to find stitches coming undone near the zipper. Other than the loose stitches, they seem pretty solid. The M.S.R.P. for both is $80 so the price is good. I will see how they hold up for her trip coming up next week.",
      "rating": 4.0,
      "verified": true,
      "author": "Leah",
      "helpful_votes": 3,
      "publication_date": 20190710
    },
    {
      "title": "Zipper broke and hard to maneuver",
      "text": "If you’ve used the luggage that swivels, you will regret buying this. It’s so hard to maneuver and I end up just dragging this around. I would not recommend it for airport travel. If you only have to go by car it’s ok. It falls down all the time and you cannot prop it at all. I just bought it and I’m at the airport right now regretting this buy. Add this amount to a nicer luggage that swivels both ways",
      "rating": 2.0,
      "verified": true,
      "author": "Reeses",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "I feel ripped off. Not good quality at all",
      "text": "Well.. I feel like I was ripped off. First of all I ordered purple and black and I got red. The suitcase looks like a child size suitcase!! It's so small! Looks like there should be a bigger one that comes with the set.. of 5... not a set of 2 like these come!! The bag that comes with it is very think and cheap feeling and cheap looking. Very disappointed!! Thought they were going to be just like buying them in a store..but they look cheap and feel cheap. Thin material and my daughter went to the store and paid $40 more and got a much better and bigger set.. that doesn't look cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "BBundy",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Great buy",
      "text": "Bought for my 8 yo son and he LOVES it. It held a weeks worth of clothing, a few pair of shoes and toiletries. He really liked the carry on for packing toys and small electronics he likes to use on road trips. Fabric and metal zippers seem very durable. It's not too big for him to manage and rolls really well. The lock/keys are a plus. I also think this will be something he can continue to use as he gets older. My teenager even asked if he could get a set.",
      "rating": 5.0,
      "verified": true,
      "author": "MrsRJJ",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Good for the price",
      "text": "Ok i read the reviews prior to purchasing so i didnt have super high expectations. I needed a small suitcase to use as a hospital bag when i go to deliver my daughter. The suitcase is the perfect size. Since i wont be flying im not worried about durability so much. There are TONS like over 30 loose strings sticking out the seams of both the suitcase and the bag but i dont mind clipping them. This wont be a constantly used suitcase so i think it will fit my needs.",
      "rating": 4.0,
      "verified": true,
      "author": "Hope",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Amazing!",
      "text": "So i bought this for my grandmother, she often goes places and this is perfect! it's a nice size and she loves the carrying case with the actual luggage. It's pretty big and it holds a lot. The only complain is it was a little confusing at first, because the zipper was a little stuck but then we simply zipped then unzipped and problem fixed! Must Buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jandi A.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "PERFECT for my 11 yr old nephew",
      "text": "His first plane trip, and everything was going to be carry on. This set was PERFECT! fit all his clothes and the extra bag fit his games, treats, electronics, etc. The best feature - the camouflage print material! He absolutely LOVED it - not to childish, very \"young adult\" and didn't look like he was using a adults' carryon. Fit was perfect for overhead storage (or underseat, the carry on is a little smaller than 'adult' size). So glad I found this for him, it's truly difficult to find something for a 'tween boy that's not too childish looking!",
      "rating": 5.0,
      "verified": true,
      "author": "A. V. Morrison",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Perfect",
      "text": "I put it next to a bag that used to be carry-on regulation size and can tell the difference. The description said it was only big enough to pack for two-day travel, but I can definitely put more clothes than that in there. The smaller bag is very roomy as well and is made with a slot that attaches it to the handle of the roller bag. This set is a great buy. I gave Maneuverability only 4 stars because the bag doesn’t sit evenly on the wheels.",
      "rating": 5.0,
      "verified": true,
      "author": "Book Worm",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Money Well Spent!",
      "text": "Just got it today and I’m so so impressed! I love it! I was worried it would be too small but it’s a perfect size. The handle can extend a long way. It comes with a cute little lock and key, and the tote is a decent size as well! I’m so very satisfied with it, money well spent!",
      "rating": 5.0,
      "verified": true,
      "author": "Tehya Martin",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Nice starter set",
      "text": "We bought 2 of these sets for our 8 year old granddaughters for Christmas. Seems to be a pretty nice set as a starter set for 8 year old little girls. Roomy, lightweight, easy to tote or roll -- i think they will be pleased with the set. The only con is the color -- i was hoping that it was the actual teal blue color in the picture but it is really more of a cobalt blue instead. Also these sets are better suited for young kids, tween-agers or teenagers but not for the serious traveler or adult.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi Barton",
      "helpful_votes": 0,
      "publication_date": 20191130
    },
    {
      "title": "Great buy!",
      "text": "I bought this only because I was traveling with family members that didn't want to check luggage at the airport, and as all of mine was too large for carry-on and the fact I already had nice luggage so I didn't want to spend much. I couldn't be happier with my purchase. It was stylish, durable, easy to get in the overhead bins, and even though small, I had plenty of room for a 10 day trip. (Well I'll admit I did stick shoes in my husband's bag!) I'm going to use this instead of my more expensive luggage from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Shoptilyoudrop",
      "helpful_votes": 2,
      "publication_date": 20191031
    },
    {
      "title": "Reliable Luggage",
      "text": "This luggage is fantastic. I have been using it for about 2 years now and it’s held up well. The colors have not faded and it fits everything I need. We travel across country every other weekend so we get plenty of use out of it and it has never once let us down. The inside lining and net pocket is not the best quality but it has not had any rips or tears this far. The only reason I say the quality isn’t great is based on feeling it but if you’re just looking at it then you can’t tell! Would recommend to anyone who wants reliable luggage for an affordable price!",
      "rating": 5.0,
      "verified": true,
      "author": "Haley",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "I think they are called Rockers but they were off set and made suitcase sit crooked",
      "text": "Love this for our 8 yr old granddaughter but wont sit straight on ? Rockers. Could see how uneven they were but she would not let us send it back as she was so excited. Wheels were even and everything else perfect. Really liked the size and design",
      "rating": 3.0,
      "verified": true,
      "author": "winston",
      "helpful_votes": 2,
      "publication_date": 20190627
    },
    {
      "title": "Very Pleased with these bags",
      "text": "Bought 2 sets of these to take my grandsons on a flight to Arizona. The smaller bag was wonderful for the smaller stuff I knew they'd want acess to while on the flight. The bigger was just right for a weeks worth of summer clothes. The boys, ages 11 and 5, were able to manage their own bags through the airport, and I had no problems stowing them overhead in the plane. Not only did the bags survive the flight out and back, but I still have them for our next big venture.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorijem",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Not a quality product",
      "text": "I only used it one time and the suit case tag feel off and one of the wheels is acting up. Not sure if I would use it again. And of course, the warranty doesnt cover damage based on what the airlines do to luggage. Makes no sense, since most damage occurs on the plane and not off...",
      "rating": 2.0,
      "verified": true,
      "author": "Giselle Marquez",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Cute Luggage",
      "text": "I bought this for my 9 year old daughter as she was always using my carry on to take on weekend visits to friends. She loves the pattern. It seems to be very maneuverable and it's light weight but I'm not sure of the durability. It's a cheap suitcase so I'm pretty sure it's not going to last us for years. I bought it because it was cute and the price was right. If you're looking for something to last forever keep looking. But, if you just want something for lightweight use it's worth the $$.",
      "rating": 4.0,
      "verified": true,
      "author": "Angela M.",
      "helpful_votes": 0,
      "publication_date": 20190908
    },
    {
      "title": "Wayyyy too small to be useful with airlines travel rules and prices for personal items and carry ons",
      "text": "Not very useful items. I’ve onky travelled once and not only are they way too small (they look regulation travel size in the photo and the duffle bag looks much bigger but I can hardly fit anything in it) but the suitcase is ridiculously small and basically I feel like I wasted my money It’s like the allowed carryon size is split into two overly small items. Which means having to spend a lot for luggage as All airlines do nowadays. Plus not easy to manouver. I’d like my $ back as this is not what I was expecting. Looks great in photos. But fails every other way",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa C.",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Lightweight, perfect size-- Does the job!",
      "text": "Just what I was looking for! Something I could use for up to a week of travel and a size where I don't have to check a bag, saving time and money! Have used it on 3 trips now since purchased in October (including trips overseas). Be careful not to overfill as the handle and zippers aren't the sturdiest, but they do the job! Happy they haven't popped.. so will treat this carefully so it will last longer. I'm a seasoned traveller/packer, so for me this size is perfect for a week of travel. Lightweight, and fits within the airline specifications for one overhead cabin carry-on, and one personal item stowed under the seat in front of you.",
      "rating": 4.0,
      "verified": true,
      "author": "maramima",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Mucho bango for your bucko",
      "text": "Exactly as described and Virgin international compliant for carry-ons. Of course for $33 it’s not a Halliburton case or Tumi but it’s pretty nice! Looks good, as shown in the photos. The stitching looks moderately durable and the telescopic handle works fine but does look a bit on the weak side but as long as your not trying to lift the bag up or jerk it around widely it should be fine. No issues like the one reviewers video that showed them not opening at the same height. Haven’t traveled with it yet but will update the review soon!",
      "rating": 5.0,
      "verified": true,
      "author": "J&C",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Lightweight and holds a lot",
      "text": "I got this as my airline carry-on bag when we went on our cruise, so I didn't want to pay a lot. It was so nice to have the 4 wheels! It rolls very nicely. It ended up getting put in regular cargo when I got to the gate on each flight, and it withstood the baggage handling very well. The gray with bright orange accents also made it visually stand out at baggage claim. I'm quite satisfied with this purchase. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn M Varney",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Great value!",
      "text": "We fly 2 or 3 times a year. I waned a carry on with wheels, but did not want to break the bank for them. These have been prefect. I have taken them on two trips. They are durable, easy to wipe off, the telescopic handle is perfect, and the expanding zipper is great. Only down side - and I would expect this with any 2 wheeled suitcase - is that it tends to get \"front\" heavy and will tip over. But, lean it against something and problem solved.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Meyer",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Don’t waste your money!",
      "text": "Not durable at all. Bag tore in multiple places within one year. I have used the bag less than 5 times. Very cheap feel. The carry on bag has held up but the personal item bag is horrible. The carryon handle is very flimsy. Don’t waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 2,
      "publication_date": 20190530
    },
    {
      "title": "Meh.",
      "text": "well, when I got this carry-on I loved it. This changed when I actually USED IT! it does not like to stand up when loaded. Its the biggest concern about this luggage. what good is it, if it can not stand on its own. Unfortunately, my boy dogs have marked it and I can not return. I was hoping it would work and I just have to buy another. Something else I will have to do before I have major surgery next month. sigh.",
      "rating": 2.0,
      "verified": true,
      "author": "gear head from the coast of maine",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Smaller but workable",
      "text": "As others have stated this bag is smaller than my other carry on but with some creative packing it was able to handle a 5 day trip. Casual clothes only not suits. I packed smaller items like socks and underwear between the support bars on the back freeing up space for larger items. I did not experience the falling over issue others reported even with my CPAP riding on top. All in all a good bag for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "JHM",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Is it missing the back inside????",
      "text": "I am not sure if this luggage is supposed to be like this or if they missed putting the backing into it? The zippered lining inside has no kind of support underneath, so its not flat, you can feel the two raised bars from the extended handle underneath? In the second pic I tried to show how you can literally grip the metal bars through the lining. I mean, for what I paid for it, I can make do I suppose, but I would like to know if anyone else has the same issue or if mine is missing something?",
      "rating": 2.0,
      "verified": true,
      "author": "Toni Lewis",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Worth it for quick travel",
      "text": "I like the colors. Its cute, lightweight and easy to roll around. I got it for a quick trip. Its about 19in. I was able to pack about 5 pairs of jeans, about 7 tops, 3 pairs of shoes, small bag of travel size toiletries....the small bag, us just enough to fit everything you may need to catch a flight or quick car ride. Good space. Down side: the small bag's clasp for the shoulder strap was broken. It was not useful. The suitcase scuffs easily and the tread is starting to pull. Besides that....it was a good purchase for what I needed. Hope this helps.",
      "rating": 4.0,
      "verified": true,
      "author": "Cecily Clark",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Donating this",
      "text": "The zipper on my tote bag came off and it won’t close so it’s useless. The suitcase is unbalanced and doesn’t stand on its own when packed a certain way (I should’ve listened to the reviews before purchasing). I used this set once and I’m one and done. It doesn’t fit my travel needs but I’m going to look into donating it to a foster child who can use it to keep their belongings safe and together (I read online that group homes really need suitcase donations).",
      "rating": 1.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Worked great as check in luggage",
      "text": "Bought this for a 2 week trip. Fits in overhead compartment as carryon and lightweight with lots of interior room. Straps inside let you compress things to fit things pretty neatly. Also had it as check in luggage and made the journey from plane and baggage claim fine. Nothing broken or bent or torn. The bonus bag was good to use as a personal item as it could fit snacks, extra clothing layer, wallet, passports, water bottle, and meds you might need on the plane. For me it was a good value for its first use for overseas travel.",
      "rating": 5.0,
      "verified": true,
      "author": "Team c",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Where are the measurements",
      "text": "Could not find how to contact seller The large bag appears adequate--just took it out of the box--it has not been tested My concern is with the smaller bag. The picture appears to make the bag look larger and more like a small piece of luggage not a tote. I was unable to find the dimensions on the website. I am seriously considering return this set--I alread have a number of small totes that I don't use--it is useless. Please use proper pictures and measurements for the small item.",
      "rating": 2.0,
      "verified": true,
      "author": "Tri",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Good for price",
      "text": "Perfect cheap carry on option when you’re in a pinch! These came as a set and it was perfect because you’re allowed a carry on and another bag on the plane. So we had something for our iPads/things we needed at our seat. It’s not the best quality and the wheels only go back and forth instead of 360 but the overall quality I was more than I was hoping for for that price. Would recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Katie Rossi",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Great set for packing light",
      "text": "Held up from Florida to Toronto and back, as well as a bit of walking in Toronto on the sidewalks and train station, so I feel like I put it through its paces and didn't have any seams rip or wheels fall off. One star off for the lining of the big case, and how much room the collapsible handles take up in the main storage. Easily fits in overhead and below seat.",
      "rating": 4.0,
      "verified": true,
      "author": "Aly L.",
      "helpful_votes": 2,
      "publication_date": 20180724
    },
    {
      "title": "Will not stand upright when loaded.",
      "text": "Purchased this for overnight quick trips. Initially I felt it would be a good purchase!, but after packing moderately I found out why it was reasonably priced. While digging my wallet out for my I.D. I let go of the suitcase handle and it fell over. The 'legs' are mounted near the middle of the suitcase, not closer to the opposite side of the wheels. This makes it unstable with anything but a VERY light load. When stopping you must lean it against something or it will fall over. Poor design. I should have paid closer attention before I used it or I would have sent it back.",
      "rating": 2.0,
      "verified": true,
      "author": "flycaster",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Not sure yet",
      "text": "I just received this set today. I’m not sure how it will hold up, though. The outer material may be durable, but the inner linings are extremely thin and cheap. I don’t expect them to last past the first use. Not sure about the plastic handle and wheels. If I didn’t need it this weekend, I probably would send it back. I will update if by chance my first impressions are wrong.",
      "rating": 3.0,
      "verified": true,
      "author": "LC",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Not a quality purchase :(",
      "text": "I bought this set as an emergency go bag for our pets. I wanted to love it but I don't. It was cheap and you get what you pay for. So far the larger case is ok. The smaller carry on....is trash! It is still usable because of the attachable large strap that comes with it but the front handle broke off almost immediately. Even though I'm not 100% satisfied it is still usable. Just be aware that this set is NOT a quality purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Laquita Parks-Lewis",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Not bad for the price, should last a couple uses...",
      "text": "Package arrived kind of squished, but fortunately the luggage wasn't damaged. Overall, I was pleasantly surprised with the quality for the price I paid... Especially after seeing the prices at Belk & JC Penney... I wish they were a little larger, they were smaller than I had hoped for. They will definitely work for carry-on luggage, they are both smaller than a name brand \"carry-on\" luggage. But they will work for my son to carry clothes around with him on the weekends, etc.",
      "rating": 4.0,
      "verified": true,
      "author": "JSFoster75",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Overnight Stay set",
      "text": "I like to use this set for being on call at the hospital overnight. It’s the perfect size for all the essentials tomorrow. All hygiene and beauty products and a towel for me. It’s also super cute. I actually do not roll it at all so I am not sure how it rolls. I do know the wheels are not 360. They would roll in a straight line. What I do not like is if I do not lean the bag against something it topples over. Away from the handle side. It doesn’t matter what’s in there. It always falls over. Other than that. It’s a great little set for an overnight stay.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley C",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Great for the price",
      "text": "For the low price, you can't beat it. We keep making jokes that the luggage will disintegrate the moment we get on the plane, leaving behind just a pile of dust and my clothing. But in reality, I think it will be fine. I don't fly often, so cheap luggage is fine for me. I don't need anything too rugged. The lock set is kind of pointless though, I can bend the metal of the thin, little keys with my fingers.",
      "rating": 4.0,
      "verified": true,
      "author": "JoShmo",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Perfect Carry on Luggage Set",
      "text": "Bought this luggage set with some doubt after reading some negative reviews but now I'm so glad I did. I have taken two round trip -trips via American Airlines since I bought. 1. It passes easily as a carry on (both pieces) 2. Stylish and easy to handle. 3. Held up brilliantly to a lot of (hours) dragging through the DFW and Denver airports. Highly recommend. Awesome deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Missy",
      "helpful_votes": 5,
      "publication_date": 20170321
    },
    {
      "title": "smaller carryon",
      "text": "I bought this set for my 4yr old granddaughter. The price was similar to children's suitcases, but had the extra bag. Its very nice just like a larger carry-on with a small upper exterior zipper pocket and larger lower exterior pocket. Inside it has a mesh zipper pocket in the lid. This should last her for years! I liked all the color and pattern choices too.",
      "rating": 5.0,
      "verified": true,
      "author": "gardener",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great quality for the price",
      "text": "Great quality. I purchased two sets and have taken them on a few flights now. Still look new. The only complaint I have is that once the suitcase is fully loaded, it can be a bit front heavy and is prone to fall over. I always make sure to set it down with the front against something if possible. If you don't need the second smaller bag, I recommend this carry on suitcase instead: I also own that one. Because it is a spinner, it stands up on it's own without any issues. A spinner is also easier to pull around the airport.",
      "rating": 5.0,
      "verified": true,
      "author": "SM3",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Way to Hard To Get Ahold of The Rockland Company",
      "text": "I was looking for something inexpensive and something I could receive fast through the mail. I was coming home from a trip and I had more items than when I had left my home. I received the product two days later, I was very excited but I noticed there was a small tear in smaller carry-on. I contacted the company, they got right back to me but the problem is they wanted documentation that I just really wasn’t willing to give. Way too much documentation for a tiny little rip. So I just glued the suitcase back together and now I am good to go other than that it was a good product and I’m glad I received it",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia A Stiles",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Best Purchase of my Adult Life",
      "text": "I bought this after I took a trip to visit my best friend this summer and found myself lugging a duffle bag through several airports. After that trip, I vowed that I wouldn't do that again and the next time I flew, I was going to have a rolling suitcase. When this first arrived, I was a bit surprised, it was smaller than I expected but I've used it on three different trips so far and have found that it works fantastically. It fit in the overhead bin on my flight and was easy to maneuver around a busy airport. Fantastic suitcase and easily one of the best investments I've done as an adult.",
      "rating": 5.0,
      "verified": true,
      "author": "GirlinPink44",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Great Set, Tips Easily",
      "text": "I love this set, except it does tip over VERY easily when the bag is placed atop the suitcase. It was the perfect size for a week in Vegas with many outfits, 2 formal dresses, and maybe 4 pairs of shoes (3 sandals/flats and 1 pair of heels). I used the bag for my toiletries, makeup, flat iron, snacks, phone charger and small purse (because you can only carry on a suitcase and a personal item). I loved the ease of knowing it was already regulation size for my flight. The wheels worked amazingly and the zippers were smooth. The additional inches option came in handy when I had to make room for my souvenirs.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Birthday present",
      "text": "I bought this as a birthday present for a granddaughter who's in a blended family. She travels between households frequently and this will help her do it efficiently. It's two nice pieces for the price and very cute without being covered in a cartoon character which would soon be outgrown. These pieces are appropriate for a child or even a teen. The suitcase is wheeled and as large as an adult's carry on bag. It also features an extra zipper that allows for some expansion. Very nice. I would use it myself except for it's being pink!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Super cute will topple over",
      "text": "It does not matter how much you put into the bigger luggage if you try to put the little one to sit on top of the bigger one it just topples over. Anyways for the price this was amazing as last minute travel luggage. Literally no one else had the cheetah print which I am obsessed with and made it easy to pull off or see if anyone was moving when they wanted to put their items in the overhead. Fit a ton more stuff then my usual luggage and the bigger one has wheels. Smaller one has adjustable strap for over the shoulder or a cross-body strap. Inside has straps to keep everything on one side or the other.",
      "rating": 5.0,
      "verified": true,
      "author": "Beba",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Great size, well made.",
      "text": "I have bought 3 of these. One for myself and one for both my kids. The size is perfect for a week long trip. One of my kids actually used it for a trip to France where the teacher asked all students to use a carry on so luggage wasn’t lost. We managed to get my kid packed in this little suitcase and also a backpack for a 10 day trip. Worked out perfectly. We’ve had one for a little over 3 years now and it’s still holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "Lil' Hellion",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great product.",
      "text": "Im extremely happy with this company and mostly the luggage. First it arrived one day shipping as stated when i ordered. The luggage hold more than I expected. It's light weight and very well made. The smaller bag held all my personal items, straightner, cosmetics, and so much more. I'm extremely happy with this product and will be purchasing sets for my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Frances",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great buy!",
      "text": "This held up great for a week and a half trip to Japan. Lots of carrying it around. The only problem I had was at one point it was getting rather stuffed and you could see the seem starting to pull away. Rearranged the packing and it was fine. Had no issues with any part of it. Fit nicely in the overhead bins. Had no issues with the zippers or with handle to drag it along, or with the wheels. Great value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Check every detail upon delivery",
      "text": "I am giving this 3 stars because when I pull the handle up then want to put it back down one side is loose and goes down easily while the other side is very stiff and has to be almost shoved down as if it is stuck. The handle does not go down easily, I may have just gotten a defective one. Overall the luggage is very beautiful and will serve the purpose it is intended for. I had no time to exchange the defective one because I was traveling the next day after it was delivered.",
      "rating": 3.0,
      "verified": true,
      "author": "Nydia",
      "helpful_votes": 0,
      "publication_date": 20190619
    }
  ],
  "product_meta": {
    "title": "Rockland Fashion Softside Upright Luggage Set, Navy, 2-Piece (14/20)",
    "description": "Size:2-Piece Set (14/20)| Color:Navy| Product Packaging:Standard PackagingThis beautiful deluxe 2-piece expandable luggage set is manufactured with a patented heavy duty eva-molded hi-count fabric. This set is perfect for the serious and experienced traveler. Manufactured with the very best heavy duty polyester and pvc backing, this luggage set is designed for the traveler on the go and comes with three expandable uprights and a flight tote bag. It comes packed with features including: an inside retractable handle, ez-roll in-line skate wheels, back zippered secured pockets, top and side comfort grip handle, stability bars at the bottom to avoid tilting, and locks and keys. Upright features include: clear in-line skate wheel system for smooth ride, push-button self-locking internally stored retractable handle system, ergonomic and comfortable padded top and side grip handles, two front full size zipper-secured pockets, and three internal organizational pockets for all your traveling needs. Each upright's interior is fully lined with a durable and elegantly imprinted lining and elegant silver pewter heavy duty industrial hardware. Carry-on flight tote bag features include: elegantly imprinted full interior lining, detachable and adjustable non-slip shoulder strap, spacious main compartment, and maximum strength industrial hardware. Carry-on upright: 21 inches high x 13 inches wide x 7.5 inches expandable to 10 inches deep and weighs 6 pounds. Carry-on flight tote bag: 12 inches wide x 11 inches high x 5. 5 inches deep and weighs 1 pounds.",
    "rating": 4.4,
    "feature_bullets": [
      "Upright: 21\" x 13\" x 7.5\" (with wheels)",
      "Tote bag: 14\"x 11\"x 5.5\"",
      "Telescoping handle",
      "Ergonomic padded top and side grip handles",
      "Fully lined",
      "Inline skate wheels and stability bar",
      "Fabric Type: 100% Polyester"
    ],
    "specifications": {
      "Product Dimensions": "13.78 x 8.66 x 20.87 inches",
      "Item Weight": "7 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Fox Luggage",
      "ASIN": "B00CBT5C4C",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "F102-Navy",
      "Customer Reviews": "4.4 out of 5 stars17,084 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#375 in Clothing, Shoes & Jewelry",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Luggage",
      "Luggage Sets",
      "Clothing, Shoes & Jewelry",
      "Luggage & Travel Gear",
      "All Departments"
    ],
    "price": 38.99
  }
}