{
  "website_summaries": [
    {
      "verdict": "The Superlux HD-681 Evo headphones deliver pro-level audio quality for an entry-level price.",
      "pros": [
        "Excellent audio performance with rich, full bass and crisp highs",
        "Comfortable",
        "Detachable cable",
        "Ships with replacement earpads"
      ],
      "cons": [
        "Cable lacks inline remote",
        "Semi-open design means some sound leakage",
        "Somewhat cheap-feeling build"
      ],
      "aspects": {},
      "publication_date": 20180625,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "perfect for me",
      "text": "i am not an audiophile with the hearing of a bat. i just want to listen to youtube videos and music on my ipad. these are good head phones... circumaural so nice and commfy round your ears (I hate those you shove in your ears!). alternatives to choose between velour or faux leather ear cushions then 2 leads- a short one which is good for with a tablet and a long one for use with the TV and as they are removable they are replaceable if they break. then a gold jack plus a bag to put them all in. good enough for what i wanted - listening to music on my ipad and at a very reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Broke after 3 months",
      "text": "Great Value, great sound, (especially after a little tweak on the equaliser) unfortunately it broke after 3 months, and this was off the back of its predecessor which broke after a year. The cabling inside just seems really cheap and easily damaged. One ear stopped working.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason Shaun Van Belkum",
      "helpful_votes": 4,
      "publication_date": 20181226
    },
    {
      "title": "Would call these professional",
      "text": "Pros: Cheaper than others. Has a male end on the headphones. Has a studio jack adapter Is on ear. Though this could feel uncomfortable Has spare foam pads. Has two detachable cables. One longer than the other. Cons: Leaks sound out Leaks sound in Other reviews have said the item has broken. Though I've come up with the solution to use earphones for personal use and these ones for work as well as important things. And not to use it in bed as I could fall asleep. Also it doesn't have a mic. But then again I use it as a monitoring headphones. Update: still going good after 5 months.",
      "rating": 5.0,
      "verified": true,
      "author": "YillionTube",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Superlux HD681EVO",
      "text": "Excellent sound quality for the money. Build quality is not the best as it looks like it's made from cheap plastics, but at this price you can't complain. In terms of sound quality, performance and comfort, these headphones really shine and can be compared to headphones costing many times the price. Only had these a couple of days but have used extensively for a variety of music as well as gaming, and am very happy with the performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Phoenix",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Brilliant headphones",
      "text": "Open back headphones, very good for video games or audio that requires you to pinpoint sounds within a game if it's vital e.g. Rainbow Six Siege. Comfortable, only very minor thing I have against it is the lack of headband adjustment for smaller/larger head size, overall a 9/10 purchase and highly recommended for your satisfaction.",
      "rating": 5.0,
      "verified": true,
      "author": "ROBERT THOMSON",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "And i'm happy. The headphones themselves fit quite well",
      "text": "I'm no expert at bass/treble and whatever those guys above me post, i got this ones for the games. And i'm happy. The headphones themselves fit quite well, i did not feel any discomfort after a 3 hour gaming session. The sounds just knocked me cold. Played a shooter, a tank near me shot it's shell, i almost jumped. Not sure if it's the bass or low sounds, whatever, the explosions sound just insanely cool in these. The bending cable is a nice touch, usually they break the contact right at the connector, because of deformation. Won't happen as fast in these because of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Igor",
      "helpful_votes": 2,
      "publication_date": 20150402
    },
    {
      "title": "Superb sound",
      "text": "Superb sound. They punch well above there weight. One star dropped for average build quality. Preferred the faux leather ear pads.",
      "rating": 4.0,
      "verified": true,
      "author": "eddie666",
      "helpful_votes": 0,
      "publication_date": 20180513
    },
    {
      "title": "for the price these are great sounding cans",
      "text": "got these to replace AKG K550s which were too loose a fit, for the price these are great sounding cans, 2 sets of earpads, pleather and velvet, 2 detachable cords long & short, they get better after burn in period, fit is a bit tight but i keep them expanded on a block of wood they are easy to mod if necessary unlike expensive AKGs build is so so but sturdy but they sound great for the price",
      "rating": 5.0,
      "verified": true,
      "author": "harry oxborough",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Best headphones that I bought two",
      "text": "They are hands down perfect, do not let the price fool you.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Crap",
      "text": "Got as an xmas gift It worked for 4 weeks now only kne ear works",
      "rating": 1.0,
      "verified": true,
      "author": "Karen L",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "fault after 10 months",
      "text": "bulky headphones. Worked well for 9 months then audio stopped coming from one headphone.",
      "rating": 1.0,
      "verified": true,
      "author": "asdasd asdasdasd",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "fast delivery and excellent sound quality",
      "text": "The description was really accurate, safe packaging, fast delivery and excellent sound quality...perfect! I higly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Other than the slightly crap strap these are great and still get a 4 ...",
      "text": "The headstrap on mine broke after a year or two, fixed it with some old bag straps buy t taking the headphones apart. Other than the slightly crap strap these are great and still get a 4 outa 5. They are strong too. Dropped many times from about 2 feet up",
      "rating": 4.0,
      "verified": true,
      "author": "Dobby240",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Great sound, but will break on you. And you wont get a refund.",
      "text": "While I completely agree with the other reviewers stating the sound is fantastic, I just can not recommend these headphones. I have went through 3 pairs of them. On every pair the left ear failed. These will only last you maybe 4 months, after that it will be time for a new pair. I have now just purchased a more premium set which far excel these in build quality, and I recommend you to do the same. Steer clear if you plan to use these long term, but go ahead if you only look for ~4 months of usage.",
      "rating": 1.0,
      "verified": true,
      "author": "Harry Brown",
      "helpful_votes": 0,
      "publication_date": 20201203
    }
  ],
  "product_meta": {
    "title": "Superlux HD681EVO Black Headphone",
    "description": "Superlux HD-681 Evo The HD-681 EVO is an improved HD-681 Superlux version of over-the-ear headphones. The bass remained unchanged, and the headphones produce a very deep and clear low tones. The high tones were improved, in the EVO version they are more balanced and much more in harmony with low and mid tones. Excellent Sound Quality The HD-681 EVO are a excellent quality product that will satisfy professionals working in studios, and on the stage, but their low price makes them easily affordable for amateur music enthusiast. They provide a crystal clear sound, which allows you to hear every note, even when listening on low voltage portable players. The coils are made of quality oxygen-free copper, which has a significant impact on sound quality.",
    "rating": 4.1,
    "feature_bullets": [
      "Solid, quality finish, Ergonomic shape, easily adjustable to any user's requirements",
      "Superb sound quality,Wire on one side only",
      "Frequency band: 10 - 30,000 Hz, Efficiency: 98 dB/mW",
      "Additional comfortable velor earpads, jack 3,5mm to 6,3mm adapter + 3m extender",
      "3 year warranty !"
    ],
    "specifications": {
      "Batteries": "1 Product Specific batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "24.1 x 24.1 x 12.7 cm; 276 Grams",
      "Date First Available": "19 Feb. 2014",
      "Manufacturer": "Superlux",
      "ASIN": "B00CAG1ZAQ",
      "Item model number": "HD681EVO",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Headphones, Earphones & Accessories",
      "Electronics & Photo",
      "Headphones & Earphones"
    ],
    "price": 42.84
  }
}