{
  "website_summaries": [
    {
      "verdict": "Has a nice price tag if you need a little more length (10 feet) in your USB 3.0 extension cable.",
      "pros": [
        "Despite its extra length, this cable will give you the extra data transfer speed you expect to find with the USB 3.0 standard",
        "High quality construction yields a cable that gives you long-lasting performance",
        "Easy to plug in and unplug"
      ],
      "cons": [
        "May not work well with multiple-port USB 3.0 hubs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Unreliable at best",
      "text": "Purchased this cable after returning an AmazonBasics 10' USB 3.0 extension cable. This cable seemed to work at first, and so I kept it, but it's only slightly better than the Amazon's. Anything connected to the cable -- be a simple flash drive, or a USB hub -- disconnects from time to time. Most of the time reconnecting the cable fixes the issue -- sometimes it doesn't. Big file transfers? Don't bet on it. Midway through a transfer (1GB or 60GB), 50% of the time the drive will disconnect. Lesson learned. There are no reliable 10' USB 3.0 extension cables. It's a USB 3.0 limitation. Best bet is an active/repeater cable for cable lengths longer than 6'.",
      "rating": 1.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 10,
      "publication_date": 20181105
    },
    {
      "title": "Super fast USB 3 transfer speeds",
      "text": "I saw some of the reviews about speed issues so I was a little nervous but after getting the cable, it was immediately recognized as USB 3 whereas my walmart cheapy topped out at 2.0 speeds even though it was \"supposed\" to be 3.0. This cable has had great transfer rates from the minute I plugged it in and I am getting over 100MB/s on my flash drive that was supposed to top out at 90.",
      "rating": 5.0,
      "verified": true,
      "author": "JimTop Contributor: Camping",
      "helpful_votes": 7,
      "publication_date": 20181006
    },
    {
      "title": "Works with Oculus Rift S",
      "text": "Tested with 3 weeks of playing and this cable works very solidly with Oculus Rift S as an extension. Your mileage may vary, because not everyone reports that those recommended DP and USB cables work. For me they both do work really well. I didn't even try another Rankie 6-feet one that's also recommended, as both 10-feet DP and USB cables work for me, allowing to move VR to another room (different from where the computer is) where there is plenty of space for room-scale VR.",
      "rating": 5.0,
      "verified": true,
      "author": "Roman Bershadsky",
      "helpful_votes": 13,
      "publication_date": 20190925
    },
    {
      "title": "Used for Oculus Rift CV1 Sensors",
      "text": "This cable was recommended on a VR website for expanding your Oculus Rift sensors - I purchased 2 cables and both worked perfectly. Quality is solid - Plug and Play - Happy Buyer! (note: If you bought new Rift S these extensions are not needed as the sensors are built into the headset)",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 13,
      "publication_date": 20190919
    },
    {
      "title": "Oculus rift a",
      "text": "While this product had been touted as a working option for extending the oculus rift s usb 3 connection I can tell you it’s not reliable. This did work.. but will cause you massive headaches. Audio transmission of mic was unusable. Extremely frequently the usb fails to transmit enough stable power to the goggles and the screens go to black. Fix is complete disconnect and shutdown of PC. Then power up, reconnect and it’ll work for a while again. Very frustrating: but a Weme 15’ powered usb extender. Works flawlessly. Mic is perfect, goggles don’t fail. Sorry. Don’t buy this cable and expect stability.",
      "rating": 1.0,
      "verified": true,
      "author": "PK",
      "helpful_votes": 3,
      "publication_date": 20200105
    },
    {
      "title": "Issues",
      "text": "I had originally bought this cable to use an an extender for my oculus rift. After several uses of it, my system started crashing. Blue screening. It had gotten to the point it was unrecoverable. and I had to format the drive and restart from scratch. Months later, \"Maybe it wasn't the extension\" I tried it again. Slowly but surely my system started become unstable. Steam refused to start, and other usb devices stopped working. I restarted my computer, but not before unplugging the extender. This worked. All my USB devices started to work again, Steam started up again no problem. So I may have a defective cord. or something in combination, just doesn't want to work correctly.",
      "rating": 1.0,
      "verified": true,
      "author": "Zack T",
      "helpful_votes": 3,
      "publication_date": 20181222
    },
    {
      "title": "Not Active, Not for the Oculus Rift according to Oculus Rep, Doesn't work well with its sensors.",
      "text": "Amazon recommends these with the Oculus Rift system however they are NOT active cables and they are not fast enough to properly operate the Oculus Rift sensors. I was having endless tracking issues with these cables and when listing these particular items to the Oculus rep they said they are NOT active and NOT recommended for the Rift as they cannot keep up with the tracking. Find something better and active. Pulling these out of the system eliminated the absolutely horrible and endless tracking issues I was having with Beat Saber immediately.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim S",
      "helpful_votes": 2,
      "publication_date": 20190214
    },
    {
      "title": "Didn't work for Samsung Odyssey+ (Plus), loud white noise",
      "text": "Just a PSA. I didn't take any stars off because I'm sure it's a fine cable, but it did not work with my O+ headset and my ASRock B75 Pro-3m motherboard's USB 3.0 ports. I know some people say it does and some say it doesn't. Maybe it depends on your ports, or maybe some of those folks are reviewing the 6ft version, which should work. At least one person told me personally that this cable works for their O+, but maybe it had changed since then, or maybe they just had really good luck with their mobo. I'm returning mine.",
      "rating": 5.0,
      "verified": true,
      "author": "Billkwando or KungFuKitty",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Works for Oculus Quest Link",
      "text": "I bought the 10 foot extension cable to use with the charging cable that came with my Oculus Quest along with a USB A to C adapter from Electop ( I get similar bandwidth with or without the extension cable and adapter. The whole setup works great with no noticeable lag. The cable is heavy duty and a little stiff but the extension stays on the ground so that works just fine. Highly recommended if you're looking for a Quest Link extension cable.",
      "rating": 5.0,
      "verified": true,
      "author": "KBieb",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Works Like A Charm",
      "text": "Can I transfer data to or from a device at USB 3.0 speeds? Yes! Can I charge an Android cell phone with it? Yes! Can I forget I left a thumb drive plugged in and try to boot my system from it? Yes! I use this USB cable extender to make access to my tower's rear panel easy from my desk surface instead of crawling under the desk. It works just like plugging anything directly into the back of the tower.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Williams",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Liking the extra length & performance",
      "text": "We used this to give additional length to a USB corded mouse that runs from the desk to our IMac tower. There was some concern that performance would suffer but have found no evidence of that and have been using the extension for over a month. The material appears nondescript and typical of almost any mass produced items these days but through consistent use it has performed perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "a.latch",
      "helpful_votes": 10,
      "publication_date": 20190903
    },
    {
      "title": "Works good with the Oculus Rift!",
      "text": "I bought this for my Oculus rift and it works great. I have it attached to my head set with an HDMI cable extender (also Amazon basics brand). I zip tied the cables together with zip ties ever 8 inches and I don't have an issue with tripping over it. Im going to buy another one of these when I get my third sensor next month.",
      "rating": 5.0,
      "verified": true,
      "author": "matt",
      "helpful_votes": 5,
      "publication_date": 20171227
    },
    {
      "title": "Perfect for Oculus Rift S",
      "text": "I decided to buy this USB cable extension when I do have some available already because it was certified to work with Oculus Rift S. It does. The USB port is a bit finicky and I had to move it from one slot on my computer to another one to get the proper connection but it turned out better than my old extenders. In conclusion: Worth the acquisition: 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "Henri Savin",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Good for connecting things to stuff.",
      "text": "As the title says - this works great for connecting stuff together. That was a tough expectation to live up to, but this did it extremely well. Almost as easy as plugging one thing into one end, then the other end into another thing... then BOOM! The things are connected!! This cable was the perfect solution to let me hook up a FLIRC IR receiver to my computer in another room. I just plugged it into this cable, velcroed it to the wall in my room, ran the cable through the wall to the computer and we were good to go!",
      "rating": 5.0,
      "verified": true,
      "author": "PTAaron",
      "helpful_votes": 6,
      "publication_date": 20160807
    },
    {
      "title": "Unfunctional for Rift S use after a few hours of Use.",
      "text": "I've ordered 2 of these and both stopped functioning correctly with my rift S after just a couple hours of gameplay, the cables both still work functionally as a MALE to FEMALE USB 3.0 cable but they just cant support Rift S tracking anymore for some reason. The odds of getting 2 crappy usb cables off the line back to back is probably astronomically low, but despite this I'll order a third one and update the review after (hopefully) a day or two of gameplay.",
      "rating": 1.0,
      "verified": true,
      "author": "nick",
      "helpful_votes": 2,
      "publication_date": 20200127
    },
    {
      "title": "Good build quality, good price, solves the problem of an awkwardly located USB port.",
      "text": "I keep my music library on a USB drive plugged into a network streamer. The plug is on the back of the streamer, and accessing it requires pulling the streamer out of the audio rack. I have to do this frequently, which is a minor nuisance. So I purchased this male-to-female USB extension cable in the 3-foot length. It is permanently plugged into the back of the streaming box and it is now easy to plug in and remove the USB drive. The price was right and the build quality is good. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Social science professor",
      "helpful_votes": 2,
      "publication_date": 20180630
    },
    {
      "title": "Does NOT Do 3.0 Connectivity BEWARE",
      "text": "Not a 3.0 cable. Will not run my 3.0 Elgato capture card. If I plug my card in direct it works. If I plug it into extension it says “need to connect to 3.0 USB port.” Improper description. False advertisement. If you need to run a 3.0 item with this extension, DO NOT BUY! Does not work as advertised. Was very upset cause now I need 2 12’ long HDMI cords for my el gato card instead of one 3.0 capable extension... smh.",
      "rating": 1.0,
      "verified": true,
      "author": "PrincessJenycide",
      "helpful_votes": 4,
      "publication_date": 20190518
    },
    {
      "title": "They do work but sadly you will get frequent warnings about poor tracking. I still have them on my Rift ...",
      "text": "I bought these cables specifically to extend my Oculus Rift sensors which requires USB 3.0 slots and cables. They do work but sadly you will get frequent warnings about poor tracking. I still have them on my Rift because I can get past a few errors but can be rather annoying at times. Have not noticed any drop in responsiveness on the Rift other than it not liking them. This may not apply to your application but they seem to be good cables.",
      "rating": 4.0,
      "verified": true,
      "author": "Kris Camaro",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Works most of the time for VR. Not always.",
      "text": "Samsung Oddssey+ Works fine for 30-120minutes then unfortunately I get the audio static issue randomly sometimes, research has shown me this is due to voltage issues that become exacerbated with extensions. Your mileage may vary Solution: Accell USB-C VR adapter. (ONLY WORKS WITH RTX 20 SERIES GPUs THAT HAVE A VIRTUALINK USB-C PORT)",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Coulter",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "doesnt work for rift s",
      "text": "specifically bought it because it claims to work with oculus rift and the extra length would make for a more enjoyable experience, however when the headset is plugged in with this extension it shows 3 loading bars indefinitely. as soon as its unplugged and used without it, it boots up and loads instantly. i wanted to like this but i cant give higher than a 2 star review if it doesn't for for the intended purpose.",
      "rating": 2.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "neglects to inform that all usb ports are underpowered and ...",
      "text": "neglects to inform that all usb ports are underpowered and this extra length reduces the signal strength to the degree that the camera/computer connection will not be recognized. does work with CamRanger, but that probably won't provide much, if any, practical advantage. that said, as a cable only, all other things aside, this product is sufficiently satisfactory.",
      "rating": 4.0,
      "verified": true,
      "author": "Dr. Uterus Turnbull",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "USB 3.0 Type A Male to Female extension cable",
      "text": "The Cable Matters SuperSpeed USB 3.0 Type A Male to Female Extension Cable in Black 6 Feet arrived in two days as expected, in a yellow mailer envelope, and in good condition. Works as advertised. I had to buy this because the Anker 4-Port USB 3.0 Ultra-Slim portable Data Hub came with a less than one foot USB cable for connecting to the computer. I should have figured the data hub cable was not 2 feet, but lesson learned on that. This cable is well built, and works well. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam-Wise",
      "helpful_votes": 3,
      "publication_date": 20170619
    },
    {
      "title": "Doesn't pass enough current for some USB flash drives",
      "text": "While it might be able to move data at high speed this cable doesn't seem to be able to deliver enough current to power many USB flash drives and small portable external hard-disks. The cable simply doesn't have large enough conductors and the voltage drop is large enough (under load) to prevent these devices from working. I've had to move to short extensions off a powered USB 3.0 hub in my monitor instead of using this cable coming from the back of the machine. Disappointed but at least it wasn't that expensive.",
      "rating": 2.0,
      "verified": true,
      "author": "PNWGuy",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "3 Ft Thick Cable Brings USB Connection Closer",
      "text": "My desktop sits on a shelf above my desk. I am using this cable to extend the accessibility of the USB connections on the face of the computer closer to the surface of the desk. I am often using the USB outlets to connect other devices. Reaching up and finding room for the devices on the top shelf was awkward. Now I can keep the devices on my desk, reach over for the cable and connect. The cord is thick and durable. It definitely helps transfer data faster than the normal USB.",
      "rating": 5.0,
      "verified": true,
      "author": "ThoseBesideUsTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Great USB Extension",
      "text": "Used this product to extend usb cable of computer cooling fans. The fans are being used in a car audio application for cooling an amplifier. Had to get the usb from the trunk to the front of the vehicle to access the 12v accessory plug. Worked perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince",
      "helpful_votes": 0,
      "publication_date": 20200616
    },
    {
      "title": "Works perfectly",
      "text": "I bought this and an HDMI ( extension cable to use with my Oculus Rift headset. It is difficult for me to move my desk out and connect the VR headset to the HDMI and USB 3.0 ports on the back of my computer, and these extensions worked fine. No problems having my computer recognize it when plugged in. Now I have the two extension cables permanently plugged into ports in the rear of my computer, and the cables draped over the top and through this cable holder ( Much better connection than I had in the past! Very happy with everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Young",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Works well in my particular application.",
      "text": "I used it to elevate the mouse/keyboard dongle for my mini puck windows computer that is hooked up to the TV. It extended the range of the mouse/keyboard so it is reliable at 10-15 ft. I am very happy that I have a reliable mouse/keyboard now. I never used it to charge anything. So I wouldn’t know.",
      "rating": 5.0,
      "verified": true,
      "author": "beebop",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great build quality and works with Oculus Rift",
      "text": "In person these cables look like much better quality than I was expecting as it is hard to tell in the photos. They are very robust. I purchased 3 of these at 6 foot length to help extend my Oculus Rift's 2 sensors and headset. 6 foot is the maximum extension length Oculus recommends. These USB cables are actually slightly thicker than the Rift's cables. The length extension has totally changed the VR experience! Compared to what you get at retail stores these are 10x better at a fraction of the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "The range is great but in my area in my office there are ...",
      "text": "THICK wire so you can tell it is certified for high energy usage for other components that need it other than your typical phone or mouse or xbox controller. This works for my Bose speaker system too. The reason I got this was because I have the Microsoft Arc mouse which is wireless. The range is great but in my area in my office there are a few dozen things using Bluetooth so sometimes it acts like the batteries are dying. I used this cord to plug from back of PC to route real real close to my mouse. It is well hidden and brought the receiver up and center so there is ZERO interference. NO LAG either :D",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Lyon",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "If you've got an Oculus Rift and are looking for ...",
      "text": "If you've got an Oculus Rift and are looking for an extension cable for either the sensor, or the headset, these cables will work. Not much else to say, they are extension cables!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 4,
      "publication_date": 20161121
    },
    {
      "title": "Super fast Cable!",
      "text": "I bought this to plug into my desktop at work. All the USB 3.0 ports are on the rear of my desk top and that makes it a hassle when I do my monthly back-ups on a portable hard drive. I have two standard USB ports on the front but they are so slow. I plugged this cable into one of the USB 3.0 ports on the back and ran the plug to the front just for my back-ups. I can simply say, what a difference in speed when using the USB 3.0 ports.",
      "rating": 5.0,
      "verified": true,
      "author": "Arnold Barlow",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Works for Windows Mixed Reality Headset (Odyssey+)",
      "text": "I bought this to extend the room space for my Samsung Odyssey+, and it seems to work perfectly so far hitting 90 FPS. No static audio, no flickering video; it works just as well as using only the original cable. This cable is about as thick and heavy as the original combined USB/HDMI cable attached to the Odyssey+. Using an ancient system (i5-2500k & RX 570 4GB).",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Whitehouse",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "These cables work great. I am moving my computer to the top ...",
      "text": "These cables work great. I am moving my computer to the top of the hutch attached to my desk and needed some extra length on all of my cables. I decided to place a USB 3.0 hub on my desktop so that it was easier to reach, and to do that I needed this extension. I ordered this one since it gave me more length than the standard ones that I already have laying around and also because it supports USB 3.0. Both ends fit nice and firmly into their respective plugs and I have had no problems with them what so ever. Highly recommend these cables if you are needing some.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20160720
    },
    {
      "title": "Oculus Rift",
      "text": "Purchased 2 10 feet cables for the Oculus Rift room scale sensors. Both cables start as green in the Oculus app (in Devices) but both will switch to orange on and off at random times. Under normal use this is not a problem. When playing beat saber on expert or expert plus it would result in losing track of the controller during the faster parts of the song. After I replaced the cables all sensors are rock solid green and I can finally play the advanced versions. Shorter cables might work better but this was advertised specifically for the Rift.",
      "rating": 3.0,
      "verified": true,
      "author": "Joseph C. Garner",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "NOT for an Oddessy Plus",
      "text": "Used to extend the cables for my Samsung Oddessy plus. Didn't not work. Audio and control glitches galore. HDMI was also extended, and at first I thought it was the HDMI, bit after unplugging this extension cable, everything worked fine again. If you are using this for an Oddessy plus, save your money and buy a powered extension cable.",
      "rating": 2.0,
      "verified": true,
      "author": "Dominatus",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Works well for VR EXTENSION.",
      "text": "Bought as an extension cable for VR headset. Works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Ryan",
      "helpful_votes": 11,
      "publication_date": 20191004
    },
    {
      "title": "These USB extension cables are time and frustration savers.",
      "text": "Instead of frequently reaching around to the back of a computer or monitor to plug in a USB flash drive, I attach one of these extenders and plug a flash drive into it. I own a few of these cables, either 3-feet and 10-feet, to attach flash drives to a laptop, a desktop, a television, a computer monitor, or a Roku. These cables are extreme time and frustration savers. I choose blue cables so that these can be easily seen and distinguished from other cables that might be in use.",
      "rating": 5.0,
      "verified": true,
      "author": "Deebz",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "If You Want for Fast Charging or Tablets, Don't Buy",
      "text": "I bought to use with my 10' cables when I cruise, because the cabins have very few electrical sockets, and they aren't near where I like to sit on the bed with my tablet. However, I get a message that I am not getting enough power, and the tablet continues to drop power. It isn't just the ship--it happens everywhere. I can use it with my phone, but I don't get a fast charge. I think the great price is due to an inventory reduction of outdated cables. They are great quality, though!",
      "rating": 3.0,
      "verified": true,
      "author": "NanaB",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Highly Recommended",
      "text": "The length is perfect if you have a desktop computer connected to your TV and you're trying to play split screen Rocket League with your older brother using two USB gaming controllers that need a little more cord length so that you can leisurely rest on your futon while showing the world that you can play soccer with rocket powered cars. Its a great cable.",
      "rating": 5.0,
      "verified": true,
      "author": "RyanTop Contributor: Soccer",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "Nice long high quality cable",
      "text": "Nice long high quality cable! I bought it for the Oculus Rift and it worked well. Though the Oculus software showed it was USB 2.0 even though it was plugged into a 3.1 port. However, I had no tracking issues so this cable worked well. I had to return the Oculus Rift since it was uncomfortable with my wide glasses. Yet I kept this cable since its a very nice cable that I can use for other devices.",
      "rating": 4.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "Perfect for Extending USB Connection",
      "text": "Exactly what I needed. The charging cord for my Fitbit tracker is only about 9 inches long which made it a pain to connect to a USB charger that plugs into the wall. My first thought about this extension is that six feet is way more than I need. In fact, the long cord turns out to be very handy and I use it now for charging other devices as needed. The cord is thick, as you would expect it to be to reduce resistance. It functions extremely well.",
      "rating": 5.0,
      "verified": true,
      "author": "John W2000",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Works great with Oculus Rift sensors",
      "text": "These are great cables that didn't have any issues with my Oculus Rift sensors. I used these for 2 of my sensors and it gave me enough length to mount them on the ceiling. No complaints! Just make sure your computer has enough power for the 3.0 sensors, otherwise you'll need to get a powered USB hub or buy a USB 3.0 card.",
      "rating": 5.0,
      "verified": true,
      "author": "Yhea",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "but that causes some driver initialization issues causing Windows 10 to boot SUPER slow (like a minute even with my SSD) which .",
      "text": "Bout this to connect my monitor USB ports to my computer. I used to use an older USB 1.0 extension, but that causes some driver initialization issues causing Windows 10 to boot SUPER slow (like a minute even with my SSD) which this 3.0 extension fixed right up. Connection is solid and the length is right for me.",
      "rating": 5.0,
      "verified": true,
      "author": "gtothew",
      "helpful_votes": 0,
      "publication_date": 20170401
    },
    {
      "title": "Does not work!",
      "text": "I bought two of these and the connection keep dropping out. I've tried both on multiple devices with the same results. Can't keep my internet connected using this, can't keep my cell phone connect to the desktop with this. What is this meant for if not these applications?? Without using these extension cables the connections stay connected.",
      "rating": 1.0,
      "verified": true,
      "author": "Lawrence",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Works for a mouse,  but I cannot get other usb devices to work.",
      "text": "Works pretty good, but I can't get any external hard drive to work over the distance (externals I tried all have their own power supply), even with a powered hub at both ends, I can get a mouse to work though. I have tried other cables with zero luck, so this is the best one yet, at least something can work on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Windozesuk",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Not Working with Oculus Rift S",
      "text": "This cable is recommended for the Oculus Rift and other VR headsets but not specifically for the Rift S. Did not work with my Rift S. I tested the Display Port extension and USB extension separately to identify the problem. This cable caused snow in the display, static in the sound and the controllers to point to the ground or loss of tracking almost constantly. The cable may be good for the other products listed (I didn't test any further). I don't fault the manufacturer since it did not list the Rift S on this products page. This review is more of a warning for other people trying to find the correct combo to extend their Rift S.",
      "rating": 3.0,
      "verified": true,
      "author": "George Shepherd",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Good quality",
      "text": "Using this to replace Roku power cable, a lot thicker then cable I replaced on the original Roku power cable that runs from plug in adapter to Roku device that plugs into the television.",
      "rating": 5.0,
      "verified": true,
      "author": "Harvey Lee",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Well made cable, tight fittings at each end.",
      "text": "Handy item, perfect length to leave hanging from my computer. I was getting tired of trying to find the USB hole in the back of my computer, so I now leave this hooked up and it's right there to connect all my peripherals whenever I need them. This is a quality, well made cable, with nice, tight fittings on both ends. I like the blue color as I can easily spot it to hook up to it (vs. the bah-zillion black cables I have coming out of the back of my computer). Would buy this item again.",
      "rating": 5.0,
      "verified": true,
      "author": "LunaSea",
      "helpful_votes": 2,
      "publication_date": 20150411
    },
    {
      "title": "These are Rift CV, sensor and headset compatible. ...",
      "text": "These are Rift CV, sensor and headset compatible. I bought two but can only use one with a 6 foot Cable Matters 2-Pack High Speed HDMI Extension Cable for the headset. The two front 3.0 sensors must be 6 feet from each other and the extra third sensor you buy comes with a extension cable. So I would buy one of these for the headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 2,
      "publication_date": 20170415
    },
    {
      "title": "Valve Index Concerns",
      "text": "I initially had no problems using this cable with the Valve Index, however after some time, I began noticing little glittering pixels. I've seen them referred to as \"snowy\" pixels and other things but once I removed this extension cable, these snowy pixels stopped happening. I don't know if the cable, normal wear, or Valve specs are the culprit so I left my rating high, but I thought I'd share my experience.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Works for Oculus Rift CV1",
      "text": "If you're having trouble with your Oculus sensors connecting, it's probably not a problem with the cable. Keep in mind when plugging in your sensors that your USB ports can only handle a certain load. If you distribute your load correctly, these work great! I recommend an internal USB adapter. It will help with your other USB devices not affecting your sensors.",
      "rating": 4.0,
      "verified": true,
      "author": "Hunter Diver",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Does NOT Work For Steam's Valve Index VR Headset",
      "text": "I saw this worked for Oculus Rift so decided to give it a try, this is NOT a USB 3.0 cable. I tried it with my 3.0 PC keyboard, mouse, and of course my VR headset by Valve Index. This cable was not 3.0 compatible. I would not recommend this to any VR owners.",
      "rating": 2.0,
      "verified": true,
      "author": "Jarminx",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "This USB stopped working shortly for Oculus",
      "text": "You have to buy active extensions for Oculus sensors. In addition, this extension is too long for signal to effectively reach the computer or power anything. This product was designed with poor specifications to that end. As I can't use it for anything else either, I've wasted my money with this.",
      "rating": 2.0,
      "verified": true,
      "author": "Auryn Vrvilo",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Very good quality; appears heavily shielded.",
      "text": "Best initial quality USB cable I have purchased; its obviously high-quality cable and branded by them (not a no-name). Gold plating is a bit marginal (don't care), 0.215\" OD cable, somewhat stuff. But I use these are radio transmitter sites where the RF fields are high - we will see how this works. Each cable as a serial number as well....so the appears to be tracking the quality on these.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "It’s a nice way to charge and play my PlayStation 4’s controller",
      "text": "I love playing PlayStation 4 but the problem is the charging cord of the controller is too short to sit far away from the TV. So I’m using this to lengthen the controller where I can use it across the room while charging my controller at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "A great way to reduce wear on USB plugs",
      "text": "I have a USB device that was always on and cannot configure the USB ports on the PC to power off the ports on a shut down. Unplugging the device was adding too much wear to the USB port and/or the device USB connector. This intermediate cable works perfectly and I can unplug the device without trying to reach the back of the PC.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Cumpian",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Good for wireless chargers",
      "text": "I recently bought wireless chargers for my new XR. The cable it came with was rather short for where I wanted the device located. I had been using an old USB 1.0 extension but the charging time was greatly extended due to the older cable. I picked this up as a quick fix and the charging time has been greatly reduced. Cable is thick and seems well made. Would purchase again",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony M",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Doesn't send 1.3A or 12v through the cable",
      "text": "I've tested this cable as soon as it was out of the package and bought it as a was to extend reach of two pc fans. So far everytime I connect even one fan to the extension cable it will not operate as it should. Power the fan acts as if power is being sent in burst rather than a constant stream. I have tested the fans both on a working USB port and they both work wonderfully, now I have them running off a USB splitter on the same USB port and they still work. Overall disappointed and amazed how someone could make a extension cord like this.",
      "rating": 2.0,
      "verified": true,
      "author": "mark p.",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Perfect!",
      "text": "With my computer setup, my keyboard cable couldn't reach the computer. Now thanks to this USB extension it does. I don't need the 3.0 speed for my uses, but its nice if you need that. It fully works with USB 2.0 as well. The USB connection is secure enough that it won't fall out and will still hold with pets messing with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Woundheir",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Worth It",
      "text": "Needed a simple USB Extender to get from my Mac Mini, which is in my audio rack to my desktop. Worked so well I bought a second one for a USB hub. Solely using this for license key, mouse and keyboard type items. Zero complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Compatible with Rift",
      "text": "I'm using 2 of these cables (one on the sensor and one on the headset). They're compatible with Oculus Rift and detected as USB 3.0, as long as you use the right (compatible) USB controller like Intel USB 3.0 ports and the right port (yea, the Rift is picky). Don't plug it in Asmedia USB3 ports cause you will get static noise or no audio with this cable.",
      "rating": 5.0,
      "verified": true,
      "author": "Teiji",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Great Product and Great Company also!",
      "text": "I purchased 2 of these (10ft) and like other reviews, they are great quality. However I received 1 6ft cable and 1 10ft cable. I reached out to the company \"Cable Matters\" and they offered to send me another 10ft Cable. No charge, returns, or exchange necessary! Great customer service, will be recommending to others and use them from now on for future purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "3.0",
      "text": "I really liked the fact that you can connect this to 3.0 USB. My old USD cable won't do it.",
      "rating": 5.0,
      "verified": true,
      "author": "concernedcatholic",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Good quality 3.0 cable that works",
      "text": "The 3.0 USB shipped out and arrived on time. I needed a good USB cable for a high speed connection. It looks well made and good quality. This cable is working as it should. No dropped signal or signal strength.",
      "rating": 5.0,
      "verified": true,
      "author": "LLP",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Works well as one half of a VR headset extension ...",
      "text": "Works well as one half of a VR headset extension cable when coupled with an HDMI extension cable. Gives my Samsung Odyssey WMR much more freedom for room scaled VR. 10/10 would extend again.",
      "rating": 5.0,
      "verified": true,
      "author": "Meddling Mathematician",
      "helpful_votes": 3,
      "publication_date": 20180115
    },
    {
      "title": "Works perfectly as extension cable for Virtual Reality WMR",
      "text": "I use it as a VR Extension Cable for my Windows Mixed Reality Lenovo Explorer, to extend the play field. Works perfectly, no loss of signal. I think 10 ft is the max you should go, though. I use it in a combination with the, since the WMR needs both a HDMI and USB 3.0.",
      "rating": 5.0,
      "verified": true,
      "author": "Ran Zhao",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "A good cable.",
      "text": "Got this cable to reach my 3rd oculus sensor across my room. So far the cable does what it’s suppose to do. It does have problems using it with my laptop though. But could be due to too much resources and not the cable itself.",
      "rating": 5.0,
      "verified": true,
      "author": "GPTM1",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Very Handy For USB Connections",
      "text": "These are just the ticket for accessing those USB ports in the back of the computer. These cables are also good for getting your printer cable to the other side of the desk where your computer is. They are also good for making USB Thumb drive connections. This prices is way less than Wal-Mart product where they are real proud of only the three foot cable.",
      "rating": 5.0,
      "verified": true,
      "author": "PJC",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Used a few times & it stopped working!",
      "text": "I used it a handful of times and then it stopped working!",
      "rating": 1.0,
      "verified": true,
      "author": "Love2shop",
      "helpful_votes": 4,
      "publication_date": 20171108
    },
    {
      "title": "Apparently there was no quality testing.",
      "text": "I got a defective cable, I tried using this one and all I was getting was constant signal loss to my VR headset. Switched to a different cable and my issues were resolved.",
      "rating": 1.0,
      "verified": true,
      "author": "Jensen",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "One came bent for me, the other two were fine.",
      "text": "Out of my three units I bought of this one of them had the metal on the female side bent over, not allowing another male usb to plug in. I bent it over best I could with plyers. It works now. Kinda disappointed in its quality because of this. Cable matters has been a one stop shop for me for many other things.",
      "rating": 3.0,
      "verified": true,
      "author": "J M",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "Bad Connection",
      "text": "I bought this and the DP extension cord like it. Neither of the products that were delivered to me connect properly. 1//18/20 Addition Cable Matters reached out to me to send me a 6ft version instead and so I accepted but unfortunately this cable has a bad connection as well. I am glad they are trying but their products are clearly not quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Kirby",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Customer Service alone is 10stars",
      "text": "Bought 2, got 1 defective (oculus rift sensor gave the 8602 error or would be detected as usb 2.0) Thinking it was the rift issue I kept the cable more than a month. After finally realizing the issue (sensor worked perfect when connected directly) I contacted cable matters and they immediately sent out a replacement for free. If that doesn't scream 5 star service I dont know what does.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Got this to extend Logitech c920",
      "text": "Durable, great quality cable. I got it to extend my Logitech c920 Webcam and it works perfectly. I wouldn't recommend you get any longer than 6 FEET for a webcam as it wouldn't have enough power to carry the signal. I haven't had the chance to test the speeds of the USB3.0, but I assume they are up to snuff. Oh, and it's not a bad price at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Dusty Kelly",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Cable works great",
      "text": "Using the cable to extend the usb port on my LG tv. The LG tv usb port is very weak and loose. I use this basically as an extension to plug in flash drives etc to not plug directly into the weak LG port. Works great. No lag or distortion.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "10 ft USB extender cable doesnt work on Oculus Rift S....",
      "text": "10 ft USB extender cable doesnt work on Oculus Rift S.... Update: the seller send me a 6feet usb extender cable without the need to return the 10 feet cable and it works , btw I found a solution to make the 10 feet cable work with oculus rifts , connect it to usb-c to usb 3.0 hubs 5/5",
      "rating": 5.0,
      "verified": true,
      "author": "Angelus",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Works for basic usb 3.0 devices, but will not allow full usb 3.0 speed. My BRIO 4K webcam will only go up to 1080p when inline.",
      "text": "Works fine as a plain extension cable for lower speed usb 3.0 devices and usb 2.0 devices, but doesn't work for the higher speed 3.0 devices. Purchased to extend the length of my BRIO 4K webcam. When plugged in using only its cable, it will shoot 4K. When plugged in with this cable in between it will only shoot up to 1080p.",
      "rating": 3.0,
      "verified": true,
      "author": "Joe Mike Terranella",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "great cable!",
      "text": "Use this for my powered USB 3.0 hub and no signal loss. Great cable!",
      "rating": 5.0,
      "verified": true,
      "author": "wolfboy001",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Works flawlessly for oculus rift!",
      "text": "I bought this to extend my oculus cable and it worked flawlessly with no tracking issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Corey",
      "helpful_votes": 0,
      "publication_date": 20200501
    },
    {
      "title": "Samsung Odyssey Plus Extension Usage",
      "text": "The cable appears to be of quality material, however I still had issues using both the 10Ft and 6FT extensions for my new Samsung Odyssey Plus VR headset. This was on a new x470 AORUS motherboard which has ports designed for VR. Maybe im just unlucky , seems to be successful for some people.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Shipped fast",
      "text": "Used this for my vr system to extend wires. Works great",
      "rating": 5.0,
      "verified": true,
      "author": "Larrywcc",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Works fine with what it suppose to do!",
      "text": "Works fine with what it suppose to do!!! But if you try hooking any with anything longer then this length cable of this cable....it will not recognize anything longer then what your hard drive cable comes with connected to this extension cable. And believe me i've tried it....with more then a couple of different cables. After a certain length it would just read it at a usb 2.0 speed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "They work. No reason to complain from me!",
      "text": "I haven't tested the 3.0 speed capability, but for my mouse and keyboard extension, these are working great. The blue is what I needed because I wanted the cables to be visible while I was messing around, so people didn't trip on them and yank my computer around. THese are working great and seem good quality. The cables have sufficient heft and seem to handle bends well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Does NOT work for VR",
      "text": "Despite what the description says, this does not work for extending your connections to VR headsets. I've tried a multitude of things, including using a powered USB hub, a 'Y-Cable' that has a separate connection for power, and all have resulted in the same issues. I wish I had known that this doesn't actually work, as I would have saved money to buy an ACTIVE USB 3.0 cable that repeats the signal.",
      "rating": 3.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Works as intended",
      "text": "I use these cables to utilize the USB ports on the back of my PC. Those ports are where I plug in my keyboard and mouse. The cables work perfectly, and I have no connectivity problems whatsoever.",
      "rating": 5.0,
      "verified": true,
      "author": "D.E.",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Dead just out of window.",
      "text": "Well I had the product just enough to be out of the return window. It no longer works. I used this to extend a USB and while it originally did work, not it will be recognized, but not transfer data properly. Tested with device directly and device works. Wasted money- save the money and buy good cable extensions.",
      "rating": 1.0,
      "verified": true,
      "author": "THE HUG DEALER",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "Works great!",
      "text": "Works great as an extension for my oculus rift headset.",
      "rating": 5.0,
      "verified": true,
      "author": "androidguy",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Works to extend my WMR Dell Visor VR headset",
      "text": "Using with my Windows Mixed Reality headset. This cable works just fine I haven't noticed any extra lag moving around when using the extra 6ft. Not sure about the audio since I'm running my audio separate from the headset (to eliminate the audio glitch)",
      "rating": 5.0,
      "verified": true,
      "author": "AMS",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "great for twitch streaming",
      "text": "No noticiable drop in video quality and no lag. I use for twitch streaming about 6 feet away from computer. This allows me to hook camera up and not have dangling wire everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Verified",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Great while it lasted",
      "text": "I bought this to keep from digging behind my computer. It worked great for 18 months. Then the connected drives started dropping. The drives worked fine when connected directly to the computer.",
      "rating": 3.0,
      "verified": true,
      "author": "OwlEyez",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great for VR Extension",
      "text": "Using with my Odyssey+ VR hmd. Works great no issues!",
      "rating": 5.0,
      "verified": true,
      "author": "Ishbu Shigugua",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "its a bit stiff but the wire gauge is needed to maintain voltage and speed",
      "text": "I have a desktop pc under my desk and have a need to connect some usb devices at desktop. This cable worked for me. I use a lenovo display with pen that attaches using displaylink and this cable works for that provided I also use the Y cable that came with it and provide additional power to the second usb cord. for normal low power devices it works fine as is.",
      "rating": 5.0,
      "verified": true,
      "author": "TX gadget nutTop Contributor: Smart Home",
      "helpful_votes": 0,
      "publication_date": 20170917
    },
    {
      "title": "Started shorting out.",
      "text": "I bought this cable in Jan 2019, and today is May 21, 2020. I was using it to place my wifi adapter in a more receptive area. When I got the cable I immediately hooked it up to my computer and haven't moved it since. Today the cable started shorting out (plug-in and unplug sound repeatedly) and I had to pull it from my computer. I've used Cable Matters in the past and haven't had issues with it so I'm bummed this is the first time.",
      "rating": 1.0,
      "verified": true,
      "author": "EIP",
      "helpful_votes": 0,
      "publication_date": 20200521
    },
    {
      "title": "DOESN'T CONNECT PORTABLE DEVICES !!!",
      "text": "DOESN'T CONNECT PORTABLE DEVICES TO PC AT ALL !!! Purchased cable so I wouldn't have to use a light and fiddle behind my old desktop. WRONG !!!!! The only thing this cable is any good for is charging a phone. And so far it is very SLOW at this. I Good quality. I wanted to return it but I waited too long. EXTREMELY DISSATISFIED WITH THIS PRODUCT !!!!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "John Laurin",
      "helpful_votes": 0,
      "publication_date": 20200609
    },
    {
      "title": "Originally received a used and disgusting looking cable but all is well now",
      "text": "Original: 1/5 I received a used cable when I had ordered a brand new cable. I received a used, smelly, and disgusting looking cable. Update: 5/5 Amazon provided me a replacement but having the hassle to return should make a 4/5. However, the fault does not lay on Cables Matters tried to contact me to offer a replacement, but Amazon was able to provide me a replacement.",
      "rating": 5.0,
      "verified": true,
      "author": "Phil",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Durable, effective, and low price!",
      "text": "Really seems to work great and get the job done. Seems super durable and I have no worries about it breaking or fraying. No apparent loss of power/signal over the distance either. Highly recommend as a high-quality cheap cable!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Works great!",
      "text": "I use this to extend the USB cord of my Pimax VR headset and it does that job just fine. The nature of VR means this cable is regularly getting moved and around and sometimes stepped on and I haven't have any kind of issues with it yet, works exactly as you'd expect.",
      "rating": 5.0,
      "verified": true,
      "author": "GingaskunkTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Too stiff; hard to keep items connected in place",
      "text": "Too stiff, I Need something more flexible. The only plus is the bright blue is easy to identify in a bin of lots of black and white cables Reliable though.",
      "rating": 1.0,
      "verified": true,
      "author": "Frequent Buyer",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Does not support Oculus Rift S",
      "text": "The USB 3 does not work with Oculus Rift S as an extension",
      "rating": 1.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "My go-to USB extension cable",
      "text": "These are the best extension cables. They are perfect quality and durable. I have bought many of these. I prefer the flexibility of these compare to buying a long cord of the specific type of connector I need.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin B.",
      "helpful_votes": 0,
      "publication_date": 20181204
    }
  ],
  "product_meta": {
    "title": "Cable Matters Long USB to USB Extension Cable (USB 3.0 Extension Cable) in Black 10 ft for Oculus Rift, HTC Vive, Playstation VR Headset and More",
    "rating": 4.7,
    "feature_bullets": [
      "High performance USB extension cord extends the connection between a computer or Windows tablet and both USB 3.0 and USB 2.0 peripherals including VR headsets HMD, hard drives, USB hubs, mice, keyboards, flash drives, printers, and more",
      "Upgrade to SuperSpeed USB 3.0 and future-proof your data transfer rate while maintain backwards compatibility with your existing USB 2.0 devices using this USB cable extender",
      "Enjoy SuperSpeed USB 3.0 data transfer rate at up to 5 Gbps, 10x faster than USB 2.0 with this USB male to female extension cable; Perfect male to female USB cable for Oculus Rift, HTC VIVE, PlayStation VR, Valve Index, Microsoft HoloLens VR headsets",
      "Premium USB extender cable engineered with molded strain relief connectors for durability and grip treads for easy plugging and unplugging; Connect this USB charger extension cord to a USB charging cable to fast charge a smartphone or tablet such as the iPhone",
      "The combination of gold-plated connectors, bare copper conductors, and foil & braid shielding provides superior cable performance and error-free data transmission via USB cable extension"
    ],
    "specifications": {
      "Product Dimensions": "7.06 x 5.59 x 0.67 inches",
      "Item Weight": "7.7 ounces",
      "Manufacturer": "Cable Matters",
      "ASIN": "B00C7SA21U",
      "Item model number": "200008-BLACK-10",
      "Customer Reviews": "4.7 out of 5 stars4,804 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#34 in USB-to-USB Adapters",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 20, 2011"
    },
    "categories": [
      "Computers & Accessories",
      "Computer Accessories & Peripherals",
      "USB-to-USB Adapters",
      "Computer Cable Adapters",
      "Electronics"
    ],
    "price": 8.99
  }
}