{
  "website_summaries": [
    {
      "verdict": "The Klipsch R6i earphone pair delivers deep bass and crisp highs in a reasonably priced, secure-fitting design.",
      "pros": [
        "High-quality audio performance with rich bass, crisp highs",
        "Comfortable design with multiple eartips",
        "Inline remote control and microphone"
      ],
      "cons": [
        "Some distortion on deep bass at top volumes",
        "Not for purists seeking flat response"
      ],
      "aspects": {},
      "publication_date": 20140602,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "These have a great sound, perfect blend of bass mid and treble",
      "text": "These have a great sound, perfect blend of bass mid and treble. If you are using them for a smart phone or tablet, install the free klipsh app, it will allow you to customize the mic for skip, play, pause, etc. Even though the app is for the S4, it still works. No volume control, but that's not a big downside for me.. Also, they come with 6 different silicone tips, be sure to try them all, as the fit is important to the sound you hear.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 8,
      "publication_date": 20140821
    },
    {
      "title": "Five Stars",
      "text": "Accidently ran them through washing machine and dryer, and are still working",
      "rating": 5.0,
      "verified": true,
      "author": "Soda Khul",
      "helpful_votes": 26,
      "publication_date": 20150208
    },
    {
      "title": "Best headphones ever",
      "text": "Love these headphones. I bought them specifically to go on a trip overseas through Japan and China and they work amazingly. I highly recommend these! They're comfortable, the sound quality is amazing (duh it's Klipsch), and they block out ouside noise really well. Plus the pretty jade color is a nice tough. The speaker and buttons work great too when calling or getting a call on your phone.",
      "rating": 5.0,
      "verified": true,
      "author": "Bee Chu :)",
      "helpful_votes": 6,
      "publication_date": 20141029
    },
    {
      "title": "I love my S3M's",
      "text": "Let me get something out of the way: I love my S3M's. Even though I mostly use bluetooth headphones, these will always have a special place in my heart. I bought my first pair a couple of years back and they lasted for a very long time. My sister's cat chewed through my pair though so I went without for quite some time. I recently picked up a pair for the mic to use for gaming. It works great. For the money, the sound quality can't be beaten. Klipsch really hit it out of the park with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Bassngage",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Great performance at a steep discount.",
      "text": "Excellent for the price. Good response, tuned a bit bass heavy but still good definition for earbuds throughout the audible range. Some cord noise, to be expected at this price point. No complaints. If you can find a set get them. Huge improvement over OEM phone earbuds. 5 for value & performance.",
      "rating": 4.0,
      "verified": true,
      "author": "Ecce Homo",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "I'd easily go through a pair a month of cheap drug ...",
      "text": "I'm hard on earphones. They are an essential part of my daily work life so they get lots of wear and tear. My third pair of these in 3 yrs. I'd easily go through a pair a month of cheap drug store headphones with less quality sound. Will purchase again whenever my current ones can't take any more of my abuse.",
      "rating": 5.0,
      "verified": true,
      "author": "lea9178",
      "helpful_votes": 3,
      "publication_date": 20160911
    },
    {
      "title": "Beautiful sound, great headphones.",
      "text": "Wonderful. I am thrilled with these Klipsch headphones. The sound is really full and clear, and I feel like I'm hearing some of the nuances in my music for the first time. It does favor bass tones a little, but its treble is clear as well, and I find myself more enthusiastic than I've been in a while to listen to my music. The earphones also fit better than any I've ever had, with a great seal and real comfort. This is genuinely the first pair I can wear for extended time without irritating my ears -- something about the unusual angle does it.",
      "rating": 5.0,
      "verified": true,
      "author": "Naomi L.",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "Poor  Quality,",
      "text": "I have a older pair of Klipsh, but didn't like the ear bud goes down in your ear, but the sound quality much better than these and cheaper, surprised me out of Klipsh, I don't hardly any noise cancelation, if I hadn't thrown away the box would have sent them back",
      "rating": 4.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Great headphone for the price.",
      "text": "Two camps in this world. The Bose fans and the Klipsch fans. If you do not know which camp you are in, try it. You'll probably be a Klipshch fan for life. I 've had both and prefer Klipsch speakers and headphones. This was a replacement for a 7-8 year old pair of S3Ms that stopped working in one ear. All earbuds will fail eventually. Usually the wires wear out at the earbud.",
      "rating": 5.0,
      "verified": true,
      "author": "zep",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "Crisp sound, but bass is almost gone",
      "text": "I had high expectations for these, just because they were made by Klipsch, but was disappointed by the sound. The sound is very well defined, but tinny, with very little bass.",
      "rating": 3.0,
      "verified": true,
      "author": "Hopeful, but Cynic",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Feels flimsy, but it delivers pure Klipsch goodness",
      "text": "We got these for my daughter, who was always \"borrowing\" my Klipsch R6. The R6 is a fantastic product with amazing sound. The S3M is much cheaper than the R6, do I was expecting some compromises in quality. Indeed, they are made of very light plastic that feels almost weightless, giving an impression of flimsiness. That impression could not be further from the truth. They are very sturdy so far under my daughter's amazing ability to destroy even robust headphones. :) And the sound? Pure Klipsch goodness! This came as a good surprise for a product so much cheaper than my precious R6.",
      "rating": 5.0,
      "verified": true,
      "author": "David Alexis",
      "helpful_votes": 0,
      "publication_date": 20151029
    },
    {
      "title": "using klipsch for years",
      "text": "i enjoy the klipsch product. fit is awesome. dont fall out. Some of the controls are a bit tricky and dont work great on iphone 6+, but my use is for walking and I use the controls on the phone. The buds are extremely comfortable and are awesome at background noise cancellation. They are basically earplugs with speakers in them. Like them a lot, for years...",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "These are worthless",
      "text": "The earphones worked ok for 2-3 times under NO stress at all. Sound was pretty bad, but I was listening to a movie on the computer so I could turn the computer sound level way up. Then the earphones hung on a hook for a month or so. Now they only work if I hold down the button ALL THE TIME, and even then I can just barely hear anything. They are now in the trash. Worthless product. Don't buy.",
      "rating": 2.0,
      "verified": true,
      "author": "W.D. Wilson",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "I have purchased over 5 sets since 2011! Best headphones!",
      "text": "These are my favorite headphones: I have been purchasing the same brand since 2011. I was wearing my Klipsch ear headphones in Dec 2011 during a suicide bomber attack in Afghanistan and I strongly believe that these headphones protected my ears from the the loud blast.",
      "rating": 5.0,
      "verified": true,
      "author": "veronica almeida",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Superb, crystal clear audio. Music sounds perfectly reproduced!",
      "text": "Fantastic balance of lows, mids and highs! Sounds like you have a pair of mid-range Klipsch speakers in your ears, because you do! I love the clarity of sound I get from these earbuds. Every song in every genre I have tried sounds fantastic, and phone conversations are clear and precise. Highly recommended, especially after trying a number of the lower-priced options available. These earbuds are worth the extra money, without going nuts for a high-end pair.",
      "rating": 5.0,
      "verified": true,
      "author": "nerdmarshall",
      "helpful_votes": 0,
      "publication_date": 20141114
    },
    {
      "title": "Crisp and clear",
      "text": "I've had theseit or over a year. These sound crisp and clear like the klipsch book shelf speakers. Good mids, highs, bass. Block out noise very well. They just sound better and better over time. They stay in my ears while moving. There is some chord noise but I expect that and it isn't a deal breaker since it isn't constant. For the money, these are exceptional. Clear and crisp sound is an adjective I would use to describe these. I'm sure the other colors sound the same☺",
      "rating": 4.0,
      "verified": true,
      "author": "Rommel Upshur",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "These were the best headphones I've ever had",
      "text": "These were the best headphones I've ever had. I have small ears so it is hard to find a good pair that fit and stayed. Good for running etc. The sound quality is amazing and blocks out sound even without music. About a year later now and the other side has stopped working. Not sure if another pair is worth the price. I got them cheaper than $45 last year.",
      "rating": 5.0,
      "verified": true,
      "author": "Butter",
      "helpful_votes": 0,
      "publication_date": 20170301
    },
    {
      "title": "Clear sound, thin cord, loght bass, very mids and highs",
      "text": "Great sound. Very light bass but nice mids and highs. Lightweight cord good for working out so ideal for corded headphones to work out with.",
      "rating": 5.0,
      "verified": true,
      "author": "tnholt79",
      "helpful_votes": 0,
      "publication_date": 20200201
    },
    {
      "title": "Love these multipurpose buds",
      "text": "Excellent sound quality for phone calls, or listening to music or movies on galaxy s-7 android phone. They sound as good or better than my Klipsch s4 ear buds. As an added bonus they also work as a fully functioning headset and Microphone for my xbox one controller. I have used them successfully on the newer controllers that don't need an adapter, as well as the older style controller that needs the adapter plugin.",
      "rating": 5.0,
      "verified": true,
      "author": "DougE",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Disappointed",
      "text": "I have owned these for just under 8 months and they just stopped working. I would say that the sound is just mediocre and I was quite disappointed that althought Klipsch has a warranty they do not honor it from sellers that are not an authorized dealer, which is not marked anywhere. I will not be purchasing another pair since I bought these because of the warranty.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Paine",
      "helpful_votes": 2,
      "publication_date": 20150405
    },
    {
      "title": "Klipsch is an excellent brand. This model strikes a balance between high ...",
      "text": "Klipsch is an excellent brand. This model strikes a balance between high sound quality and affordability that I consider perfect. Keeps your ears happy with what they're hearing, and lasts a good long time if you treat them right.",
      "rating": 5.0,
      "verified": true,
      "author": "IronianKnight",
      "helpful_votes": 0,
      "publication_date": 20180209
    },
    {
      "title": "Klipsch delivers; Oval seals are the best... Can see cost cutting in the wire quality",
      "text": "The oval shaped earbuds fit like no other...the sound is good...The wire has become of a thinner, cheaper material...These are not as good as the discontinued models...You can tell, because used pairs on Amazon go for $80.--- when they were $35.-- New.",
      "rating": 4.0,
      "verified": true,
      "author": "J. A. Schroeder",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "Would Recommend!",
      "text": "Klipsch is honestly my favorite brand - I bought this pair because it was affordable, yet knew it would offer great sound. It offers excellent noise isolation and I love that I can skip a song by double clicking on the cord button rather than my actual iphone. I've admittedly gone through several pairs of this brand earbud, but mostly due to my own carelessness. The sound quality of these earbuds is surprisingly awesome, considering the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Petunia",
      "helpful_votes": 0,
      "publication_date": 20160608
    },
    {
      "title": "anything Klipsch makes is good. Nice guality sound",
      "text": "What can I say, anything Klipsch makes is good. Nice guality sound, evenly distributed. Came as advertised, fits good, right length.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Berman",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "... three Klipsch S3M in-ear headphones and have been highly satisfied with each",
      "text": "I have purchased three Klipsch S3M in-ear headphones and have been highly satisfied with each. In low-wind environments, the earbuds block out conversations being held right next to me, allowing me to listen to my music or audiobook. When I head outside, however, if the wind is blowing or I'm running wind noise becomes a problem. All in all, great earbuds.",
      "rating": 5.0,
      "verified": true,
      "author": "The SandSailor",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "Great sound and value",
      "text": "I'm a big fan of Klipsch ear buds. For the price point, I think they excel and canceling out background noise like few other options. Unlike some of their other models, these can be heard by people around you if you increase the volume. Also, this pair comes with a carrying case and extra ear bud cover plastic-things.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "I bought the same kind again because I loved the way they fit my ears",
      "text": "I bought these to replace a previous set (of the same ear buds) that met an unpleasant fate with a lawn mower. I bought the same kind again because I loved the way they fit my ears. They come with multiple cups for them, which is great for getting the right fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Fiat Spider Boy",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Original S3 with no mic is better.",
      "text": "These are not as good as the original S3. Bass and clarity overall is still there, but on a flat setting it can be very sibilant. If you have an EQ you should try tampering with the 1KHZ frequency. Mic is not great people have trouble on other end hearing you, even if they are perfectly clear on your side. Play/Pause button can be inconsistent at times. They are still a good headphone, just not as good as it predecessor. If you don't need the mic try to get the S3 before they run out.",
      "rating": 3.0,
      "verified": true,
      "author": "Sanity",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Mediocre",
      "text": "The reason why this isn’t 1 Star is because the Earbuds do look cool and they work. However, the sound quality isn’t as good as I thought they would be. And the bass isn’t good on here either. And I have oddly shaped ear holes, they don’t fit me properly either. Maybe If they were cheaper, they would be worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Craig",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Excellent quality and sound great; excellent performance for price.",
      "text": "Excellent quality and sound great; excellent performance for price. I have another pair of Klipsch earbuds; they are the best brand I have owned.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Dowell",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Well done for all!",
      "text": "Comfortable with great sound. Great while exercising too. He's had Klipsch for years and now she has some of her own! Great value. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorendi",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "Pros - Good sound for price (Loud) - Used at the gym ...",
      "text": "Pros - Good sound for price (Loud) - Used at the gym and works fine Cons - Volume controller attached to the cord is made of cheap plastic that makes noise when moving - Earbuds do not fit comfortably in my ear no matter what size stopper I use I would not recommend. I got the Xiaomi Piston 3 and like them much more than these.",
      "rating": 3.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "Love these! - Lightweight so they don't fall out ...",
      "text": "Love these! - Lightweight so they don't fall out of my ears - Comes with different size covers to fit in your ear properly - Microphone so you can use it with your cell phone for phone calls (just double click the button to end the call)",
      "rating": 5.0,
      "verified": true,
      "author": "Cat J",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Not the best headphones, but decent quality for the price",
      "text": "Not the best headphones, but decent quality for the price. I owned these previously and decided to purchase a new pair instead of replacing the iPhoen 6s apple ear buds that I snapped last week..Sound quality is not as good as I remember it. Apple must have since upgraded their earbuds. The silicon ear pieces are very comfortable (and the pair comes with extra in case you lose them), but do not stay in very well during exercises like running or jumping. There is an in-wire mic, and button to pause/play, but no volume control. Color is super cute and the wires are durable!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "They are a little tingly but good for an all purpose ear bud",
      "text": "I must be honest and say that my preference for ear buds within this price range is the Sennheiser CX 300 II Precision Enhanced Bass Ear buds . But as far as this item it is fair and does give you a communications piece for phone which the Sennheiser does not provide. They are a little tingly but good for an all purpose ear bud.",
      "rating": 3.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Garbage. Don't bother",
      "text": "Garbage. Don't bother. Bought two sets, both failed the same way (left ear bud just stopped working within 6 months). Both sets used gently by adults (should have lasted longer than the phone).",
      "rating": 1.0,
      "verified": true,
      "author": "jjarvis",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Durable",
      "text": "Good sound. I've used these for over a year almost every day - no problems. No issues with wires, connectors. The mic/playlist button did fall off recently but I don't use it anyway.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Crain",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "I have klipsch s4s and they are superior in sound quality",
      "text": "I have klipsch s4s and they are superior in sound quality, however I wanted a cheaper pair with a mic for my phone that I wouldn't have to worry about throwing around in my purse or bookbag. These are perfect. They are decent sound wise and at $20 who cares if they break. And added bonus the color matches my lifeproof case perfectly.",
      "rating": 4.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "Still too large for tiny ear holes.",
      "text": "I'm sure these are decent headphones but my ear holes are so tiny that even with these and ordering the smallest triple flange silicone ear pieces I could find, they don't go in without being uncomfortably stuffed into my ear! So frustrating!",
      "rating": 3.0,
      "verified": true,
      "author": "Clairex",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "they are comfortable to wear for a long period of time but ...",
      "text": "Sound quality is only so-so, it wasn't a concert experience. They don't stay in my ears very well. I've tried the 3 sizes of silicone ear pieces and none of them seem to help with the problem. I will say when they are in my ears, they are comfortable to wear for a long period of time but I constantly have to push the buds back in, which is annoying when I'm doing something active. If you can get them relatively cheap, they are worth it but full price, save your money.",
      "rating": 3.0,
      "verified": true,
      "author": "dan maestas",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "I love these headphones",
      "text": "I love these headphones. I purchased these same Klipsch earbuds over a year ago and loved them, but unfortunately lost them. I found these for cheaper online and ordered them and am happy to have them back in my ears. I use them when I am riding my motorcycle to listen to music and limit the amount of wind noise. I would suggest using them in reverse, that is the left bud in your right ear and right bud in your left ear. This allows them to sit flush with the ear and thus reduces the pressure of your helmet pushing the helmet into your ears.",
      "rating": 5.0,
      "verified": true,
      "author": "ChanShu",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "sound is great can't remember exactly how could since i found some ...",
      "text": "I've bought these 3 times. sound is great can't remember exactly how could since i found some other good pairs but if u pick these up in the used section as like new u can get a pair for 10-15 bucks, great deal base some what quite but voices and highs loud and clear. great earbuds.",
      "rating": 4.0,
      "verified": true,
      "author": "Mitchell",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Good",
      "text": "These headphones are great and they work like earplugs so they are nice an noise canceling. They come with different earplug(earpiece?) options so if you have small/big ear holes you can change out the earplugs. The red color is true to the picture, maybe a little brighter.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20140912
    },
    {
      "title": "Five Stars",
      "text": "This is the 2nd pair of these earbuds I have bought but this time for my daughter. She tried mine & loved them!! Since she works on a cruise ship & doesn't have a lot of down time but when she does she appreciates the quality these earbuds provide besides being able to block other people out!!! Thanks!!",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "and they sounded great. I bought these with the hope they would ...",
      "text": "I had the s4i for a long time before they broke, and they sounded great. I bought these with the hope they would sound almost as good but they definitely lack bass and mids. You get what you pay for. They dont sound terrible by any means, but just dont expect too much.",
      "rating": 3.0,
      "verified": true,
      "author": "Leetster",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "I like them",
      "text": "These are pretty good headphones, they stay in my ear, have a pause button on the outside, and have good sound and noise cancellation. My only negative thing about these is running and exercising with them, because they bounce in your ear when you're bouncing. I think this is just that they are wire headphones and have a microphone/pause/play button on them and weigh it down, but I can live with this.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel Wolfgang",
      "helpful_votes": 0,
      "publication_date": 20160426
    },
    {
      "title": "Big Sound in a Small Package",
      "text": "These earbuds are great and pack a powerful sound for their size. I use them in an office environment, and they're exactly what I needed to block out the ambient noise.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Lease",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Headphones are great. This is not the 1st pair I have ...",
      "text": "Headphones are great. This is not the 1st pair I have had, kind of hard on these. But for the money the Klipsch are some of the best and will probably replace these with like models when needed.",
      "rating": 5.0,
      "verified": true,
      "author": "R. L. Johnson",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Very Disappointed in the Quality and Seller (Just Right!)",
      "text": "I have owned these for 6 months and there is no sound coming out of the right headphone. I contacted the seller (Just Right!) and the reply was that they only offer a 90 day warranty on online purchases. I only use this product at the gym about three times per week. Shoddy quality and bad customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "john cusick",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Short life for the price",
      "text": "These work well but one of the ear bud drivers died after about 6 months. You'd expect better from a brand like Klipsch. Unfortunately, warranty didn't cover a sale from an \"unauthorized\" dealer on Amazon. I'll probably stick to another brand in the future.",
      "rating": 3.0,
      "verified": true,
      "author": "Max M Milder",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "prone to popping out easily, but the sound is great",
      "text": "They don't fit in my ears, prone to popping out easily, but the sound is great. I tried using different sizes of the rubber bits, did not solve aforementioned issue.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Kennedy",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "poor quality",
      "text": "The left and right ear buds are sending out the audio backwards. there's no way to fix this short of opening up the wiring. the plastic buds are also poor quality and irregularly shaped. I've owned this exact product before , and was trying for a replacement",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "they do the job so far",
      "text": "I bought them to use in a loud data center and I'm impressed by how much they suppress ambient noise. It did take trying different rubber adaptors but once I found the one that fit and adjusted the 5 band eq in the sound settings the sound quality is good for $20. I do agree with other reviews that the bass response is lacking, I'd have to try more expensive earbuds to see how these rate.",
      "rating": 4.0,
      "verified": true,
      "author": "AaronC",
      "helpful_votes": 2,
      "publication_date": 20140917
    },
    {
      "title": "Not quite as good as my old Klipsch earbuds",
      "text": "Not quite as good as my old Klipsch earbuds, but being able to answer a call with a button is handy enough.",
      "rating": 4.0,
      "verified": true,
      "author": "Kacie Hughes",
      "helpful_votes": 0,
      "publication_date": 20161008
    },
    {
      "title": "Fabulous Ear Buds",
      "text": "Extremely comfortable ear buds. I don't like the Apple ear buds that came with my iPhone because they hurt my ears. These make it very easy to talk and you don't even know they are in you ears. I almost bought a much more expensive pair but let me assure you these are well worth the price and perform great.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Rett",
      "helpful_votes": 0,
      "publication_date": 20141203
    },
    {
      "title": "Great earphones",
      "text": "These fit well and sound great. You can wear these across on a cross country flight without your ears being uncomfortable. I have several pairs, but haven't burned through my first pair yet. The inline mic seems to work well - no complaints. Best earphones I have ever had!",
      "rating": 5.0,
      "verified": true,
      "author": "M stell",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "Best quality at the lowest price",
      "text": "I work in radio and am snobby about audio gear, so when my boyfriend said he needed new earbuds, I searched Amazon for the best quality at the lowest price (that also matched his white iPhone). I landed on these. They sound rich and full. He loves them. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "So disappointed.",
      "text": "Barely used, a few times a month while taking a walk around the block and they just started getting static-y and then failed entirely within a day of that. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Deric Metzger",
      "helpful_votes": 0,
      "publication_date": 20160719
    },
    {
      "title": "Klipsch earbuds fit my ears comfortably. I like that you can control the next ...",
      "text": "Klipsch earbuds fit my ears comfortably. I like that you can control the next button from the toggle switch, just wish that volume could be controlled too. Love the color!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170331
    },
    {
      "title": "Worst ear phones ever. Suspect it is fake.",
      "text": "I bought 2 units of this some time back but only started using it today and it was such a disappointment. I have reason to believe it may be fake. The sound comes out from one ear and there was sound from the other side in spurts. Impossible for me to return it now. I am an international buyer. this is a lesson learnt not to buy 2 units just because it's cheaper.",
      "rating": 1.0,
      "verified": true,
      "author": "Win lim",
      "helpful_votes": 0,
      "publication_date": 20170220
    },
    {
      "title": "Excelent headphones for the price",
      "text": "Excelent headphones for the price. I have been using it for about 2 years and are great y continue as new. Are practical and very good sound quality for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "david uribe",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Great sound",
      "text": "Great headphones. The sound is typical of Klipsch: wonderful. The speaker works great for talking. I don't use the one button provided to control my music or volume because it seems ridiculous and I've always controlled everything from my phone so I just continue to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly",
      "helpful_votes": 0,
      "publication_date": 20150704
    },
    {
      "title": "Five Stars",
      "text": "Great product. Same they disco to them because the other styles don't fit my ears as well",
      "rating": 5.0,
      "verified": true,
      "author": "Travis W",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "Nice set",
      "text": "Great headphones for the money. Love how they fit in your ears.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Davis",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Very nice",
      "text": "I ordered these because I was tired of earbuds that won't stay in my ears. These come with several sized tips and I used the smallest ones and they actually stay in place. Second bonus is the great sound!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "Seems to work great so far.",
      "text": "Seems to work great so far. The sound is great, maybe even better than my S4's. The construction feels a little flimsy. The large oval tips fit my ears well, and they are durable. But they are expensive to replace if something happens to them.",
      "rating": 5.0,
      "verified": true,
      "author": "Fieryermine",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "These headphones work well, the problem is every time ...",
      "text": "These headphones work well, the problem is every time the headphones move or bump into something the noises in my ears are very loud and awful!",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal Terry",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Very clear mid-highs but almost no bass at all. Kinda disappointing",
      "text": "Decent in-ear headphones overall. Sound is great in mid-high range, but the lows are sure lacking. I got these as a replacement for a pair of S4s I lost and although they are half the price, the lack of bass just does not justify the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Iris",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Excellent sound quality",
      "text": "I do courtroom transcription, so hearing everything recorded clearly is a must. The sound quality is great with these earbuds and they are quite comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Gr8typist",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "I am so glad she did",
      "text": "a co-worker told me about this item, I am so glad she did, now I don't have to worry about it to keep falling out of my ear. it stays put. love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Five Stars",
      "text": "Not much bass but very very clear sound,you could hear a pin drop in the recording studio.",
      "rating": 5.0,
      "verified": true,
      "author": "slimster",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Great quality but...",
      "text": "Great quality sound. They are quiet though. Fantastic fit and seal makes up for a quiet set. However I do like it louder.",
      "rating": 3.0,
      "verified": true,
      "author": "Grimilenn",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Klipsch provides great sound but those weirdass silicon thingies do NOT stay ...",
      "text": "Klipsch provides great sound but those weirdass silicon thingies do NOT stay in no matter WHAT. Ended up finding spare bits from my old senheisser ones and superglued them on to make them work.",
      "rating": 3.0,
      "verified": true,
      "author": "Butter",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "Amazing sound",
      "text": "My previous Klipsch headphones were damaged and so I wanted new ones. They have the best sound of any earbud I've ever had. I can't believe how much bass comes out of these little things! These are amazing headphones for the price. They have pricier ones, but these work just fine for me!",
      "rating": 5.0,
      "verified": true,
      "author": "Cass",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Good bang for you buck",
      "text": "Can't beat the price and quality for these Klipsch earbuds. I wish they had flat cords but that hasn't been an issue with these.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Stopped working after a month",
      "text": "They really don't sound much better than Apple ear buds. These stopped working actually.",
      "rating": 2.0,
      "verified": true,
      "author": "Vance",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "I really like these headphones",
      "text": "I really like these headphones, the sound on them is amazing and well balanced - it is my 2nd par of Klipsch. They are easy to carry with the pouch and the microphone is also handy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lukasz Cerazy",
      "helpful_votes": 0,
      "publication_date": 20140916
    },
    {
      "title": "Broke in two weeks",
      "text": "I'm very disappointed in these headphones. I've had good experiences with Klipsch in the past so I expected much more than what I got. Within two weeks of receiving these headphones, the right earbud has stopped working if I move even slightly while wearing them. These headphones do not live up to expectations..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Good value - great sound for an attractive price. Comfortable fit. Good quality. Highly recommended!",
      "text": "Good sound for the price. Klipsch high quality. Fun color. Good fit inside ear. Nice solid plug and cable does not twist, yet is soft and pliable. I like these ear-buds! Highly recommend!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cee Bee",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "My favorite cheap headphones by a mile",
      "text": "I love these. No cheap headphones are even close to this comfortable. I keep 4 pairs of these for home, office, car, briefcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Prince Hal",
      "helpful_votes": 0,
      "publication_date": 20150519
    },
    {
      "title": "Entry level klipsch earbuds",
      "text": "Better than most, spend a little more and upgrade from these. I own them all , these are decent for work",
      "rating": 4.0,
      "verified": true,
      "author": "stephen miller",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Great design, useful storage pouch & high quality listening experience!",
      "text": "Arrived as advertised, always love Klipsch earphones! This pair didn't disappoint and is in a lovely color. Sound is balanced, nuanced and I never have to listen to my music at a very high volume to hear everything.",
      "rating": 5.0,
      "verified": true,
      "author": "Jade",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Great sound, comfortable for tiny ears",
      "text": "I have tiny ear openings and these fit great! They are pretty comfortable, with the weird sideways design. The sound is really good too.",
      "rating": 5.0,
      "verified": true,
      "author": "LeilaG",
      "helpful_votes": 0,
      "publication_date": 20150618
    },
    {
      "title": "Don't bother...",
      "text": "I've had Klipsch headphones before and expected Sooooo much more.... I've bought 5.00 earbuds that sound better than these.",
      "rating": 2.0,
      "verified": true,
      "author": "will",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "Great ear-buds, nice isolating functionality.",
      "text": "Great ear-buds, the microphone works really well and I love how this pair block any external sound. I also had the S4 and the comfort is remarkable. Great choice by buying these.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Guzmán",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Glad I can still find them at a good price",
      "text": "These are now considered \"old\" but they fit my ears perfectly for when on my motorcycle. Glad I can still find them at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Gru",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "One of the best headphone outthere",
      "text": "One of the best headphone outthere. It last a long time. it comes with exchange rubber head piece. It is able to skip to the nest song or hold.",
      "rating": 5.0,
      "verified": true,
      "author": "LIZZY. L",
      "helpful_votes": 0,
      "publication_date": 20160419
    },
    {
      "title": "Great sound!",
      "text": "I have owned several of these over the past 5 years and I love them! I only buy more for the colors, the sound is great! I use them daily at the gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori A Hutchens",
      "helpful_votes": 0,
      "publication_date": 20141016
    },
    {
      "title": "great ear buds",
      "text": "great ear buds, awesome sound...had a problem with first one but amazon quickly replaced them, THAT'S WHY WE SHOP AMAZON FIRST!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Demello",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "awesome headphones",
      "text": "needed a headphone that worked with my friend WINDOWS phone. The S3M sounds goods, is lightweight and the mic is universal for all types of phones. pretty kool.",
      "rating": 5.0,
      "verified": true,
      "author": "Speed Freak",
      "helpful_votes": 0,
      "publication_date": 20140213
    },
    {
      "title": "Great sound and comfortable.",
      "text": "She had a pair that I bought for her but her dog ate them so these replaced the old ones. She loves them.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Mautz",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Great Headphones........",
      "text": "Great headphones, I love them. The fit, the sound quality all at a great price, can't beat that?",
      "rating": 5.0,
      "verified": true,
      "author": "John Stephenson",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "other <$20 earbuds have better sounds.",
      "text": "Not worth the money... other <$20 earbuds have better sounds... especially bass. Fall out of your ears no matter which tips you use...",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180119
    },
    {
      "title": "They work great, good sound and a great warranty",
      "text": "Klipsch is the way to go. They work great, good sound and a great warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Michelle Britton",
      "helpful_votes": 0,
      "publication_date": 20151026
    },
    {
      "title": "They're very comfortable in my ears",
      "text": "They're very comfortable in my ears, and the sound is extremely clear! The chord also feels strong, so I'm hoping these last a LOT longer than any of the other headphones I've bought for considerably less.",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda H",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "great sound and an even better",
      "text": "I have bought three pairs, lost all of them before they gave me any trouble at all! great sound and an even better price",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Good price for great headphones!",
      "text": "Very good price for good quality headphones. I wear these at work and while working out and they work well for both. Cancels noise quite well for being small little ear-buds. The color is really cute too!",
      "rating": 5.0,
      "verified": true,
      "author": "Jade Poisson",
      "helpful_votes": 0,
      "publication_date": 20141007
    },
    {
      "title": "Five Stars",
      "text": "Love these. They do not hurt my ears like some of the others do.",
      "rating": 5.0,
      "verified": true,
      "author": "Bazinga",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Great headphones! Comfortable and great sound.",
      "text": "These are my go to earbuds. Comfortable and great sound. High and low.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20160514
    },
    {
      "title": "Two thumbs up",
      "text": "Good sound quality and I love the little carrying case.",
      "rating": 5.0,
      "verified": true,
      "author": "EHD",
      "helpful_votes": 0,
      "publication_date": 20151230
    }
  ],
  "product_meta": {
    "title": "Klipsch S3M-Black-HP In-Ear Headphone, Black",
    "description": "Color:Black| Product Packaging:Standard PackagingSpecifically engineered for mobile devices, the Klipsch S3m headphones give you a front stage pass to your music collection whether you are an Apple, Android, Windows or BlackBerry user. This is the ultimate hassle-free headphone thanks to a nifty single-button remote and mic which gives you total control of both your playlist and phone calls on virtually all of your mobile devices.\n\nFROM THE MANUFACTURER\n\n\nKLIPSCH S3M BLACK IN-EAR HEADPHONES\nSpecifically engineered for mobile devices, the Klipsch S3m headphones give you a front stage pass to your music collection whether you are an Apple, Android*, Windows or BlackBerry user. Universal Headphone for Any Device \nThis is the ultimate hassle-free headphone thanks to a nifty single-button remote and mic which gives you total control of both your playlist and phone calls on virtually all of your mobile devices. The S3m also features durable, tangle resistant cables to alleviate the anguish of unkinking a clump of wires. \n\nLegendary Klipsch Sound \nNo matter your device, the S3m brings the best possible sound, producing dazzling highs and lows befitting of the Klipsch audiophile heritage. The S3m utilizes a customized 5.8mm moving-coil driver to deliver smooth, full-bodied sound that can hold its own. \n\nPatented Oval Ear Tips\nHeadphones can sound great, but if they don’t fit, you’re not going to want to put them in your ears. Unlike traditional, circular-shaped ear tips which don't fit properly in your oval-shaped ear canal, the S3m utilizes the patented Klipsch oval ear tip design making them virtually impossible to feel and perfect for long-term wear. Oval ear tips fit better, feel better and only Klipsch has them. \n\nThe excellent seal gained from the oval ear tips allows the S3m to have superior noise isolating capabilities, blocking unwanted background noise from reaching your ears. \n\nAll About the Extras\nAvailable in black, white, blue, red and jade, the S3m is able to complement your fashion choices as well as functioning with virtually any device that has a standard 3.5mm headphone jack. The S3m comes with three pairs of different-sized oval ear tips, clothing clip, a carrying case and 2-year warranty. \n\nFunctionality\nUsing the S3m’s one-button remote and microphone, it is possible to: \n\nAnswer/end calls Volume up/down Play/pause Track forward/track back *To enable complete functionality of your S3m headset on Android, please download the free Klipsch Control App.",
    "rating": 4.2,
    "feature_bullets": [
      "Single-button remote and mic which gives you total control of both your playlist and phone calls on virtually all of your mobile devices",
      "Customized 5.8mm moving-coil driver to deliver smooth, full-bodied sound",
      "Utilizes the patented Klipsch oval ear tip design making them virtually impossible to feel and perfect for long-term wear",
      "Durable, tangle resistant cables to alleviate the anguish of unkinking a clump of wires",
      "Connectivity Technology: Wired"
    ],
    "specifications": {
      "Product Dimensions": "1 x 0.5 x 0.5 inches",
      "Item Weight": "0.388 ounces",
      "Manufacturer": "Klipsch",
      "ASIN": "B00CZ5GB24",
      "Item model number": "S3M Black HP",
      "Customer Reviews": "4.2 out of 5 stars381 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#13,513 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "May 24, 2013"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": ""
  }
}