{
  "website_summaries": [
    {
      "verdict": "Contains both crinkle sounds and catnip inside to keep your cat interested in the toy.",
      "pros": [
        "Trusted brand name for pet toys, so you can count on the quality of the toy's construction",
        "Extremely soft fabric makes it perfect for cuddle time",
        "Fun shape, so cats can toss it around during play time"
      ],
      "cons": [
        "May be a little large for a small cat or kitten",
        "No option to refill the catnip"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "best ever",
      "text": "my cat totally loves this . plays with it and sleeps cuddling it, not only am i buying a couple more for FurBadAss, but for all my friends with fur babies too, Furbadass is not only a beloved member of our family but my service (sugar) cat, since 2008 she has saved my life 19 times, I only wish I could picki the color",
      "rating": 5.0,
      "verified": true,
      "author": "Lace",
      "helpful_votes": 7,
      "publication_date": 20180109
    },
    {
      "title": "Cats like anything catnip.",
      "text": "First off I guess you get a random colour. Luckily I got the brown one I wanted delivered to me. I was hoping this was like the other kong toys where you can fill it up with catnip. It's not. But it has catnip inside and crinkle sounds. (Not a whole lot though) I put it in a container of catnip so it would get infused fully. Now my cats love it. They suck the catnip out of it and roll on top of it and carry it around. I like it. Kong toys are always a win with my cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Nikki",
      "helpful_votes": 17,
      "publication_date": 20150612
    },
    {
      "title": "great little bear!",
      "text": "Does Kong ever make anything that's less than a 5 star rating? This bear is super soft! My cat loves to cuddle with it, and will take it to bed with her. It's small enough for her to carry around, but large enough that it won't become lost. It's very strong, and has withstood getting grabbed by my dogs too.",
      "rating": 5.0,
      "verified": true,
      "author": "E&E0715Top Contributor: Pets",
      "helpful_votes": 7,
      "publication_date": 20170502
    },
    {
      "title": "The cat approves.",
      "text": "Our cat likes to deliver her toys to us, making quite the show of it, meowing all of the way. This one is too cute! Love the patchwork look of the bear. She's stopped delivering the older toys and now just brings us this one. Not sure that the catnip aspect is fresh as she didn't seem to have the usual crazed cat reaction that she has with strong catnip toys but she still loves this, so that only knocks it down to 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "DelusionalAngel",
      "helpful_votes": 3,
      "publication_date": 20170828
    },
    {
      "title": "Great little toy",
      "text": "My cat went crazy for this toy... I recently lost two cats and felt bad for a the one who was left. He's sixteen and was always a bit timid and never really played with toys. I bought other ones but he ignored them. Then I got this one, and the minute I put it in front of him, he loved it. And they even sent me one that had the same coloring as my cat. Great little toy. I hope it gives him some comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Rich",
      "helpful_votes": 3,
      "publication_date": 20180929
    },
    {
      "title": "Perfect cat toy",
      "text": "I recently adopted a 6m old kitten and she wasn’t being very playful until I got her this toy. The first night I gave it to her she jumped on it, threw it, chased after it for probably an hour. It really is just what I was looking for. The size is perfect as well.",
      "rating": 5.0,
      "verified": true,
      "author": "a girl",
      "helpful_votes": 4,
      "publication_date": 20171215
    },
    {
      "title": "Furry bear for the cats",
      "text": "I bought this Teddy Bear toy for my oldest cat to snuggle with. My cats put toys in their kitty beds and this is a nice, soft, furry toy for the oldest to sleep with and to play with. Of course, the other three cats have hijacked it on occasion. The bear is described as having catnip, but there is no catnip. The bear has a little patch on him that makes him extra cute. It makes him look like he's been mended with a little patch of cloth. A nice cat toy.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Warfield",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "This is just so adorable, I was sent the brown one which I ...",
      "text": "This is just so adorable, I was sent the brown one which I wanted. I didn't even open the box yet and my almost 6 month old kitten that I recently adopted must have smelled it because she was climbing all over the box trying to get at it. She seems to really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 3,
      "publication_date": 20180219
    },
    {
      "title": "Cute Bear In Photo",
      "text": "Cute bear in photo. Bear I got had one ear sewn on back of its head. Couldn't see nice details in photo. Bears hair too long around face. I got a bad one. Cut hair back so I could see face but couldn't do anything about that one ear. I bought it more for me I guess. My cat didn't play with it.",
      "rating": 3.0,
      "verified": true,
      "author": "Sunshine",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "The favorite toy",
      "text": "My 8-year-old male cat loves Bear! He doesn't necessarily play with it a lot, but he snuggles with it, and he ALWAYS knows where it is. He uses it as a gift....I will find it by my computer desk, near my bed, or next to my chair. We've had it for more than six months and it looks like new.",
      "rating": 5.0,
      "verified": true,
      "author": "faithful1",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Not happy",
      "text": "this is the 2nd time I have ordered from this company and didnt get what I wanted... I ordered the bear thinking I would get the grey colored one and it came in black.. cheaply made... of course you get what you paid for.. was trying to find a new toy for a new kitten I am adopting.. I think I am done with this company ...",
      "rating": 2.0,
      "verified": true,
      "author": "Maria",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "Poor quality",
      "text": "My cat ripped it's arm off within 10 minutes and it had loose threads from the 'patches' on it. The toy was much smaller than I expected too, that might be my fault for not checking though.",
      "rating": 1.0,
      "verified": true,
      "author": "Felipe Daniel",
      "helpful_votes": 7,
      "publication_date": 20160318
    },
    {
      "title": "Wonderful cat toy!",
      "text": "She loves it! She will hug it, bite it, beat it up then curl up with it. It's hers and no one elses. Great cat toy. It's soft and feels silky smooth. My cat loves to lick it, then starts to beat It up and after 20 mins of play curls up hugging it. One of the best toys I've gotten her.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadja Ravenstar",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "Smaller then I thought. Grandcat didn't really care about ...",
      "text": "Smaller then I thought. Grandcat didn't really care about the bear unfortunately. I got the cat pizza toy and that got all the attention, so it's not the bear's fault.",
      "rating": 4.0,
      "verified": true,
      "author": "BFG",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Great gift!",
      "text": "I gave this to my cat who has lots of toys but this one is her favorite. She drags it around never gets tired of it. Well worth the money. Well made. The package came on time , no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Chana",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Great toy!",
      "text": "They are great toys. I have a 76 lb Labradoodle that loves these. But he gets them apart after a month or two. But it is worth it, nothing else comes close to lasting this long.Even with them unstuffed, he still loves to play with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott R Smith",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "My cat's favorite",
      "text": "I got a brown teddy bear. My cat loves it. She holds it and licks it, then will run around and play with it - throwing it up in the air. It's probably her favorite toy.",
      "rating": 5.0,
      "verified": true,
      "author": "BH",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "The cat can now stop stealing the dog’s patch bear ...",
      "text": "The cat can now stop stealing the dog’s patch bear. This was the present she kept stealing from under the tree and trying to unwrap this year. Keeps her entertained.",
      "rating": 5.0,
      "verified": true,
      "author": "I. C.",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Delighted Cat",
      "text": "Now my cat's favorite toy. I made up for 2 days late for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip W. Fielder",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "Adorable toy for my cat!",
      "text": "There's nothing to report really...My cat likes to play with her new teddy bear and that's all that matters to me. She's got 5 or 6 teddy bears of different colors & types & she doesn't play favorites. She happily plays with all of them depending on her mood.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Allen",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "It holds up.",
      "text": "I'm not sure if my cat really likes this toy much. But, the good thing is that it really holds up. My cat has played with it and it still looks the same as the day I bought it. I gave it five stars because it really is a good toy. My cat just likes his other toy the best. So, it was kind of not going to happen with this toy.",
      "rating": 5.0,
      "verified": true,
      "author": "RachaelKaye",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Well made-cats enjoy",
      "text": "Well made item. Durable and has just enough crinkle noise to keep cats interested. Gifted one and they say the same.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelle",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "My kitten loves his bear!",
      "text": "My kitten absolutely loves his bear! He carries him around everywhere!",
      "rating": 5.0,
      "verified": true,
      "author": "Dani B.",
      "helpful_votes": 8,
      "publication_date": 20161207
    },
    {
      "title": "My cat loves it. Don't know what it is ...",
      "text": "My cat loves it. Don't know what it is about the cat nip but the cat is really enjoying it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane D.",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "My cats FAVORITE toy!",
      "text": "My kitty carries this toy around the house. She loves tossing it in the air and even brings it to us to play fetch (no kidding!) The quality is true to Kong Toy's quality. We'll definitely buy again if she eventually destroys it.",
      "rating": 5.0,
      "verified": true,
      "author": "Janetta S.",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Cute and soft",
      "text": "I like it more than my cat. Its so tiny and sweet little expression. Sometimes I stick it into her paws when she is asleep. One day I found her sitting on it. I guess thats good?!",
      "rating": 3.0,
      "verified": true,
      "author": "Mandy",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "ONLY ONE Bear for $12.50",
      "text": "FYI - Only ONE. Photo shows 3 items, but you are buying only 1 for $12.50. Way TOO much!",
      "rating": 1.0,
      "verified": true,
      "author": "Puppet",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great Buy",
      "text": "My kitten loves it! He started playing with it as soon as I gave it to him. Awesome toy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "Did not receive item as pictured",
      "text": "I ordered this because I thought I would be getting a gray bear with blue and yellow patches, but I received a black and white bear instead. I also thought it was going to be bigger - this bear fits in my small hand. My cat takes a whiff of the nip and leaves it until he needs another hit. Not exactly the kicker toy I hoped it would be, but it’s cute.",
      "rating": 2.0,
      "verified": true,
      "author": "Raquel J.",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Inaccurate description -- disappointed",
      "text": "I lost a Kong toy for my cat a while back and wanted to replace it so I purchased this because the image was similar looking. Sadly, it came in black (not as shown) and is way smaller than expected. Low quality too--definitely not worth the money. Disappointed. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Worth it",
      "text": "My cat loves it, she plays with it every day and it has lasted a long time! I bought a second one after I lost the first.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Horwood",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Not what I expected!",
      "text": "Its cute but the description says its a crunchy but its not! Theres no crackly paper in it at all which is what my cat loves. Also if theres catnip in it my cat sure didnt act like it did! It has no catnip odor to it to me.",
      "rating": 2.0,
      "verified": true,
      "author": "Pamela T.",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Cute. The one I got was brown but that ...",
      "text": "Cute. The one I got was brown but that doesn't matter to me. Our cat LOVES it and carries it around!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cuzzort",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "Kitten Loves This",
      "text": "My kitten loves this toy and plays with it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Richards",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "Bigger then some others from Kong and my cat seems to have no interest in this one",
      "text": "This one came in black, which I guess is OK, but it it is pretty large for my cat. They make others that are smaller which she loves but at the moment, this one just sits on the floor.",
      "rating": 3.0,
      "verified": true,
      "author": "TCTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Best friend bear",
      "text": "Bought this for our 8 week old kitten to snuggle. Turns out, this little bear is our girl’s favorite wrestling buddy! Where our kitten goes, the bear goes too.",
      "rating": 5.0,
      "verified": true,
      "author": "jamariie",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Kitten love",
      "text": "I got this bear for my 12 week old kitten, she is in love with it. She carries it around in her mouth all over the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine D Phillips",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Wish my cat liked it",
      "text": "This is so cute and I wanted my cat to like it so she could have a little teddy bear. But she has no interest in it as in other toys.",
      "rating": 2.0,
      "verified": true,
      "author": "Jenn",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Not great.",
      "text": "I really expected something more for the price. It hardly contains catnip. Don’t buy.",
      "rating": 2.0,
      "verified": true,
      "author": "H. Prouty",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "Loves it",
      "text": "My cat has only had the bear for two days but loves it so far. He’s pretty picky about what he plays with so I’m glad he likes it!",
      "rating": 5.0,
      "verified": true,
      "author": "Unknown ",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "Puppy love",
      "text": "My puppy loves it! ( I know it’s s cat toy!) but my pupppy is only 3 pounds and it’s hes favorite new toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Lilly",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Sturdy Item",
      "text": "Stiff little bear, should last a long time. Cats not attracted, not sure about catnip potency. Kittens love playing with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cathleen Gray",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Four Stars",
      "text": "It is not of high quality, but my cat loves it",
      "rating": 4.0,
      "verified": true,
      "author": "Callie",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Cute Teddy Bear",
      "text": "The foster kitten loved this toy, but the dog loved it even more. So much that it is almost completely destroyed. It’s really cute though",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Small, but fun, bear",
      "text": "My kitty loves this bear! It's kind of small but perfect for her (9 weeks) size. She growls at me when I try to take it from her! Lol",
      "rating": 5.0,
      "verified": true,
      "author": "Crystal",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Just as described!",
      "text": "Extremely cute, bear looks just as described with patchwork detail Bear does not come with a Velcro pouch for catnip as some other toys, but I found that spraying the bear with catnip spray is just as enticing for my kitties!",
      "rating": 5.0,
      "verified": true,
      "author": "Krissi Lawton",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "for some reason my cat was not interested in this",
      "text": "for some reason my cat was not interested in this toy,maybe not enough catnip in it",
      "rating": 1.0,
      "verified": true,
      "author": "cooker",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Okay",
      "text": "Check the dimensions before you buy. Super small for the money. It is cute and my cat liked it well enough.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200421
    },
    {
      "title": "Five Stars",
      "text": "great seller, product exactly as described, quick shipping & arrived way before the holiday, couldn't be happier thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Love this toy",
      "text": "Love this toy. Got the tan/brown one. Super soft and super cute. Gave it as a gift to my friends cat. His cat loves playing w it!",
      "rating": 5.0,
      "verified": true,
      "author": "Snowflakes",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "3 stars cause doesnt refill. my cat likes it ...",
      "text": "3 stars cause doesnt refill. my cat likes it but eventually the nip is gonna go stale and im sure i have to buy a new refillable toy since i bought nip thinking this refilled. but so far she likes it.",
      "rating": 4.0,
      "verified": true,
      "author": "ajchobot",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Cat loves it",
      "text": "My cat loves this. My cat Is diabetic and we have to board him when we go out of town. He had a toy something like this but somehow got lost. We always like him to have something with him when we board him. This is prefect and you will always find it close by my cat at home also",
      "rating": 4.0,
      "verified": true,
      "author": "Tamara Venneman",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Cats didn't like!",
      "text": "No catnip to draw the cats to it. It's okay but just not worth the money!",
      "rating": 2.0,
      "verified": true,
      "author": "Kitty R.",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "Good but not durable",
      "text": "My cat absolutely destroyed this but it’s his favorite toy!",
      "rating": 4.0,
      "verified": true,
      "author": "Aleah Holmes",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Adorable and worth the money",
      "text": "I'm not sure who likes this more, my Lab or my kitten. I bought matching bears, this one and the big dog one. My Lab loves to pick the cat one up and carry it everywhere. These have been a huge hit with the animals!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Bach",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "great for both cat and dog",
      "text": "My Yorkie loves small toys and theses were great for both cat and dog to play with!",
      "rating": 5.0,
      "verified": true,
      "author": "KS Young",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Five Stars",
      "text": "Nothing more or less than what you would expect. Just as described in listing.",
      "rating": 5.0,
      "verified": true,
      "author": "IwishIwereaMermaid",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Cute but very small",
      "text": "This was very cute howeveuch smaller than I anticipated! Would not buy again.",
      "rating": 2.0,
      "verified": true,
      "author": "Gina Ferrell",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Kittens favorite toy",
      "text": "My kitten is obsessed with this toy all around. She loves to play with it and throw it around and also carries it to bed with her to cuddle with.",
      "rating": 5.0,
      "verified": true,
      "author": "Fitz",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Four Stars",
      "text": "cat like it for a few days then in the toy box it went..",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170807
    },
    {
      "title": "Cat diggety",
      "text": "Good stuff, as expected from Kong Wubba. Great shipper, fast service in the time of the VID. THANKS",
      "rating": 5.0,
      "verified": true,
      "author": "B.1",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Cat loves it.",
      "text": "Got it to replace an identical unit the cat had pretty much shredded. He loves the thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard R.",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "My kittens are adorable when playing with their bear.",
      "text": "This is such a cute little bear. Although I was hoping my cat might use it instead of me for suckling, his siblings love it. It's the perfect size to grab in one's mouth and provide the kittens enjoyment in their play.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori Thornton",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "Three Stars",
      "text": "I think it's cute but the cat ignores it completely",
      "rating": 3.0,
      "verified": true,
      "author": "maggie weyers",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "One Star",
      "text": "its ok but can't tell if there's catnip in it. it's definitely not refillable.",
      "rating": 1.0,
      "verified": true,
      "author": "tmp",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Cats will enjoy this soft toy!",
      "text": "Our cat enjoys this toy. It is soft and crinkly, and it seemed she likes the catnip smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee L.",
      "helpful_votes": 0,
      "publication_date": 20171217
    },
    {
      "title": "My cat loves it!",
      "text": "My cat carries this around the house! It's so adorable! She LOVES IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Shuten",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Itty bitty thing",
      "text": "Not worth the price, super small . Fits in the palm of ur hand . Cat kind of liked it for a day, after that no interests.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Very cute and sturdy.",
      "text": "Cute little toy but my cat is so particular, he will only play with it if I do.",
      "rating": 4.0,
      "verified": true,
      "author": "Carol L.",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "It looked like it had been hanging on a store shelf or ...",
      "text": "Would of given it 5 stars but when I received the item the cardboard that held the cat toy in place looked old and worn. It looked like it had been hanging on a store shelf or warehouse for a very long time.",
      "rating": 4.0,
      "verified": true,
      "author": "Karen Theodoratos",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Great",
      "text": "I gave this as a gift and was very pleased. It is just the right size and the cat loved it and I'm told she carries around wherever she goes. I have gotten other KONG products and have been pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "marilyn",
      "helpful_votes": 4,
      "publication_date": 20140108
    },
    {
      "title": "Small but effective",
      "text": "Although i did think it was going to be a little bigger it is adorable watching my 3 month old kitty carry the little bear in his teeth. Plus i luckily got the black bear that i wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "So cute & all cats will love it!",
      "text": "Bought one for one of my new kittens because he loves to snuggle, got it and he immediately fell in love with it. We have two other cats in the house (one other kitten and a 2 yr old) they all loved it! We might need to order a few more!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsey Trainor",
      "helpful_votes": 0,
      "publication_date": 20190909
    },
    {
      "title": "Three Stars",
      "text": "Cat loved it the first 2 days, then got sick of it, but it's cute",
      "rating": 3.0,
      "verified": true,
      "author": "Christina521",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Cute Little Soft Bear!",
      "text": "Usually Kong toys are the favorite brand of my fur boy but he has ignored this one since the first day. He may rediscover it as he sometimes does. But it's a cute little bear.",
      "rating": 4.0,
      "verified": true,
      "author": "C.H.",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Cute and decent price",
      "text": "My cat loves his bear, so happy to see this on here for a much cheaper price than pet stores",
      "rating": 5.0,
      "verified": true,
      "author": "DragonBorn",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Cute",
      "text": "Super cute. Small but the kitties love it! As pictured. Wish you could select what color you wanted!",
      "rating": 4.0,
      "verified": true,
      "author": "Clare",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Five Stars",
      "text": "My cat has a ball with this bear, when my dog allows him to play with it..",
      "rating": 5.0,
      "verified": true,
      "author": "Julia McCrea",
      "helpful_votes": 0,
      "publication_date": 20180105
    },
    {
      "title": "Cat is OBSESSED with this!",
      "text": "My roommate's dog stole this, managed to rip both arms off, dragged it through mud constantly, and it's still in weirdly good shape and my kitten's favorite toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Evelyn Mostrom",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Cute and Cuddly",
      "text": "This is a cute, well-made and soft little toy that my cat took to right away. They are currently napping together. Shhh!",
      "rating": 5.0,
      "verified": true,
      "author": "InSeattle",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "Good quality",
      "text": "My kitties love it, play with it all the time. Our dog has stolen it a few times & it’s held up well!",
      "rating": 4.0,
      "verified": true,
      "author": "Lois E Prettiman",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "It pretty but cats weren't interested.",
      "text": "My cats weren't very interested in this toy but I think it's really cute.",
      "rating": 3.0,
      "verified": true,
      "author": "Max",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Favorite cat toy!",
      "text": "Bought for my kitten, June, she loves her “baby” and totes her all around the house combo meow-purring nearly every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Holt",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "She loves it!",
      "text": "My youngest cats new best buddy. A soft and cuddle worthy toy.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Nice",
      "text": "My cat loves this thing, carries it around with her. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Amy C.",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Five Stars",
      "text": "Great toy for the price. My cat snuggles with this thing all the time",
      "rating": 5.0,
      "verified": true,
      "author": "Kailee",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "This toy would be good for a hamster",
      "text": "This toy is too small for my cat. This toy would be good for a hamster. My cat was not interested in it at all.",
      "rating": 1.0,
      "verified": true,
      "author": "yennefer",
      "helpful_votes": 3,
      "publication_date": 20150305
    },
    {
      "title": "Five Stars",
      "text": "One of my cats enjoys the bears. He is able to carry it around. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Brockmann fan",
      "helpful_votes": 0,
      "publication_date": 20160906
    },
    {
      "title": "Cute",
      "text": "My car loves this cute little bear, a definite buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Sammy",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Cats loved it!",
      "text": "Cats loved it, find it in a new room everyday that they keep carrying it around",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Moore",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Soft catnip toy",
      "text": "Soft, fun catnip toy. Perfect size to carry around in your mouth if you are a cat.",
      "rating": 5.0,
      "verified": true,
      "author": "klabaty",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Adorable little bear .",
      "text": "As u can see, my cat is high 😂. He loves the bear . I also bought the kong catnip spray . He went nuts for about 5mins rolling around.",
      "rating": 4.0,
      "verified": true,
      "author": "zuny",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great product",
      "text": "Took a while to come but my cat loves it",
      "rating": 5.0,
      "verified": true,
      "author": "lauren",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Five Stars",
      "text": "cute toy, and bigger than most kitty stuffed animals. received it exactly as pictured.",
      "rating": 5.0,
      "verified": true,
      "author": "R Pearl",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "There is no pleasing cats",
      "text": "I expected as much since I have been a cat owner for many years. If I buy toys I think she'll like she ignores them. Her favorite toy of all times is a piece of pipe cleaner. But I don't blame the toy, I blame my picky cat.",
      "rating": 3.0,
      "verified": true,
      "author": "Nicole Taggart",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "My fur buddy absolutely LOVES his new toy!!",
      "text": "What more can I say than the headline. My cat went nuts for this little critter.",
      "rating": 5.0,
      "verified": true,
      "author": "sherry redd",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Firm Favourite",
      "text": "What is it about cats and catnip! Much loved toy from day one.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Strahan",
      "helpful_votes": 0,
      "publication_date": 20160207
    },
    {
      "title": "Cats love kong!",
      "text": "My cat loves all the kong toys we have purchased for him. He goes crazy for them!",
      "rating": 5.0,
      "verified": true,
      "author": "Yoga cats",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Super cute but only one cat liked it",
      "text": "Super cute but only one cat liked it. I guess the other has a higher tolerance on cat nip.",
      "rating": 4.0,
      "verified": true,
      "author": "Jillian",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "Great product!",
      "text": "Cat doesnt care much for it, but my cat is an idiot so...",
      "rating": 5.0,
      "verified": true,
      "author": "JJ Oliver",
      "helpful_votes": 0,
      "publication_date": 20170208
    }
  ],
  "product_meta": {
    "title": "KONG - Softies Patchwork Bear - Cuddle Plush Catnip Toy (Assorted Colors)",
    "description": "KONG Softies toys combine soft plush fabric with a generous amount of KONG Premium North American catnip to bring out your cat's playful instincts. The crinkle sound and catnip encourage active play, while the ultra-soft fabric makes them ideal comfort toys as well. Covered by KONG Satisfaction Guarantee. See KONG Satisfaction Guarantee document below for full details.",
    "rating": 4.3,
    "feature_bullets": [
      "Premium North American Catnip",
      "Crinkle sound",
      "Cuddly Fabric",
      "Assorted colors",
      "Measures approximately 3-Inch in length"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.3 x 2 x 3.8 inches; 1.28 Ounces",
      "Item model number": "CSF43",
      "Date First Available": "April 12, 2013",
      "Manufacturer": "KONG",
      "ASIN": "B00CXNECFG",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Catnip Toys",
      "Toys",
      "Pet Supplies",
      "Cats"
    ],
    "price": ""
  }
}