{
  "website_summaries": [
    {
      "verdict": "This feature-rich option comes with educational stencils and fun sound effects that assist with number and letter recognition.",
      "pros": [
        "Doc McStuffins theme coupled with the clipboard design is great for role-play",
        "Features 4 learning activities and more than 30 sound effects and songs",
        "Offers more ways to play",
        "Sturdy and durable"
      ],
      "cons": [
        "Pen tether could be a little longer",
        "Requires batteries"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Wish there was volume control, great for expanding creativity",
      "text": "My daughter was very excited to receive this for Christmas. It seems to slide it very well, even after three months of use. The only complaint I have is that there is no volume control and it is very loud. I would love to be able to turn this all the way off so that she could use it in the car without driving me crazy! I love that it comes with stencils because it reinforces her ability to learn her letters and numbers. It also allows for complete creativity on her part when you take away all of the stencils and allow them to draw whatever they want",
      "rating": 4.0,
      "verified": true,
      "author": "BearMama3",
      "helpful_votes": 37,
      "publication_date": 20170306
    },
    {
      "title": "Vtech somehow creates kid proof toys!",
      "text": "I bought this for Christmas of '14 for my then 4 year old. It has now lasted almost 3 years! She recently passed it down to her 2 year old brother, who absolutely adores his \"cipboard\". Vtech consistently puts forth well made products that can take a serious beating and not appear to be any worse for wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Mea",
      "helpful_votes": 26,
      "publication_date": 20170928
    },
    {
      "title": "Great car toy / learning toy",
      "text": "Great car toy. My daughter loves it. 2 areas of needed improvement: The cable is about an inch too short, and the toy would be perfect if the unit could store the included stencils within the toy itself.",
      "rating": 4.0,
      "verified": true,
      "author": "TheRedDog",
      "helpful_votes": 20,
      "publication_date": 20160827
    },
    {
      "title": "Great Gift for Pre-K Kiddos",
      "text": "Out of all of the gifts that my kiddo received from us, this was her favorite. She enjoys tracing the numbers and letters with it. Great educational toy to help preschoolers learn how to draw their alphabet and numbers.",
      "rating": 5.0,
      "verified": true,
      "author": "tattooedsuess",
      "helpful_votes": 11,
      "publication_date": 20160824
    },
    {
      "title": "My 3-year-old's favorite birthday present",
      "text": "My daughter loves playing doctor with her toys like Doc McStuffins does. This toy clipboard has been used so much since we bought it for her months ago. She has a little bit of difficulty with the buttons because they're flat and just look like little pictures to her, but that doesn't stop her from enjoying it. I do wish it had a quieter setting than the lowest volume. Would definitely buy for her again.",
      "rating": 5.0,
      "verified": true,
      "author": "Bree",
      "helpful_votes": 3,
      "publication_date": 20190816
    },
    {
      "title": "Good, but some small problems",
      "text": "This is a good learning toy; the speech is in a clear language, easy to use and fun. The only cons: - The drawing/writing is not sharp (opposite to what shown in the photo), you can't show details. - The lambie (one of the modes) does not continue to sing while drawing (at least with some of these boards). I also saw an on-line review of it on Youtube and the Lambie didn't sing, although the person was still drawing. - As someone has also mentioned here in the reviews, the stylus cord is a little short for a left handed. Still not a big deal, in general, it's fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Neda",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Great toddler toy for car rides.",
      "text": "Originally received as a gift but was subsequently purchased for other friends with 2 year old kids. The toy utilizes batteries and comes with three stencil pads (letters and numbers). The magnetic writing pad recognizes the stencils by a small push pin on the top so it needs to be clipped in properly. Our 2 year old (25month) toddler really enjoys the toy on car rides as they can change stencils. It is a great learning tool through tracing letters and audio reinforcement of what is traced.",
      "rating": 4.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "great learning tool",
      "text": "my niece absolutely loves this! shes 17 months, and loves that it plays music and as she gets older, it has stencils to help teach her letters. as she traces over the letters it actually says the letter shes writing...great learning tool!",
      "rating": 5.0,
      "verified": true,
      "author": "Kat",
      "helpful_votes": 7,
      "publication_date": 20170530
    },
    {
      "title": "Good for learning",
      "text": "I think this is a very good learning toy. We purchased it for a little one who is beginning to need items like this. We think it will be most helpful in her development especially of fine motor skills. It is fun and fairly easy to use so we are pleased with this talk and trace clipboard. She will be able to use this for some time. From what we have seen with other children, this is a five star item and we are happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Ervin",
      "helpful_votes": 13,
      "publication_date": 20150520
    },
    {
      "title": "Nice design",
      "text": "Granddaughters love the Doc tablet. They use them in their play medical center. They can take notes, and learn to spell and then erase and do it all over again. The are small enough to take on the road if you want. They are pretty durable too. They have been dropped and still are intact. They have buttons that play sounds too. They LOVE Doc.",
      "rating": 5.0,
      "verified": true,
      "author": "Saint",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "Nice",
      "text": "I got this as a Christmas gift to go with a McStuffins playset. It seems nice quality. It came with batteries with is always appreciated in a product. I always hate when toys that need batteries don’t come with them. I think this is very good priced for what you get. The ability to trace or draw at will.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love!",
      "text": "Love!! Out of all the presents my daughter got for Christmas, this is her favorite! She’s going to be 2 soon for age reference! She carries it everywhere and loves to doodle on it! Even I love to doodle with it lol and does my 6 year old son! Totally worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "KMRANDALL926 ",
      "helpful_votes": 0,
      "publication_date": 20200204
    },
    {
      "title": "Love this!",
      "text": "Love this! Extremely affordable, I love the little charts that can be added on to trace and teach. Love the musical features! The drawing portion is simple and doesn’t have that weird spread-like look like some toys like this. The only thing would be that the pen attachment could be longer. Love that the pen can go on top just like an actual doc/board.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheyenne Scott-Budd",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Cheaply made",
      "text": "Got this for my daughter for Xmas and we got it out of the box and put batteries in it. The first thing I noticed was the part you wrote on almost broke when inserting the batteries. My child is left handed and the stylus is on the right side and the string is so short she can barely write anything on the board. To me this product is not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Unsatisfied",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Perfect gift",
      "text": "Gave to my 2 year old granddaughter for Christmas and she played with it all day. She keep sitting at her little desk and drawing and scribbling on her new VTech Doc McStuffins Talk and Trace. Watching her play with it, I would say this is a very good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Smalls",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Great Toy and still works after years.",
      "text": "I bought this for my granddaughter when she was 2 and a big fan of Doc. She loved it then and still loves it at almost 6. My grandson, a year younger has also lived playing with it all these years. It has always worked, withstood being dropped and banged around. One of the best things I have for the kids.",
      "rating": 5.0,
      "verified": true,
      "author": "JoGo",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "t is small enough to take on road trips in the car, but also big enough to draw several things without having to erase",
      "text": "I purchased this for my 2 year old niece as a Christmas gift and she absolutely loved. It is small enough to take on road trips in the car, but also big enough to allow them to draw several things without having to erase the board. In addition, this has also helped her with learning how to trace letters. Great buy",
      "rating": 5.0,
      "verified": true,
      "author": "DKD",
      "helpful_votes": 5,
      "publication_date": 20151113
    },
    {
      "title": "This has sound YAY!",
      "text": "This is so precious!!! My daughter is a huge Doc fan, and she has loved this and carried it around EVERYWHERE. Honestly I hadn’t noticed when I ordered it that it has sound too!! It’s awesome :) good buy!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Wefed221",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Sketch and Sing!",
      "text": "Doc Mc Stuffins sketch pad! I researched this lttle baby on Amazon and got it for my daughter's 2nd birthday. She loves to sketch but even more, to erase. HA HA. She enjoys the sketch pad which by the way interacts with her by talking and singing songs. This toy is a great for little artistic children.",
      "rating": 5.0,
      "verified": true,
      "author": "Brianna Rachel",
      "helpful_votes": 5,
      "publication_date": 20150930
    },
    {
      "title": "New fav toy!!!!",
      "text": "Love it!! Informative, encouraging, positive reinforcing of learning letters numbers etc. comes with three stencils and is great for on the go or toting around.",
      "rating": 5.0,
      "verified": true,
      "author": "KO",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Didn’t really care for this wouldn’t buy again.",
      "text": "Was really disappointed in this. Felt like the quality wasn’t fiery good. It’s also hard to erase. The writing isn’t as clear as a regular magnet doodle board. We have both and she always picks the doodle board over this one. She rarely plays with this one",
      "rating": 2.0,
      "verified": true,
      "author": "Sherry Walling",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Encourages Tracing Numbers and Letters",
      "text": "While my daughter winds down for bed, I let her play on her \"noodle\" (as she calls it...a.k.a. magna doodle). Although the volume is pretty loud and I wish it could be turned down more, I love that it's not a screen and it encourages her to trace her numbers and letters. She loves using it and finds it engaging.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Fun learning toy",
      "text": "I gave this to my daughter as one of her birthday gifts and she loves it. It has sounds and came with multiple different face plates to use as well so it’s gauged toward learning and not just doodling. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany ",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Good for the right kid",
      "text": "I bought this for my three year old niece. I had to return the first one I purchased because it was defective. Although I was reluctant to replace it, I'm glad I did because she has been using it regularly to trace numbers and letters ever since. She has older brothers who are learning how to write and she is so proud that she is able to \"write\" letters as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Aquaray",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "She is at the perfect age for it",
      "text": "Got this for my 3 year old and she absolutely LOVES it. She is at the perfect age for it. She knows all her letters and is learning to write them now. This has stencils that let her trace the letters. She gets so excited when she receives positive reinforcement from the clipboard. It has several \"games\" on it and it does come with batteries. This was a great buy for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Janette",
      "helpful_votes": 2,
      "publication_date": 20151221
    },
    {
      "title": "Learn through play",
      "text": "Great for play Dr. Our little one got this an a Dr bag play set and has been checking us in the office and checking our health. The stencils make great practice for a three year old learning to write and you can remove them for quick script writing 😄",
      "rating": 5.0,
      "verified": true,
      "author": "Malfamof7",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Easy to travel with",
      "text": "Only one tracing stencil holds in the clip at a time. If they fit in the back for traveling it would be perfect but small and compact and a cute toy",
      "rating": 5.0,
      "verified": true,
      "author": "Alyssa Monnette",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "My daughter loves it",
      "text": "She was going of playing with it all day it actually gave me a break from her cuz she was content with it",
      "rating": 5.0,
      "verified": true,
      "author": "Rico.G",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Great quality and adorable!",
      "text": "My daughter loves doc McStuffins and this magnetic easel is fantastic for her to draw on! It works perfect every time she uses it and the sounds on it are adorable! I would buy this again for her in a heartbeat!",
      "rating": 5.0,
      "verified": true,
      "author": "Amber N",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "It works for us",
      "text": "More interactive than the cheaper version of talk and trace (Fisher Price) which we also have but it wasn't as much as I expected from a Vtech toy. The vocals have nothing to do with what the kids are actually drawing. I would like the stencils to have a place to store with the unit. These little writing pads are a big travel hit for my kids and the Doc McStuffins theme made it even better in her eyes.",
      "rating": 4.0,
      "verified": true,
      "author": "LVATTY",
      "helpful_votes": 2,
      "publication_date": 20150109
    },
    {
      "title": "Fantastic product. The main advantage is the size",
      "text": "Fantastic product. The main advantage is the size. It is nice and small for toddlers. The stenciled are a great learning tool. It should be noted it doesn't come with batteries. The only reason for not giving 4 stars is that sometimes the image doesn't stay very long.",
      "rating": 4.0,
      "verified": true,
      "author": "roobrr",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Pretty great!",
      "text": "My Doc McStuffins loving 3 year old thinks this is the greatest! It is fun and educational. The only downside is that the batteries die fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Gregg lees",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Educational But Not Obnoxious........... ; )",
      "text": "Got this Doc McStuffins toy on a lightning deal for my granddaughter and she loved it! Arrived as pictured and described. It came with batteries already installed and ready to go. Perfect gift before a long drive up to her great grandparents' house. Love educational gifts and this one is a fun one that has sound but nothing terribly annoying (she rode in my car, lol)! Buy with confidence. Smile. Hope this is helpful!",
      "rating": 5.0,
      "verified": true,
      "author": "MariamG",
      "helpful_votes": 0,
      "publication_date": 20150418
    },
    {
      "title": "Great toy",
      "text": "A little expensive but super cute! I love the stencils and the interactive songs and sayings. My daughter uses it daily and it’s held up perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "C",
      "helpful_votes": 0,
      "publication_date": 20190704
    },
    {
      "title": "My 3 year old loves it",
      "text": "She carries it around and plays with it all day. I don’t know if there’s a flaw with mine but you cannot store the cards in or on it which would be nice but otherwise my kid loves this thing",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny12345",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Wonderful gift!",
      "text": "Wonderful gift for my 27 month old great neice!! She adored it and it says something special about a toy when she is still playing with it over a month after Christmas! And this is a child who has way to many toys, even received a powered BMW but I don't think it hold any more appeal than her Doc McStuffins play tablet that she carries everywhere she goes, esp. in the car!! Thanks Amazon and for the great price tooo!! \"I draw you a picture Aunt Donna\" lol!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DKBB",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Bought for a gift",
      "text": "I bought this for a gift but once I received it I wanted to keep it for my 2 year old. It's so cute and looks like a lot of fun. Small enough to bring with you in the car for travel.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica C",
      "helpful_votes": 3,
      "publication_date": 20161001
    },
    {
      "title": "Overall good child gift",
      "text": "Good product overall, plastic stencils bent very easily and weren't usable after slight bend.",
      "rating": 4.0,
      "verified": true,
      "author": "Tawney C.",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "It's pretty well loved now",
      "text": "Received it as a gift last Christmas. My toddler just loves it. Doesn't really use the stencils, but loves drawing on it and listening to melodies and sounds it makes. It's pretty well loved now, but still works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Anon 716",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Excellent",
      "text": "Very very nice. Price is excellent,well worth the money. All around a very fun and great toy.",
      "rating": 5.0,
      "verified": true,
      "author": "alissa johnson",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Great for kids, but quality could be better.",
      "text": "Daughter loves it (2 years old) but it doesn't draw very clear with or without templates. I'll say, though, the templates are really cute and great for learning. I still like it, I just don't love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Nakia Tamika Taylor",
      "helpful_votes": 2,
      "publication_date": 20170610
    },
    {
      "title": "Does not erase clean easily.",
      "text": "Have to slide the nob 5-6 times to fully clean the board.",
      "rating": 2.0,
      "verified": true,
      "author": "SUPER BUYER",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Make believe play fun and drawing",
      "text": "My 2 year old daughter loves to use this while playing doctor.",
      "rating": 5.0,
      "verified": true,
      "author": "Amarie",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Keeps your little one busy.",
      "text": "There are many great aspects that I love about the Vtech Doc Mcstuffin game . It has helped my granddaughter with her learning to write . She loves drawing on it. It is also great toy in the car or in the Dr office to keep them busy and occupied. It comes with differnt sketch boards to put I. I would definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris S.",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Great purchase",
      "text": "Purchased for a 2 year old. She loved everything about it. Plus it’s great to be used while traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Brown",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Doc McStuffins’ Clipboard a Big Hit!",
      "text": "The 4-year-old girl who received the Talk and Trace Clipboard loves Doc McStuffins and the clipboard as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma Jane",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Good purchase.",
      "text": "My daughter loves it. Not much to say about it. Just a little magna doodle style toy. It has stencils with the alphabet on it that are kind of neat. Educational",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Doc fan",
      "text": "My daughter is a huge fan of Doc McStuffins cartoon. I got this for her birthday she was so excited it it goes everywhere with us in the car to grandparents house to inside",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa H.",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Teaches them to write letters and numbers",
      "text": "My daughter absolutely loves this clipboard. It really teaches them how to write their letters and numbers. Definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Granddaughter loves this",
      "text": "I highly recommend this because for the money it had a lot of interactive features. VTech products are amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Doglover",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Five Stars",
      "text": "My niece absolutely loves this. She calls it her \"diagnosis\" and is always ready to play doctor",
      "rating": 5.0,
      "verified": true,
      "author": "Jacklyn",
      "helpful_votes": 2,
      "publication_date": 20170808
    },
    {
      "title": "As electronic toy is great. Three extra pieces with the numbers and the ...",
      "text": "As electronic toy is great. Three extra pieces with the numbers and the alphabet is coolest. But the part writing or drawing is tiny, not much to create. We have a nursery with 8 kids and all of them bored after spending numbers and the alphabet because of the slate so tiny and they can't draw anything.",
      "rating": 4.0,
      "verified": true,
      "author": "amarillito53",
      "helpful_votes": 2,
      "publication_date": 20150108
    },
    {
      "title": "I purchased this clipboard as a third gift for my ...",
      "text": "I purchased this clipboard as a third gift for my grand daughter who's turning 3 in a few days. The package was dropped in the severe stormy rain and by the time we got home the box was soaking wet. It's very unfortunate that all the three gifts for my grand-baby are soaking wet. With the weather predictions, I assumed someone could have thought of using a water proof paper to protect the valuable content.",
      "rating": 3.0,
      "verified": true,
      "author": "VOICEOFGRACE",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "fun for lil one!",
      "text": "was told by my daughter that her lil girl, (my granddaughter loves it)! Plays with it daily. Sent as a birthday gift.",
      "rating": 5.0,
      "verified": true,
      "author": "suemcnabb",
      "helpful_votes": 2,
      "publication_date": 20170424
    },
    {
      "title": "Great toy for Doc McStuffin lovers!",
      "text": "Our 3 year old granddaughter loves Doc McStuffins, including all things Doc McStuffins related. We gave her this for Christmas and she loves it. We love it as well because it is a great car toy and keeps her happy and occupied while driving the 90 miles between her home and ours.",
      "rating": 5.0,
      "verified": true,
      "author": "mimiofmany",
      "helpful_votes": 2,
      "publication_date": 20150424
    },
    {
      "title": "Great for my 4 year old",
      "text": "I love that you can change the stencils. From alphabet to numbers. The different settings helps my four year old to see and hear what she writes. Even without the stencils it knows what she writes",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Tiny",
      "text": "We havnt used it yet, but i thought it was going to be bigger. I guess my friend's kid got the bigger version of this bc its much wider.",
      "rating": 4.0,
      "verified": true,
      "author": "K",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Perfect for your little Doc McStuffins",
      "text": "My daughter has a full doctors kit since she loves Doc McStuffins and this was a great add on. She loves writing up her patients on this and I no longer go lots of paper for her diagnosis. It also comes with stencils and my daughter went from being ok with her writing to being able to write her whole alphabet quite neatly. It wasn't what I bought it for but was a great added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Spectr",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "3-4you kids toy",
      "text": "I believe this is worth five stars and have expectations of five star deliveries for at least 3 to 4 hours five star deliveries. Thank you very much kind sir",
      "rating": 5.0,
      "verified": true,
      "author": "JustMe",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Product is as described and pictured",
      "text": "Bought this for my two-year-old. She loves it! When she's not actively drawing, she'll be walking around with it in her hand.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "The cord is too short",
      "text": "Only problem is, my grand daughter is left handed and the plastic cord was extremely short, so she was not able to write. We had to separate it by cutting it. Unfortunately, now we cant find the pencil :( That cord has to be longer. Everything else worked perfectly.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle Panton",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Great gift!",
      "text": "Gave this to my son's friend (3 years old) for her birthday. She loves Doc and this was the perfect gift! Works well and is very interactive.",
      "rating": 5.0,
      "verified": true,
      "author": "GabPC",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Kids enjoy it!",
      "text": "Kids love this! Easy for a two and a half year old to play with, even if they do not know letters or numbers...",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Mahoney Kreidl",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Small- but a great toy",
      "text": "This was a much smaller pad than I was expecting (I didn’t read the measurements before though..)- but other than how small it is- it works great and my toddler loves it! The stencils work well too",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "Great buy, would buy again",
      "text": "My daughter is obsessed with it. Been carrying it around using it for about 2 weeks now. She’s definitely a fan! Good quality",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Lewis ",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Makes a great gift.",
      "text": "Got this on a whim while looking for a decently priced gift for a 3 year old girl. She loved it, so glad it was a hit.",
      "rating": 5.0,
      "verified": true,
      "author": "akssomebody",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great product,  ugly box",
      "text": "it was for a present and the box is ugly carton",
      "rating": 3.0,
      "verified": true,
      "author": "Luis Valverde",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "My niece LOVES this thing!",
      "text": "My 2 year niece loved this Christmas gift that's still being played with months later! It's the perfect size for her little hands and she loves to draw, so this allows her to do so without making a mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Alyson",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Safety and quality.",
      "text": "My 3rd great granddaughter tore into this She started using it right away. Was having a grand time drawing.",
      "rating": 5.0,
      "verified": true,
      "author": "Lupe Saladin",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Good for the 5 year old to learn the alphabet.",
      "text": "My three year old great granddaughter likes just scribbling and erasing but the 5 and 7 year olds enjoy using it also.",
      "rating": 5.0,
      "verified": true,
      "author": "Pauline Joubert",
      "helpful_votes": 0,
      "publication_date": 20180113
    },
    {
      "title": "She like this also because she can take it with her ...",
      "text": "My daughter loves Doc McStuffins. She has added this to her doctor kit. She loves the clip board and there is lots of learning on it too. She like this also because she can take it with her in the car and carry it around.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff and Kirby",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "Arrived broken",
      "text": "Item arrived broken. Was unable to return as I purchased it early for a birthday gift and the return window has passed. Was unable to give it as a gift and am just out the money. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "BDubs",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Nice quality. Great if your child loves the show!",
      "text": "Great little interactive magnetic draw pad. My 17 month old loves the show amd loves running around drawing on her little Doc Mcstuffin's clipboard.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc P.",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Great gift",
      "text": "We gave it to a friends daughter (2) who thinks she is a doctor and well - she is obsessed!",
      "rating": 5.0,
      "verified": true,
      "author": "ZT",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Its fine, just a little small for my liking",
      "text": "Its an ok product but the drawing surface is really small, so my daughter doesn't really play with it much at all. Wish it was bigger overall.",
      "rating": 3.0,
      "verified": true,
      "author": "Brittny Doolittle",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Clipboard was okay",
      "text": "Box arrived damaged but amazon was able to fix that. The Clipboard is okay but it felt a little flimsy.",
      "rating": 4.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20181122
    },
    {
      "title": "Daughter loves it!",
      "text": "She loves it. Wants me to draw and thinks it's hilarious to immediately erase everything I do.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Great toy for on the go",
      "text": "My 2 year old granddaughter loves it! Easy for her to use and I love that the pen is attached, great for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200130
    },
    {
      "title": "Fun & Easy",
      "text": "My 2yr old loves to draw and scribble on it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald  J. Williams",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "great gift for youngsters",
      "text": "my 4 year old loves this as in the other reviews would be nice if the templates had some way of clipping to the board to keep from getting lost but think I will be able to fashion something that will keep them together will help her to learn how to write her numbers and letters better while she has fun so is a win win",
      "rating": 5.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "Five Stars",
      "text": "Great quality as if you bought it at a Toys R Us store, great priced",
      "rating": 5.0,
      "verified": true,
      "author": "ErikaShanice",
      "helpful_votes": 2,
      "publication_date": 20170608
    },
    {
      "title": "Christmas Gift",
      "text": "Arrived on time. Look Great. But, a Christmas gift. The one receiving has not seen yet.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Howard",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Eeh",
      "text": "This was fun for a little bit but it wasn't made well. Nothing written or drawn on it was clear so the photo provided in the description is inaccurate. It was very cheaply made and didn't work like it was supposed to",
      "rating": 2.0,
      "verified": true,
      "author": "Courtney Dunlap",
      "helpful_votes": 0,
      "publication_date": 20160416
    },
    {
      "title": "Simple and nice, most of all not expensive",
      "text": "Simple and nice , most of all not expensive. The kids love playing with it .",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin M. Wilkin",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "She loves it.",
      "text": "Bought this for my 3 year old granddaughter, she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Arrived super fast. Great price",
      "text": "Arrived super fast. Great price. So happy to have purchased. Haven't opened it yet because it's a Christmas present.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerri",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Very nice toy",
      "text": "My daughter love it, now she plays the doctor and at the same time is learning to trace the ABC, Numbers and shapes",
      "rating": 5.0,
      "verified": true,
      "author": "Dary",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Ehhh",
      "text": "Not really very good. It does not write good and is not durable at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs Mrabet",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Love!",
      "text": "My toddler loves this toy! Got it for her during her 4 open heart surgery at hospital stay ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "QueenB",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Fun little toy. Needs a longer cord for pen.",
      "text": "I really like the doc mcstuffins toys. My daughter absolutely loves this clipboard also. The biggest downfall with it is the cord it makes it hard to draw on the lower left corner since the cord is so short. Feels limiting in motion when you trace letters and shapes with the included stencils.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Stahlnecker",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "3 y/o Daughter Loves It...",
      "text": "Daughter loves this and carries it all around \"x-raying\" her stuffed animals",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "This is a very good learning toy",
      "text": "This is a very good learning toy.I bought it for my 20 months daughter.This is awesome for teaching the letters and numbers and learning how to write.She loves hearing Doc McStuffins' encouraging voice as she writes on the erasable board.she loves to draw and erase then do it all again.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ G",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Great present for a 3yr old",
      "text": "Amazin gift for my 3year old! I for sure would recommend it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190124
    },
    {
      "title": "Nice product!",
      "text": "Perfect for a 3 year old to start practicing her numbers and letters.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Sloan",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Not what I thought.",
      "text": "Very disappointed. It only has 3 plastic plates where the child can trace the abc’s and numbers. I thought it had more interaction.",
      "rating": 2.0,
      "verified": true,
      "author": "Kathy C.",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Darling interactive toy",
      "text": "Darling toy! It helps my daughter practice her letters and numbers and is interactive. She is a big fan of Doc (as are we!) and this was the perfect toy. She is 3.5 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Got a defective one",
      "text": "Ordered this for daughter's birthday and it stopped erasing in less than a week. I obviously got a defective product so a replacement was ordered. Well see if the new one holds up.",
      "rating": 2.0,
      "verified": true,
      "author": "Gee",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Love it",
      "text": "My grandaughter loves it. She takes it with her everywhere.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Doc McStuffins a must",
      "text": "Just what this great niece wanted in her easter basket",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine J Matteson-Davis",
      "helpful_votes": 2,
      "publication_date": 20170503
    },
    {
      "title": "This was a gift for our great granddaughter. She is two and loves it so ...",
      "text": "This was a gift for our great granddaughter. She is two and loves it so glad we got it for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20180711
    }
  ],
  "product_meta": {
    "title": "VTech Doc McStuffins Talk and Trace Clipboard",
    "description": "Product Packaging:Standard PackagingThe Doc is in, so let's get learning with the talk & trace clipboard by VTech and Disney. This electronic clipboard has 4 Learning activities and 15 playful melodies. Three detachable stencils paired with our letter recognition technology teach letters, numbers, early writing skills and health topics. Plus, Doc McStuffins joins the learning fun by providing encouraging messages.\n\nFROM THE MANUFACTURER\nThe Doc is in, so let's get learning with the Talk & Trace Clipboard by VTech and Disney. This electronic clipboard has 4 learning activities and 15 playful melodies. Three detachable stencils paired with our letter recognition technology teach letters, numbers, early writing skills and health topics. Plus, Doc McStuffins joins the learning fun by providing encouraging messages.",
    "rating": 4.6,
    "feature_bullets": [
      "Disney Doc McStuffin's kids electronic clipboard has 4 learning activities and 30+ playful melodies and sounds",
      "Kids drawing toy comes with 3 detachable stencils paired with letter recognition technology that teach letters, numbers, writing skills, and health topics",
      "Doc McStuffins and her friends engage and encourage your child as they play and learn; magnetic drawing board is a great early education center",
      "The stylus is perfectly sized for little hands; learning toy teaches hand coordination and promotes imagination",
      "Pre-K learning toy is intended for kids 2 to 5 years of age; 2 AAA batteries are included for demo, use new batteries for regular use"
    ],
    "specifications": {
      "Product Dimensions": "6.62 x 9.56 x 1.18 inches",
      "Item Weight": "1 pounds",
      "ASIN": "B00CMNX5VE",
      "Item model number": "80-139700",
      "Manufacturer recommended age": "24 months - 5 years",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "4.6 out of 5 stars1,344 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "May 2, 2013",
      "Mfg Recommended age": "24 months - 5 years",
      "Manufacturer": "V Tech"
    },
    "categories": [
      "Drawing & Writing Boards",
      "Toys & Games",
      "Arts & Crafts"
    ],
    "price": 19.99
  }
}