{
  "website_summaries": [
    {
      "verdict": "A delicious honey from a reputable company that focuses on quality. The one to get if you want raw honey and great flavor.",
      "pros": [
        "Natural and unfiltered",
        "From a brand that's been making pure honey since 1972",
        "Tested for impurities including pesticides and herbicides",
        "Has a loyal following of repeat customers that rave about the quality and flavor"
      ],
      "cons": [
        "Some bottles arrived damaged and/or with broken seals",
        "A few reports of crystallized honey upon arrival"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Taste!",
      "text": "Delicious! I mix with cider vinegar in warm water every am. 2tbs vinegar 1tsp honey. Very health beneficial.",
      "rating": 5.0,
      "verified": true,
      "author": "John R. Shevak",
      "helpful_votes": 105,
      "publication_date": 20170316
    },
    {
      "title": "Raw? Unfiltered?",
      "text": "Raw? Unfiltered? It clearly has been filtered, or else it would be raw, and unfiltered corn syrup! No honey that's raw and unfiltered, is transparent and liquid at 65-75 degrees room temperature! I have reasons not to trust their marketing!",
      "rating": 1.0,
      "verified": true,
      "author": "H B",
      "helpful_votes": 85,
      "publication_date": 20171211
    },
    {
      "title": "I don't believe this is 100% honey.",
      "text": "I believe this product contains additives. I don't believe it's 100% honey. It dissolves in water too easily. It will rapidly crystallize. It will not burn which indicates water concentration greater than 18%",
      "rating": 1.0,
      "verified": true,
      "author": "Doc",
      "helpful_votes": 39,
      "publication_date": 20190111
    },
    {
      "title": "How am I suppose to use \"EAT\" that?",
      "text": "How am I suppose to use \"EAT\" that? Received crystallized as seen in photos! I tried digging into bottle to get some \"crystallized honey\" and it's hard word for one spoon frozen like \"crystallized\" honey. That's not the way I'm used to pure honey on my toast, my tea or over anything. I tried putting bottle in pot with boiling water. Well, plastic bottle melted and honey still frozen like \"crystallized\". I don't like it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 33,
      "publication_date": 20181216
    },
    {
      "title": "Is this bottle old?",
      "text": "This is the same honey I have always used. This bottle appears to be old. It is crystallizing which I have never had happen. Perhaps it’s very old and should not have been sold. As you can see from the photo I have to continue to heat it to get it to pour.",
      "rating": 1.0,
      "verified": true,
      "author": "Vinegaroon",
      "helpful_votes": 32,
      "publication_date": 20180908
    },
    {
      "title": "Favorite honey ever.",
      "text": "Love this honey! Spout has a valve that helps control flow and keep honey fresh. We use this as a sugar substitute and it’s the perfect amount of sweet.",
      "rating": 5.0,
      "verified": true,
      "author": "Miki B",
      "helpful_votes": 34,
      "publication_date": 20180117
    },
    {
      "title": "I love eating honey and i have tried several brands",
      "text": "I love eating honey and i have tried several brands. First of all this tastes aweful. Some say it has a smokey flavor however it is terrible and it doesnt mix well with your favorite dishes. Also, this causes headaches. Which is strange because its suppose to be healthy for you but its not. I would recommend you buy honey from a local farm. I had high hopes for this honey, however this is garbage. Save your money and buy local.",
      "rating": 1.0,
      "verified": true,
      "author": "vishal",
      "helpful_votes": 26,
      "publication_date": 20180527
    },
    {
      "title": "Can't recommend. Too strong a taste. Crystallized too soon",
      "text": "I'm a big honey consumer. I usually buy from California farmers at local farmers markets. I know a half dozen of the farmers and have tried them all. Wildflower, Rosemary, Clover etc. This one was significantly cheaper, so I figured it was worth a try. It wasn't. It has a strong, unpleasant taste and it crystallized much sooner than the other honeys I've had.",
      "rating": 1.0,
      "verified": true,
      "author": "SMN",
      "helpful_votes": 18,
      "publication_date": 20181213
    },
    {
      "title": "Amazing honey!!!",
      "text": "Amazing honey!!! Once I tried the raw & unfiltered honey, I can never go back to the \"regular\" ones in the supermarket. It tastes so good. I love the bottle design, where the open has flaps to prevent dripping when holding the bottle upside down and pour the honey. I'm going to try the organic version next. The only downside is, it doesn't tell you what kind of flower or region Nature Nate's is using. It only says using American bees.",
      "rating": 5.0,
      "verified": true,
      "author": "comptech",
      "helpful_votes": 22,
      "publication_date": 20180205
    },
    {
      "title": "How does Garbage Nates have such great reviews?",
      "text": "Wow, this has to be the worst tasting honey ever! And it’s consistancy is runny, worst I’ve ever seen as well. Not sure where all the great reviews and hype are coming from? I seen this garbage being sold in Costco now too. Just bought some YS Eco Bee Farms honey, supposed to be superior to all others on the market, we’ll see. Has to be better than Garbage Nates. Oh yeah, I also tried Garbage Nates “organic” version, it was much better. However, half way through it totally crystalized.",
      "rating": 1.0,
      "verified": true,
      "author": "Sunnie Silva",
      "helpful_votes": 17,
      "publication_date": 20180930
    },
    {
      "title": "Possible Food Poisioning",
      "text": "This honey crystalized a week or two after I received it, and when I ate it, it had a very bad taste. About 6 to 8 hours after eating it, I had a temperature of 101.1 Fahrenheit and uncontrollable vomiting. I believe this honey gave me food poisoning.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazonConsumer",
      "helpful_votes": 21,
      "publication_date": 20180817
    },
    {
      "title": "NOT raw honey according to the class action lawsuit!",
      "text": "Class action lawsuits filed because it’s NOT raw honey , they heat it up so it loses the health benefits . What a crappy company and I wish I would have googled this company before buying !",
      "rating": 1.0,
      "verified": true,
      "author": "Kimberly Kelsey",
      "helpful_votes": 13,
      "publication_date": 20190625
    },
    {
      "title": "Honey Leaked From Container",
      "text": "The taste of this honey is fine. The PROBLEM is that the cap was loose on the container. The inner cardboard seal was not sufficient to prevent the leak, which was about a tablespoon of honey. There were two books also in this order, and it took a half-hour to clean them up. Maybe Amazon is to blame. The honey should have been packaged separately in a ziplock bag or something similar. BUT if the cap had been securely tightened this would not have occurred. I blame the manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "Thomas LlewellynTop Contributor: Philosophy",
      "helpful_votes": 14,
      "publication_date": 20181022
    },
    {
      "title": "Nightmare experience",
      "text": "I purchased 4 of these in one order and received one of them leaking which created a horrifying disaster of a mess that I am still not done cleaning up. By the time I realized what the package was and why it was sticky the honey was already starting to spread all over my house. I doubt this is in any way Nature Nate's fault but I figured I ought to record my experience and let others know that there is a risk to ordering this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew Lambertson",
      "helpful_votes": 9,
      "publication_date": 20190226
    },
    {
      "title": "this is corn syrup",
      "text": "I just had some of this and it tasted like corn syrup so I googled it and found that there is a class action lawsuit against them for not using 100% honey as it states on the bottle. Calling amazon now to get a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathryn L. Tate",
      "helpful_votes": 9,
      "publication_date": 20190917
    },
    {
      "title": "Broken Seal on container and loose cap on jar - small leakage...",
      "text": "I like/ love the product - I just ordered it and it came in the mail/box along with some other items I ordered. The cap on the bottle came off when I touched it - and the seal was broke over the honey - there was a little bit on the container itself but not much - I didn't feel comfortable eating it - because of the seal being broken and the cap partially off, and so I threw it out. Needless to say, I won't be ordering this product again from Amazon - nor may I be ordering any food stuffs from Amazon again",
      "rating": 1.0,
      "verified": true,
      "author": "karen kernan",
      "helpful_votes": 10,
      "publication_date": 20180711
    },
    {
      "title": "false advertising",
      "text": "You need to google this and find out that there is a lawsuit against this company for false advertising (they heat the honey destroying the enzymes and benefits of REAL raw honey) and also that it contains corn syrup in it. Such is the case with many companies today that only care about money and not people!",
      "rating": 1.0,
      "verified": true,
      "author": "Prophet",
      "helpful_votes": 7,
      "publication_date": 20200115
    },
    {
      "title": "Praise the Lord and Pass the Honey",
      "text": "I'll tell you what, this honey is some outrageously good stuff, but I could do without the religious proselytizing on the bottles. I tried a couple other brands for this very reason; I thought surely there are other outfits out there that sell supremely delicious raw honey minus the preachin'--and indeed, there are many. But Nate's is better. Nate's is the best @&$#% honey I've ever tasted, and I've actually been craving it ever since I ran out several months ago. So yeah, this old pagan is sheepishly back for another bottle. I hope Nate is doing some real Christ-like good works with whatever percentage of his sales goes to charity.",
      "rating": 5.0,
      "verified": true,
      "author": "Ondine",
      "helpful_votes": 6,
      "publication_date": 20180720
    },
    {
      "title": "Thumbs up",
      "text": "I bought this to use for my DIY products (body wash, hair pomade, etc), and funny enough, my mom bought it the same day from the grocery store for kitchen use. So far, I have only used this in my lemon tea, but I'm happy to say it's the most delicious honey I have ever used. I will update on its use with my body products, but I hope it's just as good as it tastes.",
      "rating": 5.0,
      "verified": true,
      "author": "orlowsy",
      "helpful_votes": 12,
      "publication_date": 20180125
    },
    {
      "title": "CLASS ACTION LAWSUIT",
      "text": "Nate's Natural Raw Honey is NOT RAW as advertised !!!!!! Heated to higher temperature thus KILLING off the good stuff !!!!!! Also when tested it found that there were added syrups along with other NOT NATURAL ADDITIVES !!!!!! If you don't believe this is true then look up the lawsuit for yourself....Just gonna purchase a more honest brand....VERY DISAPPOINTED NATURE NATE FOR PUTTING PROFITS BEFORE THE PUBLIC !!!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "El",
      "helpful_votes": 7,
      "publication_date": 20190425
    },
    {
      "title": "Too sweet",
      "text": "Product is much sweeter than the raw honey I usually buy on amazon but wanted to try this more pourable one. It’s a good value and my partner likes the control of the no drip spout. The packing was terrible and one of the lids was broken. Since I bought two, I will use the lid from the first one when I switch over. I don’t know if I will purchase again or not. On the fence about this honey and the poor packing job.",
      "rating": 3.0,
      "verified": true,
      "author": "rosegardener",
      "helpful_votes": 8,
      "publication_date": 20180320
    },
    {
      "title": "Old honey",
      "text": "I bought this honey in the middle of October. It started crystallizing the first week of January. Just to get a 1/2 teaspoon of honey, I had to spend twenty minutes warming up the bottle in hot water. I won't buy anything from Nature Nate's again.",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria Meredith",
      "helpful_votes": 8,
      "publication_date": 20190208
    },
    {
      "title": "DO NOT BUY THIS IS FAKE HONEY!",
      "text": "This is fake honey! 100% fake! DO NOT BUY! It dissolves immediately in ice cold tea. It is runny like high fructose corn syrup. I poured my tea out after the “syrup” dissolved immediately!",
      "rating": 1.0,
      "verified": true,
      "author": "Susan Hume",
      "helpful_votes": 10,
      "publication_date": 20180808
    },
    {
      "title": "Fraudulent product/Class Action Lawsuit against Nature Nate's",
      "text": "I wish I'd known before buying the product that there's a class action lawsuit against Nature Nate's Honey, claiming it isn't raw OR 100% honey. Read Brigette Honaker's article about it. Also, the company's verse from Psalms and a comment about God on the label really offended me. Keep your RELIGION out of my FOOD!!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20200530
    },
    {
      "title": "Broken seal",
      "text": "Broken seal, the cap doesn't close properly probably will go bad before I use it all.... The broken piece is no where in the box either.. so it must have been broken before shipment.",
      "rating": 1.0,
      "verified": true,
      "author": "Emily Williams",
      "helpful_votes": 8,
      "publication_date": 20181130
    },
    {
      "title": "Great Honey, Great Price - But the Bottle Cap Needs Fixing",
      "text": "This is excellent honey at a great price. this has become my go to honey. I do have one minor complaint and it has nothing to do with the honey itself. Twice now the cap for the bottle has been broken. The most recent one was broken so badly that it was not usable. Fortunately, I still had the previous bottle and simply took the cap off that one and put it on the new one. Amazon or the original supplier should take a look at why the cap has been delivered broken twice now.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Guinn",
      "helpful_votes": 9,
      "publication_date": 20170627
    },
    {
      "title": "Great product but poorly packed",
      "text": "Great honey, great taste , will buy again but it always comes poorly packed and cap or seal broken , I know the bubble wrap envelope helps you keep the cost low but maybe if you wrap the bottle on some extra bubble wrap it'll help withe the problem , seem like other buyers experience the same",
      "rating": 2.0,
      "verified": true,
      "author": "Randy from FL",
      "helpful_votes": 11,
      "publication_date": 20170517
    },
    {
      "title": "A great honey in a well-designed bottle.",
      "text": "I first tried Nature Nate's honey from a local farmer's market and I loved the flavor and the bottle so much I found it on Amazon, where it has gone into my \"repurchase\" list. It's a very nice tasting honey for tea and for cooking. As an added bonus, the bottle and the pour spout are among the best I've found in bottled honey. I'm able to dispense exactly the amount you need with little or no excess dripping.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessamynn",
      "helpful_votes": 8,
      "publication_date": 20180127
    },
    {
      "title": "Really question it's quality.",
      "text": "The last two orders I have received have crystallized within days of receiving them, this really makes me wonder about the quality of there honey or if I am getting very old honey, either way, I will not order this brand again!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike K.",
      "helpful_votes": 6,
      "publication_date": 20190323
    },
    {
      "title": "Average honey of unknown origin with unwanted Bible verses on the label",
      "text": "This honey is average in every way and costs more than its higher-quality competitors. The label doesn't specify which state the honey is produced in, but it does have Bible verses on it. I wish had noticed that before ordering it. I'll never understand why business owners want to force their religious beliefs on their customers. I won't be buying their honey again.",
      "rating": 2.0,
      "verified": true,
      "author": "earl_of_grey",
      "helpful_votes": 3,
      "publication_date": 20200429
    },
    {
      "title": "You would think with all the dissapointment something like that would be simple to avoid and they would ...",
      "text": "Cap broken. Sorry that I didn't read the one star reviews. You would think with all the dissapointment something like that would be simple to avoid and they would pack more protective around the cap.",
      "rating": 1.0,
      "verified": true,
      "author": "mackey1",
      "helpful_votes": 8,
      "publication_date": 20180408
    },
    {
      "title": "The whole bottle crystallized in 2 weeks, now it just sits in my cupboard.....",
      "text": "I intended on writing this review months ago, but remembered to do it today. When I ordered this honey I had read reviews and decided to give it a go. I wish that I hadn't. After about 2 weeks the whole bottle had crystallized, which was pretty upsetting. I bought it to use for my granddaughters cereal instead of sugar. It was fine until it crystallized, and it's been sitting in my cupboard ever since. I did try to carefully heat it to see if that would help, but it didn't. Needless to say, I won't be ordering this brand again, as that was money down the drain, in my opinion. So, buyer beware.",
      "rating": 1.0,
      "verified": true,
      "author": "Paula Wood",
      "helpful_votes": 2,
      "publication_date": 20190619
    },
    {
      "title": "Fantastic honey!",
      "text": "Delicious honey. It dissolves great, tastes great, and stores great. I love that “the raw honey is extracted from the beehives where it is then tested at two labs, one Nature Nate’s own and the other a third-party; every batch of Nature Nate’s honey is tested. This is when the pollen testing takes place, as well as rigorous testing for any unwanted additives such as pesticides, herbicides or antibiotics that may have been picked up by the bees.” (supplement police) The honey isn’t pasteurized, but is slightly warmed and strained to remove the wax. The bottle is bpa as well. Fantastic!!",
      "rating": 5.0,
      "verified": true,
      "author": "TokiTop Contributor: Makeup",
      "helpful_votes": 4,
      "publication_date": 20180220
    },
    {
      "title": "Great Product !",
      "text": "\"Nature Nate’s 100% Pure Raw & Unfiltered Honey\"; 32-oz. Squeeze Bottle; Certified Gluten Free and OU Kosher Certified honey is a great value for the low price.The honey tastes great and lasts longer than comparable manufacturer offers at this price.This honey is perfect when mixed with warm water or herbal teas. The squeeze bottle is easy to open and pour the delicious contents.The honey is pure.The product label states that the product derives from all American bees. It's gluten free and made in the USA and Canada.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. Joseph S. Maresca",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Good for baking....",
      "text": "This is a great value, but I’m not very crazy about the taste. Bitter after taste. I eat a spoonful of honey each day and I’m used to a more sweeter taste. But I make honey wheat bread a lot and it makes a great tasting loaf. So, I’ll use it for baking only and get my spoonful with a local brand I’ve been using. I know others have loved the taste, so take my comments on that, as just a personal choice.",
      "rating": 3.0,
      "verified": true,
      "author": "Writersblock",
      "helpful_votes": 2,
      "publication_date": 20200124
    },
    {
      "title": "absolutly garbage",
      "text": "I just don't understand how people give this products 5 star , either they got paid to give a good review or so dumb , because this honey I wouldn't call it honey its garbage and pure sugar , I bought this product month later turned to sold sugar and you can feel the sugar in you fingers , don't waste your money .there is no 100% honey for $ 6.",
      "rating": 1.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 5,
      "publication_date": 20190423
    },
    {
      "title": "broken seal, exploded bottle",
      "text": "This was a gift. It arrived with the inner seal torn and broken and honey everywhere inside the box and now all over recipient's home. She said she thought it was a \"used bottle\" of honey, that's how broken the seal was. Big Bummer. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "kim cat",
      "helpful_votes": 5,
      "publication_date": 20180908
    },
    {
      "title": "Don't buy unfiltered honey",
      "text": "Product becomes crystallized in no time, was already half crystallized when received. Forget gently heating with warm water. Doesn't work and becomes even more crystallized. Very disappointed and had to throw away after getting tired of fishing into bottle with thin long spoon. What good is nice squeeze port if nothing will come out.",
      "rating": 1.0,
      "verified": true,
      "author": "Greg Burke",
      "helpful_votes": 7,
      "publication_date": 20180926
    },
    {
      "title": "3 of 4 bottles were damaged",
      "text": "3 of the 4 bottles I ordered were damaged. One was swollen as if exposed to high heat and the cap and seal were not fully affixed. Another’s cap and seal were loose and the third’s cap was nearly fully unscrewed and the seal was fully off causing honey to leak into the box. I’ve purchased this brand before at Costco and it tastes good, but something was wrong with the caps and seals in this lot.",
      "rating": 1.0,
      "verified": true,
      "author": "JMelAz",
      "helpful_votes": 4,
      "publication_date": 20190204
    },
    {
      "title": "Good Honey, but always comes leaking!",
      "text": "We have probably bought over 10 of these in the last year. Out of the ten, more than half comes leaking. This last one was completely broken open and honey was all over our other items, the box, the porch (with ants eating the honey)... I just don't get it. How do you throw in a bottle of honey without a lid protector or wrapped, etc... We use to buy Texas Honey and they always came with a lid protector. Nature Nate, I loved the honey, but the packaging is terrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20190621
    },
    {
      "title": "Crystallized shortly after purchase.",
      "text": "I find the quality and taste to be okay at the beginning. It sat in my pantry for a couple of months and crystallized while it was 70% unused. It was very inconvenient to take the remaining honey out. I probably threw it out by the time it got down to 20% remaining in the plastic bottle because it was impossible to get out. I didn't want to microwave or heat the bottle as it was plastic and there was no mention of the bottle being BPA free.",
      "rating": 2.0,
      "verified": true,
      "author": "Sunny Cali",
      "helpful_votes": 2,
      "publication_date": 20190927
    },
    {
      "title": "Check dates of production!",
      "text": "Really disappointed in this honey. I’ve gotten before from Amazon and loved it, but this one was likely old. It started to get Crystallized about a week after I got it and is so thick it will hardly squeeze out. It thick and messy and 70% full.",
      "rating": 1.0,
      "verified": true,
      "author": "Dianna L. Burrup",
      "helpful_votes": 5,
      "publication_date": 20180721
    },
    {
      "title": "IT HARDENS AND LIKE SUGAR WATER",
      "text": "I do not recommend this honey at all. 1 month after purchasing it and its hard and does not flow. I used to have to put the honey bottle into the microwave for 15-20 seconds but even that doesn't work anymore. It looks like they take regular honey and mix it with sugar water. I have never had a previous bottle of honey where the honey clustered into a solid format. My bottle is still 2/3rds full but I may just have to throw it out.",
      "rating": 1.0,
      "verified": true,
      "author": "blib blub",
      "helpful_votes": 4,
      "publication_date": 20190101
    },
    {
      "title": "Off taste",
      "text": "Big fan of raw, gently filtered honey that hasn't seen high heat. Read some good reviews on this and made the purchase. It definitely has an off taste, so probably a fermentation issue. Should still have health benefits, which is why I'll get through the bottle, but will be looking for another supplier next time. Was a prior fan of Ambrosia until they sold out. As other reviewers have said, it turns to sugar way fast anymore. The quest continues.",
      "rating": 2.0,
      "verified": true,
      "author": "wireless world",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Honey crystallized in less than 2 months",
      "text": "I have never had this problem before, but the product, which remained unopened for the first month, crystallized in less than one month later. I have purchased this before without problem, but this one is bad, and I have no option to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Janice Snow",
      "helpful_votes": 3,
      "publication_date": 20191224
    },
    {
      "title": "Tastes very good.  Does crystalize more than any other honey I have ever had.",
      "text": "I am a honey addict. We have multiple different kinds of honey. Some store bought and some from people that locally raise bees. This honey tastes very good. I like that it is unfiltered and should contain a lot of the good stuff that gets filtered out in big name brands. It does crystallize very quick. I have had this bottle for a relatively short period and am down to about 1/3 left. It is very, very thick and crystallized. I tried warming up in hot water with only a little success. This isnt a knock on the honey. This is what happens naturally. But I just haven't had it happen this quick before.",
      "rating": 4.0,
      "verified": true,
      "author": "T. Gilbert",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "Best honey so far!",
      "text": "I will certainly buy more of this honey when I run out. I really love the taste and have been taking a teaspoon every morning before breakfast. So at this rate it will run out before the end of the month. Once you taste honey that is of good quality you are certainly going to stick with the same brand. I love this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Francis",
      "helpful_votes": 3,
      "publication_date": 20181102
    },
    {
      "title": "Honey, let me tell you... this ...",
      "text": "Honey, let me tell you...this honey is delicious. I've never been one to care to much for honey, but this one did the trick. I've tried it in a detox, and in tea and it was tasty. I will surely be getting more of this.",
      "rating": 5.0,
      "verified": true,
      "author": "n.r.",
      "helpful_votes": 8,
      "publication_date": 20170421
    },
    {
      "title": "worst plastic lids",
      "text": "I am a honey user for long years. I usually buy it online from the producers. I bought these from Amazon because I had a gift card. I ordered 3, so I don't have to pay for shipping. I received the package, one lid completely broken,the second lid broken and off the bottle with sticky neck, I had to throw it away, probably contaminated, the third lid was OK. later I was reading other customers reviews, I noticed that they also got broken lids. I don't recommend this product, buy raw honey from the producers.",
      "rating": 1.0,
      "verified": true,
      "author": "Parounak Minakian",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "Please change the packaging!",
      "text": "Very tasty honey, however, the packaging leaves a lot to be desired. The honey has crystallized, which is quite normal for natural honey. The bottle opening prevents easy removal of crystallized honey, because it is quite small. I prefer jar packaging for this very reason. Even a plastic jar with a screw on lid is better than a bottle type with a small opening, which makes honey removal very difficult.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190121
    },
    {
      "title": "So far, I like....",
      "text": "This honey is a pretty big size which I think is a pretty good value. The honey is dark; it is nothing like those honeys that come in the bear packaging. This honey also seems very sweet. I add about 2-3 spoons of this honey in my hibiscus tea (8 ounces) and it's sweet. Most likely I can go with just 2 spoons. There is no need for sugar ( I normally don't use sugar in my tea anyways). I did not receive any damages with this honey. The lid was intact; there was no leak; the safety seal was still on. And it only came in a bag; no protection around it.",
      "rating": 5.0,
      "verified": true,
      "author": "JayCast",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Damaged products",
      "text": "What a bad luck , I was late to pick up these products ,and first I just found one of two bottles I bought it doesn’t have a cap, and honey was leaking from the bottle,so I reported to customer service, I throw away . later when I got home ,I opened the other one ,and it’s opened inside also ,how disgusting .it is very bad experience",
      "rating": 1.0,
      "verified": true,
      "author": "Iris",
      "helpful_votes": 2,
      "publication_date": 20190709
    },
    {
      "title": "Very real and very good",
      "text": "75% of the store-bought honey you buy has been filtered with all the goods talking out of them store bought honey makes my hands cold and sweaty because of the high sugar content this honey does not I could eat as much of this as I want and still feel great highly recommended my first bottle was delivered just a few days ago and I've already ordered my second bottle cuz I don't want to run out is that good so if you're looking for real honey with all the good stuff still in it this is highly recommended good job to the people who make it and of course the bees",
      "rating": 5.0,
      "verified": true,
      "author": "robert lawrence",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "This crystlizes very fast .. You have about a week to use before it wont even come out of the bottle and youll waste money",
      "text": "I lost 2 bottles really quick !! this crystlizes very quick and doesnt come out of bottle .. Its very hard to work with .. Dont buy 3 at a time !!",
      "rating": 1.0,
      "verified": true,
      "author": "Yamoliky",
      "helpful_votes": 7,
      "publication_date": 20180714
    },
    {
      "title": "Packing Problem - Spilled Everywhere!",
      "text": "The top of the honey was completely off and it spilled all over the box and other product. I took it outside to clean up the mess and was swarmed with bees within thirty seconds. I didn't get to taste it, so no idea about the product itself. I didn't feel it was fair to give a 1-star review (although after the bees I was tempted) just because of the packaging. There are other reviews highlighting the spillage/leaking problem.",
      "rating": 3.0,
      "verified": true,
      "author": "Rhonda",
      "helpful_votes": 2,
      "publication_date": 20181028
    },
    {
      "title": "Seems legit",
      "text": "I use this for my body wash as honey has anti inflammatory properties. This works not as well as the 365 one I usually use from Whole Foods but I wanted to try a liquid version because the 365 one is more of a solid. Anyways works fair. I think the 365 one worked better Update 10/18/20 Lasted me 4 months of use for my diy body wash. Bought a second time - a set of two - and the packing was horrible. I love this as it really helps my skin but it was shipped with no bubble wrap by itself in the box and one of the bottle caps broke.",
      "rating": 3.0,
      "verified": true,
      "author": "Chrisくりす",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Pine",
      "text": "Pure sugar with tiny honey flavor , once you open it , just give it few days you’ll be seeing, eating and getting only sugar with your spoon, do not waste your money!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Zeinab",
      "helpful_votes": 3,
      "publication_date": 20200706
    },
    {
      "title": "Its real honey",
      "text": "I happen to love raw honey but it wasn’t really possible to find it with the grocery store stocks recently. I have several bottles of this honey I ordered from amazon fresh, it’s excellent. The honey has begun crystallizing which is a great way to know it’s real honey and not some high fructose corn syrup imposter. It’s got an almost floral sweetness to it, which I note mostly because it’s very different tasting than the local raw honey here in south Texas. A really good product though, as far as buying honey from an unknown source; this was a great outcome.",
      "rating": 5.0,
      "verified": true,
      "author": "influence peddler",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Very diluted and runny",
      "text": "I've been buying raw unfiltered honey from the store for several years, this was the first honey purchase I made online and it was not at all the consistency it needs to be, very watery and similar to packaged honey with additives",
      "rating": 1.0,
      "verified": true,
      "author": "Ariel",
      "helpful_votes": 2,
      "publication_date": 20200612
    },
    {
      "title": "This honey tastes good and saves you money",
      "text": "This honey is as clear and tasty as honey can be, but because it is raw and unfiltered, it still contains the healthy pollens and enzymes you want. It's also less expensive than buying those little bear shaped jars in the supermarket. The label warns not to give honey to children one year old or younger.",
      "rating": 5.0,
      "verified": true,
      "author": "HazelnutTop Contributor: Baking",
      "helpful_votes": 6,
      "publication_date": 20170408
    },
    {
      "title": "Be wary if it's discounted bigly!",
      "text": "I usually buy this stuff at a local grocery store and have always, always been pleased with my purchase. However, I bought 2 bottles off of Amazon at a huge discount and it was disgusting. I guess you get what you pay for. I will continue to purchase from local grocery.",
      "rating": 1.0,
      "verified": true,
      "author": "MrsOk79",
      "helpful_votes": 3,
      "publication_date": 20190306
    },
    {
      "title": "I did not return as it is a pretty low cost item",
      "text": "Honey, over a long period of time, will naturally turn to sugar. This order of honey I received had already turned to mostly sugar. This is not what should expect to receive on a new order. I did not return as it is a pretty low cost item. I will not purchase this item again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 12,
      "publication_date": 20180530
    },
    {
      "title": "Good stuff",
      "text": "I like what I purchased. The flavor was acceptable - I believe the Kirkland Brand (Costco) honey may be a little tastier. However, the Kirkland brand is not raw honey. I see no crystallization that some reviewers have indicated is apparent. Perhaps this occurs over time. I do not anticipate witnessing this because I utilize honey quickly. The viscosity of the honey is lower than I expected but is not a detriment to me. It flows out of the bottle with little effort and the flow restricter on the cap insures that the flow can be easily regulated. I'll update this review as needed or until I have eaten the worm.",
      "rating": 5.0,
      "verified": true,
      "author": "Bonnie Stratton",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "the honey is not real or pure the plastic bottle is white inside the sugar that it has",
      "text": "the honey is not real or pure the plastic bottle is white inside the sugar that it has",
      "rating": 1.0,
      "verified": true,
      "author": "lattaro",
      "helpful_votes": 3,
      "publication_date": 20200404
    },
    {
      "title": "Not great honey",
      "text": "I read many reviews before I purchased this honey and there were a number of complaints about shipment problems. Well mine was received in perfect condition but the taste of the honey was \"unpleasant\". Sure it was sweet but it had an overall taste of mustiness as though there was no identifiable flavor of anything except sweet and musty. I understand that taste can be subjective but I would never buy this again. The upside is that it's inexpensive",
      "rating": 2.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Excellent flavor without the drip",
      "text": "I love the flavor of this honey. It is the perfect sweetness for all of my needs, especially when drinking Chaga tea, where the flavor of honey shouldn't overpower the subtle flavor of the Chaga Mushroom. I also LOVE the fact that this is a no mess spout. Seriously, what a wonderful idea to have a no-drip hole for honey. The price is amazing and the shipping and packaging were great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 3,
      "publication_date": 20180109
    },
    {
      "title": "Excellent (mostly)",
      "text": "I really enjoy this product. I've been purchasing smaller bottles but they are constantly running out since we've cut back on using sugar. This is a nice large bottle. I also like that they included a small filter like hole (its not just an empty opening, like most) to catch any little bits that would normally float around in my tea. My only constructive criticism is that I wish the bees were from more localized regions to get the allergy benefits. They are North American bees, but if they would offer honey from North East America (no bias here lol) that would be lovely. Will definitely purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaslyn",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Very Good Tasting Honey",
      "text": "I order this honey because I have the flu and while making my multiple couples of green tea, Lemon and Honey I ran put of honey. I was just to sick to go put to whole pay check Lol or Trader Joe's I decided to go to my bk up plan (Amazon) and have some honey delivery right to my door step. Boy am I glad I did This honey taste delicious, no funny after taste. It has the right consistency, and the price is right as well. I love it. So i went bk online and I immediately ordered a second bottle. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Meta",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Best Raw US Honey!",
      "text": "I was in a bind and didn’t have time to get to Costco. Fortunately Amazon has Natures Nate’s honey. After reviewing over other reviews for an hour about honey, I decided to still purchase the one I’m familiar with. It’s very smooth, some local honeys I’ve tried are a little gritty. Not over bearing sweet. The squirt top is perfect. Doesn’t leave gooey mess.",
      "rating": 5.0,
      "verified": true,
      "author": "mary agnew",
      "helpful_votes": 4,
      "publication_date": 20180224
    },
    {
      "title": "Received opened and leaked bottle",
      "text": "Not sure about overall quality but mine was opened or wasn't sealed correctly. As you can see from the photos, the bottle was all sticky from the spilled honey. I opened the cap and the seal part was open.. not sure if this isn't a new bottle but don't want to use it since who knows how long it was like this opened....",
      "rating": 2.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 2,
      "publication_date": 20190320
    },
    {
      "title": "A Large Bottle Of Delicious Honey",
      "text": "I have tried this and. Does one taste \"better\" than the other? Honestly, it's a matter of your taste. I would suggest trying this and the Organic version and see which one you like, and which one suits your wallet. This large bottle is terrific for those that cook with a lot of honey. I use it pretty fast and this can be gone in a couple of months. It is well-priced and significantly cheaper than the honey I've found in stores. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "benjamin bannisterTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "product not sealed",
      "text": "Two of the three honey bottles were open. There was no seal on them. I ate from one of the bottles and was terribly sick for 24 hours, and I am still recovering after 48 hours. There is something wrong with the honey. I should have returned it. There was honey spilled all over the inside cover when I untwisted. I am requesting a refund for the two bottles that were not sealed. Maybe the honey has been contaminated.",
      "rating": 1.0,
      "verified": true,
      "author": "Nnamdi Greeley",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "No Flavor",
      "text": "I didn't have time to try and go to any of the local farmer's markets for honey so I figured I would try Amazon. This honey had good reviews, so I tried it. Wow! Corn syrup has more flavor. I am used to honey having a honey flavor. This is so bland all you get is sweet. Definitely will not order again, but to be fair to producer, honey was clear with no crystals. It arrived without any spills and the bottle cap works well to dispense.",
      "rating": 3.0,
      "verified": true,
      "author": "AG810nm",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Authentic raw honey that tastes great 👍",
      "text": "I read the reviews and was a little hesitant because some had claimed it was harden.Im glad I went ahead and ordered anyways.The bottle and the honey arrived in perfect condition. I buy my honey locally during spring and summer months and I was looking for decent honey during the months it’s not sold like our current winter. It far exceeded my expectation and was delicious! I heard raw honey was suppose to be dark or it wasn’t really considered raw so Nate gets ten stars all across the board for selling authentic,delicious, and raw honey.I will be back for more and may even keep an extra bottle during the summer months.",
      "rating": 5.0,
      "verified": true,
      "author": "barby",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Drip proof top-NO MESSY RIM 👍🏽",
      "text": "Good Quality! I began using honey vs sugar in my tea n coffee etc about 2 yrs ago- took some getting use to now I MUST have it. After trying so many other brands ( fructose syrup) I decided to always be on a hunt for unfiltered honey 🍯 What a difference with NATURE NATES ,BPA free bottle 32oz Great price FYI: always flip over and read ALL fine print on “ 100% Pure” honey you’ll be surprise. I enjoy Nature Nates n do recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Naturally Fantastic",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Great Taste and Excellent Value",
      "text": "Without question this is by far the best honey I've ever tasted and I'm a honey lover! And, if that weren't enough, the cap and honey release on the top is absolutely amazing! I've never had 'any' brand previously that so well controlled the flow of the honey coming out of the bottle. I'll not only buy it again, I'll share it with both family and friends. On top of all that it's amazing value. What's not to like? Way to go guys! You hit this one out of the park!",
      "rating": 5.0,
      "verified": true,
      "author": "Senior Seeker",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "I thought the Squeeze Bottle could be a good idea",
      "text": "I thought the Squeeze Bottle could be a good idea, but it was difficult to squeeze the honey out of the bottle when the honey became crystallized. I know it's the very nature of honey, but the small opening of the bottle makes it hard to get the honey even with a spoon.",
      "rating": 4.0,
      "verified": true,
      "author": "BEAR",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "Have you seen this bear?!?! :o)",
      "text": "One word, YUMMY! Been a minute since I've had raw honey and this is definitely what I was looking for! Great taste, great flavor and a great bottle with a well designed squeeze style flip top cap that doesn't goo everywhere like the old style honey bottles (similar to new style catchup bottle). Yogi Bear has been stalking me since my delicious honey arrived, HELP!!! ;)",
      "rating": 5.0,
      "verified": true,
      "author": "James B",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Sugar not honey",
      "text": "So sweet they should put 100% sugar Will never buy it again Really disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Majed m Aldolimi",
      "helpful_votes": 6,
      "publication_date": 20180806
    },
    {
      "title": "Not good honey",
      "text": "It crystalizes and doesn’t go back to normal form despite following instructions on label (use warm water). Also, doesn’t taste good... I noticed that honey with ‘true source’ label tastes the best.",
      "rating": 1.0,
      "verified": true,
      "author": "Incommunicado",
      "helpful_votes": 2,
      "publication_date": 20200105
    },
    {
      "title": "Arrived with broken cap and was a gross, sticky mess...",
      "text": "Don’t let my 2 star review make you think that the honey isn’t good, it’s actually very tasty and have bought multiple bottles of it. The low stars are due to the way the item arrived. Who, in their right mind, would think that shipping this item, in a flimsy pouch, was a good idea??!! The cap was cracked and the honey leaked all over the pouch and the bottle of honey. Its a gross sticky mess...",
      "rating": 2.0,
      "verified": true,
      "author": "marilynn",
      "helpful_votes": 2,
      "publication_date": 20180912
    },
    {
      "title": "It's really good",
      "text": "I got this for my wife as a stocking stuffer. Until you taste this versus some of the name brand honey's you see in the store, it is night and day. It is darker and richer than the store bought. We start to find different things to put it on- fried chicken, oatmeal, and a host of other things. She often takes a spoonful to help her with he cough. So it is a well used item in my household.",
      "rating": 5.0,
      "verified": true,
      "author": "Arthur R.",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Great product, but not what was advertized.",
      "text": "For a longer time I was trying to buy \"Sour Honey\", an unusual anti-cancer kind made by Brazilian bees. When navigating through the marketing sequences, the product was gradually degrading from the desired Brazilian Sour Honey to a regular Canadian Honey. I decided to buy it anyway, and I like it very much. It came from New York though, so I can only hope the origin is Canada, not (you know where). But it does smell, tastes and looks genuine - and delicious. Yummy-yummy, Mniam-mniam.",
      "rating": 3.0,
      "verified": true,
      "author": "Goral",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Un-cut good for you. Kick the sugar habit.",
      "text": "The best thing for any ones stomach. This is better than cane sugar. I had ran out and the health food store did not order anymore. Like I say if you can't find it in your neighborhood store or market, check out Amazon.com. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Morten",
      "helpful_votes": 6,
      "publication_date": 20170408
    },
    {
      "title": "Nature Nate's 100% Pure, Raw and Unfiltered Honey",
      "text": "Nature Nate's 100% Pure, Raw and Unfiltered Honey. I know there are 100's of Honey Manuf., but I tried this one on a friends recommendation. I was extremely surprised. Beautiful color and exceptional taste. It comes in a nice container and has a very nice drip-less delivery cap. The taste is rich and bold, not thin and watery like some honey. Super aroma. Great price and fast delivery. I use it in smoothies and protein shakes/blends. Very pleased. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "John M Lapoint",
      "helpful_votes": 2,
      "publication_date": 20170811
    },
    {
      "title": "THE MOST AMAZING HONEY YOU WILL EVER BUY",
      "text": "THE MOST AMAZING HONEY EVER! I BOUGHT THREE 40 OUNCE JARS RIGHT FROM THE BEGINNING NOT KNOWING IF IT'D BE ANY GOOD. SO I AM PLEASED TO SAY, I AM VERY HAPPY WITH THIS HONEY! IT'S WELL WORTH IT, IT TASTES AMAZING, GREAT PRICE AND IT WON'T LAST LONG IN MY HOUSE. IF YOU LOVE HONEY, THEN NATURE NATE'S IS THE ONLY PLACE TO BUY HONEY FROM. I AM ONE VERY PLEASED CUSTOMER :)",
      "rating": 5.0,
      "verified": true,
      "author": "lisa walsh",
      "helpful_votes": 5,
      "publication_date": 20170821
    },
    {
      "title": "My grandpa was a beekeeper. And that's exactly the taste of real honey!",
      "text": "I love honey (and who doesn't), but unfortunately it was really difficult to find something decent! The majority of national and local brands have just sugar and not the honey. I found it on Amazon like a year ago, and I always have at least one bottle in my house at any given time. You won't be dissapointed. It tastes like real honey, it smells like real honey, probably because it is the real honey",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Safety seal opened",
      "text": "I have tasted and ordered this honey before and I am pleased with the taste. However, when I received my honey this time the top was loose and the safety seal half way open. When I lifted the bottle out of the box and squeezed I heard air blowing and then noticed it was opened. The box was completely sealed. It arrived on time.",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20181127
    },
    {
      "title": "The Opening Is The BEST",
      "text": "I love the honey but the opening that is on the cap to pour it out of is the best I have ever seen on any container of honey. It pours great and then kinda sucks back up so honey isn't dripping all over the place. It worked great when I first got it and being the only person using it, it did harden some after a while and the opening wasn't working. But with popping it into the microwave for a bit (seconds), it was back to working great. So it was more the honey thickening up, not the opening. Again, great honey - great taste. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jain",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Good value for money.",
      "text": "Its tastes sweet but not greasy, and it has the original rich fragrance of honey. I usually use it to make honey citron tea or honey chrysanthemum tea. I was disappointed with the design of the bottle cap. When I first used it, the honey splattered out and stained the carpet, which was very difficult to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan X",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "All turned to lumps of sugar",
      "text": "Horrible ! After a week the entire Continer looked like pure lumps of sugar . It does not appear to be 100% natural honey at all, unless all the company is doing is feeding its bees sugar water . I would not recommend it at all. It appears to be false advertising.",
      "rating": 1.0,
      "verified": true,
      "author": "Dean Zamani",
      "helpful_votes": 2,
      "publication_date": 20191230
    },
    {
      "title": "This is exactly what you should get",
      "text": "If you like honey or want to add it to your diet for health reasons then always remember to get raw and unfiltered ones. This is how you retain all its medicinal properties. Now, this particular delivers what it promises i.e. raw and unfiltered honey. This is pure and has a very good taste. Just make sure you don't feed honey to babies or puppies for the fear of botulism.",
      "rating": 5.0,
      "verified": true,
      "author": "SamBos",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "I am yet to see Nature Nate's make this WRONG into a RIGHT!",
      "text": "After reading that there was a lawsuit about the honey's enzymes being lost in the \"warming\" they claim to do, I'm going to move on to unprocessed unfiltered, un-heated, organic honey. As for there \"organic\" line of product, even the green labeled bottle looks suspicious to me. The lawsuit claims that lab tests revealed \"syrups\" have being added to the honey as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Luis Carlos",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Taste is too strong and overpowering",
      "text": "I was disappointed with this honey. The taste is very strong and overpowered the flavor of the granola recipe I used it in. I moved it to the back of the cupboard and plan to use it up slowly. In the meantime I went out and bought a regular bottle of clover honey as this blended honey is not for me. My husband didn’t like the taste either.",
      "rating": 1.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Great value and quality...",
      "text": "Great value for this amount of honey. Quality/flavor is good. Like many others my cap was cracked. Item was shipped with no protection so I guess this is expected and not the fault of manufacturer. The honey is still sealed perfectly and the cap will still snap on to seal the product once seal is removed. This also has a squeeze style with membrane which keeps the product air tight between uses. Very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "jdubs",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Good value",
      "text": "Honestly the honey was....honey. No bones about it. I bought for the price and was satisfied. The only disadvantage I see to buying online vs Locally (aside from economic impact etc) is the the possibile allergy benefits local honey has. I also learned yesterday why you don't give to kids under a certain age. I guess honey has botulinum toxin spores in it that babies gastric acid is not strong enough to break down. As opposed to kids and adults which have no problems. Who knew.",
      "rating": 5.0,
      "verified": true,
      "author": "fauxden",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "I'd give this 6 stars if I could",
      "text": "This honey made me realize just how much better *good* honey is from the lower-level honeys you buy at the store. It actually got me searching for other high-quality honeys to try. I've bought a couple other expensive bottles of honey, and none of them have been as good as Nature Nate's so far, despite being more expensive! This is the best honey I've yet tried, and I can't envision a day when I won't have a bottle of it in my cupboard. This stuff is so good!",
      "rating": 5.0,
      "verified": true,
      "author": "P. S. Turnbloom",
      "helpful_votes": 0,
      "publication_date": 20191012
    },
    {
      "title": "Different and lovely taste",
      "text": "This is the first time we bought our honey from this brand. The taste was a bit different than the honey we are used to, but we are enjoying it. The value for money is really good for the bigger package size.",
      "rating": 5.0,
      "verified": true,
      "author": "Armila",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Made by North American Bees!!",
      "text": "Had a broken lid, but I swapped from another bottle and fit perfectly. Honey tastes great. But it's not 100% honey. Not as thick as real honey. Maybe they added water to bring it to a more liquid state. Otherwise it be hard to squeeze, I get that. But good taste. Made by North American bees.",
      "rating": 4.0,
      "verified": true,
      "author": "Superstar",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "RAW, NATURAL Honey crystalizes - nothing wrong !!!",
      "text": "This is a great tasting honey and I love the pour spout that doesn’t allow the honey to run down the bottle - making a sticky mess! I made some biscuits and this honey is the perfect combination. One of the characteristics of Raw honey is that it may crystallizes !!! Nothing wrong with it - it’s NATURAL. Just warm it up! Great product ...",
      "rating": 5.0,
      "verified": true,
      "author": "michmom",
      "helpful_votes": 0,
      "publication_date": 20190619
    }
  ],
  "product_meta": {
    "title": "Nature Nate’s 100% Pure, Raw & Unfiltered Honey; 32oz. Squeeze Bottle; Award-Winning Taste",
    "description": "Size:32 Ounce (Pack of 1)Nature Nate’s 100% Pure, Raw & Unfiltered Honey is the perfect natural sweetener to be drizzled as a topping, in beverages, or as an ingredient in your favorite recipes. Beyond its unmatched taste, Nature Nate’s ensures the highest quality standards in every bottle. This unfiltered honey contains all the natural benefits of honey straight from the hive and has been tested to ensure it’s clean of pesticides, herbicides, antibiotics and manufactured additives. Sweeten your days with Nature Nate’s 100% Pure, Raw & Unfiltered Honey — just as nature intended. Beyond our passion for honey, we at Nature Nate’s live out our philosophy that business is about more than a bottom line. It’s about sharing what we have been given to serve the world around us. We measure success not just by what we achieve, but also by what we contribute. Honey Gives Hope.",
    "rating": 4.6,
    "feature_bullets": [
      "Nature Nate’s 100% Pure, Raw & Unfiltered Honey is the perfect sweetener and processed sugar substitute straight from the hive",
      "Our honey is gently warmed and then strained, not filtered, to take the bee parts out and leave the good stuff, like pollen, in",
      "Choose real with honey as a replacement for refined or artificial sugar, stevia or monkfruit",
      "Add the award-winning flavor of Nature Nate’s raw & unfiltered honey to your tea or coffee, on oatmeal or yogurt, in smoothies, or as an alternative sweetener in marinades and salad dressings",
      "Nature Nate’s only partners with beekeepers who share our vision to protect and take care of bees and their hives"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 1 inches; 2 Pounds",
      "Item model number": "FP033",
      "UPC": "038778830321",
      "Manufacturer": "Nature Nate's",
      "ASIN": "B00CMQD3VS",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Grocery & Gourmet Food",
      "Cooking & Baking",
      "Pantry Staples",
      "Syrups, Sugars & Sweeteners",
      "Honey"
    ],
    "price": 8.93
  }
}