{
  "website_summaries": [
    {
      "verdict": "The $40 Sol Republic Jax in-ear headphones have the look of a bargain pair but sound as good as some headphones that cost twice as much.",
      "pros": [
        "The Sol Republic Jax in-ear headphones deliver good sound for a relatively modest price",
        "They also fit comfortably and have a tangle-resistant flat cord, and there's an Apple-friendly inline remote with microphone for making cell phone calls"
      ],
      "cons": [
        "The Jax's simple, plastic design looks cheap"
      ],
      "aspects": {
        "Design": 6.0,
        "Features": 7.0,
        "Sound": 7.0,
        "Value": 8.0
      },
      "publication_date": 20130509,
      "rating": 7.2,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great For Bass",
      "text": "I got these as a recommendation from my husband. I love hearing the bass in my music and that is exactly what these headphones do. I can actually feel the vibrations when I use these and I love it. Depending on the song the treble can get a little muddy but I find that most of my music, even if there isn't a lot of bass, still sound great with these. The have held up really well since I've had them and they feel like really good quality. I hope to never lose these but if I do I'm definitely repurchasing.",
      "rating": 5.0,
      "verified": true,
      "author": "O&GMommy",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Cxl noise well and fit great and above all don’t get tangled.",
      "text": "Bought a pair of these a while ago. Hard to find now. They are a great fit for me. Great for long distance travel on planes, no worries to charge. Good wired headphones for working out are harder to find. Would like to get my hands on some sports ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Emilio",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Comfortable, good sound for price",
      "text": "These are really good low priced in- ear, Non Bluetooth buds. I have used everything from Bose, Shure, etc. I wanted a good set to use at the gym, or walking around, basic knock around set. The comfort is great, as good as hi priced sets, and I had one minor problem, and Mark at customer service straightened it out for me, 1,2,3. Best inexpensive set I have come across. I only give it a 4' because they are obviously not a $2000 set of Sennheiser buds.",
      "rating": 4.0,
      "verified": true,
      "author": "David Donen",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Great Value for under $20",
      "text": "For the price these can't be topped! I've used these about 3-4 hours per day over the last month or so and I can't find a negative thing to say about them. They're not going to replace a top of the line headset, but if you're looking for a value set with good sound look no further.",
      "rating": 5.0,
      "verified": true,
      "author": "Spenser Cochran",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "These headphones started out with great sound and they were very comfortable to wear",
      "text": "These headphones started out with great sound and they were very comfortable to wear. My problem is that I have only had them since January and they have quit working. The price was low enough that I did not bother getting any replacement plan, but I did not think I would be without headphones in under 3 months. I have been very careful with the wires and feel I took very good care of the headphones. First item from Amazon that I have not been happy with.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "Good quality but do not move around.",
      "text": "A couple of things why I gave these headphones 2 stars. One, you definitely cannot listen to music with these while going for a run/jog/walk. Two, if you use them for video call on skype or whatever, you cannot move around much. These all come down to the fact that these headphones line wires terribly made. It makes these hollow muffle noises if you brush the line just barely. I had strong expectations that these were going to be good but not super amazing headphones. Pretty disappointed no lie. Though the sound quality is good for its price. Hopefully they fix this issue",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin Chu",
      "helpful_votes": 2,
      "publication_date": 20141102
    },
    {
      "title": "Poor quality mechanics.",
      "text": "Left channel went dead three weeks in. Switch mechanics are poor. Triple clicking is not always successful. The original version of these (with the straight plug) were so much better.",
      "rating": 1.0,
      "verified": true,
      "author": "Beach Crane",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Decent sound quality for the price. My only criticism ...",
      "text": "Decent sound quality for the price. My only criticism is that the mic is far from the mouth area, in the V where the wires meet further down. This means that it constantly rubs against my clothes when I'm walking and it's very noisy. Most other mic headphones are closer up to the ear and above the collar.",
      "rating": 4.0,
      "verified": true,
      "author": "swansong8",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "These are very crappy. They were a gift and they stopped working ...",
      "text": "These are very crappy. They were a gift and they stopped working within two days. It says I am unable to return them which I am very disappointed about because I bought them over a month before given to my brother and I would have bought them later if I had known there was a specified time for return. Would not recommend, not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Good headphones, disappointing remote",
      "text": "The headphones' build quality is very satisfying, and the sound and volume are great to my non-audiophile ears. However, I was greatly disappointed by the lack of remote control support for Android devices - the play/pause button works but other than that, I cannot use it to control volume or to bring up Voice Control. Had I known that prior to the purchase, I would probably go for one of the other brands/models which do support Android for the same price range.",
      "rating": 4.0,
      "verified": true,
      "author": "Sagie Maoz",
      "helpful_votes": 2,
      "publication_date": 20150218
    },
    {
      "title": "Not as advertised!",
      "text": "These headphones have good sound quality, but the inline music control does not work on my iPhone 6s and the sound will cut out when I am walking with my phone in my pocket. Also the color pattern and the 3.5mm jack on the headphones I received is different than the one shown here. I would not buy these again! Update: the remote side earbud broke on me after less than one month of daily use.",
      "rating": 1.0,
      "verified": true,
      "author": "Westin",
      "helpful_votes": 0,
      "publication_date": 20171012
    },
    {
      "title": "Affordable and works with Decibullz custom inserts",
      "text": "I was interested in creating a poor mans custom ear buds that I could use while cycling.On the decibullz website the listed the Jax as compatible. And true as advertised the snapped right in. The cords transmit the wind vibration and defeat the effect of sealing off the ear. So at the end of the day the earbuds are OK but not great, It was the decibulz compatibility that moved me to buy these earbuds. If I looked at the ear buds on their own I think I would have been happier with the Amps. All in all the noise problem with the cords made these unusable for the reason I purchased them.",
      "rating": 3.0,
      "verified": true,
      "author": "Mark H. Weiss",
      "helpful_votes": 0,
      "publication_date": 20131008
    },
    {
      "title": "After a few uses the headphones wire to the base started to short out",
      "text": "Just moving the wire near the plug made the music disappear and or fade in and out. I contacted supported. They asked me to send in receipt and pictures. I did and contacted them 2 times since and no response.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt Powell",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Stopped working after a few months",
      "text": "The left bud stopped working only a few months after purchase. So disappointing. Don't buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess Bernal",
      "helpful_votes": 0,
      "publication_date": 20200416
    },
    {
      "title": "They didn’t fit for me",
      "text": "They wouldn’t stay in my ear so I gave them to my kid.",
      "rating": 3.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20181020
    },
    {
      "title": "discovered these were pretty close in quality for half the price",
      "text": "I broke my UR Beats by Dre earbuds, and after some research, discovered these were pretty close in quality for half the price. I would have to agree with that! They have even survived being washed. The only thing I dislike is the small screen protecting the actual inside of the bud from debris falls off when fiddled with. Maybe this is just due to me accidentally washing them, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Kait",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Flat cord is useful, right angle plug, not so much.",
      "text": "These were great earphones except for the right angle plug, the wires inside would, I assume, break and render the earphone useless.",
      "rating": 2.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20170922
    },
    {
      "title": "CNET listed as one of the best \"cheap\" earbud headphones",
      "text": "Yup! CNET listed as one of the best \"cheap\" earbud headphones... sound is good! These sound as good as my $100 Klipsch headphones from 2 years ago. I'm impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "LB",
      "helpful_votes": 2,
      "publication_date": 20151002
    },
    {
      "title": "Awful.",
      "text": "Broke after less than a week. My girlfriend tends to be much more gentle on things than I am. I bought these for her, and within a week, the wires are pulling out of the mic/control unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Akien MacIain",
      "helpful_votes": 0,
      "publication_date": 20170320
    },
    {
      "title": "Definitely not the best in this range",
      "text": "I was not amazed by the sound as I was expecting, but it is in a decent quality. The down site of this headphones comes from the cable - it is too noisy - every time you hit it (for example when moving) you can hear the sound echoing through the cable to the speakers... this is definitely not something to be expected out of mid-level quality headphones..",
      "rating": 3.0,
      "verified": true,
      "author": "Gena",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Five Stars",
      "text": "Great earphones, and love that there are size adjustable inserts. That is a huge help!",
      "rating": 5.0,
      "verified": true,
      "author": "Ginaba",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "They are great , But Could be Improved upon",
      "text": "They sound amazing as usual! And i love how the bass is way more prominant in these earbuds versus other brands of ear buds . I would give these a 5/5 rating but i would enjoy a memory foam tip like the jvc marshmellows rather than the silicon tip on these as it doesn't create quite as good of a seal in the ear for more noise cancellation and also the price is a little high for multiple or repeat purchases. But other than that they last me a long time and they sound great!",
      "rating": 4.0,
      "verified": true,
      "author": "Douglas Blaise Rushing",
      "helpful_votes": 0,
      "publication_date": 20150730
    },
    {
      "title": "Four Stars",
      "text": "worked fine, i didn't take good care of it and we parted ways 6 months after.",
      "rating": 4.0,
      "verified": true,
      "author": "Milton",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "OK sound, poor quality",
      "text": "this quit working after only a few months of daily wear while running.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "not for a teenager.",
      "text": "My 15 year old son picked these out from reading rewiews. Less than 1 month of constant wearing and the cord is having problems. He has to wiggle it to get rid of the static and to make both ears work.",
      "rating": 1.0,
      "verified": true,
      "author": "Celeste",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "Love em",
      "text": "After spending big bucks on beats and then having these I'll ONLY buy these things.",
      "rating": 5.0,
      "verified": true,
      "author": "Beerusama",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "I like the sound on them and the fact that I ...",
      "text": "Bought these to replace a pair that stopped working after a few years. I like the sound on them and the fact that I can control the volume and answer calls and the multiple tips for sizing let me get the perfect fit. The color of the headphones are true to the blue in the photo.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana_R",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Short lifespan.",
      "text": "2 months old and the input jack is already fidgety. Music pauses because if it turns in the wrong direction or has enough pressure on it my phone thinks they've come unplugged. This did not happen with the $20 xiaomi piston 2s until I manhandled them for almost 5 months.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Good for a year.",
      "text": "Great but they only last about a year till warranty runs out then the wire gets a short in them by the ear bud. I have had 3 pair.",
      "rating": 4.0,
      "verified": true,
      "author": "DK1209",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "Great!",
      "text": "Great sound quality, good mids and lows Cord feels a little chinsy tho Still very good!",
      "rating": 5.0,
      "verified": true,
      "author": "Al martinez",
      "helpful_votes": 0,
      "publication_date": 20170209
    },
    {
      "title": "bad",
      "text": "these are some of the worst headphones I have ever had. for the three days I had them before they broke they would randomly pause the music and at first I thought it was because I kept hitting the pause button on the headphones so I held it in my palm and didn't touch it but it still glitched out. the sound after three days of being careful with them the three button remote broke off and the ear part died quality wasn't that great either.",
      "rating": 1.0,
      "verified": true,
      "author": "mackenzie",
      "helpful_votes": 0,
      "publication_date": 20130922
    },
    {
      "title": "Five Stars",
      "text": "Great pair of headphones fit nicely and are comfortable oy problem I have is that someone stole mine",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron Podhajecki",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Great bass response",
      "text": "If you like bass these guys should be more then adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Two Stars",
      "text": "Great while they lasted. Broke too soon for my taste. Cheaper headphones have lasted me longer.",
      "rating": 2.0,
      "verified": true,
      "author": "parker",
      "helpful_votes": 0,
      "publication_date": 20150528
    },
    {
      "title": "Comfortable",
      "text": "I was replacing the same pair after my daughter lost them. I love these.",
      "rating": 5.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "Stopped working within a month",
      "text": "I bought a pair of these for myself and for my stepson. I use mine mainly for talking on the phone in the car, so they still work (I'm guessing from lack of use). My stepson (who is 14 and fairly responsible in regards to taking care of his things) used them much more frequently and within about 3 weeks, the button stopped working. Not long after that, they stopped working completely. That aside, the microphone is down so far on the cord that it defeats the purpose of being hands-free—I have to hold it up closer for anyone to hear me. Overall, I'm pretty disappointed that I spent money on 2 sets of these.",
      "rating": 2.0,
      "verified": true,
      "author": "S. Hodgson",
      "helpful_votes": 0,
      "publication_date": 20130914
    },
    {
      "title": "Amazing",
      "text": "I wasn't expecting this much quality from a pair of earbuds worth $30. But I have seen my friends get them and they say that it was amazing. Im suprised to find that the bass was pretty deep, sound was clear, and luckily they gave me extra buds so I adjusted them and they fit perfectly. Totally worth it for $30 bucks.",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan",
      "helpful_votes": 0,
      "publication_date": 20131007
    },
    {
      "title": "Happy & Satisfied!",
      "text": "It's been quite a while since I bought these headphones and so far no complaints and the sound quality is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "Love the sound of the music",
      "text": "Love the sound of the music , love the base. But the cords hit each other and you can hear it. I can deal with cords hitting each and making noise. Not that bad. I really like them for working out at the gym and walking.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenny",
      "helpful_votes": 0,
      "publication_date": 20150530
    },
    {
      "title": "These headphones don't stay in your ears, even with ...",
      "text": "These headphones don't stay in your ears, even with the different adapters. The cords feel cheap and the sound seems about the same as my ear buds from Apple. Very disappointing!",
      "rating": 1.0,
      "verified": true,
      "author": "susanne g vertin",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Just ok",
      "text": "While the wires do not tangle they are not very good quality sound any bump to cable is trasmitt d to headphones",
      "rating": 3.0,
      "verified": true,
      "author": "Sue M Krogsdale",
      "helpful_votes": 0,
      "publication_date": 20141007
    },
    {
      "title": "Low-cost upgrade!",
      "text": "Good volume and lots of bass! My music and podcasts sound much better now!",
      "rating": 4.0,
      "verified": true,
      "author": "T. Cumpston",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Sound qualtiy is not terrific, but",
      "text": "These arrived promptly and work well. Sound qualtiy is not terrific, but OK",
      "rating": 4.0,
      "verified": true,
      "author": "D. Cauley",
      "helpful_votes": 0,
      "publication_date": 20141005
    },
    {
      "title": "Four Stars",
      "text": "Works great in some devices (laptop, iPad) and not in others (cell phone). Still a keeper!",
      "rating": 4.0,
      "verified": true,
      "author": "Donna Edwards",
      "helpful_votes": 0,
      "publication_date": 20140930
    },
    {
      "title": "Great",
      "text": "i love these headphones, I keep them a little under halfway for volume and that's loud enough. It says 3 button but I can only play pause skip and go back with them no volume up or down, little disappointed but not a big deal. I am using them on an iPod 5th gen. The plug is at a 90 degree angle. I use these 5 days a week on my way to school on the train. They cancel out sound good. The wire is long enough for me which is good cuz I'm 6'6 and most headphones are to short, so this is a plus. Great headphones overall",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony",
      "helpful_votes": 0,
      "publication_date": 20150524
    },
    {
      "title": "Three Stars",
      "text": "Not bad for listening to music, but the mic placement leaves a lot to be desired.",
      "rating": 3.0,
      "verified": true,
      "author": "VermontTx",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "Two Stars",
      "text": "Wire portion next to plug wore out and broke after a few months of average use.",
      "rating": 2.0,
      "verified": true,
      "author": "s",
      "helpful_votes": 0,
      "publication_date": 20170612
    },
    {
      "title": "DOES NOT WORK FOR ANDROID",
      "text": "READ! The buttons will not work if you are an android user! I am very disappointed that this was not stated in the description and I saw no other reviews that said it so I will want you to have this warning. It does have a good sound quality so I gave it to a family member that has an iPhone.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabriela ruiz",
      "helpful_votes": 0,
      "publication_date": 20140705
    },
    {
      "title": "These In-Ear Headphones are wonderful! My daughter finds these absolutely comfortable and sturdy",
      "text": "These In-Ear Headphones are wonderful! My daughter finds these absolutely comfortable and sturdy. Would highly recommended them.",
      "rating": 5.0,
      "verified": true,
      "author": "PAmama",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "I also noticed that they are $20 cheaper at Best Buy. I just bought $10 ones that sound ...",
      "text": "These earphones didn't even last 2 months. They were plugged into my phone and just stopped working. I also noticed that they are $20 cheaper at Best Buy. I just bought $10 ones that sound just as good.",
      "rating": 2.0,
      "verified": true,
      "author": "Christie L. Guevara",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "For bass enthusiasts",
      "text": "The base and sound quality is great, they just fall out a lot.",
      "rating": 4.0,
      "verified": true,
      "author": "Ari",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "The sound stopped coming out of one earbud after a ...",
      "text": "The sound stopped coming out of one earbud after a month or so. I submitted a warranty request with Sol 2 weeks ago and haven't received a response yet.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher O'Neal",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Excellent earbuds. Lightweight",
      "text": "Excellent earbuds. Lightweight, good sound, flat cord means hardly any tangles. Only complaint is that the volume controls don't work with my galaxy S4. The mute switch works but volume controls do nothing",
      "rating": 4.0,
      "verified": true,
      "author": "Shelby Baker",
      "helpful_votes": 0,
      "publication_date": 20140929
    },
    {
      "title": "Very very bad for android device",
      "text": "No bcz on the site it says that its compatible with android but its 3-button mic n music control not working in the Samsung galaxy S3 android device.",
      "rating": 2.0,
      "verified": true,
      "author": "Vikram",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "... return - the volume control did not work - pretty cheap workmanship in my",
      "text": "Had to return - the volume control did not work - pretty cheap workmanship in my opinion",
      "rating": 2.0,
      "verified": true,
      "author": "David Spears",
      "helpful_votes": 0,
      "publication_date": 20150610
    },
    {
      "title": "Bought for my daughter, she really likes them.",
      "text": "These were comfortable to use, a big plus, my daughter really like them. I would definitely recommend this product over other brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer D.",
      "helpful_votes": 0,
      "publication_date": 20130611
    },
    {
      "title": "Works great, but Breaks Randomly",
      "text": "Works very good. Good sound quality and durability. Although, mine lasted about a year and randomly just stopped working completely.",
      "rating": 4.0,
      "verified": true,
      "author": "Lori Rainey",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Good sound!",
      "text": "They sound good with music and on the phone.. Four stars because the ear buds tend to come off if you turn your head.",
      "rating": 4.0,
      "verified": true,
      "author": "A DuB",
      "helpful_votes": 0,
      "publication_date": 20130902
    },
    {
      "title": "Volume control doesn't work on android",
      "text": "The earbuds are good but either it doesnt mention that the volume control doesnt work on android or a failed to read it carefully.",
      "rating": 3.0,
      "verified": true,
      "author": "samuel",
      "helpful_votes": 0,
      "publication_date": 20141017
    },
    {
      "title": "One Star",
      "text": "Brand new item with only one earphone side that worked. Piece of junk right out of the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick Hudson",
      "helpful_votes": 0,
      "publication_date": 20151006
    },
    {
      "title": "Sound good but break easily",
      "text": "I didn't even have these for two whole months before they broke. One ear stopped working. Even crappy sony headphones last longer than that. They sound great but are not durable at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Jaime Geiger",
      "helpful_votes": 0,
      "publication_date": 20130825
    },
    {
      "title": "Nice in-ear headphones",
      "text": "Sounds great and the flat cord does not tangle. The colors are nice and it is a good value for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "ReviewerA-Z",
      "helpful_votes": 0,
      "publication_date": 20131113
    },
    {
      "title": "Good deal",
      "text": "Reach and clear sound! I I'm using them for more then 6 months and they still work perfectly! Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "korogan2013",
      "helpful_votes": 0,
      "publication_date": 20140429
    },
    {
      "title": "Just like the description",
      "text": "The sound quality is just what I expected, and it came just as described.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy Kao",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Great headphones!",
      "text": "For earbuds, you can't beat them. Great sound quality and excellent bass.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Welsh",
      "helpful_votes": 0,
      "publication_date": 20140727
    },
    {
      "title": "Great sound period",
      "text": "Great sound lovers ; The difference between SOL's and regular Apple headphones is huge. do not doubt it, go for the SOL !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Diego Mendez Canas",
      "helpful_votes": 0,
      "publication_date": 20130820
    },
    {
      "title": "Good quality!",
      "text": "Good sound quality. I thought the silicone ear tips were a little uncomfortable for my ears. But after wearing them awhile they are at least bearable. . .",
      "rating": 4.0,
      "verified": true,
      "author": "Tom O",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Ok Headphones",
      "text": "Used these at work and had to play with the different ear cushions to find the right fit. Some days one size is best, some days others are best. It's a bit odd. The flat cable is really nice. The mic works decently well too. Sound is ok for earbuds.",
      "rating": 3.0,
      "verified": true,
      "author": "Jason K.",
      "helpful_votes": 0,
      "publication_date": 20130702
    },
    {
      "title": "I bought these after seeing a positive review from a ...",
      "text": "I bought these after seeing a positive review from a local news reporter on TV. I may have given them a positive rating if they would have worked a little longer. After 4 months I no longer have sound coming our of one of the earbuds. Disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Nancy C.",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Sound is impressive",
      "text": "I use these with my Samsung Reverb and have found these to do as expected. I am using these with an android OS instead of the recommended IOS. The sound quality/cancellation is paramount. The play/pause button works like a charm but the volume keys seem to fail on the android OS. The tangle resistance is a plus so all in all I have found these headphones to be worth their money. I have not used the phone feature but I would assume that it would work fine. I will try to update this when I have used the phone on it.",
      "rating": 4.0,
      "verified": true,
      "author": "shark.attack",
      "helpful_votes": 4,
      "publication_date": 20130505
    },
    {
      "title": "Great Headphones, Bad Mic Location",
      "text": "My only complaint is that the mic is located too far down on the cable. The mic/remote rests on my chest, which is a bit of a ways from my mouth if I'm actually trying to use the mic for a phone call. I have to hold the mic up in order for people to hear me well, especially if I'm walking and not sitting in a perfectly quiet room. Why Sol Republic didn't take a quick look at many other manufacturers and put the mic closer to the mouth is beyond me.",
      "rating": 3.0,
      "verified": true,
      "author": "Seth Varty",
      "helpful_votes": 0,
      "publication_date": 20130505
    },
    {
      "title": "Great sound, bad remote",
      "text": "Had these for a week or two and loved them. I'm no audiophile, but upgrading from stock headphones, the difference was amazing. However, after a week or two of use the remote died on me. It was fine one minute, then it became hyper-sensitive to where the slightest bump would activate it. Very disappointed, as they sounded so good. sending them back.",
      "rating": 2.0,
      "verified": true,
      "author": "Thatoneguy",
      "helpful_votes": 0,
      "publication_date": 20130917
    },
    {
      "title": "These headphones have a great sound and provide a good amount of bass",
      "text": "These headphones have a great sound and provide a good amount of bass. Unfortunately, one side stopped working a few months after I bought them. This was the second pair with the same problem. I bought the more expensive AMPS HD because they seemed to be built better (metal casing) however, they do not provide as much bass.",
      "rating": 4.0,
      "verified": true,
      "author": "JHC",
      "helpful_votes": 0,
      "publication_date": 20140829
    },
    {
      "title": "One of the ear buds NEVER worked!",
      "text": "One of the earbuds never worked upon arrival!!!! The seem very plastic-y and seem to be an inferior product compared to what else is available for less money.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina Warner",
      "helpful_votes": 0,
      "publication_date": 20131230
    },
    {
      "title": "Four Stars",
      "text": "not sure quality as of yet - they are for my sons easter basket",
      "rating": 4.0,
      "verified": true,
      "author": "Tonia Evans",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Great Headphones",
      "text": "Excellent sound quality for the price. Incredibly clear highs and smooth bass. Much more than I expected from a $40 set of buds",
      "rating": 4.0,
      "verified": true,
      "author": "Jcub.Ei8hty6ix",
      "helpful_votes": 17,
      "publication_date": 20130624
    },
    {
      "title": "Don't wast your money",
      "text": "It sounds bad and it's just no worth it. Instead I got bose freestyle. I agree it's pricy but it sounds a whole lot better than what these sound like.",
      "rating": 1.0,
      "verified": true,
      "author": "Fadi",
      "helpful_votes": 0,
      "publication_date": 20141029
    },
    {
      "title": "They were great..",
      "text": "They were great...until they broke. They only lasted 3 months before the sound stopped working completely for the phone and music is very distorted. So not but them.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura M",
      "helpful_votes": 0,
      "publication_date": 20141202
    },
    {
      "title": "Will die very quickly",
      "text": "I have had two pairs of these headphones. The first pair lasted two months, the second pair a month and a half. Both times they died just after Amazon's exchange period. I take very good care of my stuff so I know I didn't cause them to die .When they worked they worked well and sounded pretty good. They were also comfortable in my ear and didn't slip out at all. If they lasted longer, say a year, I would probably buy another pair, but as it is I will never buy another pair again.",
      "rating": 1.0,
      "verified": true,
      "author": "Mario Montgomery",
      "helpful_votes": 6,
      "publication_date": 20131004
    },
    {
      "title": "great sound but no 3 button Mic",
      "text": "These headphones are good looking. Absolutely great sound. They will tangle a bit but in seconds almost untangle by themselves when you hold one end and let them hang. The problem is the so called 3 button MIc is only one button in that you cannot increase or decrease the volume; all you can do is stop the music or ebook or answer the phone with it. No volume control here.",
      "rating": 3.0,
      "verified": true,
      "author": "EMG",
      "helpful_votes": 6,
      "publication_date": 20131204
    },
    {
      "title": "3 button only functions as ONE button on Android...",
      "text": "Although advertised to \"work with android\" the 3 button (volume up, pause/play, volume down) does NOT function as advertised. The volume up and down do not work! Nexus 5",
      "rating": 1.0,
      "verified": true,
      "author": "KM",
      "helpful_votes": 8,
      "publication_date": 20140703
    },
    {
      "title": "I mostly like the color.",
      "text": "They're a cute color and they work pretty well so I'm happy. I replaced my skull candy headphones with this pair and they are a bit more expensive but theyre pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20130730
    },
    {
      "title": "Great sound but a little loose in my ears...",
      "text": "The sound quality is fantastic and the bass is really great but not overwhelming. It might be because I have small ears, but I find that I have to really screw them in so they feel snug and secure. That's my only beef, but a small one. Otherwise, a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Fernández",
      "helpful_votes": 0,
      "publication_date": 20130703
    },
    {
      "title": "would not recommend",
      "text": "stopped working after 1 month. during that month, buttons did not work at all times. you're better off buying $10 JVC earphones.",
      "rating": 2.0,
      "verified": true,
      "author": "Zou",
      "helpful_votes": 0,
      "publication_date": 20131106
    },
    {
      "title": "I bought the white ones but I received the blue ones.",
      "text": "There was a problem between the description and the images, I bought the white ones but I received the blue ones.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea R.",
      "helpful_votes": 0,
      "publication_date": 20140227
    }
  ],
  "product_meta": {
    "title": "SOL REPUBLIC Jax Wired 3-Button In-Ear Headphones, Apple Compatible, Tangle Free Cable, In-Ear Noise Isolation, 4 Ear Tip Sizes, Great For Calls, 1111-36 Blue",
    "description": "Product Packaging:Standard PackagingSol Republic's JAX In-Ear Headphones are designed for high quality sound and style within reach. Featuring i2 sound engines, JAX provide a powerful, high quality sound that will exceed all expectations. With intuitively designed wide and flat cable, you will spend less time handling your headphones and more time listening to music. Just pull them out and put them on without any hassles. With four sizes of ear tips, you're sure to get a comfortable fit and perfect seal for hours of music bliss. Tangle Free: Flat cable doesn’t tangle and saves you time. Full Sound: Traditional ear buds lack bass. Jax is a premium sounding in-ear headphone that seals the ear, locking in all the bass and full vocals. In-Ear Noise Isolation: Multiple size ear tips allow you to get just the right fit for sealing the ear canal providing noise isolation and a full range of sound. Mic & Music Control: Mic and multi-function button allows you to pause/resume/skip music and answer/hang-up phone calls.",
    "rating": 3.8,
    "feature_bullets": [
      "Tangle Free: Flat cable doesn’t tangle and saves you time",
      "Full Sound: Traditional ear buds lack bass. Jax is a premium sounding in-ear headphone that seals the ear, locking in all the bass and full vocals",
      "In-Ear Noise Isolation: Multiple size ear tips allow you to get just the right fit for sealing the ear canal providing noise isolation and a full range of sound",
      "Mic & Music Control: Mic and multi-function button allows you to pause/resume/skip music and answer/hang-up phone calls"
    ],
    "specifications": {
      "Product Dimensions": "6.5 x 1.55 x 2.2 inches",
      "Item Weight": "2.08 ounces",
      "Manufacturer": "Sol Republic",
      "ASIN": "B00CAB629K",
      "Item model number": "1111-36 / SOL-EP1111BL",
      "Customer Reviews": "3.8 out of 5 stars197 ratings3.8 out of 5 stars",
      "Best Sellers Rank": "#8,465 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "March 20, 2013"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 24.99
  }
}