{
  "website_summaries": [
    {
      "verdict": "A lightweight, moisturizing mask suitable for oily, combination, and acne-prone skin.",
      "pros": [
        "Lightweight and non-greasy",
        "Won't cause breakouts on acne-prone skin",
        "Light scent that disappears shortly after application",
        "Cooling on skin",
        "Absorbs quickly",
        "Hydrates without leaving a film on your skin"
      ],
      "cons": [
        "If you suffer from extremely dry skin, this may not be powerful enough for you"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Keep using it for full benefit.",
      "text": "I have been using for a few weeks. I was not too impressed at first as I expected more of a true \"mask\" rather than a cream. However, after a few days, my skin on my neck and face felt much more soft in the morning. I live in AZ, so any chance to moisturizing is vital to me. Great for an overnight fix.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa B.",
      "helpful_votes": 9,
      "publication_date": 20131227
    },
    {
      "title": "HEAVENLY SMELL!",
      "text": "The smell is the best smell ever. Like what they may use at a fancy spa. I have noticed my skin is softer but even better than that is how amazing this product smells.",
      "rating": 5.0,
      "verified": true,
      "author": "joancalzone",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "The best !!!!!",
      "text": "I love this product. I have used it for awhile and feel the difference when I get up in the morning. I am 72 and it is the best \"night\" moisturizer I have ever used. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Anne Walker",
      "helpful_votes": 0,
      "publication_date": 20170428
    },
    {
      "title": "Three Stars",
      "text": "You definitely notice the difference the next day. The skin feels smoother",
      "rating": 3.0,
      "verified": true,
      "author": "Chef Rosa Lia Mejia",
      "helpful_votes": 0,
      "publication_date": 20180202
    },
    {
      "title": "Five Stars",
      "text": "I have used this product for the last 6 months, it works on my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Anisha",
      "helpful_votes": 0,
      "publication_date": 20161003
    },
    {
      "title": "Love this stuff - it's authentic!",
      "text": "Fantastic moisture while you sleep...and at a cheaper price than beauty chains!",
      "rating": 5.0,
      "verified": true,
      "author": "Online-aholic",
      "helpful_votes": 0,
      "publication_date": 20160116
    },
    {
      "title": "but this is the third one they wanted so it must be good.",
      "text": "I did not buy this for myself, but this is the third one they wanted so it must be good.",
      "rating": 5.0,
      "verified": true,
      "author": "Trenton Moody",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "Great light facial serum for dry sensitive skin",
      "text": "This is a great light facial serum. I don't think the word \"Mask\" is the right term but if you have dry and sensitive skin, this product works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewer99",
      "helpful_votes": 0,
      "publication_date": 20180331
    },
    {
      "title": "waste of money",
      "text": "i've been using this for over a month. it did nothing at all for my skin and i was generous with it - 3 pumps to cover my face every night. didn't feel moisturizing after applying it, and absolutely no change in my skin in the am.",
      "rating": 1.0,
      "verified": true,
      "author": "micika",
      "helpful_votes": 5,
      "publication_date": 20140314
    },
    {
      "title": "regular use of mask",
      "text": "Excellent product! I am out in the Texas sun quite a bit, and this product leaves my skin feeling smooth and soft.",
      "rating": 5.0,
      "verified": true,
      "author": "diane newman",
      "helpful_votes": 4,
      "publication_date": 20130925
    },
    {
      "title": "Possible Chemical Burn Reaction (??)",
      "text": "received this product yesterday, applied to my face after applying my usual serum and moisturizer (as directed): my face is absolutely destroyed. I woke up in the middle of the night with a tight burning sensation and after investigation found that my face was red and this actually makes my pores look larger! I washed my face and applied a moisturizing mask before going back to bed but the damage has been done. My face is on fire today and this is going back ASAP. I would *never* recommended this to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "k keith",
      "helpful_votes": 0,
      "publication_date": 20160420
    },
    {
      "title": "Good but not for winter weather",
      "text": "I think this product is suitable for anytime but winter and also for anyone younger than 30. I don't see this helping my facial skin dryness. In fact I just used it 2 nights ago and the next morning holy molly, my skin was pretty chapped. However this was pretty good for a long flight/overnight if you don't mind the hassle of rinsing your face in the airplane/airport bathroom afterwards. If you do, then steer clear this product just use one of those Hydrating Sheet masks.",
      "rating": 3.0,
      "verified": true,
      "author": "Lucy",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "it's great just make sure you wash your face in the ...",
      "text": "it's great just make sure you wash your face in the morning or you might break out. Not a problem with this particular product I don't think, it's just thick to keep in the moisture. The bottle itself is lovely on my vanity and the pump mechanism is solid. Don't feel too deterred by the price, it's lasted me months and I'm barely through half the bottle.",
      "rating": 4.0,
      "verified": true,
      "author": "Ax",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Worth it, maybe maybe not.",
      "text": "Not sure if this is worth the $$$. I like it but not really seeing a difference after a month's use. Seems to comes off as soon as I land on the pillow. I have dry skin and used other items like this, like the Pixi sleeping cream which is a lot of the same ingredients - less expensive and works better.",
      "rating": 3.0,
      "verified": true,
      "author": "sandra dunbar",
      "helpful_votes": 2,
      "publication_date": 20160829
    },
    {
      "title": "Great for dry skin",
      "text": "Really dry winter skin, been slathering on at night after washing and toning. Skin is feeling great after 2 weeks. Felt a difference right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Blondie - 184",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Good hydrator",
      "text": "Good product -- no smell - a small amount goes a long way and my face looks and feels hydrated every morning -- thanks Jill",
      "rating": 5.0,
      "verified": true,
      "author": "Sophredneck",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "Great Water Sleeping Mask",
      "text": "Great sleep mask - easy to apply and skin seems rested, plumped and softer when one wakes up. Also not pricey.",
      "rating": 5.0,
      "verified": true,
      "author": "Annegrethe",
      "helpful_votes": 0,
      "publication_date": 20171125
    },
    {
      "title": "Love it!",
      "text": "This makes my face glow when I wake up and didn’t make me break out at all!",
      "rating": 5.0,
      "verified": true,
      "author": "FranchescaM",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Eh",
      "text": "Been using this for 2 months now. Wont order again when it runs out, I cant tell the difference from when i use this or just my regular night cream.",
      "rating": 3.0,
      "verified": true,
      "author": "Lynn Sisk",
      "helpful_votes": 0,
      "publication_date": 20150125
    },
    {
      "title": "Sleeping mask",
      "text": "That is nonsense this product is just plan facial cream, nice to. Use but difinately not a mask jus cream",
      "rating": 3.0,
      "verified": true,
      "author": "shirley sakkatos",
      "helpful_votes": 0,
      "publication_date": 20131002
    },
    {
      "title": "Does what it promises.",
      "text": "One of my favorite skin products. Within a week my skin texture improved and small bumps and dry patches went away. I use it twice a day.",
      "rating": 5.0,
      "verified": false,
      "author": "Reviewer",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Five Stars",
      "text": "Its great for moisturizing during night and it's really light",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151219
    },
    {
      "title": "I do not have sensitive skin and haven't ever had ...",
      "text": "I do not have sensitive skin and haven't ever had a problem with products but this product completely broke out my face. I woke up to at least 5 massive spots, won't be using this again.",
      "rating": 1.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "I love this stuff",
      "text": "I love this stuff. I love how silky and smooth it goes on. I also love the very soft, herbal scent. Other face creams are loaded with stinky, heavy perfume - I definitely don't want that on my face. I will buy again.",
      "rating": 5.0,
      "verified": false,
      "author": "Love OOB",
      "helpful_votes": 2,
      "publication_date": 20150101
    }
  ],
  "product_meta": {
    "title": "Dr. Jart Water Fuse Water-Max Sleeping Mask 50ml/1.75oz",
    "rating": 4.4,
    "feature_bullets": [
      "Dr. Jart+ - Water Fuse Water-Max Sleeping Mask 50ml/1.75oz"
    ],
    "categories": [
      "Skin Care",
      "Treatments & Masks",
      "Face",
      "Beauty & Personal Care",
      "Masks"
    ],
    "price": "",
    "specifications": {}
  }
}