{
  "website_summaries": [
    {
      "verdict": "The cream of the crop when it comes to blenders. Its steep price tag is worth the investment in the long run - especially if you plan on using it regularly.",
      "pros": [
        "Variable speed system with incredibly powerful motor and a new, lower-profile container",
        "Excellent productivity and results"
      ],
      "cons": [
        "The price might stun you, but those users who took the plunge loved it (after they got over the sticker shock, that is)"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "You can stop wasting precious time by chopping and pureeing in this top-of-the-line blender. A pricey investment but we think it's worth it.",
      "pros": [
        "The motor almost never overheats which means you can make all sorts of things in this blender that you couldn't in cheaper models, like nut butters, ice cream, hot soups and more"
      ],
      "cons": [
        "Some complaints of flecking from the pitcher"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "THE BEST OF THE NEWER HIGH TECH VITAMIX",
      "text": "I have had one of the 5000 series Vitamix for many many years and it still works perfectly, a real \"workhorse\". I am now so into making smoothies now, I got this one for an upgrade into the high tech Vitamix realm. It is beyond expectations!. This Vitamix is the culmination of the many years that this company has been making them and evolving them to higher standards. This 750 Pro series is the perfect blender for the smoothie making health person. It is very easy to clean the wide low profile 64 oz. canister that comes with the Vitamix. And for power, this one is tops!",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis E. Pies",
      "helpful_votes": 6,
      "publication_date": 20180913
    },
    {
      "title": "I bought this and made smoothies just fine for a few weeks then I tried to make ...",
      "text": "I wish I could give zero stars. I bought this and made smoothies just fine for a few weeks then I tried to make hummus as directed and the machine started smelling like burning plastic and then it just completely stopped working. I am returning this in buying it directly from vita mix because I think this is a faulty product.",
      "rating": 1.0,
      "verified": true,
      "author": "Shoeman",
      "helpful_votes": 18,
      "publication_date": 20171209
    },
    {
      "title": "Black specs/teflon remainings spots",
      "text": "I bought this version hoping that it would not have the black specs , but my surprise was that they are there. Once I received it, I tested it three different times, and all three generated the black specks in clear water. I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Victor Gomez",
      "helpful_votes": 64,
      "publication_date": 20160711
    },
    {
      "title": "Not recommended",
      "text": "I bought this product 3.5 yrs ago and had black specs issue. Vitamix recently recalled their containers and required customer to send the defective one back for a replacement. Well, who would keep a defective item at home for years waiting for a recall? I would recommend any brands except Vitamix based on the customer service I had.",
      "rating": 1.0,
      "verified": true,
      "author": "CW",
      "helpful_votes": 4,
      "publication_date": 20190827
    },
    {
      "title": "the difference is... it actually works",
      "text": "I wasted money on the 'other brands'.. .thinking I'd get a good blender for $100 or whatever... and a juicer... what a waste of time... this guy, on the other hand, is the real deal. Built in Cleveland, OH, and seems like it'd last a lifetime. nice. and surprisingly quiet, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Miller",
      "helpful_votes": 4,
      "publication_date": 20171112
    },
    {
      "title": "$700 Killer Blender",
      "text": "I believe that the teflon issue will be solved in the new batch. Ohh boy, I am wrong. I received the Professional 750 Blender today and tried blending some water in it and then pour some of it into a white bowl... I see lots of little black flecks floating around, I tried cleaning it thoroughly (even ran the cleaning cycle a few times) and repeated the water test several times with the same results. I am looking for a way to eat healthy, and not being poisoned instead. $700 Killer Blender? Unacceptable!! Its product date is 5/28/15.",
      "rating": 1.0,
      "verified": true,
      "author": "Owhora",
      "helpful_votes": 75,
      "publication_date": 20150619
    },
    {
      "title": "Vitamix 5200 is a better blender",
      "text": "I did return this blender because I realized it wasn't the best Vitamix I could get and it sadly didn't work as good as my Vitamix 5200 and I got a new one of those instead and feel quite happy about it. This one sounded better but wasn't. Amazon was good about taking it back and I appreciate that.",
      "rating": 2.0,
      "verified": true,
      "author": "Susan Clow",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "The Rolls Royce of Blenders",
      "text": "My wife tried several other supposedly good but less expensive blenders. But, she was never completely satisfied with any of them and we finally went for the real deal. It did not disappoint. I guess there's a reason why the Vitamix is a little more expensive and why it's widely used professionally! My wife loves hers!",
      "rating": 5.0,
      "verified": true,
      "author": "Robert W",
      "helpful_votes": 3,
      "publication_date": 20171212
    },
    {
      "title": "I love the Vitamix, the metal faceplate seems poorly made and applied.",
      "text": "I love the Vitamix and wanted to get the updated/newer model. This one looked great. But, on arrival, the brushed metal had multiple problems. The front did not fit well and looked like it was bent or misapplied. There were irregularities in the metal and the face plate had not been fashioned in a way to fit cleanly over the plastic. So, the machine is great. My all plastic one looks ok. I was hoping the metal one would be perfect. But, the process of fitting the metal to the machine does not appear to meet the same quality as the overall product.",
      "rating": 3.0,
      "verified": true,
      "author": "HomerTop Contributor: Pets",
      "helpful_votes": 9,
      "publication_date": 20170917
    },
    {
      "title": "Highly Recommend",
      "text": "Love this blender, truly pricey but also incomparable function ~ i have had expensive juicers in the past and this is hands down the better solution for juicing, grinding etc... plus this is the best blender on the market. I do recommend the pro version rather than the less expensive model because of the additional capability... bite the bullet, pay the additional amount, you will be truly happy with the product",
      "rating": 5.0,
      "verified": true,
      "author": "Stellarsunrise",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "I have had this for 2 days and am very pleased so far",
      "text": "I have had a Blendtec for many years and it has been a workhorse. I have had this for 2 days and am very pleased so far. It's taller than the Blendtec, which is not necessarily a good thing, but it's also substantially quieter. It is possible the newer Blendtecs are quieter, but every video I have seen of the new ones, sounds exactly like my older model. The price is ridiculous, but I am predicting the longevity of the Vitamix based on my experience of the Blendtec. If it fails me I will update/change my review.",
      "rating": 5.0,
      "verified": true,
      "author": "kmr",
      "helpful_votes": 0,
      "publication_date": 20170629
    },
    {
      "title": "The best blender for food allergy sufferers!",
      "text": "I have used my Vitamix a couple times now to make cashew nut cream as an ingredient in making non-dairy ranch dressing and I've got to say this is the best machine for food allergic people to buy. I am recommending everybody to buy one of these because I believe they are the best - powerful, and quiet. Without a doubt if your diet requires you to be dairy free and/or gluten free this is a 'I've got to get one of those' items.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet C. Fowler",
      "helpful_votes": 4,
      "publication_date": 20160228
    },
    {
      "title": "Disappointing Customer Service",
      "text": "This product has a 7-yr Full Machine Warranty. Mine performed well for 2 years, getting minimal use. For the past year, performance has been erratic. Sometimes it works, most of the time not. I tried all the troubleshooting tips. I need to return it for repair or replacement. To do that, I need a Return Authorization from customer service. To date, this has been impossible. I have been on hold for literally hours on all different days of the week - but no one answers. I am frustrated and disappointed. I always believed Vitamix was such a great family-owned company. Can Amazon get them to respond?",
      "rating": 2.0,
      "verified": true,
      "author": "M Ripley",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "I won't risk my kid's health to have a better blender. Decided on the Blendtec Designer series and ...",
      "text": "I did the water test and it left black specks. I was so determined to keep this machine that I tried almost 15 times! Still, I won't risk my kid's health to have a better blender. Decided on the Blendtec Designer series and I absolutely love it. I don't regret my decision at all.",
      "rating": 2.0,
      "verified": true,
      "author": "Mm123",
      "helpful_votes": 13,
      "publication_date": 20150913
    },
    {
      "title": "Best smoothie blender I’ve ever used.",
      "text": "I purchased this to make my morning smoothie. It works great. The berries are fully blended with no clumping and the powder gets mixed in. I do need to use a small spatula to scape some powder off the sides. But not bad. I was skeptical about the cleaning instructions but will report it works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Will Wenger",
      "helpful_votes": 3,
      "publication_date": 20180420
    },
    {
      "title": "Why did I wait so long",
      "text": "I have ignored the vitamix for decades. That much money for a blender? I hardly ever use my blender!!! Well my 20+ year old oster blender died and it was time to get a new blender. I reluctantly decided to give the vitamin a try, and I love it. Should have bought one decades ago. Super powerful, great for making veggie/protein blends (no smoothies here, borderline diabetes means no juicing/blending fruits), batters, breads, soups, mayonaise (omg, once you will taste you will never buy from store again)...",
      "rating": 5.0,
      "verified": true,
      "author": "Oscar Steele",
      "helpful_votes": 3,
      "publication_date": 20160111
    },
    {
      "title": "Amazing blender!",
      "text": "I love this Vitamix blender and wonder how I ever lived without it! I decided to spend the extra for the 750 model that has self cleaning and auto-programmed options. I love the recipes in the cookbook that comes with it too. It should last for the rest of my life but I’ve only had it a few months so that remains to be seen. If I had known how amazing they are I would have purchased one years ago.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Mccann",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "If this can't do a good job with a particular blending task",
      "text": "Expensive, but if you want something you can pass down to your child, or ex wife after divorce decade later, this is it. It will reasonably blend anything you throw at it. If this can't do a good job with a particular blending task, no other blender can and still be well-rounded in general.",
      "rating": 5.0,
      "verified": true,
      "author": "Julian L.",
      "helpful_votes": 3,
      "publication_date": 20161006
    },
    {
      "title": "excellent! I had a juicer before but it was ...",
      "text": "excellent! I had a juicer before but it was a hassle to clean up all the residual fiber after use. You pay a bit more, but it is worth it, as this machine is very strong & fast with complete breakdown of ALL fiber, and releasing he the healthy phytochemicals. And clean-up was a breeze: rinse out what little remains, then put a small amount of liquid soap and start the clean cycle. It looks brand new, and nothing to take apart.",
      "rating": 5.0,
      "verified": true,
      "author": "MJO",
      "helpful_votes": 2,
      "publication_date": 20140829
    },
    {
      "title": "The blender to end all blenders",
      "text": "This thing can turn a sneaker into a smoothie, I could not find a better blender this thing is amazing. It's like a mattress and toilet paper some things you just don't go cheap on and this carries over to blenders.",
      "rating": 5.0,
      "verified": true,
      "author": "Combat Vet 82",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "I find I am using this for some juicing when ...",
      "text": "I find I am using this for some juicing when I want to retain the fiber in my green juices. I also have used it instead of my food processor for making and pureeing soups. I am using it to prepare batters for baking instead of using my large mixer. It is quite a machine. I can see myself using it more and more.",
      "rating": 5.0,
      "verified": true,
      "author": "MCB",
      "helpful_votes": 5,
      "publication_date": 20140727
    },
    {
      "title": "Very powerful blender.",
      "text": "I can make smoothies with veggies, fruits, nuts and just about anything will blend up nicely in this blender. I'm very satisfied with the vitamix blender.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "Pity because the partially completed ice creams I created had all the signs of one of the favorite functions for me",
      "text": "The unit didnt look new when it arrived. I have used it mainly for soups and drinks since I bought it. I only started using it for ice creams in the last two days only to discover its struggling to process ice cubes or pieces of frozen fruit. I can sense the motor struggling before it completely stalls. Pity because the partially completed ice creams I created had all the signs of one of the favorite functions for me. You are advised not to buy from the seller that I purchased from, you are likely to regret it. Maybe try a different brand altogether.",
      "rating": 1.0,
      "verified": true,
      "author": "African-Brand",
      "helpful_votes": 16,
      "publication_date": 20161203
    },
    {
      "title": "Vitamix 750",
      "text": "I purchased the Vitamix 750 after a very long speculation. I have wanted this machine for a very long time and finally took the plunge and bought it. I can honestly say I use it every single day...at least twice a day. I am thrilled with it and can't recommend it enough. There are countless videos on youtube and elsewhere on the internet with recipes and tips on how to best utilize. I love it and it is worth every penny!!! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny Striefel Colmenarez ",
      "helpful_votes": 2,
      "publication_date": 20160515
    },
    {
      "title": "Best Blender Ever",
      "text": "This Vitamix is way better than sliced bread. It is gorgeous, operates almost silently, and blends everything I've put in it (smoothies, soups, dressings) effortlessly and quickly. And it fits under the counter. And it holds a lot. AND they send you a beautiful cookbook full of good ideas and recipes. I love this thing and it is worth the hefty price because I believe it is likely to last forever. And it even has a cleaning setting!",
      "rating": 5.0,
      "verified": true,
      "author": "Bearwife",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Amazing Product",
      "text": "The Best Blender I have ever owned and I never realized there was much difference in blenders until I saw this one demonstrated and I don't know of anything this blender cannot do...WOW. I have also never seen a manufacturer warranty as good as this one is (7 years}. It has replaced a lot of my other appliances. It isn't cheap, but it is worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Ketcher",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "But have to say this is best blender ever have",
      "text": "Don't really write review. But have to say this is best blender ever have. In the past, have burn through motor for multiple blender. Best feature - Powerful motor, this translate to very smooth in anything you blend. Sorbet taste so good, freshly make and know what's in it instead some long ingredient name that can't even pronounce. Peanut and cashew nut butter freshly make, OMG. :-) Preset feature, take the guess work out of blending. Cons - ridiculous price, if price is not an issue this is probably the blender you want to get.",
      "rating": 5.0,
      "verified": true,
      "author": "BXM",
      "helpful_votes": 2,
      "publication_date": 20140708
    },
    {
      "title": "Great product",
      "text": "I love it when something works just as it should. And this Vitamix does exactly that. Powerful, efficient, easy to use. I have used it 2-4 times a day in the 10 days I have had it. I have significantly increased our consumption of fruits and vegetables by making delicious soups and smoothies. It has been fun experimenting with different ingredients. My husband was annoyed at first because of the cost, but now he is very happy with my purchase. And it has a 7-year warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Sjhohman",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Overheating problem",
      "text": "This blender keeps turning off and over heating after less than 5 mins of use. I have contacted the seller and am awaiting response. I have only owned it for about 3 months and it is used less than once weekly.",
      "rating": 1.0,
      "verified": true,
      "author": "Trevor Miller",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Awesome machine and I'm having fun using it",
      "text": "Awesome machine and I'm having fun using it. Trying different combinations of fruit and vegetables but we have a limited supply of produce to use. Haven't tried gravel or nuts and bolts but I bet it would chew them up. Ok, probably not but it does a great job with anything else I've put in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Goat Herder",
      "helpful_votes": 0,
      "publication_date": 20160829
    },
    {
      "title": "BIG DADDY BLENDER!",
      "text": "It's a large profile machine, but it is amazingly quiet and productive. So far we've only used it to make my morning strawberry-banana smoothie and some ham salad (the ham salad turned out great tasting, however; the power of the Vitamix turned the mixture green due to the green onions) - should have hand chopped the ham.",
      "rating": 5.0,
      "verified": true,
      "author": "Samuel W. Pate",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "THIS IS THE BEST VITAMIX EVER",
      "text": "THIS IS THE BEST VITAMIX EVER!! I LOVE IT BETTER THAN MY OLDER MODEL. LOVE THE CONTROL AND USER FRIENDLY, REALLY MAKES THINGS SMOOOOOTH!",
      "rating": 5.0,
      "verified": true,
      "author": "Chiquita",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Pretty awesome mixer",
      "text": "Pretty awesome mixer. Had heard many stories about how great they were, but doubted all the stories. No need to doubt them any more, this is clearly a professional blender, makes the Ninja blender I owned look like a child's toy. Makes the best smoothies and sauces. NO MORE CHUNKS and pieces of veggies....",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie Porterfield",
      "helpful_votes": 2,
      "publication_date": 20160912
    },
    {
      "title": "VitaMix Versatility",
      "text": "The blender has the power and size to whip up anything",
      "rating": 5.0,
      "verified": true,
      "author": "BillJ",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "the recipe book is great as well",
      "text": "This is one incredible machine! If you are wondering whether or not to purchase it because of the price, do not hesitate. It lives up to every claim that Vitamix makes about it. It is high quality material and functions as described. No more wimpy blenders that break or get bogged down when full or with thick contents. This machine will power through anything you throw at it. And, the recipe book is great as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane Burris",
      "helpful_votes": 0,
      "publication_date": 20150504
    },
    {
      "title": "Excellent blender. I can die now",
      "text": "So expensive I had to wait until I was all grown up to buy this. Excellent blender. I can die now.",
      "rating": 5.0,
      "verified": true,
      "author": "My Opinion",
      "helpful_votes": 5,
      "publication_date": 20150915
    },
    {
      "title": "But Max is a great blender",
      "text": "The vita mix blender is like people say it’s a real workhorse it’s excellent I use it every day",
      "rating": 5.0,
      "verified": true,
      "author": "maureen",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Five Stars",
      "text": "Works great. Nice to know it is backed by a great warranty and made in America!",
      "rating": 5.0,
      "verified": true,
      "author": "Rand",
      "helpful_votes": 3,
      "publication_date": 20170118
    },
    {
      "title": "Five Stars",
      "text": "Used it everyday for two years now, no problems. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "MCM",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Deluxe",
      "text": "I drink fruit and vegetable shakes and got so sick of throwing out blenders. I invested. It's great. I'm not a chef But I'd say if you have the cash and you like throwing veggies or fruits together for your health which at this point We all should it's just so easy go for it. Why break and constantly be buying new ones",
      "rating": 5.0,
      "verified": true,
      "author": "Mermaidshopper",
      "helpful_votes": 0,
      "publication_date": 20140325
    },
    {
      "title": "Perfect",
      "text": "Love this one, doesn’t walk around the countertop, works great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cherie",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Five Stars",
      "text": "The blender arrived as described. It is a very powerful machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Nance",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "You Won’t be disappointed with this unit.",
      "text": "Can’t say enough about the quality and power of this unit. Surveyed the market and extremely happy we selected this unit. Love the self clean.",
      "rating": 5.0,
      "verified": true,
      "author": "bill",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Love it.",
      "text": "After using the nutribullet this is a dream. It cleans up so much easier, it is more quiet, and the chopping blending is much better. We use it several times aday. Love it",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20160922
    },
    {
      "title": "Very powerful.",
      "text": "Great heavy duty blender. I only wish it was easier to clean the blade.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Dicienzo",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "And we like buying from a company based in a Cleveland suburb",
      "text": "So far my family has observed a tremendous upgrade in performance compared to our Ninja. And we like buying from a company based in a Cleveland suburb.",
      "rating": 5.0,
      "verified": true,
      "author": "brian s heist",
      "helpful_votes": 0,
      "publication_date": 20170514
    },
    {
      "title": "Vitamix is the best.  You get what you pay for.",
      "text": "Quality is excellent, powerful and easy to use. The description on Amazon website listed as brushed stainless steel is actually just silver plastic. Not a deal breaker, but just know it is not stainless.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "Smoothie everyday",
      "text": "This was expensive, but worth it. I suggest the preset buttons. I thought at first that was overkill, but it make making a smoothie a breeze with the preconfigure programs. 7 Year warranty cannot be beat. It is like my Cutco Knives, seems expensive at first, but the buyer guilt quickly fades with each use, because these items are worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "The Zeppelin",
      "helpful_votes": 0,
      "publication_date": 20140608
    },
    {
      "title": "Great appliance!",
      "text": "Amazing machine! So much better than a standard blender for smoothies. I've used it everyday since I bought it and still don't feel like I've tapped into a tenth of its capability. The soups are piping hot. The self cleaner is a great help and much better than a blender type that has to be taken apart and washed by piece. This machine has given me a great way to get my veggies in each day. I love it!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CMT3",
      "helpful_votes": 0,
      "publication_date": 20141007
    },
    {
      "title": "Vitamix Professional Series 750 Brushed Stainless",
      "text": "I'm very happy with this purchase. It's a powerful machine and gets the blending job done... It's just what I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "jude",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "Unmatched!!",
      "text": "Good investment! This is the HIGHEST POWERED BLENDER I’ve EVER used. Easy to use and easy to clean. Worth every penny!!",
      "rating": 5.0,
      "verified": true,
      "author": "Zoe",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Good Times:(",
      "text": "After four years of every day being used it finally broke, it was always a five star product before today 10/21/2017. RIP",
      "rating": 3.0,
      "verified": true,
      "author": "The Rectofier",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Love love love it",
      "text": "Love love love it! It alleviates all the \"pre-chopping\" I use to have to do before putting frozen fruit in my blender, and does great in blending greens to a smooth consistency.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet G Smith",
      "helpful_votes": 4,
      "publication_date": 20151112
    },
    {
      "title": "Amazing, will take this blender to my grave lol ...",
      "text": "Amazing, will take this blender to my grave lol -- I feel that I could have saved some cash and gone with the version w/o the presets bc I don't really use them much now that I've got the hang of blending things but they are nice to have when following the vitamix recipes. Also, I'll probably by he 32oz container at some point to have the ability to make smaller batches of things.",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor Benyack",
      "helpful_votes": 2,
      "publication_date": 20140710
    },
    {
      "title": "I love this machine",
      "text": "I love this machine!!! It is getting me to eat healthier and can do more than any other machine I have ever used. It helps de-clutter my kitchen full of kitchen appliances and takes the place of the majority. I wished that I had found out about Vitamix when I was younger so I could have used it more and not gotten machines that are all subpar in comparison.",
      "rating": 5.0,
      "verified": true,
      "author": "ruth wagner",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "easy to intake",
      "text": "Luv it! This beast pulverizes fruits & vegetables into tasty, easy to intake, easy to absorb super healthy beverages. I'm eating ALOT more fresh fruits and vegetables then ever before, utilizing this product & it feels great! Expensive, but a Wise Investment if you use it regularly.",
      "rating": 5.0,
      "verified": true,
      "author": "John WA",
      "helpful_votes": 0,
      "publication_date": 20140718
    },
    {
      "title": "Vitamix Professional Series 750 Brushed Stainless Finish with 64-Oz. Container",
      "text": "Everything is great about the mixer, only thing I wish it had on it was a timer.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark R.",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Welcome to smoothie city",
      "text": "Works great. The programmed settings work well. Lots of power, like a small block chevy, braaap. Set it and forget it. Fits under cabinets nicely and actually makes soup hot and ready to eat. Who knew a blender heats up soup hot as its blending, blew my mind. Only complaint is I think the wash cycle is a little long and for the price, it should come with the stick and wrench. Should be the only blender I ever buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Ruzbasan",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Loving It!",
      "text": "Does everything I wanted and more. The 750 fits right under the countertops for easy storage",
      "rating": 5.0,
      "verified": true,
      "author": "TEEK",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "best blender ever its expensive but i dont think any ...",
      "text": "best blender ever its expensive but i dont think any blender can do what this does. its perfect! if you really use blender a lot buy this! its huge i thougth it was small but its very big, super easy to clean and to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "VITAMIX is the BOMB!!!",
      "text": "Love this product!! Smoothies are easy to make and has an incredible texture. Made veggie soup that was so easy to make. It was hot and delicious. Pretty much grinds anything I put in it. We also had comments from our friends who saw our Vitamix blender. They are envious and said that Vitamix is the BEST!! I totally agree!! IT IS THE BEST!!!",
      "rating": 5.0,
      "verified": true,
      "author": "CJ Ohana4",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "Works like a dream!",
      "text": "Delighted with my new although I’ve had it less that a week. Came as ordered and in excellent condition.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Dreisbach",
      "helpful_votes": 0,
      "publication_date": 20171219
    },
    {
      "title": "This blender is absolutely fantastic. Do your research online",
      "text": "This blender is absolutely fantastic. Do your research online, watch the videos comparing the Vitamix and the competition and in the end, this is the one you will purchase. Yes, it is expensive, but its well built and has a multitude of capabilities. I use it to make smoothies, soups, and deserts.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen Coleman",
      "helpful_votes": 2,
      "publication_date": 20140726
    },
    {
      "title": "THE BEST!",
      "text": "An amazing machine! You won't be disappointed. This blender is powerful, quiet, and fits under your cabinets! Vitamix is the best!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 6,
      "publication_date": 20140510
    },
    {
      "title": "Worth the extra price!",
      "text": "The best ever and looks great on the counter! Haven’t tried soups or ice cream but so far it’s wonderful!!! The program settings are the best and makes ease of use the best feature!",
      "rating": 5.0,
      "verified": true,
      "author": "Tommy Nowell",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Good health is priceless!",
      "text": "This machine will help you love to cook! From making chopping easier, to eating healthier, for ex. making smoothies, sauces, peanut butter, salad dressings, it goes on and on! It has changed our lives. This product is pricey but how it changes your life, for the healthier, is priceless!",
      "rating": 5.0,
      "verified": true,
      "author": "kristina pyle",
      "helpful_votes": 2,
      "publication_date": 20150918
    },
    {
      "title": "The King of Blenders",
      "text": "This is clearly the top dog in blenders. A monster workhorse. I make huge batches of frozen green smoothies. After a year of heavy use, my 750s (I have 2) show zero wear or signs of use. The lower profile makes it easily the best Vitamix model. Do yourself a big favor and go top of the Vitamix line. Well worth the extra $$.",
      "rating": 5.0,
      "verified": true,
      "author": "BilLowry",
      "helpful_votes": 0,
      "publication_date": 20140628
    },
    {
      "title": "Five Stars",
      "text": "It is so wonderful. Finally l can enjoy my smoothies",
      "rating": 5.0,
      "verified": true,
      "author": "Wang Pei",
      "helpful_votes": 7,
      "publication_date": 20170120
    },
    {
      "title": "PROFFESIONAL GRADE FOR IN HOME USE!",
      "text": "PROFESSIONAL GRADE ITEM IN OUR HOME. IN CONSTANT USE. LIFE AND TIME SAVER!",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph Foster",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "On/off button broke after 25 uses.",
      "text": "Machine worked great until the on off button got loose and stopped sitting flush in its housing. While trying to gently move it back into position the button broke apart into about 5 pieces! Not something I expected from a $700 blender with such few uses. Now I'm trying to figure out if it's worth the shipping to return for repair. Really disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 8,
      "publication_date": 20150328
    },
    {
      "title": "Top of the line if you can bite the bullet on the price.",
      "text": "Top of the line, what can I say. I've pondered getting one of these for years and finally \"bit the bullet\" on the price... We'll see if it's worth the money in the long run, but it certainly outperforms my other blenders I've had.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse L.",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Without equal",
      "text": "This blender is in a class of its own. This is the second Vitamix that I have owned. It is a mainstay in my quest to live a healthy life style but even more than that. It can easily replace a number of other kitchen appliances. If you are a smoothie guy, which I am, this is the finest piece of equipment in the world. It is worth every penny spent! You will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Marshall",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "Makes the best smoothie without a problem",
      "text": "Makes the best smoothie without a problem. Have enough horsepower to plow through pineapple cores and blend it into my smoothie.Also I love my smoothie thick like ice creme and this mixer never fails me ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Dot",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "smoothies are fantastic; houmous is fantastic",
      "text": "it is a very hard working machine! smoothies are fantastic; houmous is fantastic; still working on soups but made a very good pea soup so i am optimistic.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. P. Czyzak-dannenbaum",
      "helpful_votes": 2,
      "publication_date": 20141130
    },
    {
      "title": "GREAT!",
      "text": "Has revolutionized what I eat. I now always have a smoothie ready to go instead of chips, pretzels or ice cream. Just make sure you choose recipes that balance protein with carbs, especially if you make fruit smoothies. Have not tried the soups yet, but looking forward to that in the winter.",
      "rating": 5.0,
      "verified": true,
      "author": "Dad of Four",
      "helpful_votes": 2,
      "publication_date": 20140729
    },
    {
      "title": "Vitamix",
      "text": "I had an earlier model of the vitamix which I love, and ordered this second one for my daughter. Nothing beats a Vitamix.",
      "rating": 5.0,
      "verified": true,
      "author": "K. A. Kelsey",
      "helpful_votes": 0,
      "publication_date": 20140306
    },
    {
      "title": "Five Stars",
      "text": "Best blender money can buy. Forget the touch Panel model go for this one !",
      "rating": 5.0,
      "verified": true,
      "author": "A Jones",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "I love it!",
      "text": "It works solo good!!!! If you want a perfect smooth, take it! Through I though it was a little expensive, now I think it is worth.",
      "rating": 5.0,
      "verified": true,
      "author": "annasui44",
      "helpful_votes": 0,
      "publication_date": 20140320
    },
    {
      "title": "YASSSSSSSSS",
      "text": "i use this thing EVERY DAY. right? who uses a blender every day? PEOPLE WHO OWN VITAMIXES THATS WHO. omg your life will change. just buy it. also, it cleans itself so you can't lose!",
      "rating": 5.0,
      "verified": true,
      "author": "Collin McMichael",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Five Stars",
      "text": "This machine does everything I want it to: juice, blend, and process. Use it everyday.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick Vaughan",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "The Vitamix is probably the best kitchen appliance we have ever purchased",
      "text": "The Vitamix is probably the best kitchen appliance we have ever purchased. My wife uses it daily to make shakes, etc. It is super easy to clean and maintain. It is super powerful and has been a blast to use on a variety of recipes.",
      "rating": 5.0,
      "verified": true,
      "author": "naples98",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Five Stars",
      "text": "We love our vitamix. It's great for juices, smoothies and soups!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160312
    },
    {
      "title": "Best of Breed, Well Worth the Money",
      "text": "I looked at several brands and also all of the Vitamix models. This unit is by far the best brand and this model is outstanding as it has the upgraded 2.2 hp motor and the 64oz container that fits under a standard cabinet when sitting on a counter. It is amazing to watch and creates piping hot soup too! Very Happy with this purchase. Well worth the $$.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Van Riper",
      "helpful_votes": 0,
      "publication_date": 20140327
    },
    {
      "title": "The Vitamix is simply awesome!",
      "text": "Very easy to clean and the whole family can use it. In fact we are using it at least 3x a day and sometimes more. It blends virtually everything we put in it with ease, and we have made everything from smoothies to soup to ice cream. One of my best purchases ever!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerrie C. ",
      "helpful_votes": 0,
      "publication_date": 20160913
    },
    {
      "title": "WOW",
      "text": "So, purchased this unit after burning out 3 other blenders(1)Oster(2)Kitchenaid(3)Blendtec. Obviously a little aprehensive about spending this much on a blender but so far its awesome, powerful and quiet. As far as reliability not sure as have only owened it for 3 weeks....",
      "rating": 5.0,
      "verified": true,
      "author": "The Boss",
      "helpful_votes": 2,
      "publication_date": 20140311
    },
    {
      "title": "Great Purchase",
      "text": "This machine proves that you get what you pay for, although pricey it's worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy Pullen",
      "helpful_votes": 2,
      "publication_date": 20151030
    },
    {
      "title": "Reliable.",
      "text": "Very easy to use. I make smoothies with this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy W. White, Jr.",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Mostly happy........",
      "text": "Works pretty well. Had to send it in after only a couple of months as the drive socket made a bad sound after trying to make a smoothie with frozen strawberries. Vitamix sent out a return label and fixed it very quickly for me, but after spending so much money on a blender, I am surprised the blender couldn't handle the frozen berries! I have seen the BlendTec machine chop up a block of wood! Now it seems to be working well, but we will see. I was very impressed with the customer service though and this does have a 7 year warranty.",
      "rating": 4.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 3,
      "publication_date": 20140821
    },
    {
      "title": "Worth the money",
      "text": "Best blender that I have ever owned the last one I will need to buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Five Stars",
      "text": "This blender rocks! I'm a fitness enthusiast who primarily uses this to make two smoothies a day!",
      "rating": 5.0,
      "verified": true,
      "author": "bryan turner",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Great product overall",
      "text": "Great product overall. Kale, blackberry seeds, chia seeds all chopped into a smooth and drinkable mixture without any issues. The presets allow for the machine to work and me to focus on other tasks in the vicinity. This product quickly became a daily time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew W.",
      "helpful_votes": 0,
      "publication_date": 20151031
    },
    {
      "title": "Beat out all the others in test results compard to.",
      "text": "So far so good. With all the research I did on all the models this was hands done the best of them all. Even watched demos on YouTube comparing them with other units it came out on top ever time there are a couple units that were just as good very close. This is the same as the VitaMix 780 just not touchscreen why pay so much more for the same machine not hard to use the dial vs a touchscreen. You don't need sharp blades to do the work like those made in China no turtle power needed with sharp blades and plastic parts.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike D",
      "helpful_votes": 2,
      "publication_date": 20160202
    },
    {
      "title": "iit is excellent product, a true profesional one for the",
      "text": "iit is excellent product, a true profesional one for the price",
      "rating": 5.0,
      "verified": true,
      "author": "juan soto",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Couldn't be happier.",
      "text": "Well engineered. Powerful motor and extraordinarily sharp blades. Even has a cleaning cycle. Couldn't be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas S. Allen",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "Tremendous",
      "text": "Powerful,great quality and you will be happy that you paid the price",
      "rating": 5.0,
      "verified": true,
      "author": "REPUBLIC MAN",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "Ohhhh my God, do not know what to say!!!",
      "text": "Just have it for a week and I lover everything I tried to make with the Vitamix blender, I will get more updates soon.",
      "rating": 5.0,
      "verified": true,
      "author": "G-Man",
      "helpful_votes": 0,
      "publication_date": 20140604
    },
    {
      "title": "THE BEST blender on the planet!",
      "text": "Really...if anyone gives this blender less than perfect score, you got a bad one (I even have a hard time calling it a blender). I am elated that this is sitting in my kitchen getting used almost every single day and sometimes more than 3 times per day! This is by far the best investment I've made in the last few years. I don't know how I got away without one until now. I wish I had LOTS of $$$$ - I would buy one for each member of my family.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarasan",
      "helpful_votes": 3,
      "publication_date": 20150120
    },
    {
      "title": "Wonderful Therapeutic Machine!",
      "text": "I purchased the Vitamix a few weeks before my mom was diagnosed with ALS (Lou Gehrig's Disease) and as her disease progressed, she is unable to eat solid foods. I've been pureeing her foods in the Vitamix, making soups, sauces and desserts which blends to a wonderful smooth consistency where she is able to eat without choking on any pulp. I'm so thankful for this machine! I use it everyday to prepare foods for my mom and family. I don't know what I'd do without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sukie",
      "helpful_votes": 4,
      "publication_date": 20140318
    },
    {
      "title": "Five Stars",
      "text": "SMOOTHIES are the way to go. You need a powerful blender and THIS is the one..",
      "rating": 5.0,
      "verified": true,
      "author": "marlys norby",
      "helpful_votes": 0,
      "publication_date": 20150115
    },
    {
      "title": "The best",
      "text": "We just love it. Makes the best smoothies ever. Very powerful. Worth every penny! Grinds and mixes quickly and expertly.",
      "rating": 5.0,
      "verified": true,
      "author": "JAG51",
      "helpful_votes": 0,
      "publication_date": 20140228
    }
  ],
  "product_meta": {
    "title": "Vitamix Professional Series 750 Brushed Stainless Finish with 64-Oz. Container",
    "description": "Color:Brushed Stainless FinishVitamix Pro Series 750 in Stainless steel pvc base tritan brand, BPA free 64 oz. Co-polyester (No Suggestions) brand rubber lid stainless steel blades food contact zones are all BPA free Measures 8. 8\" W x 9\" D x 17. 4\" Weight 12. 5 lbs. Ul listed120 volts, 1200 watts7 year manufacturer's",
    "rating": 4.7,
    "feature_bullets": [
      "Pvc plastic BPA-free housing in stainless steel",
      "2. 2-Peak-horsepower motor and wide blade radius",
      "2-Piece Neoprene rubber lid with a removable plug for adding ingredients while use",
      "Stainless steel blade construction",
      "64-Oz. Carafe is BPA-free Eastman Tritan polyester"
    ],
    "specifications": {
      "Product Dimensions": "7.72 x 9.41 x 17.4 inches",
      "Item Weight": "12.46 pounds",
      "Department": "Kitchen",
      "Manufacturer": "Vitamix",
      "ASIN": "B00C6MWPNK",
      "Item model number": "Pa-1957-rent",
      "Customer Reviews": "4.7 out of 5 stars720 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#124,370 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 3, 2012"
    },
    "categories": [
      "Small Appliances",
      "Home & Kitchen",
      "Countertop Blenders",
      "Blenders",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}