{
  "website_summaries": [
    {
      "verdict": "High quality BPA-free plastic food prep and storage containers that are sturdy and convenient.",
      "pros": [
        "These freezer, microwave, and dishwasher safe BPA-free containers get top marks for being versatile and durable",
        "Owners praise them for being a good value for the cost, convenient, and easy to stack in the refrigerator, freezer, or cabinet"
      ],
      "cons": [
        "Some owners had issues with the containers warping or becoming damaged after use in the microwave"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Rubbermaid is one of our favorite and most reliable manufacturer - we bought 3 sets ...",
      "text": "Rubbermaid is one of our favorite and most reliable manufacturer - we bought 3 sets on lightning deal - a real bargain ... however ... it turns out that after a few times in the dishwasher on top rack and without any heated drying, they are pitting and the inside has fallen apart. Made in China garbage - steer clear this was a waste of money ...",
      "rating": 1.0,
      "verified": true,
      "author": "ASU",
      "helpful_votes": 20,
      "publication_date": 20161130
    },
    {
      "title": "Finally, a solution to Tupperware lid/container management",
      "text": "My wife bought these for me after I was going insane spending 20 minutes every time I needed to find a right sized Tupperware for leftovers. This set only has 3 sizes of lids and the lids stack and lock to each other as well as the bottom of the containers they cover. The containers stack as well, and the different sized containers can nest inside each other. However, I like to keep stacks of containers that fit specific lids in separate stacks so I don't have to pull containers out of each other. These are perfect for people who are OCD about their food storage containers and like to keep them in nice stacks.",
      "rating": 5.0,
      "verified": true,
      "author": "AD28",
      "helpful_votes": 18,
      "publication_date": 20160125
    },
    {
      "title": "Two years on -",
      "text": "Several are stained, especially from tomato based food. They leak so be careful of that. Another review mentioned pitting and mine developed that early on. If you're a crafter, have a screw loose ;) or have some other need for tiny containers, you'll like having them but they're not useful for food leftovers. I have arthritis in my hands and that has become my biggest problem with them. I'm here today to hunt for a set that I hope will be easier to open and close. All in all, I wouldn't recommend this set.",
      "rating": 2.0,
      "verified": true,
      "author": "BhB",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Good product but water pools when drying",
      "text": "Good product for the price but definitely some cons. 1. Due to the shape of the top and bottom it's impossible to get them to dry in the drainboard without water pooling somewhere. 2. Not very thermal or microwave proof. In the dishwasher they have gotten thermal cracks. In the microwave they get that old plastic dish scuffed up dirty wall look (not sure how else to describe it). Pros 1. They stack really nicely and clip into each other which prevents them from falling and getting disorganized. 2. All different shapes and sizes really do accommodate most needs. Overall I might buy this product again but would probably prefer stackable glass storage supplies for the cons listed.",
      "rating": 4.0,
      "verified": true,
      "author": "Phil&Becky",
      "helpful_votes": 0,
      "publication_date": 20180729
    },
    {
      "title": "Good until teenagers loose them",
      "text": "My irresponsible sons lose countless food containers, in their basement lair, each year. I don’t know what happens to them but we are constantly faced with an array of mismatched tops and bottoms. I am continually buying this set to get enough tops to match the bottoms. My wife suggests just using a food trough and some straws for feeding time since our sons act like they were raised by pigs. My wife is wrong, pigs are much more intelligent than my sons.",
      "rating": 5.0,
      "verified": true,
      "author": "Sad Hubby",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great rubbermaid product",
      "text": "Very great quality tupperware. Could easily toss my lunch bag around and not worry about my food exploding and making a mess. Microwave and dishwasher without a concern. They snap and stack so storage becomes easier than your typical tupperware. One downside to this set is for food prepping they have some that aren't particularly useful when you're prepping a hefty size entree for a couple of days. Other than that they get the job done well. The sauce/topping size ones are particularly useful even when you're going to consume something right away. Great for putting ketchup in and chomping down on some fries!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Painter",
      "helpful_votes": 3,
      "publication_date": 20151001
    },
    {
      "title": "I love these rubber made containers",
      "text": "I love these rubber made containers. I put all my leftovers in them and I through away my odd margarine containers and take out soup containers. More organized and they all fit together nicely. My only complaint is that it came in a big cardboard box and not a box made for these containers. That was odd and made it difficult to gift to someone else. Packaging was weird. I purchased these elsewhere and they came in their own box.",
      "rating": 5.0,
      "verified": true,
      "author": "Tabula Rasa",
      "helpful_votes": 2,
      "publication_date": 20170331
    },
    {
      "title": "The basic, ideal tupperware set for anyone who does meal prep",
      "text": "Great variety of sizes - ideal for storage in the fridge and for taking lunches on the go to work. I have no complains except that (to be honest) the \"leak proof\" value is not the best. If you are putting leftover soup in the fridge and it gets jostled around a bit you'll be fine...but if you're like me and you bring single serve portions of salad dressing to work, I would put the small containers in a Ziplock bag - otherwise expect your lunch box to smell like dressing and be greasy.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie Leist",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Durable and keeps foods fresh for a long time!",
      "text": "I’ve had this set for a few years now. They’re durable, dishwasher safe, and clean easily. I wouldn’t recommend microwaving things with red pasta sauce or lots of grease as they tend to stain or somehow withhold the food smell. I love that the kids snap together and bowls will stack neatly in my cabinet. No more plastic catastrophe when looking for a dish for leftovers. They seal tightly to keep whatever you have fresh. I’ve forgotten about dishes that were pushed to the back of the fridge many times and not a single (wasted) meal ever grew mold.",
      "rating": 5.0,
      "verified": true,
      "author": "TruthBeTold",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Long-lasting, sturdy",
      "text": "These containers are great, and the variety of sizes offered are perfect for containing anything from large meals to ground spices. These have been a staple in my house for a long time. They are usually fairly leak-proof, though I recently had an incident where one of the smaller containers leaked out soy milk, which soaked my backpack and the papers in it. So be careful transporting liquids!",
      "rating": 5.0,
      "verified": true,
      "author": "Eve",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Check Plus! Good for meal prep!",
      "text": "At first I was going to give these a bad review sheerly because when the box arrived it was just a bunch of these in an amazon box - as in no brand box or wrapping or anything and they were covered in dust. I was seriously about to return them but I really needed food containers for my packed lunches. I ran them through the dishwasher twice before I used them and I haven't died yet (nor have they). Quality product and I love the cabinet cleanliness they provide with the snap together lids and containers.",
      "rating": 4.0,
      "verified": true,
      "author": "Maandy",
      "helpful_votes": 3,
      "publication_date": 20150827
    },
    {
      "title": "Lids won't stay on containers",
      "text": "I was disappointed with this set. I thought for sure Rubbermaid would be a good and well known brand to go with for new containers. I don't know if I got a defective set, but the lids won't stay on the containers. I have had multiple times where my food is spilled in my lunch because the lids don't stay on and went to grab containers out of the fridge and the lid won't be on it securely anymore. Really disappointed in this product. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20160613
    },
    {
      "title": "These are nice, but I would have liked this set to ...",
      "text": "These are nice, but I would have liked this set to come with more of the larger containers instead of the smaller containers. I would say that the sizes of the containers that this set comes with are disproportionate, with alot more of the containers being smaller, which makes me feel as if I did not really get my money's worth. Overall a good set of containers for packing food for work or school. Helps me save money, rather than just spending it constantly on eating at restaurants during school or work breaks.",
      "rating": 4.0,
      "verified": true,
      "author": "Janelle",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Check walmart for possibility of lower price- good product at good price",
      "text": "After getting tired of the mess of mismatched containers in our cupboards I bought these and threw away the old mismatched containers. Pros: relatively inexpensive, stack well, thicker than some competitors, lids snapping together is a huge advantage Cons: My family still does not take the time to stack them up nice so my cabinets are still unorganized.... but not as unorganized as before and since they all match finding a lid that fits is much easier",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Look elsewhere",
      "text": "If you're looking for something that's easy to use, look elsewhere. The lids on the smaller containers are next to impossible to put on. I finally got one in place, using both hands and all my weight pushing down on it from above. Very difficult to remove, too, without spilling whatever is inside. Hey, Rubbermaid, I dare you to publish a video of someone trying to attach one of these lids. It will, no doubt, end with the container being thrown in the trash. The larger containers aren't quite as hard to seal, but still a pain, which is why I rated the set at two stars instead of one. Easy to see why the set is on sale.",
      "rating": 2.0,
      "verified": true,
      "author": "NickdeckTop Contributor: Cooking",
      "helpful_votes": 2,
      "publication_date": 20151219
    },
    {
      "title": "Great containers!",
      "text": "I have one set of these already. I liked the first set so much I wanted a second set. These are nice and thick containers. The lids are very nice and don't crack. They are more flexible than the cheaper containers.( I have donated all of my glad wear and other cheap containers since getting the second set.) The space saving feature of stacking the lids underneath the container is wonderful.The lids stay together so no more sliding lids. I love that I do not have to search for which lid goes with which container. They wash up great in the dishwasher. ( I only put them on the top rack) I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "galily43",
      "helpful_votes": 0,
      "publication_date": 20161004
    },
    {
      "title": "... of these I purchased a few years ago and loved them. They stack perfectly and all the sizes ...",
      "text": "I had a set of these I purchased a few years ago and loved them. They stack perfectly and all the sizes are easy to keep sorted. When I needed to purchase another set (because why would my husband bring containers home with him from work lunches!) I found another set with red covers and assumed they were the same.  I was very disappointed! What arrived was the thin, shiny type plastic. I went back to search again and found this was the set I originally ordered. There is no comparison. This set has thick plastic covers and containers. They are perfect in the freezer where the other type will crack.",
      "rating": 5.0,
      "verified": true,
      "author": "Younmeplus8",
      "helpful_votes": 0,
      "publication_date": 20161129
    },
    {
      "title": "I love the containers and covers",
      "text": "This is the second set of these I have purchased. I love the containers and covers. My only problem is that I now have a LOT of those little tiny ones that I have absolutely NO need of. I am going to donate them to the school art teacher, she says she can use them for paints and such. Why can't I get a set without sizes I have no need for? I don't mind donating the extra, but, I am on a fixed income and can only afford so much. :-)",
      "rating": 4.0,
      "verified": true,
      "author": "Larry",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Completely Functional - You Get What You Pay For",
      "text": "Not exactly what I was hoping for, but for the price, I can't complain. I use them to store dry goods like rice, beans, flour and pancake mix, and thus successfully eradicated a very persistent moth issue. I had trouble finding anything to use the small containers for - and there are a lot of them - but I've been freezing excess sauces in them and using them for beads and things. Also, they're apparently the correct portion size for nuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Catie",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Happy Mom, Happy Daughter!",
      "text": "Purchased these as a gift for my mom who was still using her now warped Tupperware from the 50-60's. I purchased the 42-piece set. She loves them - the most wonderful part is that while you have many sizes of containers, there are only 3 sizes of lids....because the container size varies by height only. So no more fussing with so many lids to find just the right one. My mom stacks the lids in three piles and same with the containers...three stacks. The containers and lids seem very durable and NO BPA! Next up, I'm buying a set for myself and for gifts!!! Happy Mom, Happy Daughter!",
      "rating": 5.0,
      "verified": true,
      "author": "frequentflyer",
      "helpful_votes": 0,
      "publication_date": 20161108
    },
    {
      "title": "Rubbermaid is the best for food storage containers!",
      "text": "Great set of storage containers that inckudes various sizes and 2 or 3 of each size at a bargain price. Secure lids protect and seal to keep leftovers frsh or even freamsh fruits and veggies can be stored in these to keep them fresh for longer. There were enough containers and matching lids in this package for me to split them with a relative guving them half and keping other half for myself and e each have plenty of each included size for each of our needs with just a ine package ourchase at a very reasonable inexpensive price!",
      "rating": 5.0,
      "verified": true,
      "author": "TranquilOne",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Love this set",
      "text": "These were purchased as a gift as we already had the set. We love them as well as the couple we gave them to. They take up little room on a shelf as they fit inside each other. There is no problem finding the right lid to fit as they are made so as to be the same size (4 different sizes for all of the containers). I highly recommend them. P.S. You can order larger individual pieces to match this set on-line or buy at a Walmart.",
      "rating": 5.0,
      "verified": true,
      "author": "AZ golfer",
      "helpful_votes": 2,
      "publication_date": 20161112
    },
    {
      "title": "Simply the best containers on the market!",
      "text": "This is a great set of food storage containers. It is the second time purchasing this set. The first being a few years back. Unfortunately we started loosing them( I am convinced my wife kept leaving them at work but she says no...) None the less these work great and are high quality containers. They are microwave and dishwasher safe. I have been in the Rubbermaid facility where they test these products and what I can say is Rubbermaid does care about their products quality. They make them to last a lifetime... well as long as your wife does not leave them at work that is...",
      "rating": 5.0,
      "verified": true,
      "author": "pdas980",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Perfect wedding gift",
      "text": "I love my own set of these, so I was happy to see that my nephew had them on his wedding registry. I have had multiple sets. They do get worn over time, especially when I store tomato sauce or other acidic things in them. They're dishwasher safe, and they nest nicely for storing in a drawer. The lids stay on well and keep them sealed.",
      "rating": 5.0,
      "verified": true,
      "author": "dadisme",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "they stack easily and neatly in my cabinets",
      "text": "I had 3 different brands of tupperware in my cabinets which all looked identical, yet none of the lids could be mixed and matched. I ended up throwing them out and bought this set to replace them because I was sick of constantly searching for the right lid. I didn't realize when I bought these that the lids snap to the bottom of the containers, so it made my life even easier; they stack easily and neatly in my cabinets. I've found Rubbermaid to be one of the better brands because I've never had an issue with the lids leaking or cracks forming on the container.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 2,
      "publication_date": 20160715
    },
    {
      "title": "Great space-saving storage solution",
      "text": "These containers solve a storage problem because you can nest the lids and containers into tidy stacks. Plus, they reduce odor problems caused by storing closed, pre-used containers. They're outrageously expensive in stores, so this set was a great price. My only complaint (which resulted in a lost rating star) is that there were too many of the tiny containers. They do come in handy occasionally, but no one needs so many. I guess crafters who need storage for tiny parts might love them, though.",
      "rating": 4.0,
      "verified": true,
      "author": "Mother Of Monty",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Very nice storage and reheatable set",
      "text": "I gave this set as a gift to someone last year for the holidays and now I have purchased one for myself. I love the fact that they are nestable sizes and that the lids all stack underneath the storage bowl. There are more than enough pieces and if you care for them properly they will last for a long time. They are safe for the microwave and to store leftovers in the refrigerator. My favorite size is the smallest because I can keep little things like bobby pins in them and they can go in my beauty closet rather than for food. We are 2 people in my house and this is a good size set for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie70",
      "helpful_votes": 0,
      "publication_date": 20161005
    },
    {
      "title": "The new ones are identical and are fine in the microwave",
      "text": "We have the same set that we bought from a brick and mortar store last year and needed more. The new ones are identical and are fine in the microwave. The reason for 4 stars is that the lids seem just a little thinner. However, they came in a Rubbermaid box and are legit Rubbermaid as far as I can tell. I weigh my food for training / weight loss and these are perfect for a versatile meal.",
      "rating": 4.0,
      "verified": true,
      "author": "Martinson",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Way too many tiny containers, but still good for the price.",
      "text": "I bought these for taking my lunch to work. The sizes you get in this set are kind of odd. You get over half of them really condiment holding sized, and only a few larger pieces for meals or packing lunches. A couple will fit a sandwich and the other larger ones are good for leftovers. It feels sizing was done this way to up the selling point for quantity, but even so, the usable sizes you do get are plentiful for the price point, which is why I got them. But still, not sure what to do with 10 condiment sized containers....",
      "rating": 3.0,
      "verified": true,
      "author": "Cinema4",
      "helpful_votes": 3,
      "publication_date": 20151219
    },
    {
      "title": "Good value, nice, sturdy, safe",
      "text": "I love these - it's a great value for a great product. They are microwave- and dishwasher-safe, and BPA free, and they don't spill and have held up pretty well over the time that I've had them. Sometimes it can be hard to clear the smell out of them if you hand-wash them, but one round in the dishwasher and they're usually good to go. The only thing I would say is that some of the containers are awkwardly small, and some are awkwardly large - like there aren't enough of a good medium size that I use super often. But it works out fine, I've ended up using allof them in some manner or another.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "LOVE IT!  LOVE IT!",
      "text": "The Rubbermaid Easy Find Lids Food Storage Containers are a hit! they nest well and the once cluttered drawer looking for lids and bases is now neatly organized! Love it! Love it! But, BEWARE...once you send food home in them with your children or friends, you may not get them back!",
      "rating": 5.0,
      "verified": true,
      "author": "bookworm",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Regular purchase for me.  I give them as gifts.",
      "text": "I always wait until these are on sale for $20 and then buy some more. I even give them as gifts for weddings. They perform well, are durable, and the sizes are useful. My only knock, if you can call it that, is that there are too many of the tiny ones in the box. Beyond that I love them. Obviously these are plastic so, don't microwave liquid viscous food like chili in them unless you want them stained or slightly burnt around the top edge where the liquid boils. Pay attention and they will serve you well.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiger88",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Great food storage solution!",
      "text": "As always, Rubbermaid makes good products. The nice thing about these is all the bulls and all the lids all fit inside one another and lock to each other. So in storage and in the fridge you can physically snap them together so they all stay well stored. We store the whole set in a small plastic bin drawer in the kitchen. Such a space-saving product!",
      "rating": 5.0,
      "verified": true,
      "author": "G. Quan",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Could use a better anti leak design",
      "text": "I like the design and functionality of this product. The ability to stack all the containers and lids on top of each other saved space in my kitchen cabinets. However, this product's design can improve in the anti leaking department. I had a lot of trouble using these to carry soup around for lunch in the winter since they somehow manage to leak a bit at the entrance way of the container. Really good product for solids just be mindful when storing away liquid products.",
      "rating": 4.0,
      "verified": true,
      "author": "D.L",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "They're inexpensive and will serve a temporary purpose,",
      "text": "I had the original Rubbermaid containers that look like these but were made of a heavier clear plastic versus these flexible plastic containers. The tops on these are nearly impossible to snap on and make sure it is secure. We've had a couple of accidents because the lid had not been pressed down on all 4 corners. They're inexpensive and will serve a temporary purpose, but if I had to do it all over again, I would have looked for the more substantial containers.",
      "rating": 3.0,
      "verified": true,
      "author": "Santa Cruz Mountains",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "Don't waste your money!",
      "text": "These are TINY!!!!! Not at all what was advertised!! Very disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa",
      "helpful_votes": 10,
      "publication_date": 20170603
    },
    {
      "title": "Great set",
      "text": "Love these tupperware!!!! This is the second time I buy these in this brand. First this was a great deal compared to anywhere else. Of course all tupperware starts to disapear slowly but surely so I bought this set. Had a ton of them they are even better because they stack and lock whether it's just the lids by themselves or the containers with the lids they lock well. Never had any of them leak or spill open. And of course they are sturdy and easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Yens",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "They are cheap for a reason",
      "text": "These are the cheapest set for a while! Not microwave safe, if to heat up anything even a little bit and put a lid on, they collapse into themselves, distorting the bowl and the lid to where they are unuseable....skip these bowls",
      "rating": 1.0,
      "verified": true,
      "author": "Guy in Arizona",
      "helpful_votes": 6,
      "publication_date": 20160612
    },
    {
      "title": "... these as a lightening deal because it was too good to pass up",
      "text": "Bought these as a lightening deal because it was too good to pass up. They are sturdy and the lids secure easily and stay secured. Many different sizes to accommodate anything so far. Only negative is that they are very plain, just clear plastic. The model we had before had a decorative style etched into the sides so we were a little spoiled. That's a nice to have and we knew when we purchased what to expect. Overall, if you need for storage they will meet expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "are square so make use of space better, and the lids sort of click in place ...",
      "text": "My husband is a lifelong Tupperware supporter. Sure they have a lifetime warranty, but they're also insanely expensive and take up a lot of room. These nest perfectly, are square so make use of space better, and the lids sort of click in place with each other and the container making my plastic food storage cabinet extremely organized. I've always liked Rubbermaid products and they've helped me organize my kitchen. Some of these containers will crack if they're full and dropped from 5 feet off the ground (I'm a little clumsy) but that's honestly to be expected. Dropped from a shorter distance and they're fine. I'd honestly choose Rubbermaid over Tupperware every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Manda",
      "helpful_votes": 0,
      "publication_date": 20150313
    },
    {
      "title": "Buy the more expensive version",
      "text": "These don’t hold up they stain and the insides of the container deteriorate after a while! Bought these and the more expensive clear containers with the black lids at the same time. Buy up! I have owned them both for over a year now and the more expensive ones hold up a lot better!!",
      "rating": 2.0,
      "verified": true,
      "author": "gtg",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Good Storage, Good Value, Good Quality",
      "text": "This is a nice set of food storage containers as the bases are very clear, they clean easily, and next nicely. The lids can be snapped onto the bottom, but even better is to stack them on top of each other. They are BPA free, and my only complaint is that the original lids -- which were not BPA free were more flexible and easier to use -- but Rubbermaid is to be commended on making the product safer. (As long as I don't use the original black lids in the microwave, they are fine for safety. I don't recommend using lids in the microwave anyway. Use wrap, a paper plate or a plate from the dollar store.)",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanne B.",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "Durable, useful.",
      "text": "Ordered these because I had one or two pieces given to me and found them durable and handy and realized I could really use a few more. A set seemed the way to go. I was taken aback at first by the sheer amount of small containers- condiment or snack sized at best- but they've turned out more useful than I expected. In fact I use them more often than the larger containers; to mix small amounts of sauces in, to hold small measurements of ingredients while I'm cooking, to store small amounts of leftovers or snacks. The larger containers are exactly what I expected and wanted originally, so overall I'm very satisfied with this set.",
      "rating": 4.0,
      "verified": true,
      "author": "Foxfen",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Good set with lots of items",
      "text": "Bought this for a friend and she adores the set. She had wanted a set for storage and when she got this one, she cried. I know, who cries over plastic. However, she was overwhelmed that she finally got something she really wanted. Glad I bought this set. The set has a lot of pieces and does nest well and many of the items can exchange tops. I personally like this as I find that I have left the lid on the stove and melted it. Not a brilliant move but was glad that I had another one to use. Rubbermaid is still the one to beat when it comes to storage plastic sets.",
      "rating": 5.0,
      "verified": true,
      "author": "Dr. J",
      "helpful_votes": 0,
      "publication_date": 20151110
    },
    {
      "title": "I found it actually pretty funny. We dont see much of a need ...",
      "text": "I would have given this item 5 stars had it arrived with ALL the components. This particular order was missing the 5 .5 containers. We had the lids but no containers. I found it actually pretty funny. We dont see much of a need for the .5 containers seeing as they are Extremely small for us but nonetheless we paid for them and didnt receive them. We dont want to go through the hassle of returning and getting them replaced so we just left it as is. You should double check the items when they arrive.",
      "rating": 2.0,
      "verified": true,
      "author": "Edgar",
      "helpful_votes": 2,
      "publication_date": 20160517
    },
    {
      "title": "I like Rubbermaid. But this experience was disappointing",
      "text": "I like Rubbermaid. But this experience was disappointing. I was missing lids in the first order then had a defective part on the second. Third time was fine. That is not right.",
      "rating": 1.0,
      "verified": true,
      "author": "Debby",
      "helpful_votes": 5,
      "publication_date": 20170606
    },
    {
      "title": "Great value",
      "text": "For 16 bucks, its hard to beat this pack. First off, the sheer amount of them included covers most of your basics. Need a container for left over quinoa? Check. How about a couple of containers for some kids snacks for that hike? Check. Tired of eating fruits/veggies that have been bruised or smashed in the ziploc bag you bring to work? Bingo. Seriously, just throw away all your other Tupperware and just use these, no more messing around looking for a top that fits the proper container. Also, significantly reduce your reliance on plastic baggies! Save the planet people! One bag at a time!",
      "rating": 5.0,
      "verified": true,
      "author": "SagansEuphoria",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "This is a very good set with just the right amount of various sizes ...",
      "text": "This is a very good set with just the right amount of various sizes containers. They freeze well also as they have very tight fitting lids that help prevent freezer burn. Just remember, people, if you keep your freezer below 0 degrees, you will not have to worry about freezer burn as it cannot develop below that temperature. These containers also do not stain easily from foods like spaghetti sauce. Will be ordering another set while they are on sale as mine seem to disappear over time...I think they have something going on with the socks that disappear from the dryer.",
      "rating": 5.0,
      "verified": true,
      "author": "Trishakers",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "42 Piece Plastic Rubbermaid",
      "text": "When the package arrived it looked as if they only sent 3 sizes, when I took it out to examine I found the following of each size: Five 4oz Five 1.25 cups Five 2 cups Two 7 cups Two 5 cups Two 3 cups That does equal 21 containers + 21 lids which does equal 42 pieces. They seem to be of good quality, the only reason why I gave 4 stars instead of 5 is because some of the lids seem to be scratched up. Almost looks like it is not completely brand new. Although the condition is slightly flawed, it is not a big enough issue for me to send it back.",
      "rating": 4.0,
      "verified": true,
      "author": "Alethea Coker",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "I highly recommend this product to anyone who wants to give bacteria ...",
      "text": "Even though the name of this company could reasonably be confused as the sobriquet of someone with a sexual fetish, they produce an outstanding product! No more lost lids, as I simply snap them to each other and \"bind\" them on the bottom of their respective containers, and then shove them into my cupboard! Thanks to Rubbermaid, my pork chops have now been disciplined into rejecting the seductive advances of unwanted spoilage! I highly recommend this product to anyone who wants to give bacteria a sound spanking! Five Stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Yodamazon.",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "I love them you will too.",
      "text": "Just good product I bought this brand many many times I have hundreds of them at home the bad part about them is that eventually they blister from using them in the microwave that's why I have to buy more but the lids are great and they are a very good item I would buy them again and again I would suggest anybody buy them they stack nice they go in the refrigerator nice they freeze they wash well they don't dry well but they wash well in the dishwasher.",
      "rating": 5.0,
      "verified": true,
      "author": "Jcv",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Know the dimensions of what you want to store",
      "text": "I am using these for storing beads, string, findings and jewelry tools mainly. There are several kits to choose from. I would like one of the kits to include more long boxes. I got it as a Lightening Deal, so the price was great. The quality is excellent. The matching lids are good. I am storing makeup in them too. These can't be wasted on food! It would work well if I could put more than one ziplock bag with items in one box, too. I am also organizing nails, bolts etc in them. The smallest ones are really useful. But! Taller and longer, please.",
      "rating": 4.0,
      "verified": true,
      "author": "Atticus",
      "helpful_votes": 0,
      "publication_date": 20150531
    },
    {
      "title": "love these containers",
      "text": "love these containers, I use them all the time....I use one of the large ones for my oatmeal every morning; it's the perfect size for 1/2 cup oatmeal and 1 cup of milk so that when I put it in the oven to cook (I get old fashioned oats), it does not spill over and cause a mess; I use the other one for a big salad each day's lunch and the smallest one for the dressing....I use all the others for leftover food storage, etc.....they're of very good quality! thanks",
      "rating": 5.0,
      "verified": true,
      "author": "sandym",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "I came acrossed a great deal on Amazon and could not resist",
      "text": "Exactly what I expected. I came acrossed a great deal on Amazon and could not resist. I am so sick of all my mismatched tupperware and the fact that I am not ever able to find the right lids. When I came across these I knew I had to have them, so out with the old and in with the new I went. I tossed away all of my old containers and made room for these. They are a nice thick plastic making them very durable, which is not a quality that all containers have. I will definitely be purchasing these again when the time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Youngman",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "I love the selection and size and that the lids fit together!",
      "text": "Seems like just the right collection for us. The selection of size and shapes is great and the lids stay on! But like most of these items it's subject to getting messed up with tomato products. Spraying it first with cooking spray does help.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly Lyall",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Thumbs up all around!",
      "text": "This Easy Find Lids was chosen as the best option in a recent article reviewing food storage containers. The price was better on Amazon than in the local grocery store. It's a great starter set with just the right number of sizes, etc. It's great how the larger lids fit all of the varying depth larger bowls and the medium lids do the same for the various medium bowls. The plastic is thick enough and sturdy ... and the lids have a nice tight fit but aren't difficult to get on/off.",
      "rating": 5.0,
      "verified": true,
      "author": "GordonATX",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Perfect Set of Storage Containers!",
      "text": "We bought this set on Black Friday at a great price. We've been using them daily since receiving them. They are perfect for packing lunches, refrigerating leftovers, dipping sauces, snacking/ picnics, etc. They are very durable and the lids seal the containers perfectly. They also cleanup easily and are completely reusable. Rubbermaid makes some great kitchen products and these are no exception. We are very satisfied with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "A. fifield",
      "helpful_votes": 0,
      "publication_date": 20171224
    },
    {
      "title": "Throw out all your other random food storage with mismatched lids & buy this set!",
      "text": "Throw out all your other random food storage with mismatched lids & buy this set! I love this set because the lids are interchangeable & there is a good variety of sizes. They have held up very well & don;t seem to retain any color from the food (even pasta sauce!). Only issue I had was my own fault - one of the small lids wasn't secured in the top rack of the dishwasher & I found it melted in the bottom a few days later. But that is ok, since the lids fit each other, I have plenty. This has helped clean up my cabinets & get rid of a bunch of containers I didn't need.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hicks",
      "helpful_votes": 0,
      "publication_date": 20160821
    },
    {
      "title": "Disposable and Forgettable - waah waah",
      "text": "Not the same quality as my existing Rubbermaid items (~6 years old). Was hoping to augment and/or get rid of some of my older stuff; but, these lids and bowls are not even close in quality or ease of use as the others?! We gave these away and kept the old cracking ones. There was also some confusion on my part regarding the set - there are bowls that measure around 8x8x4 in my old set... nothing like that in this one. It is probably my fault for not realizing that Rubbermaid must make different quality and combinations of sets like this.",
      "rating": 3.0,
      "verified": true,
      "author": "KeoghTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20161212
    },
    {
      "title": "Top notch food storage",
      "text": "Top notch food storage. I have been using this set for about two years now and the only problem I have encountered is....lost items. The varying sizes are great, I use the 2nd and 3rd largest sizes for my lunch and snacks for work. Perfect sizes for me. I don't use the smaller sizes as much but they get used for dipping sauce or small snacks. Dishwasher and microwave safe, I can't even say how many times mine have been washed and placed in the microwave without an issue. I will definitely buy another set if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Saint",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Rapidly stained and lids melted in microwave..",
      "text": "Storage only, the containers stain the first time you warm or heat in them. Whether tomato sauce or wing sauce, almost instantly and permanently stained and blistered. A lid actually melted into my hot wing sauce, I was heating in 30 second increments in low power microwave.",
      "rating": 2.0,
      "verified": true,
      "author": "M. E. Meyers",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Great value for a solid product",
      "text": "I've been using these for over a year, and they fit quite nicely for the number of containers, they are all machine wash, microwaveable, and with a good number of them, I can usually find just the right size for whatever I need. One of the small ones has a melted hole in it(probably fell right onto the hot water while in the washer), and one of the tops has a little bit of warping going on(most likely from washer as well), but it still works fine and stacks with the other lids. Good purchase. I would have made the same decision.",
      "rating": 4.0,
      "verified": true,
      "author": "Fitz",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Lasts a long time. Doesn't leak at all. Great Price. Resists stains well.",
      "text": "I bought this exact same thing from BJ's for 20 bucks 2 years ago and still have all of the pieces. When I found the exact same thing for 10 bucks on amazon I had to buy it. They seal really tight and have never had one leak. They can be washed in the dish washer. They hold up to stains really well. The stackability is a convenience if you're short on storage space. I don't like to click the lids together because it's annoying to pop them apart when under a stack of containers. Would recommend and buy again when some of mine start to disappear..",
      "rating": 5.0,
      "verified": true,
      "author": "Pelsssss",
      "helpful_votes": 0,
      "publication_date": 20161029
    },
    {
      "title": "Kit onlyhas about 6 useful sized containers",
      "text": "I am wondering is these are knockoffs. Lids are stiff. Unlike true Rubbermaid. Plus, I didn't need 10 1 oz containers. Kit onlyhas about 6 useful sized containers. I am so done with amazon prime",
      "rating": 1.0,
      "verified": true,
      "author": "ArroyoHiker",
      "helpful_votes": 6,
      "publication_date": 20161112
    },
    {
      "title": "Not good for acidic items but overall work well",
      "text": "These containers work but if you use any acidic products, they will get marred. The plastic is fairly thick but don't use them with vinegar. You have to get a different kind of product for that - glass or some other material. I'm not saying that these are not good containers; they just have their limitations. That's OK. The way they store with the lids --- the stacking --- is nice. So I'm happy for now but one day will probably buy a better product.",
      "rating": 4.0,
      "verified": true,
      "author": "Clutter Hater",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Very functional",
      "text": "These containers are great for leftovers overs. Lunches, and storing food. They are perfect sizes for everything you need. They stack nicely for storage in the cupboards. They also seal very well, no leaks so no messes. We microwave in them all the time and they are very easy to clean.",
      "rating": 4.0,
      "verified": true,
      "author": "Nathan R Castoldi",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Would buy again and agian!",
      "text": "Quickly my new favorite Tupperware! The kids stack easily and a better quality than the easily disposable ones I had been buying. They are microwave and dishwasher safe. The sizes are perfect and the lids go on very easily. I would highly recommend this item for other buyers. especially moms. It will aid you in keeping your Tupperware cupboard clean and organized. Plus at the price listed, if one of your kids lose one, or your husband leaves it at the office, it wont break the bank. This is an item I will be purchasing again when I need more and/or for gifts for other mom friends.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessamyn Patterson",
      "helpful_votes": 0,
      "publication_date": 20160519
    },
    {
      "title": "Better than I Expected",
      "text": "These are actually a lot more durable then I was expecting. I was expecting thin plastic with snap on lids, while what I got was thick plastic and liquid tight lids! I love that all of the containers fit together, so that when I have them stacked up in my fridge, I don't have to worry so much about them falling over or moving around. They are also super easy to store in the drawer I have all of my containers in. The lids all snap together and then the bowls fit into each other. I know that the bowls are supposed to snap onto the lids, but I can't get them to stick, or latch.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Titus",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Nice deal",
      "text": "Do ever want to throw all your Containers away and start over? That’s what I did and I started over with this set. It has proved to be a great choice. The pieces fit nicely together in the cabinet and the lids fit tightly to prevent spills and ensure freshness. I purchased a set for myself and my mother, who also loves this set.",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Barned",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "easy to get rid of tomato sauce stains! Quality!",
      "text": "These containers are great. I cook a lot and freeze leftovers. The containers are sturdy and do not let colors bleed into the bowl. Great set. How di they know how many bowls I needed of each size? Nice job rubbermaid.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "These are a great product; I just wish the set had one ...",
      "text": "These are a great product; I just wish the set had one or two very large containers. I have more little sauce things than I know what to do with; I feel like this set was made for someone preparing several lunches, and while I appreciate the small containers for snacks, I really don't need that many. This was however the best price for plastic ware I found, and I really like the easy find lids, which make storage so much easier than my previous dollar store containers.",
      "rating": 4.0,
      "verified": true,
      "author": "Erica M",
      "helpful_votes": 0,
      "publication_date": 20170322
    },
    {
      "title": "Good variety of sizes",
      "text": "You can use these for a lot of different portions, even really small ones. The lids are pretty durable too. My only quibble would be that with repeated use, the plastic starts getting scratched and those don't go away.",
      "rating": 4.0,
      "verified": true,
      "author": "THX1138",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "Long lasting and good quality.",
      "text": "Well, after 12 years of using tho old set and losing lids or leaving containers at potluck dinners, I figured it was time to replace them............same quality in the new ones as in the old ones. My daughter happily took the old ones off my hands to use. One warning........do not heat anything with tomato sauce in the microwaves in these. For some reason it lightly bubbles and permanently stains the container (but still very usable).",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Larsen",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Very happy with my new rubbermaid set",
      "text": "These are great! I think the promotional video on amazon is what sold me on these! It is hilarious if you, like me, have been similarly attacked by a load of tupperware falling on your head when you open the cabinet door. I literally donated all my old tupperware and purchased this set. I wish there were a few more of the larger containers. There are many, many small ones, so this set is best if you save smaller quantities of food and don't cook for a large family. They are nice for taking lunch to work. Also, they include super tiny ones that seal well for soy sauce, mayo or other condiments.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Excellent Quality Rubbermaid Product Made In The U.S.A.",
      "text": "Excellent quality Rubbermaid product made in the U.S.A. The bases snap onto the lids and stack neatly in the cupboard. They are easy to wash and remain odorless after cleaning, no matter the contents of the container. The containers also transport well, without any spills. The bright, red lids are appealing and easy to spot in the kitchen. I also like the variety of sizes that fit a variety of food storage needs. I liked this set so much that I purchased a second, identical set, so now I have 64 pieces!",
      "rating": 5.0,
      "verified": true,
      "author": "Diana",
      "helpful_votes": 0,
      "publication_date": 20150927
    },
    {
      "title": "Good for send-off leftovers",
      "text": "Does not Fit the thicker-more reusable type Rubbermaid we already had. This set is good for those who need store and go, and send along leftovers for visitors. If the lids were interchangeable with the ones we have I would still say buy to match. USE THESE TO SEND LEFTOVERS HOME with your family gathering guests.",
      "rating": 3.0,
      "verified": true,
      "author": "Rachel Fowler",
      "helpful_votes": 0,
      "publication_date": 20171128
    },
    {
      "title": "Useful sizes, stack & lock for storage",
      "text": "These cintajners are mostly usable sizes. The lids lock to the container bottoms and also lids lock together for easy storage (stack like sized containers with lids stacked under bottom container). Great sizes to send home leftovers from dinner or Thanksgiving!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Norman",
      "helpful_votes": 0,
      "publication_date": 20181014
    },
    {
      "title": "Good quality,....Little capacity",
      "text": "Good quality, heavy weight plastic. with great fitting lids...very secure. But know what you're getting. These have small capacity. Even the largest 7 cup size is small. Let me put it to you this way. The 7 cup could just hold a 1/2 small chicken. They hold sandwiches, small salads, and salad dressings to pack with lunch These make good lunch containers and for holding small amounts of leftovers. Not for serious amounts of leftovers. Of the 21 containers, 2 are 7 cup capacity and 4 are the perfect size to hold a sandwich, The remainder are quite small.",
      "rating": 4.0,
      "verified": true,
      "author": "Trend",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "My favorite food storage solution!",
      "text": "I love these! I had a smaller set I purchased at a department store and absolutely loved. This larger set is excellent. The lids all snap together so you can easily find the appropriate size you need. There is a great assortment of bowls, the small ones are great for sauces and are leak proof. These are also tough enough for frozen storage, they have not gotten weak during my short-term freezer storage. I'm going to throw out/recycle/donate all of my other containers. These stack so easy and take up less space than all of my other mismatched pieces. Highly recommended set.",
      "rating": 5.0,
      "verified": true,
      "author": "Noelle D",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Great for small spaces, nice selection of sizes.",
      "text": "This is my second set of these. I love them for the sizes available and the compact storage ability. I have a small kitchen and these are a real space saver. I got rid of my Tupperware and now these are my go-to storage things. I did notice that the first set was slightly discolored when the second set came and looked so clear. It's not from putting tomato sauces and that type of food in there either. Not sure what makes them less clear as time goes on - maybe just the way they are.",
      "rating": 4.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Super tough tuppies",
      "text": "I am in love with these tuppies. What I love more about them is that they completely seal to keep anything from coming out. The tops are super tough and so are the plastics, They are not cheaply made. Rubbermaid makes excellent products and the quality is wonderful. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Yami",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "BEST CONTAINERS MADE",
      "text": "I can't believe I got this complete set for my wife to replace her old containers for under ten bucks. Gotta love those Amazon.com prices. This set is really nice and the lids fit tight with no leakage even held upside down. Her old plastic containers were on their last legs, so to say. She was very happy with this set and with the Rubbermaid name on it, you know you're getting a quality product. I believe you'll be happy with this purchase. We sure were.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry G. Boyle",
      "helpful_votes": 0,
      "publication_date": 20161225
    },
    {
      "title": "Great cabinet storage",
      "text": "These are great, work just as Rubbermaid tupperware should work. But, after two years of use, the lids no longer 'click' with each other when you're stacking them in the cabinets, so I'll pull a stack down and the lids will fall to the counter off the bottom of the container. They also do not hold as tight of a seal on the container. But ultimately, they keep my food fresh and not squished until lunch the next day. Nothing lasts forever.",
      "rating": 4.0,
      "verified": true,
      "author": "Jenn T",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Makes storage sooo easy.",
      "text": "I bought these because I got tired of buying the cheap quality Containers that break easily and get lost just as easily, the price of this was comparable and I could Not pass up this deal. I received them quickly and I LOVE how they stack. The lids stack together and click together and then the Storage containers themselves stack up and snap in to the lids for easy and efficient storage. These hold up very well and have held up to repeated washings and use, I have yet to lose any lids or containers because of the way they easily fit together and store, So happy with these and if I ever need more I will purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Tazalyn Silvercat",
      "helpful_votes": 0,
      "publication_date": 20160213
    },
    {
      "title": "Good price, made in America",
      "text": "I have some Tupperware but needed more containers and I could get this whole box for the same price as one container from Tupperware. Plus these are made in the USA! I like that all the same diameter containers take the same lids instead of having lids that only fit one container. They have worked well so far.",
      "rating": 4.0,
      "verified": true,
      "author": "NDfarmwife",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great little storage set",
      "text": "This is a nice set. No, it doesn't come with huge bowls but there are several big enough for family meal leftovers and they're really good for lunches at work. I love that the lids snap together. I haven't noticed any discoloration and wash on top shelf of dishwasher. I guess it really depends on what you need them for. If you have a big family with a lot of food to put away, this might not be the set for you. But it's great for smaller portions, and doesn't spill either.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne in GA",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "Best buy!!!",
      "text": "Great deal! I threw almost every piece of Tupperware away after getting this! The the drawer I have has made me crazy for years. It gave me anxiety just looking in it. 35 odd lids and 19 cruddy old pieces. I love how tidy it looks now. Best past is most of the lids fit different size containers. So you can stack and save room.They are nice thick plastic and so far hold up well. Def recommend!!! I also bought one for my sister for Christmas too! Not super exciting but very practical.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie L",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Fantastic 42 Piece Set!",
      "text": "I got the 42 piece set on sale- I love them!! It was so nice to be able to throw away all of the cheap mismatched Tupperware I had for this lovely set! The plastic is very thick and sturdy, which is a must for me! The seal seems great. The lids lock together and everything is easily organized (both in the cabinet and the fridge). There was no funny plastic smell upon opening, though I still washed everything before I put it away. I don't use a dishwasher and haven't used them in the microwave, so I can't comment on those aspects. Would definitely recommend to anyone looking to declutter and upgrade to nice Tupperware!",
      "rating": 5.0,
      "verified": true,
      "author": "GeminiWolf",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "The only set of food storage containers I own",
      "text": "I chucked all of my other food storage containers and replaced them with this set. I like that the lids all stack nicely under each matching size container and the entire set fits on one shelf in my cupboard. One set is perfect for our daily storage needs and also works as a lunch container. The pieces fit well in the dishwasher. The only reason I gave it four stars is that I was disappointed to find it for less at Walmart during the holidays - I thought I was getting a great deal already!",
      "rating": 4.0,
      "verified": true,
      "author": "AgM",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "Because I\"m LAZY",
      "text": "So my girlfriend sent me home with a bunch of food in Tupperware. Being the lazy bachelor I am, I couldn't take the time to clean them because the Redskins were playing... So... I sent her new ones. Small price to pay to keep from scrubbing this crap.",
      "rating": 5.0,
      "verified": true,
      "author": "William Reames",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Useful For Gifts",
      "text": "These are great. Rubbermaid is very popular in our family. I get a set every year at Christmastime and fill the containers with different things and hand them out as Christmas presents to adults and grandkids. The tiny ones work well in Christmas stocking to contain M&M's or other small loose candies. Both my daughters use Rubbermaid and they simply add the Christmas pieces to their collections. Sometimes the grandkids give theirs to Mommy and sometimes they keep theirs to store their own personal treasures.",
      "rating": 5.0,
      "verified": true,
      "author": "Donna Rohling",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "RUBBERMAID SET- best product value for me in years!!️",
      "text": "Best product value for me in years!!️ Everything was many times BETTER than I had anticipated. The lids close very tight over the containers; the strength of the set is very solid, (as one might expect from Rubbermaid), and I found no negatives whatsoever. If you don't buy this, you're missing out on a wonderful bargin; even if you only use it sometimes. I bought one for my neighbor. She loved it!!️ Shipping came fast, and everything was well packed.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Page",
      "helpful_votes": 0,
      "publication_date": 20161028
    },
    {
      "title": "Great storage for cold foods.",
      "text": "I have purchased several of the rubbermaid storage bins. They hold up well and have a variety of sizes. I only use these for items that I will not be warming up. I also hand wash these storage bins because they have fallen onto the heating element in my dishwasher and melted before which left a large, difficult mess. The fit of the lids on the bins is great, and I have never experienced a leak even with liquids.",
      "rating": 4.0,
      "verified": true,
      "author": "Corinne",
      "helpful_votes": 0,
      "publication_date": 20170418
    },
    {
      "title": "Good quality, hold up well in the dishwasher",
      "text": "Good quality, hold up well in the dishwasher, and leak-proof as far as I can tell. I also like how you can mix and match lids. My only gripe is the fact that there are not enough medium sized ones! There are plenty of tiny ones but not enough ones that are big enough to hold more leftovers in. If you need a lot of tiny containers for sauces and snacks and stuff, I guess this would be a good fit for you.",
      "rating": 4.0,
      "verified": true,
      "author": "Joni",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Quality product",
      "text": "I've always been a tupperware fan. However, I'm sold on these Rubbrermaid containers. The sizes are perfect for a single person storing leftovers or packing up a meal for the road or to bring to workwork. They wash up nice (I don't have a dishwasher). I eliminated all the 'old containers' with no matching top or bottom. With these Rubbermaid pieces, you never have to look for a matching lid, you'll always have one. Good color and being able to see inside is great! I'm sold!",
      "rating": 5.0,
      "verified": true,
      "author": "DiannaO",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Only small containers",
      "text": "This picture is a misrepresentation of the containers in the package. No large square bowls are in this package.",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn Bessie",
      "helpful_votes": 3,
      "publication_date": 20161007
    },
    {
      "title": "Good but doesn’t come with a box",
      "text": "We bought this product as a gift for a wedding and was hoping that there was a box in the box that was shipped. A little disappointed to see there wasn’t. So placing it in a gift bag without the box looked a little weird. Nonetheless Rubbermaid products have always been durable and does its job.",
      "rating": 3.0,
      "verified": true,
      "author": "marianxy25",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Leak proof and durable",
      "text": "These are the best containers hands down, IF you are not using them to microwave your food in them. Since microwaving, food just stained the walls and I had to throw out some of the containers. They look good and are fairly easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Durable, Well Made, Every Kitchen needs and good price.",
      "text": "First order arrived was opened, lids and some containers were missing and there was bunch of rat feces in the box and in the containers. After I reached out to customer service, the replacement has been sent and I sent back the first unbelievable order. These are great, well made, just your usual rubbermaid containers. Price was good for the amount of the containers. definitely wash them good before the first use.",
      "rating": 5.0,
      "verified": true,
      "author": "yalch⭐",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "Double check your oder!!!!",
      "text": "The ad Clearly states...Set includes: 5 (0.5 Cup), 5 (1.25 Cup), 5 (2 Cup), 2 (3 Cup), 2 (5 Cup), 2 (7 Cup); Lids included All I got was 3 different sizes ...Half tempted to send it back..This wasn't packed in a retail box either..Makes ke think it was a mix of Old Stock laying around.",
      "rating": 2.0,
      "verified": true,
      "author": "Computational I.",
      "helpful_votes": 0,
      "publication_date": 20170914
    }
  ],
  "product_meta": {
    "title": "Rubbermaid Easy Find Lids Food Storage Containers, Racer Red, 42 Piece Set",
    "description": "Find the right lid, right now! This 42-Piece Food Storage Container Set features the Rubbermaid Easy Find Lid system: the lids snap on to the container bases as well as other same-size lids, so that the right lid is always at your fingertips. These square, graduated-size containers nest together to give you more space in the fridge or cupboard.",
    "rating": 4.6,
    "feature_bullets": [
      "Plastic food storage containers feature Easy Find Lids that snap on to container bases as well as same size lids, so you can always find lids when you need them, and your cabinets stay organized",
      "Great for fridge and cabinet storage, crafts, and more",
      "Nests easily with other containers for compact storage",
      "Thick, durable container walls for everyday use",
      "Microwave safe base, freezer and dishwasher safe, and BPA free",
      "Set includes five 0.5 cup, five 1.25 cup, five 2 cup, two 3 cup, two 5 cup, and two 7 cup containers, plus Easy Find lids"
    ],
    "specifications": {
      "Product Dimensions": "8 x 16 x 10 inches",
      "Item Weight": "3.6 pounds",
      "Manufacturer": "Rubbermaid",
      "ASIN": "B00COK3FD8",
      "Item model number": "1880801",
      "Customer Reviews": "4.6 out of 5 stars12,423 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#3,236 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "April 29, 2013"
    },
    "categories": [
      "Food Storage & Organization Sets",
      "Food Storage",
      "Home & Kitchen",
      "Storage & Organization",
      "Kitchen & Dining"
    ],
    "price": 29.9
  }
}