{
  "website_summaries": [
    {
      "verdict": "A great microscope for those wanting to integrate computer imaging into their research tools.",
      "pros": [
        "Great resolution, interfaces well with computers through provided USB cable and good software to analyze images"
      ],
      "cons": [
        "Must be calibrated before every use",
        "something north of 200x magnification should be available"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The USB-powered Celestron Handheld Digital Microscope Pro, geared toward hobbyists, is useful, fun and easy to use, and can be had for less money than you might expect.",
      "pros": [
        "Easy to assemble and use",
        "5-megapixel sensor",
        "Can be used either handheld, or secured to its included stand",
        "Shoots both photos and video",
        "Powered via USB",
        "Built-in intervalometer lets you program a series of shots or videos"
      ],
      "cons": [
        "Software occasionally freezes and requires a reboot",
        "Stand is unstable enough to make focusing tricky at times",
        "Using the microscope's LEDs for lighting adds a blue tint to images"
      ],
      "aspects": {},
      "publication_date": 20150630,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "the image is so noisy as to be useless - see attached photo and note the gold \"threads\" ...",
      "text": "I bought this because it claimed to be a \"[t]rue 5MP sensor to capture and save high-resolution images and videos of your specimens.\" However, at the high resolution, the image is so noisy as to be useless - see attached photo and note the gold \"threads\" which should have straight edges but which are jagged due to noise! Very poor!!",
      "rating": 1.0,
      "verified": true,
      "author": "The Prof",
      "helpful_votes": 11,
      "publication_date": 20170406
    },
    {
      "title": "Great product.",
      "text": "It is exactly as advertised on Amazon. It was easy to assemble (a seven year old could do it less that two minutes) I downloaded the software to my MAC (running OS X Yosemite, does not have a CD reader) from the Celestron website with no issues whatsoever. it gives clear, sharp, easy to focus full screen images (my MAC has a 27 inch monitor) and takes crisp photos that are easy to manage. I have used it to photograph mites and rust from my garden vegetables and flowers. It also was very useful in removing a splinter from my finger.",
      "rating": 5.0,
      "verified": true,
      "author": "Christian T.",
      "helpful_votes": 12,
      "publication_date": 20150403
    },
    {
      "title": "Excellent piece of kit. Truly Mac compatible.",
      "text": "This is the third such device I bought in a week. The other two went back. For a start this is truly Mac compatible complete with Mac software. Beware of other such devices which claim to be but rely on Photo Booth which is tiresome and produces only small images. This software is very good and the device is well made and works brilliantly. The next step up from this would be a camera costing 3 of 4 times as much, so I think this is excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Malcolm Allsop",
      "helpful_votes": 13,
      "publication_date": 20150303
    },
    {
      "title": "Not Mac compatible.",
      "text": "Installed software CD for Macs. Connected to Mac book Pro via USB cable as instructed. Microscope light came on but also a box - 'Celestron does not support this type of Mac.' Why not ? I only bought it and it is advertised as being Mac compatible. There is no included instruction manual on how to operate once connected. Manual on CD does not open. Will have to return it. Very disappointed. A complete waste of time.",
      "rating": 1.0,
      "verified": true,
      "author": "lindaSP",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "A handy small microscope.",
      "text": "Very good optics at low and high magnification; slightly let down by stand. The coupler should have been steel and not plastic - this would have removed some of the wobble. If you have eyesight problems and find eyepieces difficult to use, this system gives you beautiful screen images.",
      "rating": 4.0,
      "verified": true,
      "author": "g g harris",
      "helpful_votes": 3,
      "publication_date": 20160823
    },
    {
      "title": "Enjoying using this microscope",
      "text": "I have just got this microscope (Christmas present) but straightaway I'm impressed with its performance. I still have a few things to learn about it but enjoying the journey. I took this image of a piece of amber with insect inclusions and honed in on a parasitic wasp (about 20 million years old). Many more things to look at so will write a more detailed review later.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Brightmore",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Digital Microscope",
      "text": "When I purchased this digital microscope, I was not expecting a laboratory quality instrument, however I have to say I was surprised by the performance of this Celestron 5mp microscope. So far I have found many uses for it, especially as my hobbies involve small items. I have even used it to inspect threads at the bottom of a metal tube, which I have not been able to do previously. Overall a very nice piece of kit that is very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Hamousher",
      "helpful_votes": 5,
      "publication_date": 20150703
    },
    {
      "title": "Good bit of kit.",
      "text": "Took some practise to get the best out of the microscope, but the results are worth the effort.",
      "rating": 5.0,
      "verified": true,
      "author": "TAG33",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "The best budget scope on the market",
      "text": "Absolutely stunning quality, easy to use, and really fun to use - this has to be one of the best - if not the best budget microscope on the market today",
      "rating": 5.0,
      "verified": true,
      "author": "john Brandon",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Plug and play!",
      "text": "Easy to use and powerful microscope in a small package. Not really suitable for recording videos, as very low fps, but good for still images",
      "rating": 4.0,
      "verified": true,
      "author": "I A FAROOQI",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "A practical microscaope",
      "text": "A practical microscope that does all it asks. I thought good value for money",
      "rating": 4.0,
      "verified": true,
      "author": "Clive Holliday",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Easy to set up",
      "text": "Performs well. Easy to set up. I look forward to using it",
      "rating": 4.0,
      "verified": true,
      "author": "RB",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "One Star",
      "text": "very disappointed,flimsy plastic and impossible to calculate what magnification you are using. I bought it to carry out fecal egg counts for my sheep but could not get it to focus at 100x on a McMaster slide. For such detailed work recommend using a traditional type microscope with camera attachment.",
      "rating": 1.0,
      "verified": true,
      "author": "Melli",
      "helpful_votes": 7,
      "publication_date": 20150607
    },
    {
      "title": "BRILLIANT! His only problem is the height of the ...",
      "text": "This bought for my husband. BRILLIANT! His only problem is the height of the stand as it will not go higher to view larger specimens. Connected to his laptop it shows very good pictures of insects etc",
      "rating": 5.0,
      "verified": true,
      "author": "yorkshire exile",
      "helpful_votes": 2,
      "publication_date": 20170929
    },
    {
      "title": "Good kit. Make sure you get the right download if you are using a MacBook Pro.",
      "text": "Kit as expected. Software on disk not useful on a MacBook Pro. And poor info from Celeste on support who gave information for the wrong model. However all was well in the end, as I found the correct software to download.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170904
    },
    {
      "title": "difficult focus",
      "text": "The suport is plastic and is moving while you are handling to focus, so is difficult to get a clear image. Also, the tool for measurent is not clear",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20131224
    },
    {
      "title": "This was a huge disappointment. The brightness adjustment has no effect -- these ...",
      "text": "This was a huge disappointment. The brightness adjustment has no effect -- these is no light. Ambient light is too bright -- images are all posterized. The focus adjustment is very stiff and difficult to use. The captured images, even at the lowest resolution have vertical lines obscuring the subject. Overall a very poor piece of equipment. See attached captured image and screen capture of the software display of the image.",
      "rating": 1.0,
      "verified": true,
      "author": "R Hirsch",
      "helpful_votes": 25,
      "publication_date": 20151011
    },
    {
      "title": "Software Fail",
      "text": "I have had this for some time. At first it was acceptable for the price. But Today I started the software to look at a knife. Software tells me I don't have it connected. Tried multiple USB 2.0 and 3.0 ports same results. Reinstalled drivers and software several times. Also searched and found several other threads about similar problems. It appears that Celestron is not truly supporting this item. The problem appears to have occurred during a recent windows 10 update. The software does not have any update or camera select. Basically a one day build.",
      "rating": 1.0,
      "verified": true,
      "author": "Mycroftxxx",
      "helpful_votes": 6,
      "publication_date": 20180808
    },
    {
      "title": "Any driver for this thing written after 2009?",
      "text": "I just got this microscope and I cannot get it to work. Windows recognizes it but in device manager under properties I get a \"device not migrated\" message. Seems to be a driver issue. I've posted to reddit about it since there are no new drivers listed on the microscope manufacturer's website and will probably send it back and get a different brand. What a headache and I was really looking forward to using this.",
      "rating": 1.0,
      "verified": true,
      "author": "William Locke",
      "helpful_votes": 3,
      "publication_date": 20191008
    },
    {
      "title": "Its a toy with a good lens. and terrible functionality.",
      "text": "The focuser knob the one that should be smoothest almost requires a wrench to turn. Both of them move the subject out of the FOV. You neeed to stick your finger nail into the smooth focus dial and apply significant torque to turn it. A child COULD NOT USE THIS. Its impossible to zoom in on a subject, you have to zoom then recenter, never being able to find where you were. You end up using the rough adjustment to focus and the fine focus knob on a constant setting. I wish I spent $50 more. If they used it for 3 seconds (Celestron) they would of realized this. Its a toy with a good lens. and terrible functionality.",
      "rating": 1.0,
      "verified": true,
      "author": "Amzn gives 0 Fuchs",
      "helpful_votes": 13,
      "publication_date": 20160918
    },
    {
      "title": "Wonderful Microscope",
      "text": "As the current quarantine is driving my family crazy I have been looking for new teaching tools to help my kids explore. I purchased this microscope after having bad luck with some other brands I purchased from Amazon. This is the best one I have yet to use. If you are using a Mac you will have to load the software that comes with the microscope. There are multiple tutorials for using the camera with built-in mac tools, but I could not get those to work properly. This microscope is very durable and fun/easy to use (kids are 5 & 7). Great teaching tool and highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles G.",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Excellent Value",
      "text": "This is my second purchase of this microscope. First one got “lost” when I moved. What I like most is the long range of about 1” to 9”. I captured a photo of a penny at 9” and 1” using the Celestron MicroCapture Pro Software (included on CD). The included stand only allows a distance of 3.5”. I use a stack of PC boards to increase the distance as shown in a photo. Very simple to install and use. It would be nice if the software were available from a download link. I had to find and dig out my external USB CD/DVD drive.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "it is much better than the 2MP camera on a gooseneck that I ...",
      "text": "I primarily use the Celestron 5 MP digital microscope for examining the edges of straight razors that I am honing. For this purpose, it is much better than the 2MP camera on a gooseneck that I was using previously. However, it still has a few shortcomings, such as the slide clips that cannot be easily removed. The clear plastic ring around the bottom of the microscope prevents me from getting as close to the razor's edge as I would like to take full advantage of the microscope's maximum magnification.",
      "rating": 4.0,
      "verified": true,
      "author": "RayClem",
      "helpful_votes": 2,
      "publication_date": 20170405
    },
    {
      "title": "Doesn't work on Mac",
      "text": "Did not work on my MacBook. Don't know why they would advertise as for Mac and PC when it clearly doesn't work on macs. E-mailed tech support to tell them and they just sent the same software that was included on the CD. Still doesn't work. Included a screenshot of what I see when I open the program and plug in the scope.",
      "rating": 1.0,
      "verified": true,
      "author": "caz6891",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "outstanding, especially for the price",
      "text": "I do amateur wood anatomy analysis and this turns out to be just what a I wanted. I had a very good focus mechanism and a wide range of focal lengths. I can do a full-screen image of a wood sample's end grain at anything from .2cm to 2cm which is more than enough for my needs. Very pleased and recommend it. I DID have to build a special stand for it but that' because of the size / shape of the wood samples. The stand that it comes with is fine for flat objects",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Hinds",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "Still doesn't work!",
      "text": "Everything looked good. I installed the software, plugged in the microscope, and no image! nothing! it doesn't work! Got a replacement for it, and had the same problem, no picture. A friend has the exact same model and his works on both his computer and mine and my microscope doesn't work on either one. It's not the computer, it's not the software, it's the device. Unusual that two in a row have the same issue. don't know if they're being damaged in shipping all I know is I received two of them now and neither one worked.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Not intended for an electronics workshop, but it outperforms my expectations. Try it",
      "text": "Although this tool is originally designed for studying specimens, you might think it cannot be used for repairing small boards and help performing soldering/desoldering tasks on motherboards with surface-mount component. Wrong. I bought it to assist me in repairing boards, and let me tell you, this thing is magical. Small, easy to carry, easy to use, very practical and it magnifies target to the extent it makes my job a lot easier than before.",
      "rating": 5.0,
      "verified": true,
      "author": "jr2012",
      "helpful_votes": 2,
      "publication_date": 20170306
    },
    {
      "title": "The Perfect Handheld Microscope.",
      "text": "This 5 MP Handheld Digital Microscope Pro, from Celestron, installed without difficulty to both desktop and laptop computers using the Windows 10 OS. I found the microscope easy to use and photographic captures to be excellent, outstanding photo results. This is a giant positive step from using the typical microscope and considerably easier for children to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Oterson",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Useless Chinese manufactured junk",
      "text": "Unusable piece of garbage - poor everything: software, advertised resolution is NOT optical, mechanical parts are cheap and flimsy. Either spend a few hundred $$$ and buy a decent microscope, or just buy a prism. This is not a compromise - you will waste your money and then your time. I returned it to amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Qu",
      "helpful_votes": 7,
      "publication_date": 20160423
    },
    {
      "title": "I bought this very microscope, and it worked fine until IT STOPPED WORKING---Nifty when it works",
      "text": "MY Celestron worked for a couple months UNTIL IT JUST STOPPED WORKING, the software froze in my desktop, and Celestron would not help at all, instead sending me to a costly 'repair' company that dinged me $25 over the phone to even talk to me, then did nothing. When it stops working, it is an expensive paperweight. Pieice of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "Chas Fleischman",
      "helpful_votes": 5,
      "publication_date": 20170531
    },
    {
      "title": "I have bought a different brand with better software options",
      "text": "I have bought a different brand with better software options. What attracted me to this was the stand. Don't expect miracles. The software is very basic and the stand leaves a lot to be desired because it is so loose. It won't stay in position on the stand vertically so i have to leave it all the way down and then adjust from there with a fine focus. The fine focus is under the locking ring and I have to bump it to much and it takes to long to focus as a result. As a result it is usable for the most basic tasks but don't expect a lot.",
      "rating": 2.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 2,
      "publication_date": 20160309
    },
    {
      "title": "One Star",
      "text": "The software that comes with the item is not compatible with Windows 10.",
      "rating": 1.0,
      "verified": true,
      "author": "Arlene Stanley",
      "helpful_votes": 13,
      "publication_date": 20170104
    },
    {
      "title": "Not discoverable by Windows 10",
      "text": "On paper, this is a great product. In actuality, the software is the problem. This device was not recognizable by Windows 10, no matter what I tried. The drivers are very old, and manufacturer support is virtually non-existent. Be prepared to not be able to connect to your computer. I ended up returning item after an entire day of trying to install. My daughter was very dissapointed she couldn't see her slides",
      "rating": 1.0,
      "verified": true,
      "author": "Gregory D. Sorter",
      "helpful_votes": 0,
      "publication_date": 20200916
    },
    {
      "title": "One Star",
      "text": "Will NOT Work with Windows 10 AND Celestron had NO new drivers for it per their on-line help.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 9,
      "publication_date": 20171101
    },
    {
      "title": "Easy to use",
      "text": "This product is great for school,home use Kids can have a lot of Entertainment, sadly can't use in my daily work, need a program that can measure distance between one poin to other and the diameter of a tubing in real time, not taking a picture and then in the picture take dimensions .but is a great quality pice",
      "rating": 4.0,
      "verified": true,
      "author": "gilberto r.",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "Good for examining stationary objects.",
      "text": "I bought this to make up for my vision problems when working with things close up. It does allow you to see the fine detail. I have a problem because there is a time delay when you are actually doing something under the microscope. Not great for delicate jobs like fine cuts on objects using an Xacto knife. It can be done, but it is not easy. I may need to buy a real optical microscope for some of the things I want to do. It works great when examining stationary objects.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth R. Beamish",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Great buy!",
      "text": "Great gift! My boyfriend, family and friends all had a lot of fun playing with this on Christmas. We freed the spider we trapped, over all great photos, intuitive enough to use. Wish it were 1000x but this will do for now. Pics of mosquito wing, oreo, bee pollen, flower petal, spider leg, mushroom, cob web, apple and apple seed.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Laizure",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "Camera images are excellent I'm using it for looking at chip-and-wire die and ...",
      "text": "This device works well. However, the latest software to support it was found only on the CD. (The Celestron website had an older version which wouldn't recognize the camera under Windows 10.) That lost it a star since not too many laptops come with CD drives anymore making the extraction of the software a pain. Camera images are excellent I'm using it for looking at chip-and-wire die and ribbon/wire bonds. For $100, it's worth it!",
      "rating": 4.0,
      "verified": true,
      "author": "CR",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Focus could be finer. Works fine for examining my 3D prints",
      "text": "I agree with others that handheld use is pretty much impossible, as is true for any high-power microscope. The focus could have a little finer control, but is reasonable considering the price. I bought this microscope to examine and photograph the fine details in my 3D prints. It works great for that. The software installed easily and is remarkable free from unwanted add-ons: it does just what I need. All in all, a fine little microscope.",
      "rating": 4.0,
      "verified": true,
      "author": "Bradford Needham",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Finding Ancient Fossils.",
      "text": "I use this for examining fossils in the matrix. I was able to find the tiniest Trilobite with it. Without I would have never found it on the Matrix that had a normal size Trilobite. I often go hunting for Fossils with some of my friends and a local museum. They all want to go and buy this after seeing it. If you take a laptop in the field you can actually handhold this Microscope allowing a taking a photo when taking the fossil is not possible or should be left in nature.",
      "rating": 5.0,
      "verified": true,
      "author": "Rock Headed Red Head",
      "helpful_votes": 0,
      "publication_date": 20170722
    },
    {
      "title": "Interesting toy, but ...",
      "text": "Interesting toy, but ... Can not get it to work with a Windows 10 Computer. Tried a different computer.... Windows 7 requires a patch (note: patch is on CD, so beware of the download version). All my pictures have a reflection of the LEDs around the camera. High glair. Will not work for my application.",
      "rating": 3.0,
      "verified": true,
      "author": "Sheldon Makusec",
      "helpful_votes": 0,
      "publication_date": 20180704
    },
    {
      "title": "Will Not Work with Windows 10 64 bit",
      "text": "Not recognized by windows 10 64 bit, will not work with it no matter what. Total Fail.",
      "rating": 1.0,
      "verified": true,
      "author": "JU",
      "helpful_votes": 3,
      "publication_date": 20190109
    },
    {
      "title": "Had issue connecting to MAC, worked with windows easily",
      "text": "If you don’t have a windows os don’t bother buying this microscope. I tried everything to get it working on my MacBook Air, redownloading the software multiple times to no avail. My friend shows up with his windows laptop and it worked right away. Once I actually got to use it i really found it useful. I used it for evaluating ripeness of my medical cannabis plants and I would definitely recommend it to anyone using it for that purpose..if you aren’t using a MacBook!",
      "rating": 4.0,
      "verified": true,
      "author": "Rob Gould",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Very good and affordable device",
      "text": "Man this is a good device for the price, it helps a lot with my electronics jobs inspecting the solder joints. As you can see in the attached pictures it has enough zoom to debug SMD SSOP hand made soldering. The software is straight forward, easy to use and all you need to capture good images. I don't give it 5 stars because I would love to have a bit more zoom but I can't complain to much for the price I paid for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Ernesto G.",
      "helpful_votes": 3,
      "publication_date": 20160814
    },
    {
      "title": "Zero Rating crap support Product not as advertised!",
      "text": "I am so P....sed off and Fed up with this product and their support. Zero. Zip. Nada. When I go to support I'm directed to a sales page for other products. All in All the company stinks.",
      "rating": 1.0,
      "verified": true,
      "author": "RandomWayne",
      "helpful_votes": 2,
      "publication_date": 20190824
    },
    {
      "title": "Use a photo viewer to increase the magnification.",
      "text": "It takes some practice to learn how to best use this device, but once you figure it out you can get good results. One trick is to get the specimen in focus and take a photo of it. Then using a photo viewer, increase the magnification of the photo. The result is many times better than the image on the computer screen.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "The stand is too small and rigid. If you ...",
      "text": "The stand is too small and rigid. If you want, as me, to take pictures and amplify the internal organs of a fish, you have to do it by hand and that's a mess because any tiny movement of your hand is going to produce a blur picture, then without the stand it doesn't work. I have to atached with tape to different structures to be able to work with it. You should provide diferent options for stands.",
      "rating": 3.0,
      "verified": true,
      "author": "Davinia Beneyto Garrigós",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Super fun to play with",
      "text": "Lot's of fun looking at things close up. The stand it comes with is not very useful, very hard to get things in focus. After setting the focus it is lost as soon as you let go of the stand or microscope. It is easier just to hold it against something and focus. The only problem I had so far were spots on my pictures. I thought is was dust on the lens but it turned out to be dirt on the sensor. You can see the black dots in some of my pictures. I didn't want to go through the trouble of returning it so I took it apart and cleaned it myself. Now it is ok.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Good one.  Much better than the one I sent back.  Very good pic..",
      "text": "Good one. Much better than the one I sent back. Very good pic..",
      "rating": 5.0,
      "verified": true,
      "author": "CarlThe1ManBand",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "Good for the money",
      "text": "Its not a full fledged microscope, and it suffers from a lack of a light under your subject, but you can do very well for less than 100 bucks. You can see the cell walls and chloroplasts of moss and some plants. You just have to figure out a way to bounce the light under your subject. I may cut a hole in the base to let me mount a light there. The included lights around the scope lens will wash anything out at close range.",
      "rating": 4.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 7,
      "publication_date": 20140423
    },
    {
      "title": "Great for looking at coins",
      "text": "My husband got this to look at pennies. He likes how he can now get really close up pictures, and save files. It's portable, has a stand, has it's own adjustable LED lights (can turn off, or turn up very bright) and it's priced right. He can take a picture of the entire penny, or zoom in to get a picture of just a small section. He would recommend it to anyone looking at coins.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Hammers",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Great for use in coin collecting.",
      "text": "Active coin collecting and this digital microscope gets a lot of use. Aids in many ways. Great for enhancing visual image of coins. Takes digital photos of coins that can be printed or stored as electronic images. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "AJ",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "For the price, it is pretty awesome!",
      "text": "This is a handy gadget for home use. I am a grad student who has access to sophisticated equipment at the university, but it is nice to have something I can use at home or in the field. I recently took a grass ID class and this is great for practicing my dissection and identification skills. This is nothing compared to the scopes at school, but for $76? It is perfect for what I need!",
      "rating": 4.0,
      "verified": true,
      "author": "PineLakeChic",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Product not as advertised in photos.",
      "text": "This is NOT as advertised in the photos. See the shutter switch in the cord in this product picture? There is NO shutter switch or dimmer control on my product's cord. I have a message pending with technical support for an explanation.",
      "rating": 2.0,
      "verified": true,
      "author": "booklion",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Solid product. Well priced.",
      "text": "Very solid product for the money. The lighting can have issues at times; the camera adjusts to ambient lighting and is not always favorable to the specimen. Very good range of magnification. You can clearly identify a large spider down to a flea or smaller for identification purposes. The only downside is that this product is primarily made of plastic, thus there is a chance of it being easily damaged if your not careful. Being able to take a picture or video and send that in an email format great. Some minor assembly required, and the parts were slightly difficult to fit together.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20140815
    },
    {
      "title": "Celestron 5 MP handheld Digital Microscope",
      "text": "User friendly very easy to put together. Software sets it up for you. Portable handheld usb2. Using it for coins and it really works out very well for me. Keep it on the stand if you prefer or as I said you can use it as handheld. All depends on the way you preference. I have recommended it to others as a very good product for coin viewing. I have only used it to view coins, nothing else.",
      "rating": 5.0,
      "verified": true,
      "author": "ShirlB",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "Great little microscope",
      "text": "I read some not so great reviews regarding this little microscope before I bought it but went ahead and purchased it anyway. I am extremely happy with the product. The software was easy to install onto my laptop and there is no better way at looking at a sample than on the big screen. The software is user friendly. The microscope itself is extremely small and compact. The zoom and focus are ideal. All of the different adjustments let you get exactly the picture you want. Great deal for the price. I would recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Lynn",
      "helpful_votes": 2,
      "publication_date": 20140617
    },
    {
      "title": "2 time loser.",
      "text": "This was the second one, both worked once then \"device not found\". No tech support but I did everything I could, reload, restart etc. When it did work the first time it was difficult to focus, go past and let go and comes back in focus. Not real sturdy.",
      "rating": 1.0,
      "verified": true,
      "author": "Allan",
      "helpful_votes": 9,
      "publication_date": 20150120
    },
    {
      "title": "For less than $80, it's a fantastic device",
      "text": "I plugged it in, downloaded the latest version of the software from Celestron, and it immediately worked. So no issues with getting the software to work as some others have reported. I am running Windows 8.1. Haven't tried it with my Windows 7 machine. For the money, it's an excellent device. I used it both in handheld mode and with the stand with great results. Is this a lab-quality camera/microscope? Of course not. Anyone who thinks they're getting something of that caliber for under $80 is delusional. It's fun, it works great, it's easy to use. What more do you need?",
      "rating": 4.0,
      "verified": true,
      "author": "Seabisquick",
      "helpful_votes": 0,
      "publication_date": 20140221
    },
    {
      "title": "Great for textiles",
      "text": "I bought this for looking at antique laces and textiles closely. The pictures come out well and the detail is exactly what I hoped it would be. I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Stonewall Cottage",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Nice Viewer but........",
      "text": "This is a nice viewer to observe coins but the lighting is situated so it gives a lot of reflection and many details like lettering and date look doubled. The camera takes 1.3 MP images that are not very detailed and fuzzy, the 5 MP setting is the same resolution as the 1.3 MP only it is larger image. If you take a picture with 1.3 MP and then with the 5 MP setting it is identical if you enlarge the 1.3 MP to 200%.",
      "rating": 3.0,
      "verified": true,
      "author": "DAVE Sr",
      "helpful_votes": 6,
      "publication_date": 20140326
    },
    {
      "title": "This works okay for USB pictures, but because of ...",
      "text": "This works okay for USB pictures, but because of the flimsy base and stand when you go to adjust the focus, the stand and base deflect, rendering the object out of focus while you are trying to scan up and down. Justr need to be very careful and patient when using.",
      "rating": 3.0,
      "verified": true,
      "author": "Neil Cavanagh",
      "helpful_votes": 0,
      "publication_date": 20170905
    },
    {
      "title": "Best value.",
      "text": "Pros include cost, clear crisp focusing, field of view, stand is very useful, and can be handheld. The only con was the limited stand adjustment range. Unit can focus much farther",
      "rating": 5.0,
      "verified": true,
      "author": "D Holser",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Excellent for Elementary Sschool use..",
      "text": "Perfect for Intended Purpose. Not a high powered microscope but just perfect for doing teacher demos in the elementary school classroom. It adds the wow factor when discussing insects or when observing flower parts. Extremely easy to set up and the built in light (with dimmer) allows for perfect illumination. When this is connected to a large (27 inch) computer monitor, everyone in class sees the same image. Four stars because the focus drifts a bit and the stand is sensitive to movement or vibration.",
      "rating": 4.0,
      "verified": true,
      "author": "waltf",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "I'm a big fan of Celestron branded optics.",
      "text": "Perfect for my everyday uses. More magnification tends to be too much and a little unsharp. It's a magnifier, not necessarily a microscope. Perfect for examining your private parts to visualize them as you wish they were.",
      "rating": 5.0,
      "verified": true,
      "author": "VLDBI",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "Good Optics - Poor Mechanics",
      "text": "The quality of the image was good but that is where the quality stopped. The lens carrier moved so much while trying to operate the focus wheel that you could not keep the subject in view while trying to sharply focus. The stand was strudy enough but again, there was much play in the magnification adjustment even when everything was tightly locked down. I did like the dimmer feature for the LED lamps. Overall, the optics/electronics were good; the mechanical elements poor. I opted for the much less expensive 2MP model.",
      "rating": 2.0,
      "verified": true,
      "author": "Russell Pouncey",
      "helpful_votes": 3,
      "publication_date": 20131107
    },
    {
      "title": "Printed Circuits can be repaired",
      "text": "The magnifier's software loaded right from the Disc w/o problem; the picture clarity was impressive; controls for focusing and magnifying were easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Awesome microscope",
      "text": "This microscope is amazing. I got it to do electronic board repair and it is a huge help. It is a must buy, you will not be disappointed. This is great with the quality one would expect from celestron.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "subatomic particle imaging",
      "text": "Frankly, I was surprised as to how useful this little thing was. Being familiar with OPTICAL microscopes up to 40 CMos heads and electron stuff in research and QA, this thing is great for checking out insects, slivers on kids fingers etc. At work we keep one on the shelf above a table bench which houses a famous German make optical unit and pull it out to the side when someone comes to do work. We say, here, you can check out the reason for rejection with this baby. The look on their faces. OK, OK a little humor pls.",
      "rating": 5.0,
      "verified": true,
      "author": "Tarzan's Chimp",
      "helpful_votes": 0,
      "publication_date": 20150221
    },
    {
      "title": "Picture quality not very good.",
      "text": "The picture quality was disappointing. Hard to focus and the magnification is really too high for typical hobby and home use.",
      "rating": 3.0,
      "verified": true,
      "author": "Rex Katz",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Disappointing",
      "text": "Seemed cheaply made. The stand was virtually useless... too light weight and hard to place in a usable position. When placed on stand, the focus wheel was not easily accessible. The zoom did not operate at all. The product did produce a nice picture though.",
      "rating": 1.0,
      "verified": true,
      "author": "Curtis T",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "I was sadly disappointed by the mechanical stiffness and lack of a focus ...",
      "text": "I was sadly disappointed by the mechanical stiffness and lack of a focus lock for this product from a company with such a good reputation in telescope assemblies. But when you pay less than $90 it may be unreasonable to have moon like expectations. The delivery was good, the product was well packaged and in excellent condition. It's just the product is barely adequate for my intended uses. Lesson learned, sometimes you have to pay a little more to get quality despite name brand.",
      "rating": 3.0,
      "verified": true,
      "author": "AKsmitty",
      "helpful_votes": 0,
      "publication_date": 20141027
    },
    {
      "title": "Really slick unit!",
      "text": "I had the earlier version of this microscope but it didn't have the post that the scope could be run up and down on as this model does. This one is much easier to use. It's really handy to have it sitting there and if you need to look up close, it can be done almost instantly. And you can take a picture. Definitely worth the extra money. All that and my grandkids can take pictures of there fingernails any time they want.",
      "rating": 5.0,
      "verified": true,
      "author": "dwc309",
      "helpful_votes": 0,
      "publication_date": 20151119
    },
    {
      "title": "Takes Great Quality Pictures",
      "text": "The video and picture quality of this Microscope is excellent. The key to great focusing is to set the approximate height, then use the course focus knob to dial it in. Once you get it close, once again, but carefully adjust the height, and you will have a perfectly focused image. It was great for the price, but I had to take off one star for the quality of the stand, which has a cheap feel to it. It is made of plastic, and I wonder if it will hold up over time.",
      "rating": 4.0,
      "verified": true,
      "author": "Ken L.",
      "helpful_votes": 0,
      "publication_date": 20140301
    },
    {
      "title": "Great Hardware, TERRIBLE SOFTWARE!!!",
      "text": "This thing is ridiculously amazing, I have taken truly epic photos, its just great, but....... Unfortunately the software the company has created is CCCRRRAAAPPP!!!",
      "rating": 3.0,
      "verified": true,
      "author": "Marshall",
      "helpful_votes": 0,
      "publication_date": 20180313
    },
    {
      "title": "great microscope for your curious kids",
      "text": "It works really well even at the highest magnification. The only problem is that the focal length is actually closer to the lens than the outer plastic bezel which prevents focussing on larger objects that can't fit into the bezel.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Bowers",
      "helpful_votes": 0,
      "publication_date": 20190204
    },
    {
      "title": "Great learning tool for the Grandchildren after a field trip ...",
      "text": "Great learning tool for the Grandchildren after a field trip to look at collected items. Pictures from it helps to fill in trip books which help tell a more complete story of their experiences.",
      "rating": 5.0,
      "verified": true,
      "author": "ElecTech AmaCustomer",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "Makes looking closely at your collection easy!",
      "text": "Ive so far only used it once. Setup was easy in my windows 7 64bit with just the disk that came with it. I was easily able to see everything i wanted to look at through it. Seems like its durable although I've not done anything to be rough with it. Extremely satisfied with this product at this point.",
      "rating": 5.0,
      "verified": true,
      "author": "Grindalyx",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Great value for the price",
      "text": "This microscope has good quality for the price and helps you see little things up close very nicely. I use it with Linux and enjoy being able to not only view things under magnification, but also capture them just as easily.",
      "rating": 5.0,
      "verified": true,
      "author": "PulseMaker",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Does the Job",
      "text": "I tried a couple different brands, all of course assembled in China. Most did not have decent instructions especially in English. This scope came with instruction in 7 or 8 languages and quite articulate. The magnification is a good as you could expect for the price I am a stamp collector and is allows for detailed inspections.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Gleason",
      "helpful_votes": 4,
      "publication_date": 20140511
    },
    {
      "title": "Good value.",
      "text": "Awesome product for under $100. The controls felt a little sticky at first, a little graphite on the fine tune knobs and much improved. Still not as deep of view as a true stereo scope, but the software easily allows enhanced picture.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great Teaching Tool",
      "text": "This was a give for a young girl about 11 years old. She is intrigued by the Sciences as well as Engineering. She loved this and spent time looking for new things to look at. We played with it for awhile and enjoyed it ourselves. I love that it can be hooked to your computer so you can get a larger look at things. Love it and so does our granddaughter.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie Fedler",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Do not purchase this for coins",
      "text": "Optics are actually really nice. The scope itself seems well built but the guard on the end prevents you from zooming in on fine details. You cannot remove it. I cut mine off with a dremel. The stand was complete garbage. Very unsteady. I am totally disappointed in this scope.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff Stanley",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "The light for this scope is uneven. The diffuser ...",
      "text": "The light for this scope is uneven. The diffuser does not diffuse the light from the LEDs and each LED can be seen in the image from the camera superimposed on the object that you wish to view. It would be a decent tool for working on small electronics if a new diffuser was found to work with the camera.",
      "rating": 2.0,
      "verified": true,
      "author": "John Lee",
      "helpful_votes": 3,
      "publication_date": 20160213
    },
    {
      "title": "Ok for the Price, Wish They Offered an all Metal Version",
      "text": "Really enjoy using this, it makes doing close up work viewed on a large computer screen easy. However, I do wish it was put together using more metal parts. The plastic knobs and plastic guides are a bit weak for any precision work. You'll find it sliding down when you don't want to or difficult to tighten at a position you want.",
      "rating": 4.0,
      "verified": true,
      "author": "CNG",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Knife sharpening USB microscope",
      "text": "Great USB microscope for knife sharpening. There are a couple youtube videos showing this model in use that were very helpful to me as well. software installed easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Harvey",
      "helpful_votes": 0,
      "publication_date": 20190301
    },
    {
      "title": "does an excellent job. Medium adjustment nob on the stand is ...",
      "text": "Use this at work to take close up pictures of our prototypes after testing. Once I found the LED brightness adjustment on the cable, all was well. For <100$, does an excellent job. Medium adjustment nob on the stand is a welcome feature. Only criticism I have is the overall height of the stand; a little taller would come in handy.",
      "rating": 5.0,
      "verified": true,
      "author": "AJAQ",
      "helpful_votes": 0,
      "publication_date": 20150621
    },
    {
      "title": "Great choice and easy to use",
      "text": "This was a gift for our oldest and she loves it. You can really see and examine a lot with it. The connection to the laptop is great for seeing and taking photos of your rock or leaf or etc.",
      "rating": 5.0,
      "verified": true,
      "author": "FL mom",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Scope out this great scope!",
      "text": "Great images. One of the only I could find that has a REAL 200x optical imagine enlargment with glass lenses instead of digital zoom. Other 40$ scopes claim 200x magnifying ability but really only offer 30x with a digital zoom. FAIL! My only complaint is that the stand could be a little more sturdy. The tightening nuts are plastic and I am hesitant to reef on them. This allows a tiny bit of wiggle which isn't a big deal, but it could be improved with some metal fixtures. Software is simple and glitch free with NO bloat ware or 3rd party spam. I researched this a long time and it is the Best scope hands down for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Redden",
      "helpful_votes": 2,
      "publication_date": 20150324
    },
    {
      "title": "Not good for horticulture diagnosing",
      "text": "The software is terrible. I had to try and reinstall the second time I used it and it won't reinstall. I was finally able to install on a different laptop and copy the installed program over to my laptop. It doesn't show true colors and is really like looking at a video which is refreshing by the second (giving lots of flicker). If you are looking for movement on plant material you won't know if it is movement unless the bug is large.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 0,
      "publication_date": 20170521
    },
    {
      "title": "Pretty Impressive once you find the rear zoom screw.",
      "text": "Your quality will be high between a Penny and the Nose on Lincolns head on the penny. A House Fly would be hard due to depth of field. Flat stuff will be perfect. Leaves and grasses and coin collections. Bug eyes, bug wings and more. I like it!! Wish I could send you a picture!",
      "rating": 4.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 5,
      "publication_date": 20140107
    },
    {
      "title": "Great tool",
      "text": "Its waaay better than I imagined. I wish the usb cable was removable or retractable but other than that insignificant gripe this has worked without fail since purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Wade Wattson",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Fancy web cam, no magnification",
      "text": "This item is basically a web cam on a stand. There is no magnification. I had it displayed on a 27\" iMac and got no where near the 200x promised magnification. I thought that it would be a decent item to keep my kids interested in science over the summer, however they used it once and never turned it on again. Amazon was fantastic and returned the item for a full refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Ryan Sorensen",
      "helpful_votes": 0,
      "publication_date": 20140917
    },
    {
      "title": "Good product, reasonable cost.  Weak software.",
      "text": "Bracket to hold the camera failed immediately. Took quite a while to get the replacement, but Celestron came through eventually. Software needs updating and improvemtns and the unit focus range needs some work, but overall a good product for the price. Mounting shaft should be longer and lens shield gets in the way of max zoom.",
      "rating": 4.0,
      "verified": true,
      "author": "MidWest",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Great gift",
      "text": "A gift for my husband and he is enjoying it . Easy to install ang gives him a close up of his rocks, minerals, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Park-smith",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Celestron is a name to truct",
      "text": "Scope worked as promised, nice addition to my need for magnification and photo capture. Celestron is a great name, so I expected the best from them.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannibal Hartford Langhorne",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Nice magnification",
      "text": "It's use is universal and multifaceted. I use this to make images of coins to determine flaws and also for slides to show meteorites to the students.",
      "rating": 5.0,
      "verified": true,
      "author": "David Parsons",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Software Issues",
      "text": "Software issues with windows 10, never got it working, tried multiple machines and never worked. Returned item.",
      "rating": 1.0,
      "verified": true,
      "author": "I want to move to Texas",
      "helpful_votes": 0,
      "publication_date": 20200205
    },
    {
      "title": "Very cool, fun to use",
      "text": "Very cool, fun to use, easy and straight forward. Capture button doesn't work on Mac. I feel like any 5MP sensor should be able to produce more crisp images, but it does the job!",
      "rating": 4.0,
      "verified": true,
      "author": "Mace",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Two years in service - still great",
      "text": "It has been a long time since I purchased this. I used it for a few months and it worked well. Then I gave it to my sister to use for her jewelry work. She loves it. It has been a great asset for her. No Problems. It can be used in the stand or hand-held. She does both and say its fine. Almost two years and not one problem",
      "rating": 5.0,
      "verified": true,
      "author": "fryque",
      "helpful_votes": 0,
      "publication_date": 20151030
    }
  ],
  "product_meta": {
    "title": "Celestron 44308 5 MP Handheld Digital Microscope Pro",
    "description": "Our popular Handheld Digital Microscope line rises to a new level with the Handheld Digital Microscope Pro including adjustable-height stand. This easy-to-use microscope is perfect for viewing stamps, coins, and other small objects at magnifications up to 200x. The Handheld Digital Microscope Pro is extremely versatile - use it in handheld mode to view large object surfaces and access tight spaces or use the included adjustable stand for smaller objects. View the images from the Handheld Digital Microscope Pro directly on your PC using the provided software, and save the 5MP images or 30fps video to your hard drive.\n\nBOX CONTAINS\nCelestron HandHeld Digital Microscope Pro. Stand. CD/DVD with software and manual. Lens Cloth. Calibration Player.",
    "rating": 4.1,
    "feature_bullets": [
      "True 5MP sensor to capture and save high-resolution images and videos of your specimens",
      "5-Element IR cut high-quality glass lens ensures sharper images",
      "20x to 200x powers, great for low-power observation of 3D specimens (Note: final magnification determined by monitor size)",
      "Professional, adjustable height stand included for hands-free operation",
      "4 foot USB 2.0 cable for easy manoeuvrability when viewing large surfaces",
      "Intuitive software with measuring features",
      "Windows and Mac compatible"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "22.86 x 17.78 x 12.7 cm; 648 Grams",
      "Date First Available": "24 July 2013",
      "Manufacturer": "Celestron",
      "ASIN": "B00CMJ1I08",
      "Item model number": "44308",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "050234443081"
    },
    "categories": [
      "Lab & Scientific Products",
      "Lab Instruments & Equipment",
      "Handheld Digital Microscopes",
      "Microscopes",
      "Microscopes & Equipment",
      "Industrial & Scientific"
    ],
    "price": 139.0
  }
}