{
  "website_summaries": [
    {
      "verdict": "A budget-priced fryer from a reliable brand. Consistently good results, although it cannot hold as much food as other deep fryers.",
      "pros": [
        "Well fried foods each time and doesn't take long to warm back up between batches",
        "Simple and easy-to-use design"
      ],
      "cons": [
        "Not as large as other units",
        "Made in China"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great size and holds temp well.",
      "text": "Used this about every other weekend on my quest to duplicate Chik Fila's chicken sandwich. I'm getting close, but not quite there yet. Great fryer, easy to clean and disassemble. I fit 4 decent sized catfish filets in there without over doing it. Checked the thermostat with a grease thermometer and it seems to be about 15*F cooler than the actual temp. Overall very pleased. One minor complaint, but not enough to deduct a star, the unit can come unplugged very easily. It's a safety thing so I get it, but still aggravating. ***If this review helped you out in any way, please let me know buy clicking below!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Pace",
      "helpful_votes": 293,
      "publication_date": 20170724
    },
    {
      "title": "Great fryer",
      "text": "We had the Hamilton Beach 8-cup fryer for two years before it finally died (it got quite a lot of use) and we replaced it with this 12-cup fryer. This is a great fryer. It heats up quickly, cooks evenly, doesn't take up much storage space due to its shape, and is easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 192,
      "publication_date": 20161105
    },
    {
      "title": "teflon coated oil reservoir pan is crap i recommend replacing it with 1/3 size 6\" deep stainless steel steam table pan",
      "text": "works well for a home kitchen. the teflon coated reservoir pan tends to let the oil gum up on it but when you scrub it or attempt to use more caustic cleaners to break up the oil you end up taking off the coating. I ended up just replacing it with a 6\" deep 1/3 size stainless steam table pan and that works much better.",
      "rating": 3.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 66,
      "publication_date": 20171117
    },
    {
      "title": "Terrible, Terrible Product. Do NOT put in dishwasher (even though it says you can).",
      "text": "Terrible. I read instruction manuals cover to cover and it clearly states that the fryer pot can be washed in dishwasher as long as it is not on sani-cycle. On the first go through the dishwasher on normal cycle the enamal/coating on the deep fryer pot is completely gone. A black powder gets on my hands when I touch it. Certainly no longer usable. I understand that certain products are not dishwasher safe, but when it clearly states that it is in the manual, it should be. Total garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruin248",
      "helpful_votes": 76,
      "publication_date": 20171113
    },
    {
      "title": "Design flaws. Buy smaller or other brand.",
      "text": "This is my second hamilton beach deep fryer - larger than the first one which was just great just too small. I use it only for fries. Unfortunately this model has several serious design flaws. The frying basket handle folds in for storage which means it is sitting in the oil. Should you switch on the fryer without removing the handle you get a melted handle - see picture. Also when the basket is in “rest” position the lid does not close. Neither of these are problems in the smaller version.",
      "rating": 1.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 28,
      "publication_date": 20190220
    },
    {
      "title": "Very Nice Fryer",
      "text": "This deep fryer makes frying faster, easier, and less messy. It has enough power to recover quickly - preventing \"soggy\" food. Cleanup is simplified by the clever way it is designed to come apart. I would give it five stars if the temperature controller could be set to 400 degrees F; but it maxes out at 375.",
      "rating": 4.0,
      "verified": true,
      "author": "David D.",
      "helpful_votes": 31,
      "publication_date": 20170329
    },
    {
      "title": "Cheaply Made",
      "text": "This deep fryer is very cheaply made. It's flimsy and after 3 uses the magnetic power cord quit attaching to the power receptacle. It no longer works. Update: talked to Hamilton Beach & they want $6 to ship replacement part. Don't waste your money on this.",
      "rating": 1.0,
      "verified": true,
      "author": "chris p lykins",
      "helpful_votes": 10,
      "publication_date": 20181006
    },
    {
      "title": "Not the Answer to Fried Food",
      "text": "Unit cleans up nice. As far as frying food, not very good. I waited about an hour to see if the temp would hit 375 but it never did. Would only get to just under 340. I dropped in a 1/4 basket of frozen fries and the temp dropped. It never did recover. Fries turned out tough. Waited for the temp to get back up to just under 375 and it never did. Dropped in a 1/2 basket of fish and the results were not very good. I took a chance on all the positive reviews but I am now going to focus on those more negative reviews as I think they tell the true story of a product.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 8,
      "publication_date": 20180913
    },
    {
      "title": "Absolutely terrible quality - fell apart after just a few uses",
      "text": "Absolutely terrible quality - fell apart after just a few uses. I owned my previous deep fryer for about 15 years (rarely used) so this was disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "S in Seattle",
      "helpful_votes": 13,
      "publication_date": 20180108
    },
    {
      "title": "Very easy to keep clean and fresh.",
      "text": "Great fryer for a family of 2-3 . Easy to clean and take apart and a good size easy clean dishwasher safe basket. I highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Muns",
      "helpful_votes": 6,
      "publication_date": 20200313
    },
    {
      "title": "So so.....",
      "text": "It works, best thing I can say about it. The temps are low by about 9 degrees which would be no big deal if I could turn it up past 375 degrees but you can't! The basket is really cheap, flimsy, it's sides are folded up which captures the bristles of my cleaning brush. The detachable basket handle really adds to making it flimsy. The \"STUPID\" little cord is a goofy as it gets. The magnetic connection is really weak and I have no idea why the cord is so ^&%%$# short. I have to use an extension cord to move the unit on top the stove to use the exhaust hood. Not impressed, wouldn't buy it again! YMMV",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20181117
    },
    {
      "title": "Back to Frying",
      "text": "I have not been able to successfully deep fry meat or seafood in almost 20 years. I was finally able to and it was thanks to this device. My 1st batch I took out too soon but the 2nd batch was perfect! The only pain was clean up when I had to figure out what to do with the old oil. We don't have a lot of space in our tiny apartment but I felt leaving the used oil in the oil pan would work since I intend to use the oil again in a few days. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacqueline T.",
      "helpful_votes": 7,
      "publication_date": 20170821
    },
    {
      "title": "Nice idea, but doesn’t stay hot enough. Fries are soggy.",
      "text": "The unit is easy to operate and put together. However, the unit only goes up to 375F on the dial (352F measured) and takes a while to recover after a small basket of fries are dropped in. As a result, things come out oily and eventually soggy, after sitting a while. It’s too bad, but probably won’t use it again.",
      "rating": 2.0,
      "verified": true,
      "author": "Ervin",
      "helpful_votes": 4,
      "publication_date": 20190101
    },
    {
      "title": "Pretty easy to use",
      "text": "Pretty easy to use, once I got the fryer to recognize that everything was installed and plugged in properly. This is my first dedicated fryer after using pots and pans for decades, and it feels like a world of difference. Food cooks more quickly and quietly due to the lid, and there's a lot less spatter. I'm able to cook enough chicken and fries to feed 2 people in a single round. Also, it seems like the oil stays cleaner for longer, so I'm able to use the same batch for more sessions than with a conventional pot. Rather good product, would recommend for everyday use.",
      "rating": 4.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20170902
    },
    {
      "title": "unsafe fire hazard",
      "text": "Arrived dented. Beware unit has a \"magnetic cord\". Cord hookup is cheap and falls off by itself. If it falls off - there are wires exposed that could start a fire or cause a shock. POOREST DESIGN EVER. Thermostat is also not accurate and 50 degrees or so makes a difference in frying.",
      "rating": 1.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 4,
      "publication_date": 20181031
    },
    {
      "title": "Not bad for the price",
      "text": "Used it three times to fry chicken and fish. I don't hate and I don't like it. Mix feelings. It hold the temperature nicely. The problem is getting the temperature to go up. It takes a goood amount of time to heat up the oil. Clean up can be good or bad depend on how big of a mess you made. All I can say is it is decent enough for frying fries, chicken and fish.",
      "rating": 3.0,
      "verified": true,
      "author": "Tuan",
      "helpful_votes": 2,
      "publication_date": 20190418
    },
    {
      "title": "five star!!",
      "text": "Took a little to while to heat up the oil, which is understandable. Overall I love it!! Worth the money and time!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 6,
      "publication_date": 20180218
    },
    {
      "title": "Looks great, works great",
      "text": "I used this to make hundreds of crab cakes at a pool party and it worked great. I like that it looks like a mini professional frier. Hope it lasts!",
      "rating": 5.0,
      "verified": true,
      "author": "Anna Banana",
      "helpful_votes": 3,
      "publication_date": 20190401
    },
    {
      "title": "Even better than I had hoped",
      "text": "This deep fryer is just the right size for cooking for a small family. I like the size, which fits on the counter exactly under my cabinets. It reaches 350 degrees in about 15 minutes, and holds that temp well. The basket is the right size for my needs. If you need more fried food at the same time, I advise going for the model that is twice the size. My only criticism is I wish the timer was lit. It's hard to read under the shadow of my cabinets. Good fryer at a fair price.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill B.",
      "helpful_votes": 2,
      "publication_date": 20190108
    },
    {
      "title": "Very short cord",
      "text": "I just opened the box got it out to use it and I see how short the actual cord is basically nowhere in the plugin reach, and it’s so loose can’t have that around my kitchen with young kids as I was gonna use it on top of my stove only place the cord would reach but no way too dangerous, and definitely not worth that amount of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Agim d.",
      "helpful_votes": 2,
      "publication_date": 20190207
    },
    {
      "title": "Good for kitchen top, depending on what you're drying.",
      "text": "Good for kitchen top, depending on what you're frying. It worked awesome the first time with olive oil. Once I swapped out the initial oil to try something new (lard), it just seems to not want to reach a very standard temp. Now back with olive oil, it reaches the right temp, but doesn't seem to be uniform throughout. I'll be trying coconut and peanut oils next.",
      "rating": 4.0,
      "verified": true,
      "author": "Sketch",
      "helpful_votes": 2,
      "publication_date": 20180915
    },
    {
      "title": "Cheaply made.",
      "text": "Just received this and noticed that it was very tinny and cheaply made, it does heat up pretty quickly so that’s a plus, like all electrical appliances today they make the cord way too short which in my opinion makes you have to use an extension cord which kind of defeats the reason they make it short to begin with, all in all not a bad product, but there is lots of room for improvement.",
      "rating": 3.0,
      "verified": true,
      "author": "Will Wlodarczyk",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great size to leave on the counter",
      "text": "This got this for my husband for Father's Day.. we have made wings, fried pickles, breaded cheese sticks and fried green beans. Great size to leave on the counter top",
      "rating": 5.0,
      "verified": true,
      "author": "donna robbins",
      "helpful_votes": 7,
      "publication_date": 20170430
    },
    {
      "title": "Its quite easy to disassemble and clean and stores easily on the ...",
      "text": "it heats and holds the oil at 375 degrees and holds quite a bit of food. Its quite easy to disassemble and clean and stores easily on the kitchen counter.",
      "rating": 5.0,
      "verified": true,
      "author": ">Wildbill 1998",
      "helpful_votes": 10,
      "publication_date": 20160422
    },
    {
      "title": "Doesn't reach temperature",
      "text": "Timer didn't work right out of box, flashes and ticks even when unplugged. highest temp 330 degrees. Going back.",
      "rating": 1.0,
      "verified": true,
      "author": "Q",
      "helpful_votes": 2,
      "publication_date": 20200204
    },
    {
      "title": "Nice item, easy cleanup.",
      "text": "Cooked wings the other night, they came out GREAT. The ONLY thing I didn’t like, the lid when the basket is dropped into the oil, will not close properly. If you push down on the lid, it will close, however, the basket will raise up on the opposite end from the handle. Other than that, it works FANTASTIC !!",
      "rating": 4.0,
      "verified": true,
      "author": "Randall Olsen",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "Temperature numbers are cheap paint.",
      "text": "I knocked 2 stars off because of the laziness of the numbers displayed on the dial. They are basically painted on and can very easily be rubbed off by accident from cleaning the unit. Even wiping your thumb against them wipes them off. Unacceptable.",
      "rating": 3.0,
      "verified": true,
      "author": "Verified purchase ",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Broke after 1 use. Garbage.",
      "text": "First off, it broke after 1 use. Complete waste of money and time researching the \"reset\" option. Temperature not precise (i.e., it doesn't give you the reading of the current temp) if you are trying to deep fry anything at a specific temperature since it changes once you put a batch in.",
      "rating": 1.0,
      "verified": true,
      "author": "Karolina",
      "helpful_votes": 0,
      "publication_date": 20190324
    },
    {
      "title": "I am happy with how it cooks and how quickly it warms ...",
      "text": "This works really well. I am happy with how it cooks and how quickly it warms up. Overall, a product I like.",
      "rating": 5.0,
      "verified": true,
      "author": "Bowslayer",
      "helpful_votes": 7,
      "publication_date": 20170413
    },
    {
      "title": "Element off bottom",
      "text": "Great little fryer, holds about 3/4 gal of oil. The in oil element is off the bottom which keeps it from burning the inevitable extra batter that falls off which keeps the oil usable several fryings longer. It also brings oil to temp (350°F) and recovers after dropping fish in pretty quickly. I'm very satisfied with it, a small version of my much larger outside cooker. Also easy to clean when time to change oil.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff h.",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Works very well!",
      "text": "We had bought the Gourmia brand one for the Superbowl and the glass shattered in our onion rings. We returned it the next day in exchange for this Hamilton Beach fryer which we've useed many many times since with no issues.",
      "rating": 5.0,
      "verified": true,
      "author": "JGasPhotodotcom",
      "helpful_votes": 3,
      "publication_date": 20180304
    },
    {
      "title": "Works great",
      "text": "I've made a batch of doughnuts and 2 batches of cannoli. Love this thing. I can pump out 5 cannoli every 3 minutes. Easy to clean. Pretty compact shape, so it's easy to chuck everything into it and store it.",
      "rating": 5.0,
      "verified": true,
      "author": "LG5578",
      "helpful_votes": 3,
      "publication_date": 20180211
    },
    {
      "title": "good for the price",
      "text": "it takes awhile to heat up .recovery after every fry takes long. i love it though ever since we got it my cholesterol has reached heights never seen before. i no longer need to drink water to swallow my food because its so greasy it just slides down my throat with such ease water isn't necessary. my water bill has dropped because of this fine product.i have saved more money on my water bill than i spent on this fryer because of how slippery my food is after frying with this majestic product.",
      "rating": 5.0,
      "verified": true,
      "author": "Papichulo",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "fryer",
      "text": "this got a 4 star instead of 5 because there is o on off switch, you have to unplug it to turn off, this replaces another one we had for years that did have a on/off switch and stopped working. other then not having the on/off switch I like this one, easy to use, easy to clean",
      "rating": 4.0,
      "verified": true,
      "author": "L. Burdge",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "No more burger king",
      "text": "Instead of going to burger king to get fries, now I make fries at home. It's great, super messy, but they taste good so It's whatever. The product works as expected, it gets hot pretty quick and then fries whatever you have in it. Ya know, its a fryer.",
      "rating": 5.0,
      "verified": true,
      "author": "Lennart",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Timer malfunctions",
      "text": "Timer never worked. Product support requires you to deal with manufacturer though Amazon is the seller. Piece of junk. Will never deal with cheap Hamilton Beach products again",
      "rating": 1.0,
      "verified": true,
      "author": "Rocco Costa",
      "helpful_votes": 4,
      "publication_date": 20180317
    },
    {
      "title": "Not the best but for the money...",
      "text": "Simple to use. Easy to clean and actually comes clean unlike my previous fryers. My temp control goes up to 375 and I’m used to it going up to 450 but things usually just take a little longer to cook. The lid has a couple of grooves cut in the lip to accommodate the heating element tubes and wires and mine came not fitting well enough to allow the lid to sit all the way down. Finally got to use the drommel I bought 5 years ago. Fits now.",
      "rating": 4.0,
      "verified": true,
      "author": "Audieace",
      "helpful_votes": 0,
      "publication_date": 20200510
    },
    {
      "title": "Great fryer",
      "text": "Heats quick, good temp control, big enough for a steak on the bottom. Saw a guy do it on YouTube and decided to try. Turned out unbelievable! Chicken and fries turned out great too. Good size for 2, probably small for a family of 4. Only reason for the 4 stars is that the exterior is a little light weight, and flexes as it gets washed, might be a little too lightweight.",
      "rating": 4.0,
      "verified": true,
      "author": "Ted Adams",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Perfect gift",
      "text": "Ordered this for my mom as a gift. She has an air fryer but also wanted one to use for items she couldn't fry with the air fryer. She seems to really enjoy it. It is compact enough to keep out in our small apartment kitchen and simple to use for non English speaker .",
      "rating": 5.0,
      "verified": true,
      "author": "S.EJ ",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "Great, safe, effective fryer for reasonable cost",
      "text": "I received a lower quality, cheaper brand fryer for Christmas as a gift, but I did not feel comfortable using it because it did not have a basket, and I thought it was only a matter of time before I received a nasty oil burn. This fryer is a much better option because hot oil is a serious matter (as I'm sure we all know). Don't skimp on quality on a deep fryer. Get a good one. This is an effective one for what I need it to do. It's easy to use, and I like the adjustable temperature knob. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "jw",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Easy",
      "text": "The assembly and disassembly of this fryer is super simple. It is well worth the money and it was honestly some of the best fried food I had. It’s easy to use and the timer makes it even more simple. If you’re looking for an easy clean up and an easy way to fry food this is what you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Shane T",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Temperature not high enough.",
      "text": "Deep fat fries my okra like a champ. Replaces an old fryer I have had for years. Would like temperature to be able to reach 375 vs 350 degrees. Like the deep well for the basket.",
      "rating": 4.0,
      "verified": true,
      "author": "asooner",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Good buy",
      "text": "Great fryer. Not big on cleaning theses contraptions but I'm sure my husband will do just fine. :-D",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Works just great",
      "text": "As a chef, I see nothing wrong with this product except that the people who wrote negative reviews must be crybabies that don't know how to work and maintain a simple kitchen appliance. It made the best wings ever, and is a pretty well built product.",
      "rating": 5.0,
      "verified": true,
      "author": "Chef Richie",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "Don’t buy this fryer",
      "text": "Don’t buy this fryer, I’ve used it once and it has already stopped working. The fryer has no power. Spend more money on product that has a better power system. The cord doesn’t seem to be the best quality and has broken with just once use. The system to reset the fryer doesn’t work either. Fryer was hand washed and stored properly with no problems the first time.",
      "rating": 1.0,
      "verified": true,
      "author": "Arik Hinz",
      "helpful_votes": 2,
      "publication_date": 20190622
    },
    {
      "title": "Good size",
      "text": "We love the size of this unit. I wanted the biggest one made (it's a man thing) but alas, it would take up too much room for what we do. This one is perfect for our family size.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "Exactly what we needed!",
      "text": "We aren’t super sticklers about the temp so I don’t want to speak on that! We got this after quarantine began to have a few fun evenings of junk food and it has been absolutely perfect. Exactly what we wanted, easy to use outside. I love that it has a basket and it’s long so we can fit several different types of food in it. It’s not too big, it’s not too small, it’s just right for our family of three. I love that it has a lid, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Kat Huene",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "DO NOT BUY THIS IT STOPPED WORKING THE SECOND TIME I TRIED TO USE IT",
      "text": "IT BLEW UP THE SECOND TIME I TRYED TO USE IT",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos Carlo",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Defective - No Power",
      "text": "I'm sure this fryer is fine if it actually works, but mine was broken right out of the box - no power. The unit just doesn't function. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Noyes",
      "helpful_votes": 6,
      "publication_date": 20180407
    },
    {
      "title": "Great fryer, keeps deep frying clean",
      "text": "Perfect for deep frying small amounts of taters, fish, shrimp, etc. Keeps counters clean, heats up quickly and holds the temp. Clean up is also easy and doesn't take up a whole lot of space in the cupboards.",
      "rating": 5.0,
      "verified": true,
      "author": "Blitz Krieg",
      "helpful_votes": 3,
      "publication_date": 20170803
    },
    {
      "title": "Basket handle problems",
      "text": "I purchased my fryer on September 25, 2018. It is seldom used. A couple of months ago I noticed that a small corner piece of the plastic handle on the fryer basket was broken. I didn't give it much thought at the time but when I used the fryer again last night a bigger piece of the plastic handle had broken off and there is a longitudinal crack along the top of the handle. I guess that I will tape the handle up and continue to use. I would like to give the fryer a higher rating but under the circumstances 2 stars are justified.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "I really like this. I been using it ever sense the ...",
      "text": "I really like this. I been using it ever sense the first day it came!! No problems and no issues. It works exactly as it should! Easy clean up and the timer so convenient!",
      "rating": 5.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 4,
      "publication_date": 20170504
    },
    {
      "title": "had a hamilton beach fryer before stopped working. try ...",
      "text": "had a hamilton beach fryer before stopped working. try to order replacement parts said obsolete. bought a new one worked twice. will not be buying anymore hamilton beach products",
      "rating": 1.0,
      "verified": true,
      "author": "Larry S.",
      "helpful_votes": 6,
      "publication_date": 20180226
    },
    {
      "title": "Easy to use",
      "text": "Only used once and it cooked well but it was a lot harder to clean up than I expected. It kept the grease from popping out but crevices inside were really greasy.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Radney",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Five stars plus",
      "text": "Excellent product. Superb customer service. Would definitely purchase again from this seller, and would recommend this product to others.",
      "rating": 5.0,
      "verified": true,
      "author": "JUDY RESNICK",
      "helpful_votes": 5,
      "publication_date": 20170307
    },
    {
      "title": "Needs a higher temerature",
      "text": "Does a nice job for the money but doesn't go above 375. Some fried foods need up to 450, so that's why the 5th star is missing.",
      "rating": 4.0,
      "verified": true,
      "author": "Rob ",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "So far so good",
      "text": "So far this fryer is working great. It is easy to clean and use. I use this outdoor so my house doesn’t smell. The capacity is good and should be sufficient for most people. We use it once a week",
      "rating": 5.0,
      "verified": true,
      "author": "Dao C.",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Easy touse, no disgusting odors.",
      "text": "I love that I can disassemble so much of this, clean it, reassemble in a jiff and go. It eliminates those old odors that were common in older deep fryers. My food comes out tasting and smelling great. I would recommend this to those that fry.",
      "rating": 4.0,
      "verified": true,
      "author": "teresa48",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Beat deep fryer",
      "text": "Best product ever. You can fry with lid on and the basket is for easy emptying of the food. Great product. Easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Works great. The lid is very nice to help with ...",
      "text": "Use it all the time! Works great. The lid is very nice to help with splatter.",
      "rating": 5.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 6,
      "publication_date": 20170207
    },
    {
      "title": "Great fryer",
      "text": "Love my deep fryer. Much easier to clean then other fryers. Very sturdy and decent size can fit a lot of food in it. I do not regret buying this",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Doesn’t last",
      "text": "This fryer was fine until it stopped working after 6 months of owning it and 2 uses.",
      "rating": 1.0,
      "verified": true,
      "author": "NOLARED",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "This a great deep fryer at a great price.",
      "text": "We've had several deep fryers over the years but this one is the best by far. No problems with operating it or connecting it. It heats up fast, is easy to clean and the basket is well constructed and solid to handle. We really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Knight",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "I can not recommend this product",
      "text": "Returned the tempature gauge was not working, the tank liner was ablack coating that I didn't like I was afraid it will wear off as per other users notes!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Ron Concepcion",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "I use it all the time for frying chicken, French fries and wanton chips",
      "text": "I bought this deep fryer for a Christmas gift for my daughter. I have one and love it so much that I thought it would make a great gift for someone just starting out.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger B.",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Used to be good, not anymore",
      "text": "I like most Hamilton Beach products and I was very please with this the few times that We used it but after 6 month, only 6 or 7 uses the fryer just started popping the reset safety and it kept doing it over and over, is was just imposible to use so is was waist of money for me",
      "rating": 2.0,
      "verified": true,
      "author": "sandor melendez",
      "helpful_votes": 0,
      "publication_date": 20180922
    },
    {
      "title": "Great Unit",
      "text": "Easy to clean, easy to use. Minor complaint in the power cord is a little short. Seems to get hot enough for fries, chicken, and tempura, so we're good there. but the real test . . . from scratch Beignet . . . ohhh yes . . .",
      "rating": 5.0,
      "verified": true,
      "author": "DAK",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Fryer works great and is still going strong after using it a ...",
      "text": "Fryer works great and is still going strong after using it a half dozen times or so since purchasing it. Easy to cook and very easy to clean which is a big plus.",
      "rating": 5.0,
      "verified": true,
      "author": "Hodgie",
      "helpful_votes": 3,
      "publication_date": 20170522
    },
    {
      "title": "Hard to clean",
      "text": "I was really happy but there only thing is it's hard to clean and the bucket handle is very cheap the black plastic is coming off.",
      "rating": 3.0,
      "verified": true,
      "author": "Muhammad Rizwan",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "AWESOME DEEP FRYER",
      "text": "We have been using an air fryer for over a year....sometimes you just want to have fresh cut fries and other app. type foods in oil (lol). We no longer use our air fryer. The oil heats up pretty fast and when that green light comes on indicating that the food is done it always is.",
      "rating": 5.0,
      "verified": true,
      "author": "Anthony & Tina Gallegos",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Yes!",
      "text": "It doesn't ooze grease like others do and it doesn't take up a lot of space. Very happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Dony",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "Best deep fryer tomorrow",
      "text": "I Like that is easy to use. Are use it for cooking french fries and frying chicken. I have no dislikes about this Product",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Howard",
      "helpful_votes": 0,
      "publication_date": 20200311
    },
    {
      "title": "One Star",
      "text": "USED TWO TIMES AND IT STOPPED WORKING. WILL NOT RESET.",
      "rating": 1.0,
      "verified": true,
      "author": "tami",
      "helpful_votes": 3,
      "publication_date": 20180622
    },
    {
      "title": "can flash fry a buffalo in 7 seconds!",
      "text": "if it had an actual filer for cooking smells this would get 6 stars...! heats up fast holds temp well!!",
      "rating": 4.0,
      "verified": true,
      "author": "C802",
      "helpful_votes": 4,
      "publication_date": 20170323
    },
    {
      "title": "DID NOT HOLD UP",
      "text": "Used one and worked great. Next time I went to use ready light came right on bot nothing heated up. Tried hitting reset but would not depress. Useless now, going to try to file warranty claim.",
      "rating": 1.0,
      "verified": true,
      "author": "Christopher F. Bernardi",
      "helpful_votes": 4,
      "publication_date": 20171224
    },
    {
      "title": "Five Stars",
      "text": "Has worked like a charm and holds a ton of chicken wings!",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie tomaiko",
      "helpful_votes": 6,
      "publication_date": 20170514
    },
    {
      "title": "Loved that you could set the cooking temperature and the ...",
      "text": "Bought for a fish fry we had this weekend and it was a hit! Loved that you could set the cooking temperature and the plug has a magnetic click so if it’s pulled it easily disconnects! Will definitely buy another!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebekah Parker",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Hamilton  Beach  Deep Fryer",
      "text": "I like that it is not to big. I have fryed fish & fries, etc. It is easy to take apart to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Peters",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Worth every dollar",
      "text": "Love how fast it cooks and how fast it heats up love this deep fryer",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Satisfied",
      "text": "Heats up quicker and larger than the one I replaced it with",
      "rating": 5.0,
      "verified": true,
      "author": "Lefty",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "Best fried food ever",
      "text": "I love this fryer. No need to order out for wings fish or fries. Food comes out like you ordered from a restaurant.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlotta Tullis",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Good fryer for the price.",
      "text": "Good fryer for the price. We use it for fries as our kids like them fried over baked in the oven. Just watch how much oil you use even with the max line, it over flowed and was a huge mess to clean up. Comes apart easily for cleaning and storing.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy Cogswell",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "Great!",
      "text": "Works great. Exactly what I expected. Have used many times and made some amazing chicken wings.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda H.",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Not very happy with this purchase",
      "text": "Not very happy with this purchase. Shortly after I purchased it I used it once to fry chicken strips. I cleaned and put it away for a few months. I plugged it in to use for only the second time, and it doesn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Lauren Scorsone",
      "helpful_votes": 3,
      "publication_date": 20180531
    },
    {
      "title": "Just ok",
      "text": "it is just ok.... the top doesn't fit perfectly and it feels that there is no smell control if you looking for something cheap to serve your purpose, this is for you but if you are trying to get the right/perfect thing at a good price, you may be disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "saifeddine khouja",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Would recommend",
      "text": "My husband loves this. We cook a lot of fish and have always used a fry pan. This was so easy. No flipping the filets. Clean up was do say.",
      "rating": 5.0,
      "verified": true,
      "author": "CANDACE NEARHOOF",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Worked only once",
      "text": "We got this before christmas and just started using it last week. Now it doesn't work. The lights are on I have pushed the reset button as described in the manual. But it just won't heat up.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele Poe",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Works great. Fries quick",
      "text": "Works great. Fries quick. I use it outside cause the smell is strong and lingers but makes some great wings and great french fries and is easy and has good safety features.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Great product",
      "text": "Got it in a lighting deal ,put oil in it and had fry's in it worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191218
    },
    {
      "title": "Awesome deep fryer",
      "text": "This is amazing. Heats up quickly and cooked cod in 8 minutes. I love this deep fryer and will purchase a second one for our cabin.",
      "rating": 5.0,
      "verified": true,
      "author": "JFK",
      "helpful_votes": 2,
      "publication_date": 20170619
    },
    {
      "title": "More Chinese  Junk",
      "text": "If you love that formally American companies now are Chinese companies you will love this.",
      "rating": 1.0,
      "verified": true,
      "author": "John Kavaliauskas",
      "helpful_votes": 3,
      "publication_date": 20180821
    },
    {
      "title": "Perfect for what we needed",
      "text": "Perfect for what we needed, Sorry to say my only complaint, I'm making far too many French fries, delicious. Cooks perfectly, easy to use and safe, maintains the temperature very well.",
      "rating": 5.0,
      "verified": true,
      "author": "susan",
      "helpful_votes": 0,
      "publication_date": 20180522
    },
    {
      "title": "Great",
      "text": "I downsized from a larger version that I also liked. I think this is a better size for me and my family. Easy to store and you don't need too much oil. Works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Highly recommend",
      "text": "It's great! I highly recommend. It comes completely apart for easy cleaning! We use it all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "KazzBoz",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Great Fryet",
      "text": "We loved this fryer. Works really well. We like frying chicken wings or fish or shrimp, but not in the house due to the smell of grease. So we plug this fryer in the garage and fry away. Food is always perfect. I highly recommend this fryer. However, the clean up is a challenge..... so glad my husband does this part!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Angela J.",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Works perfectly",
      "text": "Great fryer for a low low price, heats quickly and cooks well. Would recommend for home use",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 3,
      "publication_date": 20170330
    },
    {
      "title": "The Best Fryer Ever",
      "text": "Love the way it cooks the foods. We as a family use it often. We wouldn't trade it for the world. This is one of the best purchases I have purchased so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Gloria Edwards",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Love my deep fryer!",
      "text": "This was a great buy for me. It was super easy to use and it saved a lot of time cooking in batches. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tahira",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Great, but",
      "text": "Works great, but the window fogs up when frying, making it a little useless. Other than that this thing works great and produces great tasing food.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20181119
    },
    {
      "title": "Five Stars Very satisfied",
      "text": "A little slow on the warm up but not a problem.Great capacity easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190918
    }
  ],
  "product_meta": {
    "title": "Hamilton Beach Deep Fryer, 12 Cups / 3 Liters Oil Capacity, Frying Basket with Hooks, Lid with View Window, Stainless Steel, Professional Grade, Electric, 1500 Watts (35033)",
    "description": "Hamilton Beach deep fryers are generously sized for greater versatility -- some even accommodating a whole chicken. What's more, you can fry crispy, mouth-watering foods without the mess you've come to expect. Food can be lowered into hot oil and lifted out while the lid is closed for splatter-free frying. Hamilton Beach deep fryers also feature adjustable heat and convenient timers. Hamilton Beach consumer deep fryers for the home are easy to clean and most models include a dishwasher-safe nonstick pot. The breakaway cord featured on most deep fryers makes storage easy too. If your unit is not heating or will not turn on, your unit may need to be reset 1) Make sure fryer and oil are cold, 2) Turn temperature control to min, 3) unplug magnetic cord from the wall outlet, 4). Remove removable control panel and heater element, 5) Use a thin pointed object such as a wooden skewer or thin screwdriver to push in reset.",
    "rating": 4.5,
    "feature_bullets": [
      "Fast Heating & Cooking: Immersed Heating Element in This Professional Style Deep Fryer Heats up Oil Faster so You Can Quickly Get to Frying.",
      "Adjustable Temperature: Take the Guesswork out of Frying. Set Your Desired Temperature, and a Ready Light Will Let You Know When It's Time to Add the Food to the Deep Fryer.",
      "Feed a Crowd: With an 8 cup food capacity (12 cups oil capacity), this deep fryer make enough crispy food to feed a crowd, without having to cook in multiple batches.",
      "Less Mess - Splatter Free Frying: Use Vented Lid While Frying to Avoid Splatters With This Professional Style Deep Fryer. Watch Cooking Through the View Window in Lid. Basket With Hook for Easy, Mess Free Draining.",
      "Easy Cleaning: Heating Element Removes for Easy Cleaning. Enamel-Coated Oil Tank, Lid and Basket Are Dishwasher Safe."
    ],
    "specifications": {
      "Product Dimensions": "16.3 x 8.9 x 10.2 inches",
      "Item Weight": "8.6 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "Hamilton Beach",
      "ASIN": "B00CXMNZTQ",
      "Item model number": "35033",
      "Customer Reviews": "4.5 out of 5 stars1,507 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#54,887 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 2, 2013"
    },
    "categories": [
      "Small Appliances",
      "Fryers",
      "Home & Kitchen",
      "Deep Fryers",
      "Kitchen & Dining"
    ],
    "price": ""
  }
}