{
  "website_summaries": [
    {
      "verdict": "A lightweight leave-in conditioner with unbeatable detangling power.",
      "pros": [
        "Works on fine hair without weighing it down",
        "Softens and boosts shine",
        "The best for detangling"
      ],
      "cons": [
        "A few say it left their hair crunchy"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "AMAZING product",
      "text": "I don't use the word \"amazing\" easily but this hair product is just that. I have struggled my whole life with very coarse, wavy hair. Anti-frizz products are too greasy, detanglers are not enough. I have tried dozens of products over the years, various price points, none really do what I need until now. This spray makes my hair soft for the first time ever, and minimizes tangles too. After washing/conditioning, I put a few sprays in before brushing with a wet brush, then a few more once I'm done brushing. It's just fantastic!!",
      "rating": 5.0,
      "verified": true,
      "author": "Aimster",
      "helpful_votes": 23,
      "publication_date": 20191021
    },
    {
      "title": "Compared to Keratin Mist",
      "text": "If you look inside the bottle, Keratin Leave-in Conditioner is a thick white conditioner and Keratin Mist is a gold color liquid. Both make it super easy to comb through. The Leave-in Conditioner helps weigh down the hair if you are looking for more initial control over frizzies. I’m not sure why this bottle is half the size of the Keratin Mist for around the same price, though.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Coral",
      "helpful_votes": 28,
      "publication_date": 20171210
    },
    {
      "title": "Meh... disappointing...but",
      "text": "Update:. It still doesn't do much to soften or condition my hair but I noticed that I have less fall out since I decided to use it instead of toss it in the trash. I guess that something 😁 This hasn't done anything spectacular for my hair at all. I don't notice any difference. I read the reviews before ordering .and was hopeful...but the only thing good is it sprays evenly for a conditioner.... The smell is ok. It's a light citrus-type fragrance. Doesn't make you smell like pledge furniture polish at all...more like a real lemon scent.",
      "rating": 3.0,
      "verified": true,
      "author": "Jennifer B",
      "helpful_votes": 8,
      "publication_date": 20191228
    },
    {
      "title": "It's a great conditioner!",
      "text": "This conditioner is the best I've tried. And I've tried many. 1 week and I noticed my hair is stronger and more lustrous. It makes managing natural hair very easy. No shedding!",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Edwards",
      "helpful_votes": 9,
      "publication_date": 20190723
    },
    {
      "title": "Great product for hair",
      "text": "Great product for hair. I love it. Just spray it in after shampooing, conditioning, towel drying and go! No rinsing required. It has a pleasant smell and has made a big difference in my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Rainy Daisy",
      "helpful_votes": 20,
      "publication_date": 20170116
    },
    {
      "title": "Great product!!",
      "text": "Love this leave in conditioner! Initially used at an upscale salon on vacation and loved it. Makes a noticeable difference on my hair, which has become dry and damaged over the years of color treating. Will buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Robyn D",
      "helpful_votes": 19,
      "publication_date": 20161209
    },
    {
      "title": "Recommended",
      "text": "I sprayed on a little more than I should have the first time, but it gave me waves that I haven't seen in my hair directly after washing, ever (next time I'll only spritz 3-4 pumps). That was a great surprise. As recommended by another buyer, avoid your scalp area. I was not that impressed with the fragrance but fortunately it goes away after awhile. Wish they could improve on that aspect.",
      "rating": 4.0,
      "verified": true,
      "author": "Lorelei",
      "helpful_votes": 16,
      "publication_date": 20160910
    },
    {
      "title": "nice leave in conditioner",
      "text": "very nice leave in conditioner. I was having some damage from coloring and this really is nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Country Hick",
      "helpful_votes": 11,
      "publication_date": 20170316
    },
    {
      "title": "COMPARE TO 'IT'S A 10'",
      "text": "SIMILAR TO 'IT A TEN' LEAVE-IN WHICH I WAS ALWAYS SUPER LOYAL TO, BUT THE PRICE KEPT ON INCREASING. TRIED OUT THIS LITTLE GEM AND 'IT'S A WINNER' LOL. VERY SIMILAR EFFECT, FEEL AND MOISTURE, MUCH SMALLER PRICE TAG.",
      "rating": 5.0,
      "verified": true,
      "author": "A",
      "helpful_votes": 5,
      "publication_date": 20190411
    },
    {
      "title": "Not as described",
      "text": "I bought this leave-in conditioner for daily use. It is stated that it will straighten the hair during the day. I did not find this at all. It make my hair more curly and looked more dry. I do not recommend it for dry hair; however, it may work better if used with other CHI shampoo and conditioner. You have to try if it will work with your hair !",
      "rating": 1.0,
      "verified": true,
      "author": "Ahmed",
      "helpful_votes": 2,
      "publication_date": 20200216
    },
    {
      "title": "The frangrance is way too strong!",
      "text": "I have allergies and one of them is perfume. Can actually close up my throat. I opened the product and smelling, I am afraid to put on my hair due to the intense smell. It might be nice to some but can become poison to me. DO YOU MAKE THIS PRODUCT IN A SOFTER ODOR OR FRAGRANCE FREE? Someone recommended this to me but not knowing the odor.",
      "rating": 3.0,
      "verified": true,
      "author": "Carolyn Ortagus",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Good",
      "text": "I have been using this brand for many years, periodically. Before you buy in the «blind» I advise you first get acquainted with this product closer to the mall. This spray has a very pleasant smell and works great. I will say about the other products of this brand - you need to be careful, because I met the mask of this product with a disgusting smell.",
      "rating": 5.0,
      "verified": true,
      "author": "Anastasia",
      "helpful_votes": 2,
      "publication_date": 20190501
    },
    {
      "title": "Saves my hair",
      "text": "My hair gets split ends but now my hair is so much healthier. Every night I dampen the ends of my hair and apply some leave-in conditioner and braid it and it looks great in the morning!",
      "rating": 5.0,
      "verified": true,
      "author": "John Iseli",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Chi leave in conditioner",
      "text": "Was recommended to try this out by a beautician. She informed me it would help strengthen my hair. The smell is nice but I habe yet to see any improvement on my hair. I use quite a bitnin my hair because when I use the normal amount it doesn't feel like enough. Not really impressed.",
      "rating": 4.0,
      "verified": true,
      "author": "Heidi Spencer-Meyer",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Chi karetin leave in conditioner",
      "text": "My hair is so dry prior to using cHI Karetin leave in conditioner. It stops the freezes, hair feels smooth. When I wash my hair I don’t use that thick conditioner any more. I just towel dry, spray, massage in, comb through (and I have thick wavy hair) and let it dry naturally",
      "rating": 5.0,
      "verified": true,
      "author": "Cathy L.",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Fake fake fake",
      "text": "This is not real chi. The bottle is completely different. Different text and product does not work the same.",
      "rating": 1.0,
      "verified": true,
      "author": "Jaymee",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great smell",
      "text": "I definitely love the way the product smells. I feel it works best in wet to damp hair, then towel dry. Makes hair soft. I live in the desert so my hair is extra dry. I just started using it so will see what the outcome is. So far seems pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "Lolo",
      "helpful_votes": 0,
      "publication_date": 20200705
    },
    {
      "title": "Ahhhh relief for my fried bleached hair",
      "text": "1st time I’ve ever bought this item. Have been bleaching my pixie haircut for years! Finally I’ve found ‘the one’ product that’s a cure for the crispy fried blonde feel post-bleach job. Smells amazing. I’m buying more soon 👍",
      "rating": 5.0,
      "verified": true,
      "author": "Allie",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Worth every penny!",
      "text": "This is absolutely worth every penny. I love it so much that I use it on my children and husband as well! Just a few sprays after towel drying, then brush it in! It smells delicious, and leaves your hair very soft. This is the first leave in conditioner I've ever used that made my hair noticeably softer. Will definitely keep buying this!",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley ",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "To control my frizzy hair.",
      "text": "This is the best leave in conditioner I have ever used. I have very frizzy and natural curly hair. This product controls frizz and gives me soft curls. Plus I love the fragrance. I always get compliments on my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "So amazing!",
      "text": "This stuff is so amazing and smells just as good. It really conditions your hair good. My daughter and I bleached our hair and this made it feel so healthy afterwards, it was like we didn't even color it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kourtney",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Love, Love!!!!",
      "text": "This stuff is so amazing. I use it on my Maltipoo. Everyone compliments him on how soft he is, and how good he smells. He never smells that good when I pay $80 to have him groomed.",
      "rating": 5.0,
      "verified": true,
      "author": "aj",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Works on my fine hair.",
      "text": "Since recently bleaching and damaging my hair, this product has made my hair softer and repaired it enough that my hair is not like straw. I spray it all after ashower and sleep with it in my hair. The next day it's soft and brushable.",
      "rating": 5.0,
      "verified": true,
      "author": "Kikachu",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Can you smell that smell?",
      "text": "The scent for me was just way too strong. In all honesty I’ve used alot of Kreatin based leave in conditioners so it does work ok in that regard. The scent however I feel is too strong for a leave-in conditioner. Literally smells like straight chemicals.",
      "rating": 3.0,
      "verified": true,
      "author": "Just JP!",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Highly recommend!",
      "text": "CHI is the best on market for treated hair. This owns up to the CHI brand. Is great highly recommend",
      "rating": 4.0,
      "verified": true,
      "author": "Soph",
      "helpful_votes": 4,
      "publication_date": 20170119
    },
    {
      "title": "Love it!",
      "text": "Have always loved this product! A little goes a long way and it smells amazing but not overpowering. I’ve used it for years and it’s cruelty free. Win win.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules1943",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Great filler",
      "text": "I like this pore refiner. Just smooth it in, tamp in a little powder and you are now poreless. The color is great, glides on smooth and works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Love this product!",
      "text": "I love this product. This is the first time I have used a Keratin leave in conditioner. It leaves my hair soft and shiny. And it smells nice also.",
      "rating": 5.0,
      "verified": true,
      "author": "R D",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "A little thick and heavy for a spray",
      "text": "I find wetting one palm, and one spray on the wet hand and rubbing hands together before applying to hair and scalp works well. I usually towel off after that and then brush my hair. I have thinning, fine hair and can use this routine to go from \"bed-head\" messy hair to recently showered and groomed appearance.",
      "rating": 4.0,
      "verified": true,
      "author": "Marc G",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Amazing",
      "text": "Incredible product! Smells great, and makes my hair feel amazing. I have thick black hair that sheds alot depending on the seasons and within 3 uses my hair has almost completely stopped shedding, much to my amazement. Doesnt feel heavy or greasy",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "No no no",
      "text": "This product made my naturally kind of soft hair veryyy very dry and I had to wash my hair that same night because of how dry it made my hair.. if you have soft fair hair, it might not be for you..",
      "rating": 1.0,
      "verified": true,
      "author": "Christeen Fahim",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Great for natural hair!!",
      "text": "Let start off by saying I love the smell. It worked wonders for my hair. Hair was easy to manage and very easy go style...",
      "rating": 5.0,
      "verified": true,
      "author": "Mia Scott",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "This leave in is amazing, really makes my hair easy to comb through ...",
      "text": "This leave in is amazing, really makes my hair easy to comb through and has helped smooth the damage I've done to it through bleaching and such.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Love",
      "helpful_votes": 2,
      "publication_date": 20171011
    },
    {
      "title": "Love this!",
      "text": "My hair is fine and has been highlighted, colored, highlighted again. It was dry and when shampoo and conditioned it was in knots. When I would dry it, it was a frizzy mess. This leave in spray is amazing. After two days of use my hair is not frizzy and smoother then before. I couldn’t of asked for a better product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "soft hair",
      "text": "wife loves it uses it all the time great product amazon has great customer service and good shipping time",
      "rating": 5.0,
      "verified": true,
      "author": "Charpet",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Works perfectly",
      "text": "It holds your frizzy nappy Velcro without looking like a clown",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Great!",
      "text": "Love! The smell is great and works well in my hair. Soft and helps untangle my curly/wavy hair.",
      "rating": 5.0,
      "verified": true,
      "author": "lg",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Smooth like butter",
      "text": "This works great. Makes my daughters thick, curly, tangled hair easy to brush & only a few sprays needed so it lasts a while, even though she has hair past the middle of her back. I use it for my thin hair too, but avoid my scalp because my hair tends to be oily & adding this means a limp mess by the end of the day.",
      "rating": 4.0,
      "verified": true,
      "author": "EB",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Ok",
      "text": "Not overly impressed. I expected a better scent and more softness but it was ok.",
      "rating": 4.0,
      "verified": true,
      "author": "jackie821rrt",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Get this",
      "text": "This was a nice addition to my hair car routine. Put in day after straightening my hair and it made my hair have nice beachy waves and it looked so healthy",
      "rating": 5.0,
      "verified": true,
      "author": "Francesca L",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Very floral/smelly.. didn't help frizzyness",
      "text": "To me this was smelly and made my hair frizzy.. everyone is different tho..",
      "rating": 3.0,
      "verified": true,
      "author": "holly hone",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "P.U.!!",
      "text": "I'm not a beautician so I can't say whether this is good for your hair or not. I can tell you it smelled so bad I had to re-wash my hair! I thought Chi was a reputable brand?",
      "rating": 2.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "no more tangles",
      "text": "This product is easy to use and really helps to detangle and soften my hair. I use just a few sprays to my hair after every wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Dora H.",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Highly recommend",
      "text": "Ulta is always out of this product but Amazon always saves the day! Arrives quickly , great product . I use it everyday and it smells amazing!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Janelle Marie",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "It's awesome. Don't look elsewhere.",
      "text": "I tried to find something else a little cheaper.... I ended up purchasing Chi again. Nothing else tames my fly aways as well!",
      "rating": 5.0,
      "verified": true,
      "author": "R. Crosby",
      "helpful_votes": 0,
      "publication_date": 20181029
    },
    {
      "title": "In LUV!!",
      "text": "The scent of this is amazing & made my hair look beautiful without adding anything else .. Will definitely buy again & again",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Perfect",
      "text": "A great scent, a great product. I like it better than It's a A Ten for my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Lydia21",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Leave In Goop",
      "text": "Liked the smell of this product, but it left my hair feeling like I needed to rinse it out. The return process was great.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelli W",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Leave In Goop",
      "text": "Like the smell of the product, but didn't like the way it made my hair feel. Felt gummy like I needed to rinse it out.",
      "rating": 1.0,
      "verified": true,
      "author": "Kelli W",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Works great to soften my bleached hair",
      "text": "Loving this! Works great to soften my bleached hair. And it smells great.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Seaton",
      "helpful_votes": 5,
      "publication_date": 20170112
    },
    {
      "title": "Didn’t read fully; alcohol inside",
      "text": "I can’t give a fair review of product, I didn’t read all of the ingredients, there is isopropyl alcohol in which is known for causing hair breakage, so I don’t think I will use. Have read other good reviews, my mistake for not thoroughly reading ingredient list. Fast shipping on product also",
      "rating": 4.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Works!",
      "text": "Have been using for years. Great after shampoo detangler. Softens my hair beautifully.",
      "rating": 5.0,
      "verified": true,
      "author": "Nadine Kellar",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Love it",
      "text": "It smells very good and it makes your hair very soft",
      "rating": 5.0,
      "verified": true,
      "author": "alfanerys",
      "helpful_votes": 0,
      "publication_date": 20200527
    },
    {
      "title": "Great for traveling and at home",
      "text": "Exactly what I wanted. Also a little goes a long way. Smells good too.",
      "rating": 5.0,
      "verified": true,
      "author": "crenee**",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Fabulous",
      "text": "I have been using this product for years and love it. I have introduced it to my daughter and she now is a devoted user.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis ",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Love this product but more expensive than just buying it in the store",
      "text": "Love this product for my daughter but it was more expensive buying it online here than in the store",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole B",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Review",
      "text": "Very mild scent works great detangles hair really well. No damage. I would buy again from this seller again.",
      "rating": 5.0,
      "verified": true,
      "author": "Beverly Bambach",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Get it!",
      "text": "This stuff is great! Ever since I started using it, you can tell the difference in my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Leon",
      "helpful_votes": 0,
      "publication_date": 20190623
    },
    {
      "title": "Two Stars",
      "text": "The spray bottle broke out of no where and now does not spray :(",
      "rating": 2.0,
      "verified": true,
      "author": "alexandra",
      "helpful_votes": 2,
      "publication_date": 20170719
    },
    {
      "title": "Great for tangle prone curls!",
      "text": "All hair types are different but my boyfriend has curls that are messy tangles when he doesn't use any products in his hair. When he uses this after a morning shower his hair stays curled all day and doesn't turn into a mess, even with rain.",
      "rating": 5.0,
      "verified": true,
      "author": "Malia Sparkle",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Makes your hair feel great",
      "text": "Love this leave in conditioner leaves my hair so soft",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Viscuso",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Smell so good!",
      "text": "I luv this Keratin conditioner!! Smells so good! Leaves my hair soft, silky and healthy.",
      "rating": 5.0,
      "verified": true,
      "author": "superhero",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Okay leave in",
      "text": "It stickier than the other Chi leave in spray. The smell is overwhelming for me. I have a sensitivity to strong sweet smells.",
      "rating": 2.0,
      "verified": true,
      "author": "Tihara J. Williams",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "The best I've ever used",
      "text": "This is the best I've ever used, wonderful! The smell is very good! Leaves hair super soft and just needs to use little",
      "rating": 5.0,
      "verified": true,
      "author": "Bruna Barros",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Love this product!!",
      "text": "I love the leave in conditioner. Makes my hair feel moisturized and silky all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Works well",
      "text": "This product is great! I have done dry hair and this product gives it volume & curl! No grease or residue or smell! Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Leslie",
      "helpful_votes": 0,
      "publication_date": 20200907
    },
    {
      "title": "Two Stars",
      "text": "I have used way much better product leave in conditioner. Would not purchase again",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Great smell!",
      "text": "I love the smell and the way it makes my hair feel so soft! I travel often so it's the perfect size for a carry on bag. CHI products are my go-to.",
      "rating": 5.0,
      "verified": true,
      "author": "Kacey",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "If your hair responds well to keratin then I highly recommend this leave in",
      "text": "It made my hair so soft and durable. If your hair responds well to keratin then I highly recommend this leave in. Plus it smells pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Leanne A.",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Great detangler",
      "text": "I use this after washing my hair. It gets the tangles out and is a great conditioner!",
      "rating": 5.0,
      "verified": true,
      "author": "Mason's mom",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "Great for thin straight hair",
      "text": "weightless moisture and superb absorption. spray onto hand and spread throughout shaft of the hair. Keratin is all I will use on my hair or my extensions",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.thykeson ",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "My favorite product",
      "text": "After the shower my hair is unbearably tangled. This is the only product that helps get a brush through my wet hair!",
      "rating": 5.0,
      "verified": true,
      "author": "Jenn T",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Auto purchases",
      "text": "Looooveeee this product. I use it everyday to detangle and love that I can set up automatic purchases.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby Thompson",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Worst leave in ever",
      "text": "This can’t be a true Chi product. Leaves a gummy coat on hair. Terrible",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "beat keratin spray for any type of hair",
      "text": "I use this product on my hair dryer wet it helps with moisture and detagling for my hair I have very this curly hair. I awear by this product",
      "rating": 5.0,
      "verified": true,
      "author": "NICOLE",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Great tangle softener",
      "text": "Works great for removing tangles in hair but don’t put too much it will leave a residue.",
      "rating": 4.0,
      "verified": true,
      "author": "Randi",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Hair has never been softer",
      "text": "The smell isn’t offensive and it makes my hair very soft without making me oily!",
      "rating": 5.0,
      "verified": true,
      "author": "K.M.",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "My favorite leave-in!",
      "text": "Love this leave-in conditioner. Smells great, detangles my hair, and leaves it shiny & soft.",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy Nelson",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great for thick, dry hair!",
      "text": "Makes my hair feel sooo soft without making it feel sticky. It's light weight and absorbs into my thick hair quickly. Love the smell too!",
      "rating": 5.0,
      "verified": true,
      "author": "Fernanda M",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Good Leave-In Conditioner",
      "text": "The Chi products smell amazing. I like spray leave in conditioners, it's easy for me to get it all over my hair. My hair feels lightly coated and not crunchy or dry.",
      "rating": 4.0,
      "verified": true,
      "author": "Pam D.",
      "helpful_votes": 0,
      "publication_date": 20180226
    },
    {
      "title": "Great products for Mixed hair",
      "text": "CHI product's are changing my hair into the healthiest it has ever been.",
      "rating": 5.0,
      "verified": true,
      "author": "Arielle Leffler",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Best product to manage curly hair",
      "text": "It leaves your hair soft, shiny and clean. The scent is perfect. After drying hair, applying this product leaves my curly hair soft and dries up with nice soft waves.",
      "rating": 5.0,
      "verified": true,
      "author": "Bing",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Five Stars",
      "text": "Love the smell and makes my hair feel shiny and smooth.",
      "rating": 5.0,
      "verified": true,
      "author": "katc",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Number one fave",
      "text": "This makes my hair feel so soft and I love the smell.. its my FAVORITE leave in conditioner and ive tried plenty",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany Cornell",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Great hair product",
      "text": "This leave it smells amazing, and makes my hair feel soft!",
      "rating": 5.0,
      "verified": true,
      "author": "Leeza",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "this works just as well and is a way better value!",
      "text": "I buy this over and over. I used to buy the it's a 10, this works just as well and is a way better value!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170216
    },
    {
      "title": "Fine hair friendly",
      "text": "Not too heavy for fine hair and really detangles well.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Memoly",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Love",
      "text": "I love all the CHI brand, and I would recommend it to everyone",
      "rating": 5.0,
      "verified": true,
      "author": "Nita L.",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Four Stars",
      "text": "Smells great. It makes hair look great. Good to use after keratin treatment",
      "rating": 4.0,
      "verified": true,
      "author": "Kenya ",
      "helpful_votes": 0,
      "publication_date": 20160105
    },
    {
      "title": "I had a lot of breakage after being pregnant and my hair was in poor shape. This significantly helped restore my hair",
      "text": "I bought this to help my damaged hair. I had a lot of breakage after being pregnant and my hair was in poor shape. This significantly helped restore my hair. It looks healthy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Kristin Aul",
      "helpful_votes": 2,
      "publication_date": 20160731
    },
    {
      "title": "Natural non greasy and light",
      "text": "This is the best leave in conditioner we have tried . It leaves the hair soft and frizz free !",
      "rating": 5.0,
      "verified": true,
      "author": "Cinderella ",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Four Stars",
      "text": "I love the smell of this product. .and it leaves my hair so soft!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Liz",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "My daughter has long beautiful hair but that also means tangles",
      "text": "My daughter has long beautiful hair but that also means tangles. This makes brushing her hair 10x’s easier and it smells amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Five Stars",
      "text": "Good product! Makes hair very soft & full. The shipping charge was horrible tho!",
      "rating": 5.0,
      "verified": true,
      "author": "Tami Dodge",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "I’ve been using this for a few months now and ...",
      "text": "I’ve been using this for a few months now and I do not believe this is the actually product doesn’t smell the same or feel the same",
      "rating": 1.0,
      "verified": true,
      "author": "Kaylianna Nichols",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Good product",
      "text": "I like it, but I feel the weight of it",
      "rating": 3.0,
      "verified": true,
      "author": "Kready",
      "helpful_votes": 0,
      "publication_date": 20160216
    },
    {
      "title": "great product!",
      "text": "This leaves my hair really nice throughout the day! I use it daily after shower.",
      "rating": 5.0,
      "verified": true,
      "author": "R S",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "Five Stars",
      "text": "amazing product use it every night had nursed my hair back to beauty",
      "rating": 5.0,
      "verified": true,
      "author": "nicolleashlee",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "Lightweight non greasy conditioner",
      "text": "I love the way it makes my hair feel after I work it in. Smells great. No greasy residue. Can even be used as a detangler on wet hair.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Heavy and greasy",
      "text": "Different product than the original keratin mist and it makes my hair heavy and greasy. Dont like it at all",
      "rating": 1.0,
      "verified": true,
      "author": "CarrieLee",
      "helpful_votes": 4,
      "publication_date": 20170905
    }
  ],
  "product_meta": {
    "title": "CHI Keratin Leave-in Conditioner ,6 Fl Oz",
    "description": "Size:6 OunceCHI Keratin Leave-In Conditioner is a unique reconstructing leave in treatment designed to infuse damaged hair with a powerful dose of natural keratin to rebuild hair's cuticle. Combining the natural reconstructing power of keratin with the essential nourishments of jojoba and argon oils, this highly sophisticated compound dramatically improves elasticity and prevents future breakage, while adding intense hydration that restores softness and shine.\n\nBRAND STORY\nCHI haircare and tools are manufactured by Farouk Systems a Houston based company.",
    "rating": 4.5,
    "feature_bullets": [
      "Designed to infuse damaged hair with a powerful dose of natural keratin to rebuild hair's cuticle",
      "It improves hair elasticity and preventing future breakage",
      "Ideal for daily use"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2 x 2 x 1 inches; 6.24 Ounces",
      "Item model number": "CHI0215",
      "Batteries": "1 A batteries required.",
      "UPC": "633911728932",
      "Manufacturer": "Farouk CHI",
      "ASIN": "B00CMIMM7M",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Conditioners",
      "Shampoo & Conditioner",
      "Hair Care",
      "Beauty & Personal Care"
    ],
    "price": 11.53
  }
}