{
  "website_summaries": [
    {
      "verdict": "A versatile shoe that's good for a number of purposes, as long as the sole holds out.",
      "pros": [
        "Good all-weather shoes for indoor workouts and outdoor running",
        "Great for wide feet",
        "Lightweight",
        "Comes in white and black",
        "Leather and synthetic uppers",
        "Lateral support",
        "Cushioning EVA midsole",
        "Rubber outsole"
      ],
      "cons": [
        "Many report that the soles are not durable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Know your real shoe size.",
      "text": "I didn't think it was possible, but I actually got a pair of shoes that didn't cost more than $20.00 and they fit and feel great. I'm on my feet walking for more than 10 hours a day and they feel great. I would recommend them to any one. One important item, first trace your foot and measure the length and width in mm to see exactly what your feet really are. I found out my feet grew and measured something different than what the shoe stores were measuring my feet as. So when I purchased the shoes in the correct size they fit perfect. Happy Trails.",
      "rating": 5.0,
      "verified": true,
      "author": "MAXX",
      "helpful_votes": 2,
      "publication_date": 20171229
    },
    {
      "title": "Circus shoes when wet!",
      "text": "This a fine comfortable bargain shoe until: When you walk into the store from a wet snowy parking lot you will immediately attract every security guard and two year old in the building. I have NEVER had a wet shoe squeak against the floor in a decibel range louder than a mad goose. I quit watching basketball on TV when their shoes started squeaking and now I have my own pair. I will enjoy these in dry weather or carpeted conditions but I am too embarrassed to wear these in wet weather unless I am wearing a clown suit and a red nose.",
      "rating": 3.0,
      "verified": true,
      "author": "Sixty9Harley",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "Don't let them sit!",
      "text": "The first time that I put them on the stitching came loose from the right side of the right foot. I put them on again after sitting in the closet for 4 months. Both shoes separated from the top of the shoe to the sole. First time that has ever happened to a pair of shoes of any brand that I have owned.",
      "rating": 1.0,
      "verified": true,
      "author": "Old Goat",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "I bet people in Hell are wearing these shoes right now.",
      "text": "OMG I knew these were cheap shoes, but these make my Dr. Scholls seem like something from Nordstrom's. These hurt, offer no support and the material smells funny. The soles are made of some sort of foam rubber that wears quickly. I thought I could get away with wearing these around on errands just on weeknights after work, etc., but they made my feet blister and smell funny. Pretty much everything I could possibly hate about a shoe is represented in this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 6,
      "publication_date": 20150123
    },
    {
      "title": "just not the most comfortable. They arrived with a white substance on them ...",
      "text": "Firstly, they don't fit as expected. But they fit, just not the most comfortable. They arrived with a white substance on them in various spots- which wiped off easily; so I wasn't gonna make a stink about it. I received these late Thursday and wore them on Friday. thats it. 1 day. Put them on this morning and came to work. while at work i noticed the entire shoe is coming undone in the front. at this pace, i won't be surprised if the shoe completely falls off my foot by the end of the day. Demanding refund. This is a horrible horrible product. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Not much sole.",
      "text": "The shoes fit well and look like the advertisement. Unfortunately the decline of the shoe industry means that the soles of the shoes are made of an extremely soft material that wears very quickly. After two weeks of wear the soles are so thin that a small amount of dew on the parking lot will seep into the shoe before I can get in the building where I work. I refuse to work with wet feet. I like the feel and the shoes are plenty wide for my foot, but I expect more than two weeks wear before failure.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristie",
      "helpful_votes": 6,
      "publication_date": 20141016
    },
    {
      "title": "Big time bummer - My first running shoe in a long time did not meet expectations.",
      "text": "I bought these to wear while walking/jogging in Italy on a 2 week cruise - FILA being a brand name over there they did help me blend in a bit. The uppers lasted well, and clean up nicely, but I had to get rid of them after the trip - we walked around 10000 steps a day during that 2 weeks and that was all these shoes could stand. The shock absorption was gone as was the vast majority of the tread. They had a nice even wear pattern, but I do demand more than 2 weeks wear out of a pair of shoes!",
      "rating": 1.0,
      "verified": true,
      "author": "JF",
      "helpful_votes": 26,
      "publication_date": 20131109
    },
    {
      "title": "First wierd, then right!",
      "text": "Bought Fila before and was better satisfied than with many other brands, including Nike. This time, had a weird thing happen; first pair came in, box labeled \"9.5 4E\", inside of tongue labeled same. Couldn't get my foot in one and compared to my Fila shoes of same size, were 1 1/2\" shorter. But between Amazon and the vendor, refund was issued and a new pair were purchased, shipped timely, and were the right size. Good product, evidently a problem at the factory. Would recommend this brand, product, and vendor.",
      "rating": 5.0,
      "verified": true,
      "author": "L G.",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Won't get another pair from this seller.",
      "text": "The shoes fit well. The craftmanship was garbage. Barely wore them. Mainly used for walking. Glue and sole was/is falling apart on one. They looked worn but I figured it was the type of soft leather. I do like the name brand but I will probably go directly to the Fila website next time and pay the extra. I have many sneakers of the brand and have had them for years. None came from this seller. They still are in great condition even though they have been worn.",
      "rating": 1.0,
      "verified": true,
      "author": "Marly",
      "helpful_votes": 0,
      "publication_date": 20170925
    },
    {
      "title": "Durable, a good quality Running shoe.",
      "text": "I've had these for three years now with regular use on the weekends for exercise. They've lasted quite well considering how long I've had them. I going to replace them with a newer and different style pair now but overall all these negative reviews on here were wrong. I'd say a pair of trainers that last three years with regular use are good.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Sole started to fall off after about 30 days of wear",
      "text": "Would not buy again. after about 30 days of wear (not consecutive days) the soles on both shoes started to separate from the shoe itself along the arch. Five days later they are unwearable and still look like brand new otherwise. You can get an almost identical shoe by Avia at walmart for $20 that will at least last you 6+ months and be more comfortable with a similar fit.",
      "rating": 1.0,
      "verified": true,
      "author": "In the AmaZone",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "... give any real star rating but so far so good. Arrived quickly in the exact size ordered and ...",
      "text": "Kind of early to give any real star rating but so far so good. Arrived quickly in the exact size ordered and they are truly super comfortable to wear around all day.. Plenty wide and so light on the feet. I won't hesitate to buy another pair of these Filas. And I don't run but i do walk and they are marvelous to walk in - good support, light, and comfortable. As for durability, definitely need more time for that as i've worn them only for the past week.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick J. Shields",
      "helpful_votes": 0,
      "publication_date": 20151010
    },
    {
      "title": "TOO SMALL AND NARROW",
      "text": "I generally wear an 81/2, but after reading reviews I ordered a size 9. They are too tight and small. After trying them on for 5 minutes I had to take them off....NOT HAPPY! Now I have to find the time to contact the company, and ship the shoes back. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia D. Forbes",
      "helpful_votes": 13,
      "publication_date": 20140421
    },
    {
      "title": "Great Shoes",
      "text": "These are great shoes and extremely comfortable. For the price I don't think you can get much better shoes. I wear them for running and they are holding up well so far. I have never purchased Fila shoes before so I'm pleasantly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "OK but one shoe was a bit small and the tread life is minimal;",
      "text": "These do run a bit small. I ordered size 10s and one shoe seemed to be much tighter than the other and pinched my big toe. I solved this by creating a McGuyver-inspired shoe horn to stretch out the toe of the shoe. And it worked. They are very comfortable and a reasonable price but as others have noted, the soles are very soft - the tread wears off amazingly quickly. A little bit of walking on trails and gym activity has almost made them bald. I suppose you get what you pay for.",
      "rating": 3.0,
      "verified": true,
      "author": "LFP",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "Bought these shoes in May 2015. Wore them each ...",
      "text": "Bought these shoes in May 2015. Wore them each day for a 2 mile walk, and worn all day during the summer months. Almost 1 year later to the day, they have finally worn out to the point that my socks get wet stepping in puddles. All things considered, from the other shoes I have sampled in this price range it exceeded my expectations.",
      "rating": 4.0,
      "verified": true,
      "author": "MG",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Really pleased, with one small reservation - there might be ...",
      "text": "Really pleased, with one small reservation - there might be a slight defect in the left shoe sole under the inside of my heel. I can only feel it while standing with thin socks, but it becomes irritating over several hours. It would have to be in the sole casting to be invisible to eye inspection and undetectable by hand. With thicker socks I didn't notice it. It's weird.",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "I wear 4E wide ordered 10 1/2 regular and was a good fit",
      "text": "I am a New Balance guy and thru the dice on these. They didn't offer a wide and I normally order a 4E wide and I took a chance with a regular 10 1/2 regular and they came in and fit comfortably and have been very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "If you have wider than average feet, these shoes are for you.",
      "text": "Regardless of brand, it's hard to come by 4e wide shoes and those of us who need them will often for shoes less than optimal. These are the exception: They're reasonably priced, made of quality materials and priced very reasonably. They may not be top brand, but once you put them on and feel just how confortable they are, they're as good as any shoe priced ten times higher.",
      "rating": 5.0,
      "verified": true,
      "author": "Mauricio Martinez",
      "helpful_votes": 0,
      "publication_date": 20160515
    },
    {
      "title": "First time wearing Fila. So far so good.",
      "text": "My husband likes these shoes. He said they fit well too They are light weight shoes and seem sturdy and well sewn/glued. He's so rough on all his shoes only time will tell if these will hold out for a decent amount of time. The price is good for bargain hunters but then again if they don't last...",
      "rating": 5.0,
      "verified": true,
      "author": "KCdeeah",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Comfortable Affordable Sneaker",
      "text": "Comfortable, affordable all black shoe that I can wear to an office casual workplace or go running in. I'm considering getting a second pair just to have it in case this one disappears",
      "rating": 5.0,
      "verified": true,
      "author": "G. House",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "But they fell apart within 3 weeks. The soles ...",
      "text": "But they fell apart within 3 weeks. The soles started coming apart, and they got holes. My son worked at an amusement park, and walked on hot pavement all day. However, bought another pair (Nike), and they last the rest of the summer and still look decent. Plus, I spent around the same amount on the Nike shoes. Will not buy again.",
      "rating": 1.0,
      "verified": true,
      "author": "crystal",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Fit fine, just soles wear out quickly.",
      "text": "These shoes are great for the money but they're not the best shoes in the world. I thought they fit great and were fairly comfortable which is very important when you're on your feet 10 hours a day. However after 2-3 months of use the bottom looks like a bald tire. They're still wearable, they havent worn through yet but the day is quickly approaching.",
      "rating": 3.0,
      "verified": true,
      "author": "ezglyder",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Good Fit - Modest to Poor Durability",
      "text": "I typically wear my shoes until they fall apart; which as you know is not healthy for your feet. That being said, that is exactly what happened to these shoes. They lasted less than 6 months with maybe 3-4 days use per week. I would not call my use heavy, but I would not call it light either. They fit well, and were comfortable until the sole started to detach from the bottom of the shoe. The search for replacement shows for the Costco brand continues. I thought this was close, but in the end they wore out much faster than I expected them to.",
      "rating": 2.0,
      "verified": true,
      "author": "Cory Scherer",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Good Shoes With Short Laces",
      "text": "Used to buy these at local stores but I don't seem to wear a size any of them keep in stock anymore and they're cheaper online anyway. Only issue with these is the laces are too short and I had to replace them to make the shoes usable.",
      "rating": 4.0,
      "verified": true,
      "author": "Hemlock",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "almost like a work shoe",
      "text": "I thought when I purchased this shoe, that it would be a litte more sporty or athletic. It is very agressive and rough, almost like a work shoe. I would not reccommend for running. Slightly comfortable for walking around, but would not say to use this for running.",
      "rating": 2.0,
      "verified": true,
      "author": "Bobby D",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "Poor Fit Is Going To Cost Me",
      "text": "Not sure if these are knock offs they fit so poorly. I shouldn't have purchased this item from Heart & Sole as they make you pay for returns. It's not like I didn't want the product, it just doesn't fit like every other pair of Fila shoes I have bought.",
      "rating": 1.0,
      "verified": true,
      "author": "PappyB",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Cheap",
      "text": "Fit good but cheaply made. Felt cheap as well. Brushed my shoe against a metal corner and it cut right through it leaving a slit. Should have spent a little more money on a better product.",
      "rating": 2.0,
      "verified": true,
      "author": "patrick baker",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "A Great Shoe For My Situation",
      "text": "I have a heel spur and after surgery a couple years ago was unable to wear my normal NB..the arch would push right onto the spur area. These shoes don't cause that problem. This is my 3rd pair of Fila, and I plan to continue purchasing them as needed.",
      "rating": 5.0,
      "verified": true,
      "author": "TeamLentz",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "These shoes are GREAT! Comfortable and wide",
      "text": "These shoes are GREAT! Comfortable and wide. They have saved my feet and made it so that I can stand and walk without pain. If you have bad feet these are for you!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony C",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "They were very comfortable and sturdy",
      "text": "I really liked in my work shoes they were comfortable and and I still have them walk working in them and other things there are good tennis shoes 2 do these things in!",
      "rating": 5.0,
      "verified": true,
      "author": "Olly,G5000",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Good one...",
      "text": "I like this shoe. For the price, it is a great buy. The sole is not that great. The rubber grip covers only a portion of it. Rest of the sole exposes the soft cushion part, which wear out pretty fast and will slip easily...",
      "rating": 4.0,
      "verified": true,
      "author": "Aisu",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "He has super wide feet and these worked really well for him",
      "text": "There shoes fit my husband perfectly. He has super wide feet and these worked really well for him. They have held up so far and are comfortable. He's had them about a month.",
      "rating": 5.0,
      "verified": true,
      "author": "DP1980",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Men's Sneakers to run with Man's Best Friend",
      "text": "Very pleased with the purchase. Always exceptional quality on this brand. Did not disappoint. Really cool and functional sneakers. Good for running with the pooch every AM for 5 miles. Very reasonable price. Carefully packaged and fast delivery. Highly recommend for your runner husband!",
      "rating": 5.0,
      "verified": true,
      "author": "Gia",
      "helpful_votes": 0,
      "publication_date": 20150415
    },
    {
      "title": "great fit bad comfort",
      "text": "They fit just as they should but they are not very comfortable. Walking around all day makes your feet fell like they were beat with hammers.",
      "rating": 2.0,
      "verified": true,
      "author": "Chris O'Brien",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Plenty of Room for my Wide Feet",
      "text": "My foot is quite wide at the toes. Unlike many athletic shoes, these shoes, in a wide size, give me plenty of room in the toe box. I use these shoes for everyday wear which includes a fair bit of walking but no running. For daily wear, these shoes appear to be holding up well.",
      "rating": 5.0,
      "verified": true,
      "author": "tom",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "14 4E Filas about to get hard road test.",
      "text": "Very quick and free shipping: ordered evening of Thursday 2/8, and received Saturday 2/10 @ 1230pm... impressed. Shoes fit well but will reserve fifth star for if they hold up. For $35, they should last about 6-9 months of moderate use in my estimate. Looks good so far, excited!",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Flynn",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "My feet have an annoying habit of poking a hole in the top of ...",
      "text": "My feet have an annoying habit of poking a hole in the top of the shoe due to my big toes. These shoes seem to be immune to that problem.",
      "rating": 5.0,
      "verified": true,
      "author": "JXB",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "nice shoe",
      "text": "width is good but a trifle short, not really a problem as I ordered them 1/2 size big so they fit nicely",
      "rating": 4.0,
      "verified": true,
      "author": "Fireman Bill",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "NO STAR REVIEW.  WONT LET ME POST LESS THAN THE 1 FOR THESE 0 STAR SHOES",
      "text": "Received these on Feb 19, 2016, and today is April 11, 2016 and the soft bottoms are completely worn out. 126.4 mostly inside walking miles on them, a little over 1 1/2 months. My advice to anyone considering these is keep scrolling. The soft bottom is nice for about a month, then it starts to degrade at an alarming rate. Really disappointed that these were labeled as runners. Misleading is what it is. Surprised to find amazon has 1 month warranty on these. TERRIBLE!!",
      "rating": 1.0,
      "verified": true,
      "author": "Bradly Fitzpatrick",
      "helpful_votes": 0,
      "publication_date": 20160411
    },
    {
      "title": "Great shoes.",
      "text": "This is the second pair of these shoes I have purchased. They are lighter than they look to be. Very comfortable, I can wear these all day. The sole absorbs a lot of impact, my knees feel better from wearing these shoes.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Stinedurf",
      "helpful_votes": 0,
      "publication_date": 20160429
    },
    {
      "title": "WIDE!",
      "text": "These shoes feel great! I need wide shoes for my flat feet and these work out well!",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20181120
    },
    {
      "title": "NICE BUT BUT VERY SMALL FIT",
      "text": "COULD NOT EVEN FIT ON MY FOOT. FOR A 4E WIDTH THEY WERE INCREIBLY NARROW.",
      "rating": 1.0,
      "verified": true,
      "author": "YOUR SMALL BUSINESS ADVISOR",
      "helpful_votes": 2,
      "publication_date": 20170317
    },
    {
      "title": "Lasted a few months",
      "text": "good show but get ruined in wet weather. The front middle sole is soft foam and gets ruined quite fast in the rain. It did last a few months.",
      "rating": 3.0,
      "verified": true,
      "author": "C M",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Wears out very fast",
      "text": "I do a lot of walking in my job. I always buy reasonably priced running/walking shoes. These shoes fit well but only lasted about 2 1/2 months before they started coming apart. I normally get 6+ months out of my works shoes. I would suggest NOT buying these.",
      "rating": 2.0,
      "verified": true,
      "author": "Todd H.",
      "helpful_votes": 0,
      "publication_date": 20140503
    },
    {
      "title": "One Star",
      "text": "Cheap construction, it became detached to a little time of use",
      "rating": 1.0,
      "verified": true,
      "author": "jos vazquez",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "I normally do not write reviews but i do feel ...",
      "text": "I normally do not write reviews but i do feel inclined to do one since i am really upset with these shoes. BEWARE the sole is made of the same material you will find in a $2 Walmart flippers! They fell apart after 30 days of sporadic carpeted office use. These are not the shoes you think they are!",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Just okay, but",
      "text": "the price was right for what I wanted. Lower quality leather than NB, Asics or Saucony. Definitely less support and overall cushioning was less than expected. But for yard work will do the job just fine. If you need support and cushioning consider the three other brands.",
      "rating": 3.0,
      "verified": true,
      "author": "Ben_MP",
      "helpful_votes": 0,
      "publication_date": 20140422
    },
    {
      "title": "Wears out really fast",
      "text": "I'm on my feet doing deliveries for hours a day. These shoes wore out within about a month with a beveled edge on one side and heel that makes it hard, and dangerous, to walk in. Get something else please! Other shoes I get wear out and get holes in them after many months, these the tread totally breaks down and water seeps in quickly. AVOID!!",
      "rating": 1.0,
      "verified": true,
      "author": "Bliss",
      "helpful_votes": 0,
      "publication_date": 20131211
    },
    {
      "title": "The Size was small",
      "text": "I had a hard time getting my foot into the shoe, the size says 11 and my toe just touches the end and the width is a small man\"s foot, I took out the shoes strings and re stringed the shoe loose, it would be to much trouble to return and maybe still have a size problem, I think I'm better off trying the size in a store then buying shoes online. Thanks",
      "rating": 3.0,
      "verified": true,
      "author": "baudman61",
      "helpful_votes": 0,
      "publication_date": 20131104
    },
    {
      "title": "GOOD LOOKING AND AFFORDABLE",
      "text": "HUSBAND SAYS THEY FIT LIKE A GLOVE, HE HAS 2 PAIR NOW AND THE PRICE WAS GREAT!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Five Stars",
      "text": "A great shoe feels perfect.....and no extra ten feet of shoe laces this time!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonny",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Not this one",
      "text": "Runs small. Sole came off in less than a month.",
      "rating": 1.0,
      "verified": true,
      "author": "Amos Heath",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "Good!",
      "text": "Ordered for BF, who is very picky about the fit of shoes. No complaints yet!",
      "rating": 5.0,
      "verified": true,
      "author": "Nifty Lynn Dio",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Comfortable Court Shoes (misnamed as running shoes, which they are not!)",
      "text": "They are not really running shoes, they are court shoes. As a running shoe, I would give them maybe 2 stars. I use them to play tennis, racquetball and pickleball. They wear out fairly quickly on rough playing surfaces, but provide sure footing. I am on my 5th pair, and intend to buy them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill Dryer",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "I love these shoes",
      "text": "I love these shoes. I bought my first pair at Kohl's last year. I paid $55 plus tax, marked down from $85. The price was great on Amazon. As with all running and athletic shoes, arch support is poor. I use Dr. Scholl's Custom Fit Orthotic Inserts to get all day comfort & support.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Straub",
      "helpful_votes": 0,
      "publication_date": 20160527
    },
    {
      "title": "Dont hold up to regular walking.",
      "text": "I bought these shoes in late may and now it's july 12th and these shoes have no tread left in the bottom, almost slick.. I'm an over the road truck driver so I'm not walking around all day...",
      "rating": 1.0,
      "verified": true,
      "author": "Crazycrap",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Poor quality",
      "text": "I wore these shoes for one day and the glue started to seperate in 3 different places. Poorest quality shoe I have ever purchased. Buyer beware. Amazon was great about refunding them. It would have been a very painful experience had I purchased them elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "pen name",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Fairly comfortable",
      "text": "Kind of ugly. Light weight for a leather sneaker. The cushioned tongue sort of pokes the ankle, which took some getting used to. Good cushioning. Not sure about durability; some of the stitching seems to be coming loose. This is very much a road sole, with minimal tread. I wear them for refereeing soccer, so the fact that they are solid black is a plus. I didn't invest a lot in them. That makes me much more indulgent.",
      "rating": 4.0,
      "verified": true,
      "author": "fwill",
      "helpful_votes": 0,
      "publication_date": 20131110
    },
    {
      "title": "Shoes are comfortable and extremely light compared to other work shoes i ...",
      "text": "Shoes are comfortable and extremely light compared to other work shoes i wear. The sole of this shoe is the reason for the 3 star rating. It just ran out way to quick. For the price it is not as bad saying they lasted me about 2 months and i walk about 10 miles on a good day.",
      "rating": 3.0,
      "verified": true,
      "author": "Manuel",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Fila is not what it used to be",
      "text": "The sole at the tip came off after a few hours of light use.. Badly glued, perhaps. Now they look bad. I dont't know what to expect. If bought at a local store I'd be returning them and asking for a replacement.",
      "rating": 2.0,
      "verified": true,
      "author": "Zapper!",
      "helpful_votes": 2,
      "publication_date": 20160528
    },
    {
      "title": "Good value",
      "text": "Light weight shoe and fits well. I wear a size 11 1/5 street shoe and bought a size 12 to accommodate sweat socks. I like the attractive styling which is subtle compared to the garish multi-colored, over-priced shoes that are built to place emphasis on the company logo (\"N\" and \"Swish\").",
      "rating": 4.0,
      "verified": true,
      "author": "Captain H",
      "helpful_votes": 0,
      "publication_date": 20140917
    },
    {
      "title": "Just Ok.",
      "text": "I bought these for my husband because of the price, they were about half as cheap as other shoes and looks like you do get what you pay for. They are cheap and more than likely will not hold up very long. But he does like how light as air they feel, they are not heavy at all. That's all I have to say about these.",
      "rating": 3.0,
      "verified": true,
      "author": "Vinifina",
      "helpful_votes": 0,
      "publication_date": 20140621
    },
    {
      "title": "Great pair of shoes!",
      "text": "Great pair of shoes. I walk about 10 hours a day, and I have to say these are the most comfortable shoes I have very had.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Light weight and durable.",
      "text": "I bought this for my husband 2 years ago and he loves them. We ordered one size up because that is what the pro's recommend in walking shoes. I am getting ready to order him another pair, because he finally wore these out and wants the same shoe.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat P.",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "These shoes are wonderful! My husband has wide feet",
      "text": "These shoes are wonderful! My husband has wide feet, we've searched for a couple weeks for new shoes for him. They fit him so well I ordered another pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Garden",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "Very comfortable everyday shoes.",
      "text": "My order came very quickly with proper packaging and I will order these shoes again. I keep going back to these because of the comfortable fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Starlene Hart",
      "helpful_votes": 0,
      "publication_date": 20170507
    },
    {
      "title": "but they were terrible. I already had a pair of the Capture ...",
      "text": "I recently purchased another pair of Fila shoes through Amazon, however they were a different model. Although they were the same size that the Capture Running shoe is. they were extremely narrow and hurt my feet. Since I have already them several times, I doubt that I can return them, but they were terrible. I already had a pair of the Capture Running shoes so figured that I was safe buying another pair.",
      "rating": 4.0,
      "verified": true,
      "author": "JimBob",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "4E width is really only E or M",
      "text": "I got these in 11.5, 4E (super extra wide). The size (11.5) fits perfectly, but the shoe width is too small to be a 4E. They look and feel like regular wide shoes. Nice craftsmanship though. Too bad they are too narrow.",
      "rating": 2.0,
      "verified": true,
      "author": "traveled",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "Or it may be better to simply look for another brand",
      "text": "If you have small feet, this is the shoe for you. I don't ,and this shoe lets me know right away. The size tends to run smaller than what is written on it. so for example, if you were a size 9, try a 10. Or it may be better to simply look for another brand.",
      "rating": 2.0,
      "verified": true,
      "author": "DougC",
      "helpful_votes": 0,
      "publication_date": 20150822
    },
    {
      "title": "Good Shoe at an Affordable Price",
      "text": "This appears to be a good shoe at an affordable price. I particularly appreciate being able to get the shoe in a wide width. I will reserve the fifth star until I see how durable the shoe is.",
      "rating": 4.0,
      "verified": true,
      "author": "Nanu",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Three Stars",
      "text": "Slightly too large across the front of the foot, probably all right with an added sole pad",
      "rating": 3.0,
      "verified": true,
      "author": "F B",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "I jogged in them and they are quite comfortable. I had to exchange another pair for the ...",
      "text": "Since I ordered the correct width (4E) they fit very well. I jogged in them and they are quite comfortable. I had to exchange another pair for the same width because I noticed I inadvertently order 4M and they hurt my little toes.",
      "rating": 5.0,
      "verified": true,
      "author": "old baldy",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Great shoes-- my second pair",
      "text": "Great shoes-- my second pair. Most comfortable walking/running shoe I've ever owned. I've owned Nike, Reebok, Mizuno, and these are better for my purposes. Don't let the low price fool you -- Great quaility. I walk 3 miles (sometimes 6) per day. I bought my first pair in 2012 and have at least 3500 miles on them and they fell better than ever.",
      "rating": 5.0,
      "verified": true,
      "author": "Edwin D.",
      "helpful_votes": 0,
      "publication_date": 20150922
    },
    {
      "title": "Fila Capture in mens 11 extra wide",
      "text": "Pretty good shoes for money spent. I use custom insoles that made the last set of laces gouge into the front of my ankle. They worked fine once I stopped using the top lace holes. They sure aren't Rockports but they cost half the $. I can't testify to how they last.",
      "rating": 4.0,
      "verified": true,
      "author": "18whlsrolin",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "But the vendor was great, had no problems with the vendor",
      "text": "They are an ok sneaker. The support breaks down fast. They don't seem to want to stay tight no matter how tight I pull the shoelace. But the vendor was great, had no problems with the vendor.",
      "rating": 4.0,
      "verified": true,
      "author": "Todaysrun",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "these shoes fit great and feel pretty comfortable",
      "text": "I work in the Hospital and I am only allowed all black shoes, these shoes fit great and feel pretty comfortable. Only time will tell how well they hold up but I feel I can get a solid 6-8 months out of them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "What a Deal",
      "text": "My husband loves the. The shoes run true to size, and are very good quality. Was apprehensive about ordering on line, but the shos fit perfectly and the sale price was terrific.!",
      "rating": 5.0,
      "verified": true,
      "author": "sherri garner",
      "helpful_votes": 0,
      "publication_date": 20150801
    },
    {
      "title": "Quickly worn soles",
      "text": "The shoes are fine for a short period and then as others have mentioned, wear away way too quickly. I've got less than 50 miles on these shoes and the soles are already worn smooth. Overpriced for the minor amount of usage I got from them.",
      "rating": 2.0,
      "verified": true,
      "author": "Tim",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Very comfortable shoes but show signs of wear after 10 months of use",
      "text": "I love these shoes but I am disappointed in the threading of the front of the shoes. ( the two oval sections in the front sides of the shoes have loosened) I bought these shoes back in October 2013. I bought them again because they fit and are comfortable. which outweighs the wear factor of these shoes.",
      "rating": 3.0,
      "verified": true,
      "author": "Richard M. Zimmerman",
      "helpful_votes": 0,
      "publication_date": 20140818
    },
    {
      "title": "Usually order these, but the last pair I received ...",
      "text": "Usually order these, but the last pair I received the left shoe messed up almost immediately. The bottom sole started coming apart from the shoe.",
      "rating": 2.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "Runs too Small for me.",
      "text": "I have 8.5 4e size feet. This is too small even though it says it is the same size. I'll have to buy the next size or two up or go back to what I was buying before.",
      "rating": 3.0,
      "verified": true,
      "author": "Kirk S. Tirakian",
      "helpful_votes": 0,
      "publication_date": 20171022
    },
    {
      "title": "size is a lie",
      "text": "Ordered a 10 4e. Very disappointed. Pulled them out of the box and compared them to my Nike and Asiscs which are the same size. Over 3/4 inch difference the width of the sole. Double checked the size on the tongue. These shoes are barely a 2e.",
      "rating": 1.0,
      "verified": true,
      "author": "Shannon Vasher",
      "helpful_votes": 0,
      "publication_date": 20160311
    },
    {
      "title": "Three Stars",
      "text": "Started falling apart after a few months of gym use.",
      "rating": 3.0,
      "verified": true,
      "author": "Rowland Seckinger",
      "helpful_votes": 0,
      "publication_date": 20170412
    },
    {
      "title": "Garbage shoes",
      "text": "Soles wore out in less than three weeks of absolutely light walking. I can feel rocks thru the bottom now when I walk. Horrible that I contacted Amazon one day too late to return these. Absolutely dissatisfied with these. At least they fit?",
      "rating": 1.0,
      "verified": true,
      "author": "Inexorable",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Worst pair of shoes I could ever get 2 months ...",
      "text": "Worst pair of shoes I could ever get 2 months after wearing them the sole its coming apart I’m Amazon customer for years but this P O S Have me thinking twice about getting anything anymore from Amazon Do not spend your money on this S...",
      "rating": 1.0,
      "verified": true,
      "author": "ARNALDO",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "good",
      "text": "These shoes are perfectly serviceable but nothing remarkable but just right for the price. They are comfortable",
      "rating": 4.0,
      "verified": true,
      "author": "cherie mazzuca",
      "helpful_votes": 0,
      "publication_date": 20180214
    },
    {
      "title": "I gave them a go",
      "text": "Even at $30, shoes should last more than 1 month. Tops look brand new but the bottom sole is gone, just foam is left. I guess these are for running on pillows",
      "rating": 1.0,
      "verified": true,
      "author": "lbbrightman",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Great Sneaker",
      "text": "Very comfortable, lots of cushion, great price. Can't go wrong IMO. Sizes are true.... Still relatively new so I don't know how well they will stand the test of time but at this price you can afford to buy more. I would by this item again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl T.",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Fit great was wide an I'm happy bc I have finally ...",
      "text": "Fit great was wide an I'm happy bc I have finally found a different band of shoes I can wear.ive had the same kind for 10years bc nothing was wide enough",
      "rating": 5.0,
      "verified": true,
      "author": "mads",
      "helpful_votes": 0,
      "publication_date": 20160522
    },
    {
      "title": "Great shoe",
      "text": "Great shoe. For me even \"all weather\". Use it for golf, tennis, hiking and walking.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Chambers",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Other than that its a great fit and comfortable shoe",
      "text": "I had to re-glue the short piece of toe leather at the very front/center of the shoe. Other than that its a great fit and comfortable shoe .",
      "rating": 4.0,
      "verified": true,
      "author": "Bob in CO",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "The look and feel of the shoe are great but the rubber seperated from the toe after just ...",
      "text": "The look and feel of the shoe are great but the rubber seperated from the toe after just wearing them 2 times😒",
      "rating": 1.0,
      "verified": true,
      "author": "Noreen Long",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "Please do not buy!!!! Not a deal!!!!",
      "text": "These shoes are of the lowest quality. They are very similar in quality to the Starter shoes sold by Walmart. These are the worst pair of shoes I have ever bought. Do not buy these shoes. If I could give negative star I would.",
      "rating": 1.0,
      "verified": true,
      "author": "JDUBYA",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "These shoes did not feel like previous ones I had ordered - they felt cheap ...",
      "text": "These shoes did not feel like previous ones I had ordered - they felt cheap and flimsy with hard soles. i returned them",
      "rating": 2.0,
      "verified": true,
      "author": "Spaceman61",
      "helpful_votes": 0,
      "publication_date": 20160314
    },
    {
      "title": "Five Stars",
      "text": "My nephew likes it and wears it school. Simple and athletic.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Phillip",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Look for another brand",
      "text": "Don't buy these for running. Husband wore around the house shoe and within 6 months the toe seams on both shoes came apart. Soles are thin and within 3-4 month could not even wear outside because he could feel every rock through them. Last Fila we will buy.",
      "rating": 1.0,
      "verified": true,
      "author": "RobertJ",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "Good shoe",
      "text": "These are super cushy, nice fit. Been playing outdoor basketball in them and they seem durable. I do not understand the negative reviews, at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Freakbag",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "They have a very poop like color.",
      "text": "Fit as expected, but the brown color isn't the most attractive. I honestly thought they where black from the picture. Sadly, my dog ate them after I only wore them once.. But she also eats her own poop, so I think she just got confused.",
      "rating": 3.0,
      "verified": true,
      "author": "Coolaid",
      "helpful_votes": 0,
      "publication_date": 20150225
    },
    {
      "title": "Comfortable shoe while it lasts.",
      "text": "Nice shoe, but not too durable. I apparently walk alot so after a few months, the sole started separating and they were done. They were comfortable the entire time, but I could feel the foam compacting towards the end of their life.",
      "rating": 3.0,
      "verified": true,
      "author": "KC",
      "helpful_votes": 0,
      "publication_date": 20150922
    }
  ],
  "product_meta": {
    "title": "Fila Men's Capture Running Shoe",
    "description": "Fila began in 1911, in the small alpine town of Biella, Italy, a place renowned for manufacturing the world's finest textiles, and weaving fabrics with impeccable quality, true innovation and extraordinary beauty. Born of the city and its traditions, Fila is inexorably derived from Biella's dedication to artistry, luxury and elegance. This is our birthright, it's in our soul, and it defines our future. We continue to enrich the athletic experience by improving comfort and performance with Italian design, quality craftsmanship and refined materials. There is no feeling quite as luxurious as that of playing in Fila, and that is the reason for our existence. We create what is desired, not what is necessary. Not just enough, but more than you need. This is Fila.",
    "rating": 3.9,
    "feature_bullets": [
      "75% Leather, 25% Synthetic",
      "Imported",
      "Rubber sole",
      "Leather upper provides lateral support",
      "Ethylene vinyl acetate midsole material for maximum cushioning",
      "Rubber outsole provides traction and durability",
      "Wide width for better fit"
    ],
    "categories": [
      "Men",
      "Athletic",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Running",
      "Road Running"
    ],
    "price": 28.95,
    "specifications": {}
  }
}