{
  "website_summaries": [
    {
      "verdict": "A great starter set in a beautiful color palette.",
      "pros": [
        "30-piece set is a nice size to complete some projects, but as big of an investment as others",
        "It includes triangles and squares for creating various structures",
        "The colors of this set (pinks, teals, purple) are unique to this kind of toy"
      ],
      "cons": [
        "The set is limiting since it only has 2 shapes, but it is a nice introduction into Magformers"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Brain training.",
      "text": "Sturdy enough to be used around my 1 year old without feeling dangerous. 2 year old stacks them. 3.5 year olds line them up, though after a few weeks one of the 3.5 year olds is making simple 3D designs completely unassisted. He's the one that gets frustrated at puzzles, so it's been reassuring to watch him carefully construct things. Definitely developmental progress. For something with a lot of pieces (we have 3 sets of 30 for our crew), it's easy to clean up since they stick to each other. My husband and I like to mess with these a bit too!",
      "rating": 5.0,
      "verified": true,
      "author": "ChaCha",
      "helpful_votes": 31,
      "publication_date": 20170117
    },
    {
      "title": "Very Nice Compliment to the 62 pc. Pastel Magformers",
      "text": "Purchased these to compliment the 62 pc. pastel Magformer set bought at the same time. My 5 yr. old daughter loves these to go with her others. She has had a jewel tone colored set for at least 2 yrs. now, that all of her little friends love to play with, and they must be a great, strong quality toy because she breaks everything, but not these. I do make her keep them picked up after play, so they don't get broken. I've been concerned about the small magnets inside of them, but none have ever broke. They are a well made toy that the kids always love to play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Marti",
      "helpful_votes": 14,
      "publication_date": 20160724
    },
    {
      "title": "Great for all ages !",
      "text": "I bought 2 of these. One for my 9 year old and one for my 6 year old. They both love them. My 2 year old also loves them and steals them often. They are easy to use and fun to create with. I love toys where the kids can manipulate the pieces an use their imaginations. They are pricy but i got mine during christmas on sale. I will be buying more when i find them on sale again. They are a hit with all three of my kids. This set does make it difficult to build big things, i do wish i would have gotten a bigger set.",
      "rating": 5.0,
      "verified": true,
      "author": "MAR",
      "helpful_votes": 7,
      "publication_date": 20160321
    },
    {
      "title": "Great blocks, work very well and are durable. Stick em to your frig.",
      "text": "These are great toys and work really well, but they don't give you a lot in the box for what you pay. That said, I haven't bought many more to go with the set due to the price. You really need to catch these on sale. But it made a great holiday gift and these blocks are played with often. The little kids put them on the frig and leave them there (since they are magnetic) and take them off when they want to play. It works great to keep them on the frig.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaylan",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Hours of quiet time!",
      "text": "Want to keep your kids quiet for long periods of time? This is your answer. This set is a great way to start their Magformers addiction. My kids love to use their imaginations and build to their hearts content. My daughter has the pastel set, and my son has the primary colors. But they really don't really care what color they are playing with. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Reviewerbabe",
      "helpful_votes": 0,
      "publication_date": 20181101
    },
    {
      "title": "Strong magnets versatile structures",
      "text": "Nice starter set for 3-5 y/os. It is a little too simple for elder children, but it is always possible to buy other sets in addition. My 6 y/o was happy to get it and I plan to buy some more from the same series. Strong magnets hold structures firmly and the color is nice for a girl. I’m glad I’ve bought this.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20190102
    },
    {
      "title": "Good but probably wouldn’t get them again",
      "text": "I bought two packs to have enough to make something good with, they look cool and have nice colors but my complaint is the strength of the magnets kids really have to hold the pieces together while building. My kids use another type at our local library and they stay together without holding and seem much stronger.",
      "rating": 2.0,
      "verified": true,
      "author": "TaglioSalon",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "My kids love Magformers. They are more expensive that some building ...",
      "text": "My kids love Magformers. They are more expensive that some building blocks but they are well made and fun for all ages. The kids have been playing with these blocks for over three years and they are still fun to them. We bought this set so we would have extra pieces and could build larger items with the blocks. They are small and easy to take with you on the go. This is a toy that will entertain many different ages. I like that it encourages kids to be creative. The colors in this set are nice. My daughter loves that these are girly.",
      "rating": 5.0,
      "verified": true,
      "author": "Nattymom",
      "helpful_votes": 0,
      "publication_date": 20160223
    },
    {
      "title": "Great early engineering/design toy",
      "text": "These are great magnetic creation devices! I like the fact that there is the element of design and engineering, but in the colors of pink and purple that my daughter loves which keeps her interested longer. My kiddos are 3.5 and really enjoy creating things with these. They can't make the more advanced shapes like the ball all on their own, but they will help me make it and love to watch the design. These were definitely a good buy for a starter kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Purse Lover",
      "helpful_votes": 2,
      "publication_date": 20150709
    },
    {
      "title": "Good blocks, bad price",
      "text": "My daughter likes these and she does play with them, so it is a toy that doesn't just get shoved in the back of the closet. She actually keeps these blocks on her bookshelf headboard on her bed. I marked it 3 stars because you just don't get much for the price. I would love for her to have more blocks, but my husband and I just won't spend $100 to get a decent amount of blocks for her. I would give 5 stars if the price was reasonable.",
      "rating": 3.0,
      "verified": true,
      "author": "leah brunt",
      "helpful_votes": 0,
      "publication_date": 20160421
    },
    {
      "title": "Great investment!",
      "text": "I had actually seen a video for these and had my children watch it. They thought it was cool. I bought one for my 6 year old son. But then I couldn't keep my 5 year old and 3 year old twins away from them. Including my eleven year old son and well my husband. So, I purchased 3 more. They love, love them. They can play together or alone for quite awhile and they allow for great creativity and imaginative play!",
      "rating": 5.0,
      "verified": true,
      "author": "Quiverblessed",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Entertaining for HOURS!!!",
      "text": "I bought these for my 8 year old daughter because she had played with them at a friend's house. I bought 2 boxes when on sale to make sure she had enough - 2 boxes separate were less expensive than 1 box with same amount! She will build things for hours!!! Great toy to get things done around the house or have a bit of mommy time. Worth every penny!!!",
      "rating": 5.0,
      "verified": true,
      "author": "T W.",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "We love Magformers! These were purchased multiple times for my ...",
      "text": "We love Magformers! These were purchased multiple times for my children and family members. Children range from the ages of three to eight. I love that they are able to build and create different structures with the different magnetic shapes. The magnets used for these toys are strong, and my children can carry around their designs without their structure falling apart. I also love that there are no small pieces! No worries about small pieces getting lost or ending up in in my three year old daughters mouth! Excellent product!",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Wesolowski ",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Awesome",
      "text": "Purchased for my little because she loves playing with them in her class. These are great for building tactile/motor/thinking skills. Thirty pieces is just the right amount for beginning, although I do see purchasing another set down the road to add to the collection.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCalMel",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Great for creative play, easy enough for preschool age, but fun enough for everyone",
      "text": "My 6 and 8 year olds are loving these. I bought for my 6 year old because legos are still too hard for her, even though her siblings are Lego crazed. These are a fabulous way to help kids get creative and build stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Ford",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "bought 2 different sets",
      "text": "Grandson was so happy to get these 2 sets - however, I saw a story where a young boy broke open one of these magnaforms and swallowed the tiny magnets. Somewhat concerned about the toy's safety",
      "rating": 3.0,
      "verified": true,
      "author": "LilacLady",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Fun for various age groups.",
      "text": "My mother in law bought these for my son several years ago (i think he was only 2). He isn't much of a builder but he still enjoyed these. He really like it when we would build stuff and then he could \"destroy\" it. Now that he is almost 5 he still enjoys building stuff and destroying it. I bought this set for a friend's daughter who loves to build. From what I have seen she loves these and has gotten very creative with what she builds. Highly recommend these as they provide tons of fun for kids and adults.",
      "rating": 5.0,
      "verified": true,
      "author": "TCarney",
      "helpful_votes": 0,
      "publication_date": 20140108
    },
    {
      "title": "Great educational and fun toy",
      "text": "Bought these as a starter set for our 3 year old granddaughter, and she loves building with them. The magnetic properties are fascinating to her, and she’s having fun with them. Need to add to our set now.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Campbell",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Stronger than other magnet tiles",
      "text": "More expensive than other brands but MUCH STRONGER holding magnetic. Also more durable ( if you step on them they will not break)",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Love them!",
      "text": "Great product and my 2 year old granddaughter loves them! But watch their prices!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Creative",
      "text": "We have 4 granddaughters and they all enjoy the Magformers - I've even given them as gifts to other children. Also, they're large enough so that we don't have to worry about our 2-year old putting them in her mouth!",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy Scatterday",
      "helpful_votes": 10,
      "publication_date": 20140131
    },
    {
      "title": "Won over my 4 yr old daughter who only loves dolls",
      "text": "I bought these for my 4 year old daughter because I'm sick of buying her baby dolls and play makeup, the only two things she ever asks for. I worried she wouldn't play with them, but she plays with them more than any of her other toys. She creates places for her dolls and animals to live, makes stars on the fridge, makes houses and the list could go on and on. What a great toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Jme",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "LOVE THESE!",
      "text": "My family LOVES these Magformers! The magnets are strong enough to build decent sized structures. The model booklet is a great starting place when just beginning to work with these. My daughter loves the pinks and purples! They're great for young kids as well as adults! We can't wait to someday try the moving and sound magformers. I highly recommend this product for ages 2.5+!",
      "rating": 5.0,
      "verified": true,
      "author": "American family",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "Fair review",
      "text": "Sorry to say but you get what you pay for. Got this item on as a lighting deal, based on reviews I bought it, however, I'm disappointed both on quality of the pieces and the way they work. Would not buy it again.",
      "rating": 2.0,
      "verified": true,
      "author": "BabeRuthDeals",
      "helpful_votes": 0,
      "publication_date": 20180901
    },
    {
      "title": "my granddaughter loves this",
      "text": "Wish I could give you a more extensive review as I usually do, but since I live in WNC and my GD is in Oregon, all i have to go by is Facetime reaction and photos -- and my granddaughter, and her parents, are extremely happy with this toy. I'm a stellar granny now - yeehaw! Will put this same review on the other Magformers I ordered for her. Your child or grandchild,and their parents, will love this. (My son played with it first *laugh* so there you go )",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Magendie",
      "helpful_votes": 0,
      "publication_date": 20140128
    },
    {
      "title": "Expensive but enjoyable",
      "text": "These are expensive but they do their job! My kid loves these!",
      "rating": 4.0,
      "verified": true,
      "author": "Boy mom",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Couldn't recommend more.",
      "text": "Extraordinary purchase. Although I felt that this was a little much to spend on a toy, I have definitely gotten my money's worth. My almost 3 year old and 5 year old spend long (sometimes an hour or more) stretches​ of quiet creative play time. We take them everywhere in the diaper bag- even out to restaurants because they play so well with them. We have also bought two sets to give as gifts. Couldn't recommend more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sondra",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "My grandchildren who are ages 3 through 7 love these. What a great fun and educational toy",
      "text": "My grandchildren who are ages 3 through 7 love these. What a great fun and educational toy.... On the down side: When you look at a single piece and know that it costs more than a dollar ....... I feel the items are overpriced by the company but the are unique and better than building blocks.",
      "rating": 5.0,
      "verified": true,
      "author": "Honey",
      "helpful_votes": 3,
      "publication_date": 20150104
    },
    {
      "title": "Hit with kids",
      "text": "One of my best purchases on Amazon yet. My kids loved this set so much I had to buy more because they kept fighting over them. Great quality. Magnet strength is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "Really great concept!!",
      "text": "Really great item. I tend play with it more than my daughter. The one thing that you need to be \"aware of\" is that some pieces and certain orientation do repel each other so you may need to try and find the right orientation between two pieces. Also they wont' fit like Lego pieces but that is expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Roland Eld",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "We use these for church their easy to stack and have really strong magnets my kids ...",
      "text": "We use these for church their easy to stack and have really strong magnets my kids love them only reason for 4 stars is the price but other then that so worth the money my kids have so much fun with them",
      "rating": 4.0,
      "verified": true,
      "author": "shawna",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Excellent game",
      "text": "Fantastic game. soo creative. I does upset me however that girl colors are much more expensive than boy ones. We ordered one for my son and my daughter, different colors and the girl one was at least 10 dollars more expensive. Don't understand that. THe kids have a blast with it however, we have fun creating things together. very creative.",
      "rating": 4.0,
      "verified": true,
      "author": "EyeDocMom",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Might have to buy some for myself...",
      "text": "Bought this for my 3 year old niece. She loves it, except I think I played with it more than she did. I will be ordering more pieces for her in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Sam Garofolo",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Unique, unusual gift for a child who has everything.  Great fun for adults to play too!",
      "text": "I think Grandma likes to play with these as much as my 3-year old Grandson. Watch the videos to get tips on how to make different forms. I wish these came with a case of some sort. The one disadvantage is that when you lose even 1 of the pieces, you can't make some of the shapes. I Will buy more of these as he grows.",
      "rating": 5.0,
      "verified": true,
      "author": "Linn",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "Amazing Toy for Growing Young Minds",
      "text": "My 4 year old daughter absolutely loves these. So much so that her grandfather just bought her another set of 62 to expand on it. Amazing toy for reinforcing STEM skills that are so important these days. She barely even needs the manual now and just makes whatever she thinks about. They're pricey, but well made and worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell H*",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "My children absolutely love these! We wanted the Magna tiles but couldn't ...",
      "text": "My children absolutely love these! We wanted the Magna tiles but couldn't afford the big set, so got these instead. All my kids love playing and creating with them every day since opening. Great quality and really encourage them to engage in creating something.",
      "rating": 5.0,
      "verified": true,
      "author": "Morgan Adams",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Awesome for all ages",
      "text": "Got these for my 3 year old who doesn't play with toys. He's very busy and ignores most of his toys, but he'll play with these. In fact, my baby loves these and I love to play with them too! We build really crazy things and the kids love to smash then. Great toys for all ages in my house!",
      "rating": 5.0,
      "verified": true,
      "author": "KJ",
      "helpful_votes": 0,
      "publication_date": 20160122
    },
    {
      "title": "Kids love these. It is a great way for kids ...",
      "text": "Kids love these. It is a great way for kids to be able to build and play starting as young as a year and a half. A little pricey but add them to your Amazon wish list if you have kids birthdays approaching. The more of these you have the better they are to use. They come in all different shapes and sizes.",
      "rating": 5.0,
      "verified": true,
      "author": "Marie Labosky",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Great toy!",
      "text": "Bought for my 3 year old daughter for Christmas. She loves them! It's nice because they are not a huge set so easy to store, but there are enough pieces to make some fun creations. Looking to buy some more to add to it when they are on sale.",
      "rating": 5.0,
      "verified": true,
      "author": "Chee",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Keeps the little ones entertained",
      "text": "My grandson has a set he loves them! I bought this one for a gift they have had a lot of fun with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Betty Pacifico",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "My 6 year old grandson seemed to have way more fun with them than she did",
      "text": "I bought these for my 2 year old granddaughter for Christmas. My 6 year old grandson seemed to have way more fun with them than she did. We all actually enjoyed them. Great for keeping the kids busy though and using their imagination. I would love to add to the collection, but a little too pricy for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jean",
      "helpful_votes": 0,
      "publication_date": 20150205
    },
    {
      "title": "Excellent for hands on imaginative building! Extremely satisfied.",
      "text": "My 3.5 yr old daughter is obsessed with these! I will definitely order more.",
      "rating": 5.0,
      "verified": true,
      "author": "Sierra S.",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Winner!",
      "text": "The kids absolutely love these. I continue to add on to them. This was our second set. And I don't see them getting tired of them anytime soon. Overall, it is money well spent. Which is a concern for any parent. They are pricey compared to regular blocks and legos etc, but they just rock! Go ahead, you wont be sorry! inspire your future engineer with these wonderful things. And yes, you will like them too! We",
      "rating": 5.0,
      "verified": true,
      "author": "Hill Country Guy",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "The 3-4 year olds girls love them! The boys play with them as well",
      "text": "I use these on my classroom. The 3-4 year olds girls love them! The boys play with them as well! I printed some idea cards from Pinterest. Nice additive.",
      "rating": 5.0,
      "verified": true,
      "author": "Ku'ulei",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Very unique",
      "text": "Grand children love this. We bought another set so they could build more things and shapes. Solid construction and good imagination possibilities make this something they will play with for a long time and not get tired of.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20161204
    },
    {
      "title": "Kids love them",
      "text": "My kids both have a set and I need to buy more - keeps them entertained every now and then for quite a while. One had a great book full of shapes while the other kit only had a small flyer.",
      "rating": 5.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "The magnets are strong and she was able to make all kinds of things plus the girl colors are awesome!!",
      "text": "This was a present for my youngest. The magnets are strong and she was able to make all kinds of things plus the girl colors are awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "HaRlEiGh",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "The one in china is SO much better than this one",
      "text": "The reason I bought this was because I saw it on the tv in china and there was a show about this. The one in china is SO much better than this one. First of all when u pull of, it destroys the shape. The one in china works perfectly well. Second of all the shapes don't stand well. Last of all it doesn't even work that well. Sure the magnets stick but when u want to move a shape it just........doesn't work.",
      "rating": 2.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20160127
    },
    {
      "title": "Fun. Cool. Educational",
      "text": "Educational. Fun. Adults steal them away from the kids. Cool toy",
      "rating": 5.0,
      "verified": true,
      "author": "tim c",
      "helpful_votes": 0,
      "publication_date": 20190106
    },
    {
      "title": "Good product",
      "text": "My daughter (and husband) loved these. I will be purchasing a bigger set for Christmas.",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda G",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Loved It!!",
      "text": "I bought this for my niece for christmas and she loved it. Both her and my nephew enjoyed putting the pieces together and trying to build different structures. The only problem I had was that I wish it came with a more detailed instruction manual of different things to build. Great toy, would definitely recommend to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "bamagirl",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Best toy ever!!",
      "text": "My 11 yr. old daughter and I have such fun playing with these. I would suggest buying this larger pack because we can build more extravagant things than my nephew and I could with the smaller pack. It's definitely worth the money for the larger set.",
      "rating": 5.0,
      "verified": true,
      "author": "LilysmamaTop Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20160313
    },
    {
      "title": "Fun Gift!",
      "text": "Got for 9 year old daugther for Christmas. She loved them then and still plays with them at least once a week almost every week since. I love gifts that don't make a specific model so she can use her imagination and not just do the model.",
      "rating": 5.0,
      "verified": true,
      "author": "FredKris",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "My seven year old really enjoys this toy. Seems ...",
      "text": "My seven year old really enjoys this toy. Seems to work well with the geometry concepts that are studied in second grade math. Magnets are powerful enough to work. I would consider adding to this set, but there are enough included pieces to get started.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Lynch",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Seemed like a sensible learning and fun way to teach a ...",
      "text": "This was purchased as gifts for grandchildren. Seemed like a sensible learning and fun way to teach a variety of things like shapes, colors, magnetism, and creative designs. Not sure if I got the best deal on pricing but it is a quality set.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney Johnson",
      "helpful_votes": 0,
      "publication_date": 20151223
    },
    {
      "title": "Great For All Ages! Easy To Use!",
      "text": "My 8 year old, 6 year old, 4 year old and 20 month old all love these! They can be very creative in their building and because they are magnetic they are easy for the little ones to use.",
      "rating": 5.0,
      "verified": true,
      "author": "One Clever Mommy",
      "helpful_votes": 0,
      "publication_date": 20170105
    },
    {
      "title": "Nice",
      "text": "Fun toy for a wide range of get of ages",
      "rating": 5.0,
      "verified": true,
      "author": "V",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Value",
      "text": "My grandkids love these. I'll be buying them again, and again..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Great Quality",
      "text": "My 3 year old loves playing with these. I loved the colors of this set.",
      "rating": 5.0,
      "verified": true,
      "author": "AshleyMarie",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Worth it!",
      "text": "I absolutely love theses magnets! My daughter who has sensory issues, this worked great at the doctors office.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Bear",
      "helpful_votes": 0,
      "publication_date": 20180120
    },
    {
      "title": "Very entertaining",
      "text": "Offers lots of creative fun for my two year old and three and a half year old granddaughters. Strong magnets and beautiful colours. I've ordered another set for larger building. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Nora Azran",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "4 year old loves these",
      "text": "These are so expensive in local stores and you can't find the \"girl\" colors like these. My 4 year old daughter loves these and a similar set locally would sell for $10 or more than these. We will probably order another set as this one is fairly small and limits what can be built.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayman",
      "helpful_votes": 0,
      "publication_date": 20140403
    },
    {
      "title": "So much fun",
      "text": "Really fun to play with. My 2 1/2 year old granddaughter likes playing with these.",
      "rating": 5.0,
      "verified": true,
      "author": "BJ",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Fun, creative, and colorful.",
      "text": "I bought these for my 4 year old niece and she loves them! She will play with them for hours. My husband and I even loved to play with them building the more complex shapes when our niece was sleeping. I wish I had them when I was a kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachelle Niemann",
      "helpful_votes": 0,
      "publication_date": 20150218
    },
    {
      "title": "My kids love these. It drives their imagination because its not ...",
      "text": "My kids love these. It drives their imagination because its not like legos where you can easily see how pieces connect. I do recommend searching online on what can be built with the set because the manual is limited on the different builds.",
      "rating": 4.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "Super fun, kind of small",
      "text": "My kids love these. I ended up buying two. The colors are great but they are a little on the small side.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "but you need to purchase more pieces to make anything great and we find this expensive though it was cheapest ...",
      "text": "Our daughter loves it, but you need to purchase more pieces to make anything great and we find this expensive though it was cheapest through Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Super fast shipping!",
      "text": "I ordered these on Dec 20th as a gift. Since I was so late ordering them, I figured I would wrap up a picture of them but was absolutely shocked when they were delivered on Dec 22! I was so happy!!!! They are a great toy too.",
      "rating": 5.0,
      "verified": true,
      "author": "Joan",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Great toy to help kids use their imagination",
      "text": "Another great set to add to our already growing collection. My 3.5 year old LOVES these",
      "rating": 5.0,
      "verified": true,
      "author": "awarnke",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "slightly disappointed with pastel set",
      "text": "Slightly disappointed with the pastel magformers. They are constructed slightly differently and the magnets don't seem as strong as the red/purple ones I purchased last year. I'm not sure if I got a knock-off or not, but I'm writing this review on the product I purchased for $40.",
      "rating": 2.0,
      "verified": true,
      "author": "KBB&ACB",
      "helpful_votes": 0,
      "publication_date": 20140804
    },
    {
      "title": "... hours playing with these and has been building some pretty complex geometric shapes",
      "text": "My 4 year old has spent hours playing with these and has been building some pretty complex geometric shapes. Additionally, if you have an infant in the house these are better than legos because no choking hazard.",
      "rating": 5.0,
      "verified": true,
      "author": "SurfersLaw",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Good for the brain",
      "text": "Love watching my grandkids create with these.... also the adults!",
      "rating": 5.0,
      "verified": true,
      "author": "Grace",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "My 2.5 year old loves these",
      "text": "Purchased for my 2.5 year old for Christmas and this by far is what she plays with most. I wish I would have bought more for the price I got them for.",
      "rating": 5.0,
      "verified": true,
      "author": "kristina begley",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "One of the best toys out there",
      "text": "One of the best toys out there. My kids love these Magformers. We have them in all colors and shapes. They love to create unique structures and see who can create a unique animal. We love that they wipe clean and all ages can use them.",
      "rating": 5.0,
      "verified": true,
      "author": "Sirrah",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Nice set, my daughter likes it",
      "text": "Nice set, my daughter likes it. Wish we bought the one with more pieces now.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellie",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Magnetic Toy",
      "text": "My grandkids love to build things with these. It is even more fun if you buy several sets so they have more to play with. -Cindy",
      "rating": 5.0,
      "verified": true,
      "author": "tomg",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Love Magformers!",
      "text": "This is such a great toy for creative kids. They really spark imagination and keep kids occupied for a long time. Both my three and five year olds find them easy to manipulate and very fun!",
      "rating": 5.0,
      "verified": true,
      "author": "MEcot",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "I highly recommend them!",
      "text": "I bought this for my 20 month daughter and she absolutely loves playing with them! Especially since she can build them off of our fridge and other metal surfaces. They magnets are relatively strong, but not too strong for her to pull apart. I highly recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Margie",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "High quality and fun!",
      "text": "Durable, pretty, fun, and versatile! My three year old has as much fun with these as my 7 year old does. Amazing product for all kids.",
      "rating": 5.0,
      "verified": true,
      "author": "Valerie Lynn Moreno",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "My girls love this. They share it and actually play nicely",
      "text": "My girls love this. They share it and actually play nicely. The price seemed a little steep, but the product quality is vastly higher than the set we bought in the store (in a different brand) so I didn't mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Love these",
      "text": "A big hit in my house. The kids always go to these when they get bored with other toys. It really gets their imaginations going.",
      "rating": 5.0,
      "verified": true,
      "author": "jen",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "My daughters both love it. They're 6 and 7 years old",
      "text": "Cute. My daughters both love it. They're 6 and 7 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "dak",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "smaller than expected. I bought 2 sets and needed ...",
      "text": "smaller than expected. I bought 2 sets and needed both to build a smallish house with few pieces left for anything else.",
      "rating": 3.0,
      "verified": true,
      "author": "Patricia Lyle",
      "helpful_votes": 0,
      "publication_date": 20160316
    },
    {
      "title": "Great quality and Educational",
      "text": "I had never heard of these before my grandkids all wanted them for Christmas. Watching them play with them is wonderful since it a very educational set. a great way to learn 3D geometry",
      "rating": 5.0,
      "verified": true,
      "author": "S. A. Nickell",
      "helpful_votes": 0,
      "publication_date": 20160123
    },
    {
      "title": "Both my two and four year old love this set",
      "text": "Both my two and four year old love this set. I should have gotten a bigger one since they're both playing with them all the time. Will definitely be adding to the collection.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Saunders",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Excellent quality.",
      "text": "Santa brought these for my 3-year-olds and the whole family up to the adults play with them. Definitely a winner! Excellent quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Angie Rhodes",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "My daughter is crazy about it",
      "text": "My daughter absolutely loves this. I am thinking about buying her some different shapes as these come only with squares and triangles. I think it's a little expensive, but she has hours of fun with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa and Dan",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "... it - doesn't have to be for girls only nice bright colors",
      "text": "My three year old grandson loves it - doesn't have to be for girls only nice bright colors. He has another 30 piece set they works well together",
      "rating": 5.0,
      "verified": true,
      "author": "Marsha A Fogarty",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Great toy for creative kids!",
      "text": "My daughter LOVES these! This can get addicting. This was our first purchase of these. The number of pieces is good for starting out, but you will want more!",
      "rating": 5.0,
      "verified": true,
      "author": "SweetLena",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Five Stars",
      "text": "My Kid loves it she did play almost a week only on this after the package arrived",
      "rating": 5.0,
      "verified": true,
      "author": "Udayakumar",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Five Stars",
      "text": "These are so fun to use and are great for any age",
      "rating": 5.0,
      "verified": true,
      "author": "Ames",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "but my girls love them! My 6",
      "text": "Wish these weren't so expensive, but my girls love them! My 6, 5, and 2 year old girls love them! Their dad and I do, too! You really can't do much with the smaller sets, but this 30 piece set was great.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Lancaster",
      "helpful_votes": 0,
      "publication_date": 20140801
    },
    {
      "title": "Five Stars",
      "text": "Best Kid Toy!!! Grandbabies played for hour and hours every day!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Devon",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great quality! Love the book with design ideas that ...",
      "text": "Great quality! Love the book with design ideas that is included.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180227
    },
    {
      "title": "I would pass on this.",
      "text": "This was fun for all of 30 min and not worth the price even if it's on sale. I think you need a larger set to really do anything with it. It's frustrating for the kids to see pictures of shapes on the box that you'll never be able to make with the pieces you get. I would recommend spending your money on another toy.",
      "rating": 3.0,
      "verified": true,
      "author": "Elle W",
      "helpful_votes": 4,
      "publication_date": 20171226
    },
    {
      "title": "Five Stars",
      "text": "Got these for my 3 boys. They are expensive as usual, but well made and played with frequently.",
      "rating": 5.0,
      "verified": true,
      "author": "Dude22",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "wonderful toys",
      "text": "These are great quality toys. They are pricier than other toys I have bought, but my class absolutely loves them. So many building toys are in boy colors, so I am so glad to add some girl colors to my set. I love the children to be able to build and manipulate 3 D shapes.",
      "rating": 5.0,
      "verified": true,
      "author": "P. Romeril",
      "helpful_votes": 0,
      "publication_date": 20140121
    },
    {
      "title": "We all love playing with them",
      "text": "I bought the regular colors first, but my daughter saw these ones and begged for them. We all love playing with them, from the 3 year old to the adults.",
      "rating": 5.0,
      "verified": true,
      "author": "SLC",
      "helpful_votes": 0,
      "publication_date": 20140915
    },
    {
      "title": "Great STEM gift for 5 year old grand daughter",
      "text": "I bought these for my 5 year old grand daughter. She really enjoys building with them and I like it that it takes her away from playing on a computer. Very good value and a fun and educational set",
      "rating": 5.0,
      "verified": true,
      "author": "Randy",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "My daughter loves them",
      "text": "Great toy for kids, my daughter and I sit and play with them all the time. I’m ready to get more so we can build elaborate structures. Good quality and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan fisher",
      "helpful_votes": 0,
      "publication_date": 20190203
    }
  ],
  "product_meta": {
    "title": "Magformers Inspire Set (30-pieces) Magnetic Building Blocks, Educational Magnetic Tiles Kit , Magnetic Construction STEM Toy Set - 63097",
    "description": "The Inspire 30 Piece Set contains 30 powerful magnets; 18 squares and 12 triangles. It's simple to use and easy to build with from the moment the pieces are out of the box, making it a perfect set for beginners. \n\nMagformers are easy to use and never frustrating. The patented intelligently designed Magformers magnets are housed in colorful, high quality ABS plastic. High quality Neodymium magnets that instantly connect are sure to spark curiosity and play time is creative, stimulating, and constructive. \n\nBuilding with Magformers engages mathematical and scientific thought, deductive reasoning, and requires use of spatial awareness. Manipulating the powerful, colorful Magformers magnets are perfect for STEM education and cognitive development Magformers award winning 30 piece Sets are perfect for beginning users age 3+.\n\nBe inspired with Magformers, in colors that kids of all ages adore. Build a ball, build a house, build a building, build a star... you can even build a microphone! Cubes, and pyramids are another basic build favorite. Imagination and building is always a fun solo activity, but when two or more minds get together the building creativity abounds! Get ready for idea sparks to fly! Instant connect powerful magnets make playtime instantly FUN! \n\nStorage takes care of itself, because with Magformers, every piece connects to another and stacks neatly so you won't find a messy pile after play! \n\nCompact storage, easy set up, and quick clean up, make Magformers a perfect activity for anytime or place. Pack them in a small tote and wherever you go you're bringing instant FUN. Children 3+ can easily build with Magformers.\n\n\n\nBRAND STORY\nBy",
    "rating": 4.7,
    "feature_bullets": [
      "plastic",
      "Imported",
      "Great beginning set with shapes in teals, blues, pinks and purples.",
      "Contains 30 Pieces: 18 Squares; 12 Triangles / Colors: Pink, Purple, Light Blue, and Teal.",
      "Neodymium Rare-Earth Magnets for guaranteed connectivity.",
      "ABS plastic magnets conform to CE, ASTM, and EN80",
      "Compatible with all Magformers shapes and accessories.",
      "ABS plastic magnets conform to CE, ASTM and EN71",
      "Pink, Purple, Light Blue, and Teal colored shapes",
      "Contains 30 Pieces: 18 Squares; 12 Triangles",
      "This basic set is designed especially with her in mind."
    ],
    "specifications": {
      "Product Dimensions": "11.5 x 2 x 9.5 inches",
      "Item Weight": "15.8 ounces",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B00CE04H0S",
      "Item model number": "63097",
      "Manufacturer recommended age": "3 years and up",
      "Batteries": "1 AA batteries required.",
      "Best Sellers Rank": "#32,687 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars560 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "36 months - 70 years",
      "Department": "Girls",
      "Manufacturer": "Magformers"
    },
    "categories": [
      "Toys & Games",
      "Building Toys"
    ],
    "price": 39.99
  }
}