{
  "website_summaries": [
    {
      "verdict": "Undoubtedly the best soldering station for the serious solderer.",
      "pros": [
        "Wide temperature range and ESD protection",
        "Highly rated support"
      ],
      "cons": [
        "One or two owners found programming difficult",
        "Otherwise, it’s flawless"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "What was I waiting for? (Buy it!)",
      "text": "Had I known just how good this iron was going to be I wouldn’t have wasted my time with so many cheaper substitutes. Best advice I can give to my ‘past self’ in the future? “Don’t waste you money on the $25–$45 units. Save a little more money and splurge here. You’re welcome, self.” As a model aviation and audio electronics professional who solders multiple projects per week, this iron has already saved me cumulative days of ‘waiting for the iron to get to temp,’ as well as dozens (if not hundreds) cold solder joints averted. High-end unit at an affordable cost. Do it. Buy it. Three, two, one, buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher Hopper",
      "helpful_votes": 4,
      "publication_date": 20171206
    },
    {
      "title": "Professional/Laboratory/ISO Standards Shop tool",
      "text": "This soldering Iron from Hakko is made from high quality components and the control system delivers heat at a consistent temperature. Because of the high quality of the materials used by Hakko, oxidation of the tip and contamination of solder joints just doesn't happen when using this iron(At least not picking up gunk on the tip). Replacement tips and parts are all inspected and stamped with various insurance lab approvals so you can maintain this soldering iron indefinitely at factory new condition. I've been working with electrical engineering products for 30 years, Hakko is one of the finest companies I've ever come across.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicster",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Easy to use and good heat regulation",
      "text": "I originally bought this for soldering in some very small components, but I have found that it works equally well (with the right tip) for some pretty heavy duty work. I recently had to solder some leads onto some 1/2\" x 1/16\" copper strip and was pleasantly surprised that this iron, with a large tip, was up to the task, but also able to handle some tiny surface mount components when mated to an appropriate tip for that work. I also like the soldering iron stand, which holds the iron securely while isolating the tip. When I made the order, I assumed that the stand would be a lightweight affair, but it is hefty enough to stay in place.",
      "rating": 5.0,
      "verified": true,
      "author": "RayK",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "I didn't know what I was missing...",
      "text": "I have had a low-end Weller iron for ages. I always just assumed warming up the soldering iron involved plugging it in, leaving the room for a while, and then coming back. This thing heats up FAST. The digital readout is great as it shows me exactly where the temperature is. I do wish they would have just put in two buttons for temperature adjustment. That is the most common function, and its kinda sad you have to adjust the temperature digit by digit.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler Gunn",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Love It!",
      "text": "I have put off getting a decent soldering system for a while...I had an old Radio Shack unit that had seen better days but was still ok. I figured the performance couldn't be THAT much better. Well, I was wrong. This thing heats up super fast, the tips are great, the unit is fairly small and the stand has everything I was looking for. This unit represents a great value and exceeds my performance expectations. If you are in the market for a new soldering station, or are just thinking about upgrading, you will not be disappointed with this unit.",
      "rating": 5.0,
      "verified": true,
      "author": "MTech2",
      "helpful_votes": 0,
      "publication_date": 20190404
    },
    {
      "title": "Wow - professional grade makes a difference",
      "text": "I had an old radio shack soldering iron. The tip had been badly abused. Picking up a hobby that requires soldering some small circuits, I decided a new modern iron was in order (especially since there is no Radio Shack to run down to to get new tips, etc). Hakko came highly recommended. After a few uses, I can see why. I love the programmable base and the ability to change temperature to use for different types of projects. A master can do great work with even poor tools. For amateurs, good tools compensate a little for lack of skill. This is a great tool.",
      "rating": 5.0,
      "verified": true,
      "author": "DrDWilliams",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "nice soldering station",
      "text": "This is considerably better than the Weller that I have used for years. You DO need to read the set up instructions as selecting the temperature is not that intuitive. The build quality is much better than I expected. The solder pen holder is all metal and plastic components are well formed and fit well. I have only used once to re-solder some board pins to an ethernet connector (fairly fine work) successfully. I like the fact you can control the temperature to fit the project your working on.",
      "rating": 4.0,
      "verified": true,
      "author": "CHARLES S.",
      "helpful_votes": 3,
      "publication_date": 20170701
    },
    {
      "title": "Fast, consistent, perfect",
      "text": "This is definitely one of those \"I should have done this years ago\" purchases. It gets up to temperature very quickly, holds the temperature steadily, and does a perfect job every time. It's good for small soldering jobs and with the chisel tip can solder 12 gauge stranded wire well, too. I use this mostly for RC car projects and LED lights.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "This thing worked out great! I'm not entirely sure what seperates a good ...",
      "text": "This thing worked out great! I'm not entirely sure what seperates a good iron from a bad iron. But I can say that this served it's purpose very well and made my first soldering project a breeze. The temperature stayed at exactly 750F the whole time I was using it, the tip still looks terrific, and the wires were flexible, making the iron itself easy to move around and use. Loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alek",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Good iron, instructions lacking",
      "text": "Everyone was right about the instructions being somewhat vague, however instructional videos can be found on YouTube on Hakko's page. It will take a little getting used to just to get the sequence to get the temp you want. That's the only reason for only four stars. For the type of iron it is and the price, it would be hard to beat. Hakka offers repair/replacement parts that many others don not.",
      "rating": 4.0,
      "verified": true,
      "author": "Donald Kemper",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "I can't recommend it. Ergonomically",
      "text": "After eight months using this as a second station to my Weller digital, I can't recommend it. Ergonomically, it's very nice. I don't mind the program controls either. But if they are all like mine, tip temp seems to wander. The display will read the proper temp, but the tip will stall. i don't know another way to put it. It's inconsistent and frustrating. I may have a defective unit. Unfortunately, I've only used this unit approx. two hours in that eight months, so the irritation has been a slow burn.",
      "rating": 2.0,
      "verified": true,
      "author": "Kevin McDonald",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Worth the price. Should have bought this years ago.",
      "text": "Awesome. Used wands for years, finally decided to purchase a production digital professional soldering station. I like the digital read out. I use this now on circuit boards which I never thought I'd be soldering on! Now I have a pinball game and it comes in extremely helpful. Pros: Price compared to other leading brand. The other leading brand has not improved their product in years. Good quality Digital readout, without the up charge. Peer reviews, recommended by a friend who uses these for work. Cons: None yet",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Broadband",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "Does not seem to be heating after light usage.",
      "text": "Been using this iron for small projects for the past couple of years, and recently noticed that it will not heat over 520 degrees (F) anymore. Changed the tips, and inspecting all the parts like the manual suggests and it just does not seem to heat hotter than that. It's a hobby so it only gets used a few times a year, and I expected this to basically last me for many many years with the usage I had in mind. A little sad that it seems to be having issues.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick Young",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Excellent Soldering Iron",
      "text": "I love this thing. I’m just a beginner when it comes to soldering, but I’m very impressed with the performance of this soldering iron. The tip heats up very quickly, getting to full temps at about 30 seconds, and can easily stay there while using it. The entire unit feels very high quality too, the cable is nice and thick, the buttons are clicky and firm, the iron itself is padded and is comfortable to hold onto, especially for longer periods of time. Honestly I could go on, but simply put I highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "OMG what a great product. Have been using old Radio Shack soldering ...",
      "text": "OMG what a great product. Have been using old Radio Shack soldering iron for years and never felt my soldering skills ended up really well. With this unit soldering is faster and results much more professional looking. Unit heats up FAST [ready to use about 30 secs] and maintains temperature really well. Will NEVER go back to cheapo irons.",
      "rating": 5.0,
      "verified": true,
      "author": "J.D.Engineering",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Good value as the kit offered",
      "text": "They make great irons.. back in the day Weller was it.. but couldnt find a decent deal on a weller for my daughter who has been hogging my 30yo weller station... so bought this for her , for her birthday... yea, she wanted a good iron and a signal generator.. she's a STEM student.. me a EE... She's a HAM too, so its being put to good use.",
      "rating": 5.0,
      "verified": true,
      "author": "BK",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "Exellent Qualuty",
      "text": "Awesome! After decades of gimping around with hardware store grade soldering irons, I finally broke down and bought a good soldering station. This one heats up amazingly fast and holds the temp precisesly....vs hardware store grade irons which take forever ti heat up...and then just keep getting hotter!",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "I absolutely love this system",
      "text": "I absolutely love this system. I do a lot of random projects from micro controller projects, repairing electronics and automotive wiring. This will harm up to its highest heat setting in under 20 seconds. The unit is well build and extremely solid, majority of it is metal including the holder. Tips are great and easy to change. The tips included come pre tinned.",
      "rating": 5.0,
      "verified": true,
      "author": "n0pre55ure",
      "helpful_votes": 2,
      "publication_date": 20161120
    },
    {
      "title": "Works good",
      "text": "I bought this unit to replace an old Weller soldering station. The current reviews for the Weller units are iffy so I decided to try the Hakko unit after reading the Amazon reviews and other sources that liked using the Hakko units. I've only used the Hakko for about 25 solder splices so far and am satisfied with the way the Hakko works.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Murakami",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Unexpected Error",
      "text": "Nothing can be said about this product. The day on which it was promised to be delivered, I received a cryptic email to the extent that an \"Unexpected Error\" had occurred, preventing delivery, with no further details or explanations other than a forthcoming refund. It's impossible to rate an unseen and untouched product. In the mean time, I located and purchased the same item for a better price on a popular online auction site. It should arrive by week's end. Time will tell as per the promised refund. Thank you so much, Amazon!",
      "rating": 1.0,
      "verified": true,
      "author": "Stephen Ray Williams",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Solid and reliable",
      "text": "I purchased this to replace a 15 year old 40W iron I had finally worn out and this blew it out of the water. I have used solder stations many times in the past but never of this quality. Everything from the stand to the cables feel stable and well designed. The iron is fast to heat and the temperature was accurate right out of the box. Light weight and small enough for my 11 year old son to solder 15 switches without fatigue and powerful enough to let me buzz through 50+ joints very quickly. The grip stays cool and sure throughout long projects and the tip kept a tin very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard W. Walker",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "Just can't go wrong with a Hakko. The first ...",
      "text": "Just can't go wrong with a Hakko. The first time you use a temperature controlled iron, you'll wonder how you ever worked with a single-wattage iron or a cheaper adjustable wattage iron. Consistent solder joints are a breeze.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Dickinson",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Worked great for a short time",
      "text": "I used this on and off for a few months then put it on the shelf. I used it again about 3 months later and even with the temp maxed out I could not get much heat. Takes about 30 sec to even melt a tiny bit of solder. So I put it back and used a backup iron. Just tried it now (9 months later) and it still wont heat... Seems like a great unit but it broke with minimal use and no known drops or spills.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "Good Soldering Iron but it Doesn't have an Auto Shutoff",
      "text": "This is a well built soldering iron. It heats up quickly and is easy to use. A variety of tips are available and they are easy to change. The only downsides I see are that the user interface is a little difficult to use and it doesn't have an automatic shutoff if it is not used for a specified time. I have accidently left it on over night a couple of times.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Allen",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Light weight iron",
      "text": "Not impressed. May be ok for very small surface mount stuff. Could not tin speaker wires with it even with the biggest tip. Disappointed. Turned it up to 850 degrees. Managed to solder on a bunch of thru hole caps. Using lead free solder.",
      "rating": 2.0,
      "verified": true,
      "author": "cKr",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Quality product",
      "text": "This is a well made quality tool with a full range digital heat adjustment. Used Tix jewelry solder out of the box. Increasing/decreasing temperature is a breeze and nearly immediate. Toss your Weller in the trash.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Workman",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Excellent soldering kit.",
      "text": "Heats up fast so I can turn it off between various steps without having to wait for a long time to get back to temperature. Well made. Nice extra adaptors. I love it. Ham radio for 65 years and this is the best soldering kit I've seen.",
      "rating": 5.0,
      "verified": true,
      "author": "CB Traveler",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Junk buyer beware, buy generic 20$ iron first works better",
      "text": "Junk product, doesn't even get hot enough to melt unleaded solder in most circumstances. A cheap atten device for less than 30$ works better than this soldering iron. Very much regret the money I spent on this literal junk. A year later im still pissed a 20$ generic works better.",
      "rating": 1.0,
      "verified": true,
      "author": "Renea Tranick",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Quality iron with mystery included...",
      "text": "The iron is comfortable and appears durable. Only ad it for two weeks but enjoy using it; it's a quality tool. That said, setting temperature is a little tricky. Add to that, complete instructions are not included- once you figure out something is missing you can go online and download a complete owners manual; which should have been included in the first place. It is a quality tool and would purchase other Hakko products.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Lesher",
      "helpful_votes": 4,
      "publication_date": 20150524
    },
    {
      "title": "I love this soldering station",
      "text": "I love this soldering station. What really makes it great is the assortment of tips and the range of temperatures. I use the fine tips for soldering to pads on circuit boards and the chisel tips for soldering rails on my n-scale model railroad. I've have a number of soldering irons and stations. This is the most versatile and best of the lot. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20180324
    },
    {
      "title": "So good. Especially for the price.",
      "text": "I love this iron. It is the first high quality iron I have owned in a series of cheap irons, and it makes all the difference between destroying my projects and producing professional looking results. The pen itself is so comfortable and the cord is high quality and stays out of my way. The extra tips seem like a good value for the extra money you spend. Also the yellow/blue colors are very aesthetically pleasing to me, I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "Great iron. Heats to 750 in less than a ...",
      "text": "Great iron. Heats to 750 in less than a min and cools quickly. I was concerned about the holder because it looks plastic in the picture, but it is metal. Unlike the spring style holders this one fully encloses the pen so you can't burn yourself by bumping into it.",
      "rating": 5.0,
      "verified": true,
      "author": "PBJ",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Can't beat it!",
      "text": "I was between this and a Weller. I have not used the comparable Weller, but there's nothing that I feel that the Hakko is missing. Heats up quickly and works flawlessly. The accessories that come with it are an awesome selling point. When I purchase off amazon, I do a fair amount of research to make sure I'm buying the best product at the best price. This product met those requirements. Would definitely purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "CBen",
      "helpful_votes": 0,
      "publication_date": 20151210
    },
    {
      "title": "Maintains temperature",
      "text": "I use this unit to attach wires to fine pitch surface mount parts during the debugging process while developing new products. Having used the unit a few times now, I am impressed with the temperature control. The unit climbs to temperature rapidly and maintains the setting well. The tip cleaner sponge works much better than those I have used previously. It stays damp, not wet. Having a very clean tip is especially beneficial in avoiding solder bridges on the 0.5mm pitch. The flexible cord between the iron and the base station makes it easy to maneuver.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin the Brus",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Great for jewelry and glass",
      "text": "Love this. Easy to set up. You Tube if you forget how to set it. I use it for making jewelry and love that you can set the temperature. If you are using for jewelry and glass, highly recommend investing in this. Less frustration and solder flows as it should. Comes with an assortment of tips.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Don't let the price fool you",
      "text": "Move over expensive Weller etc irons....this thing is excellent, consistent temps and heats up VERY fast. Been using it for 2 years steadily and still love it. Don't let the price fool you, lotta pros using this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Marsh",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Great Soldering Station so Far",
      "text": "Use it mainly for RC Hobby. For what I purchased it for, was well worth the investment. Not all that expensive and much better than a few of the cheap soldering irons I've used. Well built, heats up very quickly and to a temp that makes the tasks at hand easy to complete. Tip assortment that it came with was a big plus. Only been using it for a few weeks and hoping that it holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Stanz358",
      "helpful_votes": 0,
      "publication_date": 20170125
    },
    {
      "title": "Hakko soldering Station",
      "text": "Great soldering station. This model came with cleaning pad, sponge, and additional tips for different type of soldering. I am only do light soldering on old vehicles and this works great for all my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "unojo324",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "I hated soldering. The Radio Shack soldering iron I had ...",
      "text": "When I was young and into electronics, I hated soldering. The Radio Shack soldering iron I had was a royal pain to use. It was always too hot or too cold... The Hakko is an absolute joy. Set it for the appropriate temperature, and you're off to the races. It works great, it's comfortable, and this kit comes with a range of tips for almost any job. The included stand is very high quality. For a home hobbyist, this is a great unit.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Levandowski Jr.",
      "helpful_votes": 0,
      "publication_date": 20150226
    },
    {
      "title": "like soldering to a steel chassis",
      "text": "The Hakko is a first rate soldering instrument. It comes up to temperature very fast and has plenty of power for PCB soldering and even for soldering to tube sockets. Of course for big items, like soldering to a steel chassis, you will need something with more wattage. The procedure for programming the preset temperatures is a bit cryptic, but there are plenty of instructional videos on YouTube that can help with the process.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Melville",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "It's not the rotary version, but it works well!",
      "text": "I had been hearing about how the digital version suffers in comparison to the analog/rotary dial version. Honestly, I haven't had any issues other than accidently changing the calibration. That was an easy fix. Just search the following on YouTube: Reset the Hakko FX-888D. Why settle for the cheap radio shack or Weller soldering irons. Sure, even I became highly skilled with them, but they took too long to heat up and suffered while working. The tips on those would always disintegrate. The FX-888D unit heats up in mere seconds and the tips last forever. I highly recommend the Hakko FX-888D to anyone from the hobbyist to the professional.",
      "rating": 5.0,
      "verified": true,
      "author": "wavydave!",
      "helpful_votes": 0,
      "publication_date": 20140426
    },
    {
      "title": "Great soldering station. BEST",
      "text": "I've owned numerous soldering stations, including a digital Weller, cost twice as much, & doesn't work half as well. Highly Recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Triz_Megistus",
      "helpful_votes": 0,
      "publication_date": 20190209
    },
    {
      "title": "Awesome unit",
      "text": "I have been dealing with 30-40 yr-old Wellers in various states of disrepair. I finally got pissed enough to throw all of it away and purchased this unit and I couldn't be happier. So far this that has soldered everything I've put in front of it. It well exceeds any RC needs and will suit you well for any larger tasks around the house.",
      "rating": 5.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 2,
      "publication_date": 20150403
    },
    {
      "title": "This soldering iron is great. Heats up quickly and maintains its heat well ...",
      "text": "This soldering iron is great. Heats up quickly and maintains its heat well while soldering. I like that this has setpoints for soldering that can be quickly changed. Does not feel cheap at all and is heavier than I was expecting. I do recommend this soldering iron.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Henke",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Great Product!",
      "text": "I have used Weller products exclusively since 1973 so making a switch to a Hakko was a big change for me. Any concerns I may have had were unfounded as this is a workhorse of a soldering station. I would buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "bs",
      "helpful_votes": 0,
      "publication_date": 20170721
    },
    {
      "title": "Another great product from Hakko!!!🔥",
      "text": "Was worried when I saw the package, thought the item might be broken. My husband set it up at his hobby station and said it works great. He was super happy to receive it. 👨🏼‍🏭🔥🔥🔥🔥🔥",
      "rating": 5.0,
      "verified": true,
      "author": "att0224",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Excellent soldering station and well made!",
      "text": "Excellent soldering station. Well made and heats up in seconds. The included sponge and tip cleaner all fit nicely into the station. The included 5 different tips were a plus as well. I would definitely recommend spending the extra money to purchase this station over some of the cheaper ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert M.",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Great unit, fair price, tip kit is best bang for the buck!",
      "text": "Great unit, and the best bang for the bucks if chisel-tips is your thing. YMMV, but for almost all soldering tasks (including smd), chisel tips will be easier to use than cones.",
      "rating": 5.0,
      "verified": true,
      "author": "Xomby",
      "helpful_votes": 5,
      "publication_date": 20140730
    },
    {
      "title": "Excellent quality.",
      "text": "Works great; but had to contact Hakko to get instructions on re-calibration and a reset to factory settings. Out of the box, when I set the temp to 585F, the true temp was 450F using a Hakko FG100 temp sensor. Using the re-calibration instructions, I got the temp set to true.",
      "rating": 5.0,
      "verified": true,
      "author": "RickM46",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Why did I wait so long...",
      "text": "Fired it up yesterday for the first time. It heated up so fast. Tip tinned with ease and away I went. Why did I wait so long to buy a quality soldering iron? Don't think about it, just buy it and be happy... :)",
      "rating": 5.0,
      "verified": true,
      "author": "nitzer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Flexible and powerful",
      "text": "Worth every penny and works great. For years I've worked on projects with either an underpowered cheap soldering iron or a heavy Weller soldering gun. The Hakko station blends the best of both in a easy to use package that makes tackling any project a simple task. The variety of tips and power allows me flexibility to do small or large projects with one tool",
      "rating": 5.0,
      "verified": true,
      "author": "Jamison Macallan",
      "helpful_votes": 2,
      "publication_date": 20150622
    },
    {
      "title": "very good product",
      "text": "This is a great hi-quality product. Bought it, used it for several projects (Harley re-wiring to delicate electronics). It works great.",
      "rating": 5.0,
      "verified": true,
      "author": "zakleerite",
      "helpful_votes": 0,
      "publication_date": 20171107
    },
    {
      "title": "Does great. Enjoy using",
      "text": "Does great.Enjoy using.Plugged it up and did temperature test first thing.47 degrees Fahrenheit off.Done factory reset procedure .Checked and doubled check .Now it right on the dot.Feels very comfortable using.So many irons have to large in diameter to hold onto while soldering. Not this one.Just an all around pleasure to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Dollarbill777 ",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "The menu is not easy to use",
      "text": "The menu is not easy to use, but after looking at a few videos I got it all set up. Most are things you only set once anyway. It heats real fast and keeps temperature spot on. This is a real pleasure to use. After dealing with a cheap, badly made station, I'm glad I got the good one this time.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard E. Lothridge",
      "helpful_votes": 0,
      "publication_date": 20160303
    },
    {
      "title": "excellent station",
      "text": "Have had this almost a year now and thought it is time I should say how much I like it. It heats very quickly so I find myself doing quick jobs I might otherwise have skipped. I use 63/37 Kester solder and set the station to 650. Joints are fast, consistently shiny and the wool keeps the tips clean and bright. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "pidloop",
      "helpful_votes": 2,
      "publication_date": 20141223
    },
    {
      "title": "A Seriously Good Iron",
      "text": "If you're like me, and having troubles soldering and de-soldering because you bought a cheap $10 pencil iron this thing is a godsend. The temperature is easy to read and adjust, and it gets fully up to temp in about 15 seconds and STAYS THERE. If you plan on soldering even one project, this thing is totally worth the money for clean solder joints and an iron that will hold temp. The iron holder is a sturdy brushed metal, and the placement of the wire cleaner and brush work out well, plus the overall quality of the iron and tips themselves is outstanding. For home soldering, you will never need another iron!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Good soldering station",
      "text": "This is a big upgrade from my old soldering iron. Well made nice cord and heats up quick.and nice to set preset heat adjustment s",
      "rating": 5.0,
      "verified": true,
      "author": "John m",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Mr Mario Recommended It on Youtube",
      "text": "Saw Mr Mario, he recommends this. Works as intended. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Stone",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Seems to be good quality.",
      "text": "I haven't had it very long but I definitely tell that the temperature regulation is way better than my old soldering station. The tips are made of way better stuff that is far more oxidation resistant too. Very easy to use, just plug it in and turn it on.",
      "rating": 5.0,
      "verified": true,
      "author": "Ye Shall Be As Gods",
      "helpful_votes": 0,
      "publication_date": 20170127
    },
    {
      "title": "The control that you can get with this is amazing. I always had trouble with electronics before with ...",
      "text": "The control that you can get with this is amazing. I always had trouble with electronics before with my uncontrolled heat soldering iron melting everything. Now, I hook up the components, and they all work right off the bat.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "Seems well made",
      "text": "I haven’t tried it yet, but unpacking it the product looks excellent. Multiple tips. I just wish they were better instructions on care, like on how to change the tips for example.",
      "rating": 5.0,
      "verified": true,
      "author": "BrooklynBoy",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Great iron! Poor temp control interface.",
      "text": "This is so, so much better than my old Radio Shack iron! This thing heats up fast! My only gripe is that it is easy to accidentally decalibrate. The interface for adjusting temps is rather poorly designed.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeanne",
      "helpful_votes": 2,
      "publication_date": 20160806
    },
    {
      "title": "Great iron and stand, but the controls could be improved",
      "text": "This is a great little soldering station. It heats quickly, and I really like the integral cleaning wire built into the base. I am only subtracting one star because I think the digital controls are annoying. Switching back and forth between preset mode and manual mode is not intuitive or user friendly, and in manual mode it takes many separate clicks to tweak the iron temperature. This iron would be perfect if the put back on a dial, and maybe a dedicated manual/preset 'mode' button. Having to reboot the device and navigate a cryptic menu system to switch modes is a pain. (I have to pull out the manual whenever I want to do it!)",
      "rating": 4.0,
      "verified": true,
      "author": "Orange Crush",
      "helpful_votes": 8,
      "publication_date": 20141221
    },
    {
      "title": "Very nice soldereing station",
      "text": "This is my first nice soldering station. It is amazing how much better it is than the old cheap soldering irons I was using. Highly recommended. Heats up very quickly, and maintains temp.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe Owensby",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Not good for fine pitch",
      "text": "This is an OK iron for large parts but anything 0603 or fine pitch like 0.2mm I would not recommend. The finer tips don't transfer the heat to the ends. We went through different solders and different ends hoping for the best but ended up having to get a metcal.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "holds heat great and works better than expected",
      "text": "Bought this to replace the 25$ special I picked up at my local Fry's Electronics. Should have bought this to begin with as it has been the most used tool in my workbench! I've only needed the chisel tip so far. Heats up in under 30 seconds, holds heat great and works better than expected! Would buy again though I don't think mine will crap out on me any time soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Mills Family",
      "helpful_votes": 0,
      "publication_date": 20171019
    },
    {
      "title": "Can't go wrong on this one",
      "text": "Wish I had purchased this station years ago. The more I use it the move I love it. Thanks to the engineer on You Tube for his recommending this one. I've recommended to my group of amateur radio operators as their primary solder equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "Retarted Retiree",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "What's not to love?",
      "text": "Is it the compact size? Is it the high quality build? Is it the professional level heat control? Is it the proliferation of accessories? Is it the range of tips you get with this model? Maybe it's all of the above!",
      "rating": 5.0,
      "verified": true,
      "author": "Sj Construction",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "This thing is amazing. I solder guitar cables and electronics in guitars",
      "text": "This thing is amazing. I solder guitar cables and electronics in guitars. It can heat to 750 in a matter of seconds, and it doesn't cool while you are working. No melting, no weird smells... Get it.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Holmes",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Heats up really fast! With nice temperature control.",
      "text": "This iron heats up really fast and makes soldering effortless The only complaint is the difficulty to change temperature.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank H",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Best soldering system",
      "text": "This is the best soldering system money can buy!! Heats up quickly and does the job fast!!",
      "rating": 5.0,
      "verified": true,
      "author": "Peter D Shaw",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Best Iron you can buy.",
      "text": "As described. Well packaged, and the difference of using this iron versus the typical $15-$25 units is amazing. I did a lot of pondering before deciding to get this particular model and the Hakko brand. I was not disappointed. Excellent quality, and worked perfect out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Great upgrade from basic iron",
      "text": "Great soldering iron. Replaced my cheap Wagner iron with this one and it is a remarkable difference. The temperature control, ergonomics, tip selection and stand make for a great soldering experience. The only difficulty I found was directions on how to change tips which I found instructions online.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Milo",
      "helpful_votes": 0,
      "publication_date": 20151022
    },
    {
      "title": "I thought I was the world's worst solderer until I got this bad boy",
      "text": "I thought I was the world's worst solderer until I got this bad boy. It's amazing what a nice iron can do. It heats of quickly, stays hot, and has a solid tip. Worth every cent.",
      "rating": 5.0,
      "verified": true,
      "author": "David Dentry",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Great Soldering Iron",
      "text": "I never knew a temperture controled soldering iron would make such a difference. With the right tip, any job is fun and quick. Great iron.",
      "rating": 5.0,
      "verified": true,
      "author": "DPMS Expert \"TOSH\"",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Awesome!",
      "text": "So much better than my old $20 solder station. melts solder so i dont have to hold the iron on a spot in worry that the component will overheat.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "If you are in the market for a solder station this unit won't dissapoint",
      "text": "Great for hobby or professional use. This is a high quality product. I used this to get my certifications and have soldered various projects with this unit. It works just as well as the $500 dollar units I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "sf",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Love it!",
      "text": "Heats up very quickly. I bought some additional tips for the iron because the one that comes with it is a bit large for soldering on circuit boards with integrated circuits.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Five Stars",
      "text": "Excellent soldering iron. Very quick to heat up. Durable. I would definitely buy this again.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Henry",
      "helpful_votes": 0,
      "publication_date": 20180124
    },
    {
      "title": "Never knew soldering irons were this good! Very quick to achieve stable temps and the ...",
      "text": "Never knew soldering irons were this good! Very quick to achieve stable temps and the tip assortment is very handy.",
      "rating": 5.0,
      "verified": true,
      "author": "dok",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "looks a little toyish but is an excellent soldering station",
      "text": "looks a little toyish but is an excellent soldering station. I like all of the features very well and especially the fact that the holder is separate from the soldering controls. It cost a little more but well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20160220
    },
    {
      "title": "Fired it up tonight and it works great! It heats up fast and maintains it heat",
      "text": "Picked this up for hobby work repairing arcade pcb's. Fired it up tonight and it works great! It heats up fast and maintains it heat. I like the digital display and is easy to change temperatures. It's a great upgrade from the single temp weller that I was using.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20150224
    },
    {
      "title": "Happy",
      "text": "Heats super fast. Great unit so far. Haven't used it a ton, but everything is satisfactory now.",
      "rating": 5.0,
      "verified": true,
      "author": "ProBuilder",
      "helpful_votes": 0,
      "publication_date": 20170628
    },
    {
      "title": "High quality, infinitely easier to learn to solder with than a pen iron.",
      "text": "Been using this for about a year and a half now. First tried soldering with a dinky little pen soldering iron, was terrible, spoiled myself and got this and haven't looked back. I've used it primarily for RC Aircraft wiring, but also done a fair bit of home electronics repair and a bit of surface mount soldering since. The adjustable temp is fantastic. High quality item.",
      "rating": 5.0,
      "verified": true,
      "author": "Elliott",
      "helpful_votes": 0,
      "publication_date": 20141116
    },
    {
      "title": "Would never recommend another Soldering Station to somone just starting on electronics",
      "text": "Would never recommend another Soldering Station to somone just starting on electronics. Just get this and and you will not be upset later...",
      "rating": 5.0,
      "verified": true,
      "author": "Donovan G.",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Great station.",
      "text": "I never knew how effortless soldering could be until I used this iron. It comes up to speed superfast and has a small foot print. Great station.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter",
      "helpful_votes": 0,
      "publication_date": 20170226
    },
    {
      "title": "This is bar far the best soldering iron I've ever used gets up to temp ...",
      "text": "This is bar far the best soldering iron I've ever used gets up to temp in seconds! The holder/cleaner is steel and heavy won't tip over and fall with your hot iron in it, with two different ways to clean your tip one wet sponge and brass wire this thing is amazing! This will always be on my bench. Would recommend it to anyone looking for a quality soldering station. Would definitely buy again if lost or stolen.",
      "rating": 5.0,
      "verified": true,
      "author": "jared",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Amazing quality, great reliability",
      "text": "First real soldering iron I've owned, going to this from my RS straight wall plug iron is the difference of night and day!!! Amazing quality, great reliability, just an all around excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Fisher",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Digital control great",
      "text": "Used for stippling plastic and digital control allowed to zero in on best temperature to melt for texture without scorching or discoloring.",
      "rating": 5.0,
      "verified": true,
      "author": "Rory",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "I'd recommend",
      "text": "Still going Strong and working great, still on the first tip of moderate usage almost daily. Will be buying another for the garage. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Wisconsin Buyer",
      "helpful_votes": 0,
      "publication_date": 20170829
    },
    {
      "title": "Excellent soldering station",
      "text": "Excellent soldering station. I got tired of messing with cheaply made junk and started researching for a good soldering setup. I was just about to buy another very well known one, but kept reading a lot of bad reviews. So I decided on this one and I must admit, I made a great choice. It heats up very quickly and is easy to change temperatures. So much nicer than any I have owned before.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Dixon",
      "helpful_votes": 0,
      "publication_date": 20141117
    },
    {
      "title": "Great for the occasional tinker-er",
      "text": "Wish I would have bought this earlier. I don't solder a ton but it's the best unit I've ever used and wished I would have purchased it sooner. After about 6 other units, I've settled on this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Brettstr42",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Quite possibly the best money I have ever spent",
      "text": "Quite possibly the best money I have ever spent.. ever... If you need a soldering iron more than once a year, you need one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Williams",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Great Soldering Iron!",
      "text": "One of the best tool purchases I've ever made. This unit is fast, accurate, and makes soldering a breeze!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Winstead",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "High Quality Station!",
      "text": "The best Solder station for the money. Stay away from Chinese junk that is being sold on amazon. This is perfect for the amateur to the pro.",
      "rating": 5.0,
      "verified": true,
      "author": "Regular Guy",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Hakko soldering station",
      "text": "I have bought and thrown away many soldering irons over the years. The plan was always to save money but would have saved money if I just got the Hakko soldering station. It heats up in 30 seconds and I could not be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Durland",
      "helpful_votes": 0,
      "publication_date": 20151020
    },
    {
      "title": "love this little station - new to soldering and this ...",
      "text": "love this little station - new to soldering and this works great - gets hot very fast and stays there",
      "rating": 5.0,
      "verified": true,
      "author": "Claudio D'arezzo",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "Worth the money",
      "text": "A bit on the expensive side but I love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina Hau",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "Awesome rig. Used the Hakko system at a place ...",
      "text": "Awesome rig. Used the Hakko system at a place I worked at some years back and loved it then. This newer/updated system is even better.",
      "rating": 5.0,
      "verified": true,
      "author": "J. L. Jackson",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "This iron is great. Don't let the colors fool you",
      "text": "This iron is great. Don't let the colors fool you. My impression from the pics made it look 'plasticy.' This assumption was wrong. It is all metal. I would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Wolf",
      "helpful_votes": 0,
      "publication_date": 20171106
    }
  ],
  "product_meta": {
    "title": "Digital Soldering Station with Chisel Tip Pack T18-D08/D12/D24/D32/S3",
    "description": "Reliable digital technology by HAKKO – Introducing the HAKKO FX-888D Excellent thermal recovery Heater output has been increased by 30% compared to that of the conventional models HAKKO 936·937. Also FX-888D delivers excellent thermal recovery by using T18 series tips for their terrific heat conductivity. This allows soldering at a lower set temperature and reducing the thermal impact on components as well as tip oxidation that can shorten tip life. Thermal recovery graph Rise time to 350Degree C is 20 seconds faster and tip temperature drop is reduced during continuous work. HAKKO FX-888D performance comparison graph with conventional stations Able to shorten the time required for the same work and improve work efficiency significantly. Designed to be User-Friendly Small footprint Compact station body requires a space of only 100 (W) x 120 (D) mm. What’s more, points that come into contact with the floor are positioned as close to the outer edge of the body as possible to improve stability and make the station difficult to fall over. Simple and easy operation With only two operation buttons of UP and ENTER in the center, operation is simple and easy. Even if you’re not familiar with operation of machines, you can operate it without difficulty. Iron holder with full of functions An iron holder of the same color of a soldering station comes as a set. The highly functional iron holder not only improves ease of use, but also brings a sense of visual consistency to the work environment. Silver Soldering station Iron holder Blue & yellow Soldering station Iron holder Strict temperature management Digital display The FX-888D’s digital display makes it easy to check the set temperature at a glance.",
    "rating": 4.7,
    "feature_bullets": [
      "Digital soldering station end safe version with 5 extra tips -t18-d08/D12/D24/D32/S3 tips",
      "FX-888D KIT version with 5 extra tips -T18-D08/D12/D24/D32/S3 tips ( 6 total with the iron )",
      "Adjustable temperature control",
      "Temperature range 120° - 899° f (50° - 480° c)",
      "Digital display shows °ree; f or °ree; c"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "10 x 10 x 7.5 inches; 4.63 Pounds",
      "Item model number": "FX888D,T18-D08,D12,D24,D32,S3",
      "Date First Available": "April 25, 2013",
      "Manufacturer": "Hakko",
      "ASIN": "B00C1N30DI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}",
      "GTIN": "818497013041 , 787721477280"
    },
    "categories": [
      "Soldering & Brazing Equipment",
      "Soldering Stations",
      "Tools & Home Improvement",
      "Welding & Soldering",
      "Industrial & Scientific"
    ],
    "price": 149.45
  }
}