{
  "website_summaries": [
    {
      "verdict": "The BenQ W1500 3D home entertainment projector is bright enough to stand up to moderate ambient light and offers acceptable, if not particularly impressive, video quality.",
      "pros": [
        "Works directly with HDMI 1.4a devices like Blu-ray players for full 1080p 3D",
        "Wireless HD connection"
      ],
      "cons": [
        "Shows rainbow artifacts, although much less often than with many DLP projectors",
        "Hard to focus eyes with some 3D scenes"
      ],
      "aspects": {},
      "publication_date": 20131014,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "the image was beautiful. I thought the frame interpolation was excellent",
      "text": "I thought the colors were a bit washed out, but perhaps I had not dialed in the settings correctly (too bright?), I'm just not sure. Otherwise, the image was beautiful. I thought the frame interpolation was excellent. It made sports more fluid and smoothed out regular movies in the lower setting. The highest setting made movies have an undesirable soap opera effect. My wife did think the projector was louder than our older Benq W1085ST which was a bit disappointing. Overall, I'd recommend this projector as a high end consumer projector.",
      "rating": 4.0,
      "verified": true,
      "author": "Tech Junkie",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "and thought the 3D works great with my bluray player",
      "text": "I have been using this for a few days. It's very quiet, and the picture is phenomenal. I have run into a few problems which I will address with BenQ support: Although it is set for auto shut-off after 5 minutes, I left it today with no input for about 45 minutes, and when I returned it was still on. I am seeing some problems with the remote failing to work, and thought the 3D works great with my bluray player, I'm not getting a 3D picture when I feed it side-by-side from my cable box, even when I manually set it to side-by-side mode. Maybe they can walk me through a firmware update that will fix this.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Very good projector!",
      "text": "I've considered to choose Benq W1500 because it has FullHD resolution, 6-segment 4-speed color wheel (RGBRGB), high brightness and also it has WHDI connection with any hardware with HDMI-out. I use 150\" MW-screen (about 330 cm width) and the picture with max brightness looks over-exposed, so I had to lower the projector's brightness to 40%. And I had to use ECO mode due to noise, because the noise in normal mode is too high. The projected picture quality is very good, but when I was watching a bright scenes, the contrast is not enough - may be due to the white environment (ceiling and walls) around the screen. So, I was satisfied with my new Benq W1500!",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Titarenko",
      "helpful_votes": 0,
      "publication_date": 20140622
    },
    {
      "title": "Fantastic value and superior picture",
      "text": "I was totally inspired by a friend who installed a unit in his home, its a competitor. I did some research and found the BenQ. Looking at the how it works I was very familiar with the DLP technology and could not believe this was available in a home unit. Easy to install and align. The picture is incredible! It arrived in time for the Super Bowl and WOW what a game! Best benefit, my son brings his girlfriend over to watch movies here cause it's cheaper then going out! It",
      "rating": 5.0,
      "verified": true,
      "author": "William J. Britton",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Love this projector",
      "text": "The light is super bright and images are fabulous - 1080p is crystal clear. The only drawback is the built-in speakers. I was excited about them, but ended up using external speakers, which is fine. I didn't take any stars away for that because the picture quality is stunning. More than enough hook-ups for Apple TV, hooking up my laptop (both thru HDMI) and even our Super Nintendo (s-video). It was between this one or a similar $1500 BENq projector - and for nearly half the cost and identical picture quality - this one wins hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "Flylet",
      "helpful_votes": 0,
      "publication_date": 20140111
    },
    {
      "title": "Really awesome.",
      "text": "There is a slight red tinge to 3D but I suspect it depends on the type of glasses you wear. It's not noticable when watching 3D movies unless you really look for it or take off the glasses. Great projector and appreciate the wireless HDMI dongle. Makes things a lot easier to setup.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. F.",
      "helpful_votes": 0,
      "publication_date": 20140127
    },
    {
      "title": "Works great on my 120\" screen in my media room",
      "text": "Outstanding projector!! Works great on my 120\" screen in my media room. Bright, great colors, easy to calibrate, couldn't ask for more, especially at that price!",
      "rating": 5.0,
      "verified": true,
      "author": "Roger D Ludwig Jr",
      "helpful_votes": 0,
      "publication_date": 20150703
    },
    {
      "title": "Great Wireless HD Projector",
      "text": "Great wireless HD projector. I am not sure why this projector isn't more raved about. It's wireless and HD! What's not too like.",
      "rating": 5.0,
      "verified": true,
      "author": "Moose",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "The quality of the picture is really good. But when I worked with wireless there is ...",
      "text": "The quality of the picture is really good. But when I worked with wireless there is distortion in the picture. It is a good by for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Ravi",
      "helpful_votes": 0,
      "publication_date": 20140808
    },
    {
      "title": "This unit is amazing. I'm finally replacing the first lamp",
      "text": "Talk about a light cannon! This unit is amazing. I'm finally replacing the first lamp, but it's lasted a year!",
      "rating": 5.0,
      "verified": true,
      "author": "beverly",
      "helpful_votes": 0,
      "publication_date": 20140806
    },
    {
      "title": "Five Stars",
      "text": "BenQ was so awesome to deal with. GREAT product, and better customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Emeljay",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "excellent",
      "text": "Works as advertised. Small Attorney trial firm uses it often and we are very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Spickler",
      "helpful_votes": 0,
      "publication_date": 20150311
    },
    {
      "title": "Excellent choice",
      "text": "I would really recommend this product the color are clear and crisp the resolution is incredible, I would have liked the Amazon re-sellers to include a couple of 3D glasses in their price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon Leonis",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Five Stars",
      "text": "Great for movies at home and to view music videos while you play pool.",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael villalobos",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "Awesome",
      "text": "This is a great projector. Easy to install and the picture is incredible. The on screen options made setup simple. Would definitely recommend this projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler R",
      "helpful_votes": 0,
      "publication_date": 20131221
    },
    {
      "title": "Cell phone and wifi signal can be a problem",
      "text": "The picture and functionality is very good. The wireless connection is troublesome. I have my unit connected to a Sony home theater receiver and the two do not always \"play nice\" when switching from one input to another. My real complaint is the interruption of the signal caused by an ipad or phone in our theater room.",
      "rating": 3.0,
      "verified": true,
      "author": "AFBrowm",
      "helpful_votes": 2,
      "publication_date": 20131217
    },
    {
      "title": "Great Projector",
      "text": "Overall I am very pleased with the performance of the projector in both 2D and 3D. I like the wireless feature, although it could use some improvement. As others have noted, when switching channels or when beginning playback of a title the wireless connection can be sometimes be lost. I can usually restore the connection by pressing another source button on the remote and then pressing the wireless source button again which can sometimes take a half minute or more to reconnect. Once reconnected it usually plays through without further problem. If it were not for that minor inconvience, I would have given the projector a 5 star rating.",
      "rating": 4.0,
      "verified": true,
      "author": "HOBBES",
      "helpful_votes": 3,
      "publication_date": 20140305
    },
    {
      "title": "Now makes a great door stop",
      "text": "Stopped working after only 10 hours. Replacement bulb is $250. Now makes a great door stop. Look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Capn Max",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "BEST PICTURE UNDER $2k",
      "text": "I tried the W1500, Epson 8350, Optoma HD25-LV, and the BenQ1070. This projector was the perfect one for my setup. The wireless, while not flawless, works, and it is a nice touch to not need to worry about long hdmi wires, or expensive cat6 extenders.. The image is bright enough to still be watchable even in ambient light, sports are amazing. five stars, i highly recommend this projector.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 7,
      "publication_date": 20131112
    },
    {
      "title": "BEST 3D I HAVE EVER EXPERIENCED IN MY OWN LIVING ...",
      "text": "WOW, BEST 3D I HAVE EVER EXPERIENCED IN MY OWN LIVING ROOM.",
      "rating": 5.0,
      "verified": false,
      "author": "Batman",
      "helpful_votes": 0,
      "publication_date": 20140814
    }
  ],
  "product_meta": {
    "title": "BenQ W1500 1080P HD Wireless HD DLP Home Theater Projector (2013 Model)",
    "description": "WHDI uses 5GHz radio transmission band to transfer 2D and 3D video and audio throughout your home.View larger DarkChip3 DLP Technology projects higher brightness and deeper black levels for film-like quality. WORLD'S 1ST BUILT-IN 5GHZ WIRELESS FULL HD PROJECTOR\nBenQ's W1500 Wireless HDMI Projector integrates the latest technology for one-of-a-kind, big screen, at-home entertainment enjoyment. As the world's first home projector with built in wireless features, enjoy Full HD 3D video, frame interpolation for ultra-smooth motion quality, brilliant color performance and the flexibility of placing the projector in any room, regardless of size and brightness. W1500 is able to project uncompressed FHD images from HDMI output devices (e. g. Blu-ray, DVD or AV-R player, set top boxes, games consoles) without the hassle of HDMI cables and unnecessary expenses such as wall/ceiling mount. The projector uses WHDI (Wireless Home Digital Interface). It's a wireless HDMI connection standard that uses the 5GHz radio transmission band to transfer both 2D and 3D HD video and audio, which produces the same quality a wired connection would provide. There is no latency over distances up to 20 meters (line-of-sight). You can use this projector in any room thanks to the W1500's convenient zoom. The projector can project a screen size up to 84\" from just 6 feet away, making it perfect for most media rooms, game rooms, or even a temporary outdoor theater.\n\nBUILT-IN 2 X10W BIG SPEAKERS WITH SRS WOW HD\nPlug in and play. All you need is the power cord and the connection to the video source to have theater-like entertainment. W1500 comes with two built-in 10W speakers with SRS which can save money (or extra costs) by eliminating the need for Hi-Fi or external speakers. The built-in SRS WOW HD improves compressed and uncompressed audio performances by expanding the size of the audio image and creating a deep, rich bass response. And it improves audio playback quality by delivering a dynamic 3D entertainment experience with deep, rich bass and high frequency clarity for crisp detail.\n\nBRILLIANT IMAGE PERFORMANCE WITH ZOOM, SHIFT, AND 3D FEATURES\nEquipped with the latest DLP technology, watching 3D movies directly from Blu-ray DVD or even 3D gaming just became the norm. Experience and enjoy the excitement of 3D viewing in the comfort of your home. Don't have a 3D source? 2D to 3D conversion turns typical 2D content into 3D. Enjoy the experiences of 3D without worrying about the costs and limited 3D contents. W1500's 1.6x Big Zoom feature frees up space with an impressive range of throw distances; giving you the freedom and flexibility of placing the projector anywhere without having to compromise your current decor. Lens shift offers the extra flexibility to overcome any minor miscalculations during projector installation. All you have to do is adjust the switch next to the lens to shift the projected image up by 110%-130% within the projector housing. With this helpful feature, you'll never have to worry about positioning the projector slightly out of place again.\n\nFASTER IMAGES, BETTER COLORS\nW1500 features Texas Instruments' advanced DarkChip3 DLP Technology, which projects higher brightness and deeper black levels by \"filling in\" the area where the digital micro mirror connects to its hinge--producing smooth, film-like picture quality. For optimal color precision, the W1500 is built to match one of the highest high-definition video standards seen in professional-grade home projectors today: the native Rec. 709 color gamut. This enables the projector to deliver colors so real that it reflects what the human eye perceives. The special Frame Interpolation mode minimizes the appearance of motion blur and judder to give you an ultra-smooth view of all the action--especially in fast moving scenes in movies and sports games. The Frame Interpolation technology estimates the motion changes from frame to frame and inserts an interpolated frame in-between existing frames, resulting in smoother, life-like motion quality.\n\nThe BenQ W1500 Wireless HDMI Projector with Colorific TechnologyView larger THE BENQ BENEFIT\n * Accurate. Over 1 billion colors--compared to 16.7 million from many LCD projectors\n * Crisp. Bright, high contrast picture--3x more contrast than similar top-selling LCD models\n * Long-Lasting. Consistent quality--image is the same now and years from now\n * 2200lm full HD Blu-ray 3D support\n * 5GHz wireless full HD\n * 2D to 3D conversion\n * Frame interpolation\n * 1.6x zoom with vertical lens shift\n * SmartEco technology for longer lamp life\n\nCOLORIFIC TECHNOLOGY DELIVERS LIFELIKE COLOR, YEAR AFTER YEAR\nFor radiant, life-like color, trust BenQ to deliver. From business presentations and educational venues to spectacular events and home entertainment, Colorific from BenQ is the only way to experience your projected images. BenQ projectors' DLP technology display more than one billion stunning colors, compared to only 16.7 million from many LCD projectors in the same class. Combining up to 7 different colors to create vibrant, true to life images versus traditional 3-color LCD architecture, projectors equipped with Colorific technology can deliver up to 3x more contrast than similar top-selling LCD models. Enjoy richer blacks and more luminous whites for easy to read images, with a consistent quality image--no light burn or reduction in color quality over time. Colorific images are the same now, and years from now.\n\nBenQ W Series ProjectorsW770STW1070W1080STW7000W1500Native 720p (1280 x 720)✓Native Full HD 1080p (1920 x 1080)✓✓✓✓3D Ready✓✓✓✓✓HDMI Connectivity✓✓✓✓✓Wireless Connectivity✓SmartEco Technology for up to 70% Less Power Use✓✓✓✓Short Throw for Easy Setup in Any Size Room✓✓✓ \n\nFROM THE MANUFACTURER\n\n\nThe world's first home projector with built in wireless features. View larger BIG SCREEN ENTERTAINMENT IN ANY ROOM\nBenQ's W1500 Wireless HDMI Projector integrates the latest technology for one-of-a-kind, big screen, at-home entertainment enjoyment. As the world's first home projector with built in wireless features, enjoy Full HD 3D video, frame interpolation for ultra-smooth motion quality, brilliant color performance and the flexibility of placing the projector in any room, regardless of size and brightness.\n\nProject from HDMI output devices without the hassle of HDMI cables. View larger CABLE FREE AND EASY SET UP\nWHDI uses 5GHz radio transmission band to transfer 2D and 3D video and audio\nLens shift offers extra flexibility to overcome minor miscalculations during installation WORLD'S 1ST BUILT-IN 5GHZ WIRELESS FULL HD PROJECTOR\nW1500 is able to project uncompressed FHD images from HDMI output devices (e.g. Blu-ray, DVD or AV-R player, set top boxes, games consoles) without the hassle of HDMI cables and unnecessary expenses such as wall/ceiling mount. The projector uses WHDI (Wireless Home Digital Interface). It's a wireless HDMI connection standard that uses the 5GHz radio transmission band to transfer both 2D and 3D HD video and audio, which produces the same quality a wired connection would provide. There is no latency over distances up to 20 meters (line-of-sight). \n\nSRS WOW HD expands the size of the audio image and creates a deep, rich bass response\n1.6x Big Zoom frees up space with an impressive range of throw distances. View larger BUILT-IN 2 X10W BIG SPEAKERS\nPlug and play. All you need is the power cord and the connection to the video source to have theater-like entertainment. W1500 comes with two built-in 10W speakers with SRS which can save money (or extra costs) by eliminating the need for Hi-Fi or external speakers.\n\nSRS WOW HD improves compressed and uncompressed audio performances by expanding the size of the audio image and creating a deep, rich bass response, And it improves audio playback quality by delivering a dynamic 3D entertainment experience with deep, rich bass and high frequency clarity for crisp detail.\n\nLENS SHIFT FOR EXTRA FLEXIBILITY\nLens shift offers the extra flexibility to overcome any minor miscalculations during projector installation. All you have to do is adjust the switch next to the lens to shift the projected image up by 110%-130% within the projector housing. With this helpful feature, you'll never have to worry about positioning the projector slightly out of place again.\n\nBIG ZOOM FOR OPTIMAL RANGE IN ANY SPACE\nW1500 1.6x Big Zoom feature frees up space with an impressive range of throw distances; giving you the freedom and flexibility of placing the projector anywhere without having to compromise your current decor.\n\nEASY TO MOUNT NEARLY ANYWHERE\nYou can use this projector in any room thanks to the W1500's convienent zoom. The projector can project a screen size up to 84\" from just 6 feet away, making it perfect for most media rooms, game rooms, or even a temporary outdoor theater.\n\nBRILLIANT IMAGE PERFORMANCE\n2D TO 3D CONVERSION\nTurns typical 2D content into 3D. Enjoy the experiences of 3D without worrying about the costs and limited 3D contents.\n\nBuilt with the latest DLP technology to support 3D functionality\nDarkChip3 DLP Technology for higher brightness and deeper black levels BLU-RAY FULL HD 3D SUPPORT\nEquipped with the latest DLP technology, watching 3D movies directly from Blu-ray DVD or even 3D gaming just became the norm. Experience and enjoy the excitement of 3D viewing in the comfort of your home.\n\nFRAME INTERPOLATION\nFrame interpolation minimizes the appearance of motion blur for ultra-smooth action. View larger This special mode minimizes the appearance of motion blur and judder to give you an ultra-smooth view of all the action--especially in fast moving scenes in movies and sports games. The Frame Interpolation technology estimates the motion changes from frame to frame and inserts an interpolated frame in-between existing frames, resulting in smoother, life-like motion quality.\n\nENHANCED CONTRAST PERFORMANCE\nW1500 features Texas Instruments' advanced DarkChip3 DLP Technology, which projects higher brightness and deeper black levels by \"filling in\" the area where the digital micro mirror connects to its hinge--producing smooth, film-like picture quality.\n\nBRILLIANT COLOR PERFORMANCE\nFor optimal color precision, the W1500 is built to match one of the highest high-definition video standards seen in professional-grade home projectors today: the native Rec. 709 color gamut. This enables the projector to deliver colors so real that it reflects what the human eye perceives.\n\nISFCCC CERTIFICATION\nISF Certified Calibration Controls customize the picture quality in any room, offering optimized color performance calibration in both Day and Night modes that can adapt to any room's layout, size and light levels.\n\nWORLD-LEADING SMARTECO TECHNOLOGY FOR A GREENER ENVIRONMENT\nAs the first DLP brand to incorporate Philip's ImageCare technology into its projector lamp system, BenQ has taken a leap further, developing its own SmarEco Technology to perfect what DLP can do for energy saving in the 21st century. W1500 brings together optimized lamp life with uncompromising brightness and exquisite picture quality.\n\nCHOOSE THE BENQ PROJECTOR THAT'S RIGHT FOR YOU\nW770ST W1070 W1080ST W7000 W1500 Native Resolution 720p (1280 x 720) 1080p (1920 x 1080) 1080p (1920 x 1080) 1080p (1920 x 1080) 1080p (1920 x 1080) Lumens 2500 2000 2000 2000 2200 Contrast Ratio 13000:1 10000:1 10000:1 50000:1 10000:1 Lamp Life Up to 6500 hours Up to 6000 hours Up to 6000 hours Up to 2500 hours Up to 6000 hours HDMI HDMI (v1.4a) x2 HDMI Blu-Ray HDMI Blu-Ray HDMI Wireless HDMI Throw Ratio Short Throw Normal Throw Short Throw Normal Throw Normal Throw SmartEco \nUp to 70% less power uses \nUp to 70% less power use \nUp to 70% less power use \nUp to 70% less power use Lens Shift",
    "rating": 3.7,
    "feature_bullets": [
      "W1500 features Texas Instruments' advanced DarkChip3 DLP Technology for Enhanced Contrast Performance",
      "Brilliant Color Performance by matching Rec. 709 Color Gamut",
      "Smart Eco Technology for Energy and Lamp Life Savings",
      "Built-in 2 x 10W Big Speakers",
      "SRS Wow HD"
    ],
    "specifications": {
      "Brand Name": "BenQ",
      "Item Weight": "8.6 pounds",
      "Product Dimensions": "9.8 x 13.3 x 4.7 inches",
      "Item model number": "W1500",
      "Is Discontinued By Manufacturer": "No",
      "Color Name": "White",
      "Special Features": "Speakers",
      "ASIN": "B00D7IG5KQ",
      "Customer Reviews": "3.7 out of 5 stars32 ratings3.7 out of 5 stars",
      "Best Sellers Rank": "#4,519 in Video Projectors",
      "Date First Available": "June 18, 2013"
    },
    "categories": [
      "Electronics",
      "Video Projectors"
    ],
    "price": ""
  }
}