{
  "website_summaries": [
    {
      "verdict": "This affordably priced receiver for home use is perfect for those who want to have access to satellite radio all day long.",
      "pros": [
        "Blue display is easy to read",
        "Can search what's playing on other stations while listening to the current one",
        "Capable of storing up to 10 channels for future use, and locking for mature content",
        "Access to Sirius-only content, including weather"
      ],
      "cons": [
        "Cannot be used to hook up satellite radio in a car",
        "Issues with antenna communicating with main unit",
        "Subscription sold separately"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This DOES NOT include a free month!",
      "text": "This is a SCAM! The title says ONE MONTH FREE but when I got on chat with Sirius XM the person said this radio does not qualify for the one free month and I would need to purchase a $15 a month plan. I will send this back. And contact Amazon about the misleading description.",
      "rating": 1.0,
      "verified": true,
      "author": "Kansas Guy",
      "helpful_votes": 2,
      "publication_date": 20180324
    },
    {
      "title": "Inexpensive Portable-Capable SiriusXM",
      "text": "For an inexpensive unit, it works well. It took a lot of research and trial and error to get it to work with USB power, but you can do it. So, it is a cheap way to go for a portable unit. You have to use the CableDeconn USB A to DC 3.5 mm/1.35 mm 5 Volt DC cable to make it USB portable. The antenna that was provided is not very good. I bought another antenna to improve its portability while leaving the rather long cord coiled up. The provided antenna needs to be fully extended to work reliably.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul Tower",
      "helpful_votes": 0,
      "publication_date": 20170216
    },
    {
      "title": "Can't live without it now",
      "text": "If you hate commercials, get Sirius. Thats the honest reason I got it, period. I hate commercials. Sirius gives me commercial free music, and the music is the latest and greatest. If you are in the midwest you will be shocked to find out how many great artists there are as most of the XM stations play well beyond the top 40 lists local radio normally plays. Between the music and the sports, I won't be going without Sirius XM. Regular radio just sucks by comparison now.",
      "rating": 5.0,
      "verified": true,
      "author": "Konquererz",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Free subscription 😂😂😂😂",
      "text": "Great radio for 28.90. Only gave 3 stars and not 5 because it comes with a 1 month free service and to get that free month is a joke. Sirius xm should be a lot easier to deal with. Have been a member for 5 years and this is terrible. Called the number and the girl told me I had to call a different number and no matter how many times you call that number and get a different person they all say the same thing that they can't activate it. It is a different department. You will here 1 855 312 8071 from every person you talk too.",
      "rating": 3.0,
      "verified": true,
      "author": "Jonathan Welchko",
      "helpful_votes": 2,
      "publication_date": 20180406
    },
    {
      "title": "Seems to have better audio quality than the older model as well as ...",
      "text": "Bought this as a replacement for a failing Onxy radio from 2011. Works well, unfortunately Sirius charges you 15 dollars to activate a replacement radio but hey want can you do. Seems to have better audio quality than the older model as well as far superior mounting options.",
      "rating": 4.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Junk service,",
      "text": "I had been put on hold for over an hour, they told me they didnt have to honor the deal as advertised on amazon. It was sold as a month of service free with purchase of the receiver, they tell me for a 3 month purchase I'd get 4. After being transferred 4 times I realized it was garbage and NO I didnt want want it in my car.",
      "rating": 1.0,
      "verified": true,
      "author": "Roman",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Wonderful radio, a great purchase.",
      "text": "This is my first Sirius XM radio. It works flawlessly and Sirius XM is awesome. I also bought the portable speaker dock with the big subwoofer. I listen to the 60's on Six channel a lot. Also Fox News and Patriot channels. I don't have TV so this is my main source of entertainment. I can't recommend it highly enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Dupre",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "This was a terrible radio. Don't waste your time in buying this ...",
      "text": "I bought this radio for my husband as a gift in November 2017. It stopped working in January 2018. This was a terrible radio. Don't waste your time in buying this worthless radio.",
      "rating": 1.0,
      "verified": true,
      "author": "JACQUELINE D.",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "this is our replacement for an ancient Delphi we have ...",
      "text": "this is our replacement for an ancient Delphi we have had for almost 20 years. The quality is much clearer than the old unit. The only downfall I see is how small the window for readout is. My old eyes don't see as well as they did and perhaps the window could be a tad larger or perhaps be able to make the words larger. But that is a manufacturing issue not an issue with the quality of the unit.",
      "rating": 4.0,
      "verified": true,
      "author": "D. R. Kneeland",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Joy!",
      "text": "Gift for boyfriend, whose old one broke some months ago. He loves it. Fits in the old home-kit dock, and comes with a vehicle kit. Knowing nothing about it, I was taking a chance but this one seemed to have good features. The price was so much less than a nationally known chain that I was concerned. No need! Great quality, sophisticated features such as being able to type in a channel number that you want rather than scroll to it like the old one. Nice big screen, easy to read. Amazing price. Easy to use. Very very happy birthday gift. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Eileen Mary",
      "helpful_votes": 0,
      "publication_date": 20140630
    },
    {
      "title": "Second time may work",
      "text": "This unit had to be replaced because it would not maintain a constant signal. The replacement is working better.",
      "rating": 2.0,
      "verified": true,
      "author": "Konrad Kuczak",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Cant beat it for the price",
      "text": "My new car didn't have the Sirius package but I drive a lot so this was a must! For $15, can't beat it. Quick and easy to install. Didn't have it installed into system bc it would void my warranty but works great installed following the directions. No issues with sound, just need a way to hide the wires better.",
      "rating": 5.0,
      "verified": true,
      "author": "michixo",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Great Buy",
      "text": "I use this Serius XM radio to provide audio stereo to an external FM (low power) transmitter at home. That allows me to hear satellite channels throughout the residential property. This radio replaced and early model \"XM\" radio in use that lasted for years. Five stars for this unit that came with the \"Home Kit\" which included all I needed to accomplish coverage to every location at my home.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Sutton",
      "helpful_votes": 0,
      "publication_date": 20150120
    },
    {
      "title": "Thrilled",
      "text": "I am so thankful to have found this. My refurbished radio I bought from Sirius died in two months. The home kit in this package is perfect for my desk or living room. I bought desk speakers from Sam's Club that keep this easy to use and move from room to room.",
      "rating": 5.0,
      "verified": true,
      "author": "Nana_mcrae",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Much better than my older Roady XM",
      "text": "This replaced an older Roady XM I have been using for several years. It's much more sensitive and user friendly. I get coverage in areas where the old Roady lost the satellite signal. I was even able to use the old Roady antenna and power supply already installed in my car. It's nice to get a complete readout of the artist and song title, although the song title display is quite small. If you like XM, this is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "James A.",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Back cord keeps disconnecting so I hear static every 10 ...",
      "text": "Back cord keeps disconnecting so I hear static every 10 seconds unless I hold the cord in place while I DRIVE !",
      "rating": 1.0,
      "verified": true,
      "author": "matthew j kocourek",
      "helpful_votes": 6,
      "publication_date": 20141129
    },
    {
      "title": "Sketchy signal/wires everywhere. Fix the hit or miss signal to get 5 stars.",
      "text": "Everything is working fine. I just wished their was a Bluetooth model that wouldn't require so many wires. It looks like a spiders nest with wires hanging everywhere. Also, if I am driving North with the Satellite on my dash, it cuts out a lot.",
      "rating": 3.0,
      "verified": true,
      "author": "Chris Wymer",
      "helpful_votes": 2,
      "publication_date": 20150713
    },
    {
      "title": "SeriusXM and Amazon cheet you",
      "text": "What they don't tell you is that if you don't choose the most expensive listening package you do NOT get any of your signals in STEREO, only in mono. I spent a lot of time trying to find out why my receiver was not in stereo only to find out from one of their foreign phone talkers this fact. They then wanted me to spend more money to fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Great entry level device",
      "text": "This works exactly as advertised, has a nice long cord to run the receiver outside the car onto the roof, has a lot of preset buttons and browsing is easy. The power cable seems to be touchy, if I tap the part plugged into my car lighter port the device will power off, a little wiggle will get the device to turn back on. Probably just a bad cord but it's enough to keep me from a 5 star review.",
      "rating": 4.0,
      "verified": true,
      "author": "GeMan",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Listen to the radio",
      "text": "My husband is a truck driver and uses this radio on a nightly basis not only for entertainment but as an aid to keep him company and awake. It has clear channels and the display is easy to read. It is easy to use while driving. It is convenient for you to mount and unmount it because he has to remove it at the end of every shift. It was resonantly priced as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin L Conn",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Great buy!",
      "text": "Love it! My new car didn't come with XM so I had to get this, the only thing I don't like is the big circle thing that your supposed to stick something to, but other than it, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Commercial-free radio at it's BEST!!",
      "text": "Perfect! I've had XM in my truck since the second year XM was is business.......there have been ups and downs with programming........now, I have XM for my back-yard music system. Everything went as planned; PERFECT!! Thank you, XM!",
      "rating": 5.0,
      "verified": true,
      "author": "CR Mainwearing",
      "helpful_votes": 0,
      "publication_date": 20160706
    },
    {
      "title": "This item needs to be clearer about being XM or Sirius!",
      "text": "Everywhere I looked in the ad for this item it said that it was a Sirius radio. However when I received the item it turned out to be a XM radio. Instead of sending it back I installed it. It works fine and is a decent looking item, but the BS that I had to go through between Sirius and XM almost made the item not worth the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Scott Warthen",
      "helpful_votes": 3,
      "publication_date": 20150517
    },
    {
      "title": "Happy with purchase",
      "text": "The radio was new. But the packaging had a hole in it. The tape was yellowed.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Works great.",
      "text": "Really easy to set up. Transferring an existing account to this receiver cost's about $18. So to transfer my wife's account to this for the summer is $36 out and back in. Will probably just leave the account with this device so we can use it in either vehicle without an additional charge.",
      "rating": 5.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "I hate commercials.",
      "text": "I was super tired of hearing the same commercials so I bought this guy and now I pay $10 a month for its services. First off installation depends on what radio receiver you have. You need an AUX input to own this guy. The mounting brackets are good too, Sirius gives you two options for mounting. Install took me about 15 Mins because I didn't know where i wanted to put the magnet antenna. The device itself is super easy to use and you can easily change stations or add to favorites. For the Station selection and no commercials its totally worth 10 bucks a month.",
      "rating": 4.0,
      "verified": true,
      "author": "Dobie, the free elf",
      "helpful_votes": 0,
      "publication_date": 20140513
    },
    {
      "title": "Great product",
      "text": "You get what you pay for...and more in my opinion. Best bet though if your gonna rock this radio id advise against the fm modulator. I wound up spending $190 bucks to add Aux In to my stock radio and it sounds great! Happy buyer Update: Almost 2 years later and still a happy camper!",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 3,
      "publication_date": 20140124
    },
    {
      "title": "Was disappointed that Sirius charged me a $75 transfer activation fee ...",
      "text": "I bought this to replace an old Sirius Sportster that stopped working and have a lifetime subscription with Sirius. Was disappointed that Sirius charged me a $75 transfer activation fee and informed me I only have one other transfer activation allowed on my \"lifetime subscription.\" I hope this one doesnt break anytime soon:)",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Betz",
      "helpful_votes": 0,
      "publication_date": 20150611
    },
    {
      "title": "Worth Every Dollar!!!",
      "text": "LOVE this unit. The ease of use is phenomenal. It was simple to mount, easy to activate and streams like a champ. My only negative about this radio it the severe interference I got when using the radio transmission feature causing me to have to go buy a long AUX cable to tie it in directly. I tried all the fixes Sirius suggests and even some that I found online without success. Definitely a great buy for $50!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20141107
    },
    {
      "title": "This radio was so easy to install",
      "text": "This radio was so easy to install. I had it installed and authorized and working perfectly in 30 min and that included talking to the Sirious/xm rep. As for the 30 trial and free activation, they were more than happy to accomodate me. This is a great little radio for cars that don't have one.",
      "rating": 5.0,
      "verified": true,
      "author": "e jackett",
      "helpful_votes": 0,
      "publication_date": 20180323
    },
    {
      "title": "Great for the price point.",
      "text": "I have this little radio in my beater car coupled with the monthly 9.99 subscription from XM. This little guy is great. It is portable and can link through any radio. There is also a dock that sells with it. It makes driving in my beater durring the winter months when my mustang is put away more bearable. Great little unit for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Tilda Swan",
      "helpful_votes": 0,
      "publication_date": 20141121
    },
    {
      "title": "It’s good enough",
      "text": "Works great unless it moves then the sound port cuts in and out but with that said my mother loves it in her car!",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua Pennington",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "I just needed a car kit, but this was cheaper.",
      "text": "I was looking for a vehicle installation kit to use my existing Onyx EZ in a second car. Buying it with the new radio was cheaper than buying it without for some reason. I will use the docking station and put the radio part away for the day when my existing one may fail.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce K",
      "helpful_votes": 0,
      "publication_date": 20150907
    },
    {
      "title": "Two Stars",
      "text": "nog easy to use so get dash one for vehicle",
      "rating": 2.0,
      "verified": true,
      "author": "george",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "The antenna connection is touchy. As well the connection ...",
      "text": "The antenna connection is touchy. As well the connection between the tuner and its base is touchy and can cause audio issues. It doesn't happen that often but it does happen. Overall it's a decent unit.",
      "rating": 4.0,
      "verified": true,
      "author": "aronf_53",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Great buy!",
      "text": "The price is right. I've had Sirius Radio for years, and the same radio too. It was time for an upgrade. This was a good choice. I also got the portable speaker dock for it too, the smaller of them. Sounds really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160809
    },
    {
      "title": "like we did",
      "text": "Basic model but packaged economically with all you need. Keep in mind that you'll have to pay for an add-on unit if you started with a unit in your car, like we did. Pretty much all you need without the frills, and much cheaper than buying all the parts piecemeal.",
      "rating": 5.0,
      "verified": true,
      "author": "MThings",
      "helpful_votes": 0,
      "publication_date": 20160704
    },
    {
      "title": "great and works but the clips that hold it into ...",
      "text": "great and works but the clips that hold it into the dash vents broke easily and we have it kind of wedged in and balanced. not an ideal mount.",
      "rating": 3.0,
      "verified": true,
      "author": "Realtor Mike",
      "helpful_votes": 0,
      "publication_date": 20150806
    },
    {
      "title": "very nice product, my husband uses it all day as ...",
      "text": "this is my 2nd one, very nice product, my husband uses it all day as he drives truck, however the boost box set for the home does not work as well. very poor reception.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Ann",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Highly Recommend",
      "text": "This is an awesome deal. Installation is extremely simple, looks great, sounds great, operation is extremely easy. Comes with everything you need. This is definitely the most affordable way to get Sirius/XM in your vehicle for cheap!",
      "rating": 5.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "I bought this for a gift to my Dad. ...",
      "text": "I bought this for a gift to my Dad. Come to find out, sirius provides the radio free with the home subscription. It's okay. I've got one now too.",
      "rating": 5.0,
      "verified": true,
      "author": "jillz",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "Sat Radio",
      "text": "If your new to satellite radio, this product is an inexpensive way to check it out.",
      "rating": 4.0,
      "verified": true,
      "author": "Wayne Alexander",
      "helpful_votes": 0,
      "publication_date": 20170203
    },
    {
      "title": "Nice basic radio",
      "text": "Basic, but does the job. No issues. Cost was exceptional and impressive.",
      "rating": 5.0,
      "verified": true,
      "author": "Vis Major",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Not As Advertised",
      "text": "Product arrived in plastic bag, no vehicle kit as initial advertising",
      "rating": 1.0,
      "verified": true,
      "author": "goodforme76",
      "helpful_votes": 0,
      "publication_date": 20190428
    },
    {
      "title": "durable",
      "text": "Ive had it in my semi truck for two years,...no problems",
      "rating": 5.0,
      "verified": true,
      "author": "ed stickler",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Easy to use and install",
      "text": "The unit itself is great and easy to use - was frustrated that we had to sign up for XM monthly rate vs Sirius monthly rate - the XM is $7 more per month - why? I wish I knew the answer to that....since XM and Sirius are the same company now.",
      "rating": 4.0,
      "verified": true,
      "author": "Lisa F",
      "helpful_votes": 0,
      "publication_date": 20150911
    },
    {
      "title": "Got this as a replacement for one that for stolen ...",
      "text": "Got this as a replacement for one that for stolen. It doesn't have as many presets as my old one. If 10 stations aren't enough for you then look for a different one.",
      "rating": 3.0,
      "verified": true,
      "author": "Rebecca M",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Wonderful product and easy to install",
      "text": "Use every single day. Wonderful product and easy to install. I bought two.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "This item does not work. After installing the radio ...",
      "text": "This item does not work. After installing the radio as directed, and after moving the antenna to several different locations, the message on the screen still is: \"antenna unattached or defective\". I know that the antenna is attached, so that leaves DEFECTIVE. I am trying to navigate Amazon.com/returns, but that is not working either.",
      "rating": 1.0,
      "verified": true,
      "author": "Dennis Higgins",
      "helpful_votes": 6,
      "publication_date": 20141009
    },
    {
      "title": "ridiculous anteana routing under windshield gasket recommend! numerous returns",
      "text": "defective radio, ridiculous anteana routing under windshield gasket recommend! numerous returns, all with the same dismal results. Sirius radio people impossible to deal with-long hold times,speaking with up to 7 \"customer care\" people,being transfered to the wrong department constantly,even was hung up on! website totally useless.",
      "rating": 1.0,
      "verified": true,
      "author": "collette fortin",
      "helpful_votes": 2,
      "publication_date": 20150507
    },
    {
      "title": "Its okay. But even with the screen at its ...",
      "text": "Its okay. But even with the screen at its lowest brightness, its still bright. I wish there was a function where you could turn the screen off completely, but it would still play music.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Krause",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "I received an Amazon gift card for my bday & guess what I found on good ole Amazon",
      "text": "My car had recently been totaled out so I was forced to go purchase a new car. Of course I wanted it to be fully loaded but my budget said otherwise, lol! I wanted to have SiriusXM radio! Soooooo I did some browsing & found out I could have 1 installed! Yayyyy! I received an Amazon gift card for my bday & guess what I found on good ole Amazon! LOLOL! & I LOVE my SiriusXM Satellite Radio! Work great for me! My next purchase will be the Dock Station for it ;-)",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "It was a great radio. I returned it bc I got it ...",
      "text": "It was a great radio. I returned it bc I got it for free with a mail in rebate of 70$ Had I kept it, I'm sure it would have been fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom from Tn",
      "helpful_votes": 0,
      "publication_date": 20160818
    },
    {
      "title": "Four Stars",
      "text": "solid satellite radio everything you need to get up and running for your car",
      "rating": 4.0,
      "verified": true,
      "author": "Steven Garafalo",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Not Recommended",
      "text": "After trying in several different locations per instructions, this particular product is horrible.",
      "rating": 1.0,
      "verified": true,
      "author": "Enigma1311",
      "helpful_votes": 0,
      "publication_date": 20170601
    },
    {
      "title": "Christmas gift for my son. Already installed and enjoying ...",
      "text": "Christmas gift for my son. Already installed and enjoying it. Item as described and shipping was fast.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Simpson",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "This kit comes with everything you need to start listening ...",
      "text": "This kit comes with everything you need to start listening to sirius xm. Dash kit, etc.... All you need to do is pay the fee and start listening.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Gray",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Great Radio",
      "text": "Bought this for my grandparents. They love it. Satellite signal is not the greatest during cloudy days, even with the receiver up on the roof, but most days it works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Becca",
      "helpful_votes": 0,
      "publication_date": 20160201
    },
    {
      "title": "Good Radio for the Price",
      "text": "Replaced a much older radio. This one has similar basic features but much better reception. Would buy again on Amazon, especially since it was half the price offered by SiriusXm.",
      "rating": 5.0,
      "verified": true,
      "author": "SMW48",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "It is very easy to set up",
      "text": "Everything is working well with the radio. It is very easy to set up, I'm not crazy about the clip mount that you attach to the vent because of all the wires hanging. Other than that, I am very please with the radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela V",
      "helpful_votes": 0,
      "publication_date": 20151206
    },
    {
      "title": "Love XM bought this to replace my XM to go ...",
      "text": "Love XM bought this to replace my XM to go radio. This works well in both the car and at home. Just need a power adapter for the house radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Norm B.",
      "helpful_votes": 0,
      "publication_date": 20160727
    },
    {
      "title": "great buy",
      "text": "Love this radio, I am a 40 something woman and was able to install by myself in about 10 minutes",
      "rating": 5.0,
      "verified": true,
      "author": "Trish",
      "helpful_votes": 0,
      "publication_date": 20170328
    },
    {
      "title": "Quick and Easy",
      "text": "I purchased a life time subscription for Sirius back in 2008 when they were having a difficult time (along with everyone else). I purchased 3 of these kits so I can use the radio in my camper, boat and second car. Easy to install and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "Five Stars",
      "text": "Couldn't get any better! now i have XM radio coming through my Bose Acoustic Wave! Sounds so good",
      "rating": 5.0,
      "verified": true,
      "author": "Robert DeHay",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Good Radio, sometimes difficult tuning",
      "text": "Good radio, but if you listen to a wide variety of stations (Too many for the presets), you have to press the direct tune button, and quickly get the numbers entered before it reverts back to preset mode, which means extra concentration. Not wise if you're driving...",
      "rating": 3.0,
      "verified": true,
      "author": "Howard Golden Jr.",
      "helpful_votes": 0,
      "publication_date": 20140208
    },
    {
      "title": "my son had it done in 15 seconds.reps not knowledgeable",
      "text": "Xm works great. However I was on the phone for one hour I talked to four people and they could not tell me how to connect through an FM station on my radio. my son had it done in 15 seconds.",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "Works as advertised, very happy with it",
      "text": "Works as advertised, very happy with it. We use it in a 2010 Honda Civic EX, to get Sirius radio. Surprisingly, there was no satellite radio in this car. This was an excellent solution though.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul A. Lysiak",
      "helpful_votes": 0,
      "publication_date": 20141030
    },
    {
      "title": "Everything has worked great so far",
      "text": "Already had Satellite Radio, wanted to have it in my company and personal truck without moving a lot of stuff around. Ordering this second set was cheaper than just a vehicle kit alone. It did not come with the small disc to mount the sticky pad too on your dash, but I mounted this with small screws into the dash in a small unused hole beside the radio. Everything has worked great so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh Powell",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "XM/Sirius value portable receiver",
      "text": "Excellent value, XM/Sirius portable radio. Small (small controls for small hands), large display for form size, easy to read, good features.",
      "rating": 4.0,
      "verified": true,
      "author": "Butch",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "EZ satelite radio",
      "text": "I'm assuming it's okay ... bought it for a gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Bossy",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Nice portable unit",
      "text": "The unit appeared to be larger in the picture than it actually is. The buttons are hard to push. It works well for what I wanted. The vent mount is kind of wobbly.",
      "rating": 4.0,
      "verified": true,
      "author": "MadisonF",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "Great price and works great",
      "text": "Great price and works great, I got this as a backup to the radio I already have, and it was cheaper then another car kit.",
      "rating": 5.0,
      "verified": true,
      "author": "My65442",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "but like it otherwise",
      "text": "wish it had a pause/ rewind button to go back if I missed something, but like it otherwise.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "Missing parts",
      "text": "The delivery was super fast. I appreciate that. However, the dock and power, etc. were all missing. Had to return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Poor signal strength",
      "text": "Setup is confusing, quality of sound is comparable to a portable bluetooth speaker. Poor signal strength.",
      "rating": 2.0,
      "verified": true,
      "author": "Melissa Renee",
      "helpful_votes": 0,
      "publication_date": 20160606
    },
    {
      "title": "A sound birthday gift!",
      "text": "I got this for my mom's birthday. The one she had became stuck on one channel and so she had been hinting that she would like a replacement. After getting the new one set up in her car, she's now noting her favorite stations again.",
      "rating": 4.0,
      "verified": true,
      "author": "fitnessdragon",
      "helpful_votes": 0,
      "publication_date": 20160509
    },
    {
      "title": "This radio has been a great addition in my truck for those long rides",
      "text": "This radio has been a great addition in my truck for those long rides. It was very simple to install at a great price. I actually use another Onyx radio so I have a backup in case I need it.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Smith",
      "helpful_votes": 0,
      "publication_date": 20151201
    },
    {
      "title": "Excellent piece. Had one previously but lost it moving",
      "text": "Excellent piece. Had one previously but lost it moving. When you live in a rural area without great local stations, and your car is older than the factor installed satellite radios, this is a gift from God!",
      "rating": 5.0,
      "verified": true,
      "author": "gmarietatum",
      "helpful_votes": 0,
      "publication_date": 20160616
    },
    {
      "title": "Disappointed in the lack of signal strength in the area ...",
      "text": "Disappointed in the lack of signal strength in the area where I wanted to use it. Also did not like the fact it does not come with speakers and it was not obvious from the online description.",
      "rating": 2.0,
      "verified": true,
      "author": "Basil C.",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "It works good. I live in a rural area so when ...",
      "text": "I gave it four stars. It works good. I live in a rural area so when you pass under a tree while driving it cuts out. Other than that good for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Product Cop 58",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Stop Thinking, GET IT!",
      "text": "I love my XM Radio, it took me a minute to set up the antenna other than that. Once I got my subscription, I wondered how I ever lived without this during the NFL Season.",
      "rating": 4.0,
      "verified": true,
      "author": "Tavis",
      "helpful_votes": 0,
      "publication_date": 20141223
    },
    {
      "title": "... this in my office for the employees not stop good music and it plays all digital music from any ...",
      "text": "I use this in my office for the employees not stop good music and it plays all digital music from any source you can imagine and can get weather if you wish top use that feature.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan P.",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Perfect!!!",
      "text": "Bought it for my son n law... He is an over the road truck driver... Very easy installation in his truck!",
      "rating": 5.0,
      "verified": true,
      "author": "Karefull13",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "Music to our ears!",
      "text": "This is a replacement radio from one that was stolen when my husband's vehicle was broken into. What can I say....without our Sirius/XM radio we would be very unhappy!",
      "rating": 5.0,
      "verified": true,
      "author": "K. Graff",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "best to buy an adapter for you want have problems ...",
      "text": "product has issue with antenna, best to buy an adapter for you want have problems in near future",
      "rating": 1.0,
      "verified": true,
      "author": "WilliamTimberlake",
      "helpful_votes": 0,
      "publication_date": 20170202
    },
    {
      "title": "Five Stars",
      "text": "Works great easy install if you have a auxiliary input.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry E Adams",
      "helpful_votes": 0,
      "publication_date": 20160619
    },
    {
      "title": "I have the Sportster 5 radio and I bought this ...",
      "text": "I have the Sportster 5 radio and I bought this item for the vehicle install kit and to have an extra radio. The cradle that came with the Vehicle kit will not fit the Sportster 5 and now I have to buy a separate power cable and cradle to use the Sportster 5.",
      "rating": 3.0,
      "verified": true,
      "author": "Benjamin I.",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Okay but has problems...",
      "text": "Several issues with this product: 1)..Screen is MUCH too bright at night. It needs either a dimming option or offer a 'night' option that darkens the screen. 2)..Antenna connector fails regularly. Especially if this device is mounted on a vent. When mounted on a vent that blows really cold A/C, the antenna connection constantly drops. Serious problem with the connection design. 3)..Channel memory preset buttons must have been tested with mice because that's about the only finger small enough to press one. Buttons are too small for humans. This desperately needs to be redesigned.",
      "rating": 3.0,
      "verified": true,
      "author": "Kelly Shipp",
      "helpful_votes": 2,
      "publication_date": 20151018
    },
    {
      "title": "Not super flashy, but it does what I need it ...",
      "text": "For 20 bucks you can't go wrong. I spend 10-12 hours a day in the car for work, and listening to the same songs over and over again was putting me to sleep. Not super flashy, but it does what I need it to do. Install took about 45 mins (I pulled my dash apart to hide the wires better) Only issue I had was that the adhesive for the mount was not strong enough to hold up the radio, so I used double sided tape. overall I'm happy so far",
      "rating": 4.0,
      "verified": true,
      "author": "Jazzy and Chester",
      "helpful_votes": 10,
      "publication_date": 20160507
    },
    {
      "title": "rec",
      "text": "This product was delivered in two days as promised and well packed. This is my third radio of this style and I highly recommend this product as I have experienced many problem free hours listening daily (in-home, car, and man-cave).",
      "rating": 5.0,
      "verified": true,
      "author": "Blade81",
      "helpful_votes": 0,
      "publication_date": 20161103
    },
    {
      "title": "It works. Feels cheap.",
      "text": "It works. But, I have my doubts about its longevity. It feels cheap,",
      "rating": 3.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Music Junkie Love",
      "text": "love it ... I could have gotten it tree with Sirius !",
      "rating": 5.0,
      "verified": true,
      "author": "icecream16",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Fabulous Buy",
      "text": "Great radio. Love that I can transfer between vehicles; thereby saving me money on my subscription! Highly recommend this purchase",
      "rating": 5.0,
      "verified": true,
      "author": "A. Hart",
      "helpful_votes": 0,
      "publication_date": 20140116
    },
    {
      "title": "Sirius Satellite Radio",
      "text": "The installation instructions was very easy to follow, was what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Laquetta Joe",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Works good. Easy to install if you have an aux ...",
      "text": "Works good. Easy to install if you have an aux input on your radio. Works when driving on the highway even if you keep the antenna inside the car as long as you mount it near the rear deck. Having to toggle one channel at a time is kind of a pain, but it has buttons for saving favorite channels.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob T",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "awesome",
      "text": "love it bought a returned one for under 20 bucks works great for me i love my xm/sirius",
      "rating": 5.0,
      "verified": true,
      "author": "daniel cambria",
      "helpful_votes": 0,
      "publication_date": 20160319
    },
    {
      "title": "Good so far",
      "text": "Just got it today, and got it early! Everything worked as expected and easy to install,I'll give a full review in a few months.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "This was affordable and worked nicely, with my old school audio system",
      "text": "I purchased this to replaced my dead roadyxt radio. It's much bigger than I expected but I'll get used to it. Still working out some of the features . This was affordable and worked nicely, with my old school audio system.",
      "rating": 5.0,
      "verified": true,
      "author": "Roshshonna L. Ridout",
      "helpful_votes": 0,
      "publication_date": 20141221
    },
    {
      "title": "Five Stars",
      "text": "very happy, exactly what my father-in-law wanted so I'm glad for the purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Jenny Muntz",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "It works fine",
      "text": "I bought this to replace one just like it that was hit by lightening. It works very well. Actually, the remote control works better than the original even though they are identical.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark W.",
      "helpful_votes": 0,
      "publication_date": 20170228
    }
  ],
  "product_meta": {
    "title": "SiriusXM- XEZ1H1 Onyx EZ Satellite Radio with Home Kit- Black",
    "description": "Style:Onyx EZ w/ Home Kit| Product Packaging:Standard PackagingYou don't need bells & whistles to bring your drive alive. The Onyx EZ makes satellite radio simple to install, use and enjoy so you can focus on the best part -listening.",
    "rating": 4.3,
    "feature_bullets": [
      "Enjoy SiriusXM at home or in the office.",
      "Easy-to-read blue display allows you to view artist name, song or program title and channel information at the same time.",
      "Browse what's playing on other channels while listening to the current one, Store up to 10 of your favorite channels for one-touch access.",
      "Easily lock and unlock channels with mature content.",
      "One-Touch Jump to traffic and weather for the city of your choice, or back to your previous channel.",
      "Hear exclusive entertainment only available on SiriusXM like Howard Stern, Today Show Radio, Fox News, CNN and Kidz Bop Radio. Plus live play-by-play sports from the NFL, MLB, NBA, NHL, the best games in college sports and NASCAR races.",
      "Hear dedicated channels from your favorite artists like Elvis Radio, Eminem’s Shade 45, Pearl Jam Radio, Kenny Chesney’s No Shoes Radio, Pitbull’s Globalization, Bruce Springsteen E Street Radio, Tom Petty Radio and Jimmy Buffet’s Margaritaville.",
      "Take your radio with you in your car or on the go with accessories like the SXDV3 car kit or SXSD2 portable speaker dock (each sold separately)."
    ],
    "specifications": {
      "Item Weight": "3.4 ounces",
      "Product Dimensions": "4.5 x 0.7 x 2.4 inches",
      "Item model number": "XEZ1H1",
      "Batteries": "1 Lithium ion batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Display Type": "LCD",
      "Warranty": "90 days",
      "Weight": "4.4 Pounds",
      "ASIN": "B00DESFHX0",
      "Customer Reviews": "4.3 out of 5 stars923 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#95,351 in Electronics",
      "Date First Available": "September 30, 2013"
    },
    "categories": [
      "Satellite Radio",
      "Car Audio",
      "Electronics",
      "Car & Vehicle Electronics",
      "Car Electronics"
    ],
    "price": 50.25
  }
}