{
  "website_summaries": [
    {
      "verdict": "You're unlikely to find another pillow that offers this amount of support at such a reasonable price.",
      "pros": [
        "An affordable choice that offers comfort and support all the way through pregnancy",
        "Cover is 100% cotton"
      ],
      "cons": [
        "Not as well-stuffed as some similar pillows, but some people find a flatter pillow more comfortable, anyway"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Flat",
      "text": "I am pregnant with twins and wanted nothing but comfort. I researched and purchased this pillow because of the reviews, when I received it and I was very disappointed the pillow never inflated and is completely flat cant be more then 1 1/2 to 2 inches thick at most. Very disheartening.",
      "rating": 1.0,
      "verified": true,
      "author": "Brooklynn Harrigan",
      "helpful_votes": 130,
      "publication_date": 20180901
    },
    {
      "title": "This pillow is wonderful. It allows me to sit in the living ...",
      "text": "I bought this because I have fibromyalogia. I have trouble sitting on the couch for too long. This pillow is wonderful. It allows me to sit in the living room for much longer. Also, I am a side sleeper and this really helps with pain on my hip. I have wanted to buy one of this for a long time and am very happy with the packaging, delivery and quality of the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Thatgirl",
      "helpful_votes": 49,
      "publication_date": 20170708
    },
    {
      "title": "4 out of 5 stars! GREAT PRODUCT, JUST TOO FLAT!!",
      "text": "I bought this pillow for my wife, and last night was her first time sleeping with it. Although I complained about it being flat, she said this morning that she hasn't slept that well in a long time. So I guess I'll get an A+ for thinking of getting her one.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 171,
      "publication_date": 20160722
    },
    {
      "title": "Not as supporting as thought, and it’s noisy",
      "text": "I had a pregnancy pillow with my first two and loved it, wore it out. This pregnancy I needed a new one, this one looked great, however, there isn’t near enough support between my legs, i have fluffed and fluffed this pillow but it just goes flat too easy and my knees touch through the pillow. Also every time I move it is so noisy, like I’m rubbing paper together or something! I have a nice Jersey cover for it but this pillow just isn’t right for me. Wish i could return it. :(",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley N.",
      "helpful_votes": 38,
      "publication_date": 20171213
    },
    {
      "title": "Not as thick as pictured.",
      "text": "This is totally not what is pictured. The picture shows it is 7 inches thick and I can say it was at most 2.5 inches. If you want a really flat pillow then this is for you. I didn’t even find it to look comfortable so I returned it. Didn’t even use it but can imagine it would not bring much comfort.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20190323
    },
    {
      "title": "Buyers Beware. Super thin pillow.",
      "text": "Very upset with this pillow. Very thin!!! My dogs bed is thicker then this waste of money. Do your research first. Bought this for my pregnant wife to surprise since shes been asking for one and boy did this upset her. Not comfortable at all, especially when it's under 2 inches think!!",
      "rating": 1.0,
      "verified": true,
      "author": "Max V.",
      "helpful_votes": 12,
      "publication_date": 20180724
    },
    {
      "title": "I love this pillow!",
      "text": "I ordered the C shaped one the first time, and I did not like it at all. It was too full, too hard, too hot, and just plain uncomfortable. This one is perfect. It's flexible, but not flimsy. It's perfect for laying my 7 months pregnant belly on, and getting the support I need. It's not hot, it's not hard, and it's not too full. Even my husband snuggled up to one side of it. My son is already asking for me to order one for him too, which I will be doing soon. I would absolutely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle S",
      "helpful_votes": 4,
      "publication_date": 20180111
    },
    {
      "title": "Don’t waste your money!!!!",
      "text": "I’m 31 weeks pregnant. I spent $40 on this pillow and it is flat! It’s not the fluffy, supportive material I expected and it’s not soft at all! So disappointed!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Kristen McInturff",
      "helpful_votes": 6,
      "publication_date": 20180105
    },
    {
      "title": "Picture differs than what received",
      "text": "The pictures show this big fluffy pillow. I received a very limp, lifeless pillow. Very disappointed. Putting it in the drier since it was vacuum-sealed for delivery on air fluff has not helped... Have had it for a few weeks and I prefer to use 3 or 4 separate pillows over this one pillow. If you like non-fluffy pillows, this is for you!",
      "rating": 2.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 5,
      "publication_date": 20180730
    },
    {
      "title": "It's huge!",
      "text": "I got this pillow to help me sleep in my side. The first night I used it I had pretty bad neck pain, but I used an extra pillow to prop myself up and it fixed that. It is comfy to use when on my side, but it doesn't cocoon the body. I usually end up on my back, but since I'm propped up it's not a big deal. The one thing I don't like is how rough the fabric is. I washed it, but it still wasn't very soft, but still kind of itchy. It will work for this pregnancy, but I'd look for a better one at a place like motherhood maternity or another maternity store.",
      "rating": 3.0,
      "verified": true,
      "author": "Elle_C",
      "helpful_votes": 2,
      "publication_date": 20180916
    },
    {
      "title": "I'm pretty sure this got me at least 42 bonus points ...",
      "text": "I'm pretty sure this got me at least 42 bonus points with my pregnant wife. This definitely made sleeping with her new add-on much easier from weeks 24-39. She told me multiple times this was one of the best things ever invented. She is still using it as it helps support and position correctly for nursing. Full disclosure, we have a King bed and any bed smaller than a Queen would probably be difficult to fit two people and this pillow, but your mileage may vary. If in doubt, get this for your pregnant wife and hopefully get some bonus points too. Don't worry, it's just a pillow, doesn't mean she doesn't love you anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "Grant",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "I thought this was going to be easy to sleep with but unfortunately I'm having a hard ...",
      "text": "I thought this was going to be easy to sleep with but unfortunately I'm having a hard time getting comfortable with it. It's obviously very large. It doesn't contain a lot of stuffing which is great. I'm a very warm person and over heat when sleeping so this isn't exactly the most comfortable thing to sleep with. It does provide great support. However, I don't think my belly is large enough to really get the full effect.",
      "rating": 3.0,
      "verified": true,
      "author": "Kayla Gluck",
      "helpful_votes": 3,
      "publication_date": 20180402
    },
    {
      "title": "This thing is AWESOME!",
      "text": "Bought for my daughter in law while she was pregnant with my grandson. She used it until she no longer needed it, and handed it over to me to help me support my back while sleeping. I have to say, it's HUGE and heavy duty, making it cumbersome on a queen bed, but once it's positioned where you want it - it's like a big ol' hug while you're sleeping. Now that I've gotten used to it, I sure do miss it when I'm traveling and trying to find comfy positions and extra pillows as a result of being spoiled by this thing!",
      "rating": 5.0,
      "verified": true,
      "author": "TrulyDivyn",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "10/10 PRODUCT FOR LAZY GIRLS",
      "text": "I am not pregnant whatsoever, but I have a side sleeper and I like to prop my knee up while I sleep. This pillow gives so much support in my lower back and legs, and it really makes me feel comfortable lounging and watching TV. LOVE LOVE LOVE IT - will update with more information if needed",
      "rating": 5.0,
      "verified": true,
      "author": "O truant Muse",
      "helpful_votes": 5,
      "publication_date": 20180401
    },
    {
      "title": "Flat as a Notebook",
      "text": "I’ve purchased this pillow because I’m 6months pregnant and needed a body pillow for comfortable sleeping. The item came in a small box shrinked wrapped, when I opened the box the pillow was flat like a pancake. So I figure I’ll leave it out over night and maybe it’ll puff up the next day. I checked the pillow the next day and the pictures is how much the pillow has inflated.( That’s a note book next to the pillow) Terrible item, maybe it’s the packaging but save yourself the inconvenience of ordering this product.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Michelle",
      "helpful_votes": 4,
      "publication_date": 20190130
    },
    {
      "title": "... for a couple of days now and I absolutely love it. First of all",
      "text": "I've had this pillow for a couple of days now and I absolutely love it. First of all, I am not pregnant lol but I wanted one of these pillows because I have a bad back and wake up every morning in so much pain. I need the extra support this pillow offers. At first I thought I would be disappointed since it was flatter than I thought it would be. Surprisingly however, it does provide some vert comfortable support in just the right places. I got a memory foam mattress the same day as the pillow and I havent slept so soundly or pain free in years!",
      "rating": 5.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 11,
      "publication_date": 20171230
    },
    {
      "title": "Leaves much to be desired.",
      "text": "I'm quite disappointed in this pillow. I had a snoogle when i was pregnant and slept wonderfully. Now that I've developed some back and neck pain, I thought another similar style would help. This pillow arrived vacuum sealed with a promise it would fluff up within 48 hours. It's been just about that and this pillow is much too flat. It isn't helping me sleep comfortably at all. In addition, the material of the cover gets very hot, and I find myself sweating wherever I'm touching it. I'm just not happy with this purchase. I'll probably donate it locally. Maybe someone else will like it more than I do.",
      "rating": 2.0,
      "verified": true,
      "author": "Robyn V",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Doesn't fluff up after unpacking, and hot.",
      "text": "A: Pillow comes folded up & vacuumed seal in plastic bag. It did fluff up after unpacking, however not as much as I expected, especially in the areas that had been folded. B: I also felt that it was a bit short. I am 5'8 with 34\" inseam. I felt that, with my head on the top center, the pillow didn't come down far enough on my legs. I like the pillows between my knees and this came more to my thighs. C: The material itself doesn't allow your skin to breathe which made me HOT. D: Also, this doesn't come with a cover, which is easily enough remedied, but it's nice to know.",
      "rating": 2.0,
      "verified": true,
      "author": "KRichard",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Pregnancy pillow helps sixty-year-old woman",
      "text": "Never thought a simple pillow would make so much difference in how you sleep. This funny shaped pillow has made such a difference and the way I feel when I wake up it is amazing. I have had chronic pain for over 10 years and this is probably one of the few things that has made a difference in my life. If I had known 10 years ago that this funny shaped pillow would make such a difference I would have bought one long ago. But who would think that a sixty-year-old woman would need a pregnancy pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "ROUGH, UNCOMFORTABLE, NOISY.",
      "text": "VERY UNCOMFORTABLE. My wife wanted badly, when it arrived, it felt like she cover was sand paper rough. The inside cushion was just as bad. The cover is raspy and very noisy, as well as the cushion sounding like they stuffed it with newspaper. It's use less for us, and takes too much room stored aside.",
      "rating": 1.0,
      "verified": true,
      "author": "Sierra Wolf Pack",
      "helpful_votes": 4,
      "publication_date": 20170905
    },
    {
      "title": "Don’t think about it...buy it!",
      "text": "I purchased this product for my wife for her surgery recovery period! She said it was a life saver...she loved it!!! Her niece had a similar procedure about a year later and she fell in love with it too. She passed it on to her other aunt who used it during recovery on a surgery she had afterwards. Everyone loved it and apparently exceeds its value with comfort and durability. I rated it only 3 stars for easy to clean only because I don’t know how easy it is to clean because I never handled it. Apparently anyone thinking about purchasing this product will be very happy with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181231
    },
    {
      "title": "Every pregnant body should have one",
      "text": "Not a fan of the cover, it is so long and difficult to get off for washing and then put back on. Over the course of my pregnancy the \"legs\" have become unevenly stuffed - one is so thin, the other plump. I have used this to facilitate prone lying during massages and a semi-on the belly sleep position for optimal fetal positioning. You can bend it any way which way and it is really large - so major pluses.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Canibano",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Best thing I bought during my pregnancy",
      "text": "Best thing I bought during my pregnancy! It provides great back support while still letting me out something in between my legs. It's better then using a lot of regular pillows because those keep moving and are hard to get placed where you want them. This is one giant pillow that is perfect around my body all night long. I am a few most post partum now and I use it to prop me up in bed to feed my baby. So it works after the baby is born too.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "BEST MATERNITY PILLOW !! AND VERY REASONABLE PRICE!",
      "text": "I have purchased now 3 different 'pregnancy' pillows and this one by far is the best one I have ever had! Game changer! And It came in very quick! The removable pillow case is also a huge plus! :) I found that generic body pillows are too think, and the other pillow I got from BabiesRUs was super expensive and didn't last but almost 2 months. This full body maternity pillow feels like a nice down pillow, and can be used for breast feeding if that is something you are thinking about trying! I am in love with this pillow and sleep so well! This pillow wold run $80-$100 in the store, so get this pillow!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180112
    },
    {
      "title": "Worth the money!",
      "text": "This product is a life saver. If you’re looking for the fluffiest pillow out there, this is not it. But it does keep you on your side and provide enough support to keep you comfortable. I like that it’s not super puffed up, so I don’t have to hike up my leg to an uncomfortable position. The one downside is it’s larger. My husband barely fits in the bed (or so he complains), but I sleep incredible with this product.",
      "rating": 5.0,
      "verified": true,
      "author": "audgearcher",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Big, fluffy, about to be your best friend pillow!",
      "text": "THE MOST COMFORTABLE pillow I’ve ever slept with. Wish I had this when I was pregnant! I bought it for surgery and also bought the slip cover (made by different retailer) - saved my life for the week after surgery. This thing is HUGE. Soft and fluffy but really keeps its shape, especially when in the slip cover. Arrived in a small box because it came vacuumed. It’s also pretty affordable if you look at other body pillows. 100% recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie Needham",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "The size of this pillow would probably be great if you are around 5'4\" or smaller",
      "text": "The size of this pillow would probably be great if you are around 5'4\" or smaller. I'm 5'9\" and have long legs so this pillow doesn't really work for me to have between my knees and ankles. It also doesn't fluff up very much so if you like a flatter pillow, I guess this will work for you. I do like the support it gives my back, and as a back sleeper normally (bad if you're pregnant as it blocks blood flow to your baby), it keeps me from rolling onto my back while I'm sleeping.",
      "rating": 3.0,
      "verified": true,
      "author": "Meghan S",
      "helpful_votes": 2,
      "publication_date": 20171121
    },
    {
      "title": "it failed to support my head and neck and felt as though it were ever present and smothering me making it far to warm to sleep comfortably. It now sits in a giant pile in ...",
      "text": "Everyone raves about these pillows- I’m going to be the voice of the disillusioned minority. Even after airing for days, the pillow remained too flat to be of any real support- and when used as pictured, it failed to support my head and neck and felt as though it were ever present and smothering me making it far to warm to sleep comfortably. It now sits in a giant pile in my closet taking up space- I should just throw it out, but I feel bad because I paid for the thing.",
      "rating": 1.0,
      "verified": true,
      "author": "CookieJess",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "works week for end of 2nd trimester, beginning of 3rd",
      "text": "I got this for my wife early on in her pregnancy, but she didn't like it at first, after we were halfway through our third trimester, she was complaining of numbness and discomfort sleeping, we had stashed this away months back as she wasn't using it so she tried it out again and it was a life saver. now as we are deeper into third trimester I think she's having issues getting comfortable again, its not super soft its good for a lot of things but maybe not the best one out there, not sure since I haven't tried others but I imagine it would benefit from some more stuffing. The case being removable/washable was great and a definite bonus.",
      "rating": 4.0,
      "verified": true,
      "author": "christopher arens",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Amazing.",
      "text": "My husband wants one now. Came vacuum packed and fluffed up quickly. I sleep so comfortably! --after having this for a couple months and being further into my pregnancy, I must say this thing is a life saver! I can't sleep without it. The cover washes nicely and even though it does get flat after some weeks of use, throwing it in the dryer with tennis balls fluffs it back up. The case material does make me hot during the night, but I also usually have atleast two animals in bed with me. The cats love it too!",
      "rating": 5.0,
      "verified": true,
      "author": "NickieAir",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Prepare for long awaited sleep and comfort.",
      "text": "Bought this pillow for my expecting wife... Shameless to say, I have been replaced. This pillow provides superior comfort and has been heaven sent. Prior to purchase, there were many sleepless nights as a result of tossing and turning, in failed attempts to get comfortable. Since this pillows inception, nothing but shut eye. Fluffing the pillow upon opening is a bit time consuming, but crucial. What little time is spent preparing the pillow, is by far compensated for in sound sleep and comfort.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Does the job but flattens quickly.",
      "text": "During my first pregnancy, I borrowed from a friend and it was fantastic. This one flattens easily. I still use it every night and sleep as long as my bladder allows. If I was to buy another I would want one that did not flatten as easily.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "Great buy!",
      "text": "I've had this pillow several days now, and I've been sleeping with it every night since I received it. It is very large - the picture accurately depicts the size of this pillow. It is stuffed fairly full and seems to be of good quality. Definitely a great purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "Ashley Nanninga",
      "helpful_votes": 2,
      "publication_date": 20170602
    },
    {
      "title": "Good concept",
      "text": "I loved it at first. I purchased it because of a stomach condition that caused aspiration. It definitely helped. However I tend to get very warm when I sleep and found it confining and hot. The pillow part seemed high and un adjustable and gave me a stiff neck. I think it would be better if it weren't so full!!",
      "rating": 3.0,
      "verified": true,
      "author": "Bonnie Childers",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "FLUFF AND SHAKE",
      "text": "WHEN I FIRST OPENED IT I KEPT THINKING WOW ITS SO THIN.(like almost everyone on here with their bad review) THEN I GOT SMART AND WATCHED A HOW TO VIDEO HERE ON AMAZON.I FLUFFED AND SHOOK IALL THE WAY AROUND THE PILLOW AND IT LOOKS BETTER ALREADY( 3RD PHOTO) IM NOT DONE YET.BUT WANTED TO POST A PIC OF THE RESULT.SO BEFORE YOU LEAVE A BAD REVIEW TRY FOLLING THE INSTRUCTIONS IN THE VIDEO.YOULL BE HAPPY YOU DID.",
      "rating": 5.0,
      "verified": true,
      "author": "Diana deiter",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Flat flat flat AND FLAT....",
      "text": "Well this picture is very misleading... I’m really upset it won’t inflate. I’ve had it 7 hours and out of the box and wrapping and the damn thing won’t inflate.. something that needs to be pulled from amazon..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Flatter than expected, not fluffy at all",
      "text": "It would be perfect if it was fluffier/fuller. My wife bought this to sleep with because she enjoys sleeping with a lot of pillows around her. Wanted to return & replace for an alternative product, but It’s more of a hassle to return, and I’d be paying for the shipping which is half the price of the product. I guess I’ll be keeping this semi flat pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "Very comfortable pillow",
      "text": "I love this pillow! It's very comfortable. The only downside for me is that it constantly falls off my bed or half of it slides off any time I roll over. It's really annoying. It might be the way I sleep or the way I position the pillow- I just haven't been able to figure out how to avoid this yet. Overall I highly recommend this pillow for anyone who has trouble getting comfortable. I deal with chronic lower back pain and this helps me quite a bit.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Extremely Flat, does not look like the picture!",
      "text": "I was so excited when I ordered this pillow. I was 7 months pregnant and really need something to help me sleep comfortable. This was not it, I waitied for a few days to see if these pillows would come to life, but they never did. They were extremely flat and not worth the money at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Not just for pregnancy!",
      "text": "I was very satisfied with this pillow! I had major surgery and was having great difficulty sleeping the first few nights after coming home from the hospital. A friend had suggested getting one of these pillows for better comfort while sleeping. It was amazing! I slept 7 straight hours in comfort. The only flaw with this pillow is that it doesn't come with a cover nor is it east to find one. I ordered one that I assumed would fit, but I had to alter it myself.",
      "rating": 4.0,
      "verified": true,
      "author": "Tina Paugh",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "Very thin not supportive",
      "text": "I actually expected this to be thicker and fuller. It is flat and not supportive at all. Spend the time and money researching this style pillow. This is just a flat no.",
      "rating": 1.0,
      "verified": true,
      "author": "Canutesun",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Disappointed",
      "text": "Very flat and scratchy. I guess technically it is still a pillow? It has no support though, it feels like sleeping on slightly fluffy cardboard. This definitely needs a separate pillowcase too, it rustles really loudly whenever you move. With an item this big it’s just a bit too much of a pain to return, I’ll probably end up buying extra stuffing to try and salvage it. Won’t be happy about it though. Save your money.",
      "rating": 2.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Godsend",
      "text": "I purchased this for after surgery support, after opening the box I was slightly disappointed yet it didnt last. After letting it expand, ever so slightly, I set it up on the bed and it was the best. I used the legs as arms to keep me propped up in a sitting position for most of three days. It does well at keeping body heat in yet not getting overly hot, if you're cold natured, you'll love it",
      "rating": 4.0,
      "verified": true,
      "author": "jackie maxwell",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Not uniformly firm",
      "text": "Top portion is softer than the rest, possibly due to packaging. Remedy is to put another pillow there. Acceptable workaround for the price. There was a slight odor after unpacking, but airing it out for few hours got rid of that. The cover is of questionable durability, as there were plenty of loose threads after washing just once.",
      "rating": 3.0,
      "verified": true,
      "author": "johndoe13",
      "helpful_votes": 2,
      "publication_date": 20170603
    },
    {
      "title": "Used Daily",
      "text": "Wife love this thing. The wife is 22 weeks pregnant so this thing is great for her to find that magical position for her to sleep with. The pets seem to love it too so we have to hide it when not being used! Came in a vacuum sealed pack so it looked super tiny. Wife is 5'.2\" and its maybe a little longer than her.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Marques",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "not a comfortable pillow",
      "text": "Not really long enough. Stops at the knees. Not a soft pillow at all. Almost no head support---thin filler causing bending in the neck and what IS there, is hard and uncomfortable to sleep on. The leg portion did support my knees but only if I slept with knees in fetal position. Got very hot sleeping in it.",
      "rating": 3.0,
      "verified": true,
      "author": "pheelyne",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "I am pleased to say that it has filled out nicely",
      "text": "Initially afraid it wouldn't plump up after reading reviews and receiving the delivery, I am pleased to say that it has filled out nicely. it took at least a week to fully plump up, but now it looks like the picture advertised, and my pregnant wife won't sleep without it. Ordered this on the recommendation of a friend, it gets two thumbs up from two pregnant girls!",
      "rating": 4.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "Picture is misleading",
      "text": "Picture shows this is good to your knees, that's false. It's shorter & thinner than shown. I'm also short, so if your tall, then good luck. I've owned pregnancy pillows with each child. This is by far the worst. Way to short for my liking my knees & back need their support!",
      "rating": 2.0,
      "verified": true,
      "author": "Katie Lutz",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "I waited for days to see if the pillow woukd fluff up but its been a month now and it remained pretty flat. Using three other pillows along with folding ...",
      "text": "Pillow came in a small vacuum sealed bag. I waited for days to see if the pillow woukd fluff up but its been a month now and it remained pretty flat. Using three other pillows along with folding long pieces up in order to get remotely comfortable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jocelyn",
      "helpful_votes": 4,
      "publication_date": 20170710
    },
    {
      "title": "WONDERFUL.",
      "text": "Best pillow ever. My 5 year old daughter loves it also that I am just waiting for the day that she asks if she can get one. LOL. He hugs the body and is so comfortable. Sleep so much better with this that it is missed when I have to travel. One of the best things I have purchased in the last six months.",
      "rating": 5.0,
      "verified": true,
      "author": "Helpfulreviews",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Support factor is meh!!",
      "text": "Pillow came in a timely manner. I expected it to fluff up more but it didn’t. It is a very flat pillow. I love how I can maneuver the legs of the pillows to fit behind my back or around my legs. I just wish there was a little more substance to it. Overall it’s a great pillow just make sure you have other pillows under for the extra support.",
      "rating": 3.0,
      "verified": true,
      "author": "DeAndrea",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "every morning I found myself on my bad back. It is huge too",
      "text": "This pillow I thought was intended to stop me from rolling on my back...it did not, every morning I found myself on my bad back. It is huge too...tough if you sleep with someone and it should come with a removable cover, no cover at all. I did like the fact it could be used to prop my back while watching tv in bed..but that's about all.",
      "rating": 2.0,
      "verified": true,
      "author": "Cindy L. MacDonald",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Pillow didn't expand when it came out of vacuum package!",
      "text": "This pillow was vacuum sealed for delivery, and the pillow was supposed to expand once opening. However, it only expanded a little bit, and isn't fluffy or comfortable at all. I would like a new one, but it is too difficult to send back to shipper because of it's size.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20181113
    },
    {
      "title": "Waste of money",
      "text": "I was really looking forward to this pillow while I’m pregnant and it hasn’t done a thing for me. I did exactly what I was supposed to do after unboxing and it didn’t fluff up. It is the flattest pillow Iv ever seen",
      "rating": 1.0,
      "verified": true,
      "author": "nancy",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Bit bulky but it does help with hip discomfort.",
      "text": "Can be a bit uncomfortable at times trying to get situated or if you need to shift. Hard to get the belly support sometimes. Still helps tremendously from not having anything before. Great for hip pain relief and for propping up with pillows for acid reflux/heartburn etc.. It is a bit bulky. We have a cal king and I feel like it takes up about half the width of the bed.",
      "rating": 4.0,
      "verified": true,
      "author": "The Kimberly's",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Coarse material but comfy",
      "text": "Very comfy. Not too thick and fluffy, kind of flat. The material is coarse and feels like a mattress protector. It's also quite large. It would take up all the space in a twin bed. I would recommend tho.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephanie",
      "helpful_votes": 2,
      "publication_date": 20170713
    },
    {
      "title": "Couldnt use; didn't provide any support, was only a couple inches thick with very soft firmness.",
      "text": "Bought this for my pregnant wife and when opening up the packaging, we both noted that the pillow was severely deflated. I suggested to give it a few days to see if it just needed to reinflatr after being packed away for who knows how long. A week later it still wasn't better. I tried fluffing it up to no avail. Ended up storing it away in garage until selling it as-is at a moving out yard sale.",
      "rating": 1.0,
      "verified": true,
      "author": "David M.",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Not comfortable",
      "text": "This is my second pregnancy with this pillow and it is very uncomfortable! I’m actually going to invest in buying a different one at this point. It is not soft, hard to get comfortable. There is no head support so I have to use a regular pillow on top of it and end up with my head too high up. I’ve even tried flipping it upside down to have my pillow where the feet normally go, still awful! I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Duffy",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "... it to be but i was shocked because its FANTASTIC. Even with it seeming flat",
      "text": "This was much flatter than i expected it to be but i was shocked because its FANTASTIC. Even with it seeming flat, i dont need a pillow for my head as this does the job just fine. Being U-shaped is great switching from side to side. I had a huge problem with my arms and hands falling asleep and waking me up in the middle of the night with the knife like pain, and this pillow allows me to place my arms comfortably in a way that prevents that from happening. Its great support for your growing belly and has been a life saver for me",
      "rating": 5.0,
      "verified": true,
      "author": "genie mills",
      "helpful_votes": 0,
      "publication_date": 20180816
    },
    {
      "title": "Every pregnant woman needs one!",
      "text": "LOVE THIS!! If you are pregnant and uncomfortable you need on of these in your life. It provides support and cushion. Helps with 2nd trimester heartburn and all term body aches back pain. I live in Texas and have not found it to get too hot like you would expect. The only complaint would come from my husband since it takes up most of the bed. Go get this preggy lady! Treat yo self",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Not durable, but great price",
      "text": "A great price, but very quickly, the pillow thinned out where my knees rested. The material is also coarse, but fine. Wish there was a way to wash it; I didn't see a cover, so I just put a pillowcase over the area where my head went.",
      "rating": 3.0,
      "verified": true,
      "author": "Embee",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "Not for me",
      "text": "Everyone said to get a pregnancy pillow, so I got this one. Turns out I hated it! It was just not comfortable for me and I couldn’t sleep on it. Nothing wrong with the actual pillow itself. I ended up having better luck with a pregnancy wedge pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "Online shopper",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Love it!",
      "text": "Wasn't sure which type of pregnancy pillow my wife wanted so bought her this one and the \"C\" shaped one. She ended up going with the \"C\" shaped one and I gave this one a try, more of a joke than anything. AMAZING! It's like sleeping in a recliner. LOVE IT!",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Pibb",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Barely a pillow, empty shell",
      "text": "I was expecting a full ;pillow with support like the photo. What I got was basically an empty shell in a blanket. Flat piece of blanket. I ordered from abroad so returning is a pain, so this was basically a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Karina Chez",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "it is very large and comfortable",
      "text": "I would have given more stars but this thing is HUGE.I Mean I think its a bit too big.Maybe it's just me? I can hardly fit it on my bed.It is comfy but I was expecting a boppy pillow type thing lol. If you want a x-large body pillow you will not be disappointed. I Bought it for back/hip pain, it does relieve the pressure and ease the pain .They were not cheap with fabric and stuffing.I wish it would have come with a cover like others do.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Comfortable but arrived dirty and stained.",
      "text": "Super comfortable. However the pillow cover had these weird stains on it. I washed the pillow cover, as directed, and the stains remained. Gross. If this hadn't been a problem, I would give 5 stars for confort- I ended up using a different pillow cover and used every night during last 6 weeks of pregnancy. Jealous husband.",
      "rating": 1.0,
      "verified": true,
      "author": "Faith",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "I love that it not only supports the tummy really well",
      "text": "Bought this thinking it might come in handy every once in a while. Now I sleep with it every night and it is a saving grace! I love that it not only supports the tummy really well, but supports my back as well. Be aware that it is very large, so if your bed is not a king, your partner might not love it as much as you. We have a queen sized bed, and my husband complains that it takes up more of his space than he would like.",
      "rating": 5.0,
      "verified": true,
      "author": "Z. Neese",
      "helpful_votes": 0,
      "publication_date": 20180614
    },
    {
      "title": "Seriously, buy it",
      "text": "I bought this around month 3 or 4 and am now month 8. I cannot imagine how I would have slept without it. Especially since after 20 weeks, it is not recommended to sleep on your back, and I was a back sleeper; this helps you stay on your side comfortably.",
      "rating": 5.0,
      "verified": true,
      "author": "R A F",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Not the best pillow...",
      "text": "This pillow doesn't offer much support when between the knees. I get better support out of my body pillow from Walmart. This pregnancy pillow seems to stay flat and is also not as long as the product picture shows. Also makes me sweat during the night to where I can't use a blanket or a sheet even. I have resorted to using it when sitting laid back in the recliner or when sitting in the floor to play with my dog. I would not purchase this again and I would not recommend to a friend if using only for help sleeping at night. Gave 3 stars because I have found other ways to use this pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "Highly Dissatisfied",
      "text": "After reviewing multiple products and spending hours reviewing this specific product, I decided to purchase it. The first time that I ordered it, the zipper broke two days after purchasing it so I requested an exchange. Once I finally got to use my product i was highly dissatisfied. I expected a lot more cushion and comfort because of the reviews. Most of the time I don't use it because I feel like I'm using an old, flat pillow in between my legs. I am considering returning the pillow and buying a new one that offers more.",
      "rating": 2.0,
      "verified": true,
      "author": "Carol Martinez",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "Would definitely recommend",
      "text": "Have the hardest time getting into a comfortable position when I sleep. Pain in one hip, neck issues, etc. this has been a godsend. I'm able to arrange parts of this pillow to help relieve pressure, adjust head and neck level and anything else I need to do to get comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol A. Johnson",
      "helpful_votes": 0,
      "publication_date": 20180708
    },
    {
      "title": "Great pregnancy pillow",
      "text": "Girlfriend could never get comfortable while she was pregnant with our daughter especially if she was sleeping by herself. The pillow helped her get uninterrupted sleep during the course of the night. Even now our daughter still uses the pillow now and she is 2 years old.",
      "rating": 5.0,
      "verified": true,
      "author": "Reginald Hurt",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "Claustrophobia Causing Pillow",
      "text": "If you like sleeping with your spouse and don't have a massive king size bed, you probably shouldn't get this behemoth. It's so big, you'll kick them right off the bed. At least it can function as a nursing pillow but most don't have the luxury of nursing every time in bed. Guaranteed to be thrown out as soon as your baby is born by an annoyed spouse!",
      "rating": 1.0,
      "verified": true,
      "author": "Quinn",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Great Comfort For Sleep & Relaxing",
      "text": "This was a present for my wife. She absolutely loves the comfort and says very plush. Only draw back she says is that it doesn't come with the pillow case cover, and makes your neck hot at times.",
      "rating": 4.0,
      "verified": true,
      "author": "Chitown702",
      "helpful_votes": 3,
      "publication_date": 20180115
    },
    {
      "title": "Decent but not great.",
      "text": "I ordered this to replace my previous pillow and it doesn’t provide near the support. The stuffing moves around and I wake up with nothing where my legs are.",
      "rating": 2.0,
      "verified": true,
      "author": "Madison",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "My wife loves it",
      "text": "My wife is pregnant with our 3rd child, and always has back pain during her pregnancies. I bought her this pillow to try to relieve some of that while sleeping. She loves and says it helps her get comfortable at night. It is pretty big though. We have a king size bed, and this pillow takes up half of the bed, but if it helps her sleep, i'll continue to sleep on my 1/4 of the bed lol.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Aldridge",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "Super comfy",
      "text": "Way easier to wash than other reviews implied. Very happy with it, my pregnant fiance wouldn't be able to sleep without it, and it's so comfortable I might order a second one for myself!",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Burdison",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Flat",
      "text": "Totally different from my last purchase in 2018. When I received it, it’s very flat. Very disappointed as returning customer. And this is my 3rd time purchase as a gift to family member. So I contacted the customer service m, they are willing to replace it at no cost. will update once I get the replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "hap-pea",
      "helpful_votes": 0,
      "publication_date": 20200523
    },
    {
      "title": "Flat pillow",
      "text": "I'm really disappointed because the only reason I bought a new pregnancy pillow is because my other one was real worn and not very fluffy anymore. When I received this pillow it was shipped vacuum pack- which I'm sure is the easiest way to ship is. However it's made the pillow pretty flat. I waited the recommended 48 hours for it to \"fluff\" and even tried to fluff it myself but it's hasn't helped much. So I would just keep in mind if your trying to order this, it's going to come vacuum sealed.",
      "rating": 2.0,
      "verified": true,
      "author": "Brianna Dull",
      "helpful_votes": 2,
      "publication_date": 20180722
    },
    {
      "title": "Perfect Pillow",
      "text": "I love this pillow! It makes the most wonderful, comfortable nest in my bed that I never want to get up. Like some other reviewers, I do find the pillow a bit flat, but I like that. Also, it does take up a lot of room in my queen-sized bed, but as it’s just me in here, it’s really perfect. Those with mates though may find that problematic.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann E. Lawson",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Love it",
      "text": "I bought this at 7 months pregnant. I thought it looked a little flat, and the instructions recommend letting it sit 24-48 hours before use as it was vacuum sealed. Even after sitting I thought it looked a little flatter than I'd like, but it is amazing. It is so comfortable and the more I use it the more I love it. The filling evens out and everything is perfect. I wish I had bought it earlier in the pregnancy and I'll continue to use it after.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Super comfy and my pregnant wife can finally sleep!",
      "text": "Pregnant wife loves this, although she did mention that it had a bit of a funky smell at first. It looks really comfortable and honestly I want to take it from her. After the kids are born I get dibs.",
      "rating": 5.0,
      "verified": true,
      "author": "J.R.",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Comfortable",
      "text": "I use it for my back issues; I'm not pregnant. It has helped. My only complaint is that it needs to be longer. I'm 5' 7\" and it is a little difficult to use. The thickness is perfect and I like the feel of the removeable pillow case. The conundrum I face is where to put it after I make the bed. It's huge! And when I get ready for bed, it's like tucking in a person.",
      "rating": 4.0,
      "verified": true,
      "author": "D. Falise",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Great Product.",
      "text": "I absolutely loved this pillow while pregnant and I am still using it 6 months postpartum. I works for so many additional positions. I use it for watching TV, reading, breastfeeding, sleeping, and just hanging out. I only have 1 complaint, I should have bought more of them, cause I have to fight with my hubby and older kids for it, LOL...",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica W.",
      "helpful_votes": 0,
      "publication_date": 20190528
    },
    {
      "title": "Love this pillow",
      "text": "I'm not sure how I'll be able to sleep when I'm on vacation without this pillow. I sleep so much better with it. I love the feeling of a little extra support on my back. You don't even have to be pregnant to use this. If you just have a bit of a belly it works great. Or if you just don't want it to be so confining like some can be.",
      "rating": 5.0,
      "verified": true,
      "author": "dawnser",
      "helpful_votes": 0,
      "publication_date": 20190221
    },
    {
      "title": "More then pregnancies.",
      "text": "I purchased 2 of these. One for my hubby who has stage 3 lung cancer. Every night he wasn't sleeping all that great. His breathing kept him myself up countless nights. Once he used the pregnancy pillow he was able to prop himself up all night making breathing easier. The other one was for myself I want it to help me with my back pains, Fibromyalgia my sciatica. I sleep great. The thing I don't like about it is it makes you hot.",
      "rating": 4.0,
      "verified": true,
      "author": "Mel",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Completely flat with no support as well as cheap plastic cover",
      "text": "This is a very disappointing purchase. This pillow is so flat and offers no support at all. It is cheap material with no cover over the top so it’s feels like laying in a plastic bag. I feel I have been scammed and sent a cheap Chinese knock off of the product in the picture and reviews. I have another pregnancy pillow that is night and day from this one. Save your money and get a better product elsewhere!",
      "rating": 1.0,
      "verified": true,
      "author": "JT",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "I was having a hard time sleeping and getting comfortable around 5 months of being pregnant",
      "text": "This is a must while pregnant! I was having a hard time sleeping and getting comfortable around 5 months of being pregnant. Before getting pregnant I was a stomach sleeper so only sleeping on my side and back with really no support was terrible! This pillow is not only super cozy and comfortable, but it has given my body so much support while sleeping. My back and my stomach are able to both be comfortable at the same time. It's also long enough to wrap your legs around it. I will also probably use this pillow when my baby is born. I can see where it will be awesome to have when nursing. Don't hesitate about buying this pillow!",
      "rating": 5.0,
      "verified": true,
      "author": "Mae Mabry",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Just ok",
      "text": "Currently 27 weeks pregnant and I was hoping this would be fluffier or at least give me more back support but this pillow is far too flat. I have to still use other pillows to prop myself up. Only thing I like is that it's easy to fit between your legs and turning from side to side during the night. As a pregnant woman, I have no energy to return so I'm keeping it but would not recommend.",
      "rating": 2.0,
      "verified": true,
      "author": "Mindy Koenigsfeld",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Very large and hot during summer",
      "text": "Unless you’re having twins get something smaller. My wife used this thing for about 2 months off and on then stopped using it. It is very Large You have to have a big Bed. It got very-hot' uncomfortable made Well just way to big. She wished she gotten something smaller like she did with our first baby.",
      "rating": 3.0,
      "verified": true,
      "author": "Satori",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Best for bed rest",
      "text": "I was hospitalized for 2 weeks prior to giving birth, I don’t think I would have slept if it wasn’t for this pillow. I did a weekend without it because it arrived after I was admitted, but there is no way to be comfortable in a labor and delivery bed without this life saver! Plus it made it so much easier to turn and keep the monitors on my belly. Plus every nurse that saw it thought it was the greatest thing I could have purchased and were gonna tell their other patients about.",
      "rating": 5.0,
      "verified": true,
      "author": "Alejandro Coronel",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Understuffed and crumpled garbage",
      "text": "It is utterly bewildering that this gets high reviews. It comes vacuum packed and never inflates or puffs back out. It is about 2 inches thick in most places and very under stuffed. It cannot be used as a pillow. Not clear how a pregnant woman or anyone else could benefit from what is basically a giant uninflated balloon.",
      "rating": 1.0,
      "verified": true,
      "author": "Biff Tannen",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "And it made life so much more comfortable during the weeks after my surgery",
      "text": "It was suggested to me to buy this for home on my recliner after my double mastectomy. And it made life so much more comfortable during the weeks after my surgery. I still use it now in my bed as I'm still in my recovery process. It is so comfy and even though I can't sleep on my sides completely, it still helps me to sleep slightly on my side without causing pain as it would laying flat on my bed. Definitely a good buy. And I'm sure if I had this during my 3 pregnancies it would have saved me a lot of being in discomfort while sleeping in bed!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Laguna",
      "helpful_votes": 0,
      "publication_date": 20180412
    },
    {
      "title": "make sure to fluff in video",
      "text": "I purchased this due to the Wirecutter recommendation. It works as they described, plenty supportive. Just make sure to watch the product video and fluff as directed. I got it for $30, what a bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Kmus24",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "Fell Flat",
      "text": "The pillow was vacuum sealed within its packaging an although it did regain some fullness once I opened the package, it isn't as full as I thought it would be. It provides minimal support while sleeping as it goes flat. I was hoping this would offer more support than it does. I will be looking for another pregnancy pillow.",
      "rating": 2.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "This pillow worked amazing for me",
      "text": "This pillow worked amazing for me. I got this pillow at about 5 months and I didn't have any problems sleeping after I purchased the pillow, I slept like a baby. It is so comfortable. My husband didn't like the barrier it created, but he can be an active sleeper so it worked out for me. I loved being able to take off the outter case and wash it. Now the baby is born I lie in it while I breast feed her or just prop her up on it. Great buy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Tyrell Thomas",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Loved it",
      "text": "I'm in my second trimester, this is the first pregnancy pillow I've ever used, and I love it! I fluffed it up a bit after it arrived vacuum-sealed, and it is true it is pretty flat. I dislike overly-stuffed pillows in general though, and find it easier to get comfortable with something like this. It's similar to down filling, how it compresses. I've been tossing and turning at night trying to get comfortable, and this let me sleep better than I have in a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "The price was great.",
      "text": "Bought this for my daughter, she not pregnant. She loves this pillow takes it with her everywhere. The price was great compared to the one that were real expensive dose what I bought it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "Large size",
      "text": "Far too large to use in a queen size bed, especially when the comfort level isn't as good as I would like. Looks very fluffy but pretty stiff in design. Though it has a zipper cover on it for washing, it is not easy to use and looks like it still needs a pillow case. Would not recommend this pillow and will probably purchase another type instead.",
      "rating": 2.0,
      "verified": true,
      "author": "heathermoon",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "HUGE but super comfy!",
      "text": "Good pregnancy pillow, VERY big! It will take up over half of a king size bed, but it most certainly comfortable and plush. It will help if you roll over a lot at night to keep you comfortable and in one place.",
      "rating": 5.0,
      "verified": true,
      "author": "M Parrish",
      "helpful_votes": 0,
      "publication_date": 20180711
    }
  ],
  "product_meta": {
    "title": "Pregnancy Pillow, Full Body Maternity Pillow with Contoured U-Shape by Bluestone, Back Support",
    "description": "During pregnancy finding a comfortable sleeping arrangement can be a challenge. Full Body Maternity Pillow with Contoured U-Shape by Bluestone helps alleviate discomfort by providing support to the unique shape of pregnancy with a unique contoured shape of its own. Multiple pillow configurations allow moms to find comfort no matter how they choose to sleep, whether it's on their back, side or otherwise. Sleep peacefully throughout the night gently supported by the Bluestone Full Contoured Body Pillow.\n\nIMPORTANT: Avoid buying counterfeit products and transacting with unauthorized sellers. Look for our logo on the packaging for every one of our products. Bluestone is committed to providing the consumer with the absolute best price and value on entire line of products, which we ensure by applying a rigorous Quality Control process.",
    "rating": 3.9,
    "feature_bullets": [
      "HEAD TO TOE SUPPORT – Inner cover: polypropylene. This generously oversized multifunctional U shape body pillow is long enough for you to stretch out and provides equal support to both sides of your body. The hour glass inner curves and contours to your entire back while aligning your hips for neutral joint positioning. Also, helps relieve pain and discomfort associated with pregnancy, sciatica, fibromyalgia, gastric reflux, lower back pain, ankle pain, and more.",
      "COMFORTABLE NIGHT SLEEP – No more repositioning during the night with the Full Body Maternity Pillow by Bluestone. This uniquely designed body pillow replaces the need for multiple pillows at night and gives you the ultimate painless and sound sleep. This ALL-IN-ONE pillow cradles your body to help eliminate tossing and turning, keeping your neck, shoulders, back and hips aligned all night long. Supports Belly",
      "MULTI-FUNCTIONAL SUPPORT PILLOW – The Full Body Maternity Pillow is easily formed into multiple positions and is a great support for reading, watching TV, or just relaxing. Also, makes for a perfect nursing pillow the keeps the baby supported and elevated while mom’s back is still cushioned.",
      "SATISFACTION GUARANTEED – Bluestone is committed to providing consumers with the absolute best price and value on our entire line of products. NOTE: This is an exclusive product of Bluestone and ONLY The Full Body Maternity Pillow by Bluestone are GUARANTEED to be genuine; Decor Type : Bedroom Linen",
      "Kindly check the video provided below the secondary images on instructions before use.",
      "PRODUCT DETAILS – Hypoallergenic, Outer Cover: 100% Cotton, Zippered Removable Machine Washable, Filling: Polyester Hollow Fiber. Dimensions: 60\" D x 38\" W x 7\" H"
    ],
    "specifications": {
      "Product Dimensions": "60 x 38 x 7 inches",
      "Item Weight": "7.25 pounds",
      "Manufacturer": "Trademark GLB",
      "ASIN": "B00DVKJXFE",
      "Item model number": "64-PREGN-U-WHI",
      "Customer Reviews": "3.9 out of 5 stars2,836 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#4,304 in Baby",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Pregnancy & Maternity",
      "Baby Products",
      "Maternity Pillows"
    ],
    "price": 39.99
  }
}