{
  "website_summaries": [
    {
      "verdict": "Though others offer greater mph, the upside is the long battery life and lightweight design.",
      "pros": [
        "Lightweight (3.3 pounds)",
        "Battery gets up to 45 minutes of use per charge",
        "Comes with battery and charger"
      ],
      "cons": [
        "Not good at moving heavy leaves",
        "best for small to moderate jobs like blowing grass clippings"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "GreenWorks Lithium Ion 40V Leaf Blower",
      "text": "This worked much better than expected. I like the adjustable speed and freedom of a cordless design. I was able to blow off the front driveway, front sidewalks, 2 side door porches, the back sidewalks, and the back patio in 10 minutes... Used to take an hour because of the extension cords with my old blower. I have more control with the GreenWorks blower over where the debris is blown/ easier clean up.>> Using a speed setting of 1. My old 210 MPH corded blower blew away the leaves, my gravel. and punched a holes in the dirt. The Greenworks lasted about 25 minutes on full speed or 45 minutes varying the speed while I was testing the battery capacity.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark J. Levy",
      "helpful_votes": 438,
      "publication_date": 20170311
    },
    {
      "title": "Love this thing",
      "text": "I'm a little obsessed with this leaf blower. Maybe too much so. I have 4 giant oak trees on my property and spend about 3 months a year constantly raking and bagging, raking and bagging, raking and bagging. This blower has a ton of power and can blow wet leaves, lasts for about 30 minutes at full power, which is pretty good for an electric blower. Plus, by that time my hands need a little break anyway. It recharges in like 15 minutes. So I go blow a bunch of leaves into a pile, pop the battery on the charger, bag up those leaves, and by the time I'm done the battery is totally charged again.",
      "rating": 5.0,
      "verified": true,
      "author": "meghan d",
      "helpful_votes": 67,
      "publication_date": 20180429
    },
    {
      "title": "Lightweight, affordable, but very poor quality.",
      "text": "Affordability, the lightweight nature, and cordless are all advantages, but the total lack of quality and durability makes this a “do not buy.” We enjoyed our Greenworks leaf blower and used it ~ two dozen times for lightweight duty projects (blowing the sidewalk, garage, etc.), but after it started making a horrible noise, and became non-functional, we realized just what a subpar product it really was. Very disappointing. I have attached photos of our findings. We took the machine apart to see why it wasn’t working. Cheap products are made with cheap parts and poor manufacturing practices - and the Greenworks leaf blower falls into that category. Photos attached.",
      "rating": 1.0,
      "verified": true,
      "author": "Patch",
      "helpful_votes": 123,
      "publication_date": 20200511
    },
    {
      "title": "My brand new 24282 smells like it is going to burn up!!",
      "text": "Updated: Contact support and they handled the replacement like a pro! Replacement on the way. Thanks GreenWorks! I bought this 40v blower to go withy string trimmer (which is excellent) the first concern I had was this blower was sent in an unmarked box from Sunrise Global Marketing. Ok, as long as it was as quality...now when I put my 40v battery on it a fully charged battery goes to 2 lights out of 4 and it smells like it is going to catch on fire...I am afraid to use it at all. I am going to contact customer service and see how they handle this but until then, buyer beware!!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 73,
      "publication_date": 20160716
    },
    {
      "title": "Doesn't work!",
      "text": "I bought this on the recommendation of a friend. The first one didn't work, so I got a second one. I ended up not needing to use it during the winter, so I didn't try it out. I just charged the battery twice, inserted the battery, and got-nothing! no noise, no power, not a thing. Now it has been a long time, and I seem to have a worthless gadget. Not sure what to do next.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 18,
      "publication_date": 20190608
    },
    {
      "title": "Very Weak blower, NOT Worth the money",
      "text": "First this thing is the parts rattled, even the battery shock a little when slid on-wobbly. Not tightly attached parts at all. But for performance overall: I have had multiple Gas powered blowers. Unfortunately this wasn't even close to those. It claims 150 MPH. Very Weak..No way !!! I've had 90 MPH blowers that were much stronger. Really sad I wanted to get away from gas...Can someone recommend a strong Battery yard blower to me? This was not it at all. Kinda Sucks. Maybe good for a frail older lady to blow a not so dirty patio. Nothing more..",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 9,
      "publication_date": 20200402
    },
    {
      "title": "Unreliable Product!",
      "text": "Bought this product mostly to blow leaves and small tree debris from the deck and the short drive way, including the home walk way. Overall it worked good, and did the job well. It was used quite minimally, but after about 6-7 months the battery/ charger stopped working, just showed a red light when plugged in the base. Tried the standard remedies, but to no avail!!! Now, the season is changing and I'm back to looking for a replacement. Needless to say, I would not recommend this product and will not be purchasing another Greenworks item again!!!!! Thanks for reading this review.",
      "rating": 1.0,
      "verified": true,
      "author": "W.",
      "helpful_votes": 8,
      "publication_date": 20200409
    },
    {
      "title": "Must have.",
      "text": "If you don't have one of these, your life is not complete. I own 2. My property is the size most small subdivisions have 40 houses on. I've been a 2 stroke gas, Tim the Toolman, power loving junkie my whole life. But its really nice to grab a battery and hit the power button and with it being so light, the wife grab the other and tag team the task at hand. Is this as powerful as my gas version? No. But after using this, I don't feel like I've went rounds with Tyson in the ring. It is light and easy. I have more concrete one my property then most people have yards and this handles it well.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob in Texas",
      "helpful_votes": 10,
      "publication_date": 20190108
    },
    {
      "title": "Charger Died",
      "text": "Had this unit since June 6. Last night the charger unit red power LED (not the battery status LED) started blinking when I plugged it in to charge the battery after the fourth use of the blower (maybe the fifth battery charging cycle). Unplugged, waited, switched power outlets, mounted the battery, dismounted the battery - nothing worked. When the battery is mounted, the battery status LED doesn't illuminate, and the battery doesn't charge. There are diagnostics and instructions for the battery status LED, but nothing addresses a blinking charger power LED. Sending it back for refund and ordering another brand.",
      "rating": 2.0,
      "verified": true,
      "author": "Kent Sowers",
      "helpful_votes": 14,
      "publication_date": 20170703
    },
    {
      "title": "Disappointed.",
      "text": "The blower is fine however the battery charger stopped working after two charges. I have tried to contact both GreenWorks and Amazon LLC regarding this issue and have not received a reply from either. This is the first time Amazon has not responded to which is disappointing and probably a sign I should shop elsewhere from now on. Greenworks I don't know about but I won't use them again for sure. Hat to be negative but I have no other recourse.",
      "rating": 1.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 22,
      "publication_date": 20161113
    },
    {
      "title": "Don't waste your money",
      "text": "What a piece of S***.... Should be easy and straight forward. Charge the battery attach to blower, clean. This this blows for 5 seconds, maybe, then shuts off. Have to keep turning off and on to get a few seconds of blowing. I tried to call customer service, on several occasions, my CUE started at no less than No.100 or MORE! I waited on most calls for more than an HOUR, and then something in Life made me hang up and attend to that. Never could wait online long enough...In Summary..\"LOUSY BLOWER'...\"EVEN WORSE CUSTOMER SUPPORT\" save your money.. my 20 year old 12v black and decker still works, albeit very weak...LOL",
      "rating": 1.0,
      "verified": true,
      "author": "mdoc",
      "helpful_votes": 91,
      "publication_date": 20200917
    },
    {
      "title": "Poorly constructed of cheap components.",
      "text": "Broke after one season. The problem is the plastic impeller and no doubt a plastic drive rod from the electric motor. The drive/impeller started making noise in July, suggesting it something was hitting the impeller housing. It got worse and worse until finally it stopped turning, burning out the motor in the process. The Greenworks pole chain saw works well and I might try to get the higher end blower, but am now leery of GreenWorks products.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger Lamoni",
      "helpful_votes": 12,
      "publication_date": 20170503
    },
    {
      "title": "JUST THE RIGHT SIZE AND POWER",
      "text": "I can't begin to tell you how many leaf blowers we have bought in our 40 years of married life! Gas blowers were too heavy, electric ones were a pain with the cords. Now that we are up in age, we had to have one that does a good job and can be handled easily by a 77 year old man...so we bought this one and it is JUST RIGHT! Not too heavy, easy to move around the yard freely and the battery lasts long enough to do our yard, deck, sidewalk. We are very satisfied, and we expect this one to be the last one we buy!",
      "rating": 5.0,
      "verified": true,
      "author": "JUJUGIRL",
      "helpful_votes": 2,
      "publication_date": 20200725
    },
    {
      "title": "GreenWorks Good, this product Bad.",
      "text": "Let me start out by saying I have many GreenWorks products, and love them all, with this being the exception. This thing is a joke. Works well as an upgrade to a broom for clearing out the garage or blowing off the driveway, but don't even kid yourself buying this thing to blow leaves off your grass. You'll spend an entire day trying to clear .20 of an acre of DRY leaves. At least I can use the battery with my other GreenWorks tools.",
      "rating": 1.0,
      "verified": true,
      "author": "Anthony Maiani",
      "helpful_votes": 9,
      "publication_date": 20171026
    },
    {
      "title": "Great product. Almost perfect.",
      "text": "I've been using this for about a year and am very pleased with it. Here are some hints on getting the most out of it: 1. Always have two batteries on hand (I have 3 for long jobs). The only notice that the battery is about to give out is the motor slows down a little. 2. Use at the lowest speed setting. Battery life is almost triple and the output is virtually the same as on the highest setting. And it's a lot quieter. 3. Keep the extender nozzle switch on high (or don't use it at all). No real difference between low and high position. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Locofan",
      "helpful_votes": 7,
      "publication_date": 20180526
    },
    {
      "title": "Great Lightweight Blower",
      "text": "Although not industrial strength, it is more than adequate for household jobs like driveway, deck, or dust clearing. It is super light weight, enabling one hand operation. It replaced my electric blower and thus reduced each task by 3/4 time as now no need to hassle with dragging the electric cord as you go. It thus also extends the distances from electric outlets. I was also able to use my existing Greenworks polesaw battery on the blower, so was able to get the blower w/o including a new battery and charger saving considerably on the blower's price. Very pleased with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Primo Won",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "the BEST EVER",
      "text": "LOVE this blower. I already owned the cordless lawn mower which I LOVE and it comes with two batteries and the charger. So, I could buy the blower at a lower price because it comes without the batteries as I already owned them. My \"new\" Black and Decker that I had bought when I moved in only lasted about 15 minutes when I was blowing off the porch and driveway....and just ON or OFF. This blower has 6 different settings from 1--6 and it is very powerful. And, the battery lasts for days. And....with two batteries, I can charge one and use the other one. Best investment EVER!",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Ann",
      "helpful_votes": 6,
      "publication_date": 20170428
    },
    {
      "title": "Best blower I have ever purchased",
      "text": "I have purchased more than five Black and Decker over the years, two corded and three cordless. This blower works better than any of them and the batter lasts twice as long. Use to take two and a half batteries in my B&D to blow off my driveway, today I used the Greenworks and cleared the drive with on battery and still had power left and took me half the time. So glad I spent the money for this, my only complaint is the replacement batteries aren’t cheap, when retires and on a fixed income, 70.00 for a good one is tough to fit in the budget.",
      "rating": 4.0,
      "verified": true,
      "author": "Claudia",
      "helpful_votes": 0,
      "publication_date": 20200409
    },
    {
      "title": "The seller has fantastic customer service",
      "text": "The reason I give it 5 stars is their service is so fantastic. I bought the blower in 2016, and it didn’t work just out of 4 years’ warranty. When I email the seller to ask for the technic help, the stuff from customer service was so nice and responded to me. After knowing the issue of the product and more information needed, they quickly informed me they would place an order to send out a new blower to me. What a good service ! I really appreciate it. Recommend strongly to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan Dan",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "My favorite tool!",
      "text": "I’ve had this blower for about a year now. It is one of my favorite tools. It hangs on the wall in the utility room. I use it every morning to blow off the patio and the front sidewalk and driveway. Takes me all of about five minutes. It is so handy and convenient. I use it to blow the garage out also. I just bought a second one to give to my daughter for her birthday. She has a new patio and will totally appreciate the ease of use of this tool. Highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Robin Baranowski",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "I will never buy from this company again!",
      "text": "I needed a light weight blower to blow out storage units, literally blow off concrete floors 1-2 week. I bought it in May of 2019, the battery quit working in February of 2020. I called customer service they asked me what I used it for. I use it at home but also to blow off concrete at storage units I own. They said because I used it at a commercial location the warranty would not cover this issue. I am so unhappy with that. It did work fine until I couldn't charge it any longer. It is not very powerful but I did not need it to be. It is very light weight.",
      "rating": 1.0,
      "verified": true,
      "author": "Lee",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Toy Blower",
      "text": "When I saw the small box at my door I anticipated disappointment. Once unpacked I found this blower to be on scale with one that a child might have as a toy. Then when I used it the first time I found that the blower produces what I would gauge as a 60 MPH force and absolutely nowhere near the 150 MPH advertised by Amazon. It is very compact and light. Easy to use, but don't expect performance. If you want something to blow dust with this might be your answer. Anything heavier, spend a couple of bucks more and go get a real blower not this toy one.",
      "rating": 2.0,
      "verified": true,
      "author": "C. Griffith",
      "helpful_votes": 0,
      "publication_date": 20200520
    },
    {
      "title": "Ok blower, battery / charger incompatible with previous model",
      "text": "Bought this blower hence previous model died on me after seven years. Guess what: Battery and charger of new gear not compatible to previous model. So totally unacceptable, since for example Ryobi is keeping their batteries compatible to ALL tools since decades! Besides, I wonder why the tool is rated only at 135 CFM when claiming to blow air up to 150 miles? Something wrong here. Regret I bought and didn't return while possible.",
      "rating": 2.0,
      "verified": true,
      "author": "RPB - Houston/TX",
      "helpful_votes": 2,
      "publication_date": 20191014
    },
    {
      "title": "Perfect for my needs",
      "text": "I bought this to blow out the garages, porch, sidewalks and driveway. For that it works very well. I already bought the Greenworks pole saw and weed-eater and was impressed with the products. I have one battery that fits all three. I also have an Echo backpack blower that I've used for years, but getting it out and firing it up is a hassle. This is so easy to use I'll be more diligent with my blowing. One thing to note, this will not be a good fit if you plan on blowing big amounts of wet leaves off the yard this fall. Even my big backpack blower has limits there. But for what I got this for it's perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Fleur",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Don't waste your money.",
      "text": "I've had this blower for 11 months. Initially the performance was excellent- albeit a bit wimpy, but I didn't buy it for pushing anything but leaves off the deck. It always has had a problem; even immediately after a charge- all the charging LED's lit, of cutting off. I'd cycle the switch on and off and it would do it again several times. Removing and reinstalling the battery doesn't work either. Now that's all it does. Runs for 8 or 10 seconds and cuts off. Cycle the switch, remove and replace the battery- runs 8 or 10 seconds and stops. This blower is a piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 2,
      "publication_date": 20190814
    },
    {
      "title": "Kinda Weak",
      "text": "This thing is kinda weak. I have a corded blower that will blow a pine cone fifty feet across the street. It does have enough power to do little chores. I can use my corded blower once a month after storms to clean the patio, and then use this in between to keep things neat and tidy just before parties. Don't get me wrong, I don't regret getting it. I'm not returning it. Dragging the 100 foot extension cord all around the house is a pain. This will make spruce ups easier. But, if you're looking for a high powered lawn blower, get an electric one. If you want a little spitzer, get this one.",
      "rating": 3.0,
      "verified": true,
      "author": "Terry Ball",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Great for Small Jobs",
      "text": "This blower is great for small jobs like removing leaves and clippings from patios, porches, and walks. It is also useful for blowing off excess water off of motorcycles and other vehicles after washing so the drying towel doesn’t get saturated. If you want something to move leaves in grass this is not your unit. With all Greenworks products, the tools far outlast the batteries. Expect to replace the battery every three to five years depending on how much you use them. This is my second Greenworks blower. The first one is six years old and is now being used by my daughter at her house.",
      "rating": 5.0,
      "verified": true,
      "author": "BSB",
      "helpful_votes": 0,
      "publication_date": 20190423
    },
    {
      "title": "It works, but ....",
      "text": "it functions as described. It’s compatible with G-Max 40V battery. Battery life seems to be reasonable. Well balanced, so easy to grip and use. Cordless is so convenient. I cannot image how I used a cord powered one before. However, it doesn’t have enough power blowing off leaves from back yard. It blows off, but only 1 or 2 feet. If leaves are wet or clumped, then they are moving. It’s useful for driveway or deck, but not much practical for back yard.",
      "rating": 3.0,
      "verified": true,
      "author": "Jongkook",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "150 mph?",
      "text": "I hate to leave a negative review but 150 mph? No way. I tried a friend's blower. It advertises 100 mph. This just isn't close to the 100 mph one. I destroyed the box (what was I thinking?) so I'm not going to return it. It doesn't quite do what I need it to do but I can make it work. It's very lightweight. But it also feels cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike B",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Easily Moves Leaves and More!",
      "text": "This is my 3rd Greenworks tool, and I am willing to say it will equal the quality I have come to expect from GW. This unit is powerful - it has SIX speeds set by a rolling knob. Plenty enough wind to move all kinds of leaves and dirt and spilled potting soil even! It is very light to handle. If this old man can handle it, you can too! It seems to use up more battery reserve than my GW mower, but that is what the charger is for. I have two GW batteries, so not a problem for me. I think you will be happy with this money-well-spent blower!",
      "rating": 5.0,
      "verified": true,
      "author": "Patchy Fog",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Blower is weakest link in the Greenworks chain in my humble opinion",
      "text": "Got this to go with the 12 inch saw, the weed wacker, the pole saw, and the hedge trtimmer all running from one 40V greeenworkds battery and that battery is good on most of their tools but on the blower it clealry needs to have an extra battery and thats kind of sad as this 40v will chop down a big tree and take it into pieces with and still have 3 bars left but nlwoing seems to take upo lots of the stored powere-I guess I will need to buyu a second battery or a better newwer version of the blower that is sgronger tool..",
      "rating": 3.0,
      "verified": true,
      "author": "UnimPeachable",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "If already have battery, why not?",
      "text": "If already have battery, might as well get this blower. It is weak on air pressure but does OK on dry leaf's on patio and deck. If no battery, the $100+ for complete unit is not worth it. Regardless, you will still need an electric or gas blower for complete cleanup. The light weight Is a big plus. Update: 3 stars to 4 stars. My wife loves this thing. It is light weight and easy for her to use, and she uses it more often than our corded versions. It is good for what it is intended.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Works Great For Me!!!",
      "text": "I was concerned at first to purchase this because of some of the reviews saying that this unit doesn't blow hard enough. I'm glad I took a chance. I received the item very quickly, thanks to Amazon prime two day shipping. I tried it out with a battery that fits my snow thrower, and it worked perfectly fine! I felt the unit blew very strong. I also have a works GT blower, and this green works blower does have a stronger wind to it, plus the variable speed control is a nice addition to have as well. I would Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "IPadMan",
      "helpful_votes": 4,
      "publication_date": 20170514
    },
    {
      "title": "Lightweight, powerful and easy to use!",
      "text": "The only thing I don’t like about this product is the charge doesn’t last long enough for bigger jobs. Love that it is lightweight, powerful and easy to use! Perfect for cleaning walk and patio. Not as good at blowing thick leaves in grass. Overall, I like this product which replaces two gas-oil models. No mixing or gas smell to contend with!",
      "rating": 4.0,
      "verified": true,
      "author": "ostbye",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Good for Small Jobs",
      "text": "Ordered this for small \"portable\" jobs like garage, deck, porches, etc. Charges quickly, sufficient blowing power for smaller jobs. Tapered nozzle so blowing is more concentrated, not sure it would be useful for wetter objects, piles of leaves, etc. but moves stuff off flat surfaces. Generally easy to wield, but larger battery makes it heavier than some B&D and other models with 20L batteries. Good value at under $100. Casing is not hi-grade plastic, so do not plan on throwing this around on hard surfaces.",
      "rating": 4.0,
      "verified": true,
      "author": "ManfredWD",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Awesome customer support!",
      "text": "We purchased this model for my wife who had a hard time starting our gas blower. It was exactly what we wanted! However...we had an issue with the fan breaking a while after our purchase. I called Greenworks customer support and they could not have done a better job replacing the unit. As we all know there are not very many times we get this quality service. I understand defects occur from time to time. It's how the service is handled when that happens. Greenworks did an awesome job and I'm pleased to have the opportunity to share that with you. Buy their product with confidence! Great job CSR237!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Nowak",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Disappointed battery and battery charge life cycle",
      "text": "Greenworks 24252 40V 150 MPH Variable Speed Cordless Leaf Blower made me feel happy in the begineeing, it made my yard work easy and felt happy. The weight is OK and I don't have problem to hold it 30mins+ Battery and Battery charge quality should need to improve. I need to push the battery to the charge hardly to make sure the contact good. Even the charge light shows green, I expect the battery fully charge; I could use the blower less than 5 mins. I called support couple times to replace the battery and battery charge, Greenworks leaf blower could not operate, and the product life cycle is around a year. I need to shop another leaf blower.",
      "rating": 2.0,
      "verified": true,
      "author": "Public",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Maybe it'll blow out a match... but not much else.",
      "text": "It works OK when blowing loose dirt or leaves off a concrete or paver surface as long as you do it quick because the battery runs out in about 15 minutes. If you are planning on blowing wet leaves out of a gutter, then plan on another blower.. this one doesn't have the power to blow out a match! Now I use the same battery in a GreenWorks pole saw and the battery lasts hours. So the quick drain has to be something with the blower.",
      "rating": 2.0,
      "verified": true,
      "author": "phil",
      "helpful_votes": 15,
      "publication_date": 20170325
    },
    {
      "title": "This is a nice little blower but not quite as handy as the ...",
      "text": "This is a nice little blower but not quite as handy as the 18v blower it is replacing. The on-off switch is inconveniently placed, requiring two hands to work it (one to hold the blower and the other to turn the switch on or of. The advertised speed of 150 MPH seems overstated or else my previous blower, which advertised 140 MPH was significantly understated. It works for me but I would not give it an unqualified recommendation.",
      "rating": 4.0,
      "verified": true,
      "author": "Johns",
      "helpful_votes": 4,
      "publication_date": 20171004
    },
    {
      "title": "Surprising results from small package",
      "text": "Bought this item to use to keep a sidewalk clear around a commercial business. When it arrived I seriously thought it was a toy. It's tiny, green, and completely plastic. However, once I charged the battery and fired this thing up it BLEW ME AWAY (pardon the pun). I would say that this unit has as much power as my gas blower and is much lighter and easier to handle for my team members. I've only had it for a day so I can't speak to durability or longevity but first impressions have been great!",
      "rating": 5.0,
      "verified": true,
      "author": "Frederick Geyerman",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Broke after 15mts",
      "text": "Loved it since its light weight and does a good job for a smaller yard. I wouldn't recommend it for big properties since the battery doesn't last very long. I bought the leaf blower in May 2018 and by August 2019 it quit working. The motor rattles. I tried to get a hold of the company but to no avail. I guess I just have to buy a better made product.",
      "rating": 3.0,
      "verified": true,
      "author": "Gabriele B. Armstorng",
      "helpful_votes": 2,
      "publication_date": 20190912
    },
    {
      "title": "Good small job purchase",
      "text": "The blower has worked good for blowing leaves from stone yard and water from the patio. Battery life while good is depleted quicker than I expected it might be. The blower takes the charge from 40V battery quicker than the hedge trimmers purchased at the same time. A more constant demand on battery even at lower power setting. It works good, I will purchase a higher capacity battery to do complete yard. I have only one battery, not the interchangeable one with trimmer as it was an open box purchase and came less the battery.",
      "rating": 4.0,
      "verified": true,
      "author": "Jimmy Myers",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Basic and effective for light to moderate use",
      "text": "Completely adequate for my needs - light blowing after mowing or trimming, or blowing dried leaves out of the gutter. Noisy, though; earplugs are a must. Lightweight, easy to use, and a blessed relief from dragging 150 feet of power cord around. I have a small Greenworks mower so used the 4AH batter. Kept the cost down and the battery recharges quickly. A half-hour of blowing on the lightest setting (sufficient) uses two out of four bars. Not exactly parsimonious of juice, but not a problem. If your needs are modest, this will be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Zork",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "The battery power lasts for even my longest jobs!",
      "text": "This product is fabulous. My last battery powered leaf blower wouldn’t last long enough for me to take care of both, my front and backyards. NOW though, this product has battery power to spare and I get EVERYTHING DONE! It is even lighter than my last one. I love this product and highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Lenore Baker",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Not up to snuff!",
      "text": "I bought this item to replace a corded blower. I chose this particular blower based on reviews, weight, price and clained \"150\" MPH. It was a real disappointment! It can barely clears leaves, small branches and acorn from my deck. Forget this blower if you have sny heavier job to accomplish (like a lot of leaves or wet leaves!) After a couple of uses, I ordered a more powerful blowervfrom the same manufacturer. I did not go through the hassle of return the item.",
      "rating": 2.0,
      "verified": true,
      "author": "Ho N. Nguyen",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Not reliable!",
      "text": "Sold all my lawn equipment and purchased all electric Greenworks. Not happy I did. I have had 2 blowers and 1 string trimmer go bad. The chainsaw I ordered is also missing the oil fill cap. I never tried to do warranty work. But I did try to get the cap replaced. Greenworks never responded to me. Seller also never responded and declined the return since it was out of time. Never again Greenworks.",
      "rating": 1.0,
      "verified": true,
      "author": "Oscar",
      "helpful_votes": 2,
      "publication_date": 20181017
    },
    {
      "title": "The nozzle is loose!",
      "text": "It so poorly made that I don’t want to use it. (Watch my video of how poor the nozzle fits.) The blow power also feels weak. Thinking of returning it but got stuck with the battery system because of the Greenworks lawn mower that I also have. That one is OK but also has design issues. My conclusion after this purchase is it is better pay more for a quality product.",
      "rating": 3.0,
      "verified": true,
      "author": "Vasiliy Kerov",
      "helpful_votes": 0,
      "publication_date": 20190729
    },
    {
      "title": "Cant't Get Any Better Than This",
      "text": "I had a 2 cycle backpack gas blower that was hard to use and would never start without a lot of headache. Yesterday after much aggravation with the gas blower, I decided to ditch it and order this one which was very attractively priced . It arrived today after lunch, much easier and faster than going 20 miles to a big box store. Charged the battery in about an hour and used it right away. It worked much better than the gas blower, was much lighter, was way less noisy and did not produce smelly exhaust fumes. No longer have to mix gas and oil and worry about the fire hazard. What an improvement.",
      "rating": 5.0,
      "verified": true,
      "author": "Miles River",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Nice product",
      "text": "Purchased because I have a greenworks mower and can use the same battery on the blower. I like that you can control the speed. All my old ones didn't have that feature. I use to wait for the battery to start to run low to control the leaves and get them into a pile. Now just turn down the speed. I bought a back up generic battery thinking I would need a second one to finish cutting front,back lawns and blow . The battery went dead in 2 months. Suggest not buying generic.",
      "rating": 5.0,
      "verified": true,
      "author": "joseph r",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Battery useless-Dont buy",
      "text": "The blower itself is ok. The battery is terrible and makes this product mostly fraudulent. After a very short period of light use, the battery wont last more than 30 minutes on high power, which is the only way this blower is useful. Save your money and do not buy this product or anything from Greenworks...it doesn't!",
      "rating": 1.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 6,
      "publication_date": 20170729
    },
    {
      "title": "Routine replacement Parts not available.",
      "text": "After 1 season of use, the fan that drives airflow in the blower failed. The fan is a cheap plastic turbine style fan that is going to fail pretty frequently, and that should be available as a replacement part. However, the fan is NOT available. I have several of the greenworks tools, but will not buy any more-- I have had similar problems with unsupported wear components on the weedwacker and the chainsaw. After just a year of light duty homeowner use, my tools are held together with JB weld and duct tape. No support, no available parts, not much of a warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Another Customer127",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great Home Yard Blower",
      "text": "I bought this as a gift for my husband, as we also have the lawn mower. He said it was a good blower, for the price and the power. Certainly he would love one with 500 mph to how the clippings but the expense of such is so high we bought this. So yes, definitely recommend for a home yard. The ease of the battery is perfect, and fumbling with a cord is a thick if the past. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "DKNH",
      "helpful_votes": 0,
      "publication_date": 20200918
    },
    {
      "title": "Dead after 6 months of light use.",
      "text": "This thing worked alright for a time. Blowing power was adequate for our small lot. Issue is it keeps turning off after running for 5 seconds or so. Made sure the battery is charged and clicked into the blower. Only used this thing a handful of times and it is essentially dead after 6 months. I can't recommend this particular product from Greenworks. I've had much better luck with their Lawn Mower and Pressure Washer.",
      "rating": 2.0,
      "verified": true,
      "author": "Lance B. Ramsay",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Not Worth the Money",
      "text": "The leaf blower is light, however for 116.00 it does not blow very well. If the leaves are wet in the driveway, the will not move unless the blower is extremely close to the driveway. It will blow leaves off the porch, light duty only. I am disappointed in the product. I put in my shed and will sell it in my yard sale.",
      "rating": 2.0,
      "verified": true,
      "author": "A Grandma",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Greenworks is Great!",
      "text": "I bought this over a year ago and I use it a lot, more than I originally thought I would. In The spring there is blossoming fluff everywhere, then a short summer, then 3 months of falling leaves on my front stoep. I’ve successfully kept it all at bay and I only use the 2nd and 3rd settings out of 5. 5 is really strong. I laugh at my neighbours who spend 4-5 times longer sweeping their stairs. This is not expensive and saves loads of time and effort.",
      "rating": 5.0,
      "verified": true,
      "author": "David B",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Buy if you like taking all day with long breaks.",
      "text": "I don't know how this stacks up against other ones, but the small battery life is completely frustrating. I have to charge it for 2 hours for every 20-25 minutes of usage. I have a sizeable yard so it's going to take me at least 2 full days. I mean what's the point?The breakdown is like this: 1-1:15 hours of work to 6 hours of charging. Unbelievable. I don't have any way to test it, but 150 mph really? I don't see how that's even remotely possible with this. If I knew this before purchasing I would have gotten something better.",
      "rating": 2.0,
      "verified": true,
      "author": "NickSausley",
      "helpful_votes": 2,
      "publication_date": 20171126
    },
    {
      "title": "Not enough power",
      "text": "The battery is awkward to handle. Find it a bit hard to slide onto the charger. Do not like the on/off button on the front. Also awkward pushing it on and off while holding it in one hand. Button should be on the top of the handle. Holds a decent charge. Not all that comfortable to hold as it is handle bulky. Does not move leaves all that well. I find it disappointing. Will keep it because it is cordless and convenient.",
      "rating": 3.0,
      "verified": true,
      "author": "Leonard",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Broke immediately",
      "text": "I charged up the battery (which charged quickly). But when I started the blower the fan seemed to go off balance and bind and seize up within seconds. Seemed pretty cheaply made from that standpoint. I did an Amazon return, which they processed quickly, and bought a KIMO 20V Cordless Leaf Blower, 2-in-1 Battery Powered Sweep/Vacuum from Amazon instead (and it seems like a nice little unit so far).",
      "rating": 1.0,
      "verified": true,
      "author": "TEK",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Excellent for its size",
      "text": "Excellent power for such a light machine. I couldn’t believe the power at the lowest setting and when I chose the higher setting, unbelivable. With fall here, we just purchased a house with property and now that leaves are coming down, I was afraid that I would slip if I didn’t get the leaves to the side. This little machine is very light weight but it does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste C. Pacifico",
      "helpful_votes": 0,
      "publication_date": 20201010
    },
    {
      "title": "Meh, it's a blower for dry leaves.",
      "text": "The lock button to hold the blower tube on is depressed too far to hold the tube on. Otherwise, worked ok. Using for clay target debris and it's a little too heavy for this boat. Wet leaves might be the same problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Tome Hills",
      "helpful_votes": 3,
      "publication_date": 20181214
    },
    {
      "title": "Wish I had bought this years ago.",
      "text": "I was so tired of pushing the broom for over 50 years. Grandma is always looking for a gadget to make my life easier and this does the trick. Love it! Cordless, no fumes and best of all, it’s incredibly light weight. Just snap in the battery, turn it on and I’m set. I do the street, driveway, drains and even the easy to reach house gutters. Porches, decks, walkways and more. We have a lot of pine needles and cones, leaves, twigs and dirt here on our 1/2 acre lot. This cuts my time spent on sweeping and raking tremendously.",
      "rating": 5.0,
      "verified": true,
      "author": "TUTU",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "I LOVE this compact blower!",
      "text": "Everyone does NOT need a giant blower! This one has lots of power to do any of the tasks we have challenged it with. Mainly we blow acorns all off the driveway and leaves on off our front porch. The adjustability of the power is a great feature because for uses such as ours a very powerful blower would be overkill and would move our mulch around. We generally use it on one of lowest power settings to avoid just that. We have the electric pressure washer by Greenworks also and are extremely pleased with it! Seems this company makes good, Kermit colored equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Very Pleasantly Surprised",
      "text": "Very Pleasantly Surprised This is light and easy to manage. Has great power for clearing off my patio and carport. My use does not require blowing anything that is wet so I can not speak to the effectiveness in that situation. The battery is easy to take on and off the blower and charges quickly. The battery life is sufficient for my needs and I have had it run for about 45 mins straight at one time with no degradation in power. Not something I would normally have purchased but I am very glad that I did.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Knotts",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "light weight & easy to use",
      "text": "Great for blowing the leaves from the tennis court, the pool deck area, the front porch and the walk ways around the home. No Electric cord required and easy runs more than an hour using a fully charged battery pack. We use the same battery packs for our lawn mower and weed wacker and hedge trimmer. I recommend you keep a minimum of 2 battery packs fully charged if you plan to use all 4 devices on the same day!",
      "rating": 5.0,
      "verified": true,
      "author": "Curt",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Great Product",
      "text": "I've had this cordless sweeper for almost two years and it does an excellent job. I like the fact that you can easily adjust the amount of air flow. It does a great job on leaves, grass clippings or whatever. The battery lasts long enough to do what I need it to and then some. Plus, it recharges quickly. I've had different types of these blowers over the years and this is by far the best.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer Too",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "Reliable and surprisingly powerful!",
      "text": "Man this thing blows : ) seriously though, for how small this thing is and how inexpensive it is this thing has a lot of power on its highest setting. I bought it to blow grass off the sidewalk and driveway after I mow and it's perfect. I intend to use it when the leaves fall in autumn as well and expect it will be more than up for the task. Even my small green works battery lasts forever in this thing. I plan on pulling it out in the winter and see how it does at blowing snow off my porch in the morning! Lots more uses than I thought for this cool blower--definitely worth the cost!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua B. Hall",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Just Ok - should have been better",
      "text": "Excellent - for porches and blowing out the garage. Good - for sidewalks Ok - for blowing grass clippings off driveway (2-car) Bad - do not plan to use in the lawn Rated 3 - stars as could not effectively blow grass clippings off drive way. Did it blow them off, yes mostly but took many passes. Some clippings still held on to the rough pavement. Also The blower tube is fairly short, I am only 5'8 and need to lean down somewhat to get the proper angle to allow air to swirl and lift derbies from the pavement surface. The new model looks like it doubles the air volume - should have spend the extra money on it.",
      "rating": 3.0,
      "verified": true,
      "author": "JasonB",
      "helpful_votes": 2,
      "publication_date": 20160730
    },
    {
      "title": "Perfect!",
      "text": "Small leaf blower that gives me way more than 20 minutes than most said. I use for just minimal leaf blowing & debris. I have a yard service but definitely more powerful than some are giving it credit for. Has a special nozzle that with a quick click will concentrate more direct air if needed for stubborn areas like cobwebs! So lightweight, easy & quick charge. A good purchase for me!",
      "rating": 5.0,
      "verified": true,
      "author": "AKLC18",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Say hello to my little friend",
      "text": "Hey ladies! Never pick up a broom or rake outside again....purchase this GreenWorks blower...Open the box. Plug in the charger, which, by the way is INCLUDED with this purchase. Charge the battery. Easy Peasy snap the battery pack in to the blower. I used to dread outside cleanup with a broom around my pool, front porch, walkway, windows and driveway. Pine needles, leaves and dust outside are blown away with this little workhorse...literally. Use a sweeping motion on a 30 minute charge. Dirt outside needs to stay outside, keep it out of your house. Super easy to set up, charge, use and store.",
      "rating": 5.0,
      "verified": true,
      "author": "B.K.",
      "helpful_votes": 0,
      "publication_date": 20170709
    },
    {
      "title": "Good Blower for Light Service",
      "text": "I purchased this for my wife's use to blow leaves off our decks (3). It is light weight but has significant blowing power. The blower runs for approximately 30 minutes at full power. I was impressed how long it lasted on one charge. I haven't timed how long it takes to recharge but it seems very quick. If you buy this blower be sure not to leave the battery in the charger regardless if it is plugged in or not and don't leave the battery connected to the blower when not in use. If you do this the battery will serve you for years.",
      "rating": 5.0,
      "verified": true,
      "author": "Really!",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Doesn't hold charge long",
      "text": "I'm disappointed in this blower. I thought it would hold the charge for at least 25 or 30 minutes. No luck. I need to typically use the blower at at full power, and the charge only lasts 15 minutes. Also, the battery often is difficult to remove from the blower.",
      "rating": 3.0,
      "verified": true,
      "author": "Chantillielace",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Great for little patios, garage sweeps",
      "text": "The battery keeps a full charge beyond what I need it for, so that's great! I have a side patio yard that keeps getting silk oak leaves, flowers, pollen on a daily basis, so this is handy for blowing all that to a place where I scoop up into the trash. I use the same battery for the line trimmer, and the hedge trimmer so all good there. I debated buying the mower but bought a Kobalt instead; I do have two chargers and batteries now which I kinda regret.",
      "rating": 5.0,
      "verified": true,
      "author": "Photographer AdvocateTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "Lightweight and powerful",
      "text": "We purchased this blower a few months ago. The battery is interchangeable with our Greenworks lawnmower batteries. It is very powerful and I keep it on the lowest setting. My only drawback is the power switch is in front, and it would be much easier on top where the thumb could easily turn it on/off. Otherwise it's a breeze to operate and clean the porch, sidewalk, driveway, deck, and patio with ease. It has cut my clean-up time by 75%. We love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill Turner",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "powerless",
      "text": "Even if I use the blower in highest mode, definitely it doesn't blow with 150MPH power. It is I guess around more like 100 or max 110 MPH. I have electric Craftsman blower which is the most simple blower with the same 150 MPH , there is a huge difference comparing to this unit. Not recommended at all.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Sen",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Barely blows pine needles, and is not as quiet as rated",
      "text": "I bought this because it was rated as being one of the quieter leaf blowers. It's not any more quiet than my Worx, and it hardly blows anything! It couldn't even blow maybe 5 pine needles at a time. I would NOT recommend this for anything. I'm going to buy another Worx. (And no I don't work for Worx, I just know a bad product vs. an OK product. The Worx is loud, but then I'm realizing most leaf blowers are loud.)",
      "rating": 1.0,
      "verified": true,
      "author": "martello",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Broke in less than 1 year.",
      "text": "Like several people on here have noticed, this blower isn't designed to last. It died in less than a year. And I only used it maybe 15 times. I knew something was up when I started smelling a burning smell from the motor. This is from only after 2 minutes of use. Today, I smelt the burning smell almost immediately. Then... a click... and it quit working. From what I read, the manufacturer will just get me to drive someplace to get it repaired. I don't have time for that. I'm calling this a lose.",
      "rating": 1.0,
      "verified": true,
      "author": "Rich",
      "helpful_votes": 6,
      "publication_date": 20170422
    },
    {
      "title": "Why did I wait so long to switch to battery??? SMH",
      "text": "Absolutely love the Greenworks products! Bought the blower to go with the trimmer and have ZERO regrets. I get a solid half hour+ use out of the trimmer which is perfect for my needs. I bought a second battery just for the blower so I can go right from trimming to cleanup with no down time. While this doesn't move as much as my gas unit did, I've never thrown this one across the yard because it wouldn't start! It's also nice to not have to mix oil & gas and stink like exhaust every time I use this equipment. As long as the batteries hold up, I'm a super happy customer!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20170713
    },
    {
      "title": "Love this blower!!",
      "text": "I had been considering a different brand since I already had the requisite battery and charger. But reviews were so bad. Then I remembered I also have batteries and a charger for the Green works 40V line. So thrilled with this blower! I snapped the tube on the front, popped the battery in place, set the power level to 4, and whoosh! My long, filthy driveway, back deck and sidewalk were completely cleaned off in no time. Great product!!",
      "rating": 5.0,
      "verified": true,
      "author": "MingoFan",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "It's OK..",
      "text": "It works fine for dry leaves on pavement. Very light. Acorns, Wet leaves no. So I use it for daily sidewalk sweeping and it works for that. But for wet leaves in grass and little sticks I break out my monster corded leaf blower. If you want a \"do everything\" cordless blower it's going to cost you a $100 more than this unit.",
      "rating": 3.0,
      "verified": true,
      "author": "John R.",
      "helpful_votes": 0,
      "publication_date": 20201013
    },
    {
      "title": "Terrible product - do not purchase",
      "text": "Blower does not have power enough to blow leaves off the drive and with two batteries get only about 15 minutes of power. Disappointing product. Contacted manufacturer and received no response. So not good customer service or product. Avoid. Landscaper recommended Makita products, and confirmed Green Works is not a good manufacturer.",
      "rating": 1.0,
      "verified": true,
      "author": "P. Loftis",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Greenworks 40V leaf blower",
      "text": "It died after 6 months of light use. The battery no longer able to charge. The built is very cheap plastic which makes it light. It worked well when it is working but unfortunately it is not design to last. To replace the battery is nearly the cost of the unit. You cannot use other 40v brand battery as Greenwork tools are not interchangable with other brand battery. So ended up getting a gas-based blower which hopefully work out better.",
      "rating": 1.0,
      "verified": true,
      "author": "TY",
      "helpful_votes": 2,
      "publication_date": 20180729
    },
    {
      "title": "Throw away your broom!",
      "text": "Love this blower/sweeper! It's perfect for 'sweeping' porches, walkways, light lawn debris. I was really surprised by the power; most of the time I don't even have it adjusted to the highest power and it works great! I bought one for home use and am now purchasing an additional one for our summer home. To be clear, it is not meant to replace a dedicated leaf blower with more blowing power, but it's perfect for sweeping. My patio, sidewalk and porches are much cleaner now because this device is so easy to use!",
      "rating": 5.0,
      "verified": true,
      "author": "D Yodo",
      "helpful_votes": 2,
      "publication_date": 20170616
    },
    {
      "title": "Cordless ease of operation",
      "text": "This is so much better to use then a corded blower. Just pick it up and pull the trigger. It is powerful enough to blow 3/4\" gravel on the concrete apron by my barn door. The 40v battery has a long enough life to accomplish several tasks before requiring recharging. Considering a second purchase to keep at the house.",
      "rating": 5.0,
      "verified": true,
      "author": "ajk1941",
      "helpful_votes": 0,
      "publication_date": 20200803
    },
    {
      "title": "Inexpensive and reliable",
      "text": "After owning this a little over a year now, this product holds up to the value. Probably won't perform well as the gas operated ones but does a hell of a job for basic house holds needs, especially with the six strength setting. As a full charge will last about 20 to 30 mins on full blast, but was enough to clean the front yard and back either it's dry or wet leaves. From my experience I would definitely recommend to anyone as it still fits the budget😁",
      "rating": 5.0,
      "verified": true,
      "author": "Tony Thai",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Need not to look further.",
      "text": "What I liked about this Greenworks 40 Amp power blower is ? Everything ! it is very well made the 40 amp, battery gives you more then enough power, you also can adjust the flow to blow in the area. Myself I have moved on to Greenworks equipment, all of the equipment runs on a rechargeable battery's myself I always keep an extra battery in the event you can swap it out to start or finish a task. So blow away and enjoy with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "Deltonrab",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "No more pulling electric cords around!!!!",
      "text": "My electric leaf blower is a Green Works and it works great but I have to use it too frequently. With my new cordless one I can just grab and go. I have 2 big oak trees over my deck and 1 big one on the side. Between the acorns falling, then the leaves and now the little fuzzies that are dropping I need the weed blower a lot. I am very impressed with my new cordless model. It has 6 speeds which I really like. The only recommendation I have is the on and off switch. That needs to be redesigned. It is too small and inconvenient.",
      "rating": 5.0,
      "verified": true,
      "author": "Betty S.",
      "helpful_votes": 0,
      "publication_date": 20200326
    },
    {
      "title": "Rico's View!",
      "text": "Works great for my purposes. Not as powerful as my gas blower but a lot easier to use. My only complaints are that they do not come with a 4AH battery. It cost me more for a backup 4AH battery than the unit which comes with 1 2AH battery and charger. My other complaint is that the batteries take a long time to charge. The 2AH battery takes a hour to charge! The 4AH battery takes 2 hours to charge!.",
      "rating": 4.0,
      "verified": true,
      "author": "RJC",
      "helpful_votes": 5,
      "publication_date": 20160705
    },
    {
      "title": "Nice while it lasted",
      "text": "Lasted one season then suddenly quit working. It doesn't have much power but is handy for simple, light, clearing of walkways. Not enough power to adequately blow leaves on grass. Needs a frictionless smooth surface under the objects you're blowing to move them. For leaves I used either a gasoline engine powered blower or a corded blower (depending if I can get the petrol one started or not). This battery operated blower has about 1/4 the power of my other blowers.",
      "rating": 2.0,
      "verified": true,
      "author": "felicia",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Fabulous Blower",
      "text": "I am a woman who is over 70 years old and who is often in need of blowing leaves and other garden material. This blower is terrific. I have had it for two years now and have even left it out in the rain by mistake a few times. It continues to perform to perfection. It is light enough for me to handle and strong enough to handle any job I have. My only suggestion would be to buy an extra battery so you don't need to get interrupted during a big job.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Snyder",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "I'm going to keep it because I don't see anything in that price range that's better, but if I had to do it again",
      "text": "It says 150mph, but it's really weak. I have another brand that's 120mph, and that is stronger than this one. Also, the on and off switch is in a weird location. One handed operation is not possible. I'm going to keep it because I don't see anything in that price range that's better, but if I had to do it again, I probably won't buy this one.",
      "rating": 2.0,
      "verified": true,
      "author": "James L",
      "helpful_votes": 3,
      "publication_date": 20170812
    },
    {
      "title": "How this one got so many high reviews is beyond me! No way 150mph",
      "text": "I charged the battery and was ready to go move some leaves and blow sawdust from my garage floor. Hardly a whimper. I had it at full speed and while it claims to be 150mph, no flipping way!!! My plugin Craftsman unit was only 120mph and out-powered this one nearly 2 to 1. I'm not likely going to keep it.",
      "rating": 2.0,
      "verified": true,
      "author": "John E. Litton",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "150 mph? Maybe downhill!",
      "text": "I don't have a wind machine to calibrate the speed of this blower, but it does a reasonable job for light things like pine needles and leaves on my deck and blowing out the dust/dirt from the garage. I initially was hoping to use it to blow light dustings of snow off of my driveway, but just doesn't quite have the power for that. Portable enough and easy to use. Charging is rather quick",
      "rating": 4.0,
      "verified": true,
      "author": "Ninja Jim",
      "helpful_votes": 0,
      "publication_date": 20191111
    },
    {
      "title": "Not so much...",
      "text": "This blower had so many positive reviews, that I was shocked at its poor performance. It is true that it is light weight, but the balance is off. The blowing power is DISMAL at best. I thought that with the tapered end, that I could easily blow out my garage or my deck. I understand that this is not marketed as a \" leaf blower\" and is not meant to move large piles of material. I have a hair dryer that could probably move more air. That said this is not my first Green Works purchase. I also own the 40v cordless pole saw which is Awesome. Well, back to the hunt...",
      "rating": 1.0,
      "verified": true,
      "author": "TMac",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Used on fall season",
      "text": "This only worked for one fall season and I only used it to blow the leaves off from my husbands disability ramp same as others battery charger shows red and nothing !!",
      "rating": 1.0,
      "verified": true,
      "author": "Star Shopper",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Not too loud, not powerful enough for professional use",
      "text": "Not as loud as a normal blower, but not as powerful either. That is fine. I'm only using it to dust off my mower and blow off my patio/garage/deck. Has an adjustment on the tip for \"down/up\" blowing angle, likely good if the standard holding angle doesn't work for your height. Power button on top with a 1-6 scroll wheel for power located at the thumb. Never thought I'd go yuppie enough to need a leaf blower but it fits my existing battery packs and so I only needed to buy the main tool (inexpensive for wireless/gasless).",
      "rating": 5.0,
      "verified": true,
      "author": "TastyWhale",
      "helpful_votes": 2,
      "publication_date": 20160927
    },
    {
      "title": "Powerful and Light weight",
      "text": "Powerful. Not nearly as ear piercing as my old leaf blower. I bought one for me and liked it so well, that I bought another for a friend. I would buy this again if needed. I've had it for 2 years. I really only ever use it to blow out the garage, so I'm not sure how long you can run it on just one battery charge. It's super light weight. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn C.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Powerful with great battery life",
      "text": "It is perfect to handle my large deck, front walkway and doorstep without the bother of a cord or gas engine. Powerful enough to remove a heavy load of wet leaves and lots of acorns that got rained on before I could get to them at the peak of fall. Haven't fully tested battery life but it has always maintained full power throughout use of up to 20 minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "John R",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "After 11 month it sounds like the end is near.",
      "text": "I bought this mainly for my wife as I use a gas blower for the yard. She wanted something to clean the deck and patios. It has been used infrequently for light work. It is loud and lately getting louder. Today it sounded like a bearing is close to seizing but the loud noise comes and goes so we will see. I expected better than this!",
      "rating": 2.0,
      "verified": true,
      "author": "Bob",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "Alex Ruth",
      "text": "The first charging can be a little confusing, but keep reading what to do when the second light is blinking and follow the instructions to get it to charge correctly. This is very light weight and is great for light blowing of the deck, driveway and porch. It takes a stronger one to work well for blowing the entire yard .",
      "rating": 4.0,
      "verified": true,
      "author": "Julia Ruth",
      "helpful_votes": 3,
      "publication_date": 20171018
    },
    {
      "title": "Lots of power to be so small and lightweight",
      "text": "Really blows good on high. Will save a lot of time sweeping porch and driveway.Its actually fun to use. Uses more battery than the mower which is a bit odd.I now have 3 greenworks lawn care products and happy with all 3. I can do most of my own lawn care now.",
      "rating": 4.0,
      "verified": true,
      "author": "petunia",
      "helpful_votes": 0,
      "publication_date": 20190911
    }
  ],
  "product_meta": {
    "title": "Greenworks 40V 150 MPH Variable Speed Leaf Cordless Blower, Battery and Charger Not Included 24282",
    "description": "Style:Tool OnlyGreen Works G-MAX 40V Lithium-Ion Cordless Variable Speed Sweeper features a low maintenance, light weight design with wind speed up to 150 mph with additional speed control through Sweeper tip. Tool Only Model. Compatible with G-MAX Batteries 29462 and 29472 only.",
    "rating": 4.2,
    "feature_bullets": [
      "High Performance G-MAX 40V Lithium-Ion Battery delivers fade-free power with no memory loss after charging",
      "Variable speed delivers wind speed up to 150 mph, perfect for cleaning debris and leaves off hard surface areas and patios",
      "Additional speed control on Sweeper tip offers better sweeping and gathering capabilities",
      "Lightweight robust design for user efficiency and ease of use",
      "Compatible with GreenWorks G-MAX 40V Li-Ion System for higher efficiency and longer run time",
      "Ideal for light to medium duty clean up tasks"
    ],
    "specifications": {
      "Product Dimensions": "19.1 x 7.5 x 10.8 inches",
      "Item Weight": "3.5 pounds",
      "Manufacturer": "Sunrise Global Marketing, LLC",
      "ASIN": "B00D3KJN34",
      "Item model number": "24282",
      "Batteries": "1 Lithium ion batteries required.",
      "Customer Reviews": "4.2 out of 5 stars5,411 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#354 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Leaf Blowers & Vacuums",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 49.98
  }
}