{
  "website_summaries": [
    {
      "verdict": "The Lenovo IdeaPad Yoga 11S is a versatile touch-enabled convertible laptop/tablet combo. We applaud Lenovo for its innovation, but internal components and battery life in particular leave us asking for more.",
      "pros": [
        "10-point touch screen",
        "Range of convertible positions",
        "Nice IPS panel",
        "Comfortable keyboard",
        "Boots and reacts quickly",
        "HDMI out port"
      ],
      "cons": [
        "Low battery life",
        "Extra heat venting mars tablet mode",
        "Overly aggressive ambient light sensor",
        "Motion control is gimmicky",
        "No 5GHz WiFi"
      ],
      "aspects": {},
      "publication_date": 20130624,
      "rating": 6.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Overall - very impressed",
      "text": "Very robust, compact machine with quick performance and a flexible user friendly interface - perfect for working on the move. I haven't tended to use the tablet mode as much as I thought, owing to size / weight / formatting, but handy to have on the odd occasion.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr B spiller",
      "helpful_votes": 2,
      "publication_date": 20140207
    },
    {
      "title": "Great multifunction ultra book",
      "text": "Fantasic product, fast and the option to use as a tablet is ideal for a windows 8 PC, memory capacity is not huge but no issue compared to the other benefits this excellent product has.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian MacDonald",
      "helpful_votes": 0,
      "publication_date": 20140417
    },
    {
      "title": "well made up",
      "text": "A tablet and a laptop all rolled in one over the moon with this baby the blue moon is rising",
      "rating": 5.0,
      "verified": true,
      "author": "Muhammad Arshed",
      "helpful_votes": 0,
      "publication_date": 20140303
    },
    {
      "title": "Excellent service",
      "text": "Prompt delivery service, was easy to track and arrived exactly as stated. The Lenovo Yoga is an excellent machine with fast boot up and does everything I expected of it",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Higson",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "Very happy with above LenovaYoga",
      "text": "Very happy with above LenovaYoga.Impressed with the machine for my needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Mahendra",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Slow",
      "text": "This device is very slow as i expected it to be faster than this. But it is a very stylish device",
      "rating": 2.0,
      "verified": true,
      "author": "ARSALAN CHAUDHRY",
      "helpful_votes": 0,
      "publication_date": 20140318
    },
    {
      "title": "Great piece of kit",
      "text": "Great piece kit, great build quality and super fast. Keyboard a little ridged but once your used to it no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronzer",
      "helpful_votes": 0,
      "publication_date": 20140416
    },
    {
      "title": "Lenovo Yoga 11s 11.6 inch touchscreen Ultrabook",
      "text": "This is an excellent small laptop, the screen is as good as the best tablets with wide viewing angles and the Lenovo system backup works great as does the one touch close down. For those who would like a tablet with Windows 8 this is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "CapelOwl",
      "helpful_votes": 2,
      "publication_date": 20140405
    },
    {
      "title": "Superb",
      "text": "Light, fast, stylish, stable, affordable. The best choice in its price range. Highly recommended! You can't go wrong! Good luck",
      "rating": 5.0,
      "verified": true,
      "author": "Miss C DENG",
      "helpful_votes": 5,
      "publication_date": 20140204
    },
    {
      "title": "Very nice and perfect",
      "text": "Its nice product having less prize and slim design, with good performance. Considering prize factor, processor, weight, design its worth.",
      "rating": 5.0,
      "verified": true,
      "author": "PKapoapra",
      "helpful_votes": 2,
      "publication_date": 20140211
    },
    {
      "title": "Perfect small laptop",
      "text": "It is not the perfect tablet but works quite good. Screen definition is more than enough. Very handy and light",
      "rating": 5.0,
      "verified": true,
      "author": "JOAO LUIS DIAS",
      "helpful_votes": 3,
      "publication_date": 20140108
    },
    {
      "title": "Like",
      "text": "quick delivery. One specific thing; the keyboard and windows language is Spanish.. dont be surprised, it was the only thing that inittialy shocked me.. Can be easily solved though.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 2,
      "publication_date": 20140225
    },
    {
      "title": "wonderful machine",
      "text": "Very well made ultrabook, so quick to boot and shutdown. Brilliant as a tablet or laptop,still getting used to windows 8. prefer the traditional desktop at present.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Stocks",
      "helpful_votes": 15,
      "publication_date": 20131212
    },
    {
      "title": "Good pc",
      "text": "It's my first pc and, honestly, my last one. In my entire life I had Macintosh and they're absolutely better in everything, but this ultra book by lenovo is really a good choice in windows universe. Light, fast, beautiful. Maybe it will be a good hackintosh :D",
      "rating": 4.0,
      "verified": true,
      "author": "Alessandro",
      "helpful_votes": 0,
      "publication_date": 20140131
    },
    {
      "title": "Brilliant laptop especially for the price on Amazon",
      "text": "The build quality is excellent and the screen is great, it is very liberating to be able to use the laptop in tablet mode without any messing with docks. It boots up unbelievably quickly and is very quiet. The only negatives are with Windows 8/8.1 but that is more about getting used to the new layout and location of settings, windows 8.1 helped me to get over most of the issues I had with the OS.",
      "rating": 5.0,
      "verified": false,
      "author": "M. Lyons",
      "helpful_votes": 0,
      "publication_date": 20140114
    },
    {
      "title": "Unhappy",
      "text": "This product is most probably the worst thing I have ever bought! None of my other devices will sync with iTunes - they are only recognised as external hard drives. Was thinking of getting it fixed so called lenovo support, their service is worse than their product so I have sent it back to amazon. Amazon's service is impeccable however!",
      "rating": 1.0,
      "verified": false,
      "author": "Sheryl",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "Worst customer service",
      "text": "Beware - great while it works but if it goes wrong, Lenovo's customer services are the worst - and that's by design. I have a complaint in with trading standards. If you pay the lower price, then you are taking the risk that if it goes wrong there is no back up - they play on the fact that very few people will pursue them if they simply make it difficult to enforce your statutory and common law rights.",
      "rating": 1.0,
      "verified": false,
      "author": "M-M K. PCE",
      "helpful_votes": 4,
      "publication_date": 20140120
    }
  ],
  "product_meta": {
    "title": "Lenovo Yoga11s 11.6-inch Laptop (Silver) - Grey (Intel Core i3 3229Y 1.4GHz Processor, 4GB RAM, 128GB SSD, WLAN, BT, Integrated Graphics, Windows 8)",
    "description": "THE LENOVO YOGA 11S -- ULTIMATE FLEXIBILITY BETWEEN WORK AND PLAY\nThe Lenovo Yoga 11S combines the productivity of a laptop with the touch experience of a tablet, taking full advantage of the Windows RT functionality and Intel Core i3-3229Y processor. The screen flips a full 360 degrees into four modes that make it easy to create, share, or consume content. Combine those with its long battery life and motion control and the Yoga provides ultimate versatility.\n\nThe durable hinge makes it possible to go from notebook to tablet in a second. The Yoga 11S is a multi-mode Ultrabook providing the ultimate flexibility between work and play in a device featuring a 10-point touchscreen.\n\nAT A GLANCE\n *  10-point multi-touch screen that folds back 360o .\n *  Long battery life (up to six hours) for extended use on the move. \n *  Lenovo Motion Control lets you quickly flip through photos, power point slides and e-book pages. \n *  Lenovo Transition automatically switches open applications to full-screen mode. \n *  Integrated stereo speakers supporting Dolby Home Theater v4.\n\nSimply flip the screen to choose one of the four available modes: Notebook, Tent, Tablet or Stand. Click here to see a larger image. ULTRA FLEXIBLE\n360-DEGREE FLIP AND FOLD DESIGN\nThe Yoga's patented Lenovo Lock mechanism enables you to enjoy four different modes for the ultimate flexibility between work and play. Switching between different modes is as easy as flipping the screen, allowing you to access the benefits of:\n\n * Notebook Mode -- You can use this machine as a traditional laptop on a flat surface.\n * Tent Mode -- This innovative mode provides a stable and ergonomic touch experience wherever you place the machine.\n * Tablet Mode -- The Yoga doubles as a powerful tablet with a long battery life that you can take anywhere.\n * Stand Mode -- This space-saving mode brings the screen closer to you and lets you easily adjust it for the most comfortable view.\n\nThe Yoga is ideal in any situation, whether it is mobile, stationary, handheld or passed around -- it fits them all. The durable dual-hinge's full range of motion has been tested 25,000 times, giving you peace of mind that the Yoga's flexibility is built to last. You'll still be able to view the screen clearly from almost any angle with Lenovo WideView display.\n\nNEW WAYS TO CONTROL YOUR PC\nWork quickly with 10-point multi-touch display, which is optimised to work with Windows 8 10-POINT MULTI-TOUCH DISPLAY\nEnjoy greater accuracy with the 10-point multi-touch display, which is optimised to work with Microsoft Windows 8. Easily share files, photos, videos and more with tablet-style display with easy scroll and zoom functions. This innovative screen is sensitive and easy to use, making typing easier and offering a responsive gaming experience. \n\n LENOVO MOTION CONTROL AND TRANSITION\nLenovo Motion Control lets you quickly flip through photos, power point slides and e-book pages or skip to the next song playing on your PC with simple gestures. Meanwhile, Lenovo Transition automatically switches open applications like Power Point to full-screen mode when the PC converts from normal notebook to tent, stand or tablet modes.\n\nINTELLIGENT TOUCHPAD\nThe one-piece intelligent touchpad makes your touchpad experience more intuitive. With its large glass design, you'll find the freedom to use multi-finger gestures to perform common tasks -- whether it's rotating an image or moving between multiple pages.\n\nACCUTYPE KEYBOARD\nThe finger-friendly curved key shape and ergonomic spacebar of the AccuType keyboard will work together to make it easier to type and reduce the number of typos, wherever you find yourself working. \n\nULTRA THIN. ULTRA LIGHT. ULTRA RESPONSIVE.\nYou'll find that the Lenovo Yoga 11S is a joy to behold and interact with. The ultra-thin design packs in powerful processors and responsive technology, yet only weighs 1.4kg and is only 17.2mm at its thickest.\n\n3RD GENERATION INTEL CORE PROCESSOR\nThe Lenovo Yoga features the 3rd generation Intel Core i3-3229Y processor. When top-of-the-line performance is needed for the most demanding of tasks, the Intel Core i3-3229Y processor is the ideal choice.\n\nIntel, the Intel logo, Intel Core, Intel Inside and the Intel Inside logo are trademarks of Intel Corporation in the U.S. and/or other countries.\n\nEXTRA LONG BATTERY LIFE\nThe Yoga 11S comes equipped with long-life batteries, so you can get the most out of your machine. The Yoga squeezes every last bit of juice out of its high-capacity battery, providing up to eight hours of productive life. \n\nFAST MEMORY AND SSD STORAGE\nOn the Lenovo Yoga 11S, featuring up to a powerful Intel Core i5 processor, you'll find up to 8 GB of fast DDR3 memory and up to 256 GB of Solid State Drive (SSD) storage. SSDs help you to access your files much faster than traditional hard drives, allowing faster application loading, as well as reduced start-up and shut-down times.\n\nLenovo Motion Control lets you quickly flip through photos, power point slides and e-book pages. DOLBY HOME THEATER V4\nListening to music, films and games on your PC will never be the same. With the Dolby Home Theater v4 audio tools, you can experience riveting surround sound on your PC. Dolby Home Theater v4 fixes all the problems typically associated with PC audio - tinny sound, weak volume, buzzing and rattling. \n\nHD 720P WEBCAM\nTake your web chats to the next level thanks to the built-in HD webcam. Your friends and family will be able to see you in clear 720p resolution, which means the picture will look good even on a large TV screen. The HD webcam also has enhanced low light capabilities, which means you'll always be looking your best whatever the lighting conditions.\n\nCONNECT\nLenovo Cloud -- Imagine your files, everywhere. Lenovo's online storage and cloud utilities allow you the freedom to choose your device and location. With 5 GB of free storage, you'll be able to secure and access your files wherever you are, on whatever machine you find yourself on.\n\nDISCOVER\nThe screen hinges have been tested to 25,000 cycles to ensure the Yoga 11S remains as durable as it is flexible. Click here to see a larger image. Exclusive Lenovo Content -- Discover all the amazing things you can do with exclusive tools from Lenovo. Learn how to get the most from your PC with Lenovo Companion or monitor your system performance with Lenovo Support. Lenovo keeps you up to date and delivers music, game and video content you can't get from anyone else.\n\nCONNECTIVITY AND SECURITY\nThe Lenovo Yoga 11S comes with multiple wireless connection options. The built-in 802.11b/g/n Wi-Fi adapter will allow you to enjoy reliable connections to the internet, while Bluetooth 4.0 is available on selected models to make it easier to connect and share files with other devices. You can also connect a compatible USB 3.0 device, such as an external drive, offering transfer rates 10 times faster than a standard USB 2.0.\n\nONEKEY RESCUE SYSTEM\nYou can rest at ease knowing OneKey Rescue System is there to simplify data back-up and recovery, allowing you to focus on using your computer instead of worrying about its maintenance. With the touch of a button, users can restore the system and recover valuable data. \n\n\n\nBOX CONTAINS\nLenovo Laptop\nAC Adapter\nUser Documentation",
    "rating": 3.4,
    "feature_bullets": [
      "10-point multi-touch allows all 10 fingers to accurately interact with the screen at once",
      "Lenovo Transition automatically switches open applications - like PowerPoint - to full-screen mode when the PC converts from normal laptop to tent, stand or tablet mode",
      "Energy Management - protects the long-term durability of the battery and uses advanced energy-saving technology to increase time spent between charges",
      "Integrated stereo speakers supporting Dolby Home Theater v4 certification for immersive surround sound",
      "Lenovo Motion Control lets you quickly flip through photos, PowerPoint slides and e-book pages or skip music tracks playing on your PC with simple gestures"
    ],
    "specifications": {
      "Brand": "Lenovo",
      "Product Dimensions": "29.79 x 20.4 x 1.73 cm; 1.4 Kilograms",
      "Batteries": "1 Lithium ion batteries required.",
      "Item model number": "59367205",
      "Manufacturer": "Lenovo",
      "Color": "Silver",
      "Form Factor": "Ultrabook",
      "Standing screen display size": "11.6 Inches",
      "Processor Brand": "Intel",
      "Processor Type": "Core i3",
      "Processor Speed": "1.4 GHz",
      "Processor Count": "2",
      "RAM Size": "4 GB",
      "Memory Technology": "DDR3",
      "Computer Memory Type": "DDR3 SDRAM",
      "Memory Clock Speed": "1600 MHz",
      "Hard Drive Size": "128 GB",
      "Hard Disk Description": "SSD",
      "Graphics Card Description": "Intel HD",
      "Graphics RAM Type": "Unknown",
      "Connectivity Type": "Bluetooth, Wi-Fi",
      "Wireless Type": "802.11n, 802.11b, 802.11g",
      "Number of USB 2.0 Ports": "1",
      "Operating System": "Windows 8",
      "Average Battery Life (in hours)": "6 Hours",
      "Are Batteries Included": "Yes",
      "Lithium Battery Energy Content": "42 Watt Hours",
      "Item Weight": "1.4 kg",
      "ASIN": "B00DPES0R8",
      "Customer Reviews": "3.4 out of 5 stars25 ratings3.4 out of 5 stars",
      "Best Sellers Rank": "249,475 in Computers & Accessories",
      "Date First Available": "15 Jun. 2013"
    },
    "categories": [
      "Computers & Accessories"
    ],
    "price": ""
  }
}