{
  "website_summaries": [
    {
      "verdict": "If you've got a compatible smartphone, you'll enjoy this smart lock, but if you're looking for high security, look elsewhere.",
      "pros": [
        "The Kwikset Kevo packs a lot of subtle smarts into a little device",
        "The indoor/outdoor sensor worked flawlessly, never once letting us in when it shouldn't have"
      ],
      "cons": [
        "The SmartKey deadbolt at the heart of the Kevo is too easy to break for a lock that costs $219",
        "Also, phones that aren't equipped with Bluetooth 4.0 won't be able to interact with the Kevo"
      ],
      "aspects": {
        "Features": 8.0,
        "Usability": 7.0,
        "Design": 6.0,
        "Performance": 5.0
      },
      "publication_date": 20131101,
      "rating": 6.7,
      "source": "cnet"
    }
  ],
  "customer_reviews": [
    {
      "title": "It will break and when it does it won't be replaced",
      "text": "It was great while it lasted. However it broke with no warning, it is no longer getting power and is no longer covered under warranty. Apparently the warranty is only good for a year. My other smart locks with the same amount of use are still working. Guess this was the push I needed to get a lock that integrates with the rest of my house. It just sucks because sending keys was easy and I bought the Gateway Hub. However I no longer need to worry about if my phone dies how will I make it inside my house. That's a positive.",
      "rating": 1.0,
      "verified": true,
      "author": "Michele J.",
      "helpful_votes": 0,
      "publication_date": 20180810
    },
    {
      "title": "Great concept.",
      "text": "I pre-purchased before this was released. Great concept ... but fails to deliver. I would estimate it works 10% of the time. It simply does not work consistently and they do not support it. When you call support, they are sugar sweet ... and they want to run you through the set-up process all over again (every time). Does not work, and they refuse to replace it. From what I read, the 2nd generation has the same problems. My wife and kids get their keys out and unlock the door most of the time while I'm waiting and watching blinking lights.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Manausa",
      "helpful_votes": 6,
      "publication_date": 20170118
    },
    {
      "title": "To good to be true",
      "text": "I wanted so bad for this lock to work. I tried and tried. 1 year later, damaged door frames, replaced locks, hours on the phone with kwikset and multiple lock outs. I give up. I have over $500 invested and I quit. I was one that thought \"I will work through the problems, I will figure out what others can't\". I was wrong. As for Kwikset, I wont waste my time explaining how miserable their customer service and support are. In fact, it's insulting they call it \"customer service\" and \"support\", because you will get neither. I wish you good luck! :(",
      "rating": 1.0,
      "verified": true,
      "author": "Baja Kids",
      "helpful_votes": 2,
      "publication_date": 20170124
    },
    {
      "title": "Very insecure - use at your own risk.",
      "text": "The Kwikset Kevo 1st Gen should be recalled. My wife and I just put our condo on the market for sale and have discovered that real estate agents are unlocking the door without their lock box key - instead, they are accidentally touching the kevo lock and it is unlocking. I have made sure that there are no cell phones, fobs or anything else within 30 feet and the thing unlocks anyway. It doesn't do it 100% of the time however, just randomly. I have noticed this before, but always had thought a fob must have been near, however that was not the case. I wish I could get a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "KL",
      "helpful_votes": 2,
      "publication_date": 20170130
    },
    {
      "title": "Its a good ideal but far from being perfected",
      "text": "this lock has been nothing but a pain since I purchased it! After over a year of dealing with updates,or dead batteries in fob I am done! Shopping for new lock today! Can't wait to throw this junk in trash! It does not work except with iPhone my wife and I are only ones in house with iPhone evrytime one of us signed in to keno,the other got kicked off and would have to sign in again.I finally started using the door after my wife had to sign in while standing in rain.Its a good ideal but far from being perfected!",
      "rating": 1.0,
      "verified": true,
      "author": "Scoob",
      "helpful_votes": 3,
      "publication_date": 20160503
    },
    {
      "title": "I Regret Buying This",
      "text": "I was hoping for keyless entry that functioned at least as well as my car keyless entry. Nope. This thing devours batteries. If my keys aren't within 2 feet, it doesn't work. When your arms are full and you have a child wanting to get in the door, the last thing you want is to try and shuffle your purse close enough for the door to unlock. The app on my phone is similarly worthless. This didn't make anything easier - it's just made everything that much harder. I deeply regret ever buying this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Elaine Bayless",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Bait and Switch.",
      "text": "Kevo has disabled the ability for all Android devices to download the app to control this smart lock. So they advertised it as Android compatibility, let people download the app and configure their phones as keys, and then restricted who could actually use it. I have a household of 8 people who were all using this with their phones and not one of them has a phone on the new \"Compatible device list\"; if their phone gets lost or stolen, like mine did, and needs to be replaced then they will have no avenue to reinstalling the application and will no longer be able to use this lock. We got screwed;.",
      "rating": 1.0,
      "verified": true,
      "author": "Jess FortierTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20161221
    },
    {
      "title": "DO NOT BUY THIS JUNK!!!",
      "text": "Ive had this thing installed for a few momths now. This thing is an absolute joke! This thing will piss you off in the morning when you leave (and make for a great day) and piss you off as soon as you get home! Welcome home honey! It has a mind of its own and works only when it wants to. Very very sporadic. I want to crush it every time I use it. Nothing should piss a guy off this much and this often. They should stop selling this junk on Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Lane",
      "helpful_votes": 3,
      "publication_date": 20170809
    },
    {
      "title": "The idea is awesome but the execution here is poor",
      "text": "This Kevo Kwikset works 70% of the time. The other 30% of the time your standing outside your door trying to lock or unlock it. It has become a daily thorn in my side. I now wish I had just bought the lock with the keypad. The idea is awesome but the execution here is poor. DO NOT BUY!!! Update...performance has not improved at all. My whole family complains about having to stand outside trying to get the door open. Yesterday my son's house keys were stolen with his car and I followed the steps to re-key the door and now no keys work in the door. This product is a piece of crap.",
      "rating": 1.0,
      "verified": true,
      "author": "W. S. Barber",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Unreliable, inconsistent, delays - hate it",
      "text": "Half the time it won't respond. The app is always using the battery in my phone, but won't be recognized by the lock. Will NOT LOCK with low battery (even WITH THE KEY). Every time you change the batteries, you can't use it anymore. The error signals from the lock aren't on any of the Kevo sites to diagnose. If you change any single person on the user-list, you have to start over with the administrator and add in others AGAIN. Never works when you want it to, and will lock when I have the door wide open. Great idea, but bad firmware.",
      "rating": 1.0,
      "verified": true,
      "author": "AmazShopper",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "I hate this lock.",
      "text": "I hate this lock. The idea was that all I'd have to do would be touch the lock and my door would open, no key needed. Nope. I have to get my phone out and open the Kevo app. A KEY WOULD BE EASIER. Yes, it comes with keys, but I could have gotten a plain old key lock a helluva lot cheaper. Then I did the latest upgrade to my iPhone. Now the lock won't work at all. Huge waste of money, huge frustration, and I'll never buy anything Kevo again.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenny Crusie Smith",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Much better install than the previous finger print reader model",
      "text": "Much better install than the previous finger print reader model. Interesting tip. It nearly always took two attempts at tapping the deadbolt to get the door to unlock.. I recently went into the app and enabled the low power mode, which ironically says it will take longer to open, and every time since enabling, it takes the same 3-5 second delay and unlocks on the first time. Been doing that consistently for nearly two weeks now. It's a great first gen, but wait for the second gen due out later this year.",
      "rating": 4.0,
      "verified": true,
      "author": "Shaunspad",
      "helpful_votes": 2,
      "publication_date": 20160729
    },
    {
      "title": "Don't Buy This!",
      "text": "I should have listened to other reviews. The product is wonky and doesn’t work as you would imagine. I've now had it for about 6 months and it literally takes less time and struggle to just use your key to open the door. 9/10 times the app has to be launched to unlock - so basically, you’ll first wait, then realize the app needs to be open then have to get out your phone and go through it to find and open it and then wait again. Don't buy this, search for a better automatic key company - I really don't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Prepare to spent another $100+ once you get this thing installed",
      "text": "This listing is EXTREEMLY deceiving. The discription indicates you can control your lock from anywhere. The last video is for Kevo Plus. It does not state ANYWHERE you need a $100 Bluetooth Gateway (sold separately) to access the lock outside Bluetooth range. Unlocking the door from work because your 14 year old let their phone die will not work without the upgrade. Not to mention you only get two eKeys with the lock. Any more users and its $2.99 EACH!",
      "rating": 1.0,
      "verified": true,
      "author": "Mr. Honest",
      "helpful_votes": 4,
      "publication_date": 20160825
    },
    {
      "title": "I decided to give it some more time to see if an update would fix it but it has only gotten worse. Now with my phone out",
      "text": "DO NOT BUY THIS ITEM. I have had this item a little less than two years now and am currently looking to replace it. It only worked properly for about 5-6 months. After that period it would never open unless I took out my phone and would open and close the app a couple of times. I decided to give it some more time to see if an update would fix it but it has only gotten worse. Now with my phone out, app open and it directly near the lock.. it will still take forever to open. Completely pointless when using the regular key is easier and faster.",
      "rating": 1.0,
      "verified": true,
      "author": "michael herrera",
      "helpful_votes": 2,
      "publication_date": 20170315
    },
    {
      "title": "I can say that i am slowly starting to hate it. At first",
      "text": "So, after having this lock for about 8 months now. I can say that i am slowly starting to hate it. At first, it was awesome. We had the cool, new touch lock! But, it doesn't work well with the keyfob provided, and its very spotty with unlocking on the cellphone app. It would be faster on some occasions for me to just put the key in the door then to wait through multiple cycles for it to finally catch a signal and open the door. Batteries run out quickly in the keyfob remotes, and they hardly work. I wish I could return this now and get a different lock. Don't waste your time and money on this.",
      "rating": 3.0,
      "verified": true,
      "author": "Brie0823",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Great idea but hasn’t worked right",
      "text": "Great idea but hasn’t worked right. I emailed the seller but they kept beating around the bush about the type of batteries. I used 7 different types of batteries to see if that was the problem since i was getting daily dead battery emails which would put the lock into limp mode. Then i decided to test the batteries to see if the unit was draining the batteries, but after testing the batteries were fine. It’s a faulty unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Dres customs",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "This is the future of locks.",
      "text": "This is such a great product! It looks great and works very well. Of course, installing it might be a challenge, specially if the person that installed the previous deadbolt did a poor job. But the box comes with everything you need to install. So far all the iPhones we tested worked. I did not experienced the lag opening or closing the door. And I can now send eKeys to anyone I want at no cost! This is really the future of locks. Awesome!",
      "rating": 5.0,
      "verified": true,
      "author": "Dario Pks",
      "helpful_votes": 2,
      "publication_date": 20170302
    },
    {
      "title": "Love them so much we are getting two more",
      "text": "Very easy to install (if you are somewhat handy), and works really well. We installed two of them and really love the simplistic appearance coupled with the wow factor of just tapping it to unlock. We have not experienced any 30 second delay like some others have posted. The only thing that s something to get used to is the fact that it you brush by the lock - you can inadvertently trigger it. Also - we downloaded the iPhone app and we have noticed a drain on the battery life. But nothing too crazy. We still love the whole concept of this, and I am buying two more for the remaining exterior doors.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc R.",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Insecure lock, no remote unlock, not recommended",
      "text": "Insecure key lock, any thief can pick it. No Gateway as promised. Support laconically says \"watch our website\". Without a gateway there is no remote unlocking. A waste of time. Who knows how long it will take? The bolt is flimsy. The magic key reprogramming only works if your other locks are also Kwikset. They don't say this. Extra cost of replacing all other locks and reduced security because the key is dead simple. Support refers you to the videos. These say no more than the instructions. All round bad experience. I will try Yale or Scalage instead which offer a gateway and a much higher level of security.",
      "rating": 1.0,
      "verified": true,
      "author": "Velile",
      "helpful_votes": 0,
      "publication_date": 20150718
    },
    {
      "title": "working like a champ",
      "text": "it worked for a year, working like a champ! love this lock makes life so much easier knowing I can give a digital key to a friend to check on my house and pets when another friend can't or won't do what I asked and leaving my cats to starve to 3 days (why I got this lock) this lock was a test lock to see how Bluetooth locking systems work and thus far I am impressed and may invest in newer better locks.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigail A. Messer",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Unreliable and too slow",
      "text": "Sort of a waste. It works, after a fashion. Takes about 20 seconds to sync with the phone and open the lock (on my iPhone and my wife's). That's just too slow. The app works. But it eats batteries. If you stop it from running in the background then that's no longer the case, but then the link between the phone and the lock doesn't work until you start the app manually. So you have to start the app every time you restart your phone. Overall very disappointing. I've had it too long to return so I'm just chucking it out.",
      "rating": 2.0,
      "verified": true,
      "author": "Vonchor Plunkforth",
      "helpful_votes": 0,
      "publication_date": 20160713
    },
    {
      "title": "Poor item",
      "text": "Almost works as advertised. Item will activate on its own, even when you don't touch it. For example, you unlock it and walk in. The door will extend the lock on its own as the door is closing. The kicker was when I arrived home and I attempt to close the lock. Repeatedly I locked the door and it would automatically unlock. I finally had to remove the batteries in order to lock my house.",
      "rating": 1.0,
      "verified": true,
      "author": "nocal15",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Overall very happy with the purchase",
      "text": "This was returned as Amazon could not get it here on time. 2 days for 1 day prime. However I purchased outside of Amazon and install was a breeze being that most, if not all measurements where identical as far as swapping out the previous dead bolt. Bought an additional FOB and now Both the wife and I no longer need to have our keys out to open the door. Have yet to use the iPhone (to date no Android App) to use/set keys. Dead bolt opening closing not too loud. Loud enough to let ya know it is working. Visual lights do that as well and are not to flashy. Overall very happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "EKONAN",
      "helpful_votes": 2,
      "publication_date": 20140909
    },
    {
      "title": "Great Product, Great Customer Service",
      "text": "Very convenient. I had a little trouble at first and it ends up the problem was with my phone. Customer service was very convenient to reach, patient, knowledgeable, were on US soil and were native English speakers, and they talked me through the issue. I just ordered the upgrade and can't wait to get it. I did research on the comparable locks out there and decided on this one due to the option of the traditional key. That has come in handy with those who are less technically inclined.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Thorne",
      "helpful_votes": 2,
      "publication_date": 20151217
    },
    {
      "title": "No keys, no problem",
      "text": "Coming back from work with laptop, empty coffee mug, purse, car keys... voila! it magically opens with a simple touch because it reads your cellphone Bluetooth, You can also give a soft key to kids and family members (app on smartphone). No need to approach the door every night and make sure is looked, the lock light will tell you. It was super easy to install. It comes with an electronic hard key and 2 metal keys, just in case.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha C",
      "helpful_votes": 2,
      "publication_date": 20160525
    },
    {
      "title": "It works ok - sometimes will lock when you're not expecting it to.",
      "text": "I installed this with high hopes. The installation instructions are clear, easy to read, and follow. The initial set-up is straightforward including downloading the app, following the guidance, updating the firmware, and adding keys. If you have more than two family members, be prepared to pay for additional electronic keys. Locking and unlocking are fairly straightforward. The challenge that we've had is that the lock will seemingly lock when you shut the door for no reason. I laughed until it happened to me. I've tried everything I can think of to resolve this and haven't had much luck. If I can resolve, I'll update the review.",
      "rating": 3.0,
      "verified": true,
      "author": "T. Lund",
      "helpful_votes": 0,
      "publication_date": 20141228
    },
    {
      "title": "It's not bad, but for the price",
      "text": "I thought you would get more electronic keys than two. You have to purchase additional permanent keys. The unit works with a little lag time between touching the lock and it performing... It's not bad, but for the price, it should be more responsive. My girls have problems with it reacting to their iPhones when the phone is in their pocket. Sometimes they have to take the phone out for the lock to react.",
      "rating": 4.0,
      "verified": true,
      "author": "George L Paul",
      "helpful_votes": 2,
      "publication_date": 20160511
    },
    {
      "title": "DO NOT BUY THIS PRODUCT",
      "text": "I installed this lock in late April, and it’s the worst lock I’ve ever had. It was near impossible to install, and it rarely works right. It very hard to sync with my phone, making me wait on the front porch for extended length of time, always have to resync it with my phone!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Works 20% of the time... the other 80...",
      "text": "When it works it’s great. It works probably 20% of the time. Think the other 80% is when you are holding a screaming toddler or all your groceries. I splurged thinking this would eliminate the need for house keys... I always have a spare set with me now. It’s not a trustworthy product which is not what you’d expect from a device securing your home. The last straw for this deadbolt was when my login information was erased while resetting the app... of course forgot the ridiculous password... and the forgot my password function on their website wouldn’t send me an email.",
      "rating": 2.0,
      "verified": true,
      "author": "Karsten Holbein",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "The Joy of Keyless Entry!",
      "text": "A week now and I'm still overjoyed every time I use this. I had no problems with calibration. My only (tiny) complaint is that it takes the lock a few seconds to (un)lock after I've touched it. So I typically stand there for a beat waiting for it to lock or unlock. Keyless entry is awesome. I'm using the key, fob, and iphone apps with no problems. I like how my Iphone vibrates when it locks or unlocks - it's a subtle confirmation that it's working.",
      "rating": 4.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 2,
      "publication_date": 20151118
    },
    {
      "title": "For example if I put my bike in my shed there's a good chance this thing will stop opening for me",
      "text": "These things are absolute junk. The calibration drifts if you have anything metallic near the door. For example if I put my bike in my shed there's a good chance this thing will stop opening for me. The little FOBs use their battery too quick. The whole system doesn't seem to function well in cold weather either. I would avoid these like the plague. It seems neat but it's too gimmicky. Go with a zwave lock if you want a neat gadget for a lock. I have one and like it way more than this.",
      "rating": 1.0,
      "verified": true,
      "author": "Jordan Z",
      "helpful_votes": 0,
      "publication_date": 20150227
    },
    {
      "title": "Disappointed",
      "text": "At first I really liked this lock. But after a couple weeks it started getting harder and harder to easily lock. I had to open the app and find the lock with Bluetooth then press to lock it which defeats the purpose of a “touch” lock. I decided to spend another $25 for a fob but that would rarely work as well. I have tried changing the batteries several times. Now, a year later, I can’t get anything to work. So disappointing. I will have to buy another lock.",
      "rating": 2.0,
      "verified": true,
      "author": "Debby",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Do not buy! Product is fatally subpar.",
      "text": "Terrible product. It never works and the app needs to be restarted every single time. Which is great when you're carrying groceries. I've been through all the calibration they recommend. Nothing works for longer than a day. The last straw before I pulled it and threw it away is the app updated and removed all login information. The security questions (which really aren't secure as it is all information that can be searched online about you) would not work and customer service never contacted me back. If I didn't have the physical key, I would have needed to contact a locksmith. Avoid avoid avoid.",
      "rating": 1.0,
      "verified": true,
      "author": "M. G. Taylor",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "I want to love this product but it never recognizes my fiancés iPhone ...",
      "text": "I want to love this product but it never recognizes my fiancés iPhone 6 and sometimes I'll be walking out of the open door and it will lock on its own. I still won't leave the keys behind when I leave, and I won't say it's any quicker than using keys but sometimes it nice to not have to dig for keys....when it works. And I am prevented from upgrading to iOS 10 because the touch to open feature will be gone, so why have the lock in the first place.",
      "rating": 3.0,
      "verified": true,
      "author": "Jared Ludin",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Great smart home upgrade",
      "text": "This product will be great for my school aged children. No more worrying about keys for them or if we're running a few minutes late or the bus is running early. They will each get a FOB put in their backpack and will be able to get in the house whenever they need. We were able to install, program, and sync this product quickly and easily. Works with my Galaxy S7 well too.",
      "rating": 5.0,
      "verified": true,
      "author": "R.Anderson",
      "helpful_votes": 0,
      "publication_date": 20160801
    },
    {
      "title": "Only buy if you want to spend inordinate amounts of time trying to simply  open your front door.",
      "text": "Only purchase this if you want to spend the rest of your life dealing with the frustration of a device that only intermittently works. Having had this for 4 years, I can say definitively that you will have to reset the device, restart your phone, wait until it recognizes your phone, move your body to the exact position where the lock, sometimes, works. I have done all the things suggested on kevo website to fix this. But remember, this is just a lock, and it should just work easily and simply! One should not have to spend so much time dealing with a simple piece of technology. A key is so much easier, and not filled with hassles and frustrations.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert B. Lemelson",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Garbage-worthy",
      "text": "Junk! My son got locked out of the house the other day after school while we were st work because it stopped communicating with his iPhone6. We were both at work when it happened and he had to stay at neighbors till we got home. Key fob would not work either with fresh batteries. When I tried with my phone it worked again without recalibrating. Not dependable. Sorry I bought it, They should replace all these with non-glitchy models or stop screwing around with app updates that are going to lock out family members. Inconsiderate programming.",
      "rating": 1.0,
      "verified": true,
      "author": "ST",
      "helpful_votes": 0,
      "publication_date": 20171129
    },
    {
      "title": "Worked fine until I tried to update it",
      "text": "Worked fine until I tried to update it. I installed the app on my Nexus 9 and it immediately told me to update my lock. I followed the procedure and it started the update. Then the app went back to the previous screen stating I needed to update my lock. Now the lock no longer responds to any of my fobs. Reset did not fix it nor did a reboot of the lock. Do NOT update the lock firmware. If it fails like mine did your lock will no longer function aside from using the physical key.",
      "rating": 1.0,
      "verified": true,
      "author": "Roger G.",
      "helpful_votes": 2,
      "publication_date": 20150403
    },
    {
      "title": "Painful!",
      "text": "I have had this lock 1 year and 1 month. I have had to change out the batteries three times already, and now it just doesn't work at all. It intermittently would work by touch, the app would take a while to load, find the lock, and then finally open the door. I tried using the app on multiple phones (as my mother and friends were given access) it was a pain for everyone. I would return it and get my money back if I could. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Mickell L Smith",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "Works Perfectly",
      "text": "I bought this lock after waiting almost two years for a Lockitron bluetooth deadbolt to be shipped. I canceled that order and thought I'd give the Kevo a shot. Installation was simple, taking at most 20 minutes. The installation video on Amazon was quite useful. Then it was simply a matter of downloading the app for my iPhone 5S and following the prompts. The app also updated the firmware for the Kevo. With this latest version, iPhones associated with the lock are automatically calibrated, so you can skip that video and procedure. I set up both my wife's and my phones. Both are 5S with ios 8.1.2. The lock works perfectly with both phones.",
      "rating": 5.0,
      "verified": true,
      "author": "Carnac767",
      "helpful_votes": 0,
      "publication_date": 20141213
    },
    {
      "title": "Is not reliable",
      "text": "Used this with the key fobs. The lock responded less than 50% of the time. My girlfriend's fob was in her pocket and I hung mine around my neck. I reprogrammed many times, watched the videos and tried the suggestions. Nothing made it respond better. I even put a fresh battery in the fob because it showed 2.7 out of 3 volts. New battery had 3.2 volts and the fob would not work. Gave up and just used the key. Bought a MiLocks WF-02SN. You push a button on the remote and it works every time.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Spontaneously locks and unlocks.  Horrible security.",
      "text": "This lock is horrible! It takes a really long time to lock or unlock from the outside if it even does. It spontaneously unlocks and locks when no one is near it or has touched it. It is obviously not good for security... because you never know when it's going to unlock itself. I do not recommend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Thayer",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "Used to be the best modern lock - recent app updates have made it the worst lock",
      "text": "Android app no longer works. Does not run in the background. Sometimes it will connect to the lock if you run the app manually and sometimes it won't connect. Newer version of app always ask for password but entering it doesn't help. In addition to a non-working app it looks like kwikset has abandoned this product - google+ group has been dead since November 2015. Avoid this product. (Android app version 1.0.27p was the last working version. If you keep that version and ignore updates then the kevo rates 5 stars. But with the later aps it rates 1 star.)",
      "rating": 1.0,
      "verified": true,
      "author": "M. Reilly",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "... replaced the front door lock with the Kwikset Kevo Smart Lock as an experiment",
      "text": "I recently purchased a new home and replaced the front door lock with the Kwikset Kevo Smart Lock as an experiment. I really enjoy the ability to lock or unlock my front door just by touching the lock--it is linked to my iPhone. Recent software upgrades allow me to lock the door from anywhere in my home via my iPhone. Also, my lock notifies my Nest thermostats that I have left so they can automatically switch to \"Auto Away\" mode and save energy while I am away. The reverse is true when I return. The experiment has been successful and I will be installing the Smart Locks at every outside door location.",
      "rating": 4.0,
      "verified": true,
      "author": "Terry Maddox",
      "helpful_votes": 0,
      "publication_date": 20151025
    },
    {
      "title": "I like it when it decides to work.",
      "text": "I like it better than fumbling for my keys. But it’s hit-and-miss. Even if I have both my phone AND my key-fob in my pocket I sometimes have to hold it right up to the thing, thus making me use my hands, thus removing the hands-free selling point of the thing. Then sometimes it works really good exactly when I don’t want it to. Like when I’m opening the door, then the deadbolt pops out, which is kind of annoying. But, still it makes my life better, so three stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "Works well... most of the time",
      "text": "Works most of the time on the first try. One thing to be careful of is that someone can open the lock from the outside if you leave your phone too close to the door. I've had my phone on the counter, 12 feet from the door, and had a friend come to the house and unlock the door! Good thing that I was expecting her otherwise I would have been really surprised! Ironically, there are times that it takes two or three tries to lock or unlock the door while holding the phone in my hand. Doesn't work with Android phones!",
      "rating": 3.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20150419
    },
    {
      "title": "Don’t waste your money!!",
      "text": "Loved this when I first got it. The whole family wants to change the lock. It locks when it shoukdnt, leaving us stranded outside. When you want it to lock it won’t. I would like kwikset/Kēvo to send me a regular push button lock without Bluetooth so I can use my door and not worry that someone will be entering while I’m not home. Worst purchase ever!",
      "rating": 1.0,
      "verified": true,
      "author": "Melissa E Muirhead",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Really decent lockset",
      "text": "This lockset compares really well compared to traditional sets, both in terms of performance and price. In particular the bolt is of a decent length. The bluetooth ability, while for me was actually a bonus, works really well. To date I have yet to open the door with either the supplied keys and/or the fob. Admittedly it doesn't always open first time, but the 'techno' coolness is (currently) still enough for me to keep trying until it does.",
      "rating": 5.0,
      "verified": true,
      "author": "KiwiBuntu",
      "helpful_votes": 6,
      "publication_date": 20140304
    },
    {
      "title": "Wonky hardware and software, unreliable.",
      "text": "I'm ripping this thing out. First,it only works occasionally. Whenever I run the app as the thing won't unlock it says connecting..., indefinitely. This is after it had worked for a couple days. Mysteriously it starts working again. Now I learn it doesn't work at all with IOS 10, unless you run the app in the foreground. They nickel and dime for extra \"e-keys\" after two. It doesn't run on most android phones, only the popular phones. So I will buy a different one. What a waste of money, doesn't perform as advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Barry B. Hunter",
      "helpful_votes": 0,
      "publication_date": 20160912
    },
    {
      "title": "Showed up broken, not sure about overall build quality",
      "text": "I was really excited about this unit, which I pre-ordered, but it showed up broken. Very disappointing. While I really liked the understated exterior unit, I got the sense when installing the whole unit that it was a bit too plasticky. I am sure the main lock unit is rugged, but the interior portion just did not feel that solid. Not sure if I will order another when it becomes available again or if I will wait for some of the other options that are coming out, like the August Smartlock.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick T",
      "helpful_votes": 3,
      "publication_date": 20131123
    },
    {
      "title": "Bad performance and poor service.... overrated.",
      "text": "It works, more than it doesn't work. However,like effective birth control, that doesn't help much when it fails. When it works, it's so easy. However lots of the time, it doesn't work. Not because of the batteries either. It either unlocks prematurely or when you don't want it to. Or it won't unlock with the pass. And I've been trying to get support and reach out to Kwikset - and it's a frustrating waste of time. I'm going with Schlage,Yale or anyone else. Kwikset is fast and cheap, but not good.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael Hoffman",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Bluetooth almost never works.",
      "text": "I hope the second gen fixes the bluetooth problem. After a year of use, the vast majority of time, the blutooth connection takes 30 seconds or more to connect. I have to keep a regular key hidden outside to get in or lock after leaving. I'm about ready to ditch this expensive POS.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Banas",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Nice product but.....",
      "text": "There is more to selling something than just the product itself. I found that the instructions that came with it are somewhat confusing and should be improved.",
      "rating": 3.0,
      "verified": true,
      "author": "Vazinho",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "\"Comfort access \"For your home !",
      "text": "Absolutely love the convenience of this lock. Many of us are used to vehicles that are now providing entry and exit access via the key fob. This does the same for your home, but works via your phone. The app needs to be downloaded to an iPhone but does not need to be running at all times once the Kevo recognizes your phone from its Bluetooth signal. I love the security of being able to issue an E-key that means I never actually gives out a key to my home. Every E key's acces can be edited and updated in real time immediately. This adds excellent flexibility in determine who can enter and access my home.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark A Williams",
      "helpful_votes": 0,
      "publication_date": 20160715
    },
    {
      "title": "You must leave Kēvo app opened on your phone consuming battery if you’d like to work without taking your phone out of your ...",
      "text": "Too expensive for what in my opinion does... does not work very smoothly with bluetooth and it’s a bit of a hassle to send digital key to someone else as they have to register with Kēvo app! You must leave Kēvo app opened on your phone consuming battery if you’d like to work without taking your phone out of your pocket... otherwise is like searching for a key in your pocket",
      "rating": 2.0,
      "verified": true,
      "author": "Juan Santiago Rodriguez",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "As cool as this is",
      "text": "Save yourself a lot of trouble and buy a lock that actually works. I take that back, the physical key does work but that's about it. The only thing positive about this product is that customer service is \"sorry\" for the inconvenience. I bought a schlage and that has never let me down, and I can actually connect that to wink and other related products. Stay away from this product. Nice looking blue light (the thing that had me buy this junk)",
      "rating": 1.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Mixed feelings.",
      "text": "I have mixed feeling about this. It’s nice to just be able to touch the deadbolt and have it open. BUT Sometimes you accidentally touch it when your hands are full trying to leave the house and the deadbolt deploys before the door is closed. Sometimes it takes a while to recognize the phone app and you’re standing at the door waiting for it to unlock.",
      "rating": 3.0,
      "verified": true,
      "author": "Andy S",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Easy install!",
      "text": "Works ok. If you close the app out of your background or put your phone on airplane mode you have to open the app back up when you get up to the lock. Easy install!!",
      "rating": 4.0,
      "verified": true,
      "author": "Kirt Russell Samson",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "I love not having to get out my keys lock or ...",
      "text": "I love not having to get out my keys lock or unlock the house; I can do it from the comfort of my car. I love that I can allow someone else like the dog sitter to use it for a defined period of time as well. I love that you can tell who locked or unlocked the house and when they did it, too.",
      "rating": 5.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "DO NOT BUY KEVO. YOU WILL SORRY.",
      "text": "I purchased this product March 25, 2016. The 1st generation does not consistently read location. Once read, it does not activate. I followed with a purchase of its internet hub. Said hub has NEVER worked. I spent numerous calls with support to try to connect. Never. Kwikset sent me a replacement hub. SAME result. $100 STOLEN FROM ME. I have written, complained, called. Now, they ignore me. I have never been so dissatisfied with a product that offered so much promise. DO NOT BUY ANYTHING FROM THIS COMPANY. They talk a great game, but they DO NOT DELIVER.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171111
    },
    {
      "title": "Done with it",
      "text": "After 9 months, I got rid of it and bought another brand. It's very unreliable. The biggest problem is that it lock all by itself sometimes by just walking past it. It's sad to pay that kind of money and get a piece of junk.",
      "rating": 1.0,
      "verified": true,
      "author": "telehack",
      "helpful_votes": 2,
      "publication_date": 20170403
    },
    {
      "title": "*UPDATE* And lo, it sucked.",
      "text": "Update: After using this lock for a few weeks, it became completely unreliable. I couldn't wait to be rid of it. -- Original Review -- I was skeptical that Kevo's app would work consistently on iOS, where the fundamental technologies used like CoreBluetooth can be unreliable. But myself and my wife have had nothing but success with this lock. Yeah, like one out of 10 times it will take a second attempt to unlock, but it's hardly an issue. We love this lock and use it every day—it's so much more convenient than dealing with keys. My house key was the last remaining metal key I carried around; now I'm completely keyless. It's the future!",
      "rating": 1.0,
      "verified": true,
      "author": "N. Farina",
      "helpful_votes": 0,
      "publication_date": 20141216
    },
    {
      "title": "Highly recommend this deadbolt!",
      "text": "How did I ever function without this? FANTASTIC product. You dont even need your key. Just have your phone in your pocket / purse. You can even send someone else a temporary key (for example if your'e out of town and need someone to come in and water your plants). Easy to install, works with a key also, just like a regular deadbolt. And it uses the Kwikset lock so you can match it to all the other locks. Perfect. Highly recommend having one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "kate.tully",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Great Lock",
      "text": "This is a great lock if you have a locksmith install it. I read all the bad reviews and asked my son-in-law to look at it since he knows everything about tech and he said it looks like the bad reviews were from people that installed it wrong..I've installed locks before but paid the 100. To install it and it opens faster than I could get a key out of my pocket. I've only had it a few days but it's never failed to open in seconds with one touch.",
      "rating": 5.0,
      "verified": true,
      "author": "ken stanphill",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "must be early is the product phase",
      "text": "Doesn't always work and when it does, it's very slow... The largest driver for purchasing this product was safety. I wanted my wife to be able walk up to the door and touch it to open... but it takes a few seconds to recognize the fob, then 5 to 10 seconds to unlock, if it doesn't error out and remain locked... Also doesn't always lock the door when exiting the house... have to check if is lock after putting purse in car. Doesn't track which fob has opened the door either. A waste of money",
      "rating": 2.0,
      "verified": true,
      "author": "Stephan M. Tobias",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Smart lock, that works and installed easily.",
      "text": "Installation went smooth, no issues or problems. Calibration also went smooth, in fact it required less steps then what was listed. Calibrated an extra FOB and my Phone. Other than being a bit noisy, it seems to be working as expected. Integration with Amazon Echo would be nice, although I hear all the \"issues\" around that... Time will tell how well made it is and how long it will last...for 190.00, I'd expect it to outlive me! ;)",
      "rating": 4.0,
      "verified": true,
      "author": "DDBones",
      "helpful_votes": 0,
      "publication_date": 20160215
    },
    {
      "title": "It worked great for about a month but now the fab has ...",
      "text": "We were excited to install our Kēvo. It worked great for about a month but now the fab has stopped working and unless the app is open which it sometimes won't do easily or at all- you can find yourself standing on the doorstep freezing or soaked trying to get the lock to open. I have had to wake up sleeping family members to come and let me in. The lock also randomly locks or unlocks if you happen to get too close with your phone while sitting on the couch or walking past the door. Not happy.",
      "rating": 2.0,
      "verified": true,
      "author": "LR New York",
      "helpful_votes": 0,
      "publication_date": 20161216
    },
    {
      "title": "The Kevo is a sturdy, good-looking lockset",
      "text": "The Kevo is a sturdy, good-looking lockset. The installation was as easy as a normal deadbolt lock. I like the features. The optional fob and smart-key feature are particularly handy. This lock operates via Bluetooth. Not all smartphones are supported. You cannot open or lock it remotely without the help of a third party device such as the Ring video doorbell.",
      "rating": 4.0,
      "verified": true,
      "author": "John Urish",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "Awesome technology with a use, makes life easier when carrying things, responds quickly",
      "text": "Calibration can be troublesome, but I never store my phone anywhere near the door so I just ignored that step and it opens great. Early versions of the app were a little finicky, but the latest versions have been very stable. Looking forward to getting new wifi functionality in the future! Sending keys to other people could be more streamlined. It takes a lot of steps and manual work to get them properly installed and working with your door.",
      "rating": 5.0,
      "verified": true,
      "author": "dinesh",
      "helpful_votes": 4,
      "publication_date": 20140723
    },
    {
      "title": "Android users beware!",
      "text": "I bought one of these ,suppose to be compatible with Android. Be aware this will only work with maybe 5 or 6 Android phones. The software is not current, still uses Lollipop .this lock comes with 1 fob, another sells for $25. On top of this the new upgrade software is another $100 dollars. I would not advise wasting your money,unless you do not have to work for it.",
      "rating": 2.0,
      "verified": true,
      "author": "cls",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Unreliable?",
      "text": "The first Kevo received was much too sensitive, to the extent that I had only to stand near it with phone in hand and the Kevo would register \"touches\" (with my hands well away from lock and door) and repeatedly lock/unlock/lock the door. After a few days of troubleshooting, a replacement from Kevo works much better, only registering touches when the lock is actually touched. But it leaves me concerned about reliability - especially for a door lock which it is critically important must work well!",
      "rating": 3.0,
      "verified": true,
      "author": "Ian C.",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Useless piece of garbage",
      "text": "Peace of garbage Made of plastic, Bluetooth is unresponsive not working most of the time and the touch to unlock is even worse, recalibrated several times but this thing is just so bad that there is no point so I usually carry and use the physical key. Tonight I forgot my key and it locked me out of my home, it just doesn’t open not using Bluetooth or the e-key. Avoid buying this piece of crap, not even for 10 bucks and you will save lots of headaches",
      "rating": 1.0,
      "verified": true,
      "author": "Jack Sparrow",
      "helpful_votes": 0,
      "publication_date": 20170930
    },
    {
      "title": "Ugh",
      "text": "Im not impressed with this lock. Im pretty tech savvy, but this lock refuses to work with me. I have followed the instructions, watched numerous YouTube videos and it still does not work. I was able to get the fob to work, but not my phone. After recalibrating my phone, my fob will not work. Im trying to set up the fob and it will work. At this point i would rather have a regular lock than this.",
      "rating": 2.0,
      "verified": true,
      "author": "Pen Name",
      "helpful_votes": 0,
      "publication_date": 20190808
    },
    {
      "title": "Complete waste of money.",
      "text": "DO NOT BUY. I'm an early adopter, and I love the concept of this device, but it works so sporadically it was a complete waste of money for my family. The app is buggy to the point of useless, it forgets logins, fails to sync with the lock and when it does work it takes far too long to work. It is actually MORE convenient to use the key in this lock than the electronic system. Don't waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Nate Flood",
      "helpful_votes": 2,
      "publication_date": 20140314
    },
    {
      "title": "Piece of garbage",
      "text": "Do not buy. I repeat do NOT buy this thing jams all the time, more often than not I stand in front of my house with an armful of groceries, a full bladder and a toddler that won't hold still. I thought this would make my life a whole lot simpler.... it's made it much harder. Good idea horrible execution. I warned you, buy at your own risk.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "Died immediately after return period (6 months)",
      "text": "Worked \"okay\" for a month or two. Often requiring me log into the phone app in order to unlock. The included FOB never worked. After a few months it just doesn't work at all. Maybe it's no longer compatible with the phone updates I've received or maybe it's just bad 1st Gen tech. Either way, it wasn't worth my money, and I never gained the confidence to remove the key from my keychain (which was my goal).",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "I love this device!",
      "text": "OMG this is amazing! I no longer have to carry keys. Tap the lock on your way in & out. No looking for keys or trying to get it in the slot in the dark. The notifications are great you know who in your household has come & gone. eKeys let you allow certain people access to your home on dates & times you decide. Having this allows me to carry more from the car into the house because I now have a free hand. Buy this now! & make your life a little easier",
      "rating": 5.0,
      "verified": true,
      "author": "iosfangirl",
      "helpful_votes": 2,
      "publication_date": 20140419
    },
    {
      "title": "I am satisfied. It works well with both my iPhone 6+ ...",
      "text": "I was worried about this purchase because of the varied reviews. After having it for several months, I am satisfied. It works well with both my iPhone 6+ and my wife's 5s. I trust it enough to not carry a manual key anymore. I would say 1 out of 50 times, I need to load up the app before it will work, but other than that, works great. Most importantly: my wife actually LIKES it!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20150913
    },
    {
      "title": "Waste of money",
      "text": "Waste of money these locks lock when you don't even touch them. My wife is afraid to close door when bringing out trash because she thinks its going to lock behind her and its happened. You can not lock and unlock unless your on the same or house wifi. In order to link to Alexa you need to spend a lot more money.",
      "rating": 1.0,
      "verified": true,
      "author": "Eugene O'Donnell",
      "helpful_votes": 0,
      "publication_date": 20171118
    },
    {
      "title": "try something else.",
      "text": "So this had such promise, but.. I'm getting rid of it and replacing with a home kit compatible unit. Things I didn't like: - kept accidentally locking the door... touch the bolt or the face on the way out and it locks. - many many times it locked up and didn't work at all. couldn't connect and had to reset everything. - Lock kept jamming",
      "rating": 2.0,
      "verified": true,
      "author": "Marcel Rivard",
      "helpful_votes": 0,
      "publication_date": 20180713
    },
    {
      "title": "I would not recommend this product if I was paid",
      "text": "I would not recommend this product if I was paid. It is way overpriced for the quality. If I had bought this lock for $25.00, I might be willing to put with its failures, but $200.00 is way too much for this poorly functioning device. The lock sometimes works fine and other times your key or smart phone does not open the door. You recalibrate and it works for a time and then it does not work anymore. Sometimes you stand at the door turning at all angles and repeatedly adjusting your distance and the lock does not work and then \"the stars in the heavens\" line up and it suddenly works. You get the picture. Not reliable.",
      "rating": 1.0,
      "verified": true,
      "author": "Dog Gone",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Not Bad - Not Great.",
      "text": "Installed 3 of these. The main headache is calibrating it. You need to calibrate each phone with each lock individually. Sometimes you end up having to try 5 or 6 times to get it to lock or unlock. Mostly because you're either to close or to far compared to when you calibrated it. If you fail to calibrate, anyone can unlock it when you're within bluetooth range. One feature I wish they would add to the Kevo App, is the ability to unlock from the app.",
      "rating": 3.0,
      "verified": true,
      "author": "ArA",
      "helpful_votes": 0,
      "publication_date": 20140319
    },
    {
      "title": "You will pee your pants if you buy this lock!",
      "text": "Probably the biggest piece of crap lock on the market. Huge delay when you touch the lock to unlock the door. 99.9% of the time it doesn’t even work. $200 mistake on my part. Imagine coming home and having to go to the bathroom and your door won’t unlock.... not a fun time.",
      "rating": 1.0,
      "verified": true,
      "author": "Brandon M.",
      "helpful_votes": 0,
      "publication_date": 20171202
    },
    {
      "title": "So nice not having to worry about house keys.",
      "text": "Use these throughout all exterior doors in my house. I love them and have had zero issues with them. So convenient to use and issue keys to contractors, etc. Wouldn't use anything else. So nice not having to worry about house keys.",
      "rating": 5.0,
      "verified": true,
      "author": "Christin in FL",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "I spent a good deal of time trying to program it and on ...",
      "text": "This locks work when you ask it to the problem is it works when you don't ask it to. it frequently (daily) will lock while closing and the dead bold hits and dents the door frame to the point it needs to be replaced. I spent a good deal of time trying to program it and on the phone with Kwikset to no avail. still doesn't work. should have returned it a few days ago but liked the concept so much I kept trying and now it is not returnable.",
      "rating": 1.0,
      "verified": true,
      "author": "W. S.",
      "helpful_votes": 0,
      "publication_date": 20150712
    },
    {
      "title": "Not happy",
      "text": "It jams all the time. The blue light is not a circle around, just one dot. When it works, is very slow.",
      "rating": 1.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 2,
      "publication_date": 20180809
    },
    {
      "title": "Huge piece of garbage.",
      "text": "I bought this thing about a year ago. First of all, a lot of the features this things boasts about requires another piece of equipment (a bridge) which costs more money and is often not in stock. When attempting to lock or unlock the door, about 50% of the time the lock doesn't recognize you. When it does recognize you, it won't actually lock, it'll try but blink and crap out. It's terrible. If you're going to blow money on an electronic lock, get something with a key pad. This is awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan P Murphy",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Nice, but just now for me",
      "text": "It's fine, but I really don't think it works great with my house. The back and around key hole is more of a plastic feel than I thought it would be and the concept of it is more cool than the function. Not sure it really saves time either as it takes quite a few seconds to function. Lastly, be sure you are going to rekey it to a standard cylinder key. I have the other type from before and couldn't rekey it so I have 2 keys now anyway.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel Lazzaro",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "I continually want to like it and have postponed writing a review for about ...",
      "text": "I continually want to like it and have postponed writing a review for about 8 months but ultimately it is so infuriating and frustrating. I'm constantly having to sit stuff down, dig for my iPhone, unlock it, and open the app to get it to actually work. Even if I leave the app running in the background, I still have to do this about half of the time. I could just as easily use a key and then wouldn't run the risk of being locked out if I did happen to have a dead phone. Unfortunately disappointed and wish I would've spent less money on a keypad lock instead. :-/",
      "rating": 2.0,
      "verified": true,
      "author": "JESSICA",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Garbage",
      "text": "Garbage. Never worked right. Replaced it with the Schlage touchscreen...which works perfect.",
      "rating": 1.0,
      "verified": true,
      "author": "Wolfpack",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "I love the lock but have some suggestions",
      "text": "First, in all fairness I bought this lock as soon as it appeared so Gen 1, expect improvements to be made. Was easy to install and was nicely packaged. It often does not recognize my eKey so you stand there for several iterations and then it sees it and the door locks or unlocks. Kind of frustrating since it is so erratic. Would love for the lock to be connected to wireless so I could lock/unlock remotely via internet.",
      "rating": 4.0,
      "verified": true,
      "author": "John in Dallas",
      "helpful_votes": 3,
      "publication_date": 20140118
    },
    {
      "title": "DO NOT BUY THESE",
      "text": "I have now had two of these installed for one year. The product is a nightmare to program and set up. In spite of updating all the firmware, it just simply does not work. One of the two locks just decides to lock and unlock on its own if you touch it and the fob is anywhere near it, like on the kitchen counter! We have programmed, reprogramed, replaced the fobs, etc., etc., etc. What a disaster, one of the worst failures of any product of any kind I have ever purchased. We finally just pulled out the batteries.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20140926
    },
    {
      "title": "This was so bad it took minutes I had to return it right ...",
      "text": "This was so bad it took minutes I had to return it right away. I had to have my phone or the key fob within inches of it to get it to work which defeated the whole point of not having to pull something out of my pocket. Even when it was working it is so slow I could have opened it with my key in a quarter the time. Good idea, but they have a long way to go before this is usable.",
      "rating": 1.0,
      "verified": true,
      "author": "Dad's Woodworking",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Great - met my expectations",
      "text": "I was a little concerned about some of the negative commentary around this lock, however it installed relatively easily and it works. calibration is important, and sometimes I just get blue spinning LED with no lock or unlock - but most of the time it works first time every time. My teenage kids use it, and my wife uses it too without complaint. Pros: Relatively Easy to install, convenience factor with the iPhone, alerts, indoor LED shows lock/unlock status (great if looking down the hallway in the dark), positive feedback if locked/unlocked from outside. Cons: Sometimes have to touch a few times to activate (lock/unlock) but thats more a calibration issue and distance from the phone to the lock",
      "rating": 5.0,
      "verified": true,
      "author": "Leroy",
      "helpful_votes": 2,
      "publication_date": 20140602
    },
    {
      "title": "The definition of insanity",
      "text": "Having used it since it first came out I would have to say I am very unimpressed. I spend more time watching the blue ring of light than it would take to find my keys. It locks and unlocks on it's own. I have talked to tech support many times and while they are very nice, telling me to do the same things over and over and expecting different results....well you know. Really wish it worked better.",
      "rating": 2.0,
      "verified": true,
      "author": "Todd P. Kane",
      "helpful_votes": 0,
      "publication_date": 20160131
    },
    {
      "title": "Good -  with reservations",
      "text": "It's great -- easy install. _- I had to hide a key - because it will lock you out unpredictably -- the fobs don't work well. Also if you have it programmed to two phones, it logs the other one out -- my husband never remembers the password ---- and again the fob is a bit of a problem",
      "rating": 4.0,
      "verified": true,
      "author": "cafedame",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "Beware installation",
      "text": "Great idea. Must hire a professional locksmith to install it and hopefully he installed one before. Ours never had and it took him 3 days. We ordered 3 of them and one wound up being defective. Its finally installed and it works perfectly with the Galaxy S5 (NOT S4) phone or the fob. Now if I can just convince my wife this wasn't a waste of time and money. I love it so far.",
      "rating": 3.0,
      "verified": true,
      "author": "KHofferMD",
      "helpful_votes": 0,
      "publication_date": 20160204
    },
    {
      "title": "Be careful when you buy this product. It only ...",
      "text": "Be careful when you buy this product. It only allows one key fob at a time. I bought two and one constantly loses trust with the lock. When you touch the lock it opens after 15 seconds, you have to stand there and wait for it to open with stuff in your hands. Try the app buy make sure you're phone is Bluetooth 4.x or higher otherwise the app doesnt work",
      "rating": 1.0,
      "verified": true,
      "author": "Gennady Tesler",
      "helpful_votes": 0,
      "publication_date": 20170426
    },
    {
      "title": "Not quite to expectations",
      "text": "Got 2 last week, easy to install, calibrate (sort of) and get working (sort of)....the touch feature works better/more consistent with the iPhone vs fob, but still only about 80% of the time...I will give it another couple of weeks then post another update. Good idea, just \"buggy\" for a production run after being on the market.",
      "rating": 2.0,
      "verified": true,
      "author": "BA",
      "helpful_votes": 0,
      "publication_date": 20160602
    }
  ],
  "product_meta": {
    "title": "Kwikset 99250-003 Spectrum Brands Computer Accessories, 1 Pack, Venetian Bronze",
    "description": "Color Name:Venetian Bronze| Size Name:1 Pack\n\nYour life just got easier. With Kevo’s Touch-to-Open technology you can simply leave your smartphone in your pocket or purse upon entering; no more fumbling for your keys. Just touch the lock to open for the ultimate convenience. No smartphone? No problem. Enjoy the same touch to open convenience with the included fob. You can send an electronic key (eKey) to family, friends, or visitors who have a compatible Smartphone so they can use their phone as a key too. Receive notifications of lock activity and manage the lock and eKeys with the Kevo mobile app. In addition to the convenience, Kevo is incredibly secure. You can add, delete or disable eKeys from the mobile app or utilize the Lost Phone Reset should the unthinkable happen. This single cylinder deadbolt can be locked or unlocked by a key on the outside, or the turn button on the inside. The Venetian Bronze finish is hand-rubbed to reveal unique bronze highlights and provides a rich and warm complement to the product's style. \n\nKevo now works with Alexa voice commands (requires Kevo Plus hub, sold separately). You can lock/unlock (PIN required) and check lock status. \n\nKwikset is working diligently to add new Android device compatibility to Kevo. Each device is put through a rigorous security and user experience test to ensure that our users have the most secure and best possible experience with Kevo. \n\nAndroid Compatibility: \n\nPixel, Pixel XL, Nexus 5X,6, 6P,9, HTC One M9 Samsung Galaxy S5, S5 Active, S6, S6 Active, S6 Edge, S7 Active, S7 Edge, Note 4, Note 4 Edge, Note 5 Android Wear Devices\n\nApple iOS Compatibility*:\n\niPhone 4s, 5, 5s, 6, 6 Plus, 6s, 6s Plus, SE, 7, 7 Plus iPad 3rd Gen, iPad 4th Gen, Air, Air 2, Pro (12.9-inch), Pro (9.7 inch), iPad Mini, Mini 2, Mini 3, Mini 4 Pod Touch 5th Gen, 5th Gen (16GB Mid 2013), 6th Gen Apple Watch - notifications only. \n\n*We're pleased to share that Touch-to-Open functionality is fully restored with Apple's iOS 10.0.2 update. Upon downloading the latest iOS update, you will be able to use your Kevo lock with the app running in the background. \n\nKwikset is pleased to announce that eKeys will be completely free of charge starting February 1, 2017. \n\nYou gave us your feedback and we listened! Thank you for helping us improve your Kevo experience. \n\n\n\nFROM THE MANUFACTURER\nWith Kevo, your Smartphone is now your key. No more fumbling for your keys. Keep your phone in your pocket or purse and just touch the lock to open. No Smartphone? No Problem. Enjoy the same touch to open convenience with the fob. You can send an electronic key (eKey) to family, friends, or visitors who have a compatible Smartphone so they can use their phone as a key too. Receive notifications of lock activity and manage the lock and eKeys with the Kevo Mobile App. In addition to the convenience, Kevo is incredibly secure. You can add, delete or disable eKeys from the mobile app or utilize the Lost Phone Reset should the unthinkable happen. The SmartKey® deadbolt cylinder provides peace of mind for a backup traditional key and offers superior security against lock picking and bumping.",
    "rating": 2.9,
    "feature_bullets": [
      "Your Smartphone is now your key - touch to open convenience",
      "NOW get FREE ekeys! Send and manage eKey access via smartphone",
      "Bluetooth Smart ready with a Bluetooth 4.0 enabled device",
      "Works with select iOS and Android devices (wider compatibility with updated Google Play Kevo app which determines full and partial compatibility) - please check compatibility (below) before purchase",
      "History and notifications - see who locked/unlocked Kevo",
      "Smart Home compatibility with Amazon Alexa, Ring Doorbell, Skybell, Nest Learning Thermostat, select Honeywell Thermostats, Android Wear and IFTTT"
    ],
    "specifications": {
      "Manufacturer": "Kwikset - Kevo",
      "Part Number": "925 KEVO DB 11P",
      "Item Weight": "3.75 pounds",
      "Product Dimensions": "10.38 x 5.75 x 3.63 inches",
      "Item model number": "99250-003",
      "Batteries": "4 AA batteries required.",
      "Is Discontinued By Manufacturer": "No",
      "Size": "1 Pack",
      "Color": "Venetian Bronze",
      "Style": "Traditional",
      "Finish": "Mixed",
      "Material": "Aluminum",
      "Power Source": "Hand Powered",
      "Voltage": "1 Kilovolts",
      "Item Package Quantity": "1",
      "Water Consumption": "1 Gallons per Hour",
      "Type of Bulb": "Low Pressure Mercury Discharge",
      "Number of Handles": "1",
      "Cutting Diameter": "1 Inches",
      "Certification": "Certified frustration-free",
      "Usage": "Inside",
      "Batteries Included?": "No",
      "Batteries Required?": "Yes",
      "Battery Cell Type": "Alkaline",
      "Warranty Description": "Lifetime mechanical and finish warranty. 1 year electronics warranty",
      "Assembled Diameter": "1 Inches",
      "ASIN": "B00DP4G5PW",
      "Customer Reviews": "2.9 out of 5 stars1,574 ratings2.9 out of 5 stars",
      "Best Sellers Rank": "#129,260 in Tools & Home Improvement",
      "Date First Available": "June 19, 2013"
    },
    "categories": [
      "Tools & Home Improvement",
      "Hardware",
      "Door Hardware & Locks",
      "Deadbolts"
    ],
    "price": 109.99
  }
}