{
  "website_summaries": [
    {
      "verdict": "While most manufacturers make a 6-foot cord, this cord stands out for its versatility and durability when used in various locations and different devices. This is a good 3.5-millimeter option for those who need a short, portable cord.",
      "pros": [
        "Portability is an important feature of a short cord, and the hard rubber casing is designed to withstand lots of handling",
        "Can be moved from car to home and back without sacrificing sound quality or causing too much wear on the cable",
        "Gold-plated connectors are durable as well, and provide high-quality sound through the double-shielded connection",
        "Fits snugly into all standard auxiliary cable ports"
      ],
      "cons": [
        "Casing is thicker than some other models, so this may not be a good option for users who need a cable that can be threaded into smaller spots"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Quality",
      "text": "I am an extremist when it comes to audio with my Alienware R6, I have purchased so many different types of cables it's a shame they never get used. KabelDirect has by far the best quality for charging, sound cables, 3.5 cables, rca splitters. All types, I have purchased everything from monster to Anker, Belkin and too many to list. KableDirect works with everything. Their cables are extremely durable and great quality. You can tell right away what kind of cable you purchased. If you do some research you will see KabelDirect is nothing but quality and great prices. Highly Recommend!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Triz_Megistus",
      "helpful_votes": 19,
      "publication_date": 20170301
    },
    {
      "title": "great for a while",
      "text": "I use it from my receiver to my headphones to watch TV. It worked great for a few months. Then, suddenly the left side of the headphones lost volume on and off. It progressively got worse. I had to squeeze the cord and hold it a certain way for the volume on the left side to be on. I bought the exact same cord again, because I didn't want to mess around with a different manufacturer, etc. It's working great, so the problem wasn't the headphones. But, I'm wondering if it's normal for these lengthy cords (mine is 15') to malfunction after a while.",
      "rating": 3.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 8,
      "publication_date": 20180820
    },
    {
      "title": "Good cable, BUT (& BIG BUT )",
      "text": "Really like this cable. Works great on anything I got (iPhone, tablet, MP3 player) except what I bought it for. Have a Harman/Kardon receiver that has a 1/4 inch phone jack and my new headphones are 3.5 m/m. When I plug this cable into a 1/4 in. to 3.5 m/m adapter, it doesn't work. I had 3 adapters and none work, so I bought another 4th adapter and it doesn't work either.. Have tried different arrangements and they work. My spiral 12 ft. and adapter work with the 3/5 m/m that came with my head phones, but it's only 1 meter long. If it had worked in the receiver, would have given em a 5 star.",
      "rating": 4.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 5,
      "publication_date": 20181002
    },
    {
      "title": "beware of non-standard size",
      "text": "The plug is extra-fat with the little metal ferrule on the plug. It would not seat properly in my headphones until I unscrewed and removed this piece. It seems to hold together OK without it and I hope it is only a decorative piece for the logo. Without this extra bit of protection it seems flimsier so I only gave it 1 star for durability.",
      "rating": 3.0,
      "verified": true,
      "author": "Preston",
      "helpful_votes": 8,
      "publication_date": 20190221
    },
    {
      "title": "Excellent headphone cable",
      "text": "I use these as the headphone cable for my Audio-Technica ATH-MSR7GM phones. Frankly, the KabelDirekt product is better or at any rate easier to use than the OEM cable. The KabelDirekt product is comfortably heavy, is not prone to tangle, and lies flat and straight. On the other hand, the OEM cable is rather thin, apt to get snarled, and keeps a memory of its being coiled up in the package. Additionally, the availability of the KabelDirekt product in a variety of lengths means I can tailor the length of the cable to the application--I won't have a cable that's too short, nor one with a bunch of excess length. In all, a winning product.",
      "rating": 5.0,
      "verified": true,
      "author": "jimmy",
      "helpful_votes": 8,
      "publication_date": 20170716
    },
    {
      "title": "These cables will improve your sound",
      "text": "KabelDirekt makes a top quality cable product. I use them to sweeten the quality of signal from point A to point B be it from music player to portable amp and and again to headphones. There is a noticable difference in sound quality ie...stereo separation, soundstage, headroom, punch and lower distortion. If you swap out lowest quality cables for these the difference can be, how you say, night and day. Well built and attractive. Highly recommended!",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Herman",
      "helpful_votes": 5,
      "publication_date": 20180213
    },
    {
      "title": "Very High Quality Cable",
      "text": "This is a very high quality cable. I'm using it to connect a Bluetooth receiver to a set of Monsoon MM-2000 4.1 speakers and it works perfectly. The connection is 100% reliable, there's no static or scratchy noises and it's a very nice looking cable, as cables go. Not sure what else to say about it other than that they DON'T charge an arm OR a leg for these great cables! GET ONE! You won't be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Big",
      "helpful_votes": 5,
      "publication_date": 20170308
    },
    {
      "title": "Great length and quality",
      "text": "Excellent, high quality stereo cable that performs perfectly. For our use, the 25 foot length is a real bonus eliminating the need to connect multiple cables end to end creating potential connection issues. We are using it to connect a PC's headphone/speaker output to the audio system some 20 feet away allowing us to play Pandora and other music through the audio system. Very nice. Rapid shipping and arrived well packed.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall S.",
      "helpful_votes": 4,
      "publication_date": 20180308
    },
    {
      "title": "Plastic bag and cord severely damaged",
      "text": "The manufacturers bag containing the cord looked like it got caught in a conveyor belt. It was severely ripped and melted. The cord itself was also badly damaged. I started the return process 5 minutes after it was delivered. The shipping package which contained 3 items in total had no damage at all. Whoever pulled and shipped that damaged cord should lose their job.",
      "rating": 1.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Decent cable for light use",
      "text": "I purchased the 25 foot one about 6 months ago, and its held up great with light use. However, I got a 3 foot one for my car a month ago, and its already wearing out. I have to hold it a certain way or it only plays out of the left side. In my car , i rest my phone in the cup holder, on top of the charger and aux cable, so there is an unusually large amount of wear on my side, mind you. Sound quality is good and it doesn't feel cheapy either.",
      "rating": 3.0,
      "verified": true,
      "author": "Franklin",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Well built cable!",
      "text": "I am using the 15 ft. cable to connect to my new ThinkSound On2 headphones, as the cable that came with the phones was only 4 ft. long. The cable is extremely well built and locks in securely to the phones with no problem, and offers very clear sound quality. This is the 3rd or 4th KabelDirekt product that I have purchased and I've been very pleased with all of them. They all have a certain \"professional\" appearing finish which is another plus. Overall A+!",
      "rating": 5.0,
      "verified": true,
      "author": "paul brunson",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "Awesome audio cables!",
      "text": "I used these cables to replace several audio cables to my headphones. I wear noise cancelling headphones when I am working around load machinery such as grinder, shop vac, sanders. My existing cables had worn so much I would only hear out of one ear phone or the background noise would cut in and out. I replaced the old cable with these and what I difference. These are really well made and the sound transmission is perfect! I would recommend any of the cables from this seller, they are worth the costs and have the excellent quality you would expect.",
      "rating": 5.0,
      "verified": true,
      "author": "robertjonessan",
      "helpful_votes": 4,
      "publication_date": 20160815
    },
    {
      "title": "I don't have any problem with these.",
      "text": "I use these to string headphones across my bedroom from my tower pc to my bed so that I can watch and hear movies in bed at full volume without anyone else in my house hearing. I am an AirBnB host and have guests who stay above me. It is very important that I do not disturb them so I can get good reviews, so if I want to watch tv at night, then I use these headphones to watch tv from across my bedroom in bed. Very nice and convenient, as loud as I like but no one else can hear. Cord is durable and thick. Connection is always good.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Good quality aux cable",
      "text": "I bought this aux cable to connect my TV to a karaoke machine. I am always skeptical to buy aux cable as often times, cheap cables will have some static noise. This cable worked pretty well, it is long enough for a mounted TV to a karaoke machine connection. The sound quality is very good, I could barely hear any static noise. The music plays good through this cable. I will definitely put this in my Amazon wishlist just in case I need another one later on.",
      "rating": 5.0,
      "verified": true,
      "author": "R4LDZ ✅",
      "helpful_votes": 0,
      "publication_date": 20191129
    },
    {
      "title": "Not good for earphones",
      "text": "If one is planning on returning this product they will NOT pay for return fee. That will be deducted. I ordered to utilize with my earphones but no fault of the product, it wouldn’t click into place where only one side could be listened to. They also process within minutes so you won’t be able to cancel. Other wise it is very well made. Purchased kinps auxiliary male to male that I had brought 2 years ago & that fits into my earphone. Only gave it 1 ⭐️ because it didn’t work for me & return is out of pocket.",
      "rating": 1.0,
      "verified": true,
      "author": "Senior Person",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Failed after 6 months use",
      "text": "Initially, this is a fine product; however, after about 6 months of routine use as a headphone cable, one of the connectors began to fail. The sound breaks up with any movement. The product description page says that KabelDirect warranties their product for 18 months, so I expect a replacement. Depending on how this process works out, I will edit the review accordingly.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Short",
      "helpful_votes": 4,
      "publication_date": 20190114
    },
    {
      "title": "Great Cable",
      "text": "I had been having trouble with my external computer speakers and was close to replacing them. At the last minute I decided to try a new audio cable and ordered this one. The length was maybe a little longer than I needed but my computer is in an alcove in my desk a bit of a ways from my monitor and speakers. Probably needed something around 10 feet but rather than getting too short of a cable I went with this one. Sound quality has improved dramatically so I figure my old cable had seen better days.....it was 20 years old....and this cable is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "RandyK",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Required modification",
      "text": "It wouldn't quite fit into my headphones. There is like a ledge before the bend limiter. Because the jack on my headphones is beveled the ledge wouldn't allow the cable to plug all the way in. The ledge is not necessary so I filed it down. Took about 15 minutes with the Leatherman. Fits fine now. If the ledge is not necessary, why is it there? Bad design.",
      "rating": 2.0,
      "verified": true,
      "author": "Islandboy",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "So far, so good.",
      "text": "I had to rearrange my office at work. Just about everything was moved except my monitors. The powered sub was now on the wall behind me. The speaker output on the laptop was now just over 20’ from the speaker input. I have never needed a cable this long. I searched amazon and found this 25’ cord. The price is okay considering the length and it appears to be well made. Got it quickly and installed it. I was not expecting any sound difference so I wasn’t disappointed. All in all, it is a simple cord that has solved a major problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Outta Control",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "too bulky",
      "text": "Wont snugly fit in my hyperx headphones. The end is too big and blocks it from entering most of the headphones. Can hardly hear sound because of this. Edit: I was some how wable to get the whole silver part to slide off and now I can hear full sound! Because of this I have to changed to 3 stars. (from 1 star)",
      "rating": 3.0,
      "verified": true,
      "author": "seasurfsmile",
      "helpful_votes": 2,
      "publication_date": 20190331
    },
    {
      "title": "Totally blocks line noise.",
      "text": "I have a new Samsung TV model that hides the cords in the back by grouping them together in a channel with plastic cover. I already had a 1/8\" stereo cable to output to my external Oontz Angle 3 Ultra XL speakers, but there was a lot of line noise coming from the power cables so clearly it wasn't shielded. I ordered this and replaced the line, and it worked perfectly. No noise whatsoever. KabelDirekt is a company in Germany, they make great high-quality products, so I had a good feeling it would work fine, and it did.",
      "rating": 5.0,
      "verified": true,
      "author": "EO3 PhotoWorks",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Did not work",
      "text": "This cord did not work. I asked for a replacement; it did not work either. The company's response was to make sure there was no dust interfering. Don't waste your time or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190414
    },
    {
      "title": "Great for close distance connections.",
      "text": "I love this short cable. I recently purchased thewhich allows me to charge my iPhone X while it is in the stand. I have the phone mounted on my dash, very close to my car stereo. With this 1 foot cable, I can connect my phone without having excess cable getting in the way. Also, the cable hangs from the stereo and does not get in the way when it is disconnected.",
      "rating": 5.0,
      "verified": true,
      "author": "frankfromnj",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "Moving on...",
      "text": "This product lasted two weeks before an interruption of sound began in a new pair of headphones, making only one speaker work. I tried this cable on two different sets with the same results and then changed to a different cable. The problem went away. The shielding on the cable is thick and the gold-plated tips are reported to offer a better connection. I assume the connection inside broke.",
      "rating": 1.0,
      "verified": true,
      "author": "JG",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "The plugs are very good quality, and should work great",
      "text": "I think I received these a day earlier than estimated. Instead of the postal service delivering this on Saturday, UPS delivered it to me on Friday. Cable looks like it's going to work just fine. I wanted a shorter cable for my iPod Nano in the van. The other RCA cable I had was way too long, and got tangled in everything including the iPod Nano. This should be much less of a tangled mess.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory J. Burton",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Broke after very little use",
      "text": "Bought te 15 foot length 7 months ago and used it very rarely. Just to watch TV late at night; maybe once every two weeks or so. Unfortunately, now, audio is not being heard through one of the speakers. It's the cable and not the headphones, since they work fine with a shorter cable. Moving the cable around temporarily fixes the problem but, as soon as I move my head, the right speaker shuts down.",
      "rating": 2.0,
      "verified": true,
      "author": "J. Sanctus-Filius",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "YES THIS IS THE ONE YOU'RE LOOKING FOR!",
      "text": "Excellent product. Using to split signals from pre amps within my stereo set up and they REALLY WORK. Sound quality and volume doesn't appear to be affected at all by the split! I was trying to accomplish the same thing before with piggyback rc a cable and it was a massive exercise in frustration. I also had really bad experiences with a 5 way splitter where the signal was diminished to near nothingness. But these Kabeldirekt splitters work beautifully and provide two equally strong signals and have enabled me to do some cool things with my system! A+",
      "rating": 5.0,
      "verified": true,
      "author": "Carl L Larson",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "broke in 3 months",
      "text": "I used this 3-4 times a week. It broke after 3 months use. the tip snapped off inside my ipad when I was removing it!! It looks so sturdy, but I guess after repeated use it just doesn't hold up. NOw I have to buy a tool to remove the tip from my ipad...i pray this works because as of now, I have no other sound except bluetooth. Too late to return or request a refund so Buyer Beware.",
      "rating": 2.0,
      "verified": true,
      "author": "MarvelMusic",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "Good Sound Quality and Length",
      "text": "I use this to plug my sound bar system into my projector. Given that they are both on opposite ends of the room I needed a long and durable aux cord for the job. This one definitely delivered. It seems very durable and has good sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Nato S.",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Great cable for Hi-Red audio setups",
      "text": "Great cable for High End Audio setups. Absolutely no unwanted noise or jitter. Delivers sound as it is meant to be heard. Never had a problem with KabelDirekt Cables. I use their cables in my car audio setup as well and have zero complaints. Good price and quality. The cheap cables you can buy at your local WM stores are more than fine for average listeners, but if you are playing audio through a high-end audio system spend the extra couple of bucks and never worry about it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Toby W. Yates",
      "helpful_votes": 0,
      "publication_date": 20190411
    },
    {
      "title": "Used lightly on my desktop - now its internal wiring is loose at one end",
      "text": "Used for a 4 months - very lightly on my work desktop. The cable was plugged into my monitor and directly into my headphones which always sat at my desk. Recently realized that I was getting audio only from one channel - when I wiggled the wire both channels came on. This should not be happening from a PRO cable! I sometimes roll up the wire fro storage but not in a tight formation (usually the circle is around 20cm dia / 8 inch dia. As such I would NOT recommend this cable!",
      "rating": 1.0,
      "verified": true,
      "author": "wfarid",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "Great conductivity",
      "text": "I used to utilize the generic audio cables that came with my electronic purchases. With my logitech speakers, I was having issues with static interference. I purchased these as these are gold plated for better conductivity (& less static which comes through static noise) and that solved my problem. I purchased the 15' cables and purchased another set for my computer. I would highly recommend, Ravi Peiris, MD.",
      "rating": 5.0,
      "verified": true,
      "author": "Ravi Peiris M.D. ",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Didn't last a year",
      "text": "This cord lasted me around 6 months before it started to give out -- I had to move one end around to make sure I was getting full audio output. By the 7th month, there was not much output and no amount of jiggling each end of the cord could fix it. It was good while it lasted, but unfortunately it didn't last very long.",
      "rating": 3.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Great audio quality isn’t so expensive after all",
      "text": "I don’t normally get excited about things like cables, but this one truly did impress me. I’ve had issue with crackling from my JBL creature speakers for a few years now. I always thought it was an issue with the speakers, so I tried several cheap audio cables to prove my point- they all sucked. Then I read a blog where someone mentioned these as a solution to the same problem. I tried this cable, and after a few years of annoying crackling sounds... it finally stopped. Investing a little more $ in a decent audio cable was SO worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brian T",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "lasted 9 months",
      "text": "I bought this cable in February and it was working perfectly until last month the cable started to not work properly. It definitely isn't miss use or anything because I always leave it in my car properly coiled and never take it out. I constantly have to jiggle the cable around just to get it working properly. I see that on amazon you claim an 18 month warranty on the product and I would like information on that.",
      "rating": 3.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 2,
      "publication_date": 20181120
    },
    {
      "title": "Just buy the cable. For real.",
      "text": "Bought an old JVC Kaboom from other vendor however I purchased this Brand because the crackle that was evident in this vintage JVC AUX input was offputting. KabelDirekt products made that annoying crackle go completely away. This was used to connect my Galaxy Note to the JVC as well as our iPhones to listen to all our music. Jamming once again with crispy sounds & resonating bass via this Audio Aux cable.",
      "rating": 5.0,
      "verified": true,
      "author": "NoneYa",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Absolutely horrible sound quality!",
      "text": "I received a 25ft AUX cord and I have to say I am extremely disappointed. As soon as I plugged it in there was an incredibly loud crackle and buzz until I tried to play a song. Then when I would play the song the buzz would fade but you could barely hear the song. I also noticed that none of the bass notes were being played which is a big part of the music I listen to.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Ferrier",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "OK cable but...",
      "text": "Looks like a well made product but... I'm very attuned to sound quality and what I notice others might not mind. This cable is being used between a portable CD player and a headphone amp. The bass is nice & clear, the mids are fine but the high end suffers a little. That high-end sparkle or \"air\" around instruments attenuated just enough for me to notice. If you have gear or headphones that are \"bright\" sounding, this cable will help tame that.",
      "rating": 4.0,
      "verified": true,
      "author": "RickeyM",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Defective.",
      "text": "Cable doesn't work. Contacted seller weeks ago and they won't contact me back. Avoid!",
      "rating": 1.0,
      "verified": true,
      "author": "Andrea",
      "helpful_votes": 3,
      "publication_date": 20180111
    },
    {
      "title": "Felt and looks great, but not so much...",
      "text": "So much buzz in this cable! I didn't hook it up until recently, come to find out there is nothing but a wicked buzz in the line, as though something were grounding out in it. I would steer clear of these as they felt as though they may be of good quality, but obviously there is something wrong. Too bad I waited this long as I would have returned and asked for my money back. Prior this review, I ended up hitting up Radio Shack before they closed and got a cable that felt of less quality, but was far superior in sound.",
      "rating": 1.0,
      "verified": true,
      "author": "mrjrclark",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Cable doesn't work (confirmed others do)",
      "text": "Cable doesn't work. Static sound and one side cuts out. Different cord works so it's definitely this. Didn't think I'd have a problem with a 1 foot cord, and not worth the hassle to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew A. Garber",
      "helpful_votes": 4,
      "publication_date": 20160809
    },
    {
      "title": "FYI - DOES NOT FIT SKULL CANDY HEADPHONES.",
      "text": "It's a good cable, you can really hear a difference, but it will not fit SkullCandy headphones with the recessed input like those on the Hesh 2 headphones. Would be nice if KableDirekt would make a version of this cable that would fit recessed inputs or at least offer an adapter that can.",
      "rating": 3.0,
      "verified": true,
      "author": "BBILB",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Excellent quality",
      "text": "I use the 3.5 mm double male cord to connect my headphones to the TV analog out port. I'm not an audiophile but the sound integrity is excellent, also cord is nice and thick and does not kink, build materials feel first rate.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Didn't reduce noise feedback any better than the cheap versions",
      "text": "Didn't reduce noise feedback any better than the cheap versions. I bought this ground loop noise isolator which worked great and fixed the feedback issue I had playing audio via an aux cable in my 2007 Camry. Here's the link to the listing, which I highly recommend",
      "rating": 2.0,
      "verified": true,
      "author": "Zack Byard",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Very nice!",
      "text": "Nice quality, and it has a slightly different shape than most cables (kind of oval) which I love(They all look so similar it is nice for a change). It does have that extra \"shelf\" which will allow you to use the cable on many devices without the need to take the slightly bulky case off first. Audio quality is what you would expect from a non free cable, no additional hiss or sound degradation, if you have used a jambox cable on headphones or the car you know what I mean. Would buy again if needed!",
      "rating": 5.0,
      "verified": true,
      "author": "jd picchietti",
      "helpful_votes": 8,
      "publication_date": 20140718
    },
    {
      "title": "Excellent sound from this cable",
      "text": "I'm using the 1-foot cable to connect my mp3 player to my car's audio system. At my first playing of music with this cable, I noticed a significant improvement in sound quality, compared to my previous cable. It appears to be very well made. Since I've only had it for a few days, of course I can't comment on its durability, but judging by its appearance, I expect it to last a long time. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip O. Chomak",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Cable Bad after 3 months",
      "text": "So the cable was actually really decent up until recently. The connection to my headphones is loose somehow and I only wear this at my desk and I don't move around a lot. It's disappointing because I bought the 2 smaller sizes and those are still working just fine. This why I'm giving it a 3. I want to believe it's just a bad cable not a bad product overall.",
      "rating": 3.0,
      "verified": true,
      "author": "Cole",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Perfect",
      "text": "These cords are perfect for plugging my tablet into any of my stereos. I keep one in the car, one in the shop for the little boom box and one in the living room for the main stereo. I can take my tunes anywhere and not worried about older equipment not having bluetooth. I highly recommend. The quality is excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Sqwirly",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Not well shielded (for a 25' cable)",
      "text": "I tried running this cable from speakers in my office to a Thunderbolt dock on my desk. For about 4 feet it has to run near a power cable feeding the dock. Tons of interference and buzzing in the audio. Switched to a \"plenum rated\" cable from C2G (Cables To Go) also on Amazon and have no buzzing etc.",
      "rating": 1.0,
      "verified": true,
      "author": "Nate S",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "This company sells incredibly good cable at an amazingly low price",
      "text": "This company sells incredibly good cable at an amazingly low price. Their cables have to be one of the absolute best values in stereo/audio/video equipment. I have a couple thousand dollars of stereo interconnects from Cardas, Kimbler and Audioquest, and KabelDirekt is as good or about as good as these big name products yet costs 90-95% less. The KabelDirekt sound is smooth, accurate, clear, \"musical\" and \"forgiving\" in the case of lesser quality signals from certain CD's and MP3 files. They could triple the price of their cables (or even higher) and I'd still buy them as well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Leemore",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "Bad Design",
      "text": "The 3.5 insertion plug has a lipped edge at the end of the plug that hinders it from going completely into most products. I had to grind down this lip to allow it to work. Bad design.",
      "rating": 1.0,
      "verified": true,
      "author": "Russell Moulder",
      "helpful_votes": 2,
      "publication_date": 20190102
    },
    {
      "title": "I have alway received a great product from KabelDirekt",
      "text": "I am a repeat customer, as every cable I've ordered works as it should. The material quality and assembly seem to be of high quality. Can you buy a cheaper cable, yes. Will a cheaper cable be a good cable? If you are lucky. Sometimes it's worth spending the extra dollar.",
      "rating": 5.0,
      "verified": true,
      "author": "John D",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Best cable I've ever had",
      "text": "Best cable I've ever owned. I feel like I've spent an eternity searching for a cord that just lays straight, and this is the one. The sensation of uncoiling this cord and watching it unravel effortlessly into a straight line is SO satisfying, and worth the money alone (lol).",
      "rating": 5.0,
      "verified": true,
      "author": "Ksears",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "Good quality cable. Unnecessary to buy name brand cables that cost 50x more",
      "text": "Arrived as stated, 2 days. Quality is good. I tan it from the front glove compartment under the side panels and up along the back seat of the car so the cable is not exposed to connect to a tablet hanging on the rear headrest for my baby to watch videos and hear it through surround sound",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Martin",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Good for about a month",
      "text": "Good for about a month. I bought this once... worked great! Then after about a month or two, one ear of my headphones just started cutting out and would only play if the plug was held at the right angle. Ordered a new cable and the same thing happened after another month or two. Note that I did not pull, twist, crimp or otherwise abuse this cable. In fact this most recent time it was working fine at night. I took my headphones off... put them on the next morning and that was it. No physical contact at all with the cable and it failed as described. I know this is not a terribly expensive cable, but it should 'work.'",
      "rating": 2.0,
      "verified": true,
      "author": "Anthony T. Gargiulo",
      "helpful_votes": 3,
      "publication_date": 20160827
    },
    {
      "title": "Cable stopped working 2 weeks after receiving it",
      "text": "cable stopped working after 2 weeks, only plays audio out of one side of any headphones I use with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 3,
      "publication_date": 20180323
    },
    {
      "title": "Won't stay plugged in! >:C",
      "text": "They won't stay plugged in! They keep popping out of the socket. I don't know if the ends are too short or something, but this is ridiculous. 0/10, would not buy again. They only stay plugged in if you force them in and keep them there with your hand.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristen",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Decent but breaks down in 2 months. Not worth it",
      "text": "Bought this cable because most of my cables for the beats tend to wear over time and the cables inside get damaged and only one side of the headphones work. They seemed the most durable and worked great for 2 months. They recently began having issues where if i position the cable in any awkward angle the headphones only work from the right. I expect it to get worse over time. Therefore I don't recommend this product to anyone. Pay $5 extra and get a more durable cable. That's what I will be doing",
      "rating": 2.0,
      "verified": true,
      "author": "Aamer",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Great buy!",
      "text": "The length was more than perfect, gave me some wiggle room to experiment with the layout I have. I bought this cable with the intended use of hooking one end to a computer and the other to over ear headphones. The Computer being connected to the tv for better content/game viewing. The only thing that would make this product better for me would be making one of the ends thinner because the headphone jack port is a thin tunnel, but I have an adapter for that. Other wise this product does what it claims.",
      "rating": 5.0,
      "verified": true,
      "author": "Victor Barron",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Huge Improvement!",
      "text": "I picked up my old cables from the local big box store and I never seemed to get good clean sound with crackles once in a while. These cables supply clean crisp sound. I've never had an issue with these cables at all. Once I tried a couple of this brand and style, I picked up a lot of different lengths and types to make my sound system better. I use these for audio from my mixing board to my cameras as well as on the road recording from the lapel mics and hand held mics to the cameras for a local real estate cable TV Show and You Tube Videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Wesley C. Brooks",
      "helpful_votes": 2,
      "publication_date": 20141023
    },
    {
      "title": "Sound quality",
      "text": "I like this cable it’s too early to say that it is a very good cable but for looks of it I think it will last long like i said too early to say that it is a very good cable but I like how this cable looks and I like how this cable makes my music sound awesome i got the 10’’ inch long cable and it’s still giving a very good sound of my iPhone",
      "rating": 5.0,
      "verified": true,
      "author": "Antony Sanchez",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "No noise pick-up",
      "text": "I'm using this 15ft cable to connect between a laptop and powered sat/sub system. The is being used at work. Consequently it is not in the best noise free environment. The cable runs by 3 vacuum pumps, and delivers flawless noise free performance. I did use a shot of Cramolin (purchased on Amazon) on either cable end to minimize preventive maintenance. I'm a happy camper with the cable's performance.",
      "rating": 5.0,
      "verified": true,
      "author": "gajdet",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Worked fine until the 2 month mark.",
      "text": "Cable worked fine for 2 months. At that point something went wrong with one of the end connectors where the cable meets the plug. Wiggling that connection causes lots of static, and in order to get stereo sound the cable must be held at a bent angle. The cable looks fine, just internally has problems. The cable was set up once and left in the same position for 2 months with no-abnormal stresses on the cable.",
      "rating": 1.0,
      "verified": true,
      "author": "gabe",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "IMPOSSIBLE TO GET AHOLD OF!!!!!",
      "text": "Received this today and it came with a card that has an option to extend the warranty, it says to text “...” but doesn’t give a number to text. The link provided goes to their Facebook page. Can’t get ahold of these people.",
      "rating": 1.0,
      "verified": true,
      "author": "TGF",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Useless after a few weeks",
      "text": "I've ordered three cables, three different times. When the first cable failed, I assumed it was due to the length. I have since purchased a smaller 6ft and 3ft cable and both failed a few days after the 30 day return period. This is a waste of money, buyer beware you get about 2 to 4 weeks out of each cable. Garbage product quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Carpenter",
      "helpful_votes": 0,
      "publication_date": 20190510
    },
    {
      "title": "I never knew a cable could make so much difference!",
      "text": "I never knew a cable could make so much difference! This cable is great! I replaced another gold-plated cable and it still made a world of difference. This cable is so clear that when a song is not playing, it sounds like the cable is unplugged. Absolutely no background noise. I use this cable to go between a NoiseHush Bluetooth headphone adapter and a pair of AudioTechnica noise-cancelling over-the-ear headphones and it is audio bliss. I would definitely recommend this cable. It would probably also be great for connecting an MP3 player to an aux jack on a car or home stereo.",
      "rating": 5.0,
      "verified": true,
      "author": "Rusty",
      "helpful_votes": 2,
      "publication_date": 20140630
    },
    {
      "title": "The best 3.5mm shielded cable I have found.",
      "text": "Top notch cable, and shielded the signal where other \"shielded\" cables failed, without having a huge, bulky connector. HIGHLY recommended for applications that are run near noisy power cables or lines, or interact with noisy devices like a computer. You won't find a better cable to run to your PC speakers.",
      "rating": 5.0,
      "verified": true,
      "author": "matthew",
      "helpful_votes": 0,
      "publication_date": 20180617
    },
    {
      "title": "Very durabile",
      "text": "Switch to these because my old audio jacks weren't working and we're falling apart. I've been very satisfied with both the improved audio quality and the durability of this headphone jack. It is the perfect length for what I was looking for and served my purpose as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Wayland",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "MAJOR Durability and Reliability issues. Consider something else.",
      "text": "Bought this 20’ cable back August and have used it maybe a couple dozen times since, as a patch cable for my video boom mic, set up off camera on a overhead tripod. In the last week, the audio of the right channel has been cutting out when recording, luckily I record a safety track as well. I tried a different recording set up to make sure it wasn’t my gear, and same issue was present, more so when wiggling the cable. Durability and reliability are of extreme importance and this cable doesn’t fit those needs. I DO NOT RECOMMEND this cable.",
      "rating": 2.0,
      "verified": true,
      "author": "Christina",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Highest Quality",
      "text": "I am a professional installer and I always purchase KabelDirekt when I am installing any sound or video equipment. Excellent quality and the price cannot be beat. Don't even consider anything else or you will be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "William Langley",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Headphones to amp for Bass Guitar!",
      "text": "I ordered the 15 ft version for my son so he could connect his bass amp to his headphones while playing. When the cable arrived, I was impressed by the thickness of the cable and the quality of the ends. So far, it worked great for what we needed it for. The length allows him a bit of space to move around without being so closely tethered to his amp. So far, so good!",
      "rating": 5.0,
      "verified": true,
      "author": "NurseB",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "This company's products need to be more accurate in size.",
      "text": "KabelDirekt products have very good performance compared to price. However, it is a disadvantage that not all jacks of all products fit correctly. I bought four of these products. When I plug it into my Cambridge Audio company's CXR 200 receiver to SONY MDR 100 abn NC headphone. My SONY headphones are not in good contact. However, other 3.5mm AUX cables fit very accurately. I bought four kinds of products of this company, but the quality of the product is good, but it is very dissatisfied that the size of the jack does not fit exactly. If this is improved, it will be the best product.",
      "rating": 2.0,
      "verified": true,
      "author": "DJ",
      "helpful_votes": 0,
      "publication_date": 20170508
    },
    {
      "title": "Was getting pretty bad noise from surrounding cables (I know",
      "text": "Purchased a set of speakers that came with a thing 3.mm cable to connect to my PC. Was getting pretty bad noise from surrounding cables (I know, should keep low volt signals from power). Anyhow, picked this one up that apparently has better shielding and the noise went away/became very minimal even at high volumes.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin A",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "Just what I needed",
      "text": "I needed this for a spare for the cycle room to teach class. We’re supposed to be able to hook up to Bluetooth to play music, but electronics seem to have a mind of their own. I have this for class as a back up to plug into wall and my music.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom to one",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "great product",
      "text": "I love having a 3.5mm extension cord. this way i can listen to stereo or tv, without bothering others. I know every one has bluetooth, but i cant get mine to work. Remember for stereo there needs to be 2 groves.",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Inspector #5 must have been on break",
      "text": "One channel not working. Right out of the box. Thought I would splurge on slightly more expensive item. Waste of money waste of time. Bought a 2 dollar replacement at the hardware store and it works fine.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Cohen",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Durable so far",
      "text": "My biggest annoyance is the lack of durability in connectors on most standard electric cords. This cord has, so served, served solidly after a month of regular connecting and unconnecting of portable equipment.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ Marshall",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "EXACTLY what you would expect!",
      "text": "Received this product when expected and it performs as expected - can't ask for better than that! Excellent...can now listen to my old iPod music and control it from my bathroom while getting ready!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol J",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Not for recording-headphones or computer peakers only.",
      "text": "Purchased to use as a line level audio feed to a recorder, but sadly after testing, the crosstalk between the channels was unacceptable. (1khz sine @-2dB). The photo shows what's inside, the inner conductors are foil shielded which is a plus, so you won't be picking up any radio stations. I was going to send it back but now I've cut it to show you the inside I'll recycle as a headphone extension. Actually if you manufacture cables and sell online, a picture of the inner construction should be mandatory.",
      "rating": 2.0,
      "verified": true,
      "author": "MSD",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "KabelDirekt you are amazing.",
      "text": "ive bought multiple things from this seller and have always been happy and impressed with the quality. they just seem to be built better than others. this cable is no exception. keep up the good work guys.",
      "rating": 5.0,
      "verified": true,
      "author": "Namu",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Definitely worth the few dollars extra.",
      "text": "I try not to get pulled to far in to audio cable hype. Mostly, I look for something that's constructed well, and uses quality parts. The KabelDirekt cable seems to fit the bill nicely. The overall feel seems to suggest much more quality over the \"cheapest you can get me\" cables that are only a few dollars less. There was no distortion when either end of the cable was wobbled, and the jacks fit perfectly -- no wobble, and no added size to trick you in to thinking the cable is better quality (while simultaneously bending your audio jack). Totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Nicholls",
      "helpful_votes": 0,
      "publication_date": 20150502
    },
    {
      "title": "Very durable",
      "text": "Worked really well, very tough, my 6 year old uses it for his headphones after going through several cables. This one has lasted the longest, several trips across the country and still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Juan",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Poor Connection",
      "text": "I bought this cable to plug my wireless headphones into my guitar amp. The chord that came with the headphones was too short, so this seemed like a good alternative. It started cutting out and losing connection after about 2 weeks of light use. Just after the return period was up. I really expected better, even for this price.",
      "rating": 1.0,
      "verified": true,
      "author": "Ben",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "I Love KabelDirekt",
      "text": "This cable, like all of the KabelDirekt cables I have ordered from Amazon, is sturdy, stylish, and functional. It looks good, feels good, and the connectors are of a high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bish",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "Won't fit into my Sony MDR-ZX770BN Headphones",
      "text": "The 5.8mm dia shoulder above the 3.5mm plug is too large to clear the inset on my Sony MDR-ZX770BN headphones, so they won't clear to plug in. Otherwise they are fine if there is no clearance issue.",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald W. Grassl",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Must be faulty",
      "text": "Update: after using for a few weeks it is not getting sound into both headphones when other wires work great with them. Really disappointed This is great for using to watch TV with standard headphones but is not quite what I expected",
      "rating": 4.0,
      "verified": true,
      "author": "Shelly G.",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Didn’t last more than a couple months",
      "text": "These worked great for about two months then out of nowhere the right side of my headphones aren’t working unless I bend the cord in a particular, ridiculous angle. I have headphones that allow for cord replacement and my other cords work perfectly so I know it isn’t the headphones. I’m bummed because these had very good reviews.",
      "rating": 2.0,
      "verified": true,
      "author": "Nic",
      "helpful_votes": 0,
      "publication_date": 20200623
    },
    {
      "title": "Very nice cable, gold plated connectors, and has a great price",
      "text": "I needed a cable to connect my laptop to my car stereo for audio tuning (laptop outside the vehicle) and this fit the bill. The construction is a nice quality, and the connections feel secure. If you've ever had a KabelDirekt cabel before, you'll know what I'm talking about - these are very nice cables at a great price. Sound quality seems good too - I haven't heard any hiss, the signal sounds like it's going through at 100% (no attenuation), and even during silent parts of music there's no phantom noise.",
      "rating": 4.0,
      "verified": true,
      "author": "James R.",
      "helpful_votes": 0,
      "publication_date": 20150513
    },
    {
      "title": "I can now watch TV at night without waking up the family!",
      "text": "Works perfectly for my purpose. Using my Turtle Beach Ear Force XO One headset with an FiiO A1 Black Portable Headphone amplifier to replace my broken Turtle Beach Ear Force X12. Using the RCA-to-3.5mm adapter that came with the X12s, I connect this cable to the amplifier and now I'm able to control the volume and bass when watching TV at night so that I don't bother my family (ok, except for the laughter when watching a comedy) Highly recommend the product and seller. I'm not an audiophile, but considering that this is a rather long cable, the sound quality is outstanding!",
      "rating": 5.0,
      "verified": true,
      "author": "Jose Sanchez",
      "helpful_votes": 0,
      "publication_date": 20170427
    },
    {
      "title": "Not as durable as I thought.",
      "text": "Ordered on dec. 21, I'm writing this review on Feb 18. One end of the cord is going out. If you wiggle it right it will work for a little while, don't move from that position though.",
      "rating": 2.0,
      "verified": true,
      "author": "Cedstevo",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "Doesn’t make the grade!",
      "text": "I’m having to wiggle the cable to get my speaker to work so sucks. Total waste... I waited to give an honest review after actually using this product! Ok so after 4 months it’s junk barely touch the cord and viola no sound and again so forth and so on. Junk!",
      "rating": 2.0,
      "verified": true,
      "author": "S. Benson",
      "helpful_votes": 0,
      "publication_date": 20170928
    },
    {
      "title": "Cable works fine. Need adapter for Bose QC headphones.",
      "text": "Good cable in terms of sound. Though both this cable and my Bose QC headphones are spec'd at 3.5mm, the KabelDirekt plug was slightly too large for the Bose socket (not sure if it is the KabelDirekt plug or the Bose socket that is the issue), however I worked around this by purchasing a 3.5mm coupler and connecting my Bose cable to this cable and it works fine. KabelDirekt was GREAT in terms of customer service when they found out it didn't fit out-of-the-box and were eager to help remedy the problem.",
      "rating": 5.0,
      "verified": true,
      "author": "BJH",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "Bad end",
      "text": "I bought the one foot version and I liked it so much I bought another plus the 3 foot version. Both 1 foot cables work fine, but the 3 foot cable is bad. I have to flex the cable where the cable enters the 3.5mm connector to get sound out of the left speaker. I reversed the cable and the problem followed the cable end.",
      "rating": 1.0,
      "verified": true,
      "author": "Todd",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Worked fine until it didn't",
      "text": "Bought it to connect my phone to listen to music in my car. Worked great until a couple weeks ago when the sound quality started to get very staticky. It would get better if I moved it around or positioned my phone/cord differently so I thought maybe there was something going on with my phone port. Then it just stopped working all together. Lasted less than 3 months",
      "rating": 2.0,
      "verified": true,
      "author": "yuji kabe",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Good.",
      "text": "Price per foot is good. They feel nice, but wouldn't mind a little bit more heft to the cable, but connectors are solid. I use the 1 foot cable in my car everyday and no longer have excess cabling to manage.",
      "rating": 4.0,
      "verified": true,
      "author": "Phillip M",
      "helpful_votes": 0,
      "publication_date": 20190109
    },
    {
      "title": "Dead at one year",
      "text": "Used only in a garage-kept car every other day for commuting 22 miles each way. Was wrapped in Rancco cable protectors for three inches on each end. It has started adding a buzz to the music and the plugs are coming unscrewed. Crappy.",
      "rating": 1.0,
      "verified": true,
      "author": "notastep",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Good quality decent price",
      "text": "Good price for the money wanted something shorter wish I could have found an even shorter onefor the money. Wouldn't hesitate to get another one if I needed it.",
      "rating": 5.0,
      "verified": true,
      "author": "michele",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Great buy!",
      "text": "I'm so glad I bought the longer length. I can sit far enough away from the TV and maneuver around. The sound is transmitted very clearly to my headphones. 2018 Update: I was so pleased with the cable I bought before that I ordered another one for my little TV to replace the cheap cable that came with my other headphones. Much improved sound now.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel S.",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Incredible aux cable",
      "text": "What a fantastic cable. Checks every box with perfection. Build quality and durability. Check. Slick looks and feel. Check. Crystal clear and clean sound. Check. Couldn't ask for more in a auxillary stereo cable. Will buy again for sure and highly recommend. Buy this.",
      "rating": 5.0,
      "verified": true,
      "author": "Devon R",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great value for 3.5 mm cord",
      "text": "Honestly I bought this as a temporary replacement for my audiotechnica headphones, since I kinda killed the cable with my chair. I honestly think that the quality of the cable for this one is far better than the one I’m replacing, and the sound quality is definitely better too.",
      "rating": 5.0,
      "verified": true,
      "author": "The Grim Panda",
      "helpful_votes": 0,
      "publication_date": 20190618
    }
  ],
  "product_meta": {
    "title": "KabelDirekt - Aux Cord, Stereo & Audio Cable 3.5mm (Unbreakable & great for iPhones, iPads, Headphones, Smartphones, Notebooks, MP3 Players, Cars & other devices with 3.5mm Aux Port) - 6 feet - black",
    "description": "Size:6 feet| Style:Regular Stereo Jack CableKabelDirekt - Aux Cord, Stereo & Audio Cable 3.5mm (Unbreakable & great for iPhones, iPads, Headphones, Smartphones, Notebooks, MP3 Players, Cars & other devices with 3.5mm Aux Port) - 6 feet - black",
    "rating": 4.6,
    "feature_bullets": [
      "UNMATCHED SIGNAL & AUDIO QUALITY - Polished gold-plated connectors ensure you get reliable, crisp sound while eliminating signal loss to hit every note",
      "USE AT HOME OR ON THE GO - Use your KabelDirekt aux to aux cable with any 3.5mm aux port. The flexible cable makes it easy to connect your car stereo, smartphone, Hifi system, laptop, iPod, iPhone, iPad, and all other audio-playing devices",
      "WITHSTANDS CONSTANT USE - The full-metal connector provides a reliable fit, no matter how many times it’s inserted or removed. We’ve also put your cable through rigorous quality-control checks to ensure long-lasting durability and audio quality",
      "LONG LASTING QUALITY SOUND - A double shielded connection means you get crystal clear sound without interruption. The 24K gold-plated, corrosion-resistant connections ensure it stays this way for years",
      "36 MONTHS MANUFACTURER WARRANTY"
    ],
    "specifications": {
      "Product Dimensions": "5.1 x 0.4 x 4.4 inches",
      "Item Weight": "1.6 ounces",
      "Manufacturer": "KabelDirekt",
      "ASIN": "B00DI8A05Q",
      "Item model number": "278",
      "Customer Reviews": "4.6 out of 5 stars2,837 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#103 in Stereo 1/4-inch & 1/8-inch Jack Cables",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 18, 2013"
    },
    "categories": [
      "Accessories & Supplies",
      "Audio & Video Accessories",
      "Audio Cables",
      "Electronics",
      "Stereo Jack Cables",
      "Cables & Interconnects"
    ],
    "price": 8.99
  }
}