{
  "website_summaries": [
    {
      "verdict": "An economic way to wash your car without using water or spending a lot of money.",
      "pros": [
        "The bottle of liquid makes it easy to apply the wash to large surface areas in a short amount of time",
        "The liquid is easy to wipe off with a cloth or dedicated scrubber"
      ],
      "cons": [
        "The cleaning formula does not handle encrusted messes and baked-on dirt as well as light dust"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Your only choice",
      "text": "As a professional detailer, I've been using Optimum No Rinse for a couple years now. This stuff is amazing. Easy to use, dilute it down for whatever your needs are, clay bar lube, wash, quick detailer... I use 1 oz in two gallons of water with a couple microfiber towels soaking in it and a 64 oz spray bottle with 2 oz of Optimum in that. Working one panel at a time, spray, wipe with soaked microfiber and dry with microfiber drying towel, scratch free wash every time. I can't think of anything in my 20 years in the industry that comes close.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel Z",
      "helpful_votes": 121,
      "publication_date": 20170326
    },
    {
      "title": "Now I have swirl marks all over my car",
      "text": "Maybe I’m not doing something correctly, but I used this product with the “two bucket method” seen on YouTube and several chamois. So my new car has lots of swirl marks now. Very disappointed. Probably would have been better off just using the automatic car wash. The swirls are really noticeable when the light hits my car the right way. Will probably go to a pro detailer to undo the damage.",
      "rating": 1.0,
      "verified": true,
      "author": "HD Evaluator",
      "helpful_votes": 8,
      "publication_date": 20190309
    },
    {
      "title": "Ive used this every day since ive purchased yet ive only done 1 waterless wash",
      "text": "buy this and stop buying quick detailer clay lube interior detailer window cleaner emphasis on window cleaner. This product cleans windows incredibly well and saves you an incredible amount of money as window cleaners are expensive. use two microfibers. first for initial wipe, or cut, second to clean up residue, or polish. If you dilute to strongly, youll end up with streaks on paint. Just make sure you do your research and dilute it properly for the job. This product has saved me a ridiculous amount of money.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Goodwin",
      "helpful_votes": 3,
      "publication_date": 20181002
    },
    {
      "title": "Perfect For Water Restriction Areas and Ceramic Coatings",
      "text": "We live near SF where the storm drains go to the Bay, so no soap suds down the driveway allowed! And no hosing a lot when there's a drought making runoff either. Someone suggested this as the solution --- yup! Easy to use, works great. Wash a panel with microfiber in this solution, then wipe it dry with another microfiber. No lather, no rinse, but definitely repeat. Car comes out great! Also, I got a ceramic coating on the car to make washing easier, and this was recommended as the go-to cleaner. Works great on the ceramic.",
      "rating": 5.0,
      "verified": true,
      "author": "M. JohnsonTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "works on every surface, love it!",
      "text": "This works on literally every surface in my car. I spray it down, wipe it off, and move on with life. So easy! There are different dilution rates for washing exterior and detailing interior so I made 2 spray bottled that have different color nozzles to tell them apart, but really you can tell by looking closely. This will also last forever, as I have had it for months and only made one batch using about 1/6 of the bottle or less. The original order cam with it leaking inside the plastic, but they immediately sent out a replacement when I brought it to their attention.",
      "rating": 5.0,
      "verified": true,
      "author": "Tess",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Game changer - now you can wash your car in your garage in any weather.",
      "text": "This was recommended by the shop that did Ceramic Pro for my car. Works great on regular cars too. What I normally do is use 5 clean wash mitts (chemical guys) and do one section of the car at a time. I never put a dirty mitt back in the bucket, I always start with a clean one each time. It's a small investment to never risk scratching your car. I have a fairly large car - Tesla S - and I can do the whole thing in 10 minutes. Since you don't have to rinse, you can wash your car in your garage regardless of the weather outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Graham",
      "helpful_votes": 5,
      "publication_date": 20180630
    },
    {
      "title": "fantastic for washing car in garage in MN winters",
      "text": "living in Minneapolis, a driveway car wash only can be done roughly 6 months out of the year. I have honda pilot and try to avoid the machiene car washes to avoid swirl marks. I bought this bottle so I can wash my car in my garage in the witner months and avoid the 8-10 car washes. excellent value if you ask me. For 32 OZ i figure I can easily get 20 plus washes out of one bottle. thats a big savings. then also consdier using this as a clay lube, that saves you 10 bucks a bottle right there. next time I buy this product I will probably buy a gallon of it. it works that awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "davem4420",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Mine did not come with lids and spilled all over.",
      "text": "These did not come with lids and cause a massive spill in the car. It was my first time buying this product and I was waiting the weather to clear up. With much thought, since caps on products are expected, I've loaded the product in a box with other cleaning products and drove to a self wash station. When I got the the car wash, there was a puncture in the thin plastic/aluminum cover and the product had spilled all over the car. After some google it seems like this is a common problem: shipping without an lid.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Yeo",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Cuts wash time, looks great",
      "text": "I've completely ditched the hose for pre-wash and rinse to get my car clean. And that not only saves water, but also reduces the time needed to get the job finished. I soak about a dozen plush microfiber towels in about 1.5 gallons of water with this solution. From roof to running boards I wipe down the car, even in winter (in my garage) this rinse-less wash makes quick work of a salt-sprayed vehicle. A waffled-towel dries the surface and I'm done. I can make 32 ounces last for about 10-12 months washing once every two weeks (once-a-week with winter snow).",
      "rating": 5.0,
      "verified": true,
      "author": "NoYouCan",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "Good product for the demanding car enthusiast",
      "text": "It's winter in the northeast and my outside water supply has been shut off for the season. I'm picky about my car care and maintain my vehicle myself. I don't like going to automatic car washes because of the scratches and swirls it creates, which are highly noticeable on my black SUV. We had a mild day and I filled two buckets, one with Optimum No Rinse Wash & Shine as directed, and one with water for rinsing the sponge after using the Optimum on each panel. I'm satisfied with the results of this product. Used as directed, it's an easy to use product that does the job quite well.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Miller",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "This Stuff Slaps!",
      "text": "Wow! Got finished washing my truck and decided that I had a bit of energy left but had already put away the hose. Filled up a gallon of warm water and 1oz of No Rinse. Used a microfiber towel to wash and another to dry. This is just a phenomenal product. Clean smell. I will use it when my Audi is dusty, but not sure about using it when there is lots of dirt. May try on the truck after some 4WD activity and post after washing. I believe this is well worth the $$ as it dilutes 1/64.",
      "rating": 5.0,
      "verified": true,
      "author": "OYGVALT",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "BEST stuff EVER",
      "text": "I can't believe I waited so long to try this product. It is amazing and has so many uses. I use it for rinse-less wash, clay lube, and quick detailer so far. It smells wonderful, is highly concentrated so it's a good value as it will last a long time, it leaves a clean & clear streak free shine and only uses one bucket of water. Super impressed. Only caveat would be if you have a heavily soiled vehicle, you would likely want to do a more traditional wash but Optimum would 100% be what I finished a traditional wash with. I can't recommend enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris G.",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Best car wash I have ever used!",
      "text": "So far I'm liking No Rinse a lot. I like how it incapsulates the dirt and it just sinks to the bottom of the bucket. I like washing my car in the garage since it's 90 degrees her in San Diego. I cleaned the inside also with a spray bottle with the car wash I mixed and worked great. Still took me 2 and a half hours to wash my car ( which is black) and I'm a bit OCD about any water drips left behind so I use an air compressor to blow all the water out of all the cracks. Anyway really like optimum's No Rinse so give a shot and a gallon will last you FOREVER!",
      "rating": 5.0,
      "verified": true,
      "author": "Alexis",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "This product is absolutely amazing and environment friendly.",
      "text": "It's hard to imagine more emphasis isn't being placed on how environmentally friendly this product is. Not only does it work extremely well, a single bottle could potentially save thousands of gallons of water. This isn't just a niche product that's only useful in a pinch, it's a product that can be used every single time you wash your car. I will never go back to traditional soap. It also has benefits for washing parts of the car you would normally not be able to properly clean/rinse (door jambs, hatch trim, engine compartments, rockers, interior). Great stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Blum",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Perfect for quick detailing",
      "text": "This stuff works great for quick detailing. I keep a spray bottle of this stuff diluted with water in my car for dealing with bird droppings, etc when I can't give my car a full formal wash and it amazes me how well it cleans. I used it for cleaning winter salt off my car when it became too cold to use the hose and it does the job just fine. A bit too expensive for cleaning my entire car regularly, but it is definitely an important addition to any car detailer's basic supplies.",
      "rating": 5.0,
      "verified": true,
      "author": "N",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Great waterless wash however I have used better",
      "text": "I am giving this 4 stars based on other waterless wash products i have used. I have been using waterless wash for about a year and can say I have used nearly all waterless wash products. Tar and bug grime does not remove as easily compared to similar products. However it does produce a nice and clean shine once it's all said and done. I rank this as #3 or #4 in comparison to other waterless wash products I've used.",
      "rating": 4.0,
      "verified": true,
      "author": "DonJuan",
      "helpful_votes": 3,
      "publication_date": 20170730
    },
    {
      "title": "Amazing. Literally thins the water",
      "text": "Amazing. Literally thins the water. Dirt falls to the bottom of the bucket. Excellent lubrication. A must have to my detail arsenal. I had to by another bottle just to keep in reserve. I use it in conjunction with Meguiars NXT car shampoo for much extra slip on my wash mitt and just more cleaning power on a dirty car after rains etc. But even then this product makes it a pleasure to dry the car as the water is so thin the towel doesn’t even get wet!",
      "rating": 4.0,
      "verified": true,
      "author": "Mohamed",
      "helpful_votes": 0,
      "publication_date": 20180523
    },
    {
      "title": "Slippery when wet.",
      "text": "Not seeing the hype in this product over a traditional wash and my current methods. Still trying it out, but might try a half ounce more in my wash bucket. Product does make water significantly slicker as I've almost slipped on asphalt where this has landed. But when paired with the big red sponge it has causes marring.",
      "rating": 3.0,
      "verified": true,
      "author": "JoshJoshua",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Classic ONR",
      "text": "Have been using ONR for 10 years or so, pretty much since it came out as one of the first rinseless washes. Back then, I was a skeptic but quickly converted. It really works and there’s no swirling (make sure you watch videos to learn how to use it though). I see there’s a green ONR now but this classic blue stuff is exactly as I remembered. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Kennedy",
      "helpful_votes": 0,
      "publication_date": 20190207
    },
    {
      "title": "Best of the best",
      "text": "If I could give it 10 stars I would. Simple to use fast easy use less than 1 gallon of water to perfectly detail your car. Secret is making sure you fold a micro fiber towel into four sections which gives you 8 sections to clean with. Only due one section at a time and dry using two micro fiber towels. Zero streaks or smears. I use a one bucket method. See YouTube videos. Most people think it won't clean because no suds. Just Trust this stuff. If extremely dirty wash don't dry twice then dry.",
      "rating": 5.0,
      "verified": true,
      "author": "B Butler",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great product, I've order 3 bottles over the past year and a half.",
      "text": "I love this product. I purchased 2 Tesla Model 3 vehicles, for me in 2018, for my wife in 2019. I know that I will have these vehicles for the next 10 - 15 years, so I refuse to let anyone wash my car but me. This product was recommended to me for clean, safe, no rinse job. I put to small cap fulls in a about 2.5 gallons of water and wash my Teslas with it. The result is a shining, no scratches, beautifully clean car. LOVE IT. WON'T BUY ANYTHING ELSE, EVER!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "DeVonM",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Used for car interiors commerically auto sales",
      "text": "I haven't really used it on the outside but I use it on interiors. I'm in auto sales so I clean the cars I sell plus my own cars. When im cleaning a door panel or dash with some hard cleaner to cut thru dirt and grime esp since sometimes its couple years of build up I mix this in water and grab a sponge or microfiber and wipe it down picks up the dirt and cleaner and gives a nice shine. Will buy more in the future good product",
      "rating": 5.0,
      "verified": true,
      "author": "DON KARLO",
      "helpful_votes": 0,
      "publication_date": 20180606
    },
    {
      "title": "Amazing value. Amazing product!",
      "text": "My main wash hose bit the dust and tore apart. Instead of spending the money on a new one and with winter right around the corner, I figured I'd give a no rinse solution a shot. Just a capful in a gallon of water is enough to do two of my vehicles. Very little issues with left behind streaking or residues. Seems to pull the dirt right off the paint! Doesn't do super well on bug guys in my few attempts with it, but that's not really it's place I guess. Overall it does great! Wheels, tires, glass, paint. Everything is super slick and clean after drying. Good stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Nate Lyden",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Distilled water is key. If you have a particullarly dirty car, a grit guard.",
      "text": "Although this product is advertised as being able to suspend dirt particles in its solution and have them drop to the bottom of the bucket, I still feel safer using a grit guard, especially since I used only 1 gallon of water to wash my car. If I can get physical separation between my wash mitt and contaminants, it makes this product that much more effective. Also, using a grit guard in a 5 gallon bucket with only 1 gallon of water doesn't quite make the water level high enough. I think a smaller bucket would serve well.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Calpito",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Awesome.  Makes way more than a gallon.",
      "text": "Luuuv it. I have a 2016 BMW M3 that has paint protection film over most of the surface, and I needed something that won't harm that material, or cause it to fade or degrade. This has worked perfectly so far, and a gallon makes many gallons if you mix it according to their instructions. I probably do closer to a 3:1 water/product ratio, whereas the bottle recommends like an ounce per gallon or something ridiculous like that. This stuff would last forever if I used their dilution ratio.",
      "rating": 5.0,
      "verified": true,
      "author": "That Guy",
      "helpful_votes": 4,
      "publication_date": 20160606
    },
    {
      "title": "Optimum (NR2010Q) No Rinse Wash & Shine",
      "text": "I bought this product to wash my 5th wheel, but decided to use it on my truck first before tackling such a big job. This stuff is amazing I washed my Ford Ranger and a small Versa using only 2 gallons of water and several microfiber cloths in a little over a hour. The shine was amazing and it gave new life to the 9 year Versa. I definitely recommend it to anyone that likes a clean shiny vehicle but hates the hard work. Now, to tackle the 5th wheel.",
      "rating": 5.0,
      "verified": true,
      "author": "Abigdogmom",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "This is Amazing!",
      "text": "I was reluctant on using this non conventional car washing liquid. It has no suds and that was interesting. It has an aroma that is pleasant. Whipping it on your car was not an option for me. I prerinsed the car and let it do it’s job by emulsifying the unbonded dirt, then whipped it off gently with clean presoaked plush microfiber towels and amazingly it worked perfectly. I’m convinced.. this won’t stop my conventional car washing completely but I’ll do it less often. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "SCABHUNTER",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Quick shine finish",
      "text": "Ok, so I was not a maniac in the past when it came to cleaning my car and spent a lot of $$$ on washes and detailing. When my husband said he would clean the car, I initially thought oh no all day long... To my surprise he was finished fast. The car looked like it was new and as clean as glass. That’s how I like to clean a car fast but yet have it spotless. No heavy wax on, wax off. And easy quick results. Absolutely fabulous! My new go to quick shine finish!",
      "rating": 4.0,
      "verified": true,
      "author": "Margo",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Great Product",
      "text": "Love this. Makes washing the car so easy. Start to finish in 30 min vs close to an hour with the pressure washer and teh best part is that it saves water! Have not seen any indications of it leaving swirls marks/scratches although I do not use this when the car is extremely dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "T. I",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Great as a detail spray.",
      "text": "I have yet to use it as a pure no rinse wash, but as a detail spray its great! Lots of \"bang\" for your buck. The smell is great in my opinion. Its not harsh like most cleaners. I don't know if its listed but it seems to work well for cleaning just about anything too. The detail spray works great at cleaning windows. not sure if its \"tint\" safe, I did use it on a tinted window without issues. Will buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam D.",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Good stuff, kind of lifts dirt",
      "text": "Use this without a bucket, I use a common yard/deck sprayer. If the car is really dirty I do a quick hose, drive it around the block since water here is hard. I use the sprayer, two gallons distilled water and three cap full of Optimum, first on areas that get the most dirty, behind the wheels trunk etc... Then spray top to bottom till it runs then spray a microfiber towell, hit the dirty parts last. Quick wipe, then a dry towel for the glass. My cars park outside and this works fine... Under all of this is Klasse AIO.",
      "rating": 4.0,
      "verified": true,
      "author": "moeman",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "This stuff is amazing!",
      "text": "Wow! I was never one to wash my own car but now that I got a nicer one, I am cautious of parking any anything touching my paint. Touchless washes were not doing it so I bought some nice TRC microfiber clothes (a 10 pack of creatures and a pack of pluffle drying towels). Totally worth it, my car wash only took an hour with me taking breaks to admire my work. It is an amazing mirror finish and no worry about scratches. What I love most is how little water it uses, totally worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anamika ",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Best Cleaner I've Ever Used",
      "text": "I've been using ONR for years and couldn't be more happy. I use it to clean every surface but glass. It's very efficient on the exterior and your car will never be cleaner. Using it takes a little more time but you touch the surface of your car around 4 times (apply twice wet, wipe twice to dry). If you take pride in the cleanliness of your ride, skip the brush washes at the local car wash and use this product. Oh, make sure you have quality microfiber clothes.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Jones",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "The World of Rinseless Washing",
      "text": "I started using ONR on the recommendation of a friend who is a detailer. For a couple of years now, I have used it so give our cars rinseless washes. I am very impressed with how It lift the dirt off the car. I have tried the spray bottle method, but now I go with two buckets, and I have a good supply of soft microfiber towels. After all this time of using it, my cars have zero swirls in the paint.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey Mazzoni",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Saves on water!",
      "text": "Mechanism seems questionable but it seems to work. I've used it on our old vehicles but might use it on the Tesla Model 3 when it arrives. I put some in a spray bottle and pre-spray the surface first before even applying it with a sponge. I can see pollen suspended on the droplets (car has been protected by DUI ceramic coating) so it seems to work. I've not compared it to just plain water but I don't I'll try that. I'll keep using ONR.",
      "rating": 5.0,
      "verified": true,
      "author": "Island Capture",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "Helps us keep our Tesla super-clean, with minimal water and less effort",
      "text": "One cap-full of ONR in to a quart-sized squirt bottle, a pile of microfiber squares (12\"x12\") and a Big microfiber drying cloth is all of the equipment I need to keep our 2015 model S looking new. The whole process takes about 20 minutes. We have to keep our car outside, but between this and 2x per year RegeX treatment, the car beads water just like it did when brand new. I'm impressed.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan McNamee",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Fantastic",
      "text": "If you are going to start using this product, do yourself a favor and get a gallon pump. Get a 5-gallon bucket, mark with a sharpie for your water line, and just add water and two pumps of ONR. You definitely want to use a high quality microfiber towel with enough nap to lift the dust and dirt into the towel and off of the vehicle. (I use The Rag Company Eagle Edgeless 500). I also highly recommended a grit guard for your bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "Pegasus",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "I'm now a believer",
      "text": "After reading many detailed reviews and watching videos of ONR in use, I decided to take the plunge. All I can say is I'm truly in awe of this product. There is real science at work here and it never ceases to amaze me. If my cars are truly caked in dirt and grime I'll probably still use Optimum Car Wash with the tried-and-true two bucket method, but for \"regular\" washes and touch ups I'll always turn to ONR. I also got my father a rinsless wash setup (with No Rinse Wash and Wax) and he's equally astounded at the performance and results.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Wilson",
      "helpful_votes": 0,
      "publication_date": 20180506
    },
    {
      "title": "It works!",
      "text": "This product is a miracle. A rinse-less car wash product that cleans light to moderate dirt, and doesn't streak? Yes! It works! Follow the directions, and get some tips from YouTube, and this awesome product will change your car washing life forever. Buy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Treg G.",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Amazing, so many applications.",
      "text": "Where have I been the last few years??? Professional detailer who was skeptical when I heard about these products. Well, I'm sold. If used properly this is a fantastic product. You can use in a spray bottle as a detailer or use the traditional bucket method. I've used the big red sponge and then just a normal chenille \"noodle\" wash mitt. I've not noticed much of a difference in the 2 applicators. It also smells great and I've had nothing but great experiences with this stuff. Thank you Optimum!",
      "rating": 5.0,
      "verified": true,
      "author": "Corbinwaterski",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Good rinseless wash, better clay lubricant",
      "text": "One of the better rinseless washes and clay lube with appropriate dilutions. I use it in my mobile detailing when I don't have free flowing water. With one bucket and the multi-mitt method, it works very well for washing vehicles. And it's lack of sealants, carnuba, SiO2, and gloss-enhancers, it's a very good clay lubricant as well. A little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "Timothy S.",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "This product is superb!",
      "text": "This product is easy to use and does the job. Just be sure to use a good quality microfiber sponge and towels. If your car is really dirty its not the best thing to use because your water mix will get dirty quick as well as your sponge. It's more for maintenance washes. After I finish a wash I mix up a fresh small bucket of ONR solution and use a fresh towel to wipe down the interior.",
      "rating": 5.0,
      "verified": true,
      "author": "N Drobnack",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "Fantastic results",
      "text": "Washing a car this way goes against everything I've done in my 56 years but the result proves the product is effective. I keep my cars very clean (currently own a Tesla Model 3) so there was no build-up of dirt and grime. Granted it's summer in New England and the easiest time of year for washing cars so I'm anxious to see if I can wash the car in the garage this winter with similar results.",
      "rating": 5.0,
      "verified": true,
      "author": "Gainsborough",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Excellent product",
      "text": "I use this to wash my Tesla. It works amazingly. With one bucket of water, I am able to clean my car with very little effort. It usually takes me 15-20 minutes to wash my car. I used to hate washing cars b/c the time and effort. With this, I wash my car every other week. It does leave some water spots after cleaning. But overall it is not that noticeable, I am very happy.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Zhao",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Good for conserving water when washing your car.",
      "text": "This saves me a lot in terms of water and money, just be sure you're not type of person who is lazy to clean your car. Actually, what I do I rinse my car if its really dirty because I don't want having it scratch if the dirt is really hard on the surface, rinsing it with water at least it will soften the dirt attach to it. Then, I use a handheld sprayer with a solution of 1:1 part of this item and water, use two microfiber one using it wet with the solution I mixed up and the other one is for wiping it off or drying, works for me fine.",
      "rating": 5.0,
      "verified": true,
      "author": "mfpr5679",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Works as advertised",
      "text": "Works exactly like you would expect it to. One word of caution, definitely take their eye irritation warning seriously, I forgot to wash my hands after washing the car and went to rub my eye some hours later and felt a burning sensation like you wouldn’t believe. I don’t blame the product, they definitely warn you on the bottle!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Downs",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "It really works!",
      "text": "Great product. I was leery about this, but gave it a try anyway. I bought a bunch of microfiber cloths to use with this. It is really amazing how nice my car looks after cleaning it with this product. Just mix in a bucket and wipe on your car with wrung out cloth. Then use a second dry cloth to wipe clean. I do one section at a time, regularly switching to new cloths. I also have a second bucket of clean water to drop the used cloths into to rinse before putting them in the washing machine after I'm done.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Lorenz",
      "helpful_votes": 0,
      "publication_date": 20160518
    },
    {
      "title": "ONR is a convenient waterless wash.",
      "text": "There are a few ways to go about using this product aside from the standard instructions. I fill a pump spray up with water and an ounce of the Optimum No Rinse (it's a large on that I got from a home improvement store, the one with a wand sprayer). I pre-soak a few panels that are heavily soiled or dusty, then take my sponge or micro-fiber towel and wipe over it. Then I wipe down with a dry micro-fiber towel and/or follow up with some detail spray and the results are amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Encinitas",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "Awesome product",
      "text": "Great product. Used it 3 times already this winter and honestly blown away at how easy and good the results have been. May use this in the summer too just because it will take less time not dealing with all the hose set up and easier clean up. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Xhua",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Never rinse again, use this!",
      "text": "I can wash & wax my entire truck, 2015 F150 Supercrew in under 10 min. Start to finish! This stuff smells amazing, the taste...not so amazing. ok, so I don't actually taste it, most of the time. I follow the directions to a T! 1oz of ONR into 2 gal of water. 1. use a microfiber mitt 2. Dip into ONR/water solution 3. Wipe down area/side of vehicle 4. Spray with 5. Wipe with microfiber towel. DONE! No scratches, and if you JUST use this alone it provides an amazing shine! Everybody compliments my truck.",
      "rating": 5.0,
      "verified": true,
      "author": "Spooby",
      "helpful_votes": 2,
      "publication_date": 20160805
    },
    {
      "title": "Amazing stuff!!! Smells great too!",
      "text": "I'm glad I finally found out about this stuff. Life changing when it comes to car detailing. So far I have only used it as a detailing/clay lube spray and it works great. No streaks when drying. There are many videos on how to use this as a total rinse less wash with multiple microfiber towels. I will eventually try this due me liking the idea of saving water if my cars are not that dirty.",
      "rating": 5.0,
      "verified": true,
      "author": "David Little",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "I gave into the hype...",
      "text": "Honestly after a few washes with this, I wasn't too happy with it. Didn't seem to wash too well, even for basic maintenance washes. Felt like I was washing my car with plain water, really didn't like the lack of lubrication. If you live in an apartment complex yada yada this might be good, but I'll stick my usual stuff.",
      "rating": 2.0,
      "verified": true,
      "author": "GlutenFreeInternet",
      "helpful_votes": 0,
      "publication_date": 20180328
    },
    {
      "title": "great product",
      "text": "so when I originally received the product it came without a cap on it and was at risk of opening and spilling everywhere. The seller contacted me (after I left a not so nice review) and assured me they would send a cap to the bottle...good service. The product itself is awesome! I have to say I was a bit skeptical about it getting the car clean (1 ounce in 2 gallons of water), but it works great! so much easier to wash a car this way. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Abel",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Convenient & Economical Cleaning Power",
      "text": "This stuff is good and protects the paint as well. I use it to wash and detail car and so far it’s held up even to salt. Excellent product overall expect for the buffing off which can sometimes be a hassle but from my experience every waterless/rinseless wash does the same thing except this one is the cheapest one since you could make 64 gallons of washing solution with this bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex V",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Great product for a quick wash!",
      "text": "I have been using this product for years and love it! Simple, quick, and safe for a simple wash. I use it all the time if the car isn't \"very\" dirty. If the car is trashed, I do the full wash routine, but for most of the time, this is more than sufficient. Read the directions and go to town.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Fritz",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Converted me to a rinseless washer.",
      "text": "This stuff is seriously magical. For me I used about 3 oz of this solution for a gallon and realized it's still too much because I only used 1/2 gallon of water for my car. I have 2 spray bottles loaded with this whenever I need to do a wash but it works insanely well. I personally used the Gary Dean method to wash my car (soak microfiber towels, use a presoak solution as well) and it left fantastic results. For bug removal however, try using either a presoak or tar remover before using this. From my experience, ONR was not the best at that but fantastic for everything else.",
      "rating": 5.0,
      "verified": true,
      "author": "Raaz P.",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Works great if your car isn't too dirty",
      "text": "This works great as an \"in between\" washes product. If your car is just dusty since the last proper wash then this works fine. This doesn't do wheels and tires and if you have an SUV like me, the roof is pretty much out of the question. If you have bugs and actual road grime on your car this wont do the trick.",
      "rating": 3.0,
      "verified": true,
      "author": "Brian McClanahan",
      "helpful_votes": 4,
      "publication_date": 20160901
    },
    {
      "title": "Very universal must have product!",
      "text": "I detail for a living this stuff is an amazing product. Has more uses than on the bottle. Great for the environment and in places where water is restricted. The company has and will answer any questions you may have. You may even get to talk to the owner and creator of the product Dr.G he cares deeply about his customers and products that he creates. YouTube is a great resource for any and all uses for this product. I recommend this product to everyone from someone who just wants to wash their car on the weekend to the most skilled professional detailers!",
      "rating": 5.0,
      "verified": true,
      "author": "Preston",
      "helpful_votes": 3,
      "publication_date": 20170119
    },
    {
      "title": "Saves water and cleans brilliantly",
      "text": "I used this for the first time today and needed to wash my car inside my garage. I was worried I would get water everywhere but it is amazing how well it cleans and there is absolutely no mess at all. My suggestion is to make sure you have plenty of microfiber towels for both washing and drying. We recently had about 18\" of snow and I had dirt all over the bottom half of my car. With changing clothes about 4 times I cleaned my entire car. It looks amazing. It's works best to do it a small section at a time. I did the wheels last. I'll never go back to using a hose again!",
      "rating": 5.0,
      "verified": true,
      "author": "Patti",
      "helpful_votes": 0,
      "publication_date": 20191104
    },
    {
      "title": "Absolutely Amazing!",
      "text": "Amazing product! Perfect for apartments or those that don’t have access to outside water sources. I use the 2 bucket method for washing my Tesla and was shocked on how shiny clean it makes it without having to rinse or use any additional products. I dry with a plush microfiber so I’m not sure how it dries on its own. It easily takes off dirt, bird poo, & dead bugs with minimal effort using a microfiber towel. I now keep a premixed amount in a spray bottle to quickly spot clean areas and pretreat harder messes such as tree sap. Will never again have to pay for a wash now that I have this product! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Great stuff for a quick and quality wash",
      "text": "After buying a new car, I wanted to keep my car clean by hand as long as I can before I eventually subject it to an automatic car wash. This makes the cleaning process quick and painless. Big bucket of hot water with a few capfuls of this stuff with a big foofy wash mitt, a few microfiber towels, and you're done in 30 minutes or less. No rinse is so nice. Saves time and water.",
      "rating": 5.0,
      "verified": true,
      "author": "MTBDET",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "you will receive a plain bottle",
      "text": "I received the bottle completely plain. There is no label in regards for instructions or anything else. Wack.",
      "rating": 1.0,
      "verified": true,
      "author": "GALAN",
      "helpful_votes": 4,
      "publication_date": 20190608
    },
    {
      "title": "I can wash two cars with 1/2 gallon of water!",
      "text": "Here in Southern CA there is still a major drought, so washing your car is a no-no. But with the proper technique I can wash both of our cars with about 2 quarts of water. Start with ato remove surface dirt. (Don't worry, it doesn't scratch!) Then I use- the small one to wash about one quarter-panel or half the roof at a time, the larger one to dry it. The process leaves even our black car looking fantastic, and doesn't take any longer than a normal driveway car wash (and actually quite a bit less time than driving to a commercial car wash - which uses way more water!)",
      "rating": 5.0,
      "verified": true,
      "author": "Slickdog",
      "helpful_votes": 0,
      "publication_date": 20160703
    },
    {
      "title": "Delivered with no bottle top?!",
      "text": "I haven't gotten to use the product yet, so I can't review the quality of the product. But, I did receive the bottle of ONR with NO LID. Just the little plastic wrap on top of the bottle. I suppose now I have to find my own solution for a bottle top. It's no big deal, but like seriously? Who sends a bottle of liquid with no top?",
      "rating": 3.0,
      "verified": true,
      "author": "Duane",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Easy2 Use 1 Step Formula: Pro",
      "text": "I'm for saving the environment as well as not oversoaking my car once/week with a hose (cars really don't like water, they rust in places U don't see). This formula worked better & easier than expected, leaving a brilliant shine! If you're particular like me, U can follow up with a quality spray Detailer. Looks like ya just had your car done by a Pro!",
      "rating": 5.0,
      "verified": true,
      "author": "Bru-sky",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Exactly what I needed for my Tesla",
      "text": "Alot of tesla owners recommended this product and I can see why. It is very useful for 2 bucket wash, pre wash and normal wash. cleans the car good without much effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Faizan Mazhar",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Leaves Water Spots",
      "text": "This product does not leave the finish it promises. After several tests, the product did not produce a clean and water spot free exterior. I even used distilled water to reduce the chances of water spots. This product, along with the associated \"Big Red Sponge\" are not quality products. To its credit, the product smells amazing and is inherently easy to use. I would advise others to stick to the traditional method of washing cars and other vehicles",
      "rating": 2.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "I mean - it's great for light-to-moderately dirty cars",
      "text": "As several reviews state, this product works very well for what it is. By that, I mean - it's great for light-to-moderately dirty cars, and leaves a nice, slick shine. Fantastic for apartment living, winter washing, or anyone without a garage or access to a hose. However, there is no substitute for the occasional traditional wash, especially for very dirty cars. Sometimes you just need some water pressure to clean out wheel wells, a dirty truck bed, or very dirty tires. Optimum No Rinse is more like a very high-tech way to spot-clean the whole car. Also, this product is great for saving water - that alone is enough for me to avoid traditional washing as much as possible.",
      "rating": 5.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20150902
    },
    {
      "title": "Really cleans the car",
      "text": "I use it to wash my brand new Tesla Model 3. I was skeptical that this would work but bought it based on reviews by other Tesla owners. It is easy. I just put 2 gallons of hot water in a bucket, add two caps of the Optimum No Rinse Wash & Shine. I wet one microfiber towel and clean with that and dry with another microfiber towel. I also have a bug remover sponge to use as needed. I do not even turn on the hose. The car looks and feels great.",
      "rating": 5.0,
      "verified": true,
      "author": "watergirl",
      "helpful_votes": 0,
      "publication_date": 20181113
    },
    {
      "title": "Great product",
      "text": "Tried this wash out with the detail spray as a pre wash. After 1 week of highway driving in rain and snow with salt on the car, this wash worked great to remove all of it. This is the first rinseless wash I have tried, EcoSmart is another great product but this works better in my opinion because after washing an entire Honda Civic, there is at least another 1.5 gallons remaining in the bucket for next time. Use multiple towels and soak them in bucket before use. Put used towels away after using all sides and don't use a dirty towel on a clean car.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorenzo",
      "helpful_votes": 0,
      "publication_date": 20170310
    },
    {
      "title": "It washes my bike up beautifully.",
      "text": "I was skeptical about buying this product. How can a no rinse product really clean your car/bike? Well I was fooled. This product is awesome. Especially when I haven’t anyway to wash my bike with a hose. I use one capful to 2 gallons of water. It washes my bike up beautifully. Well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda Stark",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Depends on the color of your car",
      "text": "Like the Detailer spray, I just don't understand the raves. Does this product use very little water? Yes. Does this wipe away grime? Yes. I still need a lot of elbow grease to get rid of the small spots of road tar. And I have at least five coats of Liquid Glass on new cars. No I'm not a professional detailer, just a weekend washer. I don't think this is better than a full on hose wash. However, if you're in a water restricted area, this might be your solution. I have a white car and this product isn't as effective as when I use it on my silver car.",
      "rating": 2.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Love this product",
      "text": "I use it one once for a gallon of water and spray it on the bug splatter after a drive and with a damp, clean microfiber towel I remove the bugs. In fact, I use a sprayer* that I purchased on Amazon.com and it makes the cleaning of the bug guts a breeze. *Chapin 20000 1-Gallon Poly Lawn, Garden, And Multi-Purpose Or Home Project Sprayer Great For Fertilizers, Weed Killers, And Common Household Cleaners, 1-Gallon",
      "rating": 5.0,
      "verified": true,
      "author": "Albert",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Believe the hype",
      "text": "I bought this on a whim after an online recommendation. I expected to return it but it actually works and I’m keeping it! I looked in the garage and saw the wife’s car sitting there dusty and figured this was the perfect test. I was done in less than 20 minutes and it looks great!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Nelson",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "So glad I found this! Works great!",
      "text": "Really cleans and has NO bubbles or soapy residue. Car seems to stay clean longer as water seems to bead up. Looking forward to using all winter long and saving a bundle from going to the car wash. I bought a bunch of high quality Chemical Guys microfiber 16x16\" towels, fold in 4 and wipe down car. Do one section at a time and dry. Made one bucket of solution and just keep a lid on it. Never put a dirty rag in it and it goes a LONG way.",
      "rating": 5.0,
      "verified": true,
      "author": "APOHOPPER",
      "helpful_votes": 0,
      "publication_date": 20171127
    },
    {
      "title": "Good, great??",
      "text": "I have tried most all products to keep my black car clean and am tired of buckets and hoses so I tried this. I would give it 5 stars on any other color car but black is tough. Used many chemical brother towels vs 2 buckets and results were good but it actually is alot of work making sure you don't use dirty part of towels, drying properly. It left some slight \"clouds\" but a quick detail spray fixed..My paint was in great shape and car was not real dirty. Good but still searching for easier way which is probably pay a detaioler each week!",
      "rating": 4.0,
      "verified": true,
      "author": "MylesD",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Wash a vehicle in your garage with a bucket of water. Really works.",
      "text": "As I used this for the first time, I thought I was going to give it a 3-star rating. It just didn't seem as magical as I had hoped. But surprisingly it got more amazing as I used it and even the areas I couldn't reach with a microfiber cloth dried without spots. I really did only use less than a gallon of water in my garage to wash an entire Harley motorcycle. So I'm giving it the full 5 stars and a wholehearted recommendation. Especially if you're going to follow it up with a spray and wipe of detail spray or some kind of wax treatment, this is a winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Lovgren",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "SHINY CAR",
      "text": "Yo I used this for the first time a few days ago and my car is SO SHINY. Holy wow, and it rained today and the water just beaded up and ran off. I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "itsFleee",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "It only takes me 1. 5 gallons to wash ...",
      "text": "It only takes me 1.5 gallons of water mixed with 1.5 caps of the washing solution to wash a mid-sized sedan. And it can be done in less than 30 minutes counting set up and clean up. The one issue is that I still need to use a window cleaner (Sprayway in my case) as the car wash solution leaves streaks on glass.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Versatile Detailing Tool",
      "text": "I use this stuff in many different ways. I use it with a bucket wash, mix it with a sealant as a detailer spray, use it in a spray bottle to do quick cleaning of bug guts or bird poop. It's a very economical product too, being very dilutible. I recommend this stuff for minor cleaning jobs (light maintenance wash, small cleanup, interior/exterior) and an all around tool if you wanna save money and keep your detailing collection to be slightly smaller.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20190902
    },
    {
      "title": "Do Not Purchase",
      "text": "This is the worst product I have ever Invested in for my car. It does not work, They knowingly lure you into a subscription that you are unaware of and charge you 20.99 a month each time they send it. This is nothing but a scam, do not order this product, I have purchased hand car wipes which works much better than this product, I have called and canceled my subscription which I didn't know anything about until they started taking money out of my account, I wish I could get all of my money back.",
      "rating": 1.0,
      "verified": true,
      "author": "Terrence Burney",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Cheap quick detailer",
      "text": "Use it as a quick detailer only. My truck looks pristine when I use this while wiping down my truck after it’s been washed. It doesn’t prevent dust, dirt, waterspots none of that. But it looks nice before all the dust, dirt, etc comes. And it’s super cheap when used as a quick detailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Stella Ka’uhane ",
      "helpful_votes": 0,
      "publication_date": 20190906
    },
    {
      "title": "Excellent Product!",
      "text": "I bought this (and Opti-Seal) based on numerous YouTube videos in which professional detailers used it. The attraction to me was ease-of-use, the reduction in time washing the car, and some degree of protection on the paint that was pitched when using ONR with Opti-Seal. The pitch was no lie! It is a GREAT system!",
      "rating": 5.0,
      "verified": true,
      "author": "combatdynamics",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Quick & Easy Car Wash at Home with Minimal Water Usage",
      "text": "Read about this product in various places on internet with good reviews. It’s a time & money saver for me because it saves me driving down to nearest “quarter car wash” & spending 5 bucks or more. A few trips saved to car wash easily pays for the large bottle. Love the fact that this wash method only requires a gallon or two of water. Shines the car up nicely, but I usually follow with a detailer’s wax. Great value, great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kansas Tesla Owner",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Good product but arrived with no bottle cap",
      "text": "When I received this product, the bottle came without a cap, just the seal, so when I opened the bottle I had to pour it into another container for storage, hence the reduced rating. The product itself however is great, I bought it to use as a clay lube. You get a lot of product for the money, and I actually found that it works better than the chemical guys clay lube I had been using. If the bottle came with s cap as expected, I would give this 5 stars",
      "rating": 3.0,
      "verified": true,
      "author": "Mike ",
      "helpful_votes": 2,
      "publication_date": 20190529
    },
    {
      "title": "This is stuff is awesome! I was very skeptical but it came recommended ...",
      "text": "This is stuff is awesome! I was very skeptical but it came recommended after I had Opticoat Pro ceramic coating applied to my black GMC Denali truck. I am very paticular about my truck, I had wash it every week and normally use Griots car wash. This exceeded my expectations, It cleaned very well and left a beautiful, slick, spot free finish. I was also suprised how easy it cleaned the wheels. This cleaned and left a better shine on the truck than anything else I have ever used. I used micro fiber clothes from The Rag Company (Eagle edgeless) and they worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "TAMMY",
      "helpful_votes": 0,
      "publication_date": 20170403
    },
    {
      "title": "I like it",
      "text": "I've used this product twice and love it. I like not using a ton of water to wash our cars. It does a good job removing road grime and dirt. It does take a bit of scrubbing to remove bigger chunks or more stuck-on dirt. It also cuts down on the amount of time it takes to complete the job.",
      "rating": 5.0,
      "verified": true,
      "author": "david",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Full vehicle wash in the garage with no mess",
      "text": "This product is amazing as it allows you to wash your vehicle inside without getting water everywhere. Then on top of that it leaves your vehicle super clean and shining like you just got done detailing your car. I have tried multiple No Rinse Washes and this one is by far the best one out there on the market, I highly recommend it to anyone looking for a No Rinse Wash.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Versatile and one of the best washes!",
      "text": "If you care about your paint and value your time you need to try this. Don’t ever settle for the car wash on the way home when you have this in the garage. Can be used in the bucket or even as a quick detailing spray.",
      "rating": 5.0,
      "verified": true,
      "author": "LAmazon",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "Saves Time, You Skip the \"Get the water spots off\" step...",
      "text": "Ya... This stuff is the bomb... Friend recommended it to me in person when we were talking about our cars. I bought it, tried it, works great! I wash with it, rinse quick, and most of the water rolls off which then allows me to shammy off what's left. With this you skip the step of using a polish or detailer spray to get the dry spots off.... YOU SKIP THAT STEP!!! THIS SAVES TIME!!! I LOVE THIS!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Edster",
      "helpful_votes": 0,
      "publication_date": 20180805
    },
    {
      "title": "Love it!",
      "text": "I use this for a quick clean up of my motorcycle. It lifts the dirt off without scratching the paint or windshield. This small bottle will last me a really long time ( years ) because the dilution rate is so small. Professional detailers use it so, you know it is a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "No Complaints",
      "text": "It’s another waterless rinse and I really don’t see much difference between this product and the other ones on the market. Seems to do what it claims, I don’t use it that often, but when I do it’s good enough for light cleaning. For heavy soil vehicles, I would definitely stick with running water",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Cleans well with less water",
      "text": "Bought this as recommended by fellow Tesla owners. Does a really good job. Just add a couple capfuls into a large bucket with water, use soft cloths to wash on, then wipe off. Uses very little water in comparison to a traditional car wash. Leaves the car with a nice sheen. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "CrystallBlue",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Super easy and effective (before and after attached - car ...",
      "text": "If you haven't tried no rinse, you must! Super easy and effective (before and after attached - car wasn't *that* dirty, but enough to see). I wouldn't use it if you have a lot of grime built up otherwise you may scratch your finish but it works great for moderate dirt buildup. Make sure to use lateral wipe lotions (straight lines right/left, never circular! Otherwise you're going to mar your finish and get swirls). Fantastic value for the size as well, one oz per 2 gallons of water - I can do my whole car with 1 bucket.",
      "rating": 5.0,
      "verified": true,
      "author": "Natasha",
      "helpful_votes": 0,
      "publication_date": 20160508
    },
    {
      "title": "Keeps the dust off and less washing needed.",
      "text": "I rinse it lightly after but it still keeps much of the dirt off. I live in a dusty area and normally wash my car 3-4 times a week. I now can wash once a week and can just rinse and all the dusty comes off. Use it on my rims too and it keeps them cleaner. I have a BMW 428i and a Nissan Versa I wash with this. Stays much shinier than any other method. I was waxing monthly and have not needed to to keep the dust down with this. I will order this again and again",
      "rating": 5.0,
      "verified": true,
      "author": "AH20z",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "Only cleaner you will need",
      "text": "I add 2 caps into a pump sprayer and that gives it enough pressure to hose a section at a time. Once I spray a section, I have about a cap full in a bucket which I use my microfiber mitt to wipe it down and then dry it with a microfiber towel. Takes maybe 15 minuets. I clean the wheels last.",
      "rating": 5.0,
      "verified": true,
      "author": "TheOnlinePro",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Multifuncional",
      "text": "This product is not only effective but abundant . ONR is also multifunctional and great for detailers alike. Not only great for those who don’t have access to a water source but also can be used in as a soap a “ regular “ car wash, clay lube, Detail spray, glass cleaner, and more.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Ferreira",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Buy this.",
      "text": "I’m a believer. I’ll never go to the drive through car wash again. It took longer to clean the Rims than to wash the car. A little investment in a bucket, a pack of microfiber towels and a wash mitt is all that’s needed. Maybe $40. I actually did two cars in 15 minutes. One was filthy and no scratching and no multiple washes. Just one nice and wet application on each body panel. Wipe dry mmediately with the clean microfiber towel and that’s it. And the smell is really tolerable. If you have sap or tar you’re going to need a different product but for dirt and winter filth (salt, sand, etc) this just killed it.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Good to keep car clean but not fully clean",
      "text": "Good for a quick detail and nice to help keep car clean in cold/wet/snowly/salty New England weather. Would recommend doing a full wash 1x a week, and maintain wash with this product 1x a week. Wouldn't use on really dirty cars to prevent scratching and marring.",
      "rating": 4.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "A must have if you want to keep your vehicle clean during the winter months.",
      "text": "This product does exactly as it said. Easy to use works great. I use two cap fulls and two gallons of water and the big red sponge. I can wash my full size SUV. No spotting and leaves a nice shine. Great for keeping the winter grime off your paint.",
      "rating": 5.0,
      "verified": true,
      "author": "DD50 ",
      "helpful_votes": 0,
      "publication_date": 20200211
    }
  ],
  "product_meta": {
    "title": "Optimum (NR2010Q) No Rinse Wash & Shine - 32 oz.",
    "description": "Size:32 oz.Optimum No Rinse Wash and Shine is the most technologically advanced car cleaning system that eliminates polluting storm water runoff while safely cleaning all exterior car surfaces.",
    "rating": 4.7,
    "feature_bullets": [
      "Optimum No Rinse Wash and Shine contains exclusive blend of high lubricating polymers that bond to paint while releasing dirt and grime for a safe, brilliant finish",
      "Optimum No Rinse Wash and Shine allows car washing virtually anywhere, anytime",
      "Get a brilliant shine using only one or two gallons of water",
      "Optimum No Rinse Wash and Shine is preferred by professional car detailers and enthusiasts for faster, cleaner results",
      "Safe for any vehicle surface on cars, trucks, motorcycles, RVs, ORVs, fiberglass or wood boats and airplanes"
    ],
    "specifications": {
      "Manufacturer": "Optimum",
      "Brand": "Optimum",
      "Model": "NR2010Q",
      "Item Weight": "2.3 pounds",
      "Product Dimensions": "10.2 x 3.8 x 3.2 inches",
      "Item model number": "NR2010Q",
      "Is Discontinued By Manufacturer": "No",
      "Manufacturer Part Number": "NR2010Q",
      "Folding": "No",
      "ASIN": "B00D8DR0AO",
      "Customer Reviews": "4.7 out of 5 stars2,435 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#517 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "January 20, 2006"
    },
    "categories": [
      "Car Care",
      "Automotive Parts & Accessories",
      "Exterior Care",
      "Cleaners",
      "Automotive"
    ],
    "price": 20.99
  }
}