{
  "website_summaries": [
    {
      "verdict": "Thick cat box liner that will resist tearing from animal claws.",
      "pros": [
        "Easy to use, as it has a drawstring to close the bag when it's time for disposal",
        "Heavy-duty liner material that's 2 millimeters thick to keep the litter inside the bag",
        "Large size of liner at 36 by 18 inches, so it'll fit multi-cat litter boxes"
      ],
      "cons": [
        "Doesn't work as well on small sized litter boxes"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best Cat Liners",
      "text": "If you use/need cat litter box liners for a large/jumbo sized litter box, get these. They are the right size for the larger/jumbo litter boxes and they are the strongest liners that I think you can find. If you have a regular size litter box, these will be very big, really too big. I haven't found any beter liners and one of my cats has knives for claws. He still sometimes can make holes in these liners, but it's not bad and like I said he has crazy claws",
      "rating": 5.0,
      "verified": true,
      "author": "JRA",
      "helpful_votes": 5,
      "publication_date": 20190606
    },
    {
      "title": "Chore completed in under 3 minutes",
      "text": "We’ve tried a dozen or more cat box liners. Either they were too thin and the cats claws ripped the liners, or they didn’t quite fit the larger boxes, or the draw string was flimsy. These are high quality thick plastic liners that really resist tearing. We are a 3 cat household and use roughly 3 inches of generic clay litter changing every 3 days. These have never failed. Not litter escapes. Just use the wide red drawstring to close and lift. No mess!! Set aside and replace; dispose of used litter with no spills and you are done in under 3 minutes",
      "rating": 5.0,
      "verified": true,
      "author": "ChiefLaughALot",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Size has changed",
      "text": "I have used this. Read and size for years. However the box that came most recently, the bags were smaller and did. It fit our jumbo liter boxes like they have in the past. Very disappointed. They need to go back to their previous fit.",
      "rating": 4.0,
      "verified": true,
      "author": "Lin H. Fryman",
      "helpful_votes": 3,
      "publication_date": 20190530
    },
    {
      "title": "Recommended by a friend",
      "text": "Did not like using them at all. Had to tie them on the litter box to keep them in place & always readjust them. Bag ripped with scooping. Gave them to my friend!",
      "rating": 3.0,
      "verified": true,
      "author": "Rosebud",
      "helpful_votes": 3,
      "publication_date": 20190623
    },
    {
      "title": "I just love Johnny Cat Litter Box Liners",
      "text": "I just love Johnny Cat Litter Box Liners. I use the Booda Cat Boxes that are dome shaped with the lid. These are strong bags and they are the only ones I can find that fit properly in the box. I poop scoop during the week and once a week I just take the whole bag out. It's nice and clean that way. You can use the cheaper cat litter instead Of the exspensive clumping kind. My 2 cats love it. I have 3 boxes for 2 cats.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Fuller",
      "helpful_votes": 3,
      "publication_date": 20171103
    },
    {
      "title": "The ONLY bags I’ll use in my litter box!",
      "text": "These bags are great! They may be a little pricey but nothing beats being able to pickup the bag without spilling cat **** everywhere. I’ve tried many different brands and these are the only ones that my cats can’t tear through. I have a high sided litter box and these bags hold quite a lot of litter! I would definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Renee",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "thickest bags I've seen",
      "text": "Love these jumbo sized bags. I have two cats sharing the litter box and sometimes they liked to dig at the bag. these are the thickest I've found in 30+ years . I don't get any leakage/steeping of urine through the bottom of the bag which is a relief when you're changing litter. I don't have the best shoulders for heavy litter , but this morning I lifted the bag out and the strap was long enough that I just put it over my shoulder like a purse and walked it outside--no breakage!.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol O.",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Very sturdy",
      "text": "I was a little worried about buying plastic litter box liners because one of our cats loves to dig. He destroyed earlier attempts at using liners. But these liners are VERY THICK. We haven't had any rips, tears, or holes. We have three completely different litter boxes. One is sort of a triangle shape. These liners cover all of them well. One thing is that it would be nice if there were more liners per box instead of having to buy four at a time.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "I like them.  Will continue to use.",
      "text": "I have a jumbo kitty litter box for my two pre-madonnas. So I use these jumbo liners that many recommended. They last about a week and a half without rips. Generally durable and easy enough to cinch up and throw out. Because my cats like to rip into it, I end up having to put the used bag in a trash bag when I'm changing it. Overall, I would definitely recommend these bags.",
      "rating": 4.0,
      "verified": true,
      "author": "Haley P.",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great Prodict",
      "text": "These liners are the best I’ve found to resist cat claws. They last much longer than other brands making disposal lots easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Maxine B. Jones",
      "helpful_votes": 2,
      "publication_date": 20190531
    },
    {
      "title": "Sturdy, good quality litter bags!",
      "text": "I'm using these liners in the Litter Robot Open Air; they are a bit bigger than the tray -- but since the Litter Robot stops cycling when it senses that the tray is full, the size is not an issue. What always troubled me with the other, cheaper liners was that they were so flimsy (even without cats' claws raking over them) that I'd have to double-bag or risk tracking cat litter all over the house after changing/disposing of a full bag. These bags are really tough, sturdy! They would hold up to the most dedicated cat scratching!",
      "rating": 5.0,
      "verified": true,
      "author": "Claudia Grinnell",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Best on the market, but doesn’t solve your problems",
      "text": "As far as liners go, these are the best on the market. That being said, they still end up with claw holes, urine clumps between folds, and they don’t fit flush against the box. If you absolutely must use a litter box liner, this is your best option, but it still has all of the usual problems associated with liners. My recommendation is to just nut up, stop using liners. and put a little more effort into your cat’s litter box.",
      "rating": 5.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Will purchase again... and again... and again",
      "text": "It's probably weird to say I \"love\" a cat litter box liner, but I love these cat litter box liners! Makes a gross job... not all that gross! I only change the cat litter once a week. I use these and Arm & Hammer cat litter. These together make changing the cat litter EASY PEASY!",
      "rating": 5.0,
      "verified": true,
      "author": "amoore",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "Winner!!!",
      "text": "The absolute best, hands down! I've never had cat litter liners work so well! Never a tear in the bag when I go to remove them and my cats can do some damage on litter box liners. These fit the large boxes so well with a little room to spare without straining to get them to fit!",
      "rating": 5.0,
      "verified": true,
      "author": "JH",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Great product.",
      "text": "Love these liners. I have a large and an even larger cat box and these liners fit both. They are great because you just lift, tighten the strings on the bag and toss, just like normal trash. The bag is thick and durable too so messes or leaks are uncommon. Unless your cat goes nuts with the scratching and poking holes with nails, then some litter may fall through holes and land in bottom of pan. My 2 cats don't seem phased by liner or its texture either.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandi",
      "helpful_votes": 3,
      "publication_date": 20160824
    },
    {
      "title": "Excellent quality, hard to tear litter box liners",
      "text": "Excellent quality, hard to tear litter box liners. We have tried numerous brands over the years, and were almost always disappointed with the quality. These bags are rugged and hard to tear and are the best we have ever used. Now we won't buy anything else. We recommend them!",
      "rating": 5.0,
      "verified": true,
      "author": "Joann S.",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Durable, Good Quality!",
      "text": "I love these litter bags. They are a life saver in my two-cat household. They make clean-up so much easier and make much less of a mess. I buy these monthly and rely on them for my litter-needs. I would HIGHLY recommend them to anyone with a cat!",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Shumaker",
      "helpful_votes": 0,
      "publication_date": 20181004
    },
    {
      "title": "Two large cats with two large litter boxes - these work nicely",
      "text": "We've been using these for several years for our two Maine Coon mix kitties. The material holds up well, and fits our extra-large boxes very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Genuine Redhead",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Great Product",
      "text": "Very strong and durable. I love this product. It makes it easy to clean the litter box.",
      "rating": 5.0,
      "verified": true,
      "author": "Y S",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Best Litter Bags",
      "text": "I wish they were just a bit wider. I need to stretch them a bit before putting them on litter box",
      "rating": 5.0,
      "verified": true,
      "author": "Wallybird",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "It works and it is big!",
      "text": "Thank you for being big enough to fit all the way up the sides on my weirdly shaped fake plant pot litter box and being strong enough that there aren't holes when my cat digs to China.",
      "rating": 5.0,
      "verified": true,
      "author": "Elle Michele",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "good for multiple cats",
      "text": "I have two (formerly three) very messy cats and this is a perfect cat box liner for them. I highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "John Stults",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Good liners.",
      "text": "These are my favorite liners. They are nice and thick. Most liners are very thin plastic and the cat just makes holes in them. Easy to lift with the ties. Never have had them break.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "The only letterbox liners worth buying",
      "text": "These are the only liners that last for my cat and don't leave litter spilling through to the bottom, even when he claws sections.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "Great litter bags",
      "text": "Been using these fir 10 years at least. I have noticed though they are getting thinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Mkt",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "I have been using this product for a long time",
      "text": "This is very easy to use and heavy enough so the cats don't scratch through it like some others!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Quality",
      "text": "I have always used these for my litter boxes. They have never failed me.",
      "rating": 5.0,
      "verified": true,
      "author": "Terese",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Too large for small boxes.",
      "text": "Too big for my box wish they made smaller sizes, but durable and industructable way to clean a litter box if you don't like scooping and use a healthy amount of litter less frequent changes.",
      "rating": 3.0,
      "verified": true,
      "author": "Georgia Aderhold",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Excellent Durability",
      "text": "These work great! Have 2 cats and these are the first liners that their nails don’t tear up when they scratch!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Sundberg",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Strongest I have found",
      "text": "These liners hold up to my 2 cats with sharp claws digging in their box. I won’t buy any other brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Аmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Best litter box liners.",
      "text": "Always buy these liners as they hold up best in my cats litter box.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia J.",
      "helpful_votes": 0,
      "publication_date": 20191015
    },
    {
      "title": "Easy to use!",
      "text": "I use this in my cat’s litter box. It makes cleaning the litter box a snap.",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Eng",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "Best there is",
      "text": "Best cat box liner ever made! They're sturdy, contain the mess, and are super easy to dispose if waste without getting your hands dirty!",
      "rating": 5.0,
      "verified": true,
      "author": "Links2me",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "Will never be without these!!!!",
      "text": "These are the best!!! I use these with the cheapest littler I can find and change the entire box out about every 4 days. No stale urine! This makes the process so easy. And over all much cheaper than buying expensive clumping litter.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorianne C. Hohenstern",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Strong",
      "text": "I was using Target extra large liners but they changed something in the plastic and they just fall apart. These are great. Super strong, the scooper doesnt rip the liner. Fits my large booda dome box.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Perfect",
      "text": "This is the second time I have ordered this product and I will order again. This is a great product, I have two cats and these Litter box liners have never failed me.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Tucker",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "heavy duty cat litter bags",
      "text": "I use this for cat litter liners. I like the product as it is heavy duty and the drawstring makes it easy to close and change the litter.",
      "rating": 5.0,
      "verified": true,
      "author": "Janet Kivinen",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Helpful product",
      "text": "I just tried this litter box liner and it performed perfectly. Do yourself a favor and buy this item. I highly recommend this liner to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry L",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "I use these weekly.",
      "text": "We have a Maine Coon cat and he destroys any other litter liner. This works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Penelope Hobframe",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Johnny Cat Bix Liners Heavy Duty Jumbo",
      "text": "The very best cat box liners. All of my cats have claws and these even last for weeks with clumping litter before I have to put new ones in. They fit my very large litter boxes.",
      "rating": 5.0,
      "verified": true,
      "author": "C. andrew",
      "helpful_votes": 2,
      "publication_date": 20170308
    },
    {
      "title": "Great, sturdy product.",
      "text": "These liners are the only ones I have found that are both thick and fit extra large littler boxes. Many large liners are paper-thin and develop holes quickly as cats bury their treasures. These, on the other hand, are very thick with sturdy drawstrings. I have a large, oval box and several square boxes; these liners work well in both. My pet store no longer stocks these liners, so I order them online and the price is actually cheaper. I would not use anything else in my litterboxes.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephanie M",
      "helpful_votes": 4,
      "publication_date": 20150601
    },
    {
      "title": "Convenience",
      "text": "I love this because I was always cleaning the litter box and waiting for it to dry. This made life simple for me.",
      "rating": 5.0,
      "verified": true,
      "author": "A. MORALES",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Of Course.  These are the best",
      "text": "You used to be able to buy these at The Dollar Tree... who found out and told everyone??!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaime S.",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Perfect size",
      "text": "Only ones that fit the booda litter box right. These work great.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin H.",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "Perfect fit for large square and oval boxes.",
      "text": "With four cats,I needed large litter liners.These for my extra-large square and oval domed boxes very well.Extra strong.",
      "rating": 5.0,
      "verified": true,
      "author": "ellafan",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Strong liners do their job!",
      "text": "Great product! They are strong and hold up to my cat's digging and don't tear, which was a problem with the previous brand I used.",
      "rating": 5.0,
      "verified": true,
      "author": "Martha F",
      "helpful_votes": 0,
      "publication_date": 20180705
    },
    {
      "title": "Work well",
      "text": "These work well, makes changing out the litter easy. You do have to be generous with th litter to prevent holes from the cats claws. Fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Shively",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Cat doesn’t shred these!",
      "text": "So much better than any other litter bags I’ve tried. My cat used to shred litter bags until i tried this brand. The plastic is thicker and the draw strings are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Maggie",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Size matters ...",
      "text": "These bags are definitely heavy duty enough but they don’t fit any of the X-large or Jumbo litter boxes I’ve ever seen.",
      "rating": 4.0,
      "verified": true,
      "author": "Dudley Murray",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "I do feel guilty throwing them in the garbage though. Surely",
      "text": "They do the job. I do feel guilty throwing them in the garbage though. Surely, no biodegradable.",
      "rating": 3.0,
      "verified": true,
      "author": "Toni Weber",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Great",
      "text": "We have 2 cats and these bags are great for inside cats",
      "rating": 5.0,
      "verified": true,
      "author": "Bon",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Works As Advertised",
      "text": "Extra heavy-duty plastic liners last longer. Not as easily shredded as the cheaper ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel C",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "The best cat box liners available",
      "text": "The best quality cat box liners available. They will withstand a lot of clawing. I will not buy any others. My local supermarket only carries this product line and are so often out, I have started buying them in bulk here.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Nichols",
      "helpful_votes": 0,
      "publication_date": 20160725
    },
    {
      "title": "This is One Tough cat pan liner",
      "text": "the liners stand up to cat claws. That's why I've used this brand for years. thank you Johnie Cat!",
      "rating": 5.0,
      "verified": true,
      "author": "robin ferguson",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Best cat litter liner out there",
      "text": "I swear by this brand and the durability of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Mac Daddy",
      "text": "These are mac daddy liners. Super thick and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "The Messingers",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Recommended, if your cat is a liner shredder and you don't mind the high price",
      "text": "These are strong, as advertised. If you have a cat who usually shreds liners, this might be the liner that survives. Ours have. It's nice to just be able to lift out the liner, pull the tie, and throw it out, without cleaning up litter spills. Just wish they weren't so expensive.",
      "rating": 4.0,
      "verified": true,
      "author": "Elsie",
      "helpful_votes": 0,
      "publication_date": 20140819
    },
    {
      "title": "These are the only brand I use.",
      "text": "The cats tear through every single other brand I've used. My local market recently was out of these for a few months (I really hate that store!) and I turned to amazon after being forced to use other brands. I won't go back and this is now a subscribe and save for this household.",
      "rating": 5.0,
      "verified": true,
      "author": "Plunderer",
      "helpful_votes": 0,
      "publication_date": 20140809
    },
    {
      "title": "been using cat litter bags for my multicats and after 20 years of cats!! these are the very best !",
      "text": "the best bags i have ever used and there are alot of brands out there and only this one is worth fregin having .2 of these bags doubled bagged will go easily 6 times further than 4 bags of any other brand its insane and i will never buy another bag that is not jonny cat !!!",
      "rating": 5.0,
      "verified": true,
      "author": "joe",
      "helpful_votes": 2,
      "publication_date": 20151225
    },
    {
      "title": "Sturdy!!",
      "text": "Much sturdier than the other bags I have used in the past! I will continue to buy this brand in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel M",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Timesavers!",
      "text": "I have loved these litter liners since I found them at my local box store. I don't like going all the time to stock up and was so pleased to fined this opportunity to order them in bulk. They save me time when cleaning the litter box and my cat doesn't tear up the whole bottom of the liner. It's a much better cleaning experience to use these!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Breakthrough Explorer ~ Marcy",
      "helpful_votes": 0,
      "publication_date": 20140214
    },
    {
      "title": "great product",
      "text": "I have used these for years and love them. They are nice and big and super strong.",
      "rating": 5.0,
      "verified": true,
      "author": "ann adams",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": ".",
      "text": "Best liner on the market. Never leaks and stands up to toenails wrapping around the edge of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "D Carnes",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Best litter bags",
      "text": "Bags are the best quality I've seen and the door delivery is too convenient to pass up. Bags are sturdy, have never ripped, over sized for easy fit. When ready to change bags, simply lift the red string, pull, and it is sealed. No mess.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristie",
      "helpful_votes": 0,
      "publication_date": 20141109
    },
    {
      "title": "NOT FOR MULTI CAT LITTER BOXES",
      "text": "NOT FOR MULTI-CAT LITTER BOXES. buyers beware. The term “jumbo” does not apply to litter boxes sized for multiple cats. Will not fit around edges.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 0,
      "publication_date": 20191105
    },
    {
      "title": "Perfect Litter Box Liners!",
      "text": "These are great! Sturdy and easy to install and dispose of when needed to be changed. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen W.",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Great littter box bags",
      "text": "Litter bags are tough and work great for me/cats. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Grey Boy",
      "helpful_votes": 0,
      "publication_date": 20170530
    },
    {
      "title": "Absolutely Nothing. Awesome.",
      "text": "Love It .... No Leaks. Easy Draw String Extremely Very Sturdy .",
      "rating": 5.0,
      "verified": true,
      "author": "marytinelli",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Hold up under clawed use.",
      "text": "These are the only litter box liners that hold up - all my cats have claws and always will.",
      "rating": 5.0,
      "verified": true,
      "author": "mtc",
      "helpful_votes": 0,
      "publication_date": 20160910
    },
    {
      "title": "Durability unbeatable",
      "text": "I've used this product for a while and like the durability.",
      "rating": 5.0,
      "verified": true,
      "author": "J Bacon",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Good stuff",
      "text": "No more turds stuck to the litter box. It's a win for me",
      "rating": 5.0,
      "verified": true,
      "author": "Sean Buchanan",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "Five Stars",
      "text": "They got the litter box nice and they are strong",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Ann Randolph",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "We love these. We have three cats and they love ...",
      "text": "We love these. We have three cats and they love to rip at the plastic liner. These liners are far more durable than any others we have purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "SuburbanGirl",
      "helpful_votes": 0,
      "publication_date": 20141215
    },
    {
      "title": "These are the best cat litter liners ever",
      "text": "These are the best cat litter liners ever! We've learned our lesson compromising on other brands so we always order these online instead of using another brand that isn't as strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Brendan Plake",
      "helpful_votes": 0,
      "publication_date": 20150207
    },
    {
      "title": "... discovered this product at a Ralphs market and have liked it for years",
      "text": "I first discovered this product at a Ralphs market and have liked it for years. My cat needs the 2 mill thickness; he tears thinner liners too easily. Ralphs switched to another 2-mil liner, but I think his urine sticks to it easier. I'll know for sure in a week or so when I've had a chance to compare them .",
      "rating": 5.0,
      "verified": true,
      "author": "Yonit",
      "helpful_votes": 0,
      "publication_date": 20150802
    },
    {
      "title": "Very nice.",
      "text": "Super helpful! I used a binder clip to keep it attached to the litter box, when kitty goes wild trying to cover his doo doo.",
      "rating": 5.0,
      "verified": true,
      "author": "Desiree",
      "helpful_votes": 0,
      "publication_date": 20140905
    },
    {
      "title": "I recommend them to you",
      "text": "Jonny Cat Litter Box Liners are heavy duty and they are leakproof and strong. I recommend them to you. Blueboy",
      "rating": 5.0,
      "verified": true,
      "author": "JOE MARRINO",
      "helpful_votes": 0,
      "publication_date": 20140729
    },
    {
      "title": "Best Cat Liners",
      "text": "These liners are the best and I would only use this brand in our cat's box. PLease keep manufacturing them.",
      "rating": 5.0,
      "verified": true,
      "author": "S. B. Ettinger",
      "helpful_votes": 0,
      "publication_date": 20130816
    },
    {
      "title": "Five Stars",
      "text": "Very seldom tear, heavy duty. The only litter bags I use.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Reed",
      "helpful_votes": 0,
      "publication_date": 20150102
    },
    {
      "title": "I think these are the best liners. They are very sturdy",
      "text": "I think these are the best liners. They are very sturdy. I cannot find them in any store in central Illinois, so I am very happy that I can order them online.",
      "rating": 5.0,
      "verified": true,
      "author": "Kay Lesko",
      "helpful_votes": 0,
      "publication_date": 20140720
    },
    {
      "title": "Excellent and heavy duty!",
      "text": "These are the only brand my Bengal does not try to eat the corners off of and they are not sold in any local store near me.",
      "rating": 5.0,
      "verified": true,
      "author": "Marylyn Tippeconnic",
      "helpful_votes": 0,
      "publication_date": 20140101
    },
    {
      "title": "They are great. I would recommend them to anyone",
      "text": "I always use these litter box liners. They are great. I would recommend them to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A. Crame",
      "helpful_votes": 0,
      "publication_date": 20141111
    },
    {
      "title": "Great bag...strong",
      "text": "So easy to use and get rid of your cat's business!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Amato",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "Five Stars",
      "text": "Kitty with sharp claws and this bag is the best.",
      "rating": 5.0,
      "verified": true,
      "author": "KORDO",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "Five Stars",
      "text": "So easy for clean up. I have three cats, so I live for these.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160228
    },
    {
      "title": "Five Stars",
      "text": "Always liked this brand - very strong and well-fitting in the litter box.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynn Moran",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Great litter bags!",
      "text": "Very durable and they do the job. For a super-scratcher like my cat, they last quite awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "whitenite",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Best litter liners",
      "text": "These are very durable and have never torn on me. I cannot use the store brand ones because they feel so cheap. As long as I still have cats, I will continue to purchase this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Munford",
      "helpful_votes": 0,
      "publication_date": 20140412
    },
    {
      "title": "Works well",
      "text": "This product makes my life with my cat a pleasant situation. It consolidates the normal litt disposal problems, and I love that.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan C. Downs",
      "helpful_votes": 0,
      "publication_date": 20130822
    },
    {
      "title": "Fast and east transaction. Everything arrived as promised. ...",
      "text": "Fast and east transaction. Everything arrived as promised. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucy440",
      "helpful_votes": 0,
      "publication_date": 20150116
    },
    {
      "title": "Don't mess around, go with quality in this arena",
      "text": "Look, anyone who spends time with a litter box knows the score. Cats will tear through liners like its thin air. These can stand-up better than just about any other brand. Also these actually fit my apparently \"massive\" litter box, which is a must (why litter box manufactures make the boxes but not the liners is beyond me. Now, if you'll excuse me, I've got a box to conquer.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Quirk",
      "helpful_votes": 0,
      "publication_date": 20140112
    },
    {
      "title": "Five Stars",
      "text": "Very pleased with the Johnny Cat Litter Box Liner Order.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "... use these all the time and they are the best. Shipment by Amazon is always on time",
      "text": "I use these all the time and they are the best. Shipment by Amazon is always on time.",
      "rating": 5.0,
      "verified": true,
      "author": "penny mack",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "HANDS DOWN THE BEST LITTER BOX LINERS ON THE MARKET",
      "text": "Can't beat these liners. The thickest and most durable liners on the market. They can be hard to find but when I do order them, I always order extra. I love them.... but even more importantly,..... my cats do too.",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Makes for easy clean up.",
      "text": "This product has proven to be dependable and great quality. Makes the weekly litter change effortless. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Bags For Cat Boxes",
      "text": "These bags are just the right size and you are ending just the right amount. Thank You",
      "rating": 5.0,
      "verified": true,
      "author": "Darcy Maloney-Koke",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Good buy",
      "text": "These are great. Thick quality so can last a few weeks. Make liter box so much cleaner!",
      "rating": 5.0,
      "verified": true,
      "author": "Happy quilter",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "rolls royce of litter box liners!",
      "text": "Well made: sturdy, contains cat litter, and easy to throw out.",
      "rating": 5.0,
      "verified": true,
      "author": "linda",
      "helpful_votes": 0,
      "publication_date": 20190531
    }
  ],
  "product_meta": {
    "title": "JONNY CAT Litter Box Liners, Heavy Duty, Jumbo 5 Per Box (4 Pack/Boxes)",
    "description": "Color:Original VersionJonny Cat Litter Box Liners make it easy for you to clean up after your feline friends. With a tough, resilient construction, these liners never quit. Jumbo cat litter box liners are ideal for boxes used by more than one cat.",
    "rating": 4.8,
    "feature_bullets": [
      "Pack of 4 boxes, each box has 5 liners.",
      "Drawstring liners for easy pick-up and disposal",
      "Heavy duty and tear resistant"
    ],
    "specifications": {
      "Manufacturer": "Jonny Cat",
      "Part Number": "1",
      "Item Weight": "2.2 pounds",
      "Package Dimensions": "10.6 x 8.7 x 4.6 inches",
      "Item model number": "1",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Original Version",
      "Item Package Quantity": "1",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00D5UWVG8",
      "Customer Reviews": "4.8 out of 5 stars348 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#11,081 in Pet Supplies",
      "Date First Available": "June 3, 2013"
    },
    "categories": [
      "Litter & Housebreaking",
      "Pet Supplies",
      "Litter Box Liners",
      "Cats"
    ],
    "price": 19.12
  }
}