{
  "website_summaries": [
    {
      "verdict": "This tiller packs a lot of power for the price, and delivers convenience and ease of use.",
      "pros": [
        "Set up is simple",
        "You do not have to be strong to use this model",
        "Cuts through the soil well",
        "Leaves dirt soft and ready for planting",
        "Moves fast with a decent amount of power",
        "Safety shut-off bar",
        "A well constructed machine"
      ],
      "cons": [
        "Not as powerful as a gas tiller",
        "Only a 5-inch tilling height",
        "Others can go deeper"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works great, assembly is not hard.",
      "text": "Using this tiller to get part of my front yard ready to lay down some sod. Once I got it together, it was pretty easy to use. It will tend to pull you forward when you are using it, but it's not difficult to overcome. If I figure out what those 2 clips are for, I will update this.",
      "rating": 5.0,
      "verified": true,
      "author": "Vegäs Gär ✅",
      "helpful_votes": 25,
      "publication_date": 20181023
    },
    {
      "title": "Failed the second use.",
      "text": "I wanted the tiller to keep down some weeds in my veg garden. My garden is light sand but the second time I used the tiller it quit. I appears that the failure is in the motor. I liked the tiller but would make a couple of changes. Not sure why the handle is arranged downward, but the unit is light weight and easy to control. I used a heavy extension card from my house and the voltage is 127 volts and the late evening is cool. Perfect for working the garden. The tiller was much better than a hoe, when the tiller was operating. I am anxious to see if the vendor will replace the electric motor.",
      "rating": 2.0,
      "verified": true,
      "author": "Merle",
      "helpful_votes": 12,
      "publication_date": 20160505
    },
    {
      "title": "Great, if you can tolerate the cord.",
      "text": "Digs well. Tines holding up pretty well unless you hit a few stones with them. I had to unbend the tines. Biggest complaint is the difficulty trying not to run over the cord going back and forth on paths. Tolerated extensive digging without burning out motor.",
      "rating": 4.0,
      "verified": true,
      "author": "N. Suleiman",
      "helpful_votes": 44,
      "publication_date": 20150314
    },
    {
      "title": "Works like a champ!",
      "text": "I have four Greenworks devices; an electric snow shovel, snow blower (for heavier snowfall) a line trimmer and now this lightweight cultivator/tiller. My side yard, where I've planted my vegetable garden is pretty rocky, must have had a stream running through it before the house was built in 1905 because that isn't the case with my front yard. Due to its light weight, the machine bounced around a bit but I'd expected that so no big deal. After a couple of passes, it was for the most part, smooth running. Knocked the weeds down pretty well, I figure I'll till at least weekly until fall. So far, I'm quite happy. Greenworks devices ROCK!",
      "rating": 5.0,
      "verified": true,
      "author": "Spag! 5th SFG(A)",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "A capable tiller for working flower beds",
      "text": "I recently purchased a full sized rear tine rototiller for the garden but I needed something else for working in tight spots for the flower gardens. I took a chance and bought this electric tiller. It is lighter and tills slower than the big tiller but with patience it does a great job. I found it best to remove the wheels while tilling up to 6 inches deep in hardpack clay soil. When hitting rocks and roots it will jump up but it is not difficult to keep in control. Unless you are tilling larger than 10' X 10 ' this tiller is all you will need.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "GREAT LITTLE TILLER!",
      "text": "WONDERFUL TILLER... TILLED MY GARDEN IN ABOUT 2 HOURS FROM PRIOR YEAR OVER GROWTH. GARDEN AREA IS 20X30FT. INSTALLATION INSTRUCTIONS WERE A LITTLE CHALLENGING, BUT I PUT IT TOGETHER IN ABOUT ONE HOUR. I USUALLY PAY SOMEONE TO TILL MY GARDEN BUT WHEN I FOUND OUT ABOUT THIS TILLER, I DECIDED TO GIVE IT A TRY. IT HAS ALREADY PAID FOR ITSELF AS COMPARED TO HIRING SOMEONE TO TILL IT FOR ME. YEPPIE!",
      "rating": 5.0,
      "verified": true,
      "author": "EMB12",
      "helpful_votes": 11,
      "publication_date": 20150703
    },
    {
      "title": "Awesome little tiller",
      "text": "This showed up the day after I ordered it. I was surprised how quickly it got here. I quickly put it together in about 5 minutes and took it for a test drive. it worked perfectly for my little garden area. it digs nicely and did the job. tried it on some harder dirt and is skipped a it. used a pick to break up the ground a bit and then it dug right in and finished the job. it is not heavy enough for hard pack dirt, but for tilling up the garden area, it worked. very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed McGuirk",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Well Worth the Money!! Effective and Valuable",
      "text": "I tilled my entire front lawn which is huge in preparation for laying sod. This product has a lot of power, and I was able to complete the project by myself. I am a woman, and as men drove past seeing how much I was getting accomplished on my own, they began to give me accolades after they initially doubted my ability to complete the job with this machine. The cost of this machine is as much as what it would have cost had I rented a tiller for one day. Instead of renting for one day, I own this and use it as often as I need it. I HIGHLY recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20180102
    },
    {
      "title": "Tough little workhorse",
      "text": "Great tiller. I needed to till and re-sow all of my back lawn. This tiller made short work of the task. It pulled out all of the remaining grass, weeds and Palm roots. Tilling the amendments into the soil couldn't have been easier. I have a smallish back lawn - about 1500 sq. ft., but this tiller would be up for a much larger project. I went ahead and tilled all of the flower gardens as well. The back yard has never looked better - AND with no gasoline hassles.",
      "rating": 5.0,
      "verified": true,
      "author": "Damien Heart",
      "helpful_votes": 9,
      "publication_date": 20150507
    },
    {
      "title": "Gets the job done",
      "text": "This little rototiller was worth every cent of this reasonable price. I think the best feature, besides being able to break up the turf of my lawn, was that it is electric!! No gas or oil for me to worry about. I am widowed and had left this sort of thing to my husband, in the past. Now I can do my own tilling! I cannot comment on the assembly, as my handyman put it together but it really is a very nice machine for a great price and does the job without a complaining.",
      "rating": 5.0,
      "verified": true,
      "author": "Marianne N. Miles",
      "helpful_votes": 2,
      "publication_date": 20190625
    },
    {
      "title": "Great yard tool!",
      "text": "My husband thought this little machine couldn’t do the job we needed. It proved him wrong! I couldn’t imagine having a tiller with no wheels on the back. This tiller is absolutely amazing. We had a mound of dirt that grew over with tons of weeds. The tiller did an amazing job flattening the mound. The tiller did get tangled with weeds and automatically stopped functioning. As soon as the weeds were removed it allowed me to continue. Great yard tool that made a big job simple.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittney F",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "it stopped after 10 minutes/would not restart",
      "text": "it's heavy, only does a fair job of tilling. I spoke to greenworks on phone call arranged by amazon and they were not all all helpful. could care less. said you need to have \"proper\" gage ext cord and \"proper\" length cord depending on how far from power source you are. if you don't know what gage you have just go buy a new one. would be helpful to know that BEFORE you make purchase. amazon rep was great however, and sent a call tag for ups tp pick up the thing and return for a full refund. amazon gets 5 stars. greenworks should get zero",
      "rating": 1.0,
      "verified": true,
      "author": "dak98",
      "helpful_votes": 2,
      "publication_date": 20190808
    },
    {
      "title": "Stopped working.",
      "text": "Unfortunately, it only worked for about 30 minutes, and didn't want to start. When I got it out to use again, it refused to come on. I checked the outlet, the cord, and the connection. Nothing worked. Too bad because it was just the right size for the small garden. I reordered another one to replace this one. It didn't work at all.",
      "rating": 1.0,
      "verified": true,
      "author": "LacelleTop Contributor: Baking",
      "helpful_votes": 3,
      "publication_date": 20171006
    },
    {
      "title": "but this machine easily cut through grass and rocky clay",
      "text": "I bought this to prep a 10'x10' area for planting. It took about 45 minutes, but this machine easily cut through grass and rocky clay. The digging tines are not large, so grass and roots would amass on them. This required frequent brakes, but that might be good to prevent the engine from overheating.",
      "rating": 5.0,
      "verified": true,
      "author": "HobbesEsq",
      "helpful_votes": 10,
      "publication_date": 20151031
    },
    {
      "title": "Great Tiller",
      "text": "This little tiller has met all of my expectations. I was concerned that the design of the handle, as opposed to the separated handles with handgrips, would be difficult to use, but it is actually a great design. There are no issues and controlling the tiller and keeping it on track. It does not bounce around like I thought it might. It is powerful enough for most tasks, but if the ground is super hard you’re going to be working at it quite a while. Quality seems good. I am very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Vader540",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "Sounds like a great motor, however...",
      "text": "Motor works great, however it is a moot point when the tines won't turn. Trouble shooting says to return for service. Pretty sad all things considered.",
      "rating": 1.0,
      "verified": true,
      "author": "Shindoru",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "Easy assembly. The tiller requires a heavy duty extension ...",
      "text": "I have experience with larger tillers. This one was needed for my smaller garden. Easy assembly. The tiller requires a heavy duty extension cord, not provided. After a trip to Lowes, I had my cord. The motor is very powerful and quiet..It is not self- propelled, but I knew that before I purchased. The tiller did a great job in my raised bed garden. The soil was worked deep enough to plant all my seedlings.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180126
    },
    {
      "title": "I never thought I would love a roto tiller, but I was wrong.",
      "text": "I love this tiller. I have an older home that was neglected and the flower beds if you call them that....well were very sad. I have used this and found that is id great. It breaks up the dirt with easy. I tilled the beds with peat moss, compost, and vermiculite. Each item I added to the soil well it just got better and better to till. Now this sad soil is the best around and I could not have used a spade to turn it by hand. Thank you for a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan M.",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "It's pretty decent.",
      "text": "It works pretty well. It's obviously narrow and because it's lighter weight it will tend to want to pop up if you hit a decent size rock. Other than that it works well. Used it to tear up my entire front yard to completely reseed the yard.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Burrows",
      "helpful_votes": 0,
      "publication_date": 20201012
    },
    {
      "title": "... till a few small flower beds and this was amazing. It hadn’t rained in 5 months here in ...",
      "text": "I only needed to till a few small flower beds and this was amazing. It hadn’t rained in 5 months here in West Texas and the dirt was like rock and this thing did the trick!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill A.",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "This did a great job. I had to clear the weeds out ...",
      "text": "Tilled about 200 sq ft of earth and I can't imagine doing it by hand. This did a great job. I had to clear the weeds out of the blades several times as they would wind around and clog things up. But that was easy enough to do. Not sure how well it would work on old compacted soil that's never been tilled or anything, but i'm sure i'll try that at some point. Decent machine.",
      "rating": 4.0,
      "verified": true,
      "author": "Grandma Susan",
      "helpful_votes": 2,
      "publication_date": 20170904
    },
    {
      "title": "It digs like a champ",
      "text": "I'm really impressed with this little tiller. It digs like a champ, is really light, easy to handle and quiet, and it hasn't bogged-down in dry or moist soil. I think it's well suited for normal garden tilling, and it cut right through sod without any problem. I don't know how it would do in heavy clay, or hard pack like in Arizona, but here in Ohio and at my parent's in southern Michigan, it's perfect. Also, it was $20 less expensive than at Home Depot! Worth every penny and more.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "Doesnt work",
      "text": "So i purchased this item a while back and have barely gotten to use it. First time i used it, it worked well second day i try to use it the stupid thing wont turn on at all. Its outside of the return period so i just lost $80 bucks. Dont recommend this product its a waste of money!",
      "rating": 1.0,
      "verified": true,
      "author": "Jose cermeno",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "Easy to operate",
      "text": "My wife is a avid Gardner bought this for her to make her hobby easier. She absolutely loves this machine, it easy and lightweight for her to operate and does not take up a lot of storage space. Also being electric no need to store gasoline. It’s a big help to her landscaping our new home.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert L. McEvoy",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "I like that I don't have to pull a cord to ...",
      "text": "I like that I don't have to pull a cord to start it (electric) and its lite enough that I can use it. But, the ground can't be rock hard dirt otherwise the tiller bounces around. But soft ground or after a lite rain, works good.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie P",
      "helpful_votes": 2,
      "publication_date": 20180320
    },
    {
      "title": "You should definately buy this!!",
      "text": "This little machine is the bomb. We have rottotilled our lawn while getting ready to lay sod. If we had paid someone it would have cost three times what buying one tiller cost. We found this to be an excellent unit and worth buying.",
      "rating": 5.0,
      "verified": true,
      "author": "jujutsu Joy",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Works For ME!!",
      "text": "I read the reviews before I bought one. They were a mix, so I ordered one, had no problem putting this together, (joke: I use to be a blonde) granted the instructions (all 3) had different ways of doing it. It is a perfect size for me, it is so easy using it, it will get a head of you if your not paying attention. Now if we can just get all this rain (from Texas) stopped so I can finish what I have started it would be perfect. Would I buy another one, sure I would....",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie Snow",
      "helpful_votes": 6,
      "publication_date": 20150530
    },
    {
      "title": "removes all your grass",
      "text": "sounds scary, but if that's what you want to do, this will do it. Removes all your grass, so you can fill in with rocks to avoid using water. That's what California wants. Brown lawns or rocks. haha",
      "rating": 5.0,
      "verified": true,
      "author": "JustTheFacts",
      "helpful_votes": 0,
      "publication_date": 20191206
    },
    {
      "title": "Junk",
      "text": "Just received this . Like an hour as of this time I am writing. It’s 8.30 pm . Put it together and tried it out. It only worked for about 10 minuets . Won’t start again. It’s attempting but won’t turn over. Piece of junk this. Don’t buy .",
      "rating": 1.0,
      "verified": true,
      "author": "Jaswant  Jagnarain",
      "helpful_votes": 0,
      "publication_date": 20180907
    },
    {
      "title": "Arrived Defective",
      "text": "Arrived defective and would not turn on. Button had wear on it, appeared to be a refurbished model or just bad quality control. Went to Menards instead and found one cheaper.",
      "rating": 1.0,
      "verified": true,
      "author": "Enoch Wright",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "up and running in 15 minutes out of box/cotter pins",
      "text": "Does it's job very well used 3 times now the last time used hit a piece of underground wood sheared off cotter pin for tines replaced it up and running again. You may want too buy a few extra cotter pins if you don't have any it does not come with spares. Have fun and do not run over your cord. Light weight and hard working.",
      "rating": 4.0,
      "verified": true,
      "author": "jeffrey andersen",
      "helpful_votes": 5,
      "publication_date": 20150517
    },
    {
      "title": "Works good. Better design would be warranted.",
      "text": "Having owned this tiller for 3 years, the main drawback is that the motor cover broke in half, so have to bag it to keep dirt/grass/debris out. Other drawback, but known, is the cord gets in the way easily, and there is no place to hook/hold the excess.",
      "rating": 4.0,
      "verified": true,
      "author": "John Novicki",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Great for small jobs",
      "text": "We use this for a small garden on the side of our driveway. Works great. Just don't try to go too deep all at once. I run it a couple inches into the soil each pass and then go over it again. Nice and easy does it. This tiller saved me a lot of hand work. I like the fact that it's electric because I only really need it once a year and a gas tiller would be too much maintance just to use like that.",
      "rating": 5.0,
      "verified": true,
      "author": "The 8th Man",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "did some homework on it tested wires hot going in none going to motor I took green button panel off took it apart the switch was bad, putting a toggle switch on it",
      "text": "Well I just got it plug in hit button nothing , did some homework on it tested wires hot going in none going to motor I took green button panel off took it apart the switch was bad , putting a toggle switch on it , their switch is a joke .",
      "rating": 2.0,
      "verified": true,
      "author": "Toby",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "Didn't work",
      "text": "Tiller arrived and was easily put together, the instructions were mildly confusing but able to figure it out, but once I was ready to use it, nothing happened. Checked power to product, not the problem. Sent it back.",
      "rating": 1.0,
      "verified": true,
      "author": "T rad tech",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Surprised",
      "text": "I was actually surprised at how well this works. I bought it to clean out a flower bed but it had no problem with hard compacted dirt or roots. If you need something to clear out a garden or flower bed i definitely recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Parker",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "what are you looking for?",
      "text": "I was looking for something to weed my garden between the rows, instead of my fingers or a hoe. It does that. Anyone looking for it to do deep tilling or grass areas get a gas powered tiller. This unit is designed for weeding be tween the rows.",
      "rating": 4.0,
      "verified": true,
      "author": "Crazy Man",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "DOA",
      "text": "Arrived dead on arrival.. plugg in ... Nothing- not even a hum, returned to Amazon and buying a Sunjoe!",
      "rating": 1.0,
      "verified": true,
      "author": "Jim M",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "so good with this tiller",
      "text": "So far, so good with this tiller. It has helped me set up my garden and plant some grass seed with little fuss. Simple enough to put together after I realized the instructions had a slight error. Good customer support on that note! The pin that holds the device to the handles at the bottom popped off somewhere while I was using it, but not a huge deal to replace.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 2,
      "publication_date": 20150520
    },
    {
      "title": "Tines won't turn.",
      "text": "Put together easy enough. Motor runs but tines don't turn. I checked and rechecked tine placement. Its saturday so the help line not avail till Monday. Really disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "JOYCE  Escondido,CA",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Works like a champ!",
      "text": "Easy to put together, but follow your gut, not the instructions, and put the tines on with space between them, not having the stickers face each other.. my soil has great parts and rocky ones and it handled both. In the rocks it kicks like a bronco, but keeps going! Very happy so far!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Hilliard",
      "helpful_votes": 0,
      "publication_date": 20180311
    },
    {
      "title": "Great!!! Does the Job!!",
      "text": "My wife uses it to till up weeds around our garden.",
      "rating": 5.0,
      "verified": true,
      "author": "GAMER",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Rickety but still intact",
      "text": "Works well for an inexpensive tiller but felt cheap even for the low cost paid. The washers kept falling off and getting lost and we wondered during each usage if it would last through the job at task. Rocks kept getting stuck making the job more challenging but it is more effective than digging.",
      "rating": 3.0,
      "verified": true,
      "author": "Norma F.",
      "helpful_votes": 0,
      "publication_date": 20160709
    },
    {
      "title": "More powerful than it looks",
      "text": "This thing is more powerful than it looks. Made quick work of my yard for sod, the St Augustine sprigs didn't stand a chance.",
      "rating": 5.0,
      "verified": true,
      "author": "v8bait",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Great Tiller",
      "text": "this is a great tiller for doing flower garden beds worked great in georgia red clay ran it for about 3 hours chopped it up real fine like powder.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 4,
      "publication_date": 20160527
    },
    {
      "title": "Up to the Task",
      "text": "Pleasantly surprised! I bought this because I didn't want to have deal with a 2 cycle engine for my small garden. It was more than up to the task. Had to stop and clear the crab grass roots. I also had to break down an actually read the manual. I put the discs on backwards. They go clockwise.",
      "rating": 4.0,
      "verified": true,
      "author": "bdbmn",
      "helpful_votes": 3,
      "publication_date": 20150524
    },
    {
      "title": "Definitely recommend it!!",
      "text": "Put it together in less than 10 minutes works great!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ricardo ",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Pretty darn good",
      "text": "Pretty darn good! Good for a woman or older person. The directions to put it together have a few steps that you have to really pay attention too. But....It very good, works great and light enough for me to use.",
      "rating": 5.0,
      "verified": true,
      "author": "ShannonC",
      "helpful_votes": 2,
      "publication_date": 20160801
    },
    {
      "title": "Good deal.",
      "text": "Very responsive and does the job. Probably best for a small flower bed that is already established or in a larger raised bed. While it can chew up some new ground, it bucked a bit working it that way.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah",
      "helpful_votes": 5,
      "publication_date": 20150425
    },
    {
      "title": "Very good design, construction and great value. Easy to use, lightweight.",
      "text": "Had it a year now and it's great! Easy to use and store, no smelly gasoline mixtures, plenty of power for the home garden. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed L.",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "GreenWorks Tiller 10 Inch",
      "text": "GreenWorks Tiller is just what I needed to keep the weeds down and till up the garden space. Had some big chunks of dirt for post hole digging and the tiller made easy work of it. I am close to 70 years young and can handle this sweet little machine. Perfect size, perfect power and happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Snow",
      "helpful_votes": 0,
      "publication_date": 20160630
    },
    {
      "title": "Good for light cultivation",
      "text": "Bought this to use in my raised beds and previously worked flower beds, doesn't have the power to cut through sod but I knew this before I bought it. Works well and quickly. I like having the wheels to support the weight, I also have a Black & Decker Garden Cultivator but it gets heavy after awhile. Assembly was not difficult, pay close attention to the diagrams. This machine works well for its intended purpose.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Eckert",
      "helpful_votes": 0,
      "publication_date": 20150614
    },
    {
      "title": "One Star",
      "text": "Fell apart the second time I used it. I reported it. And I didn’t get any reply.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180605
    },
    {
      "title": "Works well.",
      "text": "Have only used it once in previously tilled ground but seemed to have plenty of power.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Easy to manouver",
      "text": "Small enough to move around easily & powerful enough to till 800 square feet of weeds & hardpan in about an hour. The pins that hold on the blades could be improved not other than that it is versatile and powerful.",
      "rating": 5.0,
      "verified": true,
      "author": "David M. Dobrow",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "You'll wonder why you waited so long to make your work easier",
      "text": "Easy set up and operation. This is quite a workhorse and easy to use in smallest of spaces. This cultivator saves so much time and energy with garden and flower bed upgrades. This investment is well worth the cost, you'll wonder why you waited so long.",
      "rating": 5.0,
      "verified": true,
      "author": "gary gaither",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Not all That",
      "text": "As with other electrical lawn machines, this one is no different. The cord was always in the way and then it would come unplugged. Then there's the tilling....This machine barely scrapes the surface. It's probably best used for weeding. Don't expect a deep rut...",
      "rating": 3.0,
      "verified": true,
      "author": "HDSpringerLady",
      "helpful_votes": 2,
      "publication_date": 20150630
    },
    {
      "title": "Good around the flower bed.",
      "text": "Makes quick work of prepping flower beds or gardens for spring planting.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "The Surprising Power of Going Green",
      "text": "Don't let the fact that this is electric fool you, this machine is powerful! It chewed right through my hard packed, rocky soil like a champ! It has surprising torque and the tines cultivate the top 3-4 inches with ease.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Carrell",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "easy to use and store",
      "text": "I bought this product to use on my little garden, over the last four years I tilled my 10 by 15 garden patch fifteen times with this unit before it started squealing and came to a stop, I paid around 125.00 for it so I figured it cost me 10.00 a time to till my garden up which wasn't so bad.",
      "rating": 3.0,
      "verified": true,
      "author": "Ronnie L.",
      "helpful_votes": 0,
      "publication_date": 20190608
    },
    {
      "title": "Well worth the $",
      "text": "Fantastic product! Hubby says it f ing rocks. Our garden looks amazing and the rocks and grass were no match for this.",
      "rating": 5.0,
      "verified": true,
      "author": "shawn mcmillin",
      "helpful_votes": 5,
      "publication_date": 20170413
    },
    {
      "title": "Excellent for medium duty",
      "text": "Excellent for medium duty, especially at this price point. I have used this so far in an area where Ivy was removed and planted grass. It is able to chop through the leftover Ivy roots with minimal issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Meers",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Easy to assemble",
      "text": "Basically a grass cutter. Easy to assemble, but has no digging torque, as others have mentioned. It just skims the ground and picks up grass, but won't really penetrate. It does better in reverse than forward. I wasn't impressed.",
      "rating": 2.0,
      "verified": true,
      "author": "Nick H.",
      "helpful_votes": 0,
      "publication_date": 20170425
    },
    {
      "title": "This tiller is just the ticket for an 81 year ...",
      "text": "This tiller is just the ticket for an 81 year old man. It does the job of mixing my mulch into the soil and can be lifted into the raised garden with ease, yet it tills the soil to the depth that I need to plant my garden. My only regret is that I didn't buy it sooner and get my garden started a month earlier while waiting for a neighbor's help with an old tiller that was more that I could handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard L. Freidenberger",
      "helpful_votes": 3,
      "publication_date": 20150603
    },
    {
      "title": "Light weight tiller for light work - around vegetable gardens and flower gardens.",
      "text": "It’s great for what it is. It’s for light work and will only go so far into the ground but it your soil has few rocks and isn’t bone dry, you’ll be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Lightweight and easy to use in any garden or yard area",
      "text": "Lightweight, easy to use tiller for small or large areas. Quiet operation - easy to assemble. Small size allows for easy tilling around plants. No gas cans or expensive maintenance checks - simply plug in and it is ready to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Cecil Latham",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Awesome machine!",
      "text": "I was able to til all of my back flowerbeds in record time! Love this machine!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica King",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "Handy item for our gardening",
      "text": "My husband likes this thing. He will use it with ease whenever I need a new flower bed.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth R.",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "I try to be super careful to not push it too far",
      "text": "Sure, its under-powered but price is right. I try to be super careful to not push it too far. I could see how you could overdo it and blow the motor pretty easily.",
      "rating": 4.0,
      "verified": true,
      "author": "mguerin",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "powerful and practical",
      "text": "This electric tiller is vastly cleaner, safer, and easier to use than a gasoline fired tiller. It has plenty of power even for chopping through roots to prepare ground for plantings. The fumes and noise of a gasoline engine are NO issue with this plug in and so much easier on everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "John Connely",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "No power",
      "text": "This does not have very much power. If you're simply using this to mix soft compost it's okay but don't expect this to actually till up soil.",
      "rating": 1.0,
      "verified": true,
      "author": "andrew t.",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Nice tool for the yard.",
      "text": "This tool is excellent For the price, I used it around coconut stumps and it cut through thick roots with no problem, save from me a lot of work and time. Well worth the money!",
      "rating": 4.0,
      "verified": true,
      "author": "Seahorse",
      "helpful_votes": 0,
      "publication_date": 20161016
    },
    {
      "title": "OK for light work.",
      "text": "Ok for lightweight work. Don't let the weeds get too big before you use this. Need cleaning out of the weeds often, but pulling the tines off, makes that pretty painless.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Johnson",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "Good light job tiller",
      "text": "Tested it out in a new planting bed. It handled small rocks and roots without jamming. Tilled easily to about 4or 5 inches. It does hop a bit since it is light. The light weight makes it easy to work and transport.",
      "rating": 5.0,
      "verified": true,
      "author": "Terri",
      "helpful_votes": 5,
      "publication_date": 20150630
    },
    {
      "title": "It works it the price is right,,, it's not a mantis",
      "text": "It's no mantis. , But for the price, it does a decent job. It's a bit slow. But the soil I have is hard. Seems slightly underpowered.",
      "rating": 4.0,
      "verified": true,
      "author": "SHADETREE PREACHER ",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Great tool, job well done!",
      "text": "This product did just what it was meant to do, I used it for mid summer and early winter yard projects.",
      "rating": 4.0,
      "verified": true,
      "author": "Donwars",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Light gardening",
      "text": "This works well for tilling the soil in your garden. I wouldn’t recommend this on compacted soil! But it’s lightweight and easy to use!",
      "rating": 4.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Little Green Giant",
      "text": "I purchased this to use in my 15'x15' vegetable garden. It is easy to assemble, powerful, easy to handle and very compact in size. For light residential use this is the perfect solution. I was able to till my garden 6 inches deep in about 15 minutes. The variable depth settings also allowed me to till some bare areas in my lawn and seed. Great value for price paid and does what it is designed to do. No complaints here!",
      "rating": 5.0,
      "verified": true,
      "author": "gm4ever",
      "helpful_votes": 0,
      "publication_date": 20170529
    },
    {
      "title": "veggie time",
      "text": "This tiller was better than expected. Very strong. Easy to use. The electric on switch is better than the pull pull pull of the gas engine. Not great for going through sod but great on previously tiller areas.",
      "rating": 5.0,
      "verified": true,
      "author": "D. A. Lovell Sr.",
      "helpful_votes": 21,
      "publication_date": 20140511
    },
    {
      "title": "Terrific little machine!!!",
      "text": "Was leary of how an electric tiller would work but it was a very pleasant surprise!!! Tiller my garden in on waa afternoon! Had to take many breaks as I have MS and heat really affects what I can do!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "it is pretty strong and apparently durable",
      "text": "for a lightweight, electric tool, it is pretty strong and apparently durable. tears up sod and underlying sandy dirt with some ease. good investment. easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Greene",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Light use ONLY",
      "text": "It's too light, so it's VERY hard to dig into normal, compacted soil. I find that it works much better when pulled backward, but it's very exhausting since the unit has a natural forward self-propulsion due to the spinning tines.",
      "rating": 3.0,
      "verified": true,
      "author": "kohein",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Easy to assemble and clean",
      "text": "Easy to assemble and clean. Good power and can handle some bush roots as well as some moderate sized rocks. Can be slightly tricky to handle on an incline (used it only on an incline though).",
      "rating": 4.0,
      "verified": true,
      "author": "Wissam Deeb",
      "helpful_votes": 0,
      "publication_date": 20160531
    },
    {
      "title": "Tough Little Tiller",
      "text": "This little machine kicks some butt! My garden had not been tilled in a couple of years and had the feel between clay and cement. This machine tore right through it. It takes a little bit to get used to but once you do, it works like a bull.",
      "rating": 5.0,
      "verified": true,
      "author": "christine16",
      "helpful_votes": 0,
      "publication_date": 20170512
    },
    {
      "title": "REVISED THUMBS UP REVIEW",
      "text": "Updating a previous review criticizing Greenworks. They got in touch with us and followed up to resolve our issues, sending us a new tiller in a timely fashion at their expense. We are grateful for their good customer service and the Tiller works beautifully! Thank you Greenworks.",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Small but packs a punch",
      "text": "This goes through dry hard packed rocky clay soil like nothing. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bankergirl71",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Gets the job done",
      "text": "Easy to put together and use. I’ve used it three times in my yard.",
      "rating": 5.0,
      "verified": true,
      "author": "JKS",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "Awesome tiller for the money",
      "text": "This tiller worked better than I imagined! I have about 180 sq ft of raised bed garden to which I added about 1 1/2 cu yards of compost and 24 bags of garden soil, manure and humus. I dreaded the thought of hours of turning with a pitch fork. So the day this tiller arrived, I put it together in about 20 minutes and had the entire garden tilled in under an hour. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Nuckles",
      "helpful_votes": 0,
      "publication_date": 20170417
    },
    {
      "title": "Five Stars",
      "text": "Love this tool. Does the work easily for tight spaces.",
      "rating": 5.0,
      "verified": true,
      "author": "husband",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "Five Stars",
      "text": "Works Good in this old southern clay ground! I was surprised for an electric.",
      "rating": 5.0,
      "verified": true,
      "author": "rushcowski",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "I recommend it",
      "text": "Works great. I'm glad I bought it. Initially I purchased a battery powered and it was not effective, but this is. I had to buy a long extension cord but most people need a good outdoor extension cord anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "GET",
      "helpful_votes": 3,
      "publication_date": 20140803
    },
    {
      "title": "work horse. only issue is the crummy pin that ...",
      "text": "work horse. only issue is the crummy pin that holds the wheels on is buried some where in the garden. I put in a cap screw and jam nut.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20150424
    },
    {
      "title": "Works good so far",
      "text": "Works good so far. Noticed that it gets extremely hot in the transfer case, so I try to give it a break every 10 minutes. I knew it was going to be light, but I can really only use it by pulling it backwards",
      "rating": 4.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 3,
      "publication_date": 20150517
    },
    {
      "title": "Did not last me a full day.",
      "text": "6 hours into use, the engine will not longer push the tines through the soil. Unless you have pretty soft soil to begin with, I recommend going with a power tiller with a higher amp motor.",
      "rating": 2.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Ok",
      "text": "Gooe buy, wish i had the chordless but didn’t want to pay $125 more for a part time tool",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Bounds",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "I LOVE IT!",
      "text": "I WAS EXITING TO HAVE THIS MACHINE TO HELP ME. WHAT I WISH TO HAVE IS THE CABLE PROTECTION, SINCE I BROKEN MY CABLE THE SECOND TIME I USE IT. IT WAS COMPLETELY MY FAULT, BUT IF THERE WAS SOMEWAY TO PROTECT IT, WILL BE EVEN BETTER.",
      "rating": 5.0,
      "verified": true,
      "author": "YVETTE",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Light Duty",
      "text": "Works well considering price. You wouldn't want to do extensive work with this. I tilled 300 sq ft area to plant new seed. It was fine.",
      "rating": 4.0,
      "verified": true,
      "author": "JD-BoilerUp",
      "helpful_votes": 0,
      "publication_date": 20170611
    },
    {
      "title": "works great",
      "text": "If u have a small garden, this is what u want,,,",
      "rating": 5.0,
      "verified": true,
      "author": "poniexp",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Just What the Doctor Ordered to Save Back from Digging Flower Beds!",
      "text": "Just what I needed to save my back when turning soil to plant new flower beds. Lots of power.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike's America",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Love it!",
      "text": "I just have a really tiny garden since it's just me. And I live in NC where the ground can get as hard as concrete. But this thing was perfect! EXACTLY what I needed! I wish I had gotten one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret McArdle",
      "helpful_votes": 2,
      "publication_date": 20150612
    }
  ],
  "product_meta": {
    "title": "Greenworks 10-Inch 8 Amp Corded Tiller 27072",
    "description": "Green Works NEW 8 Amp AC Cultivator delivers powerful and efficient results with (4) 8-inch forward rotating tines, adjustable tilling width of 8.25-inch to 10-inch and up to 5-inch of tilling depth making gardening easy and fun.",
    "rating": 4.4,
    "feature_bullets": [
      "Powerful 8 Amp Motor for reliable results with an easy electric start eliminates the need for mixing gas and hard to manage recoil cords",
      "(4) 8 inch forward rotating tines for highest performance when digging into earth",
      "Adjustable tilling width of 8.25 inches to 10 inches for quick reliable tilling; Assembly details: Assembly required, no tools needed",
      "Adjustable tilling depth, up to 5 inches offers the versatility to dig for the right planting depth",
      "Handle folds down for simple and convenient storage and transportation"
    ],
    "specifications": {
      "Product Dimensions": "33 x 15 x 15 inches",
      "Item Weight": "29.3 pounds",
      "Manufacturer": "Sunrise Global Marketing, LLC",
      "ASIN": "B00D3KJN3O",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "27072",
      "Customer Reviews": "4.4 out of 5 stars483 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#110,625 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Tillers",
      "Outdoor Power Tools",
      "Garden & Outdoor"
    ],
    "price": 149.0
  }
}