{
  "website_summaries": [
    {
      "verdict": "With the same active ingredient as Zyrtec, this cost-effective solution provides 24-hour allergy relief for an entire year.",
      "pros": [
        "Those who have to take allergy medication all year long are thrilled with the price of this option",
        "Works as well as the brand name",
        "Contact lens wearers can wear lenses comfortably using this medication"
      ],
      "cons": [
        "May experience some drowsiness",
        "Verify expiration date before purchase"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Works",
      "text": "I am very luck as I I only need these during the pollen season, I only need/have to take these during the new blooming season. I used to get bronchitis very bad during pollen season and I learned that allergy pills keep that from happening. I needed to get some more and the worked very well for me.. Sorry for those who need year round pills but I am a very happy camper, now that our season is over,",
      "rating": 5.0,
      "verified": true,
      "author": "M. Monical",
      "helpful_votes": 2,
      "publication_date": 20200506
    },
    {
      "title": "Go farther",
      "text": "With Covid-19, need to keep the congestion under control at least I read. So I take the name brand version every day which gets costly. These seem just as effective so far and I get more for the same amount. Similarly small size pill, no test. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Hesed2020",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Easy to swallow, effective, no side effects",
      "text": "I have taken it for a few weeks and each pill stops my daily hives/itch for about a day. Did not make me feel sleepy and I did not have any side effects at all. A much affordable option with the same results",
      "rating": 5.0,
      "verified": true,
      "author": "Jaewonywon",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Exactly what I needed",
      "text": "I was using Zyrtec, which was expensive but necessary. This product works really well for me. It comes with so many tablets for half the price. I will definitely keep using this product and would purchase it again.",
      "rating": 5.0,
      "verified": true,
      "author": "TheGlossBoss",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Good Zyrtec Alternative.",
      "text": "A very good inexpensive alternative to Zyrtec. I have a rare condition that causes hives to appear on my skin, and these really help reduce the inflammation of my hives. I ended up buying the 365-count after this ran out because it is inexpensive compared to Zyrtec.",
      "rating": 5.0,
      "verified": true,
      "author": "On Go",
      "helpful_votes": 2,
      "publication_date": 20161225
    },
    {
      "title": "Excellent!.",
      "text": "The product is superb. I would recommend to my friends.",
      "rating": 5.0,
      "verified": true,
      "author": "krank",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Works great at a good price",
      "text": "Seems to work as well as name brand at a fraction of the cost",
      "rating": 5.0,
      "verified": true,
      "author": "sle2115",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "I gobble these up like cocaine tablets",
      "text": "Works for me. No side effects, like jumpy legs or numbness.",
      "rating": 5.0,
      "verified": true,
      "author": "kez panel project",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Not worth it.",
      "text": "I tried to save money with this this but sadly it just doesn’t work. My seasonal allergies were just as bad as without.",
      "rating": 1.0,
      "verified": true,
      "author": "Dominic Blesso",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Made me super Drowsy!",
      "text": "This is like benadryl to me! I was out-of-it all day and super drowsy. If you are sensitive to Benadryl making your drowsy, then this might give you the same feeling.",
      "rating": 2.0,
      "verified": true,
      "author": "MooreFam",
      "helpful_votes": 2,
      "publication_date": 20170905
    },
    {
      "title": "Doesn’t work. Get the real stuff instead",
      "text": "Doesn’t work. Get the real stuff at the drug store.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Good value and convenience through Amazon",
      "text": "My husband and I have taken daily cetirizine Hcl Oct products for years to battle seasonal allergies. The subscribe & save price plus the convenience of home delivery made this our new choice for this product. Good value and convenience through Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Burleson",
      "helpful_votes": 0,
      "publication_date": 20140707
    },
    {
      "title": "Two Stars",
      "text": "This didn't work for me, that does not mean it is the products fault.",
      "rating": 2.0,
      "verified": true,
      "author": "Kenneth P.",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Great product",
      "text": "Works as good as the brand name but for lesser price. I'm pleased and will buy again when I need more.",
      "rating": 5.0,
      "verified": true,
      "author": "Moonear",
      "helpful_votes": 0,
      "publication_date": 20170609
    },
    {
      "title": "Does not work like!!",
      "text": "Does not work! Tried for few days not working at all and very short-dated product.",
      "rating": 1.0,
      "verified": true,
      "author": "Dan W.",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Works Great!",
      "text": "Same effect as the expensive brands out there. Worked great for me. I highly recommend. Will buy the one that has more pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Home",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Helps My Wife's Allergy Problem...",
      "text": "My wife takes these for her allergy problem, and for her they work just as well as Zyrtec... and at a lower price.",
      "rating": 5.0,
      "verified": true,
      "author": "Wild Bill",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Five Stars",
      "text": "These do the job for my allergies and the price is right!",
      "rating": 5.0,
      "verified": true,
      "author": "Carol H.",
      "helpful_votes": 0,
      "publication_date": 20170929
    },
    {
      "title": "Great price, and work great!",
      "text": "Cheaper than getting at costco, and work just right for the husband.",
      "rating": 5.0,
      "verified": true,
      "author": "hello_hollo",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great Buy",
      "text": "This brand has worked the best for our family. Will buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200513
    },
    {
      "title": "Great for allergy sufferers!",
      "text": "Works great! Keeps my head and nasal passages clear all day!",
      "rating": 5.0,
      "verified": true,
      "author": "K..B.",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Just like zyrtec!",
      "text": "I have indoor allergies(dust mites, ugh), these work just as well as name brand!",
      "rating": 5.0,
      "verified": true,
      "author": "MLK77",
      "helpful_votes": 0,
      "publication_date": 20160623
    },
    {
      "title": "Went back to Zyrtec and feel much better.",
      "text": "Was hopeful that this would work for me since it's cheap and available by subscription. Used it for a couple of weeks and found it barely helped whatsoever, including an absolutely brutal Memorial Day weekend. Went back to Zyrtec and feel much better.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170605
    },
    {
      "title": "works well",
      "text": "It works well and the price is right good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "mike",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Great every day med for common seasonal allergies",
      "text": "Really helps me breathe! Great every day med for common seasonal allergies.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 0,
      "publication_date": 20171203
    },
    {
      "title": "Tic Tac strength",
      "text": "These pills must be a placibo bottle because my allergies are actually worse while taking them. I never had such bad allergies. I will need to take a benedryl on top of this 24 hour tablet which has the effectiveness of tic tacs. i took this pill for the second time, (like a n idiot) at 11 a.m.. It is now 9p.m. and I have not one straight minute of relief.",
      "rating": 1.0,
      "verified": true,
      "author": "Knucklehead",
      "helpful_votes": 2,
      "publication_date": 20160916
    },
    {
      "title": "it's all about price...",
      "text": "what is there to say about a product that is a copy of a more expensive product sold in stores? i saw this product on amazon, i needed a refill, i was ordering other stuff so i included this with my current order and got it sent free of charge. that really doesn't say much about the product because it was purchased because of the price and convenience!",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne francis thomas.",
      "helpful_votes": 0,
      "publication_date": 20140209
    },
    {
      "title": "Same as Zyrtec",
      "text": "I hesitated buying this because it’s generic, but I needed it next day and Zyrtec wasn’t available next day. I’ve found no difference in the product. It works the same for a lot less money. I’m pleasantly surprised!",
      "rating": 5.0,
      "verified": true,
      "author": "Jaxenfeld",
      "helpful_votes": 0,
      "publication_date": 20200602
    },
    {
      "title": "Great for Mild Seasonal Symptoms",
      "text": "I buy these every year to prevent allergy symptoms. No need to buy the big box brands of you only have mild seasonal symptoms.",
      "rating": 5.0,
      "verified": true,
      "author": "Madless",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Highly Effective at a Good Price",
      "text": "I tried PE type product but THIS is what I needed for my cold and allergy symptoms. WOW effective and long lasting at an affordable price point. This is a 24 hour, one pill formula. THANK YOU also for splendid FAST shipment of my order. WOW.",
      "rating": 5.0,
      "verified": true,
      "author": "Cyn1492",
      "helpful_votes": 2,
      "publication_date": 20161224
    },
    {
      "title": "Works just like the name brand",
      "text": "Why pay for the name brand when these work just as well, if not the same?",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah BoughterTop Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "did not work of my dog.",
      "text": "did nothing for my dog. she still chews her paws.",
      "rating": 1.0,
      "verified": true,
      "author": "Toney P.",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Okay, Not the Best",
      "text": "Works okay. Not the best. Doesn't last all night to reduce congestion",
      "rating": 3.0,
      "verified": true,
      "author": "Sandi of Oregon",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "It works",
      "text": "Sometimes even more than a day. I can love my cats again",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Works just as good as Zyrtec",
      "text": "Saved so much money instead of buying Zyrtec. Was originally skeptical, but so happy I purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "C. C.",
      "helpful_votes": 2,
      "publication_date": 20171009
    },
    {
      "title": "Worked very well for me",
      "text": "These Allergy tablets worked as well for me as the 'name' brand did. The price is much more competitive and a lot cheaper that the ones I bought at the corner drug store.",
      "rating": 4.0,
      "verified": true,
      "author": "Tony from Florida",
      "helpful_votes": 0,
      "publication_date": 20170515
    },
    {
      "title": "I thought that this brand was a great value! The price for what you get is ...",
      "text": "I thought that this brand was a great value! The price for what you get is impressive. My husband has been taking them for 3 weeks and is happy with the allergy relief they provide.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161025
    },
    {
      "title": "Works just the same and the name brand only much ...",
      "text": "Works just the same and the name brand only much more affordable. I've used these for years and always reorder.",
      "rating": 5.0,
      "verified": true,
      "author": "R",
      "helpful_votes": 0,
      "publication_date": 20151214
    },
    {
      "title": "Generic Zyrtec.",
      "text": "Works just the same a rx Zyrtec, but far less expensive.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Gilmore",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Four Stars",
      "text": "Works a lot better than Clariton for me ... and a lot cheaper!!",
      "rating": 4.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Perfect",
      "text": "These work just as well as Zyrtec for literally 1/8 of the price!",
      "rating": 5.0,
      "verified": true,
      "author": "VBlady4404",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Goodsense All Day Allergy",
      "text": "The stuff works. Saved me a load of money compared to what a similar product at Walgreen's costs. This review is legitimate, not paid for in any way.",
      "rating": 5.0,
      "verified": true,
      "author": "Trinitron212",
      "helpful_votes": 0,
      "publication_date": 20170330
    }
  ],
  "product_meta": {
    "title": "Goodsense All Day Allergy, Cetirizine Hcl Tablets 10 Mg, Antihistamine for Allergy Relief, 45 Count",
    "description": "Cetirizine hydrochloride tablets, 10 mg active ingredient is cetirizine hydrochloride, 10 mg, an antihistamine approved for the treatment of both indoor and outdoor allergy symptoms. One dose of cetirizine hydrochloride tablets, 10 mg works for a full 24 hours.\n\ncetirizine hydrochloride tablets, 10 mg is approved to temporarily relieve indoor and outdoor allergy symptoms in adults and children 6 years and over.",
    "rating": 4.7,
    "feature_bullets": [
      "Allergy medicine: goodsense all day allergy Temporarily relieves symptoms due to hay fever or other upper respiratory allergies: runny nose; sneezing; itchy, watery eyes; itching of the nose or throat.",
      "24 hour symptom relief: one dose of all day allergy cetirizine hydrochloride 10 mg provides all-day allergy Relief for indoor & Outdoor Allergies, and 24 hour relief of: sneezing; runny nose; itchy, watery eyes; Itchy throat or nose.",
      "Original Prescription Strength: Goodsense All Day Allergy Cetirizine Hydrochloride 10 Mg, Is an Allergy Medicine Approved to Temporarily Relieve Indoor and Outdoor Allergy Symptoms in Adults and Children 6 Years and Over.",
      "Active Ingredient: Compare to the Active Ingredient in Zyrtec. The Active Ingredient in Goodsense All Day Allergy Is Cetirizine Hydrochloride 10 Mg, an Antihistamine Approved for the Treatment of Both Indoor and Outdoor Allergies.",
      "Adults & Children 6 Years and Over: Take One Tablet Once Daily; Do Not Take More Than One 10 Mg Tablet in 24 Hours. A 5 Mg Allergy Relief Product May Be Appropriate for Less Severe Symptoms. Read Package for Full Directions Before Use."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.69 x 1.63 x 3.25 inches; 1.13 Ounces",
      "Item model number": "1795026",
      "Date First Available": "June 25, 2013",
      "Manufacturer": "Good Sense",
      "ASIN": "B00DJOWTUI",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item is not eligible for international shipping.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "OTC Medications & Treatments",
      "Health & Household",
      "Allergy, Sinus & Asthma",
      "Allergy Medicine",
      "Health, Household & Baby Care"
    ],
    "price": 8.61
  }
}