{
  "website_summaries": [
    {
      "verdict": "Fun twist on simple tic-tac-toe game that young kids will love to play over and over.",
      "pros": [
        "Simple game that works well for ages 6 and up, but that also offers some strategy to keep older kids engaged",
        "Fast game play keeps kids entertained",
        "Sturdy plastic results in a good build quality for an inexpensive game",
        "Includes new feature to remove one disc at a time for a new game option"
      ],
      "cons": [
        "Really only works for two players at a time with no solitaire option"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "There's A Good Reason It's A Classic",
      "text": "Anyone can play it. It's ready to go out of the box. You can play for minutes or an hour. Losing a disc somewhere under the couch isn't the end of the world. Kids different ages can still play with each other. This is an essential go to the toy closet sort of item. I was afraid a new one like this might be cheaper feeling or flimsier than the older ones, but was pleased to see that while it won't survive really rough handling the toy is durable enough for normal little kid play.",
      "rating": 5.0,
      "verified": true,
      "author": "Pop Bop",
      "helpful_votes": 30,
      "publication_date": 20190126
    },
    {
      "title": "CONNECT 4 WAS A HUGE HIT WITH MY 7-YR-OLD GRANDDAUGHTER :) She beat my pants off",
      "text": "OK, This one was the biggest hit of all. Of course, she beat the pants off of me but had a great time doing it. Grandparents beware - your little grandchildren love playing games and they are good at it. My 7-yr-old granddaughter can play me like a fiddle and beat my butt on Connect 4. Finally after beating me time after time, she admitted that one of her pre-school teachers had taught her game strategy on winning in this game and she took pity and tried to teach me some of her tricks. :) Gotta love the little children.",
      "rating": 5.0,
      "verified": true,
      "author": "DobieOne",
      "helpful_votes": 24,
      "publication_date": 20170822
    },
    {
      "title": "Great learning tool for toddlers.",
      "text": "I really loved Connect 4 when I was a kid. Then I bought this for my 3 year old and 1 year old. Although they are not playing by the rules, putting the discs into the slot keeps them busy. It's also a good tool to teach colors and counting as well as learn about taking turns. A+ plus in my book.",
      "rating": 5.0,
      "verified": true,
      "author": "shopgirl",
      "helpful_votes": 38,
      "publication_date": 20160927
    },
    {
      "title": "A Fun Classic Game",
      "text": "I bought this to relive my childhood memories back in elementary school, but also to teach my nephews how to play Connect 4. It's so fun and easy to learn. I am a cynical uncle by making my nephews eat the Beanboozle Jellybeans if they lose (which is 98% of the time). Other than that, very quick, easy, entertaining, and builds strategies for young children where their brains are still developing via the Connect 4 game (probably not the jellybeans part).",
      "rating": 5.0,
      "verified": true,
      "author": "RedPanda",
      "helpful_votes": 13,
      "publication_date": 20180725
    },
    {
      "title": "What's Not to Love with this Classic?",
      "text": "This is the same classic game that I played when I was a kid, and now I can play it with my children! The goal is the same--to get four colors in a row. At first my children struggles with predicting where a player might go next, but after playing with it for a while, they've really started to get the knack for it. It has helped them to develop critical thinking skills. We got the game at Christmas, and it's now eight months later and they still pull it out to play all the time. I think this one will be a keeper.",
      "rating": 5.0,
      "verified": true,
      "author": "Teacher, Mom, 40-Something",
      "helpful_votes": 19,
      "publication_date": 20160819
    },
    {
      "title": "Incredibly poorly made",
      "text": "This game came with legs and a bottom slider that need to be twisted out of a plastic frame. The pieces didn't fit together well, and the bottom piece fell off immediately when my kids tried to use it. When they tried to snap it back on, the pieces broke off. Really, really junkie. I do not recommend which is too bad, because the game concept is nice.",
      "rating": 1.0,
      "verified": true,
      "author": "JadeVictoria",
      "helpful_votes": 3,
      "publication_date": 20190508
    },
    {
      "title": "Missing piece makes it UNUSABLE/impossible to play",
      "text": "Purchased for an 'afterschool' program this arrived in summer and was not opened until now, September 3. Disappointing in that one of the pieces of the frame is missing and the chips that make the game fall right on through the spaces to the table that supports it. I have attempted to ask for a replacement, but evidently it's been too long. All of my other purchases were terrific! Just this one was a bust.",
      "rating": 1.0,
      "verified": true,
      "author": "ilearner",
      "helpful_votes": 2,
      "publication_date": 20190903
    },
    {
      "title": "Just as I remember",
      "text": "I purchased several \"classic\" board games to introduce to my 5 yr old. She really enjoys tic-tac-toe so I knew she would like Connect Four. The game pieces and frame are plastic, the legs are detachable for storage back in the box, hopefully they are sturdy enough to withstand play from both the 5 yr old and 2 yr old. Their favorite part of the game is at the end when you release all the stacked pieces from the slide in the bottom.",
      "rating": 5.0,
      "verified": true,
      "author": "Minh N",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Just like I remembered it, but flimsier.",
      "text": "It's a fun game, you can really go a marathon with it, but the vertical game housing doesn't allow all the pieces to fall when trying to clear the board and you have to wiggle it around and shake them out. Only happens in one channel of the game board, I've looked closely at it, doesn't seem to have any burrs on the plastic, perhaps it was just molded bad. I remember playing this game decades ago, but I don't recall the game board being this flimsy. It just feels cheap and feels like it could break easily. All in all a fun game, but it's becoming clear that \"they just don't make them like they used to.\"",
      "rating": 4.0,
      "verified": true,
      "author": "The consumer's voice",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Sliding bar breaks easily.",
      "text": "The bottom bar broke within a month of getting this for my son. I was really disappointed. I've tried to glue it back together, but surprise, surprise, that doesn't work. I wish that sliding bar was made better and not so easy to break.",
      "rating": 1.0,
      "verified": true,
      "author": "guitarchick",
      "helpful_votes": 8,
      "publication_date": 20171128
    },
    {
      "title": "Buy a different set if possible!",
      "text": "When assembled, the game won't fit in its box. This makes no sense, since it's clearly a game primarily aimed at young children--if both players play perfectly, as in Tick-Tac-Toe, it's always a draw. My 8 year-old never loses! Game also says adult assembly required. So the game maker expects a parent to put it together and take it apart every time, which is ridiculous since if they'd spent a few extra cents on a larger box, the problem would not exist. Called their customer service number and asked for a suitable box, but not only was turned down but the lady acted as though expecting the game to fit in its storage box was silly!",
      "rating": 2.0,
      "verified": true,
      "author": "Quipper",
      "helpful_votes": 0,
      "publication_date": 20200904
    },
    {
      "title": "Family Favorite—Fun & Educational",
      "text": "Connect 4 is a longstanding family favorite. I’ve picked up where my mom left off with our own grandkids. She used to bring her set every single time she visited us. So easy to pack it in her suitcase (the maker should consider selling a deluxe version in its own carrying case). It’s one of our kids’ best memory of Grandma. It’s inexpensive, especially when you consider the educational benefits from a game that’s not only engaging and usable by a wide range of ages, but will teach logic and thinking skills. Add this to your family game cupboard and you’ll soon see it’s value.",
      "rating": 5.0,
      "verified": true,
      "author": "Aardvark",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "A great fun game for all ages.  Passed from one generation to another, the fun never leaves!",
      "text": "Connect four! I played this game as a child. I played this game with my children. Now I play this Game with my grandchildren! It is such fun. Easy, not a lot of cards, a playing board you have to hold still, and a simplicity that even a three or four year old can understand. The price on this game was a bargain. It seems as though Grampa has been playing it non stop since it got here. The con is traveling! This is too big of a game, unless it is like for a camper to use in a car. Other than that, the Game is perfect for our family and passed down through the generations!",
      "rating": 4.0,
      "verified": true,
      "author": "Hope❤️",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Always loved the Connect 4 game since I was a kid ...",
      "text": "Always loved the Connect 4 game since I was a kid myself! However, the quality of the game was a little cheap and not what I recall having as a child as it kept falling apart often after dropping a token in or at the end of the game when you let the tokens out. Somewhat of a nuisance therefore not interested in playing too often with my grandchildren. Otherwise, it arrived in a timely fashion and was well packaged.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170902
    },
    {
      "title": "A fun classic game",
      "text": "It seems there aren't a lot of games I like that can be played with only 2 players, but Connect 4 is one that can! I played this with my family and friends when I was a kid and wanted to get this again to keep at my mom's house because it is a simple to play, yet fun game that my mom wouldn't have to learn how to play again. It is nice to do something other than watch tv all the time, so I have been looking for more games. This was a great start and under $8.00 was a great price! So nice to see that some of the old classics are still popular today!",
      "rating": 5.0,
      "verified": true,
      "author": "LuckyLiz",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Cheap garbage",
      "text": "I wanted to get this for my kids as it is a classic game from my youth. The original one I had in the 80s, I must have played with 500x, no problems. I'm sure if I could find it at my dad's house, it would still be fine. This piece of crap broke in 1 day! 1 day! It felt flimsy from the beginning and the slider broke and cracked just from a few plays. Are people actually reviewing the quality of this game or the game itself? It may be a great classic game but this actual version of it can't possibly be getting legit 5 star reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "Yakov G",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "My turn!",
      "text": "Although, we have not been able to play the game as intended, it has been fun. My grand children 5yrs, 3yrs and 10 months are fascinated by the game. It is usually the first game they choose. Eddy, 3year old, plays to win by getting his color to the last place at the top. I have been able to teach him the concept of \"taking turns\" and \"no cheating\". It is fun and I am glad that I bought this game.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 6,
      "publication_date": 20160928
    },
    {
      "title": "If you played it as a child, you shouldn't be surprised when you open this box.",
      "text": "What makes this game fun? Let me hit some highlights for you..... It's been the same for 40+ years... that's right it doesn't induce rage like monopoly. You can teach your preschooler how to play. You can play on game night with your friends after drinking. You don't have to remember to yell \"UNO\" although if you wanted you could make it interesting by yelling \"cuatro\" I'm still working on the win to loss ratio for beating my preschooler. He needs to learn he doesn't get to win all the time. Overall, it's what I expected and arrived in good condition.",
      "rating": 5.0,
      "verified": true,
      "author": "JennyJen",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "this is a fun game and a good value for what it is",
      "text": "This game is a classic. I played it when I was a kid, and got this to play with my 4.5 year old daughter. She regularly kicks my ass. Seriously, I don't let her win in any way, but she takes about 70% of the games from me. From a product point of view, it's an inexpensive plastic frame with some plastic chips. There's not much to it. If you treat it badly, it could break... so be careful with it. In the event it does break, there's a neat invention called \"superglue\" that could likely put it back together again. Anyhow... this is a fun game and a good value for what it is. Enjoy!",
      "rating": 5.0,
      "verified": true,
      "author": "Erich",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Great game",
      "text": "Great game. Easy game to learn for my 5 year-old. Ok, sometimes I let him win but help him learn the strategy along the way. This game has a nice box to store it in. Tip: We sometimes set up the game inside the box end so that emptying it does not make a mess of the chips all over the table. My cat sometimes sits in the other box end, lol. Quick assembly before play. A good way to pass the time instead of screen time. Fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama V",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Crappy craftsmanship",
      "text": "This game is very cheaply made. I played it with my 6 year old and twice we had to restart the game bc all the pieces fell out. The piece at the bottom that you slide sideways to release the pieces is loose and slides randomly during the play. Very disappointed",
      "rating": 1.0,
      "verified": true,
      "author": "Kryzzle",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "It's ok",
      "text": "Classic game but has a few issues. First off, when I played as a kid, I'm pretty sure the pieces were black and red not yellow and red. Therefore this does not feel like the old school game I grew up with. Also, the entire game is make of cheap plastic, once again not like the sturdy game pieces I remember from the original. All and all, good game for a good price.",
      "rating": 3.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 5,
      "publication_date": 20170105
    },
    {
      "title": "So much fun....we had to get two!",
      "text": "My four y.o. grandson loves this game so much - we had to buy two.....one for my house and one for home to play with mom and dad. Excellent visual learning game - teaches how to strategically place your pieces. This kid of mine is a SHARK when it comes to games like this. Highly recommend this game - kids don't need to be 6+ to play!",
      "rating": 5.0,
      "verified": true,
      "author": "Hoppie",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Nostalgiac and well built!",
      "text": "This is a great product. I was a little worried that I would receive a cheap knockoff from China, but this it the real thing. Thick plastic, not easily breakable or bendable, and the chip colors will not scratch off.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Harrington",
      "helpful_votes": 16,
      "publication_date": 20170418
    },
    {
      "title": "Much worse than the old version, still very playable and fun",
      "text": "Connect 4 is a classic and the kids love it, but the plastic quality/ overall durability are worse than my childhood set. The legs wobble and checkers are thin and lightweight. You can't dump the board without using your other hand to stabilize it. It is slightly smaller too and the legs feel like they might break after a few dozen assemblies. Unfortunately, this lower level of quality seems to be the case with all the classic games I've purchased over the past few years.",
      "rating": 4.0,
      "verified": true,
      "author": "Susie",
      "helpful_votes": 0,
      "publication_date": 20190818
    },
    {
      "title": "Not sturdy",
      "text": "Cheaply made of plastic. Falls over and I am sorry I gave this as a present!!",
      "rating": 1.0,
      "verified": true,
      "author": "kimberley  Frank",
      "helpful_votes": 5,
      "publication_date": 20180712
    },
    {
      "title": "The best and favorite game for kids and adults!",
      "text": "The game arrived in perfect condition and our kids love playing it. Connect 4 is a game of skill that children and adults have enjoyed for many years. It is the perfect two person game, and kids through teens love the competition, whether at home, school, or family gatherings. Kids love to keep track of their \"wins\" and holding the title of \"current champion.\"",
      "rating": 5.0,
      "verified": true,
      "author": "harmy10",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "I really like Connect 4",
      "text": "I really like Connect 4, but I'd give this particular product three stars because it feels very flimsy. Children aren't likely to care, but I'd recommend a different set if this is the type of thing that bothers you. I've played with another set with this exact box design (which is why I purchased this), but that set was far sturdier. So perhaps I just got one made in a different country/factory, or maybe Hasbro just went with cheaper materials.",
      "rating": 3.0,
      "verified": true,
      "author": "pigeonsalad",
      "helpful_votes": 4,
      "publication_date": 20170208
    },
    {
      "title": "Fun, Exciting Game",
      "text": "This was the perfect gift for my daughters family at Christmas. Their children range in age from four years old to twelve years old and this game was one that everyone could play. The excitement of seeing the pieces slide into place was fun for the younger children and then to slide the bottom to begin another game was just as fun. This game has been around for many years and is just as much fun playing with my grandchildren as it was with my children. It is the exact same game and has not been changed from years ago ~ a fun experience for us all!",
      "rating": 5.0,
      "verified": true,
      "author": "MommaP",
      "helpful_votes": 4,
      "publication_date": 20160213
    },
    {
      "title": "Very disappointed as the side bar broke when taken out",
      "text": "Very disappointed as the side bar broke when taken out, the whole set looks cheaply made. I bought it for a road trip but have to return it. I usually trust Hasbro product, but not this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lil D",
      "helpful_votes": 4,
      "publication_date": 20180329
    },
    {
      "title": "It's Connect 4...",
      "text": "I mean, it's Connect 4. You almost certainly know what you're getting. I had previously purchased a nice wood Connect 4 set, but it had no way to release the checkers - you had to pick it up and turn it over, which defeats a big part of the fun (dropping all the checkers out after you win). This one is cheap and works well. Now if I can just get my 2-year-old to actually follow the rules...",
      "rating": 5.0,
      "verified": true,
      "author": "William Springer",
      "helpful_votes": 0,
      "publication_date": 20191209
    },
    {
      "title": "Good game, absolutely cheap box to store it in.",
      "text": "Absolutely terrible box. Will likely need to replace the box after 2-3 uses. Product quality is good, but games need a solid cardboard box to store them in. This one fails miserably and loses stars. The game otherwise is functional and fun for kids to play. If connect 4 was smart, they would bundle a checkers board with it as the pieces are the same and charge more!",
      "rating": 3.0,
      "verified": true,
      "author": "Native Idaho Nate",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "just for a game",
      "text": "the material quality is not that good but the game it self is really interesting I like it so much but they need to work alot on the material of the game it broke very easy but it still work",
      "rating": 2.0,
      "verified": true,
      "author": "Ahmed Shaffie",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Good enough for the price",
      "text": "The game itself is a classic that can be played with little kids. The build quality is ok but I believe older versions were built better. For the price it does the job. The legs stay in place as long as you don’t plan to move the game around too much after it is built. The token release at the bottom of the game is very snug and takes a little work to move.",
      "rating": 5.0,
      "verified": true,
      "author": "NYCMediaMix",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "thanks",
      "text": "n/a. You know, it was a donation-etc. I think-hope they enjoy it. Thanks-gracias-world peace. Amazon is really great, wonderful, only thing is we still need the discount stores like dollar tree and keeping some kmarts- etc. Anyway thanks so much. Have a safe day. ( Also, more homeless shelters, re-hab/education, and/or re-location programs and jobs.)",
      "rating": 5.0,
      "verified": true,
      "author": "Amy O.",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "SERVES THE PURPOSE",
      "text": "It is okay. Serves the purpose as a decent game, but is definitely not the Connect Four I grew up with. Not nearly as sturdy as the game of old. The locking mechanism at the base used to keep checkers in place constantly gets stuck. As a result, I am sure it will eventually get broken. Nevertheless, it is still a Connect Four game, and has given my children the same fun and entertainment it provided me 35 years ago.",
      "rating": 3.0,
      "verified": true,
      "author": "Hoozier58",
      "helpful_votes": 4,
      "publication_date": 20160623
    },
    {
      "title": "Super fun game, at a cheap price",
      "text": "I love connect 4, It's easy for little ones to pick up or just drop in the chips. This version is very cheap in all ways. The price can't be beat, but it's entirely plastic and definitely not made to last like the original. I've had no issues with the game functioning, it just feels cheap. Great for a quick gift to any kids 2 and up. My 2 year old just likes dropping the chips in and making them line up.",
      "rating": 4.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "An all time favorite game to play that requires you to strategized.",
      "text": "This is an all time favorite game. I was even in a Dave's & Buster recently and they had a wall size version of this game and there was a line waiting to play it. A jumbo version of this game would be really cool. But, as for this game it is fun and challenging for all ages. Easy to assemble, simple to play. This is a game of strategy. I buy games that will build upon coordination skills, etc. So, this game fits right in perfectly. It is basically tic tac toe style of game, but you have to get four in a row rather than three.",
      "rating": 5.0,
      "verified": true,
      "author": "QT",
      "helpful_votes": 3,
      "publication_date": 20160223
    },
    {
      "title": "Durable and fun game for all. We recommend Connect 4",
      "text": "Great classic game that we are happy that Hasbro still makes. It is fun for all ages and compact enough to take with on a trip. Our 4 year old received for Christmas and he loves it and we all play it with him. Durable and well made, love the bright colors. Board games are still the best way to engage with family.",
      "rating": 5.0,
      "verified": true,
      "author": "SCMoose",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Beat up! not able to give as gift now  .. seriously .. Who does this?",
      "text": "Wow- I just received this and the box is beat up! I cannot give this as a gift!!! Plastic torn, box scraped and missing chunks.. plus dirt/ etc inside the plastic.. seriously?!? So - someone picked this off the shelf- thought it looked good , and shipped it out?! Wow- that’s crappy service",
      "rating": 1.0,
      "verified": true,
      "author": "TeeCee",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Chips are not smoothe have wavy edges.",
      "text": "The game chips that came with this game do not match what is shown on the box, instead of smoothe edges these chips had uncomfortable weird wavy edges. Nothing like I expected. I have had other Connect 4 games and none had weird wavy almost jagged edges like these.",
      "rating": 1.0,
      "verified": true,
      "author": "Deskafka",
      "helpful_votes": 2,
      "publication_date": 20181129
    },
    {
      "title": "Great activity for turn taking",
      "text": "I love this game as a simple turn taking activity for my preschool special ed classroom. We don't play by the rules until they are closer to five and better understand. The kids love it but I'd love to see a sturdier version (even it is a little pricer). They rarely last more than a year in the classroom. I also liked the older set up - the slide on the bottom of this one comes off too easily and often has to be put back on! Sitll love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly O",
      "helpful_votes": 3,
      "publication_date": 20160717
    },
    {
      "title": "It looks like something my autistic grandson would enjoy working with",
      "text": "After watching a commercial on TV, I thought my little 5 year old grandson, who has autism, may like to use this. Not as a game, but as amusement. He seems to like to study physical puzzles, just starting to used duplo blocks, so think this might be right up his alley. I could be wrong, but I hope he's going to enjoy this.",
      "rating": 5.0,
      "verified": true,
      "author": "Dianne",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Perfect!",
      "text": "So you might think by my picture I am complaining nope... Sure the pieces end up everywhere but this game distracts my son endlessly. He loves to search for the pieces and put them in, take them out and put them back in! Sure that's not how the game was intended to be played but I call this a win",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200701
    },
    {
      "title": "Very cheap material sadly",
      "text": "I got this game for my kids as they showed interest and connect 4 is such a classic game that we all played growing up. To be honest i expected a solid, robust game but seems things are different now. The platic is super cheap unfortunately even the cardboard is super weak and it broke on the first day. Also there is no way to pack it without disconnecting the sides. Overall it works and kids enjoyed it but i am disappointed how the quality went down dramatically.",
      "rating": 2.0,
      "verified": true,
      "author": "Mikee",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great for teaching \"what happens next\".",
      "text": "My 4-year-old grandson is just now learning how to predict multi-step consequences. Anticipating where each action you take will lead you is an important life skill and he loves it. We can't have it out when \"his babies\" (the 2-yr-old twins) are here so it's a special treat to play Connect 4...which sends X running to the closet where it \"lives\". Nothing like contraband to motivate use!",
      "rating": 5.0,
      "verified": true,
      "author": "MandSWinOK",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Classic Fun!",
      "text": "I LOVED this game when I was younger so when I was thinking of games that my kids might like to try out this summer I thought of this one right away. It is easy to set up and it didn't take my kids (8 & 5) much time to learn it at all. They have a few games now and this one is one of their favorites. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Jaimie",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "So much fun",
      "text": "I have been looking for games for my 3.5 year old to play with him. He picked this up pretty quickly and it’s been a lot of fun to play with him. The quality of the board isn’t the greatest but it isn’t terrible either. It’s perfect for playing with a 3 year old and definitely for the price I paid.",
      "rating": 5.0,
      "verified": true,
      "author": "Sb",
      "helpful_votes": 0,
      "publication_date": 20200116
    },
    {
      "title": "It just doesn't feel like it's going to last through many years of play",
      "text": "I grew up in the 80s-90s and played Connect 4 as a kid. This is not the Connect 4 of my childhood! All of the plastic components are lighter and cheaper feeling. The new chips don't have the same texture as the old ones. The blue chip holder is very light. The box doesn't have a holder for any of the pieces anymore. It just doesn't feel like it's going to last through many years of play. Also, on a personal level, I hate the new box cover. It's trying way too hard.",
      "rating": 3.0,
      "verified": true,
      "author": "Public Name",
      "helpful_votes": 2,
      "publication_date": 20170103
    },
    {
      "title": "It's as fun as you remember...",
      "text": "My old game broke years ago and this one is exactly like it and fun to play. It was easy to put together. (all the pieces are used, I almost threw away the slider to prevent the discs from falling) I put the discs in a baggie, so they aren't lost. (I got one for friends too!)",
      "rating": 5.0,
      "verified": true,
      "author": "Prez",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "Cheap plastic",
      "text": "The game is made of cheap, flimsy plastic. It broke in less than a week. I saved the checkers but the rest was junk. I replaced it with another company’s wooden version. Don’t waste your money.",
      "rating": 1.0,
      "verified": true,
      "author": "Leslie Curtin",
      "helpful_votes": 0,
      "publication_date": 20190922
    },
    {
      "title": "Nice gift",
      "text": "I liked that the price for this product was very reasonable. I bought it for my 4 year old daughter, and she loves it! It’s a nice game for her to be able to play with her older sisters or with everyone as a family taking turns. Would purchase again for a gift for someone else in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaitlyn T",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Great for travel, but damaged box",
      "text": "The game itself seems good, but the cardboard box is thin and was severely damaged in shipping. Not a big deal for me, since it was purchased for our family and will be put in a smaller bag, anyway (the box is huge compared to the game), but if it was intended as a gift, it would not have been presentable.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Howard",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Fun simple game",
      "text": "My wife and I recalled this from our childhood. It went together well, is easy to put in and out of the box and a simple entertaining game for the kids. Best part it requires NO batteries! It is sometimes suprising how much fun the kids can have with a simple game, I admit I wasn't sure they would halt the Xbox or Playstation for it. My ears sure like it when they do. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "Nutsnbolts24",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "I mean, it’s Connect 4",
      "text": "There’s not much else to say. You open the box and assemble the plastic Connect 4 thingy and then play. I was upset that my boyfriend connected 4 before me, but such is life. Sometimes you connect 4, sometimes 4 connects you. You have to disassemble the plastic thingy if you want to store it in the box. So basically everything was as expected. The end.",
      "rating": 5.0,
      "verified": true,
      "author": "G.C.",
      "helpful_votes": 0,
      "publication_date": 20190215
    },
    {
      "title": "Ok, but not like it used to be.",
      "text": "I bought this connect 4 game for my son. He found my old Connect 4 in the closet and really had fun with it. The new one gets the same thing accomplished as mine did from the 80's, but the quality has diminished. These things are very cheaply made. My old one had real checkers and the plastic was thick and durable. This new game has very thin plastic and thin plastic tokens to use instead of checkers. It has held up fine though.",
      "rating": 3.0,
      "verified": true,
      "author": "cd77",
      "helpful_votes": 3,
      "publication_date": 20160501
    },
    {
      "title": "A classic",
      "text": "I grew up playing this game as a child in school and it was a favorite amongst the students. We would always challenge each other and see who would win. We would win prizes sometimes from the teacher. I wanted to bring that fun experience home for my nephews and they love it too!",
      "rating": 5.0,
      "verified": true,
      "author": "Brianne Martinez",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Old Games are the best games",
      "text": "This was a last minute buy because of the price - and because my nieces and nephews love board games. The surprise was when the adults gathered around the table on Christmas Eve to engage in a battle of wits. We had a lot of fun. Best 5 bucks I ever spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Coyote",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "made from cheap plastic",
      "text": "It's the classic game, but the runner along the bottom (to keep the checkers in place) is cheap and broke fairly easily. Not a good toy for a toddler (which is who we got the game for) since they will be rougher than average.",
      "rating": 3.0,
      "verified": true,
      "author": "Keith R. Jones",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Fun, not built for long term durability",
      "text": "The game is perfectly fun, no problem there. Three year old likes it. For the price it's a good product. The plastic frame is light weight hard plastic. Easy to knock over for young players and brittle plastic. So if you're not looking for long term durability, Its great.",
      "rating": 3.0,
      "verified": true,
      "author": "AudaciousMe",
      "helpful_votes": 0,
      "publication_date": 20180916
    },
    {
      "title": "Classic game at a great price...",
      "text": "Classic game at a great price. Easy to set up and play. Easy to tank apart and store. My 5 year old hates it because I refuse to let him win. The only thing I find annoying is that the box isn't quite square. It never fails that when I go to pack it up I end up needing to rotate the lid 90 degrees to get the box closed. No big deal - just thought I would mention that - since there isn't really much else to talk about. It's connect 4 - it works!",
      "rating": 5.0,
      "verified": true,
      "author": "JDC",
      "helpful_votes": 0,
      "publication_date": 20180216
    },
    {
      "title": "Get what you pay for",
      "text": "This is pretty flimsy and difficult to put together which you will have to do every time in order to put it away in its box. Not something I thought about or considered. I've played other sets that were more durable. Disappointed, but it was really inexpensive.",
      "rating": 3.0,
      "verified": true,
      "author": "VSquared",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Classic connect 4, cant go wrong",
      "text": "Classic connect 4, what's not to like? Only 4 stars though because theh obviously thinned everything from the game we had as kids, most noticeably the \"coins\". Nothing wrong with it, all fully functional, just not as high quality",
      "rating": 4.0,
      "verified": true,
      "author": "Simon",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Chips are less quality than old chips",
      "text": "One of my all time favorite games as a kid. Still the same wonderful game. Problem is, the chips look and feel different- they feel cheaper and more flimsy. But it’s still the same game, and brings back childhood memories.",
      "rating": 5.0,
      "verified": true,
      "author": "LANCE",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "Great game",
      "text": "Don't let the little kids play with since the game comes apart in 4 pieces. they broke the slide piece but we makeshifted it to work. The kids can play together and they really enjoy watching them fall out when done.",
      "rating": 4.0,
      "verified": true,
      "author": "Carmen",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "hasbro connect 4 game",
      "text": "heard a lot of bad reviews from old timers like myself. none from me. the product is well designed and works beautifully. lever at the bottom to hold the chips in place worked flawlessly. chips slid down each column with no effort and emptied quickly. all in all, it is a well designed game at a very reasonable price. i'm very satisfied with it and my grand-daughter loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "Theo",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Great classic game!",
      "text": "I had this game as a child and purchased it for my son (age 6) as part of his Christmas gifts. He loves it! It seems a little flimsier than it did when I was a kid, but we have had no problems with it. The best part is that you can play a few games together in a relatively quick time frame. It is nice to be able to spend a little quality time playing a game before dinner on a weeknight. Easy for kids to learn to play, easy set up and clean up and my son thinks it's really fun!",
      "rating": 5.0,
      "verified": true,
      "author": "B. Sanders",
      "helpful_votes": 2,
      "publication_date": 20160205
    },
    {
      "title": "PERFECT GAME NIGHT",
      "text": "I ordered this assuming it would be a cheapy because of the price, turns out it is a goo done!! easy assembly all pieces present. I'm family game night and this is his favorite, granted he insists I make 5 in a row and he makes 4 lol. the overall quality of the game items were much better than I expected and very durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Melody",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Nothing Stays The Same",
      "text": "Played this game in the 80's when I was a kid. This isn't quite how I remember it. This one is cheaply made, and the checkers aren't like they used to be. They are different colors now and look a bit cheesy. Much easier to break than the original from the 80's. A bit disappointed. :-(",
      "rating": 3.0,
      "verified": true,
      "author": "Love4Music",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "A classic! Hard to go wrong",
      "text": "All of the kids I know love this game, and it is simple enough for almost any age to learn and play. And adults have fun with it as well! This a a great classic that I grew up adoring myself as a kid, and should probably be a part of any good children's game collection. Help beat those stay at home blues with Connect Four!",
      "rating": 5.0,
      "verified": true,
      "author": "Joee",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Great game for kids",
      "text": "Bought this game for my 7 and 5 year old, and I love that it’s such an easy game for them to engage in together without assistance. Really good for fine motor skills, creative thinking, and problem solving.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200512
    },
    {
      "title": "Fun with the kids!",
      "text": "We got this for Christmas for my 5 year old daughter and she loves it just as much as I did when I was a kid! We're so happy with our purchase! It's good quality and going to provide tons of family fun for years to come!",
      "rating": 5.0,
      "verified": true,
      "author": "Marylou",
      "helpful_votes": 0,
      "publication_date": 20200327
    },
    {
      "title": "Classic...",
      "text": "We had the small travel version(2 of them) for a long time but I have wanted to get the bigger one for a while. Like it a lot! The travel ones are neat because you can catch the pieces at the bottom and they are stored on the sides but I like the bigger one.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great product, fun for the whole family, great price",
      "text": "I bought this game to use during our monthly game nights and as soon as its arrival has become a great addition to our families game night collection. I am very impressed with how quickly the product arrived at my house and even more pleased with the cost as well! I now often play connect 4 with my niece because this has quickly become her favorite game to play and she loves playing against the other people in our household on a weekly basis. I definately give it 5 stars! Thank you for providing a product that has provided our family hours of fun time and togetherness.",
      "rating": 5.0,
      "verified": true,
      "author": "jayh1528",
      "helpful_votes": 0,
      "publication_date": 20160118
    },
    {
      "title": "Dissatisfied.",
      "text": "My husband inadvertently threw away one of the support pieces, which appeared to be a part of the throw away plastic. Therefore, the pieces fall through. I tried to contact the company by information on the box and internet, wanting to buy a replacement piece, but couldn't get anyone to answer me. Disappointed.",
      "rating": 3.0,
      "verified": true,
      "author": "Joan D. Shupp",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "My students love this game",
      "text": "My students love this game. The younger generation needs to learn to play board games, or games like this one, to help them with thinking outside the box and using strategies to reach their goal. There is too much technology in their lives and they are not thinking for themselves. If technology can't readily give them the information, they usually don't want anything to do with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Nina O. Van Cooney",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "A classic",
      "text": "Very good game. It seems just like the version of the game I had back in the 80s. My son and I started playing this game when he was about 6, and it was good for him to learn a bit of basic strategy. My 2-year-old daughter has taken to playing with it now too. She loves to fill it up with all the little checkers... then watch them all drop when I pull the lever. She just loves it. Great game.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Campisi",
      "helpful_votes": 3,
      "publication_date": 20160205
    },
    {
      "title": "Awesome game",
      "text": "Fantastic game. I love playing with the kids and the kids love it too. I wouldn't recommend it for traveling unless you don't plan to play it until you get to your destination. I think it would be too easy to lose pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Eponine16",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Incomplete packaging by Hasbro",
      "text": "The box was fully sealed from the manufacturer and appeared to be brand new. Once the package was opened for our grandson on Christmas morn, it was discovered the contents of the game was vastly incomplete. Less than half the pieces needed to play were enclosed in the box. Poor quality control Hasbro!!",
      "rating": 1.0,
      "verified": true,
      "author": "Jack Moodie",
      "helpful_votes": 3,
      "publication_date": 20171227
    },
    {
      "title": "So many Pinterest ideas to incorporate",
      "text": "Love the game, but sure miss the product quality. At least this set breaks down easily for storage. Perfect for our family game nights. Love that this game is multi-functional for preschool preschool play - just check Pinterest for some ideas of incorporating math/spelling or other learning into the game.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161011
    },
    {
      "title": "It’s connect 4",
      "text": "This is pretty much your basic connect four game. Its not too big and a little less sturdy than the ones that I used to play with as a kid, however, the price is right for the product. And it is a good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina F.",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Fun!",
      "text": "I bought this for my grandchildren. They love games and they really enjoy this! They are too young to understand the rules, but they enjoy putting the red and yellow \"coins\" in the slots. It is sturdy and easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "pjs",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Classic game lots of fun",
      "text": "The grand kids LOVE this game. Ages 7 and almost 4 and they picked it up quick and they had a blast playing together. Small enough it will travel well and doesn't take up much room in their game closet. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "CMPAZ1951",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Missing a red disc",
      "text": "Just bought this. It arrived with only 20 red disc only and 21 yellow disc. This missing one disc. Otherwise great game. I didn’t want to have to return it. I wish they had options where you can buy more disc",
      "rating": 4.0,
      "verified": true,
      "author": "Pinklinks",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "Grandkids loved  the game",
      "text": "I purchased this game for my 10 yr old grandson. He had never played before. It did not take long for him to figure it out! He had a great time beating just about everyone t the birthday party. Now he and my son play frequently.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Fun Game",
      "text": "It's the classic, fun. The lock that keeps the tiles in place while playing can sometimes get a little stuck, or can sometimes open by a little table shake. A minor thing since it's not most of the time.",
      "rating": 4.0,
      "verified": true,
      "author": "G",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "cheaply made",
      "text": "this was so cheaply made. it will fall apart on you almost instantly. not designed for kids because its not sturdy at all. Not like the old games we used to have. the plastic is too think to hold up.",
      "rating": 1.0,
      "verified": true,
      "author": "WEAPONX",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Good",
      "text": "Young grandchildren put this together and take it apart and put it away every visit. From 2 to 12 it's held up well despite the low cost. It seems flimsy, but it really is just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "BOOKLOVER",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Played same day as delivery. Super fun!",
      "text": "Look we're all stuck inside and getting board. Super easy to set up and literally no rules to the game except you need to get 4 in a row in any direction. It is what it is. So make it fun. Be safe in 2020.",
      "rating": 5.0,
      "verified": true,
      "author": "Terrance",
      "helpful_votes": 0,
      "publication_date": 20200422
    },
    {
      "title": "Fun game",
      "text": "Great old fashioned game! Kids love it, great price! Could be used for travel but it might be a problem when you release the chips at the end of the game, would have to have the stand in the box top to catch the pieces. Better travel games out there.",
      "rating": 5.0,
      "verified": true,
      "author": "l. r.",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "An oldy but a goody!",
      "text": "Same old game, who doesn't like connect 4? I purchased it becuse my son is really into board games and he did not have this one yet. The price was great and I'm sure our family will enjoy it for years to come. Family Game Night Carry On!!",
      "rating": 5.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 0,
      "publication_date": 20191106
    },
    {
      "title": "Fun",
      "text": "Bought this to play with my grandchildren, 9 and 7 years old. We had a lot of fun and they were learning how to look at the big picture and strategize. We alternated players and the one waiting their turn was entertained by watching and thinking about what they would do.",
      "rating": 5.0,
      "verified": true,
      "author": "R. McClellan",
      "helpful_votes": 0,
      "publication_date": 20190526
    },
    {
      "title": "Who doesn’t love connect four?",
      "text": "Remember connect four? I got this for my kids and they love it just as much did. My little man want to play connect four with ma as soon as I get home. I have to admit I love playing it with him too.",
      "rating": 5.0,
      "verified": true,
      "author": "cosmo",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "I Love This Game",
      "text": "Talk about simple to learn but a lot more strategy than one would think to win. I told my wife to take this game with her for a weekend with her girlfriends. She laughed at me but took it. It anyway. It was the hit of the weekend. Her friends had so much fun playing it they all bought one when they got home. Great for entire family.",
      "rating": 5.0,
      "verified": true,
      "author": "MeteorMik",
      "helpful_votes": 0,
      "publication_date": 20180906
    },
    {
      "title": "An adult version tic tac toe",
      "text": "Sooooo much fun! Friends and family cant stop playing any time anyone is over. The simplicity yet mild concentration & intelligence needed for this makes it a perfect game for everyone at any mood.",
      "rating": 5.0,
      "verified": true,
      "author": "HonestReviews101",
      "helpful_votes": 0,
      "publication_date": 20200624
    },
    {
      "title": "Easy to play",
      "text": "This is a good game to play with a child. It is simple in its concept. Each player drops the chips into the slots in an effort to have four in a row vertically, horizontally, or diagonally, while also placing chips to stop the opponent from achieving the connection. Bought this for my grandkids to play.",
      "rating": 4.0,
      "verified": true,
      "author": "The Godfather",
      "helpful_votes": 3,
      "publication_date": 20160824
    },
    {
      "title": "Fun game that adults can enjoy too.",
      "text": "My son and I love connect four. It’s a two player game, where the player who gets 4 of their color checkers in a row first-wins. It’s a pretty quick game so it keeps kids entertained. It’s on the top of our list on game night.",
      "rating": 5.0,
      "verified": true,
      "author": "Shop4deals",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Connect 4",
      "text": "What can I say about this game? I loved it growing up (Master level) and now my son does too! I have many board games at home & every Saturday is game night. Connect 4 is a way to simulate the brain as well! Welcome to the family connect 4!",
      "rating": 5.0,
      "verified": true,
      "author": "Igneyris",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Classic game for a reason, everybody loves playing",
      "text": "Classic game, easy for kid's of any age to lrarn. Or even if they are too young to actually play it's great fine motor work for really little ones to put the pieces into the game and fill up the board.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Pavon",
      "helpful_votes": 0,
      "publication_date": 20200607
    },
    {
      "title": "2 yo cant stop playing it",
      "text": "My 2 yo loves this. He loves dropping the pieces in. It's a very easy game to playing with a toddler to teach them to count (connect 1, 2, 3, 4!). We have to hide it otherwise he would insist that we play it non stop.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200111
    }
  ],
  "product_meta": {
    "title": "Hasbro Connect 4 Game",
    "description": "Challenge a friend to disc dropping fun with the classic game of Connect 4! Drop your red or yellow discs in the grid and be the first to get 4 in a row to win. If your opponent is getting too close to 4 in a row, block them with your own disc! Whoever wins can pull out the slider bar to release all the discs and start the fun all over again! Connect 4 and all related characters are trademarks of Hasbro.\n\nBRAND STORY\nBy\n\nFROM THE MANUFACTURER\nWhether via a game board with dice, a deck of cards, simple lines drawn on scrap paper, or electronic media, gaming is a global pastime that has enriched culture for millennia. From the most classic tabletop board games to up-and-active, play-to-learn games for preschoolers to the painfully funny party games that satisfy your wild side, Hasbro Gaming is a one-stop-shop for filling your games closet. While continuing to produce some of the most memorable games in the history of family gaming, Hasbro Gaming stays up-and-coming by developing games that incorporate digital content and by partnering with some of the biggest names in entertainment. Hasbro Gaming and all related properties and characters are trademarks of Hasbro.\n\nSee more",
    "rating": 4.8,
    "feature_bullets": [
      "Classic Connect 4 game is disc dropping fun",
      "Choose yellow or red discs. For 2 players",
      "When you get 4 discs in a row you win",
      "Includes grid, 2 legs, slider bar, 21 red discs, 21 yellow discs and instructions"
    ],
    "specifications": {
      "Product Dimensions": "2.13 x 10.51 x 10.51 inches",
      "Item Weight": "1.05 pounds",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "ASIN": "B00D8STBHY",
      "Item model number": "A5640",
      "Manufacturer recommended age": "6 years and up",
      "Best Sellers Rank": "#58 in Toys & Games",
      "Customer Reviews": "4.8 out of 5 stars17,334 ratings4.8 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "June 5, 2013",
      "Mfg Recommended age": "6 - 99 years",
      "Department": "Unisex-adult unisex-child mens womens",
      "Manufacturer": "Hasbro"
    },
    "categories": [
      "Board Games",
      "Toys & Games",
      "Games & Accessories"
    ],
    "price": ""
  }
}