{
  "website_summaries": [
    {
      "verdict": "If you want a full-body pillow or are looking for additional support during your pregnancy, this MyPillow may be the perfect fit for your needs.",
      "pros": [
        "Provides support and dimensions that are ideal for full-body and maternity use – 18-inch by 54-inch provide ample width and length",
        "Some who have tried it claim it is the most comfortable pillow in its class"
      ],
      "cons": [
        "Several owners wished that it had more fill, while others commented that it was too firm for their needs",
        "Too large for small individuals",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Best Marketing Campaign Ever",
      "text": "Ok - I fell for the marketing for this... I'll admit it. This pillow is a lumpy mess. \"Interlocking foam\" - yeah right.... like they are supposed to magically interlock every time to lie down on it? Hardly. Having this as a body pillow is like spooning with a bag full of foam golf balls. Ultimately it is just absolutely gigantic, uncomfortable, and expensive. Don't believe the hype.",
      "rating": 1.0,
      "verified": true,
      "author": "luke",
      "helpful_votes": 47,
      "publication_date": 20190305
    },
    {
      "title": "Limp biscuit",
      "text": "I have never seen such a piece if crap. It has not even enough fill to hold its shape. Limp biscuit is how I would call this. I bought the Egyptian pillow cover they sell for it and it is awesome. It would be nice if the pillow they sell for it would actually fill the case.",
      "rating": 1.0,
      "verified": true,
      "author": "Bert",
      "helpful_votes": 23,
      "publication_date": 20190307
    },
    {
      "title": "A true body pillow!",
      "text": "The my pillow body pillow works for me it is fluffy / full & hasn't gone flat, exactly what I needed. I suffer from osteoarthritis & degenerative disc disease so I constantly need to reposition my self to get comfortable. I previously ordered a different brand body pillow but it was to thin & flat for me so I returned it & purchased the my pillow. The bed is a king so you could get an idea of the length.",
      "rating": 5.0,
      "verified": true,
      "author": "Itza",
      "helpful_votes": 30,
      "publication_date": 20170914
    },
    {
      "title": "Disappointed and Returned",
      "text": "I love the My Pillow bed pillows and I was excited to try their body pillow but I was disappointed and I returned it the next day. Perhaps mine was defective but mine didn’t have any guts to it. There were plenty of gaps with no stuffing and there was nothing to it. For the price, I expected better.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Kulik",
      "helpful_votes": 21,
      "publication_date": 20181214
    },
    {
      "title": "Sack of salt marbles...",
      "text": "This is the worst piece of crap I have ever seen the only thing good about this pillow is the marketing I hate it worst money I ever spent saw one for cheaper that looks better looks like I'll be ordering it whatever you do don't buy this 1/2 bag of soft marbles take it from me...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20200130
    },
    {
      "title": "Cuddle Buddy",
      "text": "This is the best body pillow ever! A bit expensive at first, but the product will last a long time and not leave you lying flat. I have the regular My pillows, for about a year and they are still fluffy. I have washed them and no damage, just fluffy and smelling good. SO they are: long-lasting, fluffy, washable with no damage: a great buy! Please note when you first receive the pillow it will seem like they shorted you on the filling, but wait a day and you'll be surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "KeellyDee",
      "helpful_votes": 13,
      "publication_date": 20181003
    },
    {
      "title": "Dont look any further!",
      "text": "BEST BODY PILLOW EVER! this pillow is amazing. It gives perfect support right where I need it! My back pain has been less each morning since I got it! Love it! It's also light so it moves with me at night instead of the memory foam And bamboo ones that feel like there is a dead body next to me... absolutely recommend my pillow products!",
      "rating": 5.0,
      "verified": true,
      "author": "in Iowa",
      "helpful_votes": 18,
      "publication_date": 20170214
    },
    {
      "title": "My pillow body pillow",
      "text": "I bought the body pillow for my wife. She has had back surgery and a complete knee replacement. She has always had restless leg system while she sleeps. She has used a regular pillow between her legs for years. She likes the body pillow because it's longer and allows her to wrap up her whole body around it. I like it because she doesn't flip flop around as much and she gets better rest. It also allows me to get better sleep because she doesn't wake me up as much. She's had it for about a week now and seems to make a big difference for her.",
      "rating": 4.0,
      "verified": true,
      "author": "Cal Johnson",
      "helpful_votes": 3,
      "publication_date": 20200401
    },
    {
      "title": "not worth the money",
      "text": "I own 2 other my pillows and love them. But they were a little skimpy on the filling of the body pillow. It feels like it's only 2/3s full. I followed the instructions of putting it in the dryer and gave it a week to fluff up but it's still not filling up the case. It's pretty useless as a body pillow",
      "rating": 1.0,
      "verified": true,
      "author": "Judith from Las Vegas",
      "helpful_votes": 4,
      "publication_date": 20200613
    },
    {
      "title": "The best body pillow.",
      "text": "So comfy! LOVE this pillow. Was a gift for my husband... I tend to steal it during the night or look forward to mornings when he wakes before me so I can use it. NOTE: on the tag of the pillow (not the box or packaging it comes in) it will tell you to put the pillow in the dryer for 10-15 minutes to fluff it up. We did not do that until I got a standard size mypillow and heard from another buyer to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20190228
    },
    {
      "title": "Worst purchase ever",
      "text": "This is by far the worst purchase I’ve ever made on Amazon, The pillow was stuffed A little more than half way (There’s another review with a picture that shows exactly what I’m talking about) definitely not worth $50. I would return it if it wasn’t such a hassle especially during these times, I ended up having to put this pillow in a long pillowcase with a regular size mypillow, now it’s the correct size as a body pillow 😑",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 3,
      "publication_date": 20200427
    },
    {
      "title": "Piss poor pillow",
      "text": "It seems the owner of my pillow Mike Lindel is still smoking the crack. His pillow is terrible. Low end so feathered pillows from Kmart last car would be preferable to this lumpy waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Ferrill",
      "helpful_votes": 2,
      "publication_date": 20201004
    },
    {
      "title": "a very satisfied shopping",
      "text": "My sleep quality is usually not very good, so the requirements for pillows at night are relatively high. I have tried many pillows before and are not too satisfied. When I bought this pillow, I felt that the price was not cheap. But after using it for half a year, it has really brought me a very comfortable experience, and the quality of sleep at night has also been greatly improved. I can't sleep without it now.",
      "rating": 5.0,
      "verified": true,
      "author": "gsteele",
      "helpful_votes": 2,
      "publication_date": 20200707
    },
    {
      "title": "Honestly the best",
      "text": "Honestly this is the best product I have purchased this year. I am pregnant again and using this pillow in conjunction with my other My Pillow I have almost zero back pain (I use one to support my back while I sleep). This was not the case with my first two pregnancies. The support from this pillow is truly amazing. The funny thing is the only reason we purchased My Pillows were because of my husband, I thought they were too expensive and a lot of hype, but they are honestly the best pillows I have ever used.",
      "rating": 5.0,
      "verified": true,
      "author": "Ali Pace",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "No support and cheap pillow filling",
      "text": "Product way over hyped. Provides no support for sleeping. Not worth your money. This is something you could buy at kohl’s for $15.",
      "rating": 1.0,
      "verified": true,
      "author": "Amy Brissette",
      "helpful_votes": 6,
      "publication_date": 20190318
    },
    {
      "title": "Does not last.",
      "text": "I used this pillow for a few months before it separated width wide. Now it has 2 parts. I’m pretty disappointed with the product. I thought if I spent a little more it would be a good pillow. Not so!",
      "rating": 2.0,
      "verified": true,
      "author": "Diane M. Weinman",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "4 years later still great",
      "text": "I've had this for almost 4 years now and it's still great. If I remember I paid about eighty for it when I bought it, which was a lot for a pillow, but I was sick of having to replace pillows when they went flat after a few months. I have back problems and sleep on my side with the pillow stuffed into my chest, wrapping around it to stretch put my back. This pillow has been awesome. It's very full and hasn't lost much or any of its fluff after all this time. I would definitely buy another if this one ever wears out.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Love mypillow pillows all of them I have",
      "text": "Well I bought another body pillow and it was soooo heavy it was a problem. And I could never imagine keeping that 50 pound pillow washed and cleaned. I have 7 mypillow pillows now. They hold up really well. Originally bought two about 6 years ago for my bed ridden 87 year old mom. She loved them, they are easy to tuck in what ever shape you want. And when my little shitzu loves them then I know they are comfy.",
      "rating": 5.0,
      "verified": true,
      "author": "Jojo",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Hold it's shape",
      "text": "Love this body pillow it's thicker than a standard one.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 2,
      "publication_date": 20200118
    },
    {
      "title": "Worst purchases for me in a long time.",
      "text": "I'm extremely disappointed in the product. No support for me whatsoever. I have been wanting a \"My Pillow \" for several years now. What a disappointment. Best regards Nathan",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200422
    },
    {
      "title": "I wouldn't buy this again.",
      "text": "Not enough stuffing in this pillow, I still have to use 2 body pillows and keeping them together as I toss and turn is not good. I really want to contact this company for more stuffing or a new pillow. I'm wouldn't recommend this pillow. I only gave it 2 stars because I can use it, it is not as full as I wanted it to be.",
      "rating": 2.0,
      "verified": true,
      "author": "Kim S.",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Two are better.",
      "text": "Where to begin... I thought my regular MyPillows were the schizzle...but the MyPillow body pillows took it there and brought it back home. I sleep Marty McFly, after a vehicle accident: top leg thrown in front, bottom leg hooked on edge of bed; torso twisted more crooked than a politician. My chiropractor is rich. But the MyPillow body pillows are a game changer. Buy at least one. Two are better.",
      "rating": 5.0,
      "verified": true,
      "author": "J Gliss",
      "helpful_votes": 2,
      "publication_date": 20180619
    },
    {
      "title": "Bought this for my wife who's prior pillow was getting ...",
      "text": "Bought this for my wife who's prior pillow was getting too compacted. This one is stuffed full. I would think it too full, but she likes it that way. No problems with it so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 6,
      "publication_date": 20160628
    },
    {
      "title": "Very firm, but good pillow",
      "text": "My 'My Pillow' is fairly light stuffing which I like, but the body pillow is the opposite & very dense stuffing. I might bust it open & take some of it out to make it less firm. Otherwise great pillow.",
      "rating": 3.0,
      "verified": true,
      "author": "Megan Bailey",
      "helpful_votes": 4,
      "publication_date": 20170413
    },
    {
      "title": "It’s mehhhh.",
      "text": "Very little filling, not as expected. Thought it was a full body pillow, but it was only half way body pillow. Not Enough FILLING.",
      "rating": 1.0,
      "verified": true,
      "author": "D",
      "helpful_votes": 2,
      "publication_date": 20200823
    },
    {
      "title": "Best body pillow I have used",
      "text": "No clue why people have reviews saying this is half full. Just simply follow instructions, dry the pillow before using, fluff it up, and it is wonderful. This pillow is so full, I have trouble fitting it into my pillowcase.",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs. Mom",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Love love love it",
      "text": "I have been using the body pillows by Costco. Probably one or two a year because the would flatten so fast, but I think this one will keep its fluff much longer. Plus its washable.",
      "rating": 5.0,
      "verified": true,
      "author": "TELLASTAR03",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Not Very Comfy",
      "text": "It's way too lumpy. Way too overstuffed and the stitching has come apart on the seams. I've passed the return window and can't seem to find a way to contact anybody.",
      "rating": 1.0,
      "verified": true,
      "author": "5 stars",
      "helpful_votes": 7,
      "publication_date": 20170828
    },
    {
      "title": "My back feels so much better now",
      "text": "I didn't realize how this pillow could help me sleep sounder and have less back pain but it does. I got two for the price of one. We gave the other to a family member as a gift and they love it also.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Delightful gift.",
      "text": "This was a last minute gift when I heard granddaughter had always wanted one. Instant happiness. Been in use since.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol T.",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "Amazing",
      "text": "This is a fantastic pillow! Bought it for pregnancy, but I will keep it forever! Replaces all the other pillows I was using to sleep. I also own a regular mypillow size white. They are by far the best pillows on the market. I have tried a million different ones and will never change to a different pillow! Buy them!",
      "rating": 5.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Finally found something comfortable",
      "text": "Great for side sleepers with back pain. Relieves pressure, adjusts to positions that are most comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "bcrgrrl",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Very comfortable even if you’re not pregnant",
      "text": "I’m not pregnant but I do like to hug something while I sleep and love the mypillow brand. Have been sleeping much better since unless my boyfriends steals it in the middle of the night!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica Lux",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Somebody to \"hug\" at night.....",
      "text": "I bought this to hug at night. It is perfect for that. The fill is great with just the right amount to grab it, hug it and throw your leg over it. :) Love it! A plus that it is machine washable........though I'll need a big washing machine when that time comes.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Kiesler",
      "helpful_votes": 0,
      "publication_date": 20180117
    },
    {
      "title": "Happy to go to bed.",
      "text": "I have been buying pillows forever.Never had a pillow I liked until now.This is the most comfortable pillow I have ever used.Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "Billy W. Morrison",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "Very good",
      "text": "The only reason I didn’t give this 5 stars is the fact that the filling moves down during the night and I need to rotate the pillow every day",
      "rating": 4.0,
      "verified": true,
      "author": "Richard B",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "Not a body pillow",
      "text": "This pillow did not have enough stuffing to make it a body pillow. Its limp and not worth the money",
      "rating": 2.0,
      "verified": true,
      "author": "judy a",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Hubby loves it!",
      "text": "My husband mentioned he wanted this, I surprised him with it on his birthday, he loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "DKinMA",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Not filled enough not worth $",
      "text": "Feels good but not filled enough. Definitely not worth the money. It would be if they filled it. It will take another pillow to fill it the way it should be filled. Which is definitely NOT worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Rosenblum",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "Stinks",
      "text": "Way too expensive for the quality, you can find better pillows for half of the price. I've only had it a few months and is already flat and the material is matted up.",
      "rating": 2.0,
      "verified": true,
      "author": "dustin howard",
      "helpful_votes": 4,
      "publication_date": 20161114
    },
    {
      "title": "It very nice",
      "text": "This is the most comfortable body pillow I have slept on I sleep mostly on my side and want a good body pillow to snuggle with and this works perfectly for me",
      "rating": 5.0,
      "verified": true,
      "author": "sean spangler",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "It's okay. Works well for side sleepers but it ...",
      "text": "It's okay. Works well for side sleepers but it breaks down in the middle where my knees rest.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161202
    },
    {
      "title": "Would never have another brand in my home",
      "text": "Love the my pillow brand. Have them in all of my bedrooms. Felt that. the body pillow could've been stuffed with more fill but its still great. Have not had the opportunity to launder as yet but this was another selling point!",
      "rating": 5.0,
      "verified": true,
      "author": "PATRICIA M. CLAUSS",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "... in the middle Not sure so far if I like that Thx",
      "text": "Very big not comfortable It tend to bend in the middle as if is missing material to fill it up",
      "rating": 2.0,
      "verified": true,
      "author": "noura a ghannoum",
      "helpful_votes": 0,
      "publication_date": 20180307
    },
    {
      "title": "Everything they say is true!",
      "text": "Just what I needed. I love that it can be adjusted and puffed back up. Much thicker than my old body pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "LLK",
      "helpful_votes": 0,
      "publication_date": 20181226
    },
    {
      "title": "and are very happy with the quality",
      "text": "You will not have to purchase another pillow every few months if you purchase this one. Some others flatten out and do not bounce back into shape. We have owned it for several months now, and are very happy with the quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Bead Lady",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Wonderful",
      "text": "So comfy. I am a side sleeper and this is great to have between my thighs.",
      "rating": 5.0,
      "verified": true,
      "author": "nora",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Loves his pillow!",
      "text": "My husband loves his body pillow. He is sleeping much better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "It's so Fluffy",
      "text": "The best body pillow ever. You can use any case on it. It keeps it shape.",
      "rating": 5.0,
      "verified": true,
      "author": "Mingtoy",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "It was just OK!!!",
      "text": "The My Pillow was a little disappointing..it is a small pillow and I just thought it was going to be more than it is.......there are more comfortable pillows out there",
      "rating": 1.0,
      "verified": true,
      "author": "lisa Mcmillan",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Wish it were fuller",
      "text": "Not as full as I think it should be, but I kept it because I needed it at the time.",
      "rating": 4.0,
      "verified": true,
      "author": "cs",
      "helpful_votes": 2,
      "publication_date": 20160930
    },
    {
      "title": "Great pillow",
      "text": "Great quality, full fill pillow. Prefer this one over the regular size my pillows.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris&Elizabeth ",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Best Pillow",
      "text": "I don't know how I use to sleep without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Best pillow",
      "text": "Love. Had for 5years, still working great. Any other pillow, I would have replaced yearly.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea Kuehl",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "LIFE CHANGING",
      "text": "Life changing! Seriously It's the best body pillow ever. Yes it's bulky, but it conforms to your body! it's fabulous!!!!! BUY IT RIGHT AWAY!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20161217
    },
    {
      "title": "Very pleased w this product",
      "text": "Was delivered a day late but weather has been a factor. Very pleased w this product. Gives awesome support. Would highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl Johnsrud",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Disappointed",
      "text": "The pillow was not as thick and full as I thought it would be.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Like it but wondering how it'll fit in the washing ...",
      "text": "Using this to replace two My Pillows on our bed in the Airstream. Like it but wondering how it'll fit in the washing machine, may need a commercial washer. Our other My Pillows benefit from being washed and dried every couple of months.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat L Russell",
      "helpful_votes": 2,
      "publication_date": 20141004
    },
    {
      "title": "You get what u pay for 5 star",
      "text": "I dint want to trust it but paid the 40$ and my girlfriend says it's amazing, im like shutup common n she really sleeps better and says it's the best pillow ever , also is so comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "isidro martir",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "A better sleep with my pillow",
      "text": "The pillow was a little disappointing compared to the TV advertisement. I had to fluff it several times for comfort. When I woke up the next morning, I walked with comfort, my back, feet wasn't hurting as much.",
      "rating": 3.0,
      "verified": true,
      "author": "Donna Rogers",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Five Stars",
      "text": "Just like my other \"My Pillows\" this is great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "RL, Pittsburgh",
      "helpful_votes": 2,
      "publication_date": 20160619
    },
    {
      "title": "Great product.",
      "text": "My pillow outdid themselves with the maternity pillow!! Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly H.",
      "helpful_votes": 2,
      "publication_date": 20160322
    },
    {
      "title": "Comfort",
      "text": "I wish this pillow was a little shorter. But it is great for sleep. Really keeps my back aligned since I sleep on my side.",
      "rating": 4.0,
      "verified": true,
      "author": "JoAnn Mahloch",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Great pregnancy pillow that doesnt take up too much space",
      "text": "I bought this to help with sleeping during pregnancy, and so far so good! The pillow has a smaller footprint than many others in the market, and fits well in our queen size bed. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "acr9988",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Was not worth it",
      "text": "Pillow is uncomfortable even when fluffy fresh out the dryer",
      "rating": 2.0,
      "verified": true,
      "author": "souneek",
      "helpful_votes": 0,
      "publication_date": 20190708
    },
    {
      "title": "Long lasting fluff. Good value",
      "text": "Love this pillow. Stays fluffy and you can push where you want to make it flatter and then fluff it back up to change positions",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy L L",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "and very nice body pillow",
      "text": "A bit too overstuffed, but once it's been jostled enough, and very nice body pillow.",
      "rating": 4.0,
      "verified": true,
      "author": "JBSmoove2",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Don't Buy",
      "text": "No warranty on pillow & we ordered 2 and one of them is torn in the middle and cannot use what a shame .",
      "rating": 1.0,
      "verified": true,
      "author": "Concerned Customer ",
      "helpful_votes": 9,
      "publication_date": 20170912
    },
    {
      "title": "My pillow is washable which was perfect for him",
      "text": "It was for my son who had surgery followed by a skin graft",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "😃",
      "text": "This product is great my husband and I both like it that’s why we order more for my mom And my kids",
      "rating": 5.0,
      "verified": true,
      "author": "Rosenda Roberts",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Dementions",
      "text": "Length was to be 54” turned out to be only 49” , disappointed",
      "rating": 3.0,
      "verified": true,
      "author": "Joe Carrillo",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "I like it so far",
      "text": "I like it so far. I'm a side sleeper and I use it to help me straight at night.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ramirez",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Five Stars",
      "text": "I love my pillow. Got 3 of them and will never have a different pillow.",
      "rating": 5.0,
      "verified": true,
      "author": "DVetZer0",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Best purchase ever!",
      "text": "Best purchase I have made in years! I have had it for about eight months and I can’t imagine sleeping without it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jill",
      "helpful_votes": 0,
      "publication_date": 20190616
    },
    {
      "title": "Big Body Pillow",
      "text": "I have a regular \"My Pillow\" as well. This could be just a little smaller in size. It is easy for me to use, but my wife has a hard time using it because of it's girth.",
      "rating": 4.0,
      "verified": true,
      "author": "LBP",
      "helpful_votes": 6,
      "publication_date": 20140403
    },
    {
      "title": "Great",
      "text": "Bought one for my son-in-law who suffers from back pain. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Too large",
      "text": "Ok for some ppl but hard to use between knees at night. Its way too fluffy.",
      "rating": 2.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 0,
      "publication_date": 20160126
    },
    {
      "title": "Perfect pregnancy pillow",
      "text": "So fluffy I had to flatten just a little! Now I have to fight off my toddler from using it. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "tress",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "comfort",
      "text": "I like the price, comfort and the good sleep at night",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Herum",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "THE BEST BODY PILLOW EVER!!!!!",
      "text": "The best body pillow ever!!!! I have back problems and have used body pillows for 25 years and they all go flat or wear out in about 4 months or less and I have to buy more! I have had this one for more than 6 months now and it is still as fluffy as the first time I got it!!!!! Well worth the expense because I have spent way more than that replacing body pillows for years!!!!! I will never buy another body pillow again that isn't from MY PILLOW!!! I rarely do reviews but couldn't pass this one up!!!",
      "rating": 5.0,
      "verified": true,
      "author": "MS",
      "helpful_votes": 6,
      "publication_date": 20160616
    },
    {
      "title": "Works like it states.",
      "text": "I purchased two of the medium fill large size pillows. My wife and I love them. You can move the fill around to create a pocket for your head to go in if that is what you like or to make it more firm. Yes, you can buy a cheaper pillow but they are not washable like these are. My brother has one and he has washed his more than 5 times with no damage to the pillow. I have had mine for only a month but I plan on washing it every season. Spring,winter, summer and fall.",
      "rating": 5.0,
      "verified": true,
      "author": "Dragontamerz",
      "helpful_votes": 0,
      "publication_date": 20170201
    },
    {
      "title": "TOO FAT",
      "text": "its too fat for a body pillow and too fat to put between my legs. So as so as I get a chance I will open it and remove some of the stuffing to get it alittle more flatter",
      "rating": 3.0,
      "verified": true,
      "author": "AJMPHX",
      "helpful_votes": 2,
      "publication_date": 20150527
    },
    {
      "title": "Great",
      "text": "Love it doesn't go flat like the regular pillows would recommend to anyone",
      "rating": 5.0,
      "verified": true,
      "author": "SimonAngel",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "great support on neck and head",
      "text": "It's so lovely, very plushy, great support on neck and head. Oh and it's awesome to cuddle with, haha.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160301
    },
    {
      "title": "This pillow is not to big, nor to firm ...",
      "text": "This pillow is not to big, nor to firm, nor does it have to much stuffing, i almost didnt get the pillow because of the reviews and GOODNESS THANK HEAVEN I WENT AHEAD AND GOT IT, now i realize everyone has their own taste but come on, you dont gotta lie in a review, now on the flip side i sleep on my stomach with a pillow under my whole body so after awile my old pillow went flat but this is a revolutionary pillow if you sleep the way i do, and if you dont you should try it its amazing",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Smith",
      "helpful_votes": 13,
      "publication_date": 20170616
    },
    {
      "title": "Great for side sleepers",
      "text": "I bought the regular \"my pillow \" first and was impressed with how it held up and how comfortable it was. When I first unpackaged the body pillow, I was disappointed. It was smashed into a small ball. I thought there was no way it would fluff up. But about 30 min later, it did and was very full. This body pillow is so full, it's perfect for side sleepers. But not for those who sleep semi-prone or stomach. I am super impressed with the quality and am now a fan of the whole \"my pillow \" company.",
      "rating": 5.0,
      "verified": true,
      "author": "AJM",
      "helpful_votes": 0,
      "publication_date": 20201003
    },
    {
      "title": "Not very supportive",
      "text": "I have regular MyPillow pillows, and they’re super comfortable, and always feel full and supportive. This body pillow, however, feels like it’s missing a ton of stuffing. It’s not even as supportive as the body pillows I’ve bought for a fraction of the price from Target. I thought maybe it just needed to be washed and dried before it would fluff up to full capacity, but there was no change.",
      "rating": 3.0,
      "verified": true,
      "author": "Julie B. Schlachter",
      "helpful_votes": 3,
      "publication_date": 20181112
    },
    {
      "title": "More than a maternity pillow!",
      "text": "I was a little overwhelmed at the price tag on this pillow, but I'm glad I bought it. I get severe cramps when I'm on my lady days and this pillow alleviates a good part of the pain I feel. I put it in the dyer before I used it, and while it came fluffed up and ready to go, putting it in the dryer made it so much softer than I could have dreamed. I would recommend putting it in the dryer for 15 minutes, like you would their regular pillows. Definitely worth the money!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather Pond",
      "helpful_votes": 6,
      "publication_date": 20170223
    },
    {
      "title": "Well since I already love my own MY PILLOW I’ve been using for years",
      "text": "My old flat yucky body pillow was really of no use anymore. Looking to replace it, looked on amazon and OH BABY! I discovered that “MY PILLOW” made one. Well since I already love my own MY PILLOW I’ve been using for years, I debated for days because of the price then ordered it. If you like body pillows you’re going to fall in love with this. So comforting. Try it!! Also I splurged on the Gaza cotton pillowcase to keep it clean.",
      "rating": 5.0,
      "verified": true,
      "author": "frobie1961",
      "helpful_votes": 2,
      "publication_date": 20180624
    },
    {
      "title": "AMAZING. Highly recommend",
      "text": "I am NOT pregnant but have used a body pillow to sleep for years. I have loved my ‘my pillow’ for years and just saw they have a body pillow. I do not regret it one bit. It is wonderful. I am able to make between my legs thicker and where I wrap my arms around thinner. It is perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Great price for a great product!",
      "text": "Got this body pillow for my husband who has lower back pain due to an old untreated injury in his teens. It has helped reduce the pain & he's able to sleep better. Well worth the $40 reduced price, thanks so much Amazon!! We have the standard size My Pillow pillows already & paid $30 for each of them so this was a bargain!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kalihi Grammy",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Not enough filling = unhappy pregnant wife",
      "text": "I'm not sure if the previous reviewer who said that this pillow was \"very firm\" received the same one. I bought this for my 6-month-pregnant wife, and she's been very disappointed by how soft it is-- she says it goes totally flat between her knees at night, and that the filling is very lumpy and uncomfortable.",
      "rating": 2.0,
      "verified": true,
      "author": "Sam Hotchkiss",
      "helpful_votes": 13,
      "publication_date": 20170219
    },
    {
      "title": "Disappointing Product",
      "text": "The hype about this product is just that “hype”. I was shocked right at the get go when I opened the package and waited and waited for it to expand. Waiting finally ended and expansion fell far short of filling the cloth it’s wrapped in. So, with skepticism, I gave it a try. Turns out I wasn’t wrong, for it is not even close to being filled with enough “patented” filling. DON’T WASTE YOUR MONEY OR YOUR TIME.",
      "rating": 1.0,
      "verified": true,
      "author": "Sgt Rick",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Best body pillow",
      "text": "I love this body pillow. It comes out of the dryer nice and fluffy every time. The My Pillow brand has really helped me manage my chronic neck pain.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy Purington",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Needs more filling",
      "text": "This would be a great pillow if they filled it all the way.",
      "rating": 3.0,
      "verified": true,
      "author": "Sapid",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "No support, lacks filling. If you compress the filling in the bag it's maybe 1/3 full.",
      "text": "This pillow is probably filled to about 1/3 of what it should be. It's a limp rag of a pillow. You get about 25% of the pillow in support, you are better off going with a blanket for a body pillow. Super disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "So Comfy!",
      "text": "This is a great body pillow, so squishy and comfy. I'm getting the best night's sleep ever with this pillow. It's a bit pricey for a body pillow, but it's hard to put a price on a great night's sleep.",
      "rating": 5.0,
      "verified": true,
      "author": "Jazminjo",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Like new each night!",
      "text": "I've had a lot of body pillows over the years due to shoulder and back problems. This is the first one that hasn't started flattening out after a month. This pillow fluffs up so well that each night it's like new! Wonderful!",
      "rating": 5.0,
      "verified": true,
      "author": "Judi Easley for Blue Cat Review",
      "helpful_votes": 2,
      "publication_date": 20170423
    },
    {
      "title": "... prop up my legs in bed and it works beautifully. You don't have to be pregnant to benefit ...",
      "text": "I bought this pillow to prop up my legs in bed and it works beautifully. You don't have to be pregnant to benefit from this My Pillow product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170416
    },
    {
      "title": "Best pillow ever",
      "text": "I have 5 my pillows and I love them, they are easy to clean and stay fluffy. This body pillow is amazing and comfortable I absolutely love it",
      "rating": 5.0,
      "verified": true,
      "author": "terrayne",
      "helpful_votes": 0,
      "publication_date": 20190604
    }
  ],
  "product_meta": {
    "title": "MyPillow Total Body Maternity Pregnancy Pillow",
    "rating": 4.3,
    "feature_bullets": [
      "Cotton",
      "Made with our Patented Interlocking Fill, Perfect for pregnancy support",
      "Provides pelvic and lumbar support if placed between the knees while sleeping on your side",
      "Machine washable and dryable",
      "Dimensions: 18\" wide x 54\" long",
      "MyPillow Promotions not offered on Amazon"
    ],
    "specifications": {
      "Product Dimensions": "54 x 18 x 18 inches",
      "Item Weight": "3.39 pounds",
      "Manufacturer": "MyPillow, Inc.",
      "ASIN": "B00DHHPSGY",
      "Item model number": "AMZUS-BOD",
      "Customer Reviews": "4.3 out of 5 stars448 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#3,891 in Baby",
      "Is Discontinued By Manufacturer": "No",
      "Fabric Type": "Cotton",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Pregnancy & Maternity",
      "Baby Products",
      "Maternity Pillows"
    ],
    "price": 39.98
  }
}