{
  "website_summaries": [
    {
      "verdict": "Those seeking an extremely slim money clip wallet will admire this sleek pick from Alpine Swiss.",
      "pros": [
        "Impressively slim",
        "Includes an exterior ID window",
        "Money clip is magnetic",
        "Holds 3 cards for ultimate travel convenience",
        "Comes with a gift box",
        "Made of genuine leather"
      ],
      "cons": [
        "Magnet could be stronger – does not hold much cash",
        "Extremely tight and can be troublesome to get cards out"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "4 years of service. Getting another.",
      "text": "After 4 years of service, this wallet has changed colors and the plastic window on the front has started to break due to the inherit nature of plastic. It has seen many washes, sweaty butts, and hours sitting in the sun light, yet the only thing that has failed is the piece you'd expect, the plastic. If I really wanted, I could keep going with my original, but I've decided to treat myself. This thing is perfect in size, allowing you to keep everything you need and takes up minimal room while doing it. See you guys in another 4 years.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerd",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "magnet not strong enough.",
      "text": "I had high hopes for this minimalist wallet prior to its arrival. I was able to put in 6 cards total, ID, insurance, credit/debit, etc. 6 total. No more than that will fit. The real issue came when I folded 5 bills, making the cash 10 layers thick, and attempted to use the magnetic bill hold. It would not hold. I backed it to 4, for 8 total layers thick, it worked. I was hoping for at least 10 folded bills, 20 layers. This was a disappointment.",
      "rating": 1.0,
      "verified": true,
      "author": "gone fishing 5478",
      "helpful_votes": 2,
      "publication_date": 20170714
    },
    {
      "title": "decent quality but one issue.....The magnet",
      "text": "The \"gray\" color has a green hint to it,not true gray. The issue with this wallet is the magnet. The magnet will only hold about 6 bills folded. any more than that wont really stay secure(I tried from 1 to 15 bills and 6 was the only secure amount). Wearing loosely sweatpants was ok,but wearing jeans the magnet will get caught up in the jeans pocket seam and will come undone making all the money fall out. Unfortunately I had to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "MCR",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "Great for posture",
      "text": "My chiropractor recommended me to never carry a traditional wallet in my back pocket. Carrying and sitting on it eventually cause my spine and hips to misalign over time, causing all sort of discomfort. I also don’t like those card holding phone case for fear of losing everything important on me at the same time. Then I found this wallet. It holds the essentials and the magnet is strong enough for what I usually carry. The overall size is perfect for front pocket, along side of my key and AirPod. Looks great too. Very good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Woody Chen",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "Hands down the best",
      "text": "I dont carry a purse or wallet usually. I just put my cards in my back pocket and risk the cards falling out. So I got this, at the request of a my SO after finding my cards on the floor...again and I love it. It fits all of my cards and doesnt slip out of any of my pockets. But best of all it's not bulky so my jeans don't look weird",
      "rating": 5.0,
      "verified": true,
      "author": "Cas N.",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "perfect for my drivers license",
      "text": "I should've known to go back to this brand after having a tri-fold wallet for many, many years. it's durable, fashion forward, and utilitarian. perfect for my drivers license, health insurance card, and two credit cards. the magnet is of great strength and holds the money in place firmly. I love the leather vintage look to it. can't say enough great things. and you cannot beat the cost.",
      "rating": 5.0,
      "verified": true,
      "author": "MyNameYeff",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Pair this with a card phone app and you're golden",
      "text": "Perfect little wallet. My old wallet was thick, too many membership cards, insurance cards, and credit cards. My chiropractor told me to ditch the wallet or put it in my front pocket, for that was the culprit for my hips being out of alignment (I do a lot of sitting between driving and my job). With this wallet and a card phone app, I have had zero problems only carrying three most important cards (ID and credit/debit). If a different card is needed I have them all saved in my phone. The magnet is very strong and have had no problems holding 10+ bills. Comfortable and stylish, highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Nicodemus",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Works well, one tiny flaw",
      "text": "Mine works well, the magnet on the money clip can hold a bunch of bills easily. The only flaw is that it's difficult to get my license in and out of. Luckily, I don't have to do this much and at least it will never fall out. I will buy again if this wears out. Good product.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Good value",
      "text": "I went through a couple similar money clips like this and this one is the best so far. Quality and workmanship is very good for the price. Holds just enough credit cards but not so many as to be bulky. You can put 2 crds in a single slot if you need the extra, will be tight, but works. Magnet is strong enough to hold about 12-15 pieces of paper money folded in half.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott D",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "very happy with this purchase",
      "text": "Very, very happy with this purchase. This Genuine Leather Money Clip front pocket wallet with magnet clip and card ID Case in Gray is awesome. From the looks of the picture, you would almost think it was suede, but its definitely not. It is leather and it looks awesome in person. I have two ID's in the ID slot, one card in each of the slots on the other side, and three cards in the middle. Its a nice snug tight fit. The magnet is decent and it will hold your bills. I prefer to fold the bills twice in half, and it works really well. Great quality, I can tell it will last.",
      "rating": 5.0,
      "verified": true,
      "author": "Wood Chuck",
      "helpful_votes": 0,
      "publication_date": 20160302
    },
    {
      "title": "Keep forgetting that it's there!",
      "text": "So far so good, just got it. I'm replacing one I got from from another company-lasted 2 years, this one seems to be made of better stuff. If you don't like carrying bulky wallets this is for you. Fits perfectly in my front pocket and barely notice it. Will update after the \"breaking in period\"",
      "rating": 4.0,
      "verified": true,
      "author": "Dutch M.",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Good product, weak magnet",
      "text": "This wallet/money clip works great for me, as I only carry 2 cards and driver's license. Very compact, fits in front pocket without bulk. One minor nitpick: the magnet could be a little stronger. Not an issue with only a couple of bills, but if I have more than 10 total the magnet doesn't seem to hold very well. Not sure if more powerful magnet would negatively affect the cards, so maybe this is by design. Overall I'm very happy with the quality and function of this product.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott S.",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "May Need to Break In",
      "text": "This is a nice, minimalist style wallet/money clip. I currently have 9 bills 1/2 folded in the magnetic clip and the clip holds the fine. I also have 5 cards in the clip (2 in the ID window). The card in the outer-most pocket, with the slight U cut, is a little difficult to remove, I usually end up pushing it deeper in the pocket. This may just be that it is new. The -1 star is because of the Swiss-style button on the magnetic clip. As was mentioned, it is quite thick and completely unnecessary. I would have liked to see some type of stamping instead, the button displays itself distinctly through my pants pocket.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark M",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Best slim wallet around",
      "text": "I never knew I could fall in love with a wallet. This is my second swiss wallet of this kind, the last on I bought was black. I put these things through hell, I toss them, stuff them to the max and it held up for 2 years. The only reason for another one was the plastic started breaking off, but after 2 years of daily use I'd say it gave me my money worth plus some. I wanted something that is slim, inconspicuous and that would fit in my front pocket, this works perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Garzaro",
      "helpful_votes": 0,
      "publication_date": 20161219
    },
    {
      "title": "Perfect Size, Strong Magnet",
      "text": "This wallet has been a great addition to my daily carry items. It actually helped me consolidate a lot of stuff that I had in my old wallet and throw out old stuff I didn't need. There's enough room for what most people need. I rarely carry cash so the clip part of it is usually used to store business cards until I put them into my phone or receipts until I record them. The magnet on the clip is still strong and holds items of various size and thickness very well. I haven't noticed much wear and tear on it, so I believe it to be a well made and durable product.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Cleary",
      "helpful_votes": 0,
      "publication_date": 20150421
    },
    {
      "title": "Great minimalist wallet an an unbeatable price!",
      "text": "Love this minimalist wallet.The grey color I got looks and feels unique. The leather is genuine and nice to the touch. While there is not a lot of room for those who have a half dozen credit cards, it's perfect for me. I can fit my MR card, ID, and two credit/debit cards. The money magnet is also very useful.",
      "rating": 5.0,
      "verified": true,
      "author": "SINA M JAMSHED",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "3+ years old and still like new!",
      "text": "I purchased this wallet almost 3 1/2 years ago and it’s still going strong! I bought it for the compact size to fit in my front pocket and the magnetic clip to hold a few bills. And it was the perfect fit. I almost don’t even notice it. Great quality and design!",
      "rating": 5.0,
      "verified": true,
      "author": "Omega Man",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Good quality and strong magnet",
      "text": "The magnet is very strong, more than adequate to hold your cash even on a windy day. All of the card holders are just the right size - not too small/tight or too loose. When you carry cash and cards, the cards are somewhat difficult to get to because you have to move the cash out of the way to get to a card. Overall, I'm very satisfied with this. It is made of good quality material and it seems like it will last for a few years at least.",
      "rating": 5.0,
      "verified": true,
      "author": "HabaneroHotShot",
      "helpful_votes": 0,
      "publication_date": 20161015
    },
    {
      "title": "Pretty nice for Front Pocket",
      "text": "Arrived new and very FAST!. Very nice for the minimal-ist. I had a much larger one - but This one is much more comfortable in your front pocket. You will not hold that much, but enough... I have about 12 bills ( clip still holds with magnet ) and about 7 credit cards Total between the front and back. Quality appears that it will hold up to some-time.",
      "rating": 4.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20170619
    },
    {
      "title": "Not good",
      "text": "Sorry, just don't care for it. The money keeps dropping out and since it isn't in a pocket of any sorts, it just flies away...with the wind. The magnet, so called, is way too weak so it doesn't do as advertised. It's so unreliable that I would end just stuffing the bills where the credit cards go. After losing a few $20, I just tossed this in the G file. G for garbage!",
      "rating": 2.0,
      "verified": true,
      "author": "Philip",
      "helpful_votes": 0,
      "publication_date": 20170708
    },
    {
      "title": "Great looking wallet for front pocket!",
      "text": "I love this small Alpine Swiss wallet with magnetic money clip! Works best with only 4 cards + driver's license, & it's hard for me to carry less than six (insurance, health ins. card, library card--sometimes I need all of those in a day + my credit & debit card). Too many --it gets too tight. But I'm working on wiggling down the number because this is a great-looking wallet, & I like my cash in my front pants pocket. This is the perfect fit for that!",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20160115
    },
    {
      "title": "Nice, but low quality..",
      "text": "Within the first week the separator between the id card slot and credit card slot tore. And within a few weeks the stitching is coming apart. I believe my last one did the same pretty much ass well. But I bought again due to the price and style desired. I also don't like the magnet style, always seem week. But the old style spring loaded clips with card holders are very hard to come by these days..",
      "rating": 3.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20161031
    },
    {
      "title": "Great quality for the price.",
      "text": "Great quality for the price. Love the look. My only gripe, and it’s a minor one, is that the cards fit a bit too snugly and can be tough to get out. I suspect this will be less of a problem as it breaks in.",
      "rating": 5.0,
      "verified": true,
      "author": "Derek Waite",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great wallet and very well constructed",
      "text": "Great wallet and very well constructed. Pros: small and thin, which is great for comfort. Magnetic clip which makes it easy to place and remove money rather than the usual metal clip you find with most money clips. Well constructed. Cons: not ideal for anyone who carries a lot of cards or any photos. You can fit only a few cards before the slots become very tight making it hard to remove cards when needed. I've had a cc and hotel room keys become unresponsive to swiping which could possibly be a result of the magnet being too close to the cards.",
      "rating": 4.0,
      "verified": true,
      "author": "DAVE",
      "helpful_votes": 0,
      "publication_date": 20161211
    },
    {
      "title": "Not good for everyday use. Good for nights out.",
      "text": "I didn't really like it for everyday use. You can't fit hardly anything in it. Although I will say it's good for those nights when you're going out drinking and don't want to lose everything if you lose your wallet so you throw a card or 2 in this one and some cash and go out with this. Not good for everyday use, I simply have too many cards and cash to fit in this thing. Also don't like pulling out my wallet and people can see how much cash I have in it.",
      "rating": 2.0,
      "verified": true,
      "author": "Alex Valdez",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Weak Magnet",
      "text": "I've had magnetic wallet clips in the past, and the magnet in this one is significantly weaker than other brands. It might be able to hold a couple of bills (literally) folded in half, and much less if you fold into thirds. If you have four bills folded in half, the strength of the magnetic closure is so weak I am constantly worried if I have the entire wallet with me. Also, the credit card slots are too tight.",
      "rating": 3.0,
      "verified": true,
      "author": "Summit Kundaria",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "Works perfectly, and stylish.",
      "text": "I only purchased this because it was on sale, but I honestly have grown to adore it. It doesn't hold a ton of cards, but it is absolutely perfect for traveling or daily use if you're not carrying a lot. The magnet is incredibly strong and functions well as a money clip.",
      "rating": 5.0,
      "verified": true,
      "author": "Dustin",
      "helpful_votes": 0,
      "publication_date": 20180930
    },
    {
      "title": "Good quality. Looks nice",
      "text": "Good quality. Looks nice. It holds my cards in perfectly and I love the functionality of your id being shown throw one side of the wallet. The only downside is the magnet on the clip isn't very strong. If you're looking to carry more than 8-10 bills you run the risk of all your cash following out. I use and love this wallet but just wish I could carry more cash. Credit cards can get you into trouble quick haha",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler Edmonds",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "Great value for price point",
      "text": "Not top quality, but very good quality product with a fairly strong magnet. I'm holding 3 cards, my DL and 6 bills and it is comfortable and unobtrusive in my front pocket. It's a shock to have to go to less than 20 cards floating in my wallet (gift cards, rewards cards, business cards), but much more comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "BJT1977",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Great product",
      "text": "Great wallet! I bought it for my fiancé & he’s been using it for years now! He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dezarae V.",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "I never liked wallets that go in my back pocket",
      "text": "I never liked wallets that go in my back pocket. For some reason they always put a hole in my pants. Additionally I hate having a lot of stuff in my front packets. My phone in one packet and my car keys in the other or it is uncomfortable to walk around for me. So I was ideally looking for a front packet wallet that would fit everything and not feel huge in my front packet. This wallet is everything I was hoping it would be. I have 3 credit cards, my license and some cash in there and I don't notice it at all. I was very surprised and happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160210
    },
    {
      "title": "Tons of great pockets and the leather feels very nice",
      "text": "Tons of great pockets and the leather feels very nice. I personally don't care too much for the magnetic clip, and I'm using the cash strap version of this wallet as my every day carry. I bought this one, the cash strap one, and the metal clip version to compare. The magnet works okay but if you carry a lot of cash sometimes the magnet doesn't hold it very tight when the money gets thick. Plus you have to fold it over more than I'd like.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Horn",
      "helpful_votes": 0,
      "publication_date": 20150501
    },
    {
      "title": "Looks nice and feels even better",
      "text": "Looks nice and feels even better. but the Magnet is very very weak. I've had magnetic clips the last few years and this is probably the one with the weakest. If you hold more than 8 bills this won't work very well for you, however if you are looking for a nice looking magnet clip this will suit you very good.",
      "rating": 3.0,
      "verified": true,
      "author": "Franco Castro",
      "helpful_votes": 0,
      "publication_date": 20170712
    },
    {
      "title": "Great, simple. Wallet",
      "text": "So far so good. Forces a minimalist approach. Only store what you need, leave everything else at home. Nicely made, and I think this one will last me for a while. Note: the magnet that holds the money clip is strong. As in, your keys will attract the Wallet. 🤔 maybe that’s not such a bad thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Bearded Black Guy",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Does not block RFID",
      "text": "Just ordered this for my husband and he really likes it so far. I can't speak to durability at this point since it's still almost brand new. However I will say the walled does not block RFID scans, but husband tried it out at the grocery store and was able to scan his credit from from inside the wallet behind the magnet for the money clip. So if having an RFID blacking wallet is very important to you, this might not be the one for you, however it seems to be be high quality and stylish.",
      "rating": 4.0,
      "verified": true,
      "author": "Angel M.",
      "helpful_votes": 0,
      "publication_date": 20160806
    },
    {
      "title": "Cool for a gift",
      "text": "Great for a gift, swiss. It holds a good amount of cards. I googled what to get someone that has everything and this was perfect for my Male friend. He loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "Shae Briannah",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Love it!",
      "text": "Still using this wallet today. It’s nice quality and nice to look at. Magnetic clip holds your money good and it does what it’s supposed to do. I’ll be buying this again when the one i have gets old",
      "rating": 5.0,
      "verified": true,
      "author": "Jae Davis",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Great quality",
      "text": "I have always purchased items similar to this at designer outlet stores at 4 times the price. This is excellent quality at a fantastic price!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Murphy",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Nice Clip and a Great Purchase.",
      "text": "Perfect little money clip card holder. Nice quality and does just what I need. When the time comes I'll get another one. But it's nice quality so I most likely won't need to for quite a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Guesticide",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Love it!!!!!",
      "text": "I actually stopped caring a wallet a few years ago because all the wallets i looked into i did not like. It took me misplacing my drivers license and eventually losing it to try another wallet and im glad i chose this one its great. Not big and bulky, fits in my pocket just right. Its a great deal!",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne Jones",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "Overall this wallet looks nice and is super slim",
      "text": "The card slots are Kiiiiinda hard to get cards out of when cash is in the clip, but I'm only folding bills in half. Trifold works great. but overall this wallet looks nice and slim. One of the best wallets I've had. Holds several cards plus an ID, which is incredibly easy to remove when necessary. That isn't often, because the window is wide enough to see all the vitals when doing age-related activities. Magnet is strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Grand Duke",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Use all the time",
      "text": "Love this. It was supposed to be a temp wallet for when I wear my work clothes but now I have it all the time. Definitely get",
      "rating": 5.0,
      "verified": true,
      "author": "Silver_Shroud37",
      "helpful_votes": 0,
      "publication_date": 20190627
    },
    {
      "title": "Highly Recommend!",
      "text": "I love it. It's my first slimline wallet and It's perfect for me. I chose to limit the number of pockets I had for credit cards because, I guess its psychological, when I see empty slots I feel the need to fill them up. This gives me room for what I need exactly and no bulge in my pocket! I also deviated from classic black leather and this was just a really good choice as it is still conservative. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "Good quality",
      "text": "My dad doesn't like to carry wallet but this one is so compact and easy! my dad could not say no to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Viz-Vin",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "It's okay, not my taste. Magnet seems a littke weak.",
      "text": "Bought four wallets to pick which one I was going to use and this one just struck me as \"meh\". Although, I've never used a money-clip that I really liked. Conceptually, I feel like youre sacrificing the point of a money-clip when you attach a wallet to it but that's just my preference. Overall it seems pretty well built with the exception of how wimpy the magnet is.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew Krieg",
      "helpful_votes": 0,
      "publication_date": 20190116
    },
    {
      "title": "awesome little wallet!!!!",
      "text": "This compact wallet is a little smaller than the one with the metal clip in a sense that the cards go in from the side instead of from top like my last one. So in other words you can't stuff as much in it as one that the cards sit flat in. Very high quality leather and strong magnet on the product also. I got almost 3 years out of the last one so my expectations are high with this one. Stay tuned!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Geno",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "Best Wallet for the $$$",
      "text": "This wallet is incredible for the price. I was worried that the magnetic money clip would not hold, but it is strong enough to connect through plenty of bills",
      "rating": 5.0,
      "verified": true,
      "author": "noah novotny",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Great quality, it wears the swiss badge well",
      "text": "I am a big fan of minimal wallets. I use this as a front pocket wallet and only carry id, credit, and insurance cards, with some cash from time to time. The quality is very nice and shows no signs of wear after six months of daily use. It wears the swiss badge well.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam",
      "helpful_votes": 0,
      "publication_date": 20180115
    },
    {
      "title": "Nice product",
      "text": "Got it for my wife and she really likes it as it holds the credit cards and my MONEY ( HA ! ) just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce D Pauls",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Very expensive looking and nice!",
      "text": "Got the grey and brown leather one - both look really expensive and the packaging was great. Everything about them comes across very expensive. Magnet for the clip part was nice and strong. Definitely recommending this one!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "... weeks now and I have to admit I really like it. I was initially skeptical because the wallet ...",
      "text": "I've only been using the wallet for a few weeks now and I have to admit I really like it. I was initially skeptical because the wallet only has three slots for credit cards. I have four cards and two club cards. Plus my insurance and misc. cards. The wallet forced me declutter and so far so good. Material feels so premium and the size is perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Qt",
      "helpful_votes": 0,
      "publication_date": 20170914
    },
    {
      "title": "An alternative to bulky wallets when pocket space is at a premium",
      "text": "Just received it today and while I haven't gotten a chance to really use it out in in the wild, it appears well made, the magnet seems strong, the color is different but unique and the lambskin smell doesn't apppear that bad to this nose. I bought this as an alternative to taking a bulky wallet on occasions when I don't have a lot of pocket space and it looks like it will fit the bill.",
      "rating": 4.0,
      "verified": true,
      "author": "RageATL",
      "helpful_votes": 0,
      "publication_date": 20141028
    },
    {
      "title": "Half a wallet!",
      "text": "Impossible to get cards out of this wallet especially your drivers liscense that sticks to the clear plastic in the wallet. It only holds a few bills. Any more and the magnet doesn't work and money falls out. It is pretty slim and good if you don't want much in your wallet.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Kain",
      "helpful_votes": 0,
      "publication_date": 20170210
    },
    {
      "title": "Works well for front pocket.",
      "text": "I have been using this everyday for 2 months and it has held up well. One of the card slots next to the money clip was catching the edge of my card for awhile but apparently I wore down whatever was in there because that is not happening anymore. I have had up to 10 bills in the clip and the magnet still held.",
      "rating": 4.0,
      "verified": true,
      "author": "Clint M.",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Wish it wasn't magnetic",
      "text": "The magnet in the holder seems to have shifted, and doesn't always hold (even with a small amount of cash). I wish it was a bit more durable.",
      "rating": 4.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "... lower price made me think it wouldn't be as nice as I wanted",
      "text": "The lower price made me think it wouldn't be as nice as I wanted... and that was not the case. I love it and hope it holds up. Even if it only last year, I'd buy another one just like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Boomshackla",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "THIS IS NOT A MONEY CLIP",
      "text": "I bought this “money clip” because my wallet was stolen and I wanted something to carry in my front pocket. This wallet is named as a MONEY CLIP WHICH IT IS NOT. I carry large amounts of cash and want a clip not a weak magnet. This wallet is a magnet not a money clip very deceiving. Only reason I’m not returning it is because it was only $10. Anyone looking for a real money clip wallet that is not what you are getting with this",
      "rating": 1.0,
      "verified": true,
      "author": "brad",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Great Wallet.",
      "text": "This is a great wallet. It looks much better than the plain metal clips. At first I hated that the money clip was magnetic but now I prefer it.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20180912
    },
    {
      "title": "... and purchased a third for a friend because I like the size so much",
      "text": "I have 2 of these and purchased a third for a friend because I like the size so much. I had a pain in my rump from sitting on my old wallet all the time. Now with this in my front pocket pain is totally gone. Will buy forever whenever I need one for myself or a friend.",
      "rating": 5.0,
      "verified": true,
      "author": "Neal B. Edwards",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Bought Again!",
      "text": "Had this in black and it held up really well and finally clear section tore after 3+ years, so bought two more (black and gray)",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Q",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "A really nice money clip / card holder combination",
      "text": "I downsized from a big tri-fold and I'll never go back. The little red cross fell off after a couple of months but I super glued it back on. I wish the clip's magnet was a little stronger. More than a few bills and it doesn't hold well. Thankfully I rarely carry much cash, but it gets annoying those few times when I do.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim K",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "Great wallet.",
      "text": "Great wallet, i bought extra in case I can't find them in the future. Can't imagine living without it. The magnets in it are strong enough to hold a good amount of money but don't mess with the credit cards.] This is a really great deal.",
      "rating": 5.0,
      "verified": true,
      "author": "Litty",
      "helpful_votes": 0,
      "publication_date": 20191024
    },
    {
      "title": "I love how this wallet is thin",
      "text": "This is the 2nd wallet of this type that I've bought. I love how this wallet is thin. The reason I bought 2 of them is because the 1st one was too thick but I really loved the feel of the leather and how my credit cards slide in and out easily. I would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161030
    },
    {
      "title": "Great wallet; Very slim",
      "text": "It is very slim, much like my older Coach front pocket wallet. However it is super tight getting multiple ID's and cards in and out. I unfortunately have to carry multiple ID's for work/military and they fill the slots up quickly. I'm giving it a 4/5 because of how difficult it can be to get the cards out, not because of the craftmanship... for the average person who is not carrying 6 id cards, this wallet will be perfect. Also the color is nice and the magnet holds cash well.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel J. Sharkey",
      "helpful_votes": 0,
      "publication_date": 20160808
    },
    {
      "title": "This is an amazing wallet! Great quality and very slim",
      "text": "This is an amazing wallet! Great quality and very slim. I have had several other slim wallets but none with the money clip. I was skeptical that the magnenet would not hold the money very well but it does. It even holds a card with some bills it is so strong! Very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "B-Ryce",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "Nice material",
      "text": "I like this product because is elegant, and well made. However there is no enough space for your cards. Still recommended, but if you have a lot of cards, think in another way to carry them.",
      "rating": 4.0,
      "verified": true,
      "author": "Jose Cardenas",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Feels like nothing’s there 👍",
      "text": "This thing is awesome, it’s nice and slim but with enough space to id and 4 other cards! The magnetic clip also holds up enough money, I think I had 6 bills folded twice. Taking the cards out is a bit difficult, but I’m pretty sure it just needs to be broken in. I also used to carry a condom in my other wallet (for emergencies 😉) but this one has no room for it. Asides from that it’s a great wallet, it almost feels like u don’t have anything in your pocket 👍👍",
      "rating": 5.0,
      "verified": true,
      "author": "Edgar Alvarez",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Nicely put together!",
      "text": "Super cool front pocket wallet. It's a bit tight but I hope it will loosen up a bit after a few more months of use.Love the look of it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Conner",
      "helpful_votes": 0,
      "publication_date": 20180607
    },
    {
      "title": "... what I thought it was going to be looks great real leather and extremely small wallet",
      "text": "This wallet is exactly what I thought it was going to be looks great real leather and extremely small wallet. Thank you Amazon again for the great price and product",
      "rating": 5.0,
      "verified": true,
      "author": "Rodger Tennant",
      "helpful_votes": 0,
      "publication_date": 20180219
    },
    {
      "title": "works as expected",
      "text": "Just what i needed, not a fan of back pocket wallets and this works perfectly for my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Gemel Walters",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "Great Money Clip",
      "text": "I bought this money clip for my husband to replace his bulky wallet. He can fit all the essential cards (6). It's helped him cut back on the junk he carries around. He says he can hardly tell its in his pocket when he is its on it. It is great quality and has held up very nicely.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Y",
      "helpful_votes": 0,
      "publication_date": 20151101
    },
    {
      "title": "Great clip if you have less than 3 credit cards",
      "text": "Great clip if you have less than 3 credit cards. anything over that, get ready for some tight pulling action. The ID slot shows the whole ID and doesn't block any necessary information. But for me, it does block the top part of the state (Maybe 2/3 of it), unless you're that drunk and you forget what state you're in (huehue). Besides, you shouldn't be drinking and driving. Stay in school!",
      "rating": 4.0,
      "verified": true,
      "author": "Saul T. Naughts",
      "helpful_votes": 0,
      "publication_date": 20150819
    },
    {
      "title": "Great Front Pocket Wallet",
      "text": "Great design if you only need to carry a few cards. Good magnet holds 10 to 12 bills with ease, probably could hold more. Would buy again. Perfect size for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel M Springer Sr",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "I really do like the slimness of the wallet",
      "text": "I really do like the slimness of the wallet. The clip stays clipped with magnets so I wasn't able to clip a stack of bills but it holds a good amount. Happy with purchase. Wouldnt recommend for someone with too many cards",
      "rating": 5.0,
      "verified": true,
      "author": "Hoony Kwak",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Eh.",
      "text": "The money flap doesn't work too well for when you're putting your wallet In your pocket which is one of the key points of this wallet. Wouldn't really recommend it to anyone.",
      "rating": 3.0,
      "verified": true,
      "author": "Vero",
      "helpful_votes": 0,
      "publication_date": 20170927
    },
    {
      "title": "Good quality- magnet not strong",
      "text": "Great wallet. Only thing I was bummed about was that the magnet isn't as strong as I thought it would be. If you shake the wallet with 6 or 8 bills in it, the money falls right out.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher E. Horn",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Perfect for the essentials",
      "text": "Great little wallet. Had to condense an oversized bifold into this tiny front pocket wallet. Worked out perfectly for ID and insurance, couple credit cards, and cash. I can put my gigantic phone in the same pocket without too much bulk.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Ruble",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "Good for a minimalist",
      "text": "This is a nice little wallet that was just what I was looking for. Feels sturdy and good quality. I am trying to be more of a minimalist and this is just the right size. I had never used a money clip before, so I'm learning how to organize my bills. Overall I highly recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Porto",
      "helpful_votes": 0,
      "publication_date": 20170207
    },
    {
      "title": "Great gift",
      "text": "Bought this as a gift and they loved it. The recipient had always used a money clip but I had noticed that their cards would always fall out of it because of how many there were. They absolutely love this clip. It's thin and has the slots for their IDs and credit cards while the bills can fit nicely in the clip.",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Ferris",
      "helpful_votes": 0,
      "publication_date": 20160214
    },
    {
      "title": "Unique",
      "text": "Love my wallets thin. Perfect for your front pant pocket or in a suit coat. Like the unique gray leather. Most wallets come in brown or black. Magnet works well for the money clip too. However if you are one to carry lots of bills might not work as well. 6-8 bills seems to hold fine. Nice pocket for your ID to slide in and out of with viewing window. Can't beat the price either. Very happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20131112
    },
    {
      "title": "Great Buy and improved material",
      "text": "I never write reviews but I really like the this product. This is the second one I have purchased one. The first one was old but worked well and I would still be using it if I didn't lose it. I ended up purchasing the save exact one again and I like it even better. It seems to be made with slightly better material but the superior design is the same. If you want a small money clip/wallet hybrid...look no further. Great material and the magnetic clip is amazing. You won't regret. Can't beat the piece either.",
      "rating": 5.0,
      "verified": true,
      "author": "New Owner",
      "helpful_votes": 0,
      "publication_date": 20160617
    },
    {
      "title": "If you looking at a wallet like this, when you already know that this will ...",
      "text": "If you looking at a wallet like this, when you already know that this will save you back pain The quality is top notch, and you can dint about nine bills behind the magnet clip for cash",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Dortch",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Can take a good wear and doesn’t tear",
      "text": "I have have this for about a year or so and honestly use this everyday day and beside getting dirty it stilll looks like the day I got it.",
      "rating": 5.0,
      "verified": true,
      "author": "BrianRex M",
      "helpful_votes": 0,
      "publication_date": 20171117
    },
    {
      "title": "Nice",
      "text": "Nice wallet, good quality. Would have left 5 stars but it took over a week to Prime ship from 4 hours away!",
      "rating": 4.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Solid holding cards and cash",
      "text": "Holds multiple cards well. Magnetic latch for money works well. Easier to place and retrieve bills at the register. Would buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Socially Distant",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Carries all the essentials and very sleek. Fits in my front pocket with everything i need.",
      "text": "Very strong magnet on the money clip, I fold my money 3x to make it as wide as the clip this makes pulling my debit card out easier. This wallet is very sleek yet enough to carry 9 cards through all the various pockets. I bought this to stop using a back pocket bifold wallet for my lower back.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Love",
      "text": "I always carried way too much in my wallets and my pocket would be so thick. This wallet has plenty of space for me to carry what I need, and forces me to keep out what I don’t.",
      "rating": 5.0,
      "verified": true,
      "author": "nicholas figueroa",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Great wallet!",
      "text": "I think this wallet is outstanding! This is exactly what u needed to replace a similar wallet. If you don't carry many cards or cash and would rather put your wallet in your front pockets this wallet is for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "Great for the price",
      "text": "Great for the price, material feels high quality Wish it was just a hair thicker in order to fit another card or two.",
      "rating": 4.0,
      "verified": true,
      "author": "MisterB",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Good wallet",
      "text": "I have always had traditional wallets and this is my first minimalist wallet. It is simple and small but strong and the leather seems durable. The money clip is really strong and can hold quite a few bills. Not sure on the exact number because I don't typically carry cash. However, I did have over 100 dollars in it (mostly 20s) and didn't have trouble closing.",
      "rating": 5.0,
      "verified": true,
      "author": "Will",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Very nice, quite happy with it.",
      "text": "Picked up the gray, very nice small (front pocket) wallet...Quality, more than fair price. Thank u",
      "rating": 5.0,
      "verified": true,
      "author": "Mason",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Sad.",
      "text": "The card holder is lovely. The magnet money clip, useless. Not sure if mines was defective or what but the magnet was extremely weak and wouldn't securely hold any bills.",
      "rating": 2.0,
      "verified": true,
      "author": "Antonette White",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Light weight",
      "text": "I love this! My fiancé FINALLY will carry around his wallet now!",
      "rating": 5.0,
      "verified": true,
      "author": "Madeline Huerta",
      "helpful_votes": 0,
      "publication_date": 20190303
    },
    {
      "title": "... needed for different things but my husband seems to like it.",
      "text": "More slots needed for different things but my husband seems to like it.",
      "rating": 3.0,
      "verified": true,
      "author": "Leslie D. Padilla-Ramirez",
      "helpful_votes": 0,
      "publication_date": 20181103
    },
    {
      "title": "Great sli Great slim wallet for the price!",
      "text": "This is my second one. My first one lasted about three years, pretty good quality for the price! Got to my house a day or two late. Cards bit a bit tigh this is my second one. My first one lasted about three years, pretty good quality for the price! Got to my house a day or two late. Cards fit a bit tight I’m the pockets. Don’t expect to put more than four or five cards in it.",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua Olvera",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "good quality, great price",
      "text": "The quality of this money was exactly as expected. It is very well made and the magnet is actually pretty strong. The stitching is very well done. The color was exactly as it showed in the photo so that was a nice surprise as you never know how off it will be from the photo.",
      "rating": 5.0,
      "verified": true,
      "author": "she_scored",
      "helpful_votes": 0,
      "publication_date": 20150620
    },
    {
      "title": "wonderful wallet that I bought",
      "text": "I have accident when I swam at Machbrid Lake in Iowa city. my old wallet fall in the water, and my wallet had been wet, so I decided to buy a new one. I searched in Amazon about the wonderful design, I choice this wallet. the leather is soft, and the pocket is enough for all my cards. I like this wallet",
      "rating": 5.0,
      "verified": true,
      "author": "Felemban,Ahmed",
      "helpful_votes": 0,
      "publication_date": 20140715
    },
    {
      "title": "... for months now and I have to say I love it. The magnet is powerful enough to hold ...",
      "text": "Had tgis product for months now and I have to say I love it. The magnet is powerful enough to hold your money and the wallet is really nice looking. If you have alot of cards be aware that this product can only hold 5-6 cards. If you try more, it'll be to tight and they might get stuck.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Mart",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "Works as expected",
      "text": "Fits an id and about 3-4 credit cards perfectly. Cards are pretty easy to get in and out, so that's a plus. The magnet seems strong enough to hold a decent amount of cash. I typically have $40-60 on me at any given time, and it has no problem. YMMV based on how many bills/cash you expect to carry.",
      "rating": 5.0,
      "verified": true,
      "author": "Scolexis",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "If you sit all day you need this!",
      "text": "Totally Awesome. Real Leather with quality stitching. Magnet is strong. Cards fit a little too tight at first but have loosened up a little. Definately will not fall out.",
      "rating": 5.0,
      "verified": true,
      "author": "ELothamer",
      "helpful_votes": 0,
      "publication_date": 20170523
    }
  ],
  "product_meta": {
    "title": "Alpine Swiss Men's Wallet Leather Money Clip Thin Slim Front Pocket Wallet, Gray",
    "rating": 4.5,
    "feature_bullets": [
      "Genuine Leather",
      "Magnetic closure",
      "Fully Lined with faux sheepskin fur including foot bed for comfort and warmth",
      "Can be cuffed to show fur trim detail. Great Aussie Classic Heritage Style",
      "Thermoplastic Rubber Outsoles - Treaded. The outsole is Flexible far superior to Stiff EVA Soles",
      "Heel Guard. Tag less foot bed",
      "Popular 12\" tall mid-calf height. Circumference opening is 14\" for size 14"
    ],
    "categories": [
      "Men",
      "Accessories",
      "Clothing, Shoes & Jewelry",
      "Wallets, Card Cases & Money Organizers",
      "Wallets"
    ],
    "price": "",
    "specifications": {}
  }
}