{
  "website_summaries": [
    {
      "verdict": "A low-priced thermometer with an impressive temperature range.",
      "pros": [
        "With a temperature range of -58°F to 1,382°F and a distance-to-spot ratio of 16:1, this is a reliable choice for kitchen use",
        "Battery included"
      ],
      "cons": [
        "A few customers received defective products"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "She gave me that same exasperated \"my husband is a nerd\" look I've come to know and love.",
      "text": "The first time anyone gets an IR temperature probe there will be playing. I spent about an hour pointing it at things and letting my wife know what the reading was. She gave me that same exasperated \"my husband is a nerd\" look I've come to know and love.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Wade",
      "helpful_votes": 75,
      "publication_date": 20171219
    },
    {
      "title": "Terrific as either a tool or a toy.  Useful and fun",
      "text": "We use it constantly both as a tool and as a toy. Frying pan: 320. Heater vent: 73 (that's why that air feels cold coming out of it). I've used it reheating food and deep-frying. We took it to an unheated warehouse during the cold snap and \"shot\" the water pipes. 34; a little too close for comfort. We got a heater for the space. I did not realize I would use this as much as I do, and enjoy it so well. It is accurate across the range I can test. (Ice water 32, boiling water 211 - about right for my elevation). Shooting the inside of the oven matches my other oven thermometer. I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "AvatarDad",
      "helpful_votes": 32,
      "publication_date": 20180202
    },
    {
      "title": "Worked great til it stopped working at all less than a year later",
      "text": "Bought it in October, used it sparingly ( maybe 20 to 30 times max) and went to use it today and it was just plain dead, tried a new battery took it apart to see if it was anything obvious, I couldn't find anything wrong besides the fact it just didn't work anymore. For the price I didn't expect much but at least 1 year would have been nice",
      "rating": 1.0,
      "verified": true,
      "author": "Zacvr",
      "helpful_votes": 33,
      "publication_date": 20180711
    },
    {
      "title": "Don't buy electronics early",
      "text": "Bought this early for a Christmas gift for my husband. Opened on Christmas, does not work, replaced the battery with a Duracell, still crap. Can not return, due to when I purchased it. Husband was not impressed needless to say.",
      "rating": 1.0,
      "verified": true,
      "author": "Suzanne Babbitt",
      "helpful_votes": 22,
      "publication_date": 20190101
    },
    {
      "title": "Easy to use, quick temp measure of a point or an area.",
      "text": "Easy to use. Visible demonstration of the temperature of an exposed steam pipe (300 deg F) and the need for insulation. Tip: ideal measure distance about a foot. Do not be decieved by the accurate laser pointer. That only shows the center point. The further back you are, the more it averages temp over a wider area. Tip: some mirror-like surfaces reflect your temp and give inaccurate readings.",
      "rating": 4.0,
      "verified": true,
      "author": "Rosenberg",
      "helpful_votes": 4,
      "publication_date": 20190512
    },
    {
      "title": "It’s accurate and fits in a drawer in the kitchen.",
      "text": "Takes all the guess work out of griddle temperatures. My pancakes and hamburgers cook up better since I started using this to set the flat griddle temperature with this tool. I bought another brand years ago and the prices sure have come down. I checked it’s accuracy against a lab thermometer and it was within a degree or two. You want your griddle at 375? This tool will tell you if your there. It does have a laser pointer you can turn off if you want.",
      "rating": 5.0,
      "verified": true,
      "author": "Rick S.",
      "helpful_votes": 4,
      "publication_date": 20181129
    },
    {
      "title": "Does the Job, but readout can be confusing",
      "text": "The product is great. Gave it as a gift to my grandpa and it works properly. I didn't compare it to anything for accuracy, but it seemed right. We used it for a pizza oven. The only reason I gave it 4 stars vs 5 stars is that even though it calculates over 1,000 degrees F, there's only 3 digits, so if the temperature is 1,200 degrees F, the digital readout says 200 and nothing indicates that you need to add a 1 to the front. Easy to use common sense, but they should have thought about that when they made it read 4 digits.",
      "rating": 4.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 4,
      "publication_date": 20190811
    },
    {
      "title": "Very Consistent",
      "text": "I tried other similar units, this one has been very consistent. I purchased 3 units over a few weeks, they all give the same reading, even past the decimal point! I do electroptics repair and this is a hand tool for reading laser diode temperatures. Very handy for checking refrigerator. Bottom line, it's one of those things you never though you needed until you have one. Only complaint is I wish it had a pouch or case to keep it , instead of the blister pack it came in.",
      "rating": 4.0,
      "verified": true,
      "author": "JCA919",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "My wife is very annoyed",
      "text": "My wife hates me running around and announcing what temperature everything is. In my experience it is accurate to within half a degree Fahrenheit. Great for cooking. Been using it constantly for the last 6 months (Or however long ago I bought it) and still haven't had to replace the included battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Howard Hughes",
      "helpful_votes": 3,
      "publication_date": 20190314
    },
    {
      "title": "Fast readings",
      "text": "Great device. Fast and easy. The only difficultly (minor) is that I didn't see how to access the battery. I knew it was in the handle, but I saw no markings for how to open it. The instructions only showed the battery being replaced, with the handle only partially visible. They seemed to show the inner portion sliding down, but it turns out the inner part of the handle flips down. You need to open it near the trigger. Such a minor issue that the device still rates 5 stars.",
      "rating": 5.0,
      "verified": true,
      "author": "DGA Director",
      "helpful_votes": 7,
      "publication_date": 20170802
    },
    {
      "title": "Excellent temp monitoring solution",
      "text": "I work as a gaffer (electrician) for an audio/video department, and we have many lights in a studio that get HOT. There’s also a sprinkler system that we have to be careful with sources of heat. I got this laser thermometer to be able to monitor temperatures of lights and make sure nothing is getting too crazy. It works perfectly. Very simple, point and click to get the temperature. You can hold the trigger down to view live changes, or let go to lock in the temperature. I also want to point out that the manufacturer, Etekcity, is phenomenal. Excellent customer service and very friendly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason G",
      "helpful_votes": 2,
      "publication_date": 20180710
    },
    {
      "title": "Easy to use, no calibration option",
      "text": "IR thermometers are not as accurate as thermocouple measurements but this is good for taking a quick reading. Although some IR thermometers models have the provision to change the emmisivity values (this one doesn't), they have their upper limit of accuracy. Recommended for hobbyist purposes. Not the best tool where accuracy of scientific measurement is a must. This Etekcity thermometer does not have the option of calibrating it from a known temperature.",
      "rating": 3.0,
      "verified": true,
      "author": "Rasin",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "Works great, many uses, pizza stone, brewing different kinds of tea and more",
      "text": "Easy to laser point, fast measure, holds the measurement number, and has back lighting for dim or bright light conditions. Works for checking in and out temp of central air conditioning. Also works great to check temp of my tea, as a I like to brew my green or finer Darjeeling tea at lower temps than my black teas. Works great for my pizza stone in kitchen grill or on outside charcoal grill pizza stone. Wish had one of these years ago. Owned for just a few days, so hope holds up for a few years, but seems well built. Simple, no bells and whistles, just the feature you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Life is for living",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Does its job well",
      "text": "Used it for couple of weeks and it works great so far. Temperature display on screen is easy to read and have a hold option to read it after pointing at something and getting the temperature. You can also point and keep moving to see the temperature changes. It puts a laser dot so u can know where is it pointing at. No idea how accurate it is since i dont have other way to find it really :)",
      "rating": 4.0,
      "verified": true,
      "author": "Seattle Jogger",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "Works like a charm...",
      "text": "Really like this toy I got (NOT really a toy)...works great. First, I got this for when my wife and I go RVing with out Fifth Wheel. I use it to check HUB temps on my Trailer Tires for Bearings going bad...works great and helps to relieve any potential stress. Also have fun with it at home checking the temps of everything including but not limited to; my cat for when she loves to chase the red dot...the tv to see how hot it is...my beer to see if it's still chilled and how fast it gets warm...etc...you get the idea.... It works great...get one.......",
      "rating": 5.0,
      "verified": true,
      "author": "mjpomante",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "I can't stop taking temperature readings... :)",
      "text": "Loved playing with this. I even read the temperature of our gold fish and our cat. :) Pointed it at our fire pit and it read over 800 degrees. Seems to be quite accurate. Highly recommend just to play with. Got one for my dad to play with.",
      "rating": 5.0,
      "verified": true,
      "author": "Javanni LLC",
      "helpful_votes": 5,
      "publication_date": 20180202
    },
    {
      "title": "So to make sure wasn't batteries tested them with meter they were good. So my conclusion is it is a pile ...",
      "text": "Just revived this this today. Was suppose to come with battery but did not, no big deal had a new pack of 9v batteries put one in pulled trigger nothing. So put another battery in and once again nothing. So to make sure wasn't batteries tested them with meter they were good. So my conclusion is it is a pile of junk and will be sent back. Don't waist your money.",
      "rating": 1.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 8,
      "publication_date": 20180523
    },
    {
      "title": "Nicer Than Expected",
      "text": "I was very pleasantly surprised when this arrived. In the pictures on Amazon it looked like cheap plastic, but it’s actually a much nicer material. It actually has a more premium, soft “grippy” feel to it that I didn’t expect. Overall it feels fairly durable. The laser and backlighting features work well, and the auto shut off is a nice battery saving feature. Don’t really have a way to test the accuracy. The temperatures appear on the screen in basically real time, with no delay.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom D. ",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "You'll find lots of unexpected uses",
      "text": "Very happy purchaser. Bought it to use for measuring earth temp drop during solar eclipse but have already found lots of uses around the house, both funny and practical. Great way to measure temperature before frying/grilling food for example, or temp difference to balance AC vents around the house, or your friends' skin on a cool summer evening sitting out on the patio, etc... Very solidly build with nice no-slip rubber grip.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Leslie",
      "helpful_votes": 2,
      "publication_date": 20170808
    },
    {
      "title": "Quick and easy",
      "text": "My husband is growing plants in a green house and wanted to know if the temperatures were even or if he needed more or less heat in some areas. The plants are a tad dense, so him climbing around them tends to damage them, so that’s why I got him this gun. He was able to detect a decent shift in temperature towards the middle of the plants and once he fixed it, no more issues. This temperature gun is why. It’s likely off by a degree or two, but that’s A OK by us.",
      "rating": 4.0,
      "verified": true,
      "author": "R. W. Eggert",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Defective unit but excellent customer service",
      "text": "Changing rating to 4 stars for excellent customer service. Replacement being sent out now. My unit works great except there is some constant battery drain. I install a new battery , use it once. Next time I go to use it and the battery is dead. I don’t know if there is a short, or the auto shutoff doesn’t function.",
      "rating": 4.0,
      "verified": true,
      "author": "Dana Johnson",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Husband loves it!",
      "text": "My husband built his own pizza oven so I got this for him for his birthday. OMGosh he loves it. It really helped him to know the temperature level of the oven base, too hot and the bottom of your pizza gets charred. Just so you know, (in degrees) the back wall of the oven was 800, the top was 900 and the bottom was 700. He waited for the bottom to cool down to about 550 to get the best crust.",
      "rating": 5.0,
      "verified": true,
      "author": "DoveSoup",
      "helpful_votes": 5,
      "publication_date": 20160509
    },
    {
      "title": "Helpful tool",
      "text": "I use this IR probe in the kitchen, primarily to measure the temperature of cooking tools, pans, etc., to guide me. Be aware that the physics of IR temperature reading resulting from target emissivity may prevent it from displaying accurately. In particular, my shiny stainless steel griddle is problematic. A black cast iron griddle would read fine, as do my black non-stick skillets. For food temperature, where a couple of degrees is important, use a quick reading probe, such as the Thermapen.",
      "rating": 5.0,
      "verified": true,
      "author": "Farelegno",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "As I have already owned other similar product to compare with, this item dissapointed me!",
      "text": "Important notice before....I have already owned a similar item but designed by BASE TECH from Germany, which runs lot smarter on the below facts. Pros: higher range of temperature up to 550 degrees C (?) Cons: -hardly to read in usual/indoor or low light, it require supplementary maneuvre to find and push background light button -on reflective metallic surfaces, stainless .aluminium plates etc get random results far from the real temperature measured with classic touch thermometers -lazy system hardly follows faster/ dynamic temperature changes",
      "rating": 2.0,
      "verified": true,
      "author": "Franz",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "IT IS NOT FOR HUMAN TEMPERATURE READINGS",
      "text": "I went to ETEKCITY site and what the Amazon description of the product fails to mention is that: \"Note: Temperature readings from this devices are -for- inanimate objects. The measured temperature for humans or animals will not be correct.\" It would've been great if Amazon mentioned this very important detail.",
      "rating": 1.0,
      "verified": true,
      "author": "H. Passarelli",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "EtekCity does it again. These guys build great quality stuff and stand by it.",
      "text": "Bought this to go with a pizza oven for my camp chef stove. This gadget is very helpful because you won’t have to guess at your stone temps or anything. Has an led light to aim with so you can see exactly what its measuring. I even used it to check the air temps from my central ac vents. Very good tool and great $$ value.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis",
      "helpful_votes": 0,
      "publication_date": 20190527
    },
    {
      "title": "Handy and Accurate",
      "text": "This is easy to use, and continually useful for projects around the house or garage. I have access to an expensive Flir infrared video unit, and have compared spot temp readings from the two among several objects and temperatures. The readings have consistently matched within a degree or two. There are certainly objects and distances that this can't handle, and I don't know how well it'll hold up over the long term, but so far it's been money very well spent.",
      "rating": 5.0,
      "verified": true,
      "author": "Sidecar1115",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Useful and entertaining",
      "text": "I love this thing. I bought it to monitor machinery. Did a crude calibration and tolerances were very good. IT WILL NOT TAKE THE INTERNAL TEMPERATURE OF THINGS. Like your dog, Kid or fish tank water. It will give you the temperature of a bearing or metal part. When I have to take a temp reading,I find myself aiming it at everything. I get sidetracked easily.",
      "rating": 5.0,
      "verified": true,
      "author": "charles lozano",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Works great and a lot of fun to play with.",
      "text": "Works great. The first day we opened it everyone in the house went running around temping everything they could think of. I know it's not meant to take a body temp but the kids thought it'd be fun to see if it could. They took their temp with a thermometer and then took the temp of the back of their throat with with this thermometer and it gave exactly the same reading as the oral thermometer so I'd say it's pretty accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "shannon melgar",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "sent it back",
      "text": "seems to work ok for temperatures in everyday, normal ranges. ice, a light bulb, a tv... the results were reasonable. but results varied wildly trying to get the temperature of a hot pan. it would fluctuate hundreds of degrees at a time, then sometimes say it was colder than room temp. that made it too unreliable. i wanted it to work, but i had to send it back.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason Lew",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "Using for consistency in cooking results - please consider this product",
      "text": "I like having control in my cooking. Control is about repeated results. Knowing what the actual temperature of a pan on the stove is compared to med-high setting on the dial is worth every penny paid for this Lasergrip 800. Knowing actually how hot the grill plates are versus the dial gauge on the hood is worth every penny paid. NOW I can know what those temperatures are and have comfort knowing that I can repeat my recipes and have consistent results. This is a great product - so far. If there are changes, I will revisit my post and provide an update.",
      "rating": 5.0,
      "verified": true,
      "author": "Texascook",
      "helpful_votes": 0,
      "publication_date": 20161128
    },
    {
      "title": "Pays for itself first day.",
      "text": "Liked everything about the product. Good laser for exact aiming. Accurate temperature readings. Good display. Tested with several known temperature sensors. Checked home doors, walls and windows for temperature issues. Checked refrigerator and freezer temps and adjusted for cost savings. Building meat smoker and checked burner temps. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "jeff w halbur",
      "helpful_votes": 2,
      "publication_date": 20180826
    },
    {
      "title": "Terrible product",
      "text": "As a physician I need an accurate thermometer to screen patients for Clovis 19. This item is advertised for being accurate and I took a chance. So far it has never been accurate reading 4-5 degrees less than medline thermometer on the same patients. When I called Etekcity they told me that this was not a medical grade thermometer. Shame on them. False advertising on accuracy and bogus excuse. Shame on amazon for carrying there products. Patients lives are put at risk with fraudulent products like this!!!! Don’t buy this product",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Accurate, fun, easy to use!",
      "text": "I am thrilled with this device -- it is at once both truly useful and fun to use. Just point, pull the trigger and you get a measurement! As far as accuracy is concerned, it seem spot on: the surface of a boiling pot of water measured 210 degrees, a pan with shimmering oil 320. I am thrilled with this device.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael B.",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Simple to use, accurate.",
      "text": "Very straight forward use. Reading instructions is not necessary. Very accurate. My only problem was the packaging. Getting the product out required a utility knife. I accidentally cut the display while opening package. Etekcity, if you read this, please consider redesigning packaging so that tools are not required to open it.",
      "rating": 5.0,
      "verified": true,
      "author": "GSBalt",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "IT WORKS!!",
      "text": "Bought this item to check the temp on a Camp Chef 600 griddle. It seems to work well, quickly and is easily read. I've made no attempt to calibrate it. It definitely picks up the variances of temps in the different areas of the griddle. Living in AZ I have tested sidewalk and street temps. Almost as hot as my griddle! No negatives thus far",
      "rating": 5.0,
      "verified": true,
      "author": "Martin H JacobyTop Contributor: Cooking",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "Accuracy",
      "text": "I bought the tool to use to measure temperatures in ovens and HVAC units. During a training class, several students had their own inferred thermometer. Their readings within 2 to 3° from each other. My thermometer was 40° hotter. Re-tested the oven and got the same result. I Call the manufacturer customer service department, they recommend I exchange it for the exact model. I decided to do that and will retest when I get the replacement",
      "rating": 3.0,
      "verified": true,
      "author": "Pat Kelly",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Bad buy",
      "text": "Don't buy this. The readout is incredibly slow and the temps are all over the place on every object I test and at every distance. Waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Joegs",
      "helpful_votes": 4,
      "publication_date": 20190204
    },
    {
      "title": "WOW!  Just . . . WOW!",
      "text": "If you sous vide meat, and need to sear it after cooking it, this thing absolutely rocks. Just heat up your cast iron skillet, bring it to whatever temperature you want to use to sear it using this, and . . . do it! I'm amazed at how often I use it for other things: I confirm my sous vide water temperature, for example. It's also just plain fun to use!",
      "rating": 5.0,
      "verified": true,
      "author": "B. L. OCONNOR",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "A very useful product",
      "text": "The professional HVAC guy who does the air conditioning/furnace tune up for me uses a infrared laser gun to check out how the air flow/temperature of each of my room. This makes me thinking I can use a similar one to make sure my house is comfortable with the air flow and temperature. The Lasergrip 800 Infrared thermometer helps me to find out the temperature of each vent/register of each room in my house and this helps me to adjust the opening and probably later add more insulation for those vents that is colder in winter/warmer in summer. A very good product.",
      "rating": 5.0,
      "verified": true,
      "author": "heygirlhey",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Just got my lasergrip 800 and I like the feel of it in my hand",
      "text": "Just got my lasergrip 800 and I like the feel of it in my hand, but not sold on the actual accuracy which I can't find exact specs. I have been going around and measuring the temp of items around the house compared with readings from another non-contact digital thermometer I have and the readings on the Lasergrip 800 seems to really jump around a lot +/- 10 degrees. Other than that, which when it boils down is the most important features it's good and I could see it getting a lot of use. Just need to decide whether to keep it or not.",
      "rating": 3.0,
      "verified": true,
      "author": "Robert M.",
      "helpful_votes": 2,
      "publication_date": 20161231
    },
    {
      "title": "Easy laser thermometer",
      "text": "I bought this to use with my Ooni pizza oven , but the oven isn’t here yet. I have however used it when frying chicken to determine the heat (loosely) of my oil. I don’t know if it was totally accurate as I don’t think this is what it was meant for, but it helped!",
      "rating": 5.0,
      "verified": true,
      "author": "Jen Toll",
      "helpful_votes": 0,
      "publication_date": 20201021
    },
    {
      "title": "good light duty infrared meter that basically does what it was made for provide temperatures quickly",
      "text": "works well for an in-expensive infrared meter. Had an expensive name brand for many years it had worn out from many years of use. Needed an in- expensive meter to use as I'm semi- retired now and won't need a top of the line meter that makes coffee and heats my lunch. This meter seems to do what I ask of it without hurting my wallet.",
      "rating": 4.0,
      "verified": true,
      "author": "wayne",
      "helpful_votes": 0,
      "publication_date": 20170723
    },
    {
      "title": "Etekcity Lasergrip 800 Digital Infrared Thermometer",
      "text": "After much research, I chose this thermometer. I received it in a timely fashion. I was able to use it a couple of times. It seems accurate, but I have no way of telling just how accurate it really is. I use it to test the temps on the surface of my 22\" Blackstone griddle. That way I don't have to guess just how hot the surface it. I feel sure I will enjoy using this thermometer.",
      "rating": 5.0,
      "verified": true,
      "author": "WilsonB",
      "helpful_votes": 0,
      "publication_date": 20190320
    },
    {
      "title": "Spend your money on a better one.",
      "text": "I feel like for $25 it would have lasted longer...... I've had it for a little over 3 months and it's not working anymore. I dont use it often. I dont use it near liquid, no magnets, or near anything hot. The screen keeps popping up random things and shuts off and there is no way to contact costumer support. I need a new one and I wont be getting this again......",
      "rating": 1.0,
      "verified": true,
      "author": "MadiIzzy",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Don't use this for reptiles unless you want to endanger them",
      "text": "Don't buy this. There are better ones at homedepot that are the same price or cheaper. This is not accurate at all, I was hoping to use this for a snake enclosure, it gives me a different temperature when I measure the same spot 30 seconds apart. Bounced from 93 degrees to 84...wtf. you also have to press the backlight button every time you want to use it, you would think it would just stay on for at least a minute or two.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "works great!",
      "text": "This thermo gun works great, easy to use; however, mine is somehow always 1 degree off compare to other devices I have around the house including my main house temp control. I am not sure if it was designed that way or it's just my thermo gun.",
      "rating": 4.0,
      "verified": true,
      "author": "AmaGuess",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "I use it for grilling and indoor cooking",
      "text": "So far this has been great. Very easy to use and comfortable in hand. I can't actually attest to the accuracy as I see some reviewers say that under certain circumstances it may be off by as much as +/- 5 degrees. For me, this tool serves it's purpose just fine and am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "JFR",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "good little tool",
      "text": "This thing makes a great toy! It is a digital thermometer, but the red laser light is excellent for cat tormenting. I use this frequently to check the temperature of pans (is it hot enough to put the french toast in yet?), and my husband (who actually bought it) uses it for all kinds of things. It sits out in the kitchen for easy access. We've had it for several months, and it was a good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "JanitaB",
      "helpful_votes": 3,
      "publication_date": 20151202
    },
    {
      "title": "Good Product, Reasonable Price",
      "text": "Uses are whatever you might want to use it on, other than to take your own temperature. I've used it to check food after microwaving, check electrical distribution panels and motors for excessive heat, and to check barrel temp at the rifle range. It has worked well with every use to this point.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190413
    },
    {
      "title": "Easy to use, utility",
      "text": "Used the Digital Infrared Thermometer for the first time last night and it was amazing. My wife is in the personal products business and she had been having a problem regulating the temperature in her kitchen lab for body products. This was the first batch that she was able to fully control the temperature, resulting in a great outcome! Easy to use and priced effectively. We did not need any of the bells and whistles that come with other products; This does the job, and does it well.",
      "rating": 5.0,
      "verified": true,
      "author": "DavidP",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Cool thing to have",
      "text": "I've always wanted one of these and finally decided to buy one. This one looks exactly like the craftsman version and works exactly the same. It's crazy to see how fast a stove heats up, or how exterior walls are much colder than interior walls in the winter time. So many different things to use it for. Best thing I used it for was to find out if my brakes on my car were working correctly. After driving for awhile, I got out and pointed the laser on my rotors, which should have been really hot, however my rear right rotor was only 80 degrees, telling me that my brake caliper wasn't working. Great tool to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Zach",
      "helpful_votes": 2,
      "publication_date": 20140401
    },
    {
      "title": "Not accurate for high temperature aluminum",
      "text": "Bought this to braze/solder aluminum with \"low temperature\" aluminum brazing rod. The brazing rod melts at 750 deg F, and aluminum melts at 1050 deg F. This temp gauge showed 680 deg F, then the aluminum melted, ruining the pieces. Arg!",
      "rating": 1.0,
      "verified": true,
      "author": "R. Chung",
      "helpful_votes": 0,
      "publication_date": 20200506
    },
    {
      "title": "Does not measure the surface temperature of the sun.",
      "text": "This thing does an amazing job when pointing it at fires and stuff to measure the temperature. But I was surprised to find out it can not tell you the surface temperature of the sun, even if you are pointed right at it. It also can't tell me the temperature of the moons surface either. But it's pretty cool regardless.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason S",
      "helpful_votes": 4,
      "publication_date": 20161122
    },
    {
      "title": "I should have bought this years ago.",
      "text": "This has been a very handy tool for us, earning a spot beside my OBD-II reader and tach-dwell meter. It's quick and easy to use, sturdy enough to use in a shop or on the road, and seems to be reasonably accurate. Most recently it helped diagnose engine problems by showing me that two cylinders on my son's car were running colder than the others--they weren't not running at all, which would have been obvious, and the problem only happened when the engine was running so it wasn't visible with a compression test. That test alone makes this more than worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Allen B",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "I Love it",
      "text": "I have wanted one of these for years but just never bother to look them up, figured they would be too expensive for a toy, which for me is all it is. How can I rate the accuracy though I have nothing to compare it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Jenkins",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "Great gaget at an unbelievable price",
      "text": "Great gadget. Works perfectly. It's been great fun going around my house measuring the temperature of just about everything. Seems to be accurate within a degree or two based on measurements taken by my thermostat and other temperature measuring devices. I would definitely recommend it and buy it again.",
      "rating": 5.0,
      "verified": true,
      "author": "SLR",
      "helpful_votes": 2,
      "publication_date": 20170420
    },
    {
      "title": "Good thermometer, but Fahrenheit display is limited",
      "text": "I bought this thermometer based on its advertised upper range of 1382 degrees Fahrenheit for use with a small aluminum forge. The thing that I didn't see mentioned anywhere is that the LCD display only shows three digits to the left of the decimal point! Once, you exceed 999, the display simply omits the thousands digit, so it displays 0 - 382 instead of 1000 - 1382. This could potentially be dangerous if you don't already know how hot the thing you're measuring likely is or haven't been watching the temperature increase. I'll be using mine in Celsius mode.",
      "rating": 4.0,
      "verified": true,
      "author": "Aaron S.",
      "helpful_votes": 3,
      "publication_date": 20160330
    },
    {
      "title": "Etekcity Lasergrip 800 Digital Infrared Thermometer Laser Temperature Gun",
      "text": "Okay product. Once you get it tuned at a temperature you know is correct, it works well enough to test some items accurately. Seems to fluctuate while you hold it on a hot item. Place a candy thermometer in hot water and watch the temp. The gun gets it close a couple of times then seems to drift a bit. Otherwise not bad.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel M.",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Great little laser thermometer",
      "text": "Great little laser thermometer. Has about a 1 degree tolerance if you are measuring withing the distance specified. Keep it as perpendicular to the surface you are measuring as you can. You still get accurate readings at an angle to the surface, but its harder to estimate the distance and that plays a major role in the accuracy of the thermometer.",
      "rating": 5.0,
      "verified": true,
      "author": "M. South",
      "helpful_votes": 0,
      "publication_date": 20180510
    },
    {
      "title": "IT DOES NOT WORK",
      "text": "I am sending it back because it does NOT WORK.. I have followed the directions, put in the batteries properly as instructed. and It still does not work. Therefore I am returning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dana Melendrez",
      "helpful_votes": 3,
      "publication_date": 20180616
    },
    {
      "title": "Excellent device.......",
      "text": "Great device for measuring temps of various devices. Purchased to check on operating temp of doorbell/thermostat transformer. Hot to touch, but measured within mfg specs, worked perfectly. Good value as well.",
      "rating": 5.0,
      "verified": true,
      "author": "David B.",
      "helpful_votes": 0,
      "publication_date": 20191007
    },
    {
      "title": "Because zero stars isn’t an option",
      "text": "This product doesn’t even come close to accurate reads- unless each person I have tried it on is a zombie- then perhaps their temp is really 91F-",
      "rating": 1.0,
      "verified": true,
      "author": "jazz14",
      "helpful_votes": 4,
      "publication_date": 20180801
    },
    {
      "title": "but it's cool. Must be somewhat reasonable though b/c it seems ...",
      "text": "No idea how accurate it is, but it's cool. Must be somewhat reasonable though b/c it seems close to what the oven says and also can tell a difference b/t the outside and inside of the toaster oven that seems reasonable. Actually was useful when checking vents in house to see if AC started working again.",
      "rating": 5.0,
      "verified": true,
      "author": "Eggs",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Not as accurate as I was hoping for",
      "text": ". I work in a plastic molding facility and was looking for something that I could use to tell temps on the barrels as the plastic is being processed. Also the difference in mold and cooling water temperatures during the processing. This is not that accurate.",
      "rating": 3.0,
      "verified": true,
      "author": "Cindy M. Mace",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "I wasn't disappointed and would recommend it",
      "text": "Fast and accurate temp measurements. I use it to measure the temp of my branding iron (heated using a propane torch)... allows consistent branding results for wood, leather etc. This particular model had a higher temp range than most others.. I wasn't disappointed and would recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Rodney Wise",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Love it!",
      "text": "This works great for checking my temps when making soap.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 0,
      "publication_date": 20190403
    },
    {
      "title": "ACCURATE READINGS",
      "text": "Just purchase a second \"Lasergrip\" for our kitchen in our second home. Accurate readings. My husband is sold on this product. His peanut brittle has been perfect ever since we purchased the \"Lasergrip\". Can't say enough about this product, meat is cook to perfection due the accuracy of the laser gun. Highly recommend this laser gun!",
      "rating": 5.0,
      "verified": true,
      "author": "Eva",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Accurate",
      "text": "Very accurate readings after using it for a couple days. Comes with the battery. Feels cheaply made and at this price you really cannot complain. Will update if problems arise. So far so good.",
      "rating": 4.0,
      "verified": true,
      "author": "RG",
      "helpful_votes": 0,
      "publication_date": 20191014
    },
    {
      "title": "Extremely accuarte! Great Price!",
      "text": "I used the product right away today on the job and my buddy has a Fluke and wanted to tell me how much better his was. So we both measured a bowl of ice water and used several other devices to confirm the exact temp and my gun was closer then his $80 Fluke! We tested multiple times and ways and my gun always came out on top. Thank you for the amazing product!",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Bertoldi",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "Easy to use and fairly accurate.",
      "text": "Works great for testing the bed temp on my 3D printer. It's also been beneficial for my controlled tests, for the purpose of protecting vital components of high powered, amateur rockets. The backlight has been very nice in low light conditions as well. Oh and my black lab likes it too, well the laser dot. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Robot Cowboy",
      "helpful_votes": 0,
      "publication_date": 20180312
    },
    {
      "title": "Super Bummed!",
      "text": "I was stoked to get this heat gun and put it straight to use but it never worked. I went to the store and got a new battery for it hoping that would be the problem, but NOPE. I missed my window to send back the device, so guess I am stuck with a non-working product. Says 2 year warranty but not sure who to contact.",
      "rating": 1.0,
      "verified": true,
      "author": "lena williams",
      "helpful_votes": 2,
      "publication_date": 20181202
    },
    {
      "title": "Cast iron good, sapphire bad.",
      "text": "This worked great to determine the surface temperature of my cast iron pan. This wasn't great at determining the surface temperature of industrial sapphire when heated. I suspect that may be a limitation of infrared, but I'm unsure. It may also be that it was too small of a target, even at a 3 inch distance (target was about 1/4\").",
      "rating": 4.0,
      "verified": true,
      "author": "JE",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Awesome",
      "text": "I was able to season a cast iron pan by keeping it in a very narrow temperature range over heat. Came out perfect like black glass. The applications are endless!",
      "rating": 5.0,
      "verified": true,
      "author": "Clay",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "this is the most fun, useless toy that a person can buy",
      "text": "For those of us that don't work in construction or electric engineering or similar fields of work, this is the most fun, useless toy that a person can buy. You will seriously go around getting temperatures of anything and everything you can get a temperature on. You shoot it just like a laser red dot and it will give you the temperature of where the dot is hitting! It's almost magic. Backlight is bright and LCD screens is very big and legible, Fantastic device and really a great gift for anyone, but especially for people that love really fun and useless things.",
      "rating": 5.0,
      "verified": true,
      "author": "samuel park",
      "helpful_votes": 2,
      "publication_date": 20150111
    },
    {
      "title": "Not Accurate",
      "text": "Should have listens to the other reviews because this thing is a big piece of crap! Don't waste your money on this. You can take the temperature of an area 6 time & get 6 different reading.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason A. Dessenberg",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "Not accurate at all",
      "text": "Well I really wish this thing worked right. I'm following the recommended distance of use and still getting at least a reading that's 200 degree less than what it is. I should be getting a temperature reading of 600 flat but 9only getting 400 leaving me to conclude that this thing is not at all accurate... my other device is so I know this one is the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "A really great Nerd toy!",
      "text": "I got this, just for fun, on Prime Day. It's an amazing Nerd toy. I've been using it to check the temperature of my grill grate and my cast iron skillet. There's been a heat wave here, so I also use it to check the temp of table tops on the patio and stuff like that. It's extremely intuitive - literally point and shoot. I'm not sure I can say what useful purpose it provides, but it's a great tool... for something.... probably.",
      "rating": 5.0,
      "verified": true,
      "author": "Writerjeff",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "Exactly as described.",
      "text": "Exactly as described. Reads infrared heat using a sensor. It does NOT use the laser to take its readings. Neither do any of the other heat guns out there.",
      "rating": 5.0,
      "verified": true,
      "author": "SoCal Chlln",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Great for baking",
      "text": "I use this mostly for baking, jam making, and chocolate & candy making. It works great and is so much easier to use than a candy thermometer. Makes baking complex, temperature dependent items so much easier",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Jordan K",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "oops",
      "text": "Very handy for checking the temperature of molten metal but unfortunately I dropped mine into the forge. It lasted about 1 second. Better luck next time..",
      "rating": 5.0,
      "verified": true,
      "author": "ER. Lee",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Accurate",
      "text": "I bought this to figure out the best spot to locate a magnetic digital temperature sensor on my woodstove. Straight forward and works right out of the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger CSK",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "accuracte enough for the price",
      "text": "point laser at mercury thermometer fifteen feet away reads within 2 degrees",
      "rating": 4.0,
      "verified": true,
      "author": "Ronald  W Pierce",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Such an important tool to have.",
      "text": "Check the temperature of anything......your car radiator, the barbeque, air flowing out of your vents inside. It's an accurate way to see if things are working correctly.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Weiss",
      "helpful_votes": 0,
      "publication_date": 20201019
    },
    {
      "title": "went from instant kitchen gadget to crazy fun family toy",
      "text": "my family still uses this for cooking when necessary and its an excellent tool for the job. we have tested it amongst various other thermometers and find it to be one of the best! we also use it for fun now and then to take temperatures of random things especially people.",
      "rating": 5.0,
      "verified": true,
      "author": "steve s.",
      "helpful_votes": 0,
      "publication_date": 20190319
    },
    {
      "title": "Great product and fast shipping.",
      "text": "So far it has a great look and feel as to quality and has been accurate. It's easy to use and access the battery. I haven't had it long enough to rate battery life and overall durability.",
      "rating": 5.0,
      "verified": true,
      "author": "Diego S. Terres III",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Works as it expected",
      "text": "It's a little slow to register and display the temperature, but it does and it's accurate. In the past, I've had a couple that were considerably more expensive. Those units displayed the temp instantly upon squeezing the trigger,",
      "rating": 4.0,
      "verified": true,
      "author": "Don MarcosTop Contributor: Pets",
      "helpful_votes": 2,
      "publication_date": 20171026
    },
    {
      "title": "Great product - what a shame it broke already...",
      "text": "This thermometer is both fun to use and a great tool. I use it for baking bread, cooking and to gauge outside temps in the winter. However, it has already broken and there is only a 2 year warranty on the product. When it was purchased it was 25 and now the price is up to 37 - contemplating other models with better warranty/support.",
      "rating": 3.0,
      "verified": true,
      "author": "Rune_on_the_road",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Stopped working after about 4 short uses",
      "text": "This unit worked when I first got it then when I really needed it to cure in my pizza oven. It was dead. Tried 2 different new batteries but it really was non-functional. Returning for refund. I guess you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "Colorado golfer",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Over heat of engine block.",
      "text": "Go this for my daughter to check the temp on her Jeep. Her husband is not a mechanic and she takes care of the cars. Has over heating on engine after thermostat change.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "We always wanted a infrared thermo reader.",
      "text": "We just got the product in today... Everything we tested around the house worked well. Very easy to use and overall well made piece.",
      "rating": 4.0,
      "verified": true,
      "author": "William L. Thompson",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "A great one for its price.",
      "text": "I get what I paid for and I would rate 5 stars if the field of measurement is narrower. I cannot afford to buy the thermal imaging device for a home project and used this. It takes me a while to get the spot I get different reading because field of measurement is too wide for less than 2mm in size components. If someone complaint about inaccuracy, think about the price paid for or else buy something with a few hundred dollars. I have no complaint for functionality and one to 3 degrees difference is negligible.",
      "rating": 4.0,
      "verified": true,
      "author": "Dave the Menace",
      "helpful_votes": 0,
      "publication_date": 20150330
    },
    {
      "title": "I’m an HVAC technician and I looking for with one more correct reading temperature.",
      "text": "Thank you for replaced to me another one. It’s working correctly and more better. I used every single day and to many times. I love it. I would like introduce to anyone who looking for temperature thermometer gun, it’s working great. I have been drop it 02 times from 3 feets high but no problem, still working well. Again, Thanh’s for this product I should give 5 stars for this product and your company business. Regards",
      "rating": 5.0,
      "verified": true,
      "author": "Hiep Nguyen",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Outstanding temperature tool.",
      "text": "Received early and in good condition. Works as advertised. Have already used for several applications such as grilling, wine temp and refrigerator/freezer and road surface temps as well as smoking meats. Verified with other other tools and this thing is fantastic and accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Gill",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Works",
      "text": "Purchased to check the temps on a catalytic converter on my car. Easy to read and use, comes with a 9V battery and worked \"out of the box\". Will it last? Would I purchase this if I needed it as an \"everyday\" tool or professional use? Probably not. For home use or a \"once in awhile tool\" definitely worth the money though.",
      "rating": 4.0,
      "verified": true,
      "author": "Juozas T.",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Gets the job done",
      "text": "Very easy to use. Accurate to within a couple of degrees. I'm only using to measure temperature of cooking surfaces, so I don't need it to be super accurate or precise. The only issue I have is that one of the surfaces is a pan or pot on an induction cooktop. The manual says to keep away from induction (magnetic) devices. Wish I had known that before purchasing.",
      "rating": 4.0,
      "verified": true,
      "author": "SteveOh",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Great for bearded dragons",
      "text": "Bought for my bearded dragon but I use it for everything",
      "rating": 4.0,
      "verified": true,
      "author": "Melanie",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Very accurate and easy to use",
      "text": "I have had the unit for approximately two months and find it to be very accurate and easy to use. I discovered that my wall over does not heat evenly and been able to map the areas of my Camp Chef grill. The light is very handy when grilling on winter days with fading light.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel F.",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Great product for the price",
      "text": "Great product for the price, I didn't expect much for the price anyway so very happy with the purchase, working fine, maybe not always 100% accurate but is enough for my needs",
      "rating": 5.0,
      "verified": true,
      "author": "Anir",
      "helpful_votes": 0,
      "publication_date": 20181217
    },
    {
      "title": "Great Temperature Gun & Cat Toy!",
      "text": "As stated in the description, this is not to test the temperature of people. It's great for checking the temperature of your oven or a skillet. Bonus: my cats love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Colette",
      "helpful_votes": 0,
      "publication_date": 20201016
    }
  ],
  "product_meta": {
    "title": "Etekcity Lasergrip 800 (Not for Human) Digital Infrared Thermometer Laser Temperature Gun Non-contact-58℉ -1382℉ (-50℃ to 750℃), Standard Size, Yellow & Black",
    "description": "NOTE1 The measuring surface is about 2cm below the infrared aiming point 2 For best accuracy the distance between thermometer and object of measurement should approximately be 14 17inches (36cm) Simple Operation - Point and Click! Are you looking for an easy way to get accurate temperature measurements? If so this Etekcity non-contact IR temperature gun is exactly what you need Just by one press of the trigger this thermometer will turn on the laser pointer shows target and the big LCD will read the temperature in less than 0 8 second 16 1 High distance spot ratio! This means you may measure the temp of a smaller area at the same distance compared to other 8 1 or 12 1 thermometers thus the readings are much more accurate! Features1 Laser targeting system for more precise aiming 2 Greater distance-spot ratio offers accurate results at longer distances 3 Safely measure hazardous or inaccessible objects 4 Standard 9V battery offers 14 hours of cumulative use 5 Auto-shutoff after 15 seconds to increase battery life 6 Instant-read-display on LCD Specifications Temperature Range -58℉～1382℉(-50℃～750℃ )Accuracy 2%Distance Spot Ratio 16 1Emissivity Adjustable 0 95(fixed)Response Time and Wavelength 500ms and (8-14)unrepeatability 1% or1℃Resolution 0 1℃ or 0 1℉Package Included1x Etekcity Laser grip 800 thermometer1x 9V DC battery1x User's manual",
    "rating": 4.5,
    "feature_bullets": [
      "BETTER ACCURACY The distance to spot ratio is 16 1 meaning the laser grip 800 can accurately measure targets at larger measurement area with the same distance compared with other thermometers with DSR 12:1 or 8:1",
      "TARGET QUICKER Measure surface temperature ranging from -58℉ to 1382℉/ -50℃ to 750℃ you can choose the unit from ℉/ ℃ A built in laser gives you the precision to hone in on the exact space you want to measure",
      "ADDED FUNCTIONS The LCD screen is backlit it also has an auto-off function to extend the battery life and features a low battery indicator so you never accidentally run out of juice (battery included)",
      "VERSATILE DESIGN Infrared technology makes this thermometer handy to measure the surface temperature of various objects especially temperatures above boiling points and below freezing points Use it when you are cooking and barbequing performing auto maintenance doing home repairs and a host of other tasks",
      "NOTE For best accuracy the distance between thermometer and object of measurement should approximately be 14 17 inches (36cm) Temperature readings from this devices are inanimate objects the measured temperature for humans or animals will not be correct FCC CE compliant Class 2 laser optical power 0.5-0.9Mw"
    ],
    "specifications": {
      "Product Dimensions": "7.32 x 3.94 x 1.57 inches",
      "Item Weight": "8 ounces",
      "Manufacturer": "Etekcity",
      "ASIN": "B00DMI62HM",
      "Item model number": "Lasergrip 800",
      "Batteries": "1 9V batteries required.",
      "Customer Reviews": "4.5 out of 5 stars2,922 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#772 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 25, 2013"
    },
    "categories": [
      "Thermometers",
      "Home & Kitchen",
      "Infrared Thermometers",
      "Temperature & Humidity",
      "Test, Measure & Inspect",
      "Industrial & Scientific"
    ],
    "price": 37.99
  }
}