{
  "website_summaries": [
    {
      "verdict": "This extra-sturdy little mower is a safe and fun replica that gives future gardeners something to play with while a parent is maintaining the lawn.",
      "pros": [
        "Extra-affordable",
        "Pull cord produces lifelike mechanical sounds",
        "Twistable key and clicking lever",
        "Removable gas can",
        "Beads pop as mover moves"
      ],
      "cons": [
        "Minimal assembly required"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Perfect gift for toddlers",
      "text": "My toddler is very passionate about landscape maintenance, or as he calls it \"mow guys\". We got him this lawn mower for his second birthday and this is hands down the most successful gift I have ever given someone in my entire life. He uses it daily and it has held up like a champ - no damage, wheels work perfectly, popping sound keeps popping as he uses it. Thank you toy universe for being clever enough to make a toy lawn mower!",
      "rating": 5.0,
      "verified": true,
      "author": "HipChickDigs",
      "helpful_votes": 17,
      "publication_date": 20171124
    },
    {
      "title": "It's Cute, But Don't Leave It Outdoors",
      "text": "This is a super cute law mower for little kids, it's nice thick plastic and not flimsy like some of the others and has the wonderful annoying little popper balls that little kids love as its pushed around. The only reason I didn't give it a full 5 star is the fact that if its left outside the color fades really quick even if it's in a covered garage pretty annoying as we've only had it for a little while and it looks as though we've had it for years.",
      "rating": 4.0,
      "verified": true,
      "author": "LTM",
      "helpful_votes": 8,
      "publication_date": 20190306
    },
    {
      "title": "Great toy but a bit noisy",
      "text": "Omg — my 18 month old son LOVESSSS this damn toy! My husband & I, not so much. It’s noisy & annoying but isn’t that what kids love about toys?! * I just wish it had more rugged wheels because he has a hard time pushing it outside in the grass as if he’s actually mowing. The front lip being low & the small tires make it hard to push in semi thick/tall grass. Other than that, great buy! Kids will love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Brandy Erwin",
      "helpful_votes": 5,
      "publication_date": 20190823
    },
    {
      "title": "Just a toy plain lawnmower",
      "text": "It showed up in my search for “bubble lawnmower” so I assumed it was a lawnmower that shot out bubbles while pushing and thought it would at least make some kind of sound. Nothings no. Boring! This is just a plain lawnmower. Plain! Very good quality just as expected from Little Tikes. We also had the pull string fake starter rope break on the 2nd day. Not very happy for the price.",
      "rating": 1.0,
      "verified": true,
      "author": "WOPMOMMA",
      "helpful_votes": 2,
      "publication_date": 20190922
    },
    {
      "title": "Lasted about an hour",
      "text": "We bought this for my sons 2 year birthday gift. He opened it yesterday morning. It was easy to assemble. He loves it! About and hour and a half after playing with it pushing it around, etc.... the part that you pull (to start the mower if it actually started) stopped retracting. He just turned two, does not have that much strength, and he’s not a rough boy and is not hard on his toys. I am really surprised, normally little tikes toys are more durable. This sucks.",
      "rating": 2.0,
      "verified": true,
      "author": "emj",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Godson LOVES it!",
      "text": "Every time he comes over, he does a B-Line for his little lawn mower and then proceeds to run around the yard for the next few hours. Sometimes he'll stop to pull on the \"starter cord\", and a FEW times it got jammed up, which made him think he broke it and therefore he almost broke down, but i could fix it by giving a slight little tug. Also, when he brings it inside with him and runs around on the wood floors, it doesn't leave scratches, so that's good. I've only had it since june, and he's visited 4 times already - i suspect if he COULD have broken it already, he would have!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucas",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Fragile gears, sturdy body.",
      "text": "This was the perfect gift for my 3 year old son! He wouldn't put it down the next 3 days. Haha! One big bummer was that my husband broke it first hour we had it, as he pulled the cord to get it to make the starting noise, and the plastic gears (yeah, I opened it up to see if there was anything I could do to fix it) sheared right through. So...don't pull the cord too hard. Otherwise, very satisfied. But I was pretty disappointed about the gears, since I specifically got this one because it made noise without batteries.",
      "rating": 4.0,
      "verified": true,
      "author": "Tai Sophia",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Loud popping mower.....",
      "text": "This mower is great for a active little boy I bought it for my son. little did I know he was going to drive me crazy with it there is a popper on the top that pops the marbles up and down and the handle keeps popping out... Big Big Big mistake it makes way too much noise. If you don't like loud noise Do Not Buy This Toy!!!.....",
      "rating": 3.0,
      "verified": true,
      "author": "Trevanita",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Won’t push on grass!",
      "text": "I looked at tons of kids mowers for my toddler since he loves to “mow” the grass along with daddy. This one seemed to be the best quality for the most reasonable price. The most disappointing feature is that it won’t push on the grass which defeats the purpose! The “deck” is so low that he can only push it on a hard surface (like our deck or hardwood floors). I bet it wouldn’t even push well on carpet. VERY disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great for kids, less so for parents",
      "text": "Our 2.5 yo loves this! It doesn't drive well over grass, and is VERY noisy indoors on hardwood. There is a piece on the back of the mower that will scratch up your hardwoods and laminate if your child doesn't play carefully with the mower. Despite all this it's his favorite toy, and a really good deal.",
      "rating": 4.0,
      "verified": true,
      "author": "Brenda P.",
      "helpful_votes": 6,
      "publication_date": 20160515
    },
    {
      "title": "I wish  Little Tikes would find a way to afix the handle so it would not come out.",
      "text": "I keep buying this product because the children at Toddler Town I have love it. Just a few things if you are using it for a group of children, the motor pull string last about a week each time and the snap in handle always after about a month of use each day never stays in the slot. I wish Little Tikes would some how make it all one piece so that it would last longer or clip in a little stronger. This is my fourth mower for my kids program. I have tried to find another model but there are just bubble ones or for larger one for older kids.",
      "rating": 3.0,
      "verified": true,
      "author": "Maryann Martin",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Fun indoor toy- not for yards",
      "text": "Very fun little lawnmower for inside the house. My 2 year old loves putting gas in the tank. But it is too low to be pushed in the yard. When it is in the yard and a kid pushes, the angle is such that it digs deeper into the yard and won’t move. The handle popped out one time ( it popped right back in easily). It is now an indoor toy, not what we bought it for.",
      "rating": 4.0,
      "verified": true,
      "author": "MEW",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "This is the 2nd one I bought.",
      "text": "This is the 2nd one I bought. The first one I gave to a neighbor thinking my grandson wouldn't remember it but the first thing he told me when we talked was where's my lawnmower? Too funny that he remembered it. We moved a year ago and he hadn't been to our new house yet....so it really made an impression on him. Now his little brother loves it too.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Garrett",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Really cute, but doesn’t work in grass without modifications",
      "text": "Really cute mower. Toddler loves filling it up with the gas can and pulling the starter. Only reason I give it less than five stars is because it does not work in grass. It is hard for me to push let alone a toddler. We cut the extending plastic piece off the back of the mower and now it goes through grass just fine. Husband used a multipurpose tool.",
      "rating": 4.0,
      "verified": true,
      "author": "Keri Taylor",
      "helpful_votes": 2,
      "publication_date": 20180620
    },
    {
      "title": "Great for cost",
      "text": "My nephew loved this toy, he takes it all over the house and outside, even in the snow. Not too many bells and whistles but has a gas can and a pull cord to \"start\" the mower. My nephew is a monster and drags and smashes the mower all the time and still in great shape, nothing has broke off or been damaged. Def. Worth the money but it's not fancy if that's what you are looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Hulksmashish",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "This one is by far his favorite because of the details including the gas can",
      "text": "My son is obsessed with lawnmowers, this is our third lawnmower purchase for him and he just turned 2. Before this we have the Fisher Price bubble blower lawn mower. He's hard on his lawnmowers because they get a lot of use but the first bubble blower one broke after a couple months and started leaking bubbles. This one is by far his favorite because of the details including the gas can, pull cord and moving knobs.",
      "rating": 5.0,
      "verified": true,
      "author": "Shelby",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Baby magnet",
      "text": "My son received one of these for his first birthday back in September and it was an instant hit! Every child at the party was enamored with this lawn mower! He still loves it 4 months later which is a huge deal for a toddler. We love it so much that it is now my go to gift for first birthday gifts and every time one is opened every child swarms around it. Couldn't find a better gift!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Sturdy and just the right size",
      "text": "Bought this for my 16 month old grandson who loves to Push anything and everything he can find. He was always fighting with his sister over her doll stroller because he likes to push things. So after looking at multiple mowers online decided on this one. It's very cute, the sounds are great and it has quite a few things for him to play with besides push it. The only drawbacks are he can't really pull it backwards, the back of it sticks in the ground and the plastic gas cap won't stay down. But otherwise a great toy for him",
      "rating": 4.0,
      "verified": true,
      "author": "pam m.",
      "helpful_votes": 0,
      "publication_date": 20191002
    },
    {
      "title": "LOUD, but fun!",
      "text": "My youngest was using a firetruck as a mower to mimic my husband mowing our lawn. We bought him this toy mower and he loves it! It is loud (due to the little poppy beads inside it) but it's worth it for his excitement. It comes with a little plastic gas can. The price was great in comparison to other toy mowers. Overall, highly satisfied with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Great for the Elderly, too!",
      "text": "I bought this as a gag gift for my mom because she needed a new lawnmower. It was a riot! Get the frustration-free packaging because the original packaging is a nightmare! Other than that though, this has been great. Lots of little toys and doodads onboard, so I imagine kids would love it, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Wicked",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Works great!",
      "text": "This mower works great, it literally just clicks together. No instructions needed. The only thing I can say, and it's my fault for not reading better, is it doesnt blow bubbles. If you are looking for a bubble mower, this isnt it. This literally makes an annoying popping sound as they move it around. The kids love it but it will make parents crazy lol but definitely worth it for how much the kids love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Bought this for my 2 year old nephew. He's ...",
      "text": "Bought this for my 2 year old nephew. He's kind of a scaredy-cat of a kid so he was a little taken back by the noises the mower made (the popping sound when it moves, and the mower sound when you yank the chord - IT SOUNDS AMAZINGLY REALISTIC for a plastic toy with no batteries). After warming up to it, he's running around with it all the time in the yard! 10/10 would get for any 2 year old.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "it just clicked which made him very happy!!",
      "text": "8 month old Grandson loves it. Warning: the first time you pull the cord, it is VERY LOUD!!! Our grandson, shook and then cried from the loud noise. However, the next morning, he went to the lawnmower, and pulled the cord in one hand!!! Since he didn't have the strength to pull it fast, it just clicked which made him very happy!!! He tried walking behind it but the mower wasn't heavy enough to counter his wobbly steps. In time, it will be perfect. He will get a lot of enjoyment out of it, especially when the snow melts and he can go outside!!!",
      "rating": 5.0,
      "verified": true,
      "author": "S. Smith",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Great product on concrete",
      "text": "I like how cute this product is. I bought two for my girls to use when their daddy mows the lawn. They used to run around him while he mowed and would make me so nervous! I bought these to keep them busy and keep them away from a potential danger. I gave this three stars because this does not work well on grass which kind of sucks, bc they cannot totally mimic their dad. They love the gas tank and the popping noises it makes. The crank is so cute too and they work it perfectly. But girls are two and four years old. I know they wished it worked better on grass though.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon81",
      "helpful_votes": 0,
      "publication_date": 20160730
    },
    {
      "title": "Great toy!",
      "text": "So cute! My nephew loves the pull start and gas tank! I ordered this after his bubble mower died and the company changed their model. He never cared about the bubbles and always pretended to pull it started like papa so this was perfect! It was super easy to assemble-just 5 pieces and it was together in 3 minutes or less! This is nice quality that will hold up to his daily use. The only downside is that it pushes very quietly just a light pop noise from the balls inside it. My nephew was used to the noise of the bubble motor so it took him a bit to get used to this quieter model lol.",
      "rating": 5.0,
      "verified": true,
      "author": "L Scott",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "We love it!",
      "text": "We love this toy!! My two year old is obsessed with it! It makes lots of noise and he loves all the pulls and switches on it. It was very easy to put together and so far it seems pretty durable! Highly recommend this little lawn mower.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey P",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "2 year old loves it",
      "text": "My kiddo spends so much time playing with this. The popping makes it more enticing to him, and I like how it has the key, pull crank, gas fill hole, and the gas tank. It just really adds to his ability to use imaginative play.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria S.",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Favorite 2nd Birthday Gift!",
      "text": "We bought this to give my son for his 2nd birthday. We wanted something he could share with his 4 year old brother and something they could play with outside. This was perfect for us! It was easy to put together. We just had to snap in the handles and a few of the buttons/knobs. It is the perfect height for them and the wheels go smoothly. The like all the different features: the pull string that makes sounds, the gas can they can pretend to pour, gas cap they can open, knob they can turn, and lever then can switch. The balls bouncing inside are just an added bonus. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "Tricia L.",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Great Classic Toy Worth Every Cent",
      "text": "Bought this as a Christmas gift for my nephew who was 15months at the time. It was his favorite toy of the whole holiday! He did laps around the living/dining room for hours. It was a little noisy on the hardwood floors, but he loved it. I am told it's still one of his favorites 3 months later. Once the snow melts I'm sure he will love it outside while his parents are gardening. Such a great classic toy for girls or boys. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "Great Toddler Mower",
      "text": "Our 18 month old boy loves this mower! He had become fixated on our real gas powered mower, but was just a little young to use it. But this one is perfect. Little assembly required, just clip in the handle to the base and that's it. It is a little noisy, so we limit to outdoor use only. We thought about getting the competition's \"bubble mower\", but are happy we chose the cleaner , less messy one.",
      "rating": 5.0,
      "verified": true,
      "author": "Ted C",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "My son LOVES this toy",
      "text": "Bought this for my 20 month old to push around the yard while he is outside to keep him busy. He absolutely loves it. Makes laps around our house. So far it has held up really well to his abuse so it is a great item for the price. Also was super simple to assemble which was a bonus!",
      "rating": 5.0,
      "verified": true,
      "author": "Shari Peterson",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "Cheap - broke at first use",
      "text": "Broke the first time we used it. Pull cord gears were put together with a staple - broken from the start. FYI, the warranty window is the same as the Amazon return window. Cheaply made, very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Jenna",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Could be better.",
      "text": "As long as you're using on a hard surface it is great.... But try letting them actually go in a yard with bumps and such, it fails to go very well at all. There is just no clearance between the wheels and the base.",
      "rating": 3.0,
      "verified": true,
      "author": "Brad Farabaugh",
      "helpful_votes": 0,
      "publication_date": 20191003
    },
    {
      "title": "disappointing",
      "text": "Cute mower I bought for my 1 and 2 year old, they love the gas can and switches. However the handle pops out easily and the wheels are so small that it gets stuck in the grass. My sons love pushing their fisher pricer bubble mower around the yard...they cannot do the same with this as the wheels are much smaller and get stuck and it doesnt go anywhere. It was so sad to watch them get so upset over it! This only rolls smoothly inside or on concrete",
      "rating": 2.0,
      "verified": true,
      "author": "Kathy",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Awesome toy for a little one who likes to run and make noise!",
      "text": "My two year old loves this toy. Not only does it pop, the handles click and the drawstring pulls similar to the engine being started. He loves to take off fast and push it around the livingroom. In addition, the older two sit him on it and \"push him\" around on it as well. The only feedback I have would be that it'd be nice if the black handles \"click\" into place. Currently the design does not have a click in place and occasionally the handles can get pulled out. No big deal - just push them back in.",
      "rating": 5.0,
      "verified": true,
      "author": "CDL",
      "helpful_votes": 0,
      "publication_date": 20160502
    },
    {
      "title": "Not meant to be used outside",
      "text": "So I ordered this for my son and inside he absolutely loved it and was so excited to take it outside. He ran right to his dad to give him a big thank you hug for his present. Well, it doesn’t actually push on the grass. So instead of having a happy toddler, we had a crying toddler that was very sad his lawn mower didn’t work. I mean did Fisher Price even test this on actual grass?!? Very frustrated and disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Janel Zima",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "Hard surface only",
      "text": "It only works in hard flat surfaces and thin carpet. After freshly mowing my lawn, it still wouldn’t push. I tried helping my 3 year old try different ways to push it and still, no budge. Not even for me. Not good for outdoor use unless on a sidewalk which defeats the whole purpose of buying it.",
      "rating": 2.0,
      "verified": true,
      "author": "Jenna Jones",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Broke within 3 days of use by a 1 year old",
      "text": "Well, it was cute the pull string stopped working after three days of use by our 1-year old. It still functions but no longer makes the start-up noise. Disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Sara Montgomery ",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Fun toy!",
      "text": "My two yr old is obsessed with lawnmowers, so I bought this in hopes he'd leave our real one alone lol. He has played with it for three days straight. Unfortunately, he pulls on the starter like he does on the real thing, so it no longer works properly. Not sure if that is a defect, but I'm guessing it's his fault. Happened at the end of his first day with it :(. He was sad but then got over it and mows everything again. Lol. Makes sounds as you push it. There are some controls that make sounds, but all these sounds are not battery powered, so that's nice.",
      "rating": 5.0,
      "verified": true,
      "author": "herbiechic",
      "helpful_votes": 0,
      "publication_date": 20150715
    },
    {
      "title": "Good durable toy at a good price",
      "text": "My son loves this thing! It was super easy to assemble, literally took like 30 seconds to snap the pieces together. It makes noise as you push it, but it’s not so loud that it can’t be used indoor if you wanted to. The quality is great. Seems to be made well and should last a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Don’t be to Rough",
      "text": "I like that you can pull it like a real one to (start) it up. He’s hasdvit for awhile and didn’t play with it much. The one time he did, the starter broke. I hope it can be fixed cause it’s fun.",
      "rating": 3.0,
      "verified": true,
      "author": "sarah",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "It’s okay...",
      "text": "Doesn’t get much ground clearance, so doesn’t work very well outside. It’s quite noisy, so it’s annoying inside. Also, the fake pull start broke within the first couple of weeks.",
      "rating": 3.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20200504
    },
    {
      "title": "This is simply the standard, sturdy, child's lawn mover that we all had growing up",
      "text": "This is simply the standard, sturdy, child's lawn mover that we all had growing up. My son had one and played with it constantly. I bought this for my grandson, with exactly the same result. Sadly, this one is somewhat hard to push. Nevertheless, it is a good build quality, and allows the child to have the additional play activity of \"putting in the gas\". I cannot imagine how to give a young child more active play time for $20 than a toy like this.",
      "rating": 5.0,
      "verified": true,
      "author": "William P. Carlucci",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Awesome.",
      "text": "Totally helped my son learn how to walk. He was already trying but couldn't do it without holding to something. This toy got him moving around the house and within a couple of days, he let go of it and took his first unassisted steps. Now, he takes it outside with me and \"helps\" me mow the lawn lol",
      "rating": 5.0,
      "verified": true,
      "author": "grrly",
      "helpful_votes": 0,
      "publication_date": 20181108
    },
    {
      "title": "Most authentic of the child mowers",
      "text": "Had to replace this mower after 4 years for 2 grandsons who must have the authentic starting sound. The pull cord broke - after much use. The replacement looks the same but doesn't seem to be quite as good quality. Will see how long it lasts. Our grandsons love this toy and we definitely got our money's worth out of the first one. The boys are 4 & 2 and love the pull cord, the gas can & the knobs that turn.",
      "rating": 4.0,
      "verified": true,
      "author": "Rosie RN",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Highly Recommend",
      "text": "My son absolutely loves this mower. He goes all over the house with it. It took less than a minute to assemble and the popping sound isn't painfully loud like some toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke H",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Broke after 3 months",
      "text": "The pull mechanism that my grandson loved, that sounds like a lawn mower starting broke yesterday. He is only 1 so he didn’t pull it too hard. I received it on Dec 14 and gave it to him Christmas Day, so it it only lasted 3 months",
      "rating": 1.0,
      "verified": true,
      "author": "Mel Rae",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Mower handle keeps coming off....",
      "text": "I was really disappointed in this Little Tikes product. My prior experience with Little Tikes was great, but this lawn mower is of substandard quality. The mower handle keeps coming off; at least four times the first afternoon! If I still had the packaging and box, it would go back! If you're looking for a push toy for your toddler....keep looking!",
      "rating": 2.0,
      "verified": true,
      "author": "LRH",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Doesn't move forward in grass",
      "text": "The mower is cute and fun, but we wanted it to be able to go alongside my husband in the yard. It won't move in the grass, only on flat ground. Also, I can't see anywhere on the listing where it says that you have to pay return shipping if you decide you no longer want the product, but if we return it will deduct $5.99 from our refund.",
      "rating": 2.0,
      "verified": true,
      "author": "Indymama",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great gift!",
      "text": "Bought for two year old newphew. He uses it a lot! It works better on pavement then grass but it’s nice it’s all mechanical noises so no batteries or charging it. Just press and twist buttons to make life like noises. He love s the gas can too. Adorable",
      "rating": 5.0,
      "verified": true,
      "author": "vmarie",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "Best Christmas gift ever!",
      "text": "This was the highlight of Christmas for my 18 month old! He absolutely loves this thing and will usually put his sippy cup in place of the gas can and push it around. He loves the sounds it makes and this was definitely the biggest hit from Christmas. It has held up really well so far and is still one of his favorite toys. When it arrives, it comes in two pieces. The base and the handle. It is easy to simply slide the handle into the slots on the base and you are ready for your child to start having fun!",
      "rating": 5.0,
      "verified": true,
      "author": "Mallory",
      "helpful_votes": 0,
      "publication_date": 20160321
    },
    {
      "title": "it was the kids' favorite toy right when they opened it",
      "text": "I have given two of these mowers to boys at their 1st birthday party. Both times, it was the kids' favorite toy right when they opened it. It shouldn't be used as a walking aid, it isnt stable enough. But once they start taking steps, they can use this. Makes fun starting sound when pulling the string and has a gas tank that can come off to fill up the gas. Great, durable toy for boys and girls!",
      "rating": 5.0,
      "verified": true,
      "author": "LindsayGBP",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "Poorly made",
      "text": "Already broken after 2 months. The fake pull chain to “start” the lawnmower is stuck and won’t wind back up. This toy is junk. It’s barely been played with, didn’t take long to break.",
      "rating": 1.0,
      "verified": true,
      "author": "Eric Josselyn",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Big hit with my son!",
      "text": "My son ABSOLUTELY LOVES his lawn mower! He originally had a cheaper version and I opted for this. I purchased at Christmas time and he still plays with it daily...which is a miracle in our house. Definitely worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Charlotte Sherouse",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "2019 - Mower is now nine years old and still going strong! 😊",
      "text": "I purchased this mower four years ago for my oldest nephew. That same nephew is now seven and the mower is still in excellent shape and is now the favorite play toy of my other three nephews ages 4, 3 and 12 months. It has withstood the hard play of four boys over all of these years so I just purchased another one for my 12 month old nephew as a birthday present so he can \"mow\" at home instead of waiting to come to his Aunt's house. You can't go wrong in purchasing this Little Tikes Mower....it lasts forever through some of the roughest play a little boy can dish out.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Aldinger",
      "helpful_votes": 0,
      "publication_date": 20141112
    },
    {
      "title": "Well Worth It",
      "text": "OMW, purchased for my 2 year old grandson. He absolutely loves it as does his 4 year old sister! The gas can pops out of place easily when the get going with it but it was a huge success when it arrived during our Sunday visit and dinner.",
      "rating": 5.0,
      "verified": true,
      "author": "Tcsmith38",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Totally worth it!",
      "text": "Little one always liked watching the lawn mower. Now she has her own and loves it. We have a very uneven back yard with weeds, grass and dirt and this little thing does pretty good. Has rev up noise, just be aware it is kinda loud. It startled her the first time.",
      "rating": 5.0,
      "verified": true,
      "author": "victoria",
      "helpful_votes": 0,
      "publication_date": 20190203
    },
    {
      "title": "Wonderful toy!",
      "text": "I have bought three of these; Two for my own sons and one as a gift. They are well made, easy to assemble, don’t need batteries and tons of fun! Definitely a favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Bauserman",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Must have toy.",
      "text": "I bought 3 because the kids love these so much. I bought them for a 1, 2 and 3 year old and they all loved them equally. Our preschool had them and all the kids always fight over them. Super cute and way nicer than the old school bubble mower.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Start your kid out right, a dream career could be waiting!",
      "text": "My son's obsessed! We purchased his first one two years ago for Christmas. It was love at first sight, it was the only toy he played with! He would literally follow right behind my husband as he mowed the grass, pushing his own mower. He asked for a new one for his 4th birthday. I like that it doesn't blow bubbles like some of the other push mower toys. It's great as an inside or outside toy. My son now says he wants to be a 'grass man' when he grows up, so he can mow lawns all day. And not have to go to work! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Gemini-Gypsy",
      "helpful_votes": 0,
      "publication_date": 20140831
    },
    {
      "title": "The little ones will love it. Realistic",
      "text": "I purchased this Lawn Mower as a guft for my great grandson for Christmas. I havent assembled it yet, but from what I can see it is well made, adorable, and the little guy will love it. The little gas can is red plastic making everything realistic for the little ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila M.",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great for toddlers",
      "text": "I purchased this mower as a gift for a friend's son's birthday. He loves to play outside and the price here on amazon was a lot cheaper than any in store price that I could find. Her son LOVED it! As soon as he unwrapped it, he didn't care about anything else. Neither did any of the other kids there because they all wanted to take a turn with this thing. It comes with a mini gas can so that the kids can pretend to gas up the mower and a pull cord just like a real mower. This thing is a great toy for any kid.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiffany D",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Cute & Realistic Looking",
      "text": "My 20 month grandson loves this. Kept his attention for hours which is saying a lot. He did get a little frustrated when the lawnmower would not move through the grass like he wanted but it was not a problem the entire time. Some areas of grass he could push it through more easily than others. It was not enough of an issue to regret the purchase. If anything this mower is bound to make him stronger by his efforts to \"mow\" the grass. His Grandpa may dremel some plastic off from the back of the mower to remedy it.",
      "rating": 5.0,
      "verified": true,
      "author": "Brian Rader",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "Cool Little Mower!",
      "text": "This is for our 3 year old son who I noticed played with this a lot at daycare. It's the perfect size for him and the quality is excellent. It does make noise but does not need batteries. The noise is not that bad. We live in an apartment and during the day it's loud but if you're busy doing other things you won't notice until they mow your toes. Toward the evening this thing is super loud and we limit how much he plays with it. The gas can is such a cute detail. It was easy to put together and I'm sure will last through more children!",
      "rating": 5.0,
      "verified": true,
      "author": "SeriouslyHappy",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "Great little mower",
      "text": "Great little mower. My littler guy wouldn't play with anything else all day the day that he got it. It was inside, it was outside. There is a little gas can and the start up string actually pulls. Glad I got this mower and not anything else. My kid is around 19 months old for size reference.",
      "rating": 5.0,
      "verified": true,
      "author": "J.K.",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Great toddler toy",
      "text": "My 1.5 year old loves his lawn mower. All the kids fight over the ones at school so i finally decided to get one at home. He likes to talk about how he mows just like daddy. He likes the gas can and the poppers that make noise when he pushes. Good purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Chelsea Rosner ",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Doesn’t work on grass",
      "text": "The back of the mower has a big lip and the front is very low to the ground therefore you can’t use it on grass at all. Our kiddo can only push it on the cement. We cut the back piece out with a saw and it still doesn’t work well. It’s far too low to the ground to use on any grass.",
      "rating": 3.0,
      "verified": true,
      "author": "Anthony Purviance",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Crank to make engine sound breaks easily",
      "text": "The crank that you pull to make the sound of the engine starting broke within 1 hr of use. My daughter still likes to use the lawnmower. It would have been nice if all of the components works though.",
      "rating": 3.0,
      "verified": true,
      "author": "H. Benson",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "It is easy to get in and out",
      "text": "My 2 year olds are having a blast with these mowers! Pros: -Someone was really thinking when they made a spot for the gas can to click into. It is easy to get in and out, but stays in place when it's supposed to. -Makes a \"quiet\" popping sound when being pushed. Much less irritating than other poppers but my kids seem to enjoy it just as much. -Pushes easily Cons: -Stickers seem a little cheap. -Cord that 'revs' has to be pulled pretty hard to get it to make the sound. My 2 year olds can't pull it hard enough yet. Overall a great toy for the price!",
      "rating": 5.0,
      "verified": true,
      "author": "M&T.S.",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "couldn't  be happier",
      "text": "my 2yr old grandson LOVES this. it's very durable quiet, no messy bubbles, and easy to push. No small parts to get lost. he takes it on their walks and \"mows\" the side walk. lol I would recommend this for any toddler,",
      "rating": 5.0,
      "verified": true,
      "author": "justa",
      "helpful_votes": 0,
      "publication_date": 20190629
    },
    {
      "title": "Study enough for 1yr old walker",
      "text": "Purchased for friends 1yr olds birthday! He is just learning to walk and can maneuver this lawnmower just fine. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandy",
      "helpful_votes": 0,
      "publication_date": 20200216
    },
    {
      "title": "Amazing",
      "text": "Such a wonderful toy has all different gadgets the kids love. And sound effects. Just perfect I have to say that the first one came without a couple gadgets and STL PRO was unbelievable. I contacted them Monday night and I had a replacement Wednesday night. Without waiting for me to first return the other. I have of course sent the first one back They were amazing!! Thank you STL PRO for a great toy and great customer service",
      "rating": 5.0,
      "verified": true,
      "author": "Susan M.",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Fun toy for my toddler son!",
      "text": "My son has loved this toy ever since he has opened the box... He is 15 months old and loves to push it all over the house. Disclaimer- it CAN be noisy... so be prepared, but being a parent we all know how much our kids love noisy toys and to make noise. I'll take this over banging my pots and pans any day! The pull to \"start\" the mower did break after a couple of weeks of hard use and no longer makes a noise when its pulled, (that's why I give it 4 stars) but other than that its been a great toy!",
      "rating": 4.0,
      "verified": true,
      "author": "MKabi",
      "helpful_votes": 0,
      "publication_date": 20160504
    },
    {
      "title": "Needs a redesign so it can be pushed on the grass",
      "text": "Believe the reviews that say this can't be pushed on grass. Gas can and controls are great. Kids want to play with it but can't since it won't roll on grass. It has great potential, but this defect causes it to sit in the garage rather than be used.",
      "rating": 1.0,
      "verified": true,
      "author": "trailhiker",
      "helpful_votes": 8,
      "publication_date": 20141010
    },
    {
      "title": "Most loved toy, instantly",
      "text": "This mower was a much needed upgrade for my 3.5 year old son. He was pretty excited when he received it. The handle is fixed in place, whereas the last mower we had the handle collapsed flat a lot of the time. The knob and lever on the handle make clicking sounds and the pull start makes an awesome racing/revving noise. The gas tank is really simple and cute. My son loves filling the mower up and then running off through the grass with it. I like this better than bubble mowers out there because it is cleaner, and never needs any sort of refills. This works really well indoor and outside.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Lee",
      "helpful_votes": 0,
      "publication_date": 20140421
    },
    {
      "title": "Perfect kid lawn mower",
      "text": "This was honestly one of our best purchases for my son's birthday. He literally plays with it every day. He loves that it comes with a little gas can and he can pretend to put gas in his lawnmower just like his dad.",
      "rating": 5.0,
      "verified": true,
      "author": "MEP2014",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "Best toy for the money!!",
      "text": "My 2 year old grandson loveS this so much, I bought 2. 1 for his house, 1 for mine. It doesn’t need batteries either!",
      "rating": 5.0,
      "verified": true,
      "author": "kathy dunn",
      "helpful_votes": 0,
      "publication_date": 20200922
    },
    {
      "title": "Disappointed",
      "text": "Just got this for my daughters birthday as she loves to watch/copy dad with the mower.... it was easy to assemble and even functions okay on (shorter) grass - however the 'motor' sounds are not like an engine at all? It is also very short lived only by stopping pushing the mower for her to pull the cord.",
      "rating": 2.0,
      "verified": true,
      "author": "Tiffany ",
      "helpful_votes": 0,
      "publication_date": 20190717
    },
    {
      "title": "Great toy for 1 1/2 year olds",
      "text": "My Great Grandson loves his lawn mower and I bought two total one for my second nephew who also loves his mower",
      "rating": 5.0,
      "verified": true,
      "author": "Yoda",
      "helpful_votes": 0,
      "publication_date": 20191230
    },
    {
      "title": "My child loves this!",
      "text": "My 4 year old has a fascination w/ lawn mowers & was so excited when this arrived! It looks realistic & in our case it operates great! Unlike some of the other comments, my child has had no difficulties w/ pushing it in the grass (& we live in a very rural area w/ pastures et) I would recommend this as a purchase to anyone who has a little one who wants to \"help' out w/ lawn chores!",
      "rating": 5.0,
      "verified": true,
      "author": "Gymkat",
      "helpful_votes": 0,
      "publication_date": 20160816
    },
    {
      "title": "but that's not a bad thing because that's exactly why he likes it",
      "text": "My 2YO loves this little lawnmower and would push it all over if we let him. We decided it should be an outside toy since it is kind of noisy, but that's not a bad thing because that's exactly why he likes it. He is scared of the real lawnmower, but this is perfect for him to help daddy and mommy mow the lawn. He has trouble pushing up the hills in our yard, but that's to be expected with plastic wheels on a toy. He loves it, so it gets five stars.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Draper",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Cool toy",
      "text": "Great! Looks just like a real one. And little extra gadgets like the oil can, key, etc. are great. No music, no battery, just loud working noise. My 2yo loves it from the moment she saw it still in the package. Runs smoothly. Easy to hold, push and even lift. No tipping. Very sturdy. Now she cuts the lawn everywhere in the house, even in bed, on sofa and inside her little castle tent.",
      "rating": 5.0,
      "verified": true,
      "author": "Darius",
      "helpful_votes": 0,
      "publication_date": 20160609
    },
    {
      "title": "Fun toy",
      "text": "This was a gift for my grandson. I love the colors and features on it. It is very realistic and fun to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20191229
    },
    {
      "title": "perfect for a 1yo",
      "text": "perfect for a 1yo! My son preferred the bubble mower (bigger wheels make it easier to push through the grass) once older, but this mower is better for little ones who are learning to walk or still wobbly on their feet because there is a plastic piece on the back that prevents them from falling backwards with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170618
    },
    {
      "title": "Ok",
      "text": "My almost two year old loves this but it’s not as solid as you would think. He also often is able to move it and the Black handle detaches from the Green base.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl Marie",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Realistic",
      "text": "Grandson loves it!!! So realistic sounds. He says just like papaws!!!! Great dealing with seller Thanks!!! A+++",
      "rating": 5.0,
      "verified": true,
      "author": "Darrell Tramel",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Kid loved this!!",
      "text": "The young toddler i gifted this to is still making noise with this product!! He loves it, especially the gas can attached. As much as he uses it we almost wish it was real. Would probably save on the lawn guys!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "My kids love it! The only downside is that since I ...",
      "text": "My kids love it! The only downside is that since I have small kids, sometimes they like to tilt it up, and since there is a plastic back you can't tilt it up and roll it at the same time. That just means that they are scraping plastic everywhere, so it gets noisy!",
      "rating": 5.0,
      "verified": true,
      "author": "Liz S.",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Broke within the first few hours",
      "text": "Only had it for one day and the string doesn't retract back in to be able to pull it again, and it no longer \"pop\" when being pushed.......super easy to assemble. And my son is obsessed with it, was up until it broke. Now he is constantly begging me to fix it when it can't be.",
      "rating": 2.0,
      "verified": true,
      "author": "Ashley Huffman",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Cute little toy",
      "text": "My 3 year old grandsons loves pretending he is helping grandpop cut the grass. It is cute and durable",
      "rating": 5.0,
      "verified": true,
      "author": "Dee from OC NJ",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Has gone so well we are now gifting these to family and friends",
      "text": "My 2 year old boy has had this for 1 year now. I figured the pull cord would be broken by now, especially with some older cousins. However, it is still going strong. It's a pretty simple/basic lawn mower, but has everything you need to keep your little one entertained for a bit and to follow you outside while you are mowing. We have bought this same one as presents now as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul E",
      "helpful_votes": 0,
      "publication_date": 20160624
    },
    {
      "title": "Great 1 year old birthday present.",
      "text": "This is adorable. Not as loud as some have claimed (in my opinion) It was the favorite gift of the birthday boy!",
      "rating": 5.0,
      "verified": true,
      "author": "FuryQb8",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Very happy!",
      "text": "I purchased this for my grandson’s first year birthday. He absolutely loved it! I’m Very happy with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "SANDRA SHAW",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "kids like it",
      "text": "My 10.5 month old loves it and my 2 yr. Old nephew loves playing with it as well. I have had to snap the handle in place a few times so not sure if I'm not pushing down hard enough which I feel like I am I've tried using all I got..or if that's just how it is?",
      "rating": 4.0,
      "verified": true,
      "author": "delesa ake",
      "helpful_votes": 0,
      "publication_date": 20180504
    },
    {
      "title": "Great for Toddler",
      "text": "I ordered this for my 2yr old son for Xmas. He loves it! We have had it 6 months and no problems. It has even been left in the rain once or twice, still works great. He pulls the cord, it makes a neat sound. . He is now 3 and he still loves his mower. He follows my husband all over the yard while they mow together. I think the only thing I would change is the balls in the 'dome'. They don't make any noise, but I wish they looked like pieces of grass instead of balls.",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie",
      "helpful_votes": 0,
      "publication_date": 20150605
    },
    {
      "title": "Gas 'n Go",
      "text": "My almost 2 year old got this for Christmas and of course the 4 year old now wants one. It was simple to assemble with just 2 parts to put together. I like that it came with a gas can. My son loves to pull the start switch and mow our \"living room\". (Hey, it's winter!) It seems durable and hopefully it was last several years.",
      "rating": 5.0,
      "verified": true,
      "author": "Travis Meyer",
      "helpful_votes": 0,
      "publication_date": 20160117
    },
    {
      "title": "It was easy to put together and my son instantly loved it",
      "text": "It was easy to put together and my son instantly loved it. It is also sturdy and just an overall fun toy. My son played with it inside the house then we took it outside. I love that when you pull the cord it makes a good sound that keeps him entertained. Awesome product.",
      "rating": 5.0,
      "verified": true,
      "author": "Alison",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "This is perfect and he loves it",
      "text": "Purchased this for my 18 month-old, who suddenly loves pushing things around the house. I was looking for a safe alternative to a chair or stool. This is perfect and he loves it! Took 5 minutes to cut out of package and put a few pieces together.",
      "rating": 5.0,
      "verified": true,
      "author": "JKat",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Disappointing... this lawn mower is nearly impossible ...",
      "text": "Disappointing... this lawn mower is nearly impossible to push on the grass. My grandson could only use it on the sidewalk, which misses the whole point of mowing the lawn! Did not hold his attention because he couldn't use it in the grass!",
      "rating": 2.0,
      "verified": true,
      "author": "Gremlin",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Good gift",
      "text": "Bought this for a 1 yo birthday gift and it was the hit of the party! Kids played with it outside right away.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly Ihlendorf",
      "helpful_votes": 0,
      "publication_date": 20200207
    }
  ],
  "product_meta": {
    "title": "Little Tikes Gas 'n Go Mower",
    "description": "Product Packaging:Standard Packaging\n\nThis toy lawn mower lets children mimic the activity they see every day in the world around them. The sounds and hands-on features of this kid’s lawn mower encourage pretend play and get kids moving – and mowing! It looks like the real thing!\n\nFeatures:\n- Sounds are mechanical, so no batteries are needed\n- Push the toy mower and the beads pop\n- Pull cord to hear engine sounds \n- Clicking key and moveable throttle \n- Removable gas can\n- Kids can open the tethered gas cap and pretend to fill up the lawn mower \n- 18+ months\n\n\nBRAND STORY\nBy\n\nFROM THE MANUFACTURER\n\n\nThis toy lawn mower lets children mimic the activity they see every day in the world around them. The sounds and hands-on features of this kid’s lawn mower encourage pretend play and get kids moving – and mowing! It looks like the real thing!\n\nFeatures:\n- Sounds are mechanical, so no batteries are needed\n- Push the toy mower and the beads pop\n- Pull cord to hear engine sounds \n- Clicking key and moveable throttle \n- Removable gas can\n- Kids can open the tethered gas cap and pretend to fill up the lawn mower \n- 18+ months\n\n\nSee more",
    "rating": 4.6,
    "feature_bullets": [
      "Kids push toy mower with popping beads",
      "Sounds are mechanical, so no batteries are needed",
      "Pull cord to hear engine sounds",
      "Clicking key and moveable throttle",
      "Removable gas can"
    ],
    "specifications": {
      "Product Dimensions": "21 x 11.25 x 20.5 inches",
      "Item Weight": "3.19 pounds",
      "ASIN": "B00EPE5U52",
      "Item model number": "633614MX2",
      "Manufacturer recommended age": "18 months - 5 years",
      "Best Sellers Rank": "#12,094 in Toys & Games",
      "Customer Reviews": "4.6 out of 5 stars3,552 ratings4.6 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Release date": "December 9, 2019",
      "Mfg Recommended age": "18 months - 5 years",
      "Manufacturer": "MGA Entertainment"
    },
    "categories": [
      "Toys & Games",
      "Gardening Tools",
      "Sports & Outdoor Play"
    ],
    "price": ""
  }
}