{
  "website_summaries": [
    {
      "verdict": "The Brother DSmobile 920DW offers duplex, manual feed scanning with or without a computer and can connect by Wi-Fi to let you see scanned documents on your smartphone or tablet.",
      "pros": [
        "Portable",
        "Duplexes",
        "Scans with or without a computer",
        "Connects by Wi-Fi, letting you see scans on your smartphone"
      ],
      "cons": [
        "Doesn't do a good job with business cards or expense receipts"
      ],
      "aspects": {},
      "publication_date": 20140227,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "NO SOFTWARE NECESSARY!",
      "text": "my favorite part of this scanner is not having to use bloated manufaurer's software. scans are saved to an SD card, which you then can save to your computer, and edit in your own favorite pdf/jpg editors. i've been using this nonstop for months and i have not even loaded the brother disk into my computer. files are saved automatically into pdf or jpeg, with no intermediate steps necessary. each page gets its own file, which you can combine later or leave as is. images are crystal clear, and the scanner fits into a small drawer. i've already scanned and shredded so much old paper and photos.",
      "rating": 5.0,
      "verified": true,
      "author": "pseudonym",
      "helpful_votes": 4,
      "publication_date": 20170309
    },
    {
      "title": "This is a gem, but it doesn't work with your cell wireless.",
      "text": "This is a gem when it comes to plugging USB into laptop. This piece works great with your laptop and desktop computer. It provides EXCELLENT pic quality. It says one page at a time, and that's what you can do otherwise you will cause a jam. Was able to scan three pages in one minute. It is great if you want to give each employee a scanner to use at their desk, but on the road or being mobile it just doesn't work trying to connect to your cellular wireless or hotspot. Can you guys please fix this for the future?",
      "rating": 4.0,
      "verified": true,
      "author": "Reec3",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "You won’t regret purchasing this scanner.",
      "text": "Brother DS-940DW Mobile Document Scanner. This is an excellent mobile scanner. With most business transactions virtual, this scanner was just the equipment I needed to scan documents and certificates to email to my employer. At first, I had a difficult time finding a protective hard shell case for the scanner, but I finally found the Mchoi hard case measuring, 13.3Lx3.3Wx2.7H. You won’t regret purchasing this scanner.",
      "rating": 5.0,
      "verified": true,
      "author": "Sondra C",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Brother cannot suport this product. the promised Software is ONLY on the CD. HELLO 2005!",
      "text": "So you cant use the higher level software ( paper port ) etc.. because its on the CD and its not on the website. Bernard from Brother tech support was talking in circles unable to do anything ( ask web team to put on full software tools maybe? Support your product? ) its included on most of the other scanners. I have not had a CD drive for 10 years... Really Brother? Really? returning.",
      "rating": 1.0,
      "verified": true,
      "author": "Barrett Abel",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "technology that is worth it and doesn't cost a ton!",
      "text": "man! this thing is da bomb! portable, small, fits in my document tube while traveling! i take it everywhere and scan EVERYTHING! especially those heat transfer receipts that disappear long before the warranty does! you just load the SD card in and connect to computer or not. you can them sort files on computer. i do ALL receipts even those mile long ones from kmart! (paperless now). but seriously, all documents, bill receipts, contracts... no more not knowing, just go to the documents on your computer, click on it and print if need be!",
      "rating": 5.0,
      "verified": true,
      "author": "trying 2 B",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "Save yourself the made in China disappointment . Junk",
      "text": "This product is a huge disappointment read instructions over and over did everything down to the tee it wouldn’t even scan a simple receipt. I’m will be sending it back to amazon . Nothing should be this difficult to install.",
      "rating": 1.0,
      "verified": true,
      "author": "Andrew Fraser",
      "helpful_votes": 2,
      "publication_date": 20191007
    },
    {
      "title": "Not much of a product",
      "text": "This is probably one of my worst Amazon purchases. Did not work wirelessly (error feeding the paper and error for the SD card). Called Brother for assistance, they essentially told me this was an old unit and they would replace it for free. I got a second one - worked as bad as the first. You have to hold the cover down so the paper feeds properly and forget about the wireless piece. Works fine plugged into the computer - but having to hold the cover down is a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Craighero",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Great scanner - better than NEAT!",
      "text": "I used a neat scanner for years and finally wanted to trash it - it didn't have great image quality, I had a line running down my scans shortly after I got it and couldn't get it to go away, and finally got frustrated! I broke down and order this, and I couldn't be happier!!! The image quality is amazing, the software is even better. I can easily scan right to my dropbox and it's simple to use. I would HANDS DOWN buy this over the neat scanner again. I also just recently bought a brother laser printer. I'm really impressed with Brother products. You'll love this.",
      "rating": 5.0,
      "verified": true,
      "author": "Arecel",
      "helpful_votes": 8,
      "publication_date": 20140308
    },
    {
      "title": "This scanner also has an un safe browser.",
      "text": "Very disappointed in Brother. My Epson was much easier to operate. I can't seem to use the WiFi. I haven't had any support from Amazon. It looks like when the courts open back up I'm going to file a civil lawsuit against Amazon for my refund.",
      "rating": 2.0,
      "verified": true,
      "author": "D Marshall ",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Great!",
      "text": "I really love the scanner. The only thing I did not like was that the cord it came with was loose and the connection was often interrupted. But I replaced the cord with my old Samsun phone cord and it works perfect. Scanning is easy, quicker than I thought and software has no glitches. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "4getmen0t",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Skewing and mangling",
      "text": "The software for iPhone/iPad to connect with this scanner is primitive and slow. Paper feeding is pretty bad because the traction rollers seem to pull paper more quickly on the right hand side and the two US Letter sized sheets that I scanned as a test also got mangled on the left side, folding into an accordion. When paper was not damaged, it still skewed and the result image was not rotated or cropped to adjust, unlike how my higher end scanner handles occasional skewing. I’m returning this scanner today.",
      "rating": 1.0,
      "verified": true,
      "author": "Andres Susarret",
      "helpful_votes": 0,
      "publication_date": 20181005
    },
    {
      "title": "OMG I love this machine!",
      "text": "This machine works GREAT. I've scanned a year's worth of receipts and 20 years of \"important\" documents, and 40 years of photos. What a work horse!",
      "rating": 5.0,
      "verified": true,
      "author": "dontknowwhattonameme",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Battery dead and won't charge.",
      "text": "Battery was dead and won't charge. It's not a common battery to find. Have been unable to find a replacement.",
      "rating": 1.0,
      "verified": true,
      "author": "kris stivers",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Easy to set up, easy to handle",
      "text": "This scanner does its job right out of the box. Plug&Scan at its best. The device scans to an SD Card that you can then use to transfer the scans to your PC/Mac. Alternative methods like USB connection and WIFI Scan are available, but if you look for an easy, simple, quick and comfortable scan out of the box device, this one is it.",
      "rating": 5.0,
      "verified": true,
      "author": "MPLWDTB",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Quick setup, compact, just works.",
      "text": "Just... works - a bit of software and off you go. Compact, easy to use attached or on the go, software works well. Fairly intuitive to use.Use primarily to scan documents and receipts, has worked fine for drawings and photos. Does struggle with large hi-res scans - I've choked the buffer out. Bottom line, would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20180710
    },
    {
      "title": "Main Wireless Feature Cumbersome",
      "text": "Great idea but the wireless feature is challenging at best. Too cumbersome of a process to bother with. Without that feature, scanner must be connected to your device. Not worth the $.",
      "rating": 1.0,
      "verified": true,
      "author": "Chickeetaz",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Very Disappointing: Hard to Use (Awful, Awful Software), Meh Scans",
      "text": "I was pretty disappointed by this product. Interface - meaning, the actual process for scanning a document and wirelessly transferring it to your computer - is extremely clunky and painful. Software feels 10 years old; not what you'd expect in today's age of easy wireless connectivity. I'm a savvy user and had real trouble setting it up and getting it to work. Once I finally did, the actual scans were OK, not great. Also, the device itself (i.e., buttons and screen) also feel really cheap and dated. I don't think it's going to last with continued use. So I'm returning this for another product.",
      "rating": 3.0,
      "verified": true,
      "author": "Brett H Shapiro",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "HIGH QUALITY PORTABLE SCANNER.",
      "text": "WELL RECOGNIZED & REPUTED BRAND. HIGH QUALITY WITH RELIABLE LONG LIFE. GOOD PRICE. FAST SHIPPING & DELIVERY, VERY ESSENTIAL FOR ANY HOMEOFFICE & EDUCATORS.",
      "rating": 5.0,
      "verified": true,
      "author": "SRIPATHY",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Bad news all way around",
      "text": "As others have mentioned, images saved to the SD card are dark, because neither the brightness nor calibration functions work. These machines are defective out-of-the-box and apparently cannot be fixed.",
      "rating": 1.0,
      "verified": true,
      "author": "James Alan Olmstead",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Does Not Work w/ Phones",
      "text": "The app does not work. It requires a username and password for your account without giving you the option to actually create an account. I have resorted to having to use an SD card to get my scans which is just one more extra step I didn't want to have to take.",
      "rating": 3.0,
      "verified": true,
      "author": "Blake",
      "helpful_votes": 0,
      "publication_date": 20190316
    },
    {
      "title": "Awesome little desk keep cleaner!",
      "text": "Easy to set up and really easy to use. Comes with an SD card for keeping scanned documents or can be used wirelessly or connected to computer. I use a Macbook Pro and it works great! I haven't used it for business cards or wirelessly yet. I'll write more later if I have any issues. My main goal is to keep my desk free of paper!",
      "rating": 5.0,
      "verified": true,
      "author": "sawwhetowls",
      "helpful_votes": 0,
      "publication_date": 20170410
    },
    {
      "title": "Not worth it.",
      "text": "So frustrated with this scanner. Blessed around with it for so long that i missed the return window and still can’t get it to work. Throwing it away and getting a different one.",
      "rating": 1.0,
      "verified": true,
      "author": "MTblinglady",
      "helpful_votes": 0,
      "publication_date": 20190522
    },
    {
      "title": "love love love",
      "text": "works perfectly. It has saved tons of time. Fast & efficient, plus now I don't have to rely on someone's handwritten notes, I have a digital copy!! Buy it",
      "rating": 5.0,
      "verified": true,
      "author": "TheDawnAmber",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Don't buy a DOXIE, buy This",
      "text": "I'm so glad I purchased this instead of a Doxie which I was looking at. Super simple to setup. Scans double sided beautifully. I love that I can leave it plugged into my computer (unlike a Doxie). The WiFi capability is also really handy. Bottom line, this has more features for way less money than the Doxies and I'm very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ellis Benus",
      "helpful_votes": 0,
      "publication_date": 20160125
    },
    {
      "title": "Scans front and back simultaneously",
      "text": "I love this little scanner. My favorite feature is that it does not need to be plugged into the computer. It can scan directly to its own memory card, and you can upload the files to the computer later.",
      "rating": 5.0,
      "verified": true,
      "author": "WHolmes",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "you should invest in a better product. I would not reccomend this",
      "text": "I returned this the day I opened the box. Incredibly difficult to set up wirelessly. Slow and laborious process. This is what you get when you are being penny wise and pound foolish. For a few documents every now and then, it's ok. But if you have large volume and photos, you should invest in a better product. I would not reccomend this.",
      "rating": 1.0,
      "verified": true,
      "author": "Leann H. Ferguson",
      "helpful_votes": 0,
      "publication_date": 20170706
    },
    {
      "title": "Set Up Horrendous",
      "text": "First they don't tell you you need to purchase an SD Card. Second, when trying to access the website to set up the machine, it constantly times out so you can't access the settings. And you can only Troubleshoot when you are on the website with the home page.....but I can't access the website. It shouldn't be this difficult. I wouldn't waste your time or money on this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Derrick",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Doesn't perform as expected",
      "text": "Horrible buy!! I bought 2 of Brother Printers and I love the performance of both. This scanner, or should I say its replacement from Brother, I cannot seem to get it working. Maybe because I have a Mac. Cannot return to Amazon and Brother refused to credit the scanner towards a better model. It is rubbish.",
      "rating": 1.0,
      "verified": true,
      "author": "Shirley Smith",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Easy, sweet scans",
      "text": "Other than a mobile app which didn't work, I am Very pleased. Great vibrant color scans. Easy to use. I mainly been using my SD card. The battery lasted for a few hundred scans. It does require charging through USB. Needed my laptop as am a bit nervous to charge USB until I verify correct power. Would be nice to have the adapter included.",
      "rating": 4.0,
      "verified": true,
      "author": "super_Dad",
      "helpful_votes": 0,
      "publication_date": 20150423
    },
    {
      "title": "Fast & easy",
      "text": "Fast easy checkout process. I haven't had a chance to try it out yet but it is light weight and looks exactly like picture in description",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Whisler",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Works fantastic",
      "text": "Does exactly what I want it to do, it's easy, it's fast, it's super portable... what else needs to be said?",
      "rating": 5.0,
      "verified": true,
      "author": "Some Guy Somewhere",
      "helpful_votes": 0,
      "publication_date": 20180926
    },
    {
      "title": "Ok",
      "text": "Only used it twice. It seems to be a good scanner",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20190811
    },
    {
      "title": "Would be nice to have open-source Linux drivers",
      "text": "Would be nice to have open-source Linux drivers, or at least ARM binaries so that it can be used with a Raspberry Pi. The SD card is visible without drivers though.",
      "rating": 4.0,
      "verified": true,
      "author": "HITMAn",
      "helpful_votes": 3,
      "publication_date": 20160421
    },
    {
      "title": "This scanner stinks",
      "text": "NO computer recognizes this scanner, even when connected via USB. I have downloaded the software, tried to connect via Wi-Fi. but it is a defective product.",
      "rating": 1.0,
      "verified": true,
      "author": "Shelley Crampton",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "Battery LIFE is poor. ALSO if battery is bad unit wont work plugged into USB",
      "text": "Battery LIFE is poor. Only lasted 4 months. And you can only buy battery from Brother. ALSO if battery is bad unit wont work plugged even though plugged into USB. So $60 for a battery that lasts 4 months is ridiculous especially when scanner won't work from just the power supply that charges the battery. POOR DESIGN!!!",
      "rating": 1.0,
      "verified": true,
      "author": "DRC",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "this is great for a home office and to digitize files worked ...",
      "text": "this is great for a home office and to digitize files worked excellent with my Mac... color works great and double sided scan is a huge time saver! Tells you when there is a scanning error. This is not for big jobs theres no loader to scan multiple pages at a time so you have to feed them individually but it works really quick!",
      "rating": 5.0,
      "verified": true,
      "author": "Marie E.",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "had two RMA with this device trying to figure out ...",
      "text": "had two RMA with this device trying to figure out how to use MENU button. doesnt scan receipts well or even to acceptable level, wifi ad-hoc only, software made by students, read other reviews for more details...",
      "rating": 1.0,
      "verified": true,
      "author": "MK",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "Nice scanner",
      "text": "I’m sure this is a fine scanner but for some reason it would not connect with my MacPro so I returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "John F",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "love it",
      "text": "This is a scanner. I love love love it. I had to get used to it and figure it all out but I love it now.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Great scanner",
      "text": "Best little scanners for our medical office. They only scan one page at the time but for our purpose they are great they can scan ID and medical cards as well as a full size document as long as its only one page and they upload directly in our system.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20161028
    },
    {
      "title": "Very Very Poor Product Support and Functionality",
      "text": "Extremely poor service. The device itself scans well but the battery life and general product support is unacceptably poor. After spending 140.00 USD, the device was never pragmatically functional. This is extremely disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Marvin",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Great Document scanner",
      "text": "Works great to scan in all your documents. I have went \"paperless\" and storing all my documents in PDF format. Comes with PaperPort software so that you can combine multiple scanned docs together into a larger one. Very pleased. I use it every day. For JPG is gets a \"as expected\" rating from me, but awesome for PDF",
      "rating": 5.0,
      "verified": true,
      "author": "CH of Indiana",
      "helpful_votes": 0,
      "publication_date": 20150613
    },
    {
      "title": "Did not work as I interpreted the description. You ...",
      "text": "Did not work as I interpreted the description. You have to scan (wireless) to the SD card and then hook up via wifi to transfer the image(s). It was very unreliable hooking up to the wifi. It also tries to get you to download multiple programs which are confusing and tend to eat up your memory. Returned.",
      "rating": 2.0,
      "verified": true,
      "author": "John Wilhelm",
      "helpful_votes": 2,
      "publication_date": 20160302
    },
    {
      "title": "Not good craftsmanship",
      "text": "The port where you plug it in was not secured at all. The plug went into the machine as I tried to simply use it. Very short shelf life. Great.",
      "rating": 2.0,
      "verified": true,
      "author": "JC",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Easy to set up and use",
      "text": "Easy to set up and use. I love that it doesn't need to be hooked to a computer to scan.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 2,
      "publication_date": 20161014
    },
    {
      "title": "Useless wireless function",
      "text": "Unfotunately, the advertised wireless function does not work at, no matter how you try and in all different ways, modes, etc. It's just not there. Too bad......when connected it scans well.",
      "rating": 1.0,
      "verified": true,
      "author": "gms",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Well worth the price",
      "text": "The price here is better than wal mart. The product is awesome. You don't even need to hook it up to a pc to use, just use an SD Card,, and the two sided scan feature plus PDF feature make it great.",
      "rating": 5.0,
      "verified": true,
      "author": "Tball",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "Indispensable",
      "text": "Very reliable, does both sides in color or options to do one side and/or B&W. Extremely handy to have. I'd buy it again at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "steve",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Too much time needed for proper scanning.",
      "text": "This scanner is just pain in the back if you have Mac at least. An essential feature i'm looking for is OCR, and this product does it in the worse possible way !",
      "rating": 2.0,
      "verified": true,
      "author": "Sam-E-Boy",
      "helpful_votes": 0,
      "publication_date": 20171208
    },
    {
      "title": "Not a good product",
      "text": "Ordered the scanner in March, and the scanning port where you plug it into the computer no longer works.",
      "rating": 1.0,
      "verified": true,
      "author": "Natalie Reinhart",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "I will look for a better one later on",
      "text": "It not what I thought it would be. But it will work for me for now. I will look for a better one later on. The color on this scanner is best with picture & your doc. colors are not to good. This is best for scanning black and white & color pictures only.",
      "rating": 2.0,
      "verified": true,
      "author": "kenneth r kisner jr",
      "helpful_votes": 0,
      "publication_date": 20150630
    },
    {
      "title": "So handy",
      "text": "Yes! No more paper! Works with my Mac wifi network. Leave it on your desk, run your receipts thru when you get home from shopping or pay your bills and throw the paper away?",
      "rating": 5.0,
      "verified": true,
      "author": "njani",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Okay but needs to be simpler to operate",
      "text": "This scanner performs okay and I'm happy with it for what it is. It's a little complicated to figure out and if one doesn't use it often you have to retrain yourself. Menus could be better and all the functions could work better in my opinion - needs to be simpler.",
      "rating": 3.0,
      "verified": true,
      "author": "BQ",
      "helpful_votes": 0,
      "publication_date": 20150104
    },
    {
      "title": "Works ok",
      "text": "Works OK. Couldn't get the software installed and all images never really seemed to go in straight. Always had a small uneven boarder. Pricey for the quality.",
      "rating": 3.0,
      "verified": true,
      "author": "Rach",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "Perfect for mobile workstations",
      "text": "Very simple to set up and easy to use. Scan quality is excellent and the unit fits in a laptop bag easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Syn",
      "helpful_votes": 0,
      "publication_date": 20171215
    },
    {
      "title": "perfect scanner in the office or on the go...",
      "text": "Great unit! Very versatile when hooked up to the computer, but also perfect on the go. I can scan straight to the memory card and access the documents through the Wi-Fi and use an app on my phone if I need to send documents back to the office.",
      "rating": 5.0,
      "verified": true,
      "author": "MZF",
      "helpful_votes": 0,
      "publication_date": 20140822
    },
    {
      "title": "Great value. I would definitely get this over an ...",
      "text": "Great value. I would definitely get this over an ID card scanner since this can scan so much more for the same price!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Four Stars",
      "text": "Scanner works fine but the furnished business card and receipt software leaves a lot to be desired.",
      "rating": 4.0,
      "verified": true,
      "author": "Woodworker22",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Small and fast.",
      "text": "Love this scanner! Downside is you have to use their software which is clumsy at best. But the scanner has a small footprint and scans documents quickly. I scan all our receipts for our business and this thing works very well.",
      "rating": 5.0,
      "verified": true,
      "author": "Chase",
      "helpful_votes": 0,
      "publication_date": 20150624
    },
    {
      "title": "Amazing. Will last around 2 years using every single ...",
      "text": "Amazing. Will last around 2 years using every single day. Battery has never needed replacement. this is the second one i purchase",
      "rating": 5.0,
      "verified": true,
      "author": "CD Garcia",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Easy to set up and use",
      "text": "This scanner is small, but large enough ro scan letter and legal size documents, portable, and easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan L. Kalbfleisch",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Great little unit.",
      "text": "Easy set up. Bought for my husband for his tiny desk.",
      "rating": 5.0,
      "verified": true,
      "author": "IRENE GEBE-NORRIS",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Not the right one for me",
      "text": "I never could get it to work. I returned it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Hobbie",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Great Product!",
      "text": "Awesome scanner and easy to move around our office that has multiple computers.",
      "rating": 5.0,
      "verified": true,
      "author": "tjack",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Easy Quick Reliable",
      "text": "I am very satisfied with this. No problem so far. Easy, quick and reliable.",
      "rating": 5.0,
      "verified": true,
      "author": "David Webb",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Good for the price.",
      "text": "This product works very will for the price. Set up was easy. Did exactly what I wanted it for.",
      "rating": 4.0,
      "verified": true,
      "author": "Lew Tester",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Couldn't get my computer to see it",
      "text": "MAC and PC neither one see the scanner at all. Tech support at Brother unable to figure it out, Have to return item",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "terrible purchase",
      "text": "This was a waste of money. It worked for one time and now the soft ware won't download and it's useless. Unfortunately, it's after the 30 days because I didn't need to scan for a while. So disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "leslie ramirez",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "It is complicated for the average user to set it ...",
      "text": "It is complicated for the average user to set it up wirelessly.. IT IS WiFi Direct, meaning to disconnect from your current wireless connection and connecting it to its WiFi, it may interfere with other wireless networks. but if setup right it will work. you can connect to the internet but only to save scans onto an online storage account. HOWEVER adding and scanning onto the SDcard was no problem, but removal of the SDcard is necessary and it must be inserted into the computer. also setting it up with USB directly to a computer is no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Jose",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "Otherwise this is a good mobile scanner with duplex option",
      "text": "Scan is not bright. It adds some darkness even though original document is in a very bright white paper. Otherwise this is a good mobile scanner with duplex option.",
      "rating": 3.0,
      "verified": true,
      "author": "Merandy",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Loose USB port",
      "text": "My USB port became use after very little use, now it's useless.",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy Andriole",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Cool Product!!!",
      "text": "Fantastic Works great!!! Loved it. I haven't explored the Wireless feature yet. I don't need to but its very fast. And I love the duplex scanning in one go...",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon_me",
      "helpful_votes": 0,
      "publication_date": 20140509
    },
    {
      "title": "Waste of money-cant work it",
      "text": "I cant get my laptop or my desktop to connect to this thing either with a cable or WiFi. It is worthless to me",
      "rating": 1.0,
      "verified": true,
      "author": "K. Cook",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "Five Stars",
      "text": "This was great! helped get my business moving faster and cut my work down a little! Thanks, Amazon!",
      "rating": 5.0,
      "verified": true,
      "author": "Ignacio C.",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Nice portable design!",
      "text": "It's fast enough for its purpose. It just doesn't allow me to name the file so I know what it is when I transfer it to my computer.",
      "rating": 4.0,
      "verified": true,
      "author": "Sixto B.",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "Worked for a few months....",
      "text": "It worked for about 3-4 months but then it stopped scanning multi-page pdfs. Searched everything in the manual but to no avail. Now I just have a $150 paperweight....",
      "rating": 1.0,
      "verified": true,
      "author": "TVPH",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Five Stars",
      "text": "I love my duplex scanner! It's quiet, compact, and works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Debbie",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Great product",
      "text": "Slick, easy to use, compact double side scanner. Worked well with Mac and Windows 10",
      "rating": 5.0,
      "verified": true,
      "author": "MarkH",
      "helpful_votes": 2,
      "publication_date": 20161211
    },
    {
      "title": "Sorry I bought it & should of bought a different unit,",
      "text": "It’s too hard to load items to scan! Very easy to misalign sheets",
      "rating": 2.0,
      "verified": true,
      "author": "Gary O😎",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "I love it.",
      "text": "Nice and easy scanner. This little gem is so easy to use, light-weight, and portable, I love it. Installed in a minute.",
      "rating": 5.0,
      "verified": true,
      "author": "Web Tipster",
      "helpful_votes": 0,
      "publication_date": 20150121
    },
    {
      "title": "Great scanner for small jobs",
      "text": "Great scanner for small jobs. Single feed only but with good timing you can get mulitiple pages thru in the same PDF file.",
      "rating": 4.0,
      "verified": true,
      "author": "H. Nelson",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "Not really WiFi",
      "text": "Not saving my scanned docs and will not stay connected to the app",
      "rating": 1.0,
      "verified": true,
      "author": "Victoria Kemp",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "This scanner is awesome. It is can be used with USB or ...",
      "text": "This scanner is awesome. It is can be used with USB or cordless (via SD card or wifi). Many resolution choices and double sided scanning definitely speeds up scanning processes. I am using it on both PC and Mac and the only reason its not a full 5 stars is that it doesn't appear to support non-Brother software in Mac mode. The Brother provided software is actually pretty good however, but the lack of flexibility is the reason for the deduction. This this is pretty quick too. 8 (double sided) pages per minute.Awesome value and not much bigger than the average three hole paper punch.",
      "rating": 4.0,
      "verified": true,
      "author": "Gsh923",
      "helpful_votes": 0,
      "publication_date": 20141126
    },
    {
      "title": "Thoroughly disappointed.",
      "text": "The connection is not stable. Not worth the price/features. Thoroughly disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "IRIS ENERGY",
      "helpful_votes": 0,
      "publication_date": 20180221
    },
    {
      "title": "Cannot connect to wireless followed instructions and none of my ...",
      "text": "Cannot connect to wireless followed instructions and none of my devices can find it going to return and buy something else that works",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20171026
    },
    {
      "title": "Works as States.",
      "text": "Wonderful scanner. Have not used WIFI. Battery works for my home digital filing application.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger from Oz",
      "helpful_votes": 0,
      "publication_date": 20150503
    },
    {
      "title": "Love this!",
      "text": "Awesome scanner; this is perfect for quick and portable scanning projects...",
      "rating": 5.0,
      "verified": true,
      "author": "Loni Gee",
      "helpful_votes": 0,
      "publication_date": 20150306
    },
    {
      "title": "Four Stars",
      "text": "This is a great small scanner. Sometimes my Quick Books program crashes with it though.",
      "rating": 4.0,
      "verified": true,
      "author": "DONNA MILLS",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Works great, needs multipage functionality",
      "text": "This little scanner works great in both color and black/white, but it would be awesome if it could scan multipage PDFs.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr. Anonymous",
      "helpful_votes": 0,
      "publication_date": 20140701
    },
    {
      "title": "Easy to use",
      "text": "Easy to use. Great document quality. Battery lasts a long time. Haven't tried the wifi feature yet, just using the USB cable or the SD card. Overall I would definitely recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Great quality scans",
      "text": "This was a life saver at work. Great quality scans. The guides weren't amazing though, so make sure you're lined up well when you run something through.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason T",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "Five Stars",
      "text": "Works well and it is what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah B.",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Five Stars",
      "text": "Excellent image, easy to use once you get the CD to download and understand the WiFi setup.",
      "rating": 5.0,
      "verified": true,
      "author": "handyman1",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Two Stars",
      "text": "The scanner was packaged with a damaged calibration sheet. My scans are blacked out.",
      "rating": 2.0,
      "verified": true,
      "author": "EAM0310",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "Scan to your heart's delight!",
      "text": "Very convenient and easy to use. Some of the ancillary software was a bit harder to understand but the unit itself is well worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugenio L. Sabalburo",
      "helpful_votes": 0,
      "publication_date": 20141013
    },
    {
      "title": "but it looks like the scanning formats are not as bright as I ...",
      "text": "I didnt check all the functions of the item yet, but it looks like the scanning formats are not as bright as it should be. It quite dark.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Does NOT scan over Wifi",
      "text": "It claimed to support wireless communication, but it only works in AP mode unlike the Epson model that I was replacing that works on either Wifi or AP mode. I had to return it since it does not meet my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "... to get this item to work but it is great.",
      "text": "Took a little while to get this item to work but it is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "I love this product",
      "text": "I love this product.. scanned thousands of family photos with it while watching football games on TV :) Fast and easy.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20151221
    },
    {
      "title": "Marvelous Portable Scanner",
      "text": "I just returned from an 8 day trip working with clients in Honolulu. I used the scanner every day in conjunction with a Canon iP1000 printed and was able produce, print, scan documents and material for my clients and the local co-counsel. I just received an e-mail from my co-counsel in Honolulu who wanted information about the scanner as she wants to purchase one. Enough said!",
      "rating": 5.0,
      "verified": true,
      "author": "David W Lowe",
      "helpful_votes": 0,
      "publication_date": 20140515
    }
  ],
  "product_meta": {
    "title": "Brother Wireless Mobile Color Page Scanner, DS-920DW, Wi-Fi Transfer, Fast Scanning Speeds, Compact and Lightweight, White",
    "description": "The Brother DS-920DW is an exceptional wireless color mobile scanner, perfectly designed for the business professional on the go who demands quality in their office equipment. Measuring just under 12.5″ long and weighing just over a pound, the DS-920DW is perfect for the mobile professional who needs a powerful scanner that will slide right into a briefcase or business bag. It’s ideal for capturing two-sided business documents, receipts, business cards, laminated identification cards, invoices, photographs, and more. It can operate altogether wirelessly thanks to the Wi-Fi interface and included rechargeable lithium-ion battery, enabling Wi-Fi transfer of scanned documents to a computer or compatible mobile device(1).\n\nThe DS-920DW provides users with the option of scanning to different destinations to help manage documents and workflow. Using the included scanning software, you can scan documents to a local file or image, a shared folder, email, FTP, or a printer, making it easy to save, distribute, and share information(2). Wi-Fi connectivity and the included 4 GB SD memory card provide users the flexibility to scan documents to Wi-Fi enabled computers and to Apple or Android mobile devices. The easy-to-use LCD display and dedicated scan-settings keys make operation and customization of commonly-used scanning options intuitive, saving you valuable time.\n\nThe Brother DS-920DW scans at resolutions up to 1200 × 1200 dpi interpolated and 600 × 600 dpi optical, with fast color and black scan speeds of up to 8ppm, or 5ppm in duplex scanning mode(3). Its small size, flexible USB or battery power, and valuable suite of scanning software make it a great fit for home offices and desks with limited space as well.\n\n(1)Scanned materials can only be wirelessly transferred to Wi-Fi enabled computers and mobile devices with Internet browsers, as well as Apple and Android mobile devices via free MIWAND app. MIWAND app available for download from the Apple App Store and Google Play Store. (2)Scan-to options accessible via included Button Manager V2 software (Windows) or DSmobileCapture application (Mac & Windows). Scan-to e-mail, FTP, shared folder, and print options not supported by Mac OS. Scan-to OCR via included PaperPort (Windows) or PageManager (Mac) software. (3)Color and monochrome scan speed with all advanced features turned off, LTR at 300dpi. See manufacturer’s website for details.",
    "rating": 3.6,
    "feature_bullets": [
      "WIRELESS MOBILE PAGE SCANNING: The Brother DS920W is a wireless mobile color scanner that offers multiple connectivity options.",
      "WI-FI TRANSFER SCANNED DOCUMENTS: The DS-920W mobile scanner can wirelessly send scanned documents to your computer or mobile device(1).",
      "COMPACT & LIGHTWEIGHT: The DS-920W has a sleek design, measuring 12.5″ long and weighing just over 1 pound.",
      "PRECISION SCANNING: The Brother DS-920W Mobile Color Page Scanner can produce black & white or color scans up to 600 × 600 dpi resolution.",
      "MULTIPLE POWER SOURCES: The Brother Wi-Fi mobile scanner is powered by a rechargeable Li-ion battery or a USB cable.",
      "For installation and usage support, please reference the user guide and installation manual"
    ],
    "specifications": {
      "Batteries": "Lithium Metal batteries required. (included)",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "6.6 x 30.73 x 4.06 cm; 530.7 Grams",
      "Date First Available": "26 Feb. 2014",
      "Manufacturer": "Brother Printer",
      "ASIN": "B00EKW8UPG",
      "Item model number": "DS920DW",
      "Customer reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Electronics & Photo",
      "Scanners & Accessories",
      "Document Scanners",
      "Scanners"
    ],
    "price": ""
  }
}