{
  "website_summaries": [
    {
      "verdict": "A great value microphone to buy for general video recording and vlogging on a budget.",
      "pros": [
        "Microphone does a good job of picking up the intended sound while minimizing ambient noises",
        "Microphone mount is compatible with most modern video and DSLR cameras"
      ],
      "cons": [
        "The integrated shock mount does not do a good job of eliminating vibration noises"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I never realized how important audio was until I tried this mic!",
      "text": "I recently rebooted my YouTube channel which was dormant for nearly 5 years. After rewatching some of my old videos I realized that I needed to upgrade my setup if I wanted to remain relevant and stay up to date. I have this paired this with my Canon t6i and am super pleased with the outcome. The production quality is 10 fold what it use to be. Definitely a must have for any outdoor shooting!",
      "rating": 5.0,
      "verified": true,
      "author": "SpoodleTop Contributor: Camping",
      "helpful_votes": 50,
      "publication_date": 20170720
    },
    {
      "title": "And STILL the best value mic.",
      "text": "See my other two reviews of this same mic. There is a reason I keep purchasing them (and it IS NOT because my previous ones broke). They are all still functioning flawlessly. As I said before - best value mic for the budget DSLR shooter. Whenever I add a new camera to my arsenal, I automatically buy a new SGC-598 to go with it.",
      "rating": 5.0,
      "verified": true,
      "author": "AndreTop Contributor: Photography",
      "helpful_votes": 33,
      "publication_date": 20170830
    },
    {
      "title": "AKSTAR SGC-598 almost preforms as well as my Sennheiser ME67/K6 which costs several hundred dollars more.",
      "text": "I am an award winning special effects filmmaker and used many shotgun microphones but never used one this inexpensive. After I tested the TAKSTAR SGC-598 I was so amazed how good this mic performs that I bought another one. The TAKSTAR SGC-598 almost preforms as well as my Sennheiser ME67/K6 which costs several hundred dollars more.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 80,
      "publication_date": 20170108
    },
    {
      "title": "DOES NOT WORK WITH ALL CANON CAMERAS",
      "text": "Really unhappy because this said it was compatible it’s canon cameras, yet the microphone jack is way too big and will not insert into my camera. So I have to return it. JSYK IT DOES NOT FIT ALL CANON CAMERAS!! I have a canon T6 and I just wasted my time.",
      "rating": 1.0,
      "verified": true,
      "author": "Austin & Ashton",
      "helpful_votes": 18,
      "publication_date": 20180909
    },
    {
      "title": "This camera mounted microphone cannot be mounted on a camera",
      "text": "I tried to mount the mic on a Canon 200D. The camera clip nut is poorly designed and doesn't fit the camera's mount. Since I can't mount this mic on my camera, its completely useless. Poorly designed and manufactured.",
      "rating": 1.0,
      "verified": true,
      "author": "Nuwan Perera",
      "helpful_votes": 15,
      "publication_date": 20181001
    },
    {
      "title": "HUMMING FEEDBACK!",
      "text": "I purchased because of so many good reviews for this price. I even read reviews on how to stop the buzzing sound. I am here to tell you- it does NOT work. Nothing stopped the nasty humming sound. I googled searched for help & watched so many YouTube videos. NOTHING WORKS. The humming is so loud! [Camera: Canon Rebel T5i] Also, I can’t get the battery in properly. It pokes out. Why can’t I fit a regular AA battery into the slot without feeling like I’m going to break the mic?! I’m so disappointed. SAVE YOUR MONEY.",
      "rating": 1.0,
      "verified": true,
      "author": "For The 99-2000",
      "helpful_votes": 10,
      "publication_date": 20181120
    },
    {
      "title": "For the price it is an exceptional microphone that I am glad to have in my accessory case",
      "text": "I use this mic for video with a Canon video camera. It works very well compared to a built in camera mic. There is a learning curve as the included documentation doesn't help much with the actual use. To use the built in switches required a period of experimentation to figure out their effect and when they would be beneficial to use. It is somewhat directional during use and picks up some noise from the sides but this can be controlled once you learn the settings. For the price it is an exceptional microphone that I am glad to have in my accessory case. ( ̄`·._.·ns¢ävË·._.·' ̄)®",
      "rating": 4.0,
      "verified": true,
      "author": "Geo",
      "helpful_votes": 6,
      "publication_date": 20180225
    },
    {
      "title": "Works great and budget friendly",
      "text": "I bought this Takstar back in January of 2018. I’m posting this video today, 4-15-18. The product is still working great. I ise it on my Nikon D5500 and on my Onstage mic stand as a overhead boom mic.",
      "rating": 5.0,
      "verified": true,
      "author": "TroysHobbies",
      "helpful_votes": 10,
      "publication_date": 20180415
    },
    {
      "title": "Much Better than my Rode VideoMic",
      "text": "So far so good, and it's amazingly great for the price! I was unhappy with my Rode mic and now I have something that I think will be great for run and gun moments. If you crank up the video, under the Rode, you will here a humming interference that is always there. I do want to say I am a HUGE Rode fan. I love their products and all my high end mics, 7 of them, are Rode. This was a weak point, maybe their other on camera mics would have been better, but I wanted to try the Takstar for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Morgan",
      "helpful_votes": 6,
      "publication_date": 20181116
    },
    {
      "title": "Meh. Not stellar.",
      "text": "I had such high hopes that this mic would put some pop in the videos of our public speakers. I had expected the mic to \"reach out\" across the room to better hear our speakers. However, it's not any better than the built-in mic on our Canon VIXIA HF R800 Camcorder. Also, does the thin have to be so large? It seems like there's a ton of extraneous plastic.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen Hall",
      "helpful_votes": 4,
      "publication_date": 20190219
    },
    {
      "title": "I would be better off using the built in microphone on my camera",
      "text": "I would be better off using the built in microphone on my camera. The sound quality on this thing is terrible. There is always a lot of static in the sound. Not worth the money.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 10,
      "publication_date": 20171223
    },
    {
      "title": "Better than built in, not as good as I was hoping for",
      "text": "I have been getting more into the advanced features of my DSLR, and wanted to try recording video on it. The built in microphone is a non starter, so I needed to get something external. Enter this microphone. The mounting was solid, the cable was coiled to keep it out of the way, and it has a battery boosted pickup. It is DEFINITELY better than my built in microphone, but still a bit “distant” sounding. I’ve played with the audio settings on the camera, with no improvement. Will this do for my hobby? Yes. Will this do if I get more serious? Probably only as a backup...",
      "rating": 3.0,
      "verified": true,
      "author": "David S",
      "helpful_votes": 0,
      "publication_date": 20200412
    },
    {
      "title": "mediocre - helps a little but not much",
      "text": "it’s alright. the sound quality is a little better than straight from the camera but not much. cuts down background noise a little bit but again it’s nothing great. I used to use it for YouTube videos for the slight improvement but if I’m shooting random videos or traveling I don’t even bother. didn’t use it for my wedding video, it seems like if you’re more than a few feet away it’s actually better to use a camera mic because the sounds gets pretty faint when you’re more than a few feet away. good for up close but otherwise no point",
      "rating": 3.0,
      "verified": true,
      "author": "Jessica Brody",
      "helpful_votes": 2,
      "publication_date": 20200808
    },
    {
      "title": "Excellent Audio",
      "text": "I was skeptical of some of the reviews of this microphone. People have been raving that this is better than the Rode at less than half the price. I have used this now for two events and have to say I'm very happy with the audio quality. Very clear audio. Not as much bass as the Rode but that can be adjusted later in editing. This mic seems to have better high end than the Rode. Overall great product. You can't go wrong with this microphone.",
      "rating": 5.0,
      "verified": true,
      "author": "ScottAKTop Contributor: Photography",
      "helpful_votes": 3,
      "publication_date": 20180528
    },
    {
      "title": "I recommend this product!!",
      "text": "WOW! I surely didn't expect this cheap microphone to be such a BOSS!! Thus actually SOUNDS GOOD! I compared it to my EXPENSIVE Rode mic and I believe the sound quality was BETTER! Now the Rode has a bit more bottom however I can introduce that in post pro. Also, the TakStar has an extra srewin posision for the shoe plate thus putting ut forward so yhat it usnt jammed in your face when lookong thru the camera viewfinder. Good thinking! I highly Recomend this product!!",
      "rating": 5.0,
      "verified": true,
      "author": "tomm",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Cheap but Good!",
      "text": "I use the Takstar 598 on my Canon DSLR and found the sound loud and clear. One trick I want to relay, since many buyers complain that the mount does not fit the hot shoe on their DSLR. The fix is very easy. Take the mount off the microphone with a screwdriver, then gently grab and twist the square mount with a plier while holding the turn-knob with the other hand. The turn-knob is now loose and ready to use after reassembling.",
      "rating": 5.0,
      "verified": true,
      "author": "Fold Me Up Scotty",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Bought this on a recommendation",
      "text": "I was recommended this microphone from a YouTube video for the Canon Vixia M301 camcorder. The Canon brand is way to expensive. This one was just right. Goldie Locks reference. If you purchase for the Canon you will need the mini shoe adapter. The sound quality is awesome. Just don't forget to turn on the battery as this is a powered microphone. The wind buffer that comes with it will muffle small breezes. You will need a different wind buffer for stronger winds. The microphone will pick up to 20 Feet away clearly and the attenuation will pick up another 5 feet away. All in all, this is a quality product and well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Berlon Burch",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "not impressed at all.",
      "text": "Having read some of the reviews saying that this mic was just as good as some of the other higher end models, I figured i'd try it. It isn't. by a long shot. It has a sound of a typical cheap shotgun mic, hollow sound, and picks up everything around it, not only in the front. the foot is plastic and I question how long it'll last. Definitely returning it.",
      "rating": 2.0,
      "verified": true,
      "author": "Arseny M",
      "helpful_votes": 3,
      "publication_date": 20190129
    },
    {
      "title": "Great little-ish shotgun microphone",
      "text": "I read a lot of reviews on this little shotgun and I'll have to agree, it definitely does what it should and I have no complaints right now. The quality sounds awesome and I like that I can boost the sound while still recording, which helps because my Gh4 won't allow me to boost the audio recording while I'm recording. It's definitely a lot larger than I was expecting, but doesn't hinder the performance or my rating. Great secondary shotgun microphone for my run-and-gun shooting style.",
      "rating": 5.0,
      "verified": true,
      "author": "Aloha NinjaTop Contributor: Photography",
      "helpful_votes": 5,
      "publication_date": 20170710
    },
    {
      "title": "Super duper cheap",
      "text": "Super duper cheap. Its full of a ton of white static noise. All you hear is shhhhhhhhhhhhh crshhhhhhhhhhh bshhhhhhh and that was in a silent room........ maybe i got a defect? Idk ill have to find time to return it now. Being full time job and fulltime college.",
      "rating": 1.0,
      "verified": true,
      "author": "Taitmon Lynch",
      "helpful_votes": 7,
      "publication_date": 20180223
    },
    {
      "title": "It does not work",
      "text": "I bought this back in 2017 and I haven't really got to really use it and compare audios until now (11Sep2019). I did try it back in 2017 and compared that it didn't work when I compared it with and without the mic. When I tried to use it again, hopefully maybe it work this time, it didn't work just as I first used it. I compared it without the mic and with the mic just as the first time, and it still recorded with the internal camera mic. Basically this Takstar mic is just for show with no functionality.",
      "rating": 1.0,
      "verified": true,
      "author": "Alexander",
      "helpful_votes": 2,
      "publication_date": 20190911
    },
    {
      "title": "It works",
      "text": "It's probably nice to have on a low end camera, but my camera is very good one and this mic didn't provide any improvement over the camera's built in mic. I did some sound testing with it and haven't used it since. But it does work. The switches do a few things, but still, not any better than the camera's built in mic. For in studio audio on producing YouTube videos I have a condenser mic, this thing doesn't even come close to that. I'm not gonna dog it, becasue it does work, it just won't fill the need for pro sounding audio IMO.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Huff",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "Doesn't work with iPhone",
      "text": "I got this to use with my iPhone which only has a lightning connector. I have the lightning to TRS adapter but the microphone just doesn't work with the iPhone. The +10dB switch does nothing. Since it didn't with with my iPhone, I tried it on my laptop. It did work but sounds no better than the laptop's built in microphone. I'm not sure what I expected for $22 but this is pretty worthless.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Boughter",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "NOT the worst thing",
      "text": "If you need to get a shotgun mic to cancel out some of the surrounding noise and capture audio close up, this is the one for you. Don't try to get all James Bond and record someone from 30 feet away, this wont work for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 2,
      "publication_date": 20200327
    },
    {
      "title": "This device is way better than the rode Mike",
      "text": "Okay read this whole review. Go to YouTube and try to find something bad about this device. You won't be able to find anything bad about this the sound is great it's very clear the price is excellent it's very inexpensive when people here cheap they think of low quality I have been using this thing for months now and you can't do any better. Do not buy the rode mic you'll be wasting your time it's like when people say you have to have a Apple device and it does nothing better than an Android device buy this thing and buy it today you will not be disappointed",
      "rating": 5.0,
      "verified": true,
      "author": "K TAYLOR",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "It was a pretty good mic",
      "text": "However, I haven't even had it a full year and the batter melted inside of it. really disappointed in that. otherwise it isn't a bad mic. I have a RODE now though and love it. This is an okay alternative version to that. I've never used a mic before this and the directions are mostly in an Chinese and I guess it's the warranty card? idk it's all Chinese as well so i'm not sure how to do that if it's even applicable. It also makes loud sounds distort really bad.",
      "rating": 2.0,
      "verified": true,
      "author": "Lauren",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "The Chinese knock-offs are getting really, really good!",
      "text": "This sucker is quite the piece of gear. Not even looking at the price, the quality of audio coming out of it with the +10db boost is very impressive. I'm using a Fujifilm XH-1 and set the +10db switch with the in camera gain locked at -15db. I'm getting good signal and no noticeable hiss. This is pretty impressive and blows the socks off the $50 Saramonic mic I have. Better audio quality, Longer range, Lower noise floor, equal build quality. Cut and dry one of the least regretful purchases I've made on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "T.Clark",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "So far working great",
      "text": "So far works really well. Make sure you manually adjust the volume levels for each person that will be talking during the recording because the mic is very sensitive. It was easy to attach to my camera and pretty easy to adjust the levels. It's light weight and didn't really and any noticeable difference to the weight of the camera. Overall I would recommend this for anyone looking for an inexpensive way to record before audio than the internal mic on the camera",
      "rating": 5.0,
      "verified": true,
      "author": "Darren N.",
      "helpful_votes": 5,
      "publication_date": 20161202
    },
    {
      "title": "DO NOT CONNECT TO SMART PHONE!!! Works great on DSLR, Fried my 400gb SD Card in Phone",
      "text": "I've been using this for a year on my Canon DSLR and it's works great with long lasting battery life. I recently hooked it up to my Samsung Note 8 and it destroyed my 400gb SD card instantly. The video's I shot with it were instantly corrupted and everything I tried to load to it afterwards corrupted as well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer Burtz",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "So far so good.",
      "text": "I'm using this on my Nikon D7100 for interviewing roller derby athletes during practices and between games. So far it's doing its job accordingly. The instructions could have been a bit more thorough, or better translated, but it's not essential as it's a very straightforward item. Plug it. Turn it on. Minus a star for not coming with a furry wind sleeve for outdoor use. As is it's really only useful for inside. It also still picks up the sound of my lens focusing. Not a deal breaker, just a bummer that limits its use.",
      "rating": 4.0,
      "verified": true,
      "author": "Rideout Clan",
      "helpful_votes": 4,
      "publication_date": 20170217
    },
    {
      "title": "don't buy, doesn't work",
      "text": "I tested this out and it doesn't make your videos sound any better your better off just with your camera own voice recording. Another problem I had was the battery it took a lot putting the battery in and the lid for it wouldn't fit with the battery in there. Once I was done, I wanted to remove the battery, it was really stuck in there, and I ended cutting my finger. Wasn't worth the wait, or money.",
      "rating": 1.0,
      "verified": true,
      "author": "Kassytron",
      "helpful_votes": 2,
      "publication_date": 20181224
    },
    {
      "title": "Perfect fit for our application",
      "text": "We're just starting to dabble in shooting video, and didn't want to spend a ton of money on an expensive mic. After researching reviews here, YouTube and elsewhere, we purchased this Takstar. The only downside is if I opt to use the viewfinder instead of the LED screen, it does get in the way. That, and I wish the battery access was a bit more solid feeling and easier to use. But it does use a separate battery instead of power off the camera...and I think that's a bit of a plus. Other than that, I've been quite pleased with it",
      "rating": 4.0,
      "verified": true,
      "author": "Thespian",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "To be honest, it's terrible.",
      "text": "I bought this thinking it would be good sound quality for the price. Little did I know that half the time it would be terrible! When the 10dB boost isn't enabled, you can barely hear anything in the video playback, so you're forced to use the boost if you want to hear ANYTHING. Also, when the boost isn't turned on, there's CONSTANT white noise in the video playback and it takes over almost all of the video's audio. When I DID use the 10dB boost, it was OK. Sound quality, DEFINITELY not good by any means. Do yourself a favor and save for a Rode Microphone. The only reason I bought this was because it was cheap.",
      "rating": 2.0,
      "verified": true,
      "author": "MCN Mike",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Nice Mic - Useful",
      "text": "Works great. I use this as a mic for my walk around videos where I'm normally in a crowd of people. When the mic is pointed in a certain direction it picks up just enough of that direction with background drop off. When I'm within 5 feet of a particular subject, it picks up enough of that subject to be useful. Not bad, and a pretty good price. I wouldn't necessarily use this as a focused interview mic but it works well enough for \"at the moment\" type or pod cast mic, but for a man on the street mic, works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Not compatible with Pixel2 smart phone",
      "text": "Can't actually attest to the quality of the mic. I haven't used it for a video yet. My first review complained that the mic was incompatible with my Pixel2 phone. But actually, I learned, you need to unplug the mic from the phone when you do the playback, otherwise, your test video looks like the mic didn't work. But if you unplug the mic from the phone, you can hear the sound was recorded. I'm looking forward to using this mic with my next recording!",
      "rating": 3.0,
      "verified": true,
      "author": "David S. Locicero",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "Good mic but feels a bit cheap",
      "text": "I like this mic but had to take off a star because you just can’t figure out when The battery will die and the battery cover just feels cheap and could get broken and lost easily. That said for the price it’s not bad. Sound quality is better than some brand names like Audio technica. Less noise and a balanced sound and equalization. It’s light enough to fit on Dslrs and camcorders without issue and without making them too heavy.",
      "rating": 4.0,
      "verified": true,
      "author": "Ria Jairam",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Works well for the price. An upgrade from just standard oncamera mice",
      "text": "Quality is decent for the price if you are on a budget and have an ability to make some minor enhancements to the sound in post production. For the price... good budget mic for lower budget videos. I bought a long 3.5mm chord and adaptor and I use it as a boom mic to the camera for more direct in-camera audio with longer lenses. One recommendation.... keep the box. The foam is great and the mic fits very nicely and secure.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth V.",
      "helpful_votes": 0,
      "publication_date": 20180723
    },
    {
      "title": "DONT BY THIS!!!",
      "text": "I got the item in a great time, however it don’t work! I tried with a few devices and none picked up a sound",
      "rating": 1.0,
      "verified": true,
      "author": "Alfonzo",
      "helpful_votes": 4,
      "publication_date": 20190823
    },
    {
      "title": "Better than your Rode Mic",
      "text": "It is way cheaper than a Rode mic and has much better sound quality too, I watched many reviews on YouTube about this mic so that my Nikon D3200 would sound amazing when doing videos. this mic will not disappoint. one concern is where it connects to the Hot shoe is a little weak but if your careful and not taking toxic masculinity out on the mic when installing and and tear down from your camera it will be just fine!.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew L",
      "helpful_votes": 0,
      "publication_date": 20201008
    },
    {
      "title": "I couldn't get it work with my iPhone",
      "text": "Leaving a review for built and not sound quality because I couldn't get it to work with my iPhone. I'm returning it. But here's the reason I'm leaving some thoughts: It is actually built solid. For a mic that costs less than $25, this is a steal if it works the way others have described. But do not get it for your iPhones. I had the iPhone 6S plus. I used the TRS to TRRS adapters but it still did not work. Super frustrating as I was really looking forward to using this mic for my vlogs. But for now, I will continue looking.",
      "rating": 4.0,
      "verified": true,
      "author": "Sid Riz",
      "helpful_votes": 0,
      "publication_date": 20190813
    },
    {
      "title": "Don't Waste Your Money - Over Hyped. Sony Camera Microphone much better",
      "text": "I thought I would try this in lieu of the sony alpha camera microphone but the results were very poor. Noise floor levels were up and the microphone sounded very boxy. Possibly only good for close vocal audio it may do good depending on the room. But my experience from 5 feet and using a guitar was very poor. I am going to have to eat this purchase I guess as I don't want to waste my time sending it back.",
      "rating": 1.0,
      "verified": true,
      "author": "MAP",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Gets the job done!",
      "text": "So recently I started working on a documentary and needed a mic for better quality. I stumbled upon this beauty here! For the price the quality is great and it’s more lightweight than I imagined. This thing also picks up sound very good we were hearing things that we were sure would not pick up but after working with the settings we got the perfect sound. This is a great add on for anyone on a small budget!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Johnson",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Does not fit my hot/cold shoes.",
      "text": "Based on the Youtube reviews I'm going to assume this works as described. However, I have not been able to test it as the back half of the foot that slides into a hot/cold shoe is just slightly too wide. Not interested in returning it but now I have to safely shave off about 1/32 of metal to get it to fit. A sign of poor quality control.",
      "rating": 1.0,
      "verified": true,
      "author": "W. Stokes",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Instructions are not properly written in good English.",
      "text": "This is a really impressive microphone for the low price. I was doubtful at first until I began using it. It picks up well up to 10 feet. The spiral cord could be at least 3 inches longer, especially when using a camera cage. I would rather have extra cable sagging than to be stretching the cable almost beyond its reach to plug into the camera. Otherwise, I would give this 5 stars. Plastic screw threads and rotatable wheel knobs are so common in a lot of products today and eventually wear out quickly. I would prefer aluminum or mental. Instructions are not properly written in good English.",
      "rating": 3.0,
      "verified": true,
      "author": "AllComputing",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Absolutely pleased and surprised.",
      "text": "Hard to believe this is under 30 bucks. Works great on my Nikon D7200. The 10db boost is very nice and the bass effect swith smooths out the sound. Unit seems to be well built and fits everything perfectly. Only con is I thought the description said a battery was in the box but it’s not. But only takes a single AA. I’m very pleased and very pleastly surprised.",
      "rating": 5.0,
      "verified": true,
      "author": "laff",
      "helpful_votes": 2,
      "publication_date": 20171216
    },
    {
      "title": "The price and the quality match up.",
      "text": "For the price it really isn’t bad. My rating isn’t based on the price though. The product’s build quality and craftsmanship is fine. The issue I had was that the quality of the audio and the noise canceling was pretty bad. Constant distortion. Maybe I received a defective unit? Not sure, but for 3x the price I was able to get something that sounds professional. If you are looking for something entry level this really is nice.",
      "rating": 2.0,
      "verified": true,
      "author": "B. Dement",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Amazing microphone.",
      "text": "This is an amazing microphone. I was recording a video next to a running outside AC unit, and it canceled out the noise. The microphone is very directional. Very rarely needs the battery to be changed. I've accidentally left it on for 24 hrs before and the battery still lasts months. The audio quality is superb, its better than my stand microphone I have for my computer. I might hook it up to the computer to do voiceover work. I would recommend and definitely would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "EStein",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "This thing is unreal",
      "text": "I bought this to improve the quality of my phone based live vlogs and Zoom meetings thinking that I would see a decent improvement over the phone mic. I was correct but this is performing better than I could have expected. I have even hooked it up to my mixer to see how it stacks up against my much more expensive Rode NTG2... I was very impressed with the Takstar. As long as the price stays below $50 you cannot go wrong buying this for a camera mounted or overhead shotgun mic when you are on the go or even getting started live streaming at home.",
      "rating": 5.0,
      "verified": true,
      "author": "Desultory Me",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Amazing microphone.",
      "text": "I use this microphone every time to make video reviews on youtube, it is one of the best investment I have and for such a great price, it uses one AA battery and it lasts for a very long time, the sound it picks is very loud and clear, my only complaint is that is mono so the sound is very flat and it narrow, but is very clear, I also tend to forget to turn it on sometimes after Im finish with my video and then realized there is no audio, but that is my bad. In the end, this is a great microphone, highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Joelster",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Great mic",
      "text": "This is my second Takstar SGC-598. I have had one on my Canon HF 800 for three years, using it primarily in winter and purchased this one for a Nikon D3200. Most of my video recording is outside in cold weather (ice fishing) and this mic fits the bill. Great battery life, adjustable to a degree for boost and filter, and really works great to cancel out unwanted peripheral noise since it is directional. Has been a great addition to my limited gear and has improved the audio on all my videos greatly. Light, robust and inexpensive....",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Howe",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "This shotgun mic is AMAZING..",
      "text": "This shotgun mic is AMAZING....for it's price. I'm comparing this to the RODE Videomic Pro. Now the RODE has the better sound, but at the $230 price tag it is not THAT much of a better sound. So at $30 this device is a steal. The ONLY problem with this mic is that it is much larger than the RODE. I personally will keep this shotgun mic until I decide to go with a higher end product in the $500+ range.",
      "rating": 5.0,
      "verified": true,
      "author": "Late To The Table (Youtube)Top Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20170329
    },
    {
      "title": "Great Quality, Durable Microphone",
      "text": "I've used professional shotgun microphones before and have found very similar quality within this microphone. If you're looking for a good, not-so-expensive option, please consider this product. I would seriously recommend this to anyone not looking to spend $200+ on a professional microphone like Rode or similar. The audio captured on the mic is very comparable to all other audio I've collected from expensive mics, and left me wondering why I didn't buy this sooner! If you are working with this mic outside, I would recommend purchasing (separately) a wind sleeve just in case, as the styrofoam around the mic itself isn't too thick. The construction of the product is sturdy and the shocks proved to be durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Con Del",
      "helpful_votes": 0,
      "publication_date": 20181128
    },
    {
      "title": "Switch location",
      "text": "Purchased this mic to use with my Sony A7RII to record our outdoor wedding ceremony. During my testing I was very impressed with the audio quality. I wish the on/off switch were in the back instead of on the side because it’s easy to forget to turn it on. When I set it up at our wedding I forgot to turn it on due to having so many other things on my mind so we now have a silent film for the wedding ceremony. My mistake though so I’m not knocking any stars on my review but a more noticeable location for the on/off switch would have been nice. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Clugh",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Great mic for a great price!",
      "text": "I bought this mic from recommendations of (Thinkmedia) on YouTube and it is great. It works great and looks nice! I have it on my Canon m50. So far so good no issues yet. Easy to use and understand. YouTube on how to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan B",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "This is a great microphone. It isn't the absolute best",
      "text": "This is a great microphone. It isn't the absolute best, mind you. Context though. I have a few rhode and samson mics that are great, but they cost about $50-150 more depending on the model. For the price, I have to say this mic is versatile enough to really up the production value for newbies but scales and provides very decent audio for veterans (given the price). I'm not trying to reiterate marketing selling points and such, but this microphone really provided me with great value (really good for when you dont want to risk pricier equipment).",
      "rating": 5.0,
      "verified": true,
      "author": "Frankie Falcone",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "You need an external mic if you're going to shoot video with your Canon DSLR.",
      "text": "Fits the shoe of my Canon Rebel perfectly (no surprise, it's a standard shoe). Just plug and play. Much better audio than the camera built in mic. Doesn't make the camera any more bulky. If you're going to use your rebel for video, this is a great upgrade from the built in mic.",
      "rating": 5.0,
      "verified": true,
      "author": "Askold W.",
      "helpful_votes": 2,
      "publication_date": 20180120
    },
    {
      "title": "Better then expected!",
      "text": "Well, I am impressed. I am not going to go into technical details but I will tell you this. I made a couple of videos with my Canon 5D Mark II with the on camera microphone and with the Takstar and I can tell you the difference it impressive. It even picks up your voice from far, tested at about 20 feet distance. If you are looking to do product reviews or educational videos this is an excellent device. One other thing I like is that it takes a normal AA battery instead of a weird or proprietary one.",
      "rating": 5.0,
      "verified": true,
      "author": "MannyMI",
      "helpful_votes": 4,
      "publication_date": 20160407
    },
    {
      "title": "Not working",
      "text": "Not working on my Nikon DSLR or Canon M50. No audio at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Alberto",
      "helpful_votes": 2,
      "publication_date": 20200316
    },
    {
      "title": "Made no difference in sound quality",
      "text": "Yes I went into the setup menu to make sure I had the settings correct but the in-camera Mic was as good or better than the TAKSTAR",
      "rating": 2.0,
      "verified": true,
      "author": "F Yahnimal",
      "helpful_votes": 2,
      "publication_date": 20200113
    },
    {
      "title": "No difference from a built in camera mic-Disappointing",
      "text": "I bought this mic 2 years back. Bought it reading good reviews that it would be a decent budget to go mic. So, I used it for making a short video where I had to record verity of sounds outdoor and indoor. When I went to editing I found that the normal built in camera sound and the sound recorded with this mic has nearly no difference actually. So, I stopped using it. I couldn't return it, coz it was already 30 days. Don't waste $25 for this. Not worth it.",
      "rating": 3.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Good little budget mic",
      "text": "I used this on my DSLR, to film and record birds on a windy day. I don't use noise cancelling on a mic, but rather do that in Premiere Pro/Audition. I was able to isolate the birds chirping from the wind very nicely. Otherwise, if you don't use editing software, you may want to invest in a better mic that will do the job up front. I left it on all day while filming and the batteries lasted.",
      "rating": 5.0,
      "verified": true,
      "author": "Amarosa Photography",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "So far so good",
      "text": "I have this mic mounted onto my BMPCC4k rig and so far the audio coming from the mic is clean. Keep in mind the body of the mic is on the larger side so for me I would need to use a cold shoe extension bracket (SmallRig Cold Shoe Extension 2044) to offset the mic to the side for a little more clearance. Overall, solid mic with an extremely solid price. I might just get a 2nd one for backup.",
      "rating": 5.0,
      "verified": true,
      "author": "Hieu V.",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Not the best mic on the market but is a good quality ...",
      "text": "Not the best mic on the market but is a good quality mic if you're on a budget or just starting out. Definitely better than using the camera's microphone. I've had no issues with weird static or not picking up, works fine for my videos. As an added note, it is a Mono mic, not Stereo, which I didn't realize at the time I purchased. Not the end of the world, but if you are picky about surround sounds or adding an extra step or two in your audio software, just be aware. Would recommend to others that are not sound snobs.",
      "rating": 5.0,
      "verified": true,
      "author": "J. H.",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Slight static noise when theres no other noise, good tho",
      "text": "I don't know if its operater error, but theres a slight fuzzy sound. I use this for youtube and I'm still figuring out all this stuff with cameras and mics, I'm only techy with my phones. The fuzzy static sound you can oy hear when no ones talking, i dont know that people other than me even notice. It picks up well from a distance though",
      "rating": 4.0,
      "verified": true,
      "author": "Crystal Plasters",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Very Effective and Inexpensive Mono Shotgun Mic for a Video/SLR Camera",
      "text": "We are local PEG (Public, Educational, Government) non-profit cable station and do a lot of outdoor events using these mics. We have several of these mono shotgun mics as well as equivalent mono Rode mics. The Rode mics are $250 each and this mic costs a fraction of that. Sound quality and features are about the same. The significant difference is the sound dampening of the Rode mic's shock mounting system, which is much superior. So if you have camera operators who like to tap the tripod, the Rode handles that better. However, the price of the TAKSTAR SGC-598 is such that we can easily afford to give one to everyone of our videographers.",
      "rating": 5.0,
      "verified": true,
      "author": "Bradley S.",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Shoe mount stuck or fused closed. Disappointing.",
      "text": "The shoe mount it came with appears to be majorly stuck or fused in the “closed” position. The adjustment knob will not turn so it will not fit into either hot or cold shoe since the adjustment knob is all the way closed and stuck. Good sound quality and all else seems fine, but that is a very disappointing flaw. Maybe I just got a bad one but some other reviews seem to mention this as well.",
      "rating": 3.0,
      "verified": true,
      "author": "Cherry Martini",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Good sound quality.",
      "text": "I own a Canon Rebel T6i, and I went ahead and compared the internal mic on the camera to the Takstar mic. You can definitely tell the difference between the two, and the winner is of course the Takstar. While the internal mic sound quality isn’t terrible, the Takstar gives the sound on the camera that extra push to sound good on video.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunnymask",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Does not fit Canon M50 - but possible to modify",
      "text": "Be aware that the clip does not fit the Canon M5 flash mount. It's possible to remove the Takstar mount (small screw inside) and file down the plastic. Bit of an effort, messy and annoying. Fits now but sound quality is only OK and nothing special. And the battery cover doesn't really snap tight. High quality China manufacturing... wish I went for something higher quality.",
      "rating": 2.0,
      "verified": true,
      "author": "ACB",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Very good especially for the price!",
      "text": "I make youtube videos about hiking and I needed a better mic that was wireless. This does a great job - better IMO than a Rhode passive mic for sure. Battery indicator light is very helpful. It is sensitive and will pick up noise, so i don't use the 10db boost, but once you know how it works it is great!",
      "rating": 5.0,
      "verified": true,
      "author": "Backcountry Pilgrim",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Need to be close to the mic",
      "text": "If you buy this mic if you intend to hold your camera, rather than leave it mounted on your tripod. Its a lot of noise. For the best quality and good audio you need to be within 2 feet or less, speaking directly into Mic, don't touch the mic, camera and if you have a DSLR don't use autofocus, noise is terrible. The mount does not fit the flash shoe mount on the camera (Canon T7) To me sounds like a cheap mike with a nice enclosure. If you need for serious camera film try something better. I chose to try base on the reviews but not happy with the performance.",
      "rating": 2.0,
      "verified": true,
      "author": "Tony Blanco",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "Better than Camera mic but little noise cancellation",
      "text": "If you are in a place that is not too noisy and subject directly in front of you and not looking away it’s solid. Start to throw variables and it may be deficient.",
      "rating": 3.0,
      "verified": true,
      "author": "Jorge Meraz",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Perfect for selfie recording (Vlogs) or interviews where subject is stationary",
      "text": "I really loved this piece of uni-directional shot gun microphone. It is well built and very affordable for a beginner like me to create videos for my youtube channel. I set up this very quickly and it has some shock absorber below the microphone. For nice audio pick up from 10-20 feet straight to camera, we can use this is cameraman also wants to talk ( cardiod pick up ). I am very much satisfied and full value for the money I spent. Its my daily vlogging microphone although I have some Rode Wireless go. I also use this with iphone but with two adapters sold separately.",
      "rating": 5.0,
      "verified": true,
      "author": "Paddu",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Excellent for CanonT4i",
      "text": "What! What! This Microphone has made a HUGE DIFFERENCE in my youtube videos. If you make videos this is definitely a must for sit down interviews. Just a reminder, this microphone has a On/Off Button--I myself am not used to turning audio on or off because at work we work with more professional camera equipment that gets its power from the camera itself and doesnt need to be turned on. But because this is used for DSLR cameras then it requires Double AA batteries. Definitely love this microphone with my canon T4i.",
      "rating": 5.0,
      "verified": true,
      "author": "SimplyMarcela",
      "helpful_votes": 2,
      "publication_date": 20160202
    },
    {
      "title": "Real winner over RodeMicro",
      "text": "This works better than my RodeMicro and that’s a more expensive mic. Reviews all said it was good and they are right. Use +10db with caution as it raises the floor level. You need a dead cat for outside. You need TRS extension for any boom pole. Don’t forget to turn off battery after each session",
      "rating": 5.0,
      "verified": true,
      "author": "Captain PaulTop Contributor: Photography",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great Mike professional  customer service",
      "text": "I'm not an audio expert, This is the first external microphone I have owned .I use it with my Olympus em1 Mark ll camera. The audio I record is clear as audio that is on my friends set ups and they spent a lot more than I did. Try it you will be happy. I had 1 problem with a small part of my order was missing, the company resolved it quickly, they were serious about doing the right thing in making sure I was satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "BRIAN10956 ",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "For the price it's great",
      "text": "For a boom mic, this is a really good one for such a low price. It's clearly a lightweight, plastic unit. But the sound quality is good as long as you make sure to have it no further than 2-3 feet away. So I mount it on a extension and pointed at my head from an angle above just off camera and it picks up just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "RixCan",
      "helpful_votes": 0,
      "publication_date": 20200604
    },
    {
      "title": "Great deal!",
      "text": "This is a nice microphone, but not for professional use. External noise is still audible despite the wind guard. The sensitivity can be adjusted though to dampen the external noise. It's made of plastic and metal and isolated by little rubber retainers to the plastic base which mounts onto the camera's flash mount. The audio is 10x better than the DSLR's built-in mic. A good deal for a beginning videographer. Overall, a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "nedy",
      "helpful_votes": 2,
      "publication_date": 20160712
    },
    {
      "title": "Great as cheaper option to more expensive mics",
      "text": "I wasn't expecting a whole lot in purchasing this, I just hoped to get something better than my camera mic. I'd borrowed someone's Rode before this and loved it, but couldn't afford it. I read that this was a good option if you liked the Rode. It turned out to be almost the same quality as the Rode I used. Now, having used it, even if I could have splurged on a more expensive mic, I'd still opt to buy this one. May upgrade in the future, but not in any rush as this does the job.",
      "rating": 5.0,
      "verified": true,
      "author": "Dogeared Reviews",
      "helpful_votes": 0,
      "publication_date": 20190827
    },
    {
      "title": "You definitely get what you didn't pay for",
      "text": "This Mic is awesome. I don't understand how such a quality item can be so effordable. The sound and build quality is great. Mine came with a high quality wind cover. I used this mic several time and it worked flawlessly. Its not a Rhodes Pro but it didn't cost $160.00 bucks either. I will purchase one or two more. I recommend this mic to anyone who isn't demanding high end production. The battery life is great. I use rechargeable Enaloop and they last all day.",
      "rating": 5.0,
      "verified": true,
      "author": "Cedric Sr",
      "helpful_votes": 0,
      "publication_date": 20181206
    },
    {
      "title": "Works OK but not needed",
      "text": "I combined this mic with my new Canon Vixia HF R800 camera to shoot how-to videos in my workshop. After making some test recordings both with this mic and with the builtin Canon mic, I found that there was virtually no difference in sound quality or depth. With this camera, at least, there seems to be no need for this external mic.",
      "rating": 3.0,
      "verified": true,
      "author": "Disposer",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "I've used a pro model on my Nikon,  this product work great for me.",
      "text": "For the MONEY, you get what you pay for. With that said, for what I need it works great. It's not a pro model, however if your not, it should work fine. It's not 5 star, but then again I knew that. I like though. I used it for a birthday party. It worked better than iphone, people were impressed with the sound. I got some unsoliciated sound across the room.",
      "rating": 5.0,
      "verified": true,
      "author": "dynaman04",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "Good product at a great price.",
      "text": "I am in a singing group, and I like to record our performances, both for practice and promotion. The internal mics on camcorders are limited in their frequency response, and they really aren't good enough to record music. This mic greatly improves the sound portion of the video when using with camcorders with external mic jacks (Canon}, and allows the device to record with quality audio. I'm sure there are better mics out there, but this one is priced right.",
      "rating": 5.0,
      "verified": true,
      "author": "Audio Nut",
      "helpful_votes": 0,
      "publication_date": 20170114
    },
    {
      "title": "I use it with an iPhone",
      "text": "I currently use it with an iPhone and Android Phone. The sound is great and the battery lasts forever. It gives you a 10db boost which is nice as well. If you want to use it with a phone you need a TRS to TRRS connector. Works like a charm and I currently use it to film my videos.",
      "rating": 5.0,
      "verified": true,
      "author": "Don in 5 Reviews",
      "helpful_votes": 0,
      "publication_date": 20190310
    },
    {
      "title": "Buy the Mic Cover!! It picks up every sound around you.",
      "text": "I really like this Mic for the price, but YOU MUST BUY THE MIC COVER. This mic picks up the smallest of noises or sound. I used it for Pride Week in Atlanta, and it worked well, but it picked up ambient sounds that needed to be edited out. If I would have had the cover it would have been perfect. I only give it 4 stars because for $10, just add it to the mic package. It set up easily and wire management was not an issue. I recommend this for anyone needing a great mic at a great price.",
      "rating": 4.0,
      "verified": true,
      "author": "George Gibbs",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Great mic! Mount troubles fixable.",
      "text": "This mic exceeds my expectations for the price I paid. The only issue I faced when initially installing it was that the camera mount wouldn't untwist to be able to mount it to my camera. I almost thought it was a manufacturing defect, however I realized the mount is in two pieces and can be loosened. I used the old rubber band trick around the round piece and plyers on the rectangular mount to get enough grip to unscrew the to from each other. I recommend getting a screwdriver and removing it from the microphone before trying to loosen as all the materials are very plastic-y.",
      "rating": 4.0,
      "verified": true,
      "author": "Tyler Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200120
    },
    {
      "title": "Really Good Mic",
      "text": "Really liking this microphone, often when you hear that \"for the price, it's really good\" then you instantly think that you're getting the most the price will allow. This microphone could easily sell for more as it's that good but since it's not a name brand, the price is lower. I don't think you can go wrong with this, especially if you're on a budget and need to record clear audio. I recommend this mic.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Korczak-Sielicki",
      "helpful_votes": 0,
      "publication_date": 20180316
    },
    {
      "title": "Copy of Rode Video Pro Vlogger shotgun mic",
      "text": "well worth the 18 bucks. if you want a mic as good as one thats 10 times the price but just as good, buy this. Rode mics are overpriced and poorly supported. and parts expensive. buy one. yoill appreciate it. this is a direct copy of the Rode video pro mic same features and imo a bit better freq response",
      "rating": 5.0,
      "verified": true,
      "author": "Christophers Wholesale",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Hissing on Canon DSLRs",
      "text": "As expected, the bad preamps on Canon DSLRs will cause a hissing noise in recording. Fortunately, I was able to reduce it by manually changing the sound settings on the camera. The +10dB gain really helps, and I was able to get out a decent amount of quality from this mic.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Haikal Ruslan",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "Don't spend More",
      "text": "You will get everything you want in an external mic with this truly affordable shotgun microphonbe. I mount it on my new Canon SL2, plug the oinput cabe directly into the camera mic receptor and get insane professional AV results as you will too. Definitely recommend for all YouTubers and video content creators that want quality at a really great price.",
      "rating": 5.0,
      "verified": true,
      "author": "JD UT",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "No better than stock",
      "text": "Looked good, worked no better than stock onboard mics. Ran test after test to see the improvement over onboard microphones in my Sony camcorder and Nikon DSLR, results on all settings - No improvement! Retured and purchase a better (but more expensive one)",
      "rating": 1.0,
      "verified": true,
      "author": "Ken Wilkinson",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Would buy again",
      "text": "I am really excited for this. Because it picks up the sounds in the mountains. As i film but would recommend for buyers that they need other cables to use in cannons newest version. So maybe explain that too for further buyers.thats the only down fall waiting on the other cable i had to purchase",
      "rating": 5.0,
      "verified": true,
      "author": "tom Blackwell ",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "Great Price! Good sound Quality!",
      "text": "The Takstar SGC-598 is definitely great for those on a budget. I needed a good mic that provided clear sound for my youtube channel \"Adventures with Fig\". This mic is directional, so, any sound behind it will not pick up clearly which is nice! I will advise to get a furry windscreen with this purchase as any breeze/wind will pick up super loud. Overall, I am satisified with this Mic. It does exactly what it is intended to do and is great for the price! (Espexially with Rode Mic at $150+). I highly recommend it! Sturdy build, attaches to DSLR, good settings, looks professional.",
      "rating": 5.0,
      "verified": true,
      "author": "Adrian Figueria",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Great alternative to more expensive brands with the same sound quality.",
      "text": "For the price, you cant beat this little mic. The majority of us aren't professional videographers/youtubers. We want decent sound to go along with our family memories. This mic clearly fits the bill. One thing to note, make sure the stinking thing is on before you shoot video. As for some reviews i read saying the sound wasn't super clear indoors, Acoustics reverberate of hard objects. Unless the mic is right on top of the user, it will pic up echoes bouncing off walls. Outdoors this mic shines. I could clearly hear my kids as opposed to the quite voice i got without it. WOULD RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda Tarin",
      "helpful_votes": 0,
      "publication_date": 20181202
    },
    {
      "title": "Solid mic for cost",
      "text": "I like this a lot for the price. It sounds quite clean and everyone said it was solid. They were right. I get a lot of noise until I speak and then it dials in. My sony a6400 seems to spike even on 0 of 10 volume so I'm not sure if that's the sony cam or the mic or the user. But this is a great mic. 1 AA battery lasts me hours.",
      "rating": 5.0,
      "verified": true,
      "author": "B_the_installer",
      "helpful_votes": 0,
      "publication_date": 20191020
    },
    {
      "title": "Good for its price point",
      "text": "For this price point i could not complain! This does good compared to the road mics. Noise cancellation could be alittle bit better is the only thing",
      "rating": 5.0,
      "verified": true,
      "author": "Dawson G.",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "Not worth the money",
      "text": "I purchased this for YouTube and the sound quality was horrible. It did not improve the standard microphone that was built into the video camera. I ended up returning the video camera and this microphone and totally upgraded my equipment to the Sony Handycam.",
      "rating": 1.0,
      "verified": true,
      "author": "Corey W.",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "Superb performance at an unbeatable price.",
      "text": "You will find endless YouTube reviews of this microphone, praising its capabilities. It works great and the sound is so much clearer. I bought it to improve the sound of my iPhone 7 Plus video recordings. I had a LOT of trouble getting it to work on it though. You WILL NEED the Rode SC4 adapter along with your Lightning to 3.5 adapter to get it to work with your iPhone 7 and newer.",
      "rating": 5.0,
      "verified": true,
      "author": "Joey Castellon",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Build it R/T approved",
      "text": "This is a nice little microphone, I use it for my youtube channel. It greatly improved the sound quality of my videos. I use it with my iPhone8 and I must say I was surprised by it, at first I thought was going to be a cheap piece and that I wasted my money but I found that it works really well.",
      "rating": 5.0,
      "verified": true,
      "author": "Build it RT ",
      "helpful_votes": 2,
      "publication_date": 20180123
    },
    {
      "title": "Got it today and the initial test was excellent. I was only a few feet away from ...",
      "text": "I don't often write reviews but this one...well worth the time. I was skeptical of the quality due to the low price but after reading several, sensible, positive reviews I figured I would give it a try. Got it today and the initial test was excellent. I was only a few feet away from the subject but the audio was crystal clear. I had my son, a professional musician, play the guitar and it captured the sound very well. I highly recommend this microphone.",
      "rating": 5.0,
      "verified": true,
      "author": "jmanning55",
      "helpful_votes": 2,
      "publication_date": 20151229
    },
    {
      "title": "Broke after less than a dozen uses",
      "text": "For the price, I was pleased with the sound, but after only using it a few times, it won't work. Tried on multiple cameras, so I know it's the microphone. First time attempting to do video's so didn't want to buy anything too expensive, but even this one should last longer than that. Bummer",
      "rating": 1.0,
      "verified": true,
      "author": "shanna schwartz",
      "helpful_votes": 0,
      "publication_date": 20200421
    }
  ],
  "product_meta": {
    "title": "TAKSTAR SGC-598 Interview Microphone for Nikon/Canon Camera/DV Camcorder",
    "description": "Features: 1.High Quality & Brand New 2.Practical Occasion: photography, interviews and other occasions pickup.3.Product Features: Specially designed for the camera and high-sensitivity condenser microphone to enhance the quality of the recording.4.Heart-shaped single-point pickup features can effectively reduce the noise of the surrounding environment to be picked up. 5.10dB sensitivity enhancement and 200Hz low-frequency attenuation; to meet the different field Co-use. Use standard universal connector specifications, can be simply fixed the camera. 6.Shock-resistant structural design, to reduce the mechanical noise of the camera and other vibration noise. 7.Set tone governing the selection of alloy materials design, sturdy solid, and can effectively shield electromagnetic interference. 8. 1.5V AA alkaline battery-powered, battery life of up to 100 hours.(No Battery Included) 9. Low power indicator, fully prepared ready to replace the battery. 10.Technical parameters: Monomer: Back electret. 11.Polar pattern: cardioid. 12. Frequency response: 50Hz-16kHz. 13.Sensitivity:-32dB À 3dB (0dB = 1V/Pa at 1kHz). enhanced sensitivity: +10 db. 14.The low-frequency attenuation: 60Hz 10dB / octave. output impedance: 2000 À 30%. 15. Use voltage: 1.5V AA batteries. (No Battery Included) Package Contents: 1* SGC-598 Microphone 1* Windscreen 1* English User's Manual",
    "rating": 4.2,
    "feature_bullets": [
      "10dB sensitivity enhancement and 200Hz low-frequency attenuation; to meet the different field Co-use. Use standard universal connector specifications, can be simply fixed the camera.",
      "Product Features: Specially designed for the camera and high-sensitivity condenser microphone to enhance the quality of the recording.",
      "Set tone governing the selection of alloy materials design, sturdy solid, and can effectively shield electromagnetic interference.",
      "Heart-shaped single-point pickup features can effectively reduce the noise of the surrounding environment to be picked up.",
      "Shock-resistant structural design, to reduce the mechanical noise of the camera and other vibration noise. Package Contents: 1* SGC-598 Microphone 1* Windscreen 1* English User's Manual"
    ],
    "specifications": {
      "Product Dimensions": "11.3 x 7.7 x 2.7 inches",
      "Item Weight": "12 ounces",
      "ASIN": "B00E58AA0I",
      "Item model number": "SGC-598",
      "Batteries": "1 AA batteries required.",
      "Customer Reviews": "4.2 out of 5 stars2,872 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#4 in Professional Video Microphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 14, 2012",
      "Manufacturer": "TAKSTAR"
    },
    "categories": [
      "Professional Video Accessories",
      "Accessories",
      "Microphones",
      "Electronics",
      "Camera & Photo"
    ],
    "price": 30.0
  }
}