{
  "website_summaries": [
    {
      "verdict": "You'll love the versatility this compact steam cleaner offers, which makes it worth the hassle of frequently putting your chores on hold to fill up the tank.",
      "pros": [
        "Capable hand-held model can be used for numerous cleaning purposes",
        "Lightweight and compact, so it's highly portable",
        "Comes with a collection of attachments for accomplishing different tasks"
      ],
      "cons": [
        "Water tank runs out fairly quickly, requiring frequent refills",
        "Some defective models that didn't produce adequate steam reported"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "High pressure that works great!",
      "text": "I originally bought this product to help sanitize for bed bugs but I'm discovering so many more uses for it after using it today. There are so many things you can use this for with regards to cleaning. Once i'm done sanitizing for bedbugs I plan to clean my bathroom and kitchen with this. I also love the fact that it's handheld and compact. Highly Recommend this product for sanitizing and treating for bedbugs.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20181210
    },
    {
      "title": "Brushes melted on first use and weird white powder flaking form the inside",
      "text": "I returned the first one I got as it had obviously been second hand. Now on the second one and the brushes melted already. After I drained it when I finished this white powder started flaking out of it.",
      "rating": 1.0,
      "verified": true,
      "author": "Timothy M. Crawford",
      "helpful_votes": 10,
      "publication_date": 20190305
    },
    {
      "title": "Worked twice but no more",
      "text": "Used this machine twice and packed away in bag. Took out yesterday and does not work at all. There is water in reservoir but does not steam. Followed directions, only used distilled water and have no idea why quit working. Really liked it the two times it did work. Have no idea how to contact seller but will try to complain directly.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 4,
      "publication_date": 20200503
    },
    {
      "title": "Freaking phenomenal!!",
      "text": "This is the most wonderful little steamer!!! My 2 year old loves blueberries and pasta sauce but she makes a mess My boyfriend bought this for other reasons but we used it on her stains that were months old In less than a minute per spot the stains disappeared!!!!! We should have bought a bigger one no chemicals just steam so I don't have to worry about my little one!",
      "rating": 5.0,
      "verified": true,
      "author": "Zinnia E. Satour-chraa",
      "helpful_votes": 2,
      "publication_date": 20170214
    },
    {
      "title": "Total Garbage!",
      "text": "Doesn't clean a thing, and I am out of pocket $15.70 to return that piece of crap!!! BUYER BEWARE [BIG TIME}!!!",
      "rating": 1.0,
      "verified": true,
      "author": "John Fulton, Jr",
      "helpful_votes": 2,
      "publication_date": 20200705
    },
    {
      "title": "The high pressure steam release, is the best! I've seen.",
      "text": "I absolutely love how easy this is to use, wait time to refill 15min. is a bit of a bummer and the cord is way too short. Attaching a good extension cord was a easy fix tho. One thing worth mentioning is, it's warranty, it's the best out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "The good thing is that the steamer overshadows the attachments because ...",
      "text": "Solid product that is very well built! The attachments are cheap though. The good thing is that the steamer overshadows the attachments because it's awesome to use on all kinds of different things. I mainly use it for detailing my Jeep. Money well spent! Don't buy the cheap knockoffs. Get this one!",
      "rating": 4.0,
      "verified": true,
      "author": "scott",
      "helpful_votes": 5,
      "publication_date": 20170407
    },
    {
      "title": "Great Little Worker",
      "text": "I use this on the most disgusting grease in my restaurant every day and use it annually to go deep into the detail cleaning of all appliances and the floor. It has no issues and does the job it's designed to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheryl A. Kondratow",
      "helpful_votes": 15,
      "publication_date": 20150216
    },
    {
      "title": "Great!",
      "text": "Bought this to replace my Shark steamer that I loved. Attachments are great and it really cleans. Compact but really puts out some serious cleaning steam. Have used it about a month and I really like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathleen Ryan",
      "helpful_votes": 9,
      "publication_date": 20150123
    },
    {
      "title": "It is very easy to use.",
      "text": "I bought this product to steam clean the bathroom, spots on my rugs. Great for everyday use.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie ",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Bought for Mites",
      "text": "Hello, We had a mite invasion, and we decided to buy this steamer for a non-chemical way of treating our beds and pillows. The water capacity is too small, and the red light turns on too frequently for an efficient cleaning session. I would look around for other options. I've seen a video of the actual stem temperature is not as stated!",
      "rating": 2.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Good for light duty cleaning.",
      "text": "Does the job - small tank is kind of a drag. But for light duty cleaning - it's a good bet at a fair price. Is made very well - good construction.",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Harp",
      "helpful_votes": 4,
      "publication_date": 20150811
    },
    {
      "title": "Works well and easy to use",
      "text": "Works well and easy to use. You have to use distilled water with this unit which is sometime a hassle",
      "rating": 4.0,
      "verified": true,
      "author": "Tariq S",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Good product 😀",
      "text": "It works great for the price clean pretty well but it a short time for steaming you have to constantly refill that's only downfall about this product other than that its great i approve this product",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great product.",
      "text": "It did a very good job on my shower door for lime deposits, better than the other steam machine that I had. Also did spot removals on carpet and window shades.",
      "rating": 5.0,
      "verified": true,
      "author": "Gamer",
      "helpful_votes": 4,
      "publication_date": 20140604
    },
    {
      "title": "Too small for the job I need it to do",
      "text": "Small water tank, annoying to constantly fill up tank. Needs a longer cord.",
      "rating": 3.0,
      "verified": true,
      "author": "nick ",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "It works",
      "text": "It would be wise to purchase xtra attachments incase of damage or missing peices..",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "This lil steamer is a Beast",
      "text": "I was iffy with purchasing a steam cleaner off amazon.i looked at all the commercial grade and name brand websites and I didn't want to pay the price. I'm real big on the saying you get what you pay for. The main selling point for this one with me was the lifetime warranty any company that offers that has a well built product.i couldn't be more pleased with this cleaner. For the small size it handles the big jobs you just have to pace yourself.and with the price you don't feel bad buying a more expensive one down the road.THe next one I buy will defenitly be by the same company",
      "rating": 5.0,
      "verified": true,
      "author": "Alucanna",
      "helpful_votes": 3,
      "publication_date": 20140411
    },
    {
      "title": "Good machine.",
      "text": "it works great. I just would prefer the tank be larger to decrease the frequency of refilling with the distilled water.",
      "rating": 4.0,
      "verified": true,
      "author": "Denita Strube",
      "helpful_votes": 0,
      "publication_date": 20200611
    },
    {
      "title": "instructions straight forward and unit easy to use",
      "text": "Product arrived on time, instructions straight forward and unit easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra E Boyer",
      "helpful_votes": 2,
      "publication_date": 20170111
    },
    {
      "title": "75 hand held steamer works great iam satisfied",
      "text": "The vapor mr.75 hand held steamer works great iam satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Marvin fludd",
      "helpful_votes": 4,
      "publication_date": 20150824
    },
    {
      "title": "Great Steamer.",
      "text": "Love it. Just wish the reservoir held more water. It does a great job.",
      "rating": 4.0,
      "verified": true,
      "author": "bguag",
      "helpful_votes": 4,
      "publication_date": 20140821
    },
    {
      "title": "Does what it says",
      "text": "The lifetime warranty is great and the steam cleaner does everything.It's affordable and came with everything it said it would. I personally recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "JP",
      "helpful_votes": 3,
      "publication_date": 20140528
    },
    {
      "title": "I love my new steam cleaner!",
      "text": "For my first vapor cleaner, I like what I got. We bought a used camper, that was in good condition, but was musty and had not been used in over a year. Mice had resided in it over the winter, so I was especially happy to be able to steam every nook and cranny. This size steamer was easy to maneuver in a small camper. I also like to use it in the kitchen for grease build up. I was not disappointed with the Vapamore MR-75. I let the steam do the cleaning and then would wipe with a rag. So far the tools are holding up. I hope to be able to buy a larger one in the future.",
      "rating": 4.0,
      "verified": true,
      "author": "V M",
      "helpful_votes": 5,
      "publication_date": 20140429
    },
    {
      "title": "Five Stars",
      "text": "works perfect for small jobs since the water reservoir is small",
      "rating": 5.0,
      "verified": true,
      "author": "rod",
      "helpful_votes": 0,
      "publication_date": 20160930
    },
    {
      "title": "Great little machine.",
      "text": "Worked very well all over the house, especially in my kitchen and bathroom! Would recommend it to friends and family.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 2,
      "publication_date": 20140522
    },
    {
      "title": "Powerful steam.",
      "text": "Finally found what I was looking for. Was looking for a powerful handheld steamer and this is it. Other brands either leaked or failed to deliver. Satisfied customer.",
      "rating": 5.0,
      "verified": true,
      "author": "ChiBuyer",
      "helpful_votes": 5,
      "publication_date": 20140719
    },
    {
      "title": "Four Stars",
      "text": "Works well but it isn't as powerful as I was expecting given then other reviews.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Lackey",
      "helpful_votes": 7,
      "publication_date": 20140925
    },
    {
      "title": "Not bad at all!!",
      "text": "I looked around for one of these portable steamers and this caught my eye because of the lifetime warranty. Having this kind of warranty only means the company stands behind the product. My first project was the kitchen , stove , fridge etc....and I think this steamer performed very well. The. I did the grout in the bath tub and it worked awesome . I really like it and recommend it. Short bursts allow for longer steam times and pressure",
      "rating": 5.0,
      "verified": true,
      "author": "BigTex",
      "helpful_votes": 7,
      "publication_date": 20150403
    },
    {
      "title": "Simply the best",
      "text": "This steamer has made my cleaning so much better and easier! Cleaned my oven, which I had never cleaned, in 13 years, yikes! I am a cleaning pro now-there is literally nothing this won't clean. Good hot steam and tools are Pretty good. I was skeptical but this little handheld steamer is the bomb!",
      "rating": 5.0,
      "verified": true,
      "author": "Jodie Reed",
      "helpful_votes": 6,
      "publication_date": 20140622
    },
    {
      "title": "Works very well",
      "text": "Sanitizes, cleans, sparkles! Takes little effort on my part and very little time! I am glad I purchased this item.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 3,
      "publication_date": 20140226
    },
    {
      "title": "Works well, but accessories could be improved...",
      "text": "It is very powerful and comes with a lifetime warranty; but the accessories seem to be made of cheap plastic (you can go to the manufacturer's website and replace them). Still, I was able to quickly remove some very old grime in the bathroom that I was not able to remove with harsh chemicals in the past, so it works better (and it is safer for humans) than other methods.",
      "rating": 5.0,
      "verified": true,
      "author": "HP",
      "helpful_votes": 5,
      "publication_date": 20140405
    },
    {
      "title": "Cleans out wallet effectively.",
      "text": "Attractive, well built, nicely designed unit. Lots of attachments. The blurbs said it can be used to clean grills, fabrics, car interiors etc. I tried it on my grill with little to no effect. Tried it on my car seat and arm rests with little to no results.It did get the wrinkles out of a shirt. I’ve owned other steamers and I believe the problem is that the steam is simply not hot enough for whatever reasons. I really wanted this to work for me. I’ll keep trying.",
      "rating": 2.0,
      "verified": true,
      "author": "mencken",
      "helpful_votes": 4,
      "publication_date": 20171010
    },
    {
      "title": "Not a lot of pressure but good steam.",
      "text": "Not a powerful jet but it gets hot and has enough steam to wash things. I was hoping for a mini pressure washer but it gets the grime off. I use it on the tracks of the windows. The steam turns into water and washes out the crud. Also useful for steaming spots off the carpet.",
      "rating": 4.0,
      "verified": true,
      "author": "Wooly Bully",
      "helpful_votes": 5,
      "publication_date": 20150503
    },
    {
      "title": "Loving the steamer!",
      "text": "For the price, this is a real workhorse. I wish it held more water, but since the next size up is almost $200, I will stick with this one. It is easy to use and comes with a bunch of handy attachments. I thought the grout in my kitchen was light brown, but now I know it is supposed to be bone colored. This little machine is terrific for cleaning stoves too...burned on food from the previous owner wouldn't come off with anything prior to me trying this steamer. It is a keeper!",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Li Lammert",
      "helpful_votes": 10,
      "publication_date": 20140413
    },
    {
      "title": "Five Stars",
      "text": "Product works as advertised. Use it to clean and disinfect bathroom and kitchen",
      "rating": 5.0,
      "verified": true,
      "author": "L. M. TODD",
      "helpful_votes": 4,
      "publication_date": 20140708
    },
    {
      "title": "... recently purchased my new steam cleaner and couldn't be happier! It's small and easy to hold and operate",
      "text": "i recently purchased my new steam cleaner and couldn't be happier! It's small and easy to hold and operate. It worked wonderful on my furniture and was easy to get into all of the unseen areas as well. I recommend this product to everyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Paula B. Langworthy",
      "helpful_votes": 5,
      "publication_date": 20140929
    },
    {
      "title": "I would not recommend it for removing tough stains in carpet or even ...",
      "text": "Not impressed. Definitely did not live up to my expectations that I got from reading the rave reviews. I would not recommend it for removing tough stains in carpet or even soap stains in the shower.",
      "rating": 3.0,
      "verified": true,
      "author": "Cornbelly",
      "helpful_votes": 3,
      "publication_date": 20160125
    },
    {
      "title": "Emits Steam Intermittently",
      "text": "Steam is not emitted continuously. After several minutes of operations, no steam is released, making it appear that the water tank is empty. Upon cooling, the tank was still half full. Returned for credit.",
      "rating": 2.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 0,
      "publication_date": 20140515
    },
    {
      "title": "One of the handle pieces falls off constantly. It ...",
      "text": "One of the handle pieces falls off constantly. It is badly constructed. The one cup capacity means you are refilling every 10 minutes.",
      "rating": 1.0,
      "verified": true,
      "author": "despina sophia stamos",
      "helpful_votes": 7,
      "publication_date": 20140806
    },
    {
      "title": "doesn't clean, but steams out wrinkles well",
      "text": "great for steaming clothes, very fast. But i wanted something that also cleans...it is described as a cleaner, after all. i was especially interested in it for cleaning shower tile, but it does not work for cleaning anything.",
      "rating": 3.0,
      "verified": true,
      "author": "nvnyc",
      "helpful_votes": 0,
      "publication_date": 20150707
    },
    {
      "title": "So far so good!",
      "text": "I bought this as a Christmas present for my Mom. She is a clean freak and figured she would enjoy using this since it gets in hard to reach surfaces. She enjoys using it, usually once a week during her Sunday cleaning sessions. I have also used this and enjoy it. It holds a good amount of water and has lots of power. I like all the different attatchments and that is comes with a bag to hold the steamer and accessories in. It's worth the money for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Tiffany",
      "helpful_votes": 8,
      "publication_date": 20140203
    },
    {
      "title": "I like it but i dont like it",
      "text": "I bought this to clean my bathrooms. I like it but i dont like it. The con is you have to hold it down in order to release the steam. For instance if i need to support myself with the other hand i can't use it because i will be holding the release lever down.",
      "rating": 1.0,
      "verified": true,
      "author": "Mandeepak S.",
      "helpful_votes": 3,
      "publication_date": 20150430
    },
    {
      "title": "Don't waste your time!",
      "text": "Awful! No power. Tiny tank, needs refil every 10mins. Drips Too much time to heat up. I returned it the same day! Don't bother, it's Junk!",
      "rating": 1.0,
      "verified": true,
      "author": "AJstar",
      "helpful_votes": 6,
      "publication_date": 20141201
    },
    {
      "title": "works well when there is water in it. trouble is the water storage unit does not allow for lenghty cleaning time til a fill up",
      "text": "will continue to use. just don't expect the steam to last long enough to do the entire interior of a auto.",
      "rating": 3.0,
      "verified": true,
      "author": "Rhonda Doby",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Two Stars",
      "text": "Doesn't have enough power. Could not event take the wrinkles out of my curtains.",
      "rating": 2.0,
      "verified": true,
      "author": "Mrs. W.",
      "helpful_votes": 0,
      "publication_date": 20150603
    },
    {
      "title": "Grease didnot go away",
      "text": "I purchased this product to clean my kitchen microwave and surrending area which absorbed a lots of grease. I thought steamer will clean these grease, sticky surface around the area but it didnot take away from the steamer. My expectation didnot meet. May be I need to used more often.",
      "rating": 2.0,
      "verified": true,
      "author": "Rajani",
      "helpful_votes": 0,
      "publication_date": 20140504
    },
    {
      "title": "Works great!",
      "text": "I purchased this steamer because of COVID-19 and the fact that I can't find disinfectants at the store. (No Clorox -- No Lysol anywhere locally.) Anyway -- I use this to disinfect doorknobs and surfaces. I used only DISTILLED WATER -- which, thank goodness -- is still available in my local stores. Planning to use it to clean my oven. Maybe I'll update this once I do that. Stay safe everybody. Don't be \"that guy.\" Wear a mask!",
      "rating": 5.0,
      "verified": true,
      "author": "storycoder",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "not what i expected",
      "text": "$99.00, after about 15 seconds, it needs to reheat, it will NOT go continuously for even 30 seconds. what a disappointment. I also bought a STEAMFAST for $35 and it did 10X better than this $99 piece of junk. you cannot steam anything effectively if you have to let heat up every 20 seconds.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20160303
    },
    {
      "title": "It does what it says it should",
      "text": "attachments are of a lower quality plastic, hope it can withstand the heat. I have a lady Bug 2200ST cleaner so this is not a replacement, rather if I travel, I will bring this along. I used to employ glass cleaning to clean the windows of my car, I used this for the first time, the amount of microscopic dirt its gleams from the windows far surpasses that of glass cleaners.",
      "rating": 4.0,
      "verified": true,
      "author": "Bond 007",
      "helpful_votes": 3,
      "publication_date": 20150613
    },
    {
      "title": "Had to send back",
      "text": "Closure leaked, steam lasted approximately 10 seconds until I had to let it heat up again which took approximately 30 seconds.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie V",
      "helpful_votes": 0,
      "publication_date": 20200721
    },
    {
      "title": "It works for lots of things",
      "text": "i really like this steamer. works well! It has a little tank but its no big deal to me. i used it to take care of bed bugs. I also used it for de wrinkling my sons shirt and pants for a dance. love it for cleaning too!",
      "rating": 5.0,
      "verified": true,
      "author": "RANDI RAQUEL",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Cleaning frenzy",
      "text": "I am cleaning everything. I started with my range hood and couldn’t stop! The best thing I like is how it melts grease and baked on foods. The only downside is that the hose doesn’t rotate around so it twists a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan R. Claussen",
      "helpful_votes": 0,
      "publication_date": 20171126
    },
    {
      "title": "Five Stars",
      "text": "Worked super for getting rid of my bug problem, also, I have used it to steam clothes!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Addison",
      "helpful_votes": 3,
      "publication_date": 20170720
    },
    {
      "title": "Small jobs only.",
      "text": "Does what it's supposed to do, but wish I didn't have to pause so often for it to re-heat. Recommend for small jobs only.",
      "rating": 4.0,
      "verified": true,
      "author": "Colitis Ninja",
      "helpful_votes": 3,
      "publication_date": 20150826
    },
    {
      "title": "From unboxing to using it is a real pleasure",
      "text": "I'm a long-time fan of exotic italian cars and this is one of those rare products that invokes those senses - case in point, the brass screw in cap. This unit performs fine, just be patient! You can't just point and shoot, let it rest and heat the area then move on. Love all the accessories and the bag, but would be extra nice if there was a storage container for them. And some more info on using those accessories. I've gone to the company's site which has some helpful intro videos but I'd like more. Normally I'd knock out a star for those shortcomings, but I like the style and purpose and price enough to leave the 5* rating.",
      "rating": 5.0,
      "verified": true,
      "author": "David Fox",
      "helpful_votes": 6,
      "publication_date": 20140609
    },
    {
      "title": "I really like this steam cleaner",
      "text": "I really like this steam cleaner, but it does leave more water to clean up than I thought it would, which is ok. Also, I really wish it could hold more water than it does. You have to wait for it to cool down before you can open the tank & refill with water.",
      "rating": 4.0,
      "verified": true,
      "author": "Kelly Jones",
      "helpful_votes": 3,
      "publication_date": 20150706
    },
    {
      "title": "Four Stars",
      "text": "nice product, does a good job, would like more power but is well made and the case is helpful",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Welsh Jr",
      "helpful_votes": 5,
      "publication_date": 20140905
    },
    {
      "title": "Great steamer",
      "text": "I love this steamer. It really don't hold a lot of water, but it is easy to use, and easy to fill.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary Ann Eaglin",
      "helpful_votes": 0,
      "publication_date": 20160423
    },
    {
      "title": "needs a little more ump.",
      "text": "i think the product is great although it did not meet my expectations. a lot of hype on the reviews. the attachments were smaller than i had hoped for it does what it claims but the user being a dude, it needs just a little more ump!",
      "rating": 4.0,
      "verified": true,
      "author": "ella n baney",
      "helpful_votes": 3,
      "publication_date": 20140509
    },
    {
      "title": "Cool down slows the process.",
      "text": "Could be better to keep temperature in custom level with temperature control.",
      "rating": 3.0,
      "verified": true,
      "author": "George V",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Worth every penny",
      "text": "This is worth every penny and I'd buy it again!",
      "rating": 5.0,
      "verified": true,
      "author": "FORSAN",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "Great product!",
      "text": "Easy to use and works great! Used it on my black grout that is a cream color when clean. Dirt came out of the grout somewhat easily. Used it to steam clean my toilets as well. Still need to try other uses in the future. Doesn't work that great on tough calcium deposits. Seemed to have very little effect on that. Great product!",
      "rating": 5.0,
      "verified": true,
      "author": "JB2011",
      "helpful_votes": 14,
      "publication_date": 20131212
    },
    {
      "title": "Might be good for jewelry or something small",
      "text": "What a joke ! Starts out with a lot of steam & power but runs out in seconds . Might be good for jewelry or something small . Was going to clean my stove top but it would take hours . They need to put more time & money in to the quality of the steamer and not all the accessories & pretty box .",
      "rating": 1.0,
      "verified": true,
      "author": "jon s.",
      "helpful_votes": 2,
      "publication_date": 20160417
    },
    {
      "title": "Cleaning just got easier with steam",
      "text": "I have never had a steam cleaner before, mainly due to cost and bad reviews about cheap ones bought by friends. So far this has exceeded my expectations. It came with a nice carrying case, a bunch of attachments, good instructions-even a video on line (great for visual learners like me)/ It makes a good amount of steam and cleaned my bathroom ( around the tub, toilet, and sink drains) with first fill. I found it hard to use with the hose at first, but that will get easier. Very pleased so far.",
      "rating": 4.0,
      "verified": true,
      "author": "Linda Adams",
      "helpful_votes": 5,
      "publication_date": 20140803
    },
    {
      "title": "Great product",
      "text": "Great working product, cleans windows, grout etc with ease. Only trade off with a portable unit is the water tank capacity. Also used distilled water, same as steam iron.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lester",
      "helpful_votes": 2,
      "publication_date": 20140429
    },
    {
      "title": "I've only used it once, but it worked very ...",
      "text": "I've only used it once, but it worked very well. I steam cleaned my bathroom floor tiles, the stainless stove and sink and it worked well.",
      "rating": 4.0,
      "verified": true,
      "author": "dcpj",
      "helpful_votes": 2,
      "publication_date": 20141115
    },
    {
      "title": "Not so much a steam cleaner as just a steamer with a scrubbrush.",
      "text": "Gets steam going, but as such low pressures that it doesn't really blast crud off like you'd expect. Still, it was OK for a few basic household tasks, removing clothing wrinkles, that kind of thing. It's better used as a prep tool immediately before you vacuum clean something.",
      "rating": 3.0,
      "verified": true,
      "author": "Julia and Erik",
      "helpful_votes": 0,
      "publication_date": 20140913
    },
    {
      "title": "Should it stay or should it go now",
      "text": "Not sure if it's working correctly....It heats up,ready light turns green, push trigger, steam comes out for 10 seconds and light goes red to heat up again.....you don't have to wait for it to reheat- it says once first green you can keep going. But it only sputters out steam if you do...otherwise it's made very well. just wish it worked very well...",
      "rating": 3.0,
      "verified": true,
      "author": "Mr Z",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "You get what you pay for..",
      "text": "If your looking for a steamer that will just steam, don't get this one. It's more of a hot water sprayer. May not be fair to compare it to the $700 steamer I also have but for what I use this one for it does the job. Doesn't take long for it to run out of water but it does heat up fast each time to add water.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151222
    },
    {
      "title": "Two Stars",
      "text": "Cheaply made - many of my pieces are broke with little use",
      "rating": 2.0,
      "verified": true,
      "author": "ALLEN",
      "helpful_votes": 2,
      "publication_date": 20141211
    }
  ],
  "product_meta": {
    "title": "Vapamore MR-75 Amico Hand Held Steam Cleaner",
    "description": "The MR-75 Amico Hand Held Steamer, In Italian, Amico means “little friend”. Now you can take them, and the love of steam, wherever you go with the Vapamore MR-75 Amico. This clever hand held steam cleaner is designed to move with you as you clean and sanitize your entire home or office using Vapamore’s 100% chemical-free cleaning system. The brilliantly engineered portable steam cleaner includes the largest array of accessories and attachments on the market, more than any other hand held steam cleaner available. Versatility and power are realized in a machine that was specifically created for high performance cleaning on the move. Built for a lifetime of use, the MR-75 Amico is backed by superior customer service and the exclusive Vapamore Lifetime Warranty. Includes: Steam Hose & Connector, Accessory Tool Adapter, Jet Nozzle, Detail Scraper, Nylon Brush Straight, Nylon Grout Brush, Nylon Medium Duty Brush, Large Nylon Brush, Small Brass Brush, Large Brass Brush, Large Stainless Steel Brush, Fabric Steamer & Squeegee, Cotton Cover x 3, Measuring Cup, Carrying Case, Accessory Storage Bag. Technical: Model: MR-75 Amico, Power: 115 V 60 Hz, Heating Element: 1000 W, Steam Pressure: 43.5 psi, Boiler Temp: 210° F, Tank Capacity: 6.7 fl oz, Heating Time: 4 min, Power Cord Length: 10 feet, Steam Hose Length 3 feet, Weight: 3.5 lbs, ETL Certified 110-120v 60Hz North America Only.",
    "rating": 4,
    "feature_bullets": [
      "Removes Dirt, Grease, Girime and Stains",
      "Cleans& Sanitizes Chemical Free",
      "Hand Held Portable Staem Cleaner",
      "Kill Bed Bugs, Germs, Dust Mites, Allergens",
      "Lifetime Warranty",
      "110-120v 60Hz North America Only"
    ],
    "specifications": {
      "Product Dimensions": "8 x 13 x 8 inches",
      "Item Weight": "5.9 pounds",
      "Department": "Stain & Odor",
      "Manufacturer": "Vapamore",
      "ASIN": "B00EMHOIFK",
      "Item model number": "MR-75",
      "Customer Reviews": "4.0 out of 5 stars184 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#171,383 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Is Assembly Required?": "No",
      "Warranty Description": "Lifetime limited warranty.",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Vacuums",
      "Vacuums & Floor Care",
      "Stick Vacuums & Electric Brooms"
    ],
    "price": 99.0
  }
}