{
  "website_summaries": [
    {
      "verdict": "HD clear protector offers maximum clarity.",
      "pros": [
        "Provides a high level of protection against scratches",
        "99.99% touch accuracy covering",
        "Great fit for your tablet",
        "Convenient two-pack"
      ],
      "cons": [
        "Users reported difficulty with install"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Couldn't remove the bubbles",
      "text": "I wanted to like this product and purchased it after reading all the glowing reviews. I followed instructions exactly as described (and I have done this before having 4 iPads and 2 IPhones) but was unable to smooth out the bubbles. I took the first screen protector out thinking it was defective and tried the second time following the instructions exactly but the bubbles remained and I mean a lot not just a few (picture attached). Now I have to purchase another screen protector. I am not happy at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Miks1975",
      "helpful_votes": 7,
      "publication_date": 20161231
    },
    {
      "title": "an OK screen protector. Not great. Not bad.",
      "text": "I don't recommend plastic screen protectors for tablets because, in general, tablets are more protected than phones due to having a closing case with edge protection. If you don't have one of these cases for your tablet, I suggest getting it. While plastic will offer more protection against impact, your tablet likely isn't going to take impacts like your phone would. Plastic also smudges a lot more than glass, and it doesn't feel as nice. It also displays a yellow tint which over time will get worse. It's not a bad screen protector, but it just feels cheap. Get a glass one instead. For phones, plastic is OK.",
      "rating": 3.0,
      "verified": true,
      "author": "Carfo",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "Not recommended, cheaply made & problematic.",
      "text": "I've installed many screen protectors to iPads and have never had a problem until now. I hadn't tried this brand but the price was good. As always, I followed the instructions to a T. after using the squeegee I noticed it'd left scratches -all over the screen protector!- I'd noticed this protector was thinner than others I've used. Maybe that's why? Anyway, returning & getting something that's not so cheap & faulty. Edit to add: Now I have to take this screen protector off my iPad, return it and order another & wait for it to be delivered. Time waisted & iPad going unprotected for several days.",
      "rating": 1.0,
      "verified": true,
      "author": "KHenn",
      "helpful_votes": 4,
      "publication_date": 20161114
    },
    {
      "title": "Absolute Crap",
      "text": "Have used lots of these but a couple of brands are absolutely crap this is one of the crap items! Don't buy it. It has come out of the factory with NO quality CONTROL AT ALL. You can see lint dust flecks and marks all over it. I have worked in \"true sterile\" environments so I understand what that means. I could not get it on at all even after using multiple alcohol swabs to thoroughly ensure the screen was spotless. Some brands are good. THIS IS NOT ONE of them. You may be lucky and get one that is clean mine were not. IF I could find where to get a refund I would!",
      "rating": 1.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Screen protector",
      "text": "The Tech Armor Screen Protector cam in a 2 pack. That was good since I messed up on the first try. The instructions don't exactly help get the screen protector perfectly aligned. My first try had it perfect at the bottom but by the time I got it to the top, pressing out all of the bubbles, it was slightly misaligned. That didn't seem to be the case when I was starting it at the bottom. I was successful on the second try. The Tech Armor does a good job keeping down the glare and I trust, not letting the screen get scratched.",
      "rating": 4.0,
      "verified": true,
      "author": "Texas guy",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Decent but",
      "text": "Had to try over and over to get this to fit correctly over the camera hole AND home button. I like That it has two screens protecting the actual screen as you install it but then the screen you are left with collects everything off your skin. I feel like I have to clean it constantly to not have smudge marks visible on the screen. I play games and do work on my iPad and the fingerprints left over is way too much. Wish I could remember the maker of my last screen because it didn’t leave marks this badly.",
      "rating": 3.0,
      "verified": true,
      "author": "Jaimelynn",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Clear and almost invisible and fits quite well with case",
      "text": "5 stars all around. I placed it carefully, and bubble free. Mine included a few stickies to remove a few pieces of lint that got in and I successfully removed them. The whole process took me a good 20-25 mins because I wanted it done right and with out any issues. I picked this over a tempered glass because I'm picky when I'm pressing the home button, i don't like it to be raised even more. With this, it's barely noticible, unless you're looking for it, you'll see it. The case that I have does not interfere with it and that's always a plus! For the price, it's worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cip",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Bubbles everywhere",
      "text": "I've installed quite a few of these so I'm not new to this. I ended up with plenty of bubbles for something that specifically advertises \"no bubbles\". I managed to get most of them out but there are still 3-5 little bubbles in spots that I can't get out. Those in the market for screen protectors should consider tempered glass instead, although they end up cracking fairly easily, they do go on with 0 bubbles and are easier to install.",
      "rating": 2.0,
      "verified": true,
      "author": "CDS",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "Terrible product",
      "text": "Maybe others were lucky or dexterous than I was. But for me, this was the worst protective film experience ever. Film itself is too easy to get static and collect dust in a matter of millisecond even in the bathroom. Bubble-removing squeegee also does not work at all. I mean not at all. Dust removal tape also doesn't work at all. Totally waist of time and money. Note: After hours of efforts in squeezing bubbles, I was able to remove most of the bubbles somehow -- so at least squeegee works if you invest quite amount of time. But I could not remove some of them with dust under the film.",
      "rating": 1.0,
      "verified": true,
      "author": "A.Y.",
      "helpful_votes": 2,
      "publication_date": 20170121
    },
    {
      "title": "These are great!",
      "text": "These work so much better than the last brand I tried. As far as smudging...well, when you are using your iPad to follow a recipe it can get pretty messy but it cleans up really easy with an eye glass cloth. They were also somewhat easier to apply to the screen. Less air bubbles than the last brand I had too. I definitely will continue with this brand!",
      "rating": 5.0,
      "verified": true,
      "author": "LSVG",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "Second attempt was successful",
      "text": "The second try was successful, after I failed with the first one. The issue was that I could not eliminate the air bubbles next to the corners of the Ipad. Then I partly removed the sheet -just a tad- and from there the project quickly deteriorated into a failure. Don't do that! For the second attempt I used an Air Duster that helped to remove small dust particles and I finished placing the protective layer in 2 minutes. Also, closing the windows in the room helped, as well. P.S. Somehow the cleaning wipe was not included in the box.",
      "rating": 4.0,
      "verified": true,
      "author": "Joseph Kobli",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "Just my package or wet wipes are actually not enclosed",
      "text": "A wet cleaning wipe which was indicated in the installation manual as the first thing we would use to prep the glass surface is missing in my package. So I cleaned the glass surface of my iPad as much as possible by using the enclosed dry cleaning cloth as well as some dust removal stickers provided. There are still some dust particles stuck under the film. It was very hard to remove them from the film on the glass facing side once the film laid flat on the glass. The film reflects light so buyers should not expect that it is anti-glare.",
      "rating": 3.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20190520
    },
    {
      "title": "Great screen protector",
      "text": "So far so good. I have only used one of the two screen protectors provided and it has only been about a month but it works great. I have no bubbles and it does not impede the touch screen from working. It is smooth when using your finger to write or a stylus. It is crystal clear like it isn't even there. However, it is a pain to install but a little patience goes a long way. That being said, I haven't gotten a screen protector yet that is frustration free during the installation process. I would definitely buy from Tech Armor again!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 0,
      "publication_date": 20170326
    },
    {
      "title": "This was a real waste of",
      "text": "Make sure you buy the \"Ballistic Glass\" version of this product. I mistakenly bought the \"HD Crystal Clear\" version and found it virtually impossible to work with on an iPad, perhaps something as flimsy as this could work on the smaller surface of a phone but a standard sized iPad really requires something more rigged in order to place the protector on neatly and with no bubbles. This was a real waste of $10",
      "rating": 1.0,
      "verified": true,
      "author": "Karen Weeks",
      "helpful_votes": 2,
      "publication_date": 20170523
    },
    {
      "title": "Good quality screen protector",
      "text": "Good quality screen protector. But please make the front camera hole a bit larger. It is very hard to align it perfectly. The manual shows to apply it from the home button, toward the camera hole. So a tiny bit off center, you will end up with the film cover or half cover the camera hole, which is tiny too! I have to cut off a bit of film around the camera hole. It will be simply solved by leaving a 3 or 4 mm holes on the camera place. Why make it as tight as possible? That is just poor design.",
      "rating": 3.0,
      "verified": true,
      "author": "Long Yang",
      "helpful_votes": 0,
      "publication_date": 20170325
    },
    {
      "title": "Decent screen protector, nice application, NOT tempered glass (even though it shows up in the search results)",
      "text": "We just upgraded one of the iPads in our house to the iPad 2. I was searching for a tempered glass screen protector and this came up in the results. I read the reviews, ordered and stashed it away for a gift. Well, we just opened the package last night and realized it's NOT tempered glass. This is totally my own fault, so I didn't dock stars like an idiot. But, I wanted to warn people that this is NOT a tempered glass screen protector, even though it will pop up in your search results. It applied quite nicely, so we don't have any complaints there.",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole D.Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Did work for me",
      "text": "The item came a day late. The instructions call to clean the screen with provided wipe. But, the wipe is nowhere to be found and, based on the package, not supposed to be there. Used the liquid for my glasses to clean the screen. So far looks good, but the test will be in few days when I try it on the beach. Gave all 5 stars for now. The update - I put it on my wife's iPad. Could not see anything on the beach, not only in the sun, but in the shade, too.",
      "rating": 1.0,
      "verified": true,
      "author": "Stan",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "It's easy as can be to put the protector on if ...",
      "text": "It's not rocket science folks. It's easy as can be to put the protector on if you follow the directions and one tip from another user's review. Make a hinge for the screen protector from painters' tape. Put the hinge on the side where the tabs are that remove the protective layers before removing the bottom layer. Easy peasy! There wasn't one single bubble or particle of dust underneath mine on the first try and it lined up perfectly. I used a towel, that I had slightly dampened to keep dust down (I have a REALLY dusty house - seriously), underneath everything. I've used this brand on my iPhones and love the quality. Just buy it!",
      "rating": 5.0,
      "verified": true,
      "author": "Timbertrail",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "please don't get tricked by the \"Amazon Choice\" tab",
      "text": "As an \"Amazon Choice\" product, I expect it to be better than this. It's not anti-fingerprint at all, I mean, really not at all. The minute I put it on my iPad it already catches a lot of finger prints. Every time when a dark screen plays on my iPad, fingerprints is all I see, it's very very annoying.. I have definitely had better experience when it comes to protectors, please don't get tricked by the \"Amazon Choice\" tab.",
      "rating": 2.0,
      "verified": true,
      "author": "Jojojoshua",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Overall they are very good and last a long time",
      "text": "I have purchased these screen protectors before. Overall they are very good and last a long time. The feel of them when using the iPad is just fine for me. No matter how careful I am I still have trouble getting them on without getting a few bubbles that just won't seem to go away. But they are really not a big thing. If you purchase these, check out the videos on YouTube showing the best procedures to follow when applying.",
      "rating": 4.0,
      "verified": true,
      "author": "sunbird",
      "helpful_votes": 2,
      "publication_date": 20170307
    },
    {
      "title": "Beautifully Clear",
      "text": "This is a beautifully clear iPad screen protector. I highly recommend buying this type over glass, as the glass has a tendency to shatter and then the cracks move throughout the protector. It is packaged with care, and contains a wiping cloth, a squeegie-type device to remove any air bubbles, and easy-to-understand instructions and directions. The two-pack, which I bought, is a bargain. I've bought from TechArmour previously, and other vendors, but will exclusive purchase from them when I need something for my devices.",
      "rating": 5.0,
      "verified": true,
      "author": "Music Gal",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Tricky, but does the trick",
      "text": "If you have already placed a similar product on your Iphone, you know how tricky it is. You have to get two contiguous sides lined up, then lift it back up and gradually \"roll\" it onto the screen using the paddle to remove bubbles as you go, resifting and replacing as needed. No matter how careful you are to follow the instructions in cleaning before installing, there is inevitably one or more tiny particles of dust you can't avoid. That said, these small bits do not cause much of an issue for the adherence or clarity. Having this on my Iphone has made a tremendous difference in protection, and I assume it will do the same for the iPad.",
      "rating": 4.0,
      "verified": true,
      "author": "Pat M.",
      "helpful_votes": 0,
      "publication_date": 20160517
    },
    {
      "title": "not worth the money or effort, bubbles, delaminats quickly, peels off too easily esp when installing",
      "text": "This is a lousy scren protectir. It peels off very easily, such as putting the ipad with the screen protector on into a bag. You cannot even get all the bubbles out easily. As I was pulling the protective film off it after i put it on my ipad positioned exactly where i wanted it, the adhesive bac cover part was fine toget off, but when I went to get the protective top cover off, the whole thing including the screen protector itself pulled right off the ipad. it's a bust. totally useless. so i had fingerprints and all kinds of junk on it and it still wasnt on the ipad.",
      "rating": 1.0,
      "verified": true,
      "author": "X",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Feels like nothing is there!! :)",
      "text": "This protector is well made. Pros: -I can't even tell it's even there. -Easy to clean -Precise measurement, all the holes line up correctly. -came with the right tools as advertised Cons: -not scratch free. I have a nasty smudgey mark from somewhere and cannot remove it -This is partly my fault . . . but, it's somewhat a challenge placing the plastic onto the screen. Just wished it were easier -The screen does not completely cover the front of my iPad so that it scratches me sometimes due to its thin plasticity. Overall a great screen. I might look for a different kind though. I'm glad it's not easy to scratch it anyway, that would be a pain.",
      "rating": 4.0,
      "verified": true,
      "author": "cheesemonkey",
      "helpful_votes": 0,
      "publication_date": 20150824
    },
    {
      "title": "A total waste of money",
      "text": "I was excepting the same type of protector as the one I have on my cell phone. These are super thin, sticker like. When applied to the iPads it looks like a cheap film full of bubbles. I was forced to throw both “protectors”. Disappointing and a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 2,
      "publication_date": 20180228
    },
    {
      "title": "Keeping dust specks from underneath - TOUGH",
      "text": "It has a beautiful finish, but once it was misaligned and had to be lifted, dust was attracted to the adhesive, then making bubbles underneath. I watched the Installation Video before installation and the Removing Bubbles Video afterwards. I still had some trouble. My fault! The company is efficient and eager to please.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Its a good thing there's 2 of them",
      "text": "I ordered these by mistake, thinking they were the Tech Armor Ballistic glass. I was going to return them, but with return shiping costing nearly 85% of the original price, I thought I'd give it a try. Its a good thing there's 2 of them. I had a HELL of a time getting this thing on correctly, and ruined one of them in the process. All in all, they're 'OK' but not amazing. Better than some of the film-based options, but for the $2 difference, its absolutely worth it to go with the Tech Armor Ballistic glass, MUCH better value, and easier to install.",
      "rating": 4.0,
      "verified": true,
      "author": "R Norton",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "Difficult to install without bubbles",
      "text": "I was very disappointed with this screen protector. It does not come with the alcohol wipes that many other screen protectors come with and only the microfiber cloth and adhesive strips to remove dust particles, so it was very difficult to install without getting bubbles, especially on a large screen, such as an iPad. I wasted one already, at least a dozen bubbles and I have no confidence that I can install the second one without bubbles.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawny M.",
      "helpful_votes": 0,
      "publication_date": 20190107
    },
    {
      "title": "Easy to apply",
      "text": "I wanted a screen protector for my new ipad 2017 while I decided on a case. The ipad's screen is a fingerprint magnet and I wanted to reduce that somewhat. I purchased the Clear Screen one because for my last ipad I went with another brand that reduced glare and that affected the sharpness of everything. This brand went on perfectly and I am glad I have something on the screen, but it too is a fingerprint magnet. But it came with 2 screens, was very inexpensive and I have piece of mind that it is protecting my screen from finger oils and anything else my hands track on it.",
      "rating": 4.0,
      "verified": true,
      "author": "DSM",
      "helpful_votes": 0,
      "publication_date": 20170522
    },
    {
      "title": "It installed fine but the extra tab was stuck to the top ...",
      "text": "I purchased this to replace another brand of screen saver that was beginning to detach. The installation instructions were clear but the product had extra stripping tabs not describe in the instructions. It installed fine but the extra tab was stuck to the top side of the saver. When I removed it it left a gummy residue on the screen saver. I removed it with alcohol but it still left some residue in the bottom corner of the screen. A flaw I will tolerate but am not happy with.",
      "rating": 2.0,
      "verified": true,
      "author": "John H. Sorensen",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great buy.... I would purchase again!",
      "text": "I purchased the \"HD Maximum Clarity\" screen protector. It does not take away from the resolution of the iPad. It is easy to clean & overall a good buy. It takes a little work to get it lined up correctly. I wish the product was made so you start at the top of the iPad & peel downward. My 1st attempt looked great at the bottom, but once I reached the top, it was partially covering the camera. I had to very delicately readjust it. I like the fact that the you get 2 protectors in the pack, plus a micro-fiber cleaning cloth, a squeegee, dust removal tape, & very detailed instructions. I would purchase this product again!",
      "rating": 5.0,
      "verified": true,
      "author": "SRB",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "Great screen protector BUT may eventually affect screen performance.",
      "text": "Installation was easy and protected the iPad very well. But after a over a year of use, the touch screen became harder to use (difficult to scroll pages on iPad). On a hunch i removed the screen protector and the scrolling went back to normal. The plus side is that that iPad screen looks as good as new, so it did its job in that regard. Since this is a 2 pack, i will try to put on a new screen protector and hope that the scrolling/touch screen issues do not re-appear",
      "rating": 4.0,
      "verified": true,
      "author": "Joel C",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Great product - love the brand",
      "text": "I love Tech Armor. They provide the tools you need to successfully apply screen protectors. I have messed up several times, and they have always honored their warranty. Simply let them know you messed up, and they will send replacements for free within a couple days. Any time I get a new device, I always buy the Tech Armor brand. This screen cover in particular gives me exactly what I need. Crystal clear image and the touch sensitivity is not impacted - It doesn't even feel like it's on the screen. I could not recommend this product enough!",
      "rating": 5.0,
      "verified": true,
      "author": "Lori",
      "helpful_votes": 0,
      "publication_date": 20160927
    },
    {
      "title": "Easy to install. Great product",
      "text": "I am (unfortunately) the person designated in my family to install any and all screen protectors on everyone's various devices so I have had experience with many different brands. I have found that tech armor is by far the easiest to install with no bubbles. They almost always go on clean the first try. Also the \"dust tape\" that they include in the package is very helpful. It allows you to remove little specks of dust or hair without sticking you fingers under the protector. I have previously used scotch tape for this purpose but their tape is stronger and does a much better job. I would definitely recommend this brand.",
      "rating": 5.0,
      "verified": true,
      "author": "JessR",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "An Excellent Product",
      "text": "An excellent product. This screen protector passes a test I didn't realize I was applying: I never realize it's there. The protector is completely invisible unless you look carefully at the edges, and as far as I can tell touch responsiveness is not affected at all. Application was fiddly and stressful, but that's the nature of the product, not any kind of design flaw. The included bubble removal card, dust pick-up tape strips, and (very) small microfiber cleaning cloth are helpful. I feel much better knowing that my baby has been protected by a Smart Case and the Tech Armor screen protector since day 1.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad Gadberry",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "One step of good protection for your iPad",
      "text": "First things first- this product alone will not protect your iPad. If you are at all like me, you tend to be clumsy with your electronic devices, and this alone will probably not protect your screen, especially if the device hits on a corner. It definitely offers another layer of protection and I would not dream of not putting one on my iPad, but you definitely also need a case or cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Mara",
      "helpful_votes": 0,
      "publication_date": 20180520
    },
    {
      "title": "Difficult installation!",
      "text": "This was one of the most difficult screen protectors I have ever installed, and I have installed many! The instructions say to clean the iPad with the wipes that are included, but there were no wipes included! I had just installed a screen protector on my daughter’s iPod and I used the wipe from that. I also used 2 pieces of tape to create “hinges” on the side of the iPad to help line up the screen protector properly. This was helpful, but there were still dust particles due to not being able to properly clean the iPad. We will live with the bubbles, but we shouldn’t have to. Annoyed! Wouldn’t buy this again!",
      "rating": 2.0,
      "verified": true,
      "author": "KWR",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "Clear, Secure Protection",
      "text": "Clear Protection! Big improvement over my previous screen protector. This Tech Armor HD screen keeps the screen looking as it should. Pictures are clear, crisp and the colors true. It was fairly easy to apply and the instructional videos available on UTube were a huge help. I was able to get ALL the bubbles out for the first time. The only screen protector that would be better is the glass option and the privacy option. Highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan VDB",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Easy to install & no air bubbles!",
      "text": "To protect my new iPad, I decided to go with the brand I know and love for my phone screen protectors, Tech Armor. Best decision I have made! I'm the type of person who is OCD when it comes to air bubbles. I was completely satisfied with the easy installation and the final product! To install - I wiped the screen with the cloth it came with, used one of the dust stickers and went from the left to right side (on the long end) and had absolutely no issues. It doesn't even look like there's a screen protector on! Continued happy customer of Tech Armor screen protectors!",
      "rating": 5.0,
      "verified": true,
      "author": "AY",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Does not install well even after watching their installation videos ...",
      "text": "Does not install well even after watching their installation videos. I followed the instructions and was able to get the protector installed and a few minor bubbles removed; however, when I removed the 'step2' tab, the entire protector picked up from the screen causing major bubbles. I removed this protector and installed the second protector in the package. The same thing happened to this one as well. I was able to get all but a few minor bubbles out after it picked up, but I'm unsure how long the protector will actually stay adhered to the screen.",
      "rating": 3.0,
      "verified": true,
      "author": "FarmLife4Me",
      "helpful_votes": 2,
      "publication_date": 20150124
    },
    {
      "title": "I was sad to find that the only case available was the ...",
      "text": "Being rough on technology, I have lifeproof cases on everything that I own. When I bought my Ipad Air 2, I was sad to find that the only case available was the NUUD. Does well protecting against drops and water, but no protection on the screen. After a lot of research, I settled on these screen protectors. These do cover up the entire screen, but the NUUD does clip together with a just little of extra effort. I haven't yet had a chance to submerse test to make sure the gasket seals, but suspect it will be fine.",
      "rating": 5.0,
      "verified": true,
      "author": "WrenchedXJ",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Waste of money",
      "text": "Will not stay stuck down to the screen, I have had to apply the second protector because the first would not stay on. The screen was extremely clean and free of dust prior to installation, but would not stay stuck. The second protector is d=slightly better but not much. I would never but this product again, I'm very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "johnivanp",
      "helpful_votes": 0,
      "publication_date": 20180106
    },
    {
      "title": "Awesome!",
      "text": "This is the only brand I will ever buy again! I did this same thing two years ago - bought the brand they had at the neighborhood discount store. Tried to put it on and then threw it away. Then I bought the Tech Armor - and it was so easy and so professional looking! Seriously, THIS IS THE ONE YOU WANT!!! I haven't had to apply one in two years because the Tech Armor I put on my iPhone two years ago is still good! And no, I did not receive any special discount or consideration for this review.",
      "rating": 5.0,
      "verified": true,
      "author": "SherryA",
      "helpful_votes": 0,
      "publication_date": 20161201
    },
    {
      "title": "Frustrating directions.",
      "text": "Very hard to apply. The directions - both hard- and soft-copy online are not very helpful (Yes, I watched the online video-- several times.). I even ran a shower in the bathroom to cut down on ambient dust. I was confused (as was my spouse - Ph.D. in physics) by the tabs that are supposed to guide you as to use. They seem to have been put on wrong. The film is on my iPad and, so far, it seems to be working in protecting the screen. A LOT of air bubbles, though -- and I followed the directions to the letter. Frustrating directions-- they should be clearer.",
      "rating": 3.0,
      "verified": true,
      "author": "Franklin Williams",
      "helpful_votes": 0,
      "publication_date": 20150506
    },
    {
      "title": "Air bubbles galore",
      "text": "It seemed a promising product at first, but even after several very painstaking attempts to get every piece of particulate matter off the iPad, since the dust would then get stuck to the stick side of the screen protector, there was no way of getting rid of the inevitable air bubble. Even trying to take out the bubble with the (very nice) provided squeegee there was no helping it.",
      "rating": 2.0,
      "verified": true,
      "author": "Lanh V.",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Awesome Screen Protector!!  Highly recommend this product!",
      "text": "The Tech Armor screen protector I ordered for my Ipad air 2 arrived as expected and was boxed very well. The product is great!!! I'm extremely happy with it. I was a little nervous about cleaning my screen and applyig this screen protector but am SOOOO happy I did. The directions were perfect and videos even more helpful. Take the time to watch the videos.... I also received emails from the company and I think keeping in contact with your customers is very important. I read all the reviews before purchasing this product. Tech Armor your product is great! A very pleased customer. I also love that you are sent two screen protectors, a squeegee and a cloth.",
      "rating": 5.0,
      "verified": true,
      "author": "Shell",
      "helpful_votes": 0,
      "publication_date": 20150110
    },
    {
      "title": "Nice and simple to install",
      "text": "Nice and simple to install. Unfortunately I have some specks of dirt between my screen and the screen protector. I peeled the sheet protector off to remove the dirt but it just smeared the dirt. Now I have smear marks on the screen (not cool). I will be calling Amazon to exchange this one with another one. Aside from the smear marks, this protector is pretty cool, touch works great, using a stylus works good too. Its not thick like some other protectors, but it does the job by preventing scratches. I have the retina screen protector, but I will ask Amazon for an exchange but now with the HD clear version.",
      "rating": 4.0,
      "verified": true,
      "author": "RAY BENNETT",
      "helpful_votes": 0,
      "publication_date": 20150508
    },
    {
      "title": "It worked for me",
      "text": "I watched the videos and installed in the bathroom after a quick steam from the shower (to knock down the dust). I cleaned my iPad with a high-quality cleaner and cloth. The hardest part is getting started. You need to be lined up perfectly, or the \"error\" propagates itself across the screen. I had only a few small bubbles that were removed easily. The plastic is crystal clear. As other have said, you can't tell it's there. I was skeptical about getting the install to be bubble free, but I'm now a believer. Time will tell if the protector will hold up, but I do have the second one, if necessary. So far, so good.",
      "rating": 5.0,
      "verified": true,
      "author": "NEguy",
      "helpful_votes": 0,
      "publication_date": 20141114
    },
    {
      "title": "Bogus Marketing - Like all Others, Bubbles do not go away, no easy way to install",
      "text": "Great marketing, sounds great, top seller, video online....HOWEVER....all there promises were bogus. First of all, I watched the video, no suction cups were included but i had some myself and used them - no help whatsoever. Secondly, bubbles, they never go away. Lastly, the second red tab that I needed to remove would not remove, I had to get GOO OFF to remove the sticker. It took me 20 minutes to take off the sticker using excessive Goo Off and the enclose card. DO NOT RECOMMEND.",
      "rating": 1.0,
      "verified": true,
      "author": "Hld",
      "helpful_votes": 3,
      "publication_date": 20141228
    },
    {
      "title": "Does it's job.",
      "text": "This is actually a good screen protector. It's doesn't take anything from the clear, Retina display that iPad Air 2 offers. Fits properly and with proper installation, it's like it's not even there. I'm only giving it a 4 star rating because I was expecting a glass screen protector. I searched for a glass one and this came out as a result (it was actually my bad because I was in a hurry and didn't read the title/description properly). In my opinion, glass is better because it's ultra HD, easier to install and it feels like the actual thing. Nonetheless, this is a good buy if what you're looking for is a scratch resistant, HD look, regular screen protector.",
      "rating": 4.0,
      "verified": true,
      "author": "Korra007",
      "helpful_votes": 0,
      "publication_date": 20160108
    },
    {
      "title": "Have a skilled person install it",
      "text": "Even though Apple is technically not supposed to install 3rd party accessories, I was lucky enough to have an Apple employee install my screen protector, He used all sorts of dust-catching strips before finally putting down the protector on the iPad. I could not have done this alone. Even my careful, precise husband would not have thought to clear every speck of dust like the employee did.",
      "rating": 5.0,
      "verified": true,
      "author": "D Dee",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "I like this for my ipad 2 I'm starting to think ...",
      "text": "I like this for my ipad 2 I'm starting to think that most of the screen protectors here on amazon are pretty much the same. This one like because for some reason the installation was really smooth. everything centered and no bubbles on the first try. Deducting one star because 1. I am not really sure if it's glass, it's too bendy...2. it keeps your fingerprints on there.",
      "rating": 4.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "GREAT!",
      "text": "I bought this just a tad worried about the so-called 'thickness' of the screen. I had nothing to worry about! This 'Tech Armor Apple iPad HD Clear Screen' is a wonderful way to protect that screen of yours! I took mine into Best Buy to be applied, but the directions appear quite straight forward. (If I hadn't been at Best Buy for another issue, I'd done it myself!) There are two screens in the package, so if/or when the first screen becomes scratched &/or old, you can remove it and apply the second screen! What a deal! I highly recommend this product! Always good to protect your investment and an Apple iPad Air is DEFINITELY an investment! Correct? :)",
      "rating": 5.0,
      "verified": true,
      "author": "Medlaw",
      "helpful_votes": 0,
      "publication_date": 20140518
    },
    {
      "title": "Great Product",
      "text": "I bought both the Clear and Anti-Glare screen protectors. The product came with Installation instructions and the tools necessary to successfully place the screen on your device. I have tried other products in the past but the protectors\" adhesive was covered with particles of various substances. These screens I purchased, however, were clean. It even came with dust removing tape that allowed me to directly clean the adhesive side of the screen(which wasn't necessary but convenient nonetheless). Overall I am very happy with the product and now have a trusted source for protective screens that I may need in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151221
    },
    {
      "title": "Fantastic!",
      "text": "This is a superior product. I applied to my Air 2 pretty much right out of the box, so I had no need to clean oil off first . The first attempt went on perfectly aligned, openings perfectly matched, and 99% bubble free. Of course there was a speck of dust, so I carefully lifted the bottom edge, used the magic tape, laid it back down and smoothed out the few bubbles that created. So far it seems to be very fingerprint resistant,even though it is the HD clear model, and glare is not bad, even by a window on the bus. Tech Armore has never let me down!",
      "rating": 5.0,
      "verified": true,
      "author": "ct1156",
      "helpful_votes": 0,
      "publication_date": 20160324
    },
    {
      "title": "Went on well - good instructions on web site",
      "text": "Went on well - good instructions on web site. Final job with screen protector has no bubbles and no dust specks. Used removable tape to position and hold protective screen onto one edge of ipad air and hinged it over ipad air to maintain position of tech armor as I peeled off backing. Good lighting is essential to see dust specs on ipad prior to beginning and through procedure. Only had to clear three small dust specks. Did procedure on kitchen table with ipad resting on a dampened dishtowel to keep from stirring up dust. I would definitely use tech armor again.",
      "rating": 5.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20151207
    },
    {
      "title": "Great value. Used a dozen times.",
      "text": "I have installed at least a dozen of these (I install iPad based POS systems) and never had any problems. They’ve gotten a lot of use over the last year and a half and are still holding up well. The one on my personal iPad has a small scratch in it but I use it a lot and am pretty rough on it. Be sure you are working in the cleanest environment possible when installing, as your biggest enemy will be dust. Great value!",
      "rating": 5.0,
      "verified": true,
      "author": "Adam11",
      "helpful_votes": 0,
      "publication_date": 20180409
    },
    {
      "title": "So far very good!",
      "text": "Jury is out on durability but the installation was smooth and easy and product is clear and functions very well. Very sensitive to touch. Love the antiglare! Hopefully I won’t have the cracking problems that glass does. Right now would definitely buy again!",
      "rating": 5.0,
      "verified": true,
      "author": "tom p",
      "helpful_votes": 0,
      "publication_date": 20190418
    },
    {
      "title": "Don't search for matte",
      "text": "Major glare, thought I was ordering a matte finished one because I just did a search for \"matte\" on the product page and it came up in the product description. They have all five types they sell listed in the lengthy product description, I shouldn't have to spend 10 mins reading and deciphering a product description, thus why I use the search. Overall it's a good protector, the squeegee is very nice and the instructions are some of the better ones I've seen in screen protectors.",
      "rating": 4.0,
      "verified": true,
      "author": "Pocchange",
      "helpful_votes": 0,
      "publication_date": 20170116
    },
    {
      "title": "Awesome Protection & Easy to Install....",
      "text": "Tech Amor makes the best screen protectors I've ever used. These are much better and easier to install than the Zagg ones. It's a perfect fit. Comes with two protectors, an improved square to remove bubbles and now even dust removing stickers. I initially thought the dust removing stickies were a bit unnecessary, but quickly changed my mind when i was able to remove a single particle that hand fallen on the surface. The items come packaged in a sturdy envelope perfect for storage until the next time you need to install a cover. The cover does not interfere with my Apple case, either.",
      "rating": 5.0,
      "verified": true,
      "author": "Fangy",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Best I've ever used!",
      "text": "Unbelievably easy to prepare, clean, apply, and use - this kit is a winner - and best of all, an extra screen protector is included! This is a much better kit than I've used in the past, and wins hands down on value-added features. You'll get two screen protectors, a bubble remover/smoother (credit-card sized plastic), a cleaning cloth, and a half-dozen pieces of lint/dust tape. We had to really clean the surface of our tablet, but using warm breath and the included cloth easily removed smudges before application. In less than two minutes, from start to finish, we were done! and now our tablet is protected!",
      "rating": 5.0,
      "verified": true,
      "author": "WillieTop Contributor: Arduino",
      "helpful_votes": 0,
      "publication_date": 20150127
    },
    {
      "title": "a disappointment for me",
      "text": "Very disappointed in these. Very thin and was bending all over when I was trying to put on. I just was like, I'm going to give up and buy a different one. I wasted my money on this one sadly. I guess I can't always depend on the reviews of others. I got it for my son and he needs a thicker product because of his little boy who loves to play on his iPad but is not always the most dexterous although he is getting there. If you expect thicker protection like I did - this is not for you.",
      "rating": 3.0,
      "verified": true,
      "author": "Violetwrites Leftow",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Great Product",
      "text": "I followed the instructions, plus viewed some you tube videos and the screen protector was a piece of cake to install. The end result for my Ipad Air 2 was great. No dust and the very few air bubbles were very easy to work out. Outstanding clarity and outstanding product.",
      "rating": 5.0,
      "verified": true,
      "author": "737-300",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Highly recommend this product!",
      "text": "I'm extremely happy with this product. I couldn't believe that I was able to apply the screen protector with one try, no bubbles! How about that! Important thing to keep in mind is to make sure no lint or micro substances on the glass. I wiped off the plastic wrapping before opening just to avoid stuffs landed on the glass. The protector is very clear that you don't even know it's there. It's easy to wipe clean and it reduces finger smears compared to without it.",
      "rating": 5.0,
      "verified": true,
      "author": "mfu",
      "helpful_votes": 0,
      "publication_date": 20160905
    },
    {
      "title": "GREAT PRODUCT. EASY INSTALLATION. A MUST HAVE!",
      "text": "Just installed this product on my new iPad. I've never had a screen protector like this (adhesive) but only cases, so I was a bit concerned about \"getting it on right\". I was pleasantly surprised at how easy it was, especially because of the excellent online video. I feel much better about this type of screen protector than the cases I've used on phones in the past. Nothing is getting in between the protection and the device. Bubbles were easy to chase out (again, following video instructions) and the whole process was done in under 5 minutes! Highly recommend to anyone with a device worth protecting!",
      "rating": 5.0,
      "verified": true,
      "author": "mt_bcMOM",
      "helpful_votes": 0,
      "publication_date": 20150101
    },
    {
      "title": "Applied OK, but slightly filters colors",
      "text": "The package consists of what's needed to get the job done and the cover lined up fine. I spent about 15 minutes cleaning, aligning and then applying the cover to a bubble free finish. The one thing I did notice is the color hues are a little off since applying the \"clear HD\" protection. The display is now a little more green/yellow almost like that of a calibrated THX display. I guess it might take some getting used to, but I did not expect any tinting from the protective cover. I do not remembering having this effect with the Invisible Shield I installed on my kid's Xoom tablet or my Android phone.",
      "rating": 4.0,
      "verified": true,
      "author": "ByTor & The SnowDog",
      "helpful_votes": 0,
      "publication_date": 20140211
    },
    {
      "title": "Really great customer survice",
      "text": "At first I might have gotten a defective one as when removing the protective first layer after it was on the iPad it also removed the whole thing. I tried this with the second one as well and the same thing happened. I've had many screen protectors in the past and I'm good at installing them. I contacted Tech Armor to address my concerns and they got back to me very fast. Their email said basically \"sorry to hear you had a problem, where can we ship out your replacement?\" From that alone, I will always order from Tech Armor. The replacement worked as expected and there are no issues with the new ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul(Castropa531)",
      "helpful_votes": 0,
      "publication_date": 20131222
    },
    {
      "title": "Crystal clear",
      "text": "Crystal clear protection. Watch their installation video. Installation requires concentration and careful handling, and may result in a small air cavity anyway. For an iPad, I recommend starting the pressing at the camera end to align that hole correctly, because that alignment is more critical, difficult, and less forgiving than having the alignment slightly askew at the large round home button. You have to touch the iPad harder when this barrier shield is applied, but not to the point where functionality is significantly impaired. It's nice that it comes with two.",
      "rating": 4.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 0,
      "publication_date": 20150219
    },
    {
      "title": "Very Difficult to Place",
      "text": "Very difficult to install and after 15 mins, I still have very small bubbles. I ordered a different brand for my iPhone screen protector and will go to that brand next time. This one didn't come with wet/dry wipes as the other brand did and just is difficult to install. The film has an almost magnetic attraction to the iPad making it virtually impossible to put on the device slowing to avoid bubbles. It will protect the screen, which is the reason I bought it, but I wouldn't purchase again.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161111
    },
    {
      "title": "Tech Armor Screen Protectors",
      "text": "Love the sense of added protection this screen protector provides. We travel all over the USA by car and spend a good deal of time in out of the beaten path about 3-4 months each year. Have used glass protectors on my 2 iPad and 3 iPhones for the past couple of years. If you aren't someone who go to great lengths to protect your device, these are easy to remove and replace. Amazon makes these to replace. We keep spare protectors just to be safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Herb B",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Must have!",
      "text": "When it comes to screen protectors for my iPads, there's nothing I like better than Tech Armor. The screen protector is easy to install, and the directions are clear and concise. I had used them on my personal iPad 4 as well as the iPad 4 that I had in my classroom. When I was looking for screen protectors for my iPad air, it was no contest- Tech Armor was what I wanted. The screen protector holds up well, and doesn't make the iPad screen look odd under fluorescent lighting. It also does well at keeping fingerprints to a minimum too. The smooth surface makes tactile touches seem very natural.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Moravec",
      "helpful_votes": 0,
      "publication_date": 20141004
    },
    {
      "title": "GOOD but read the hidden instructions",
      "text": "Read the Hidden Instructions. I took the 2 protectors out of the envelop not realizing there was a detailed instructions still inside. I just followed what the outer envelope said. Inside the envelops is a smoothing tool , a video link, and written instructions. After I messed up the 1st one (with the help of a leaping helpful kitten) I went to a private area and found the mentions instructions. THe 2nd one on IPAD #2 looks great .. #1 could need to be done again ... it's pretty furry and printed. READ THE INSTRUCTIONS MFG could have packaged it better so everything came out together.",
      "rating": 4.0,
      "verified": true,
      "author": "Gregory Knox",
      "helpful_votes": 0,
      "publication_date": 20140419
    },
    {
      "title": "Nice Screen Protector",
      "text": "These folks are really great on customer service. They followed up to make sure I was satisfied and even sent me a replacement set when I messed up one (don't apply it anywhere near pets), and the second one was defective. I did not have to go through the whole Amazon process to do this and they were on top of things, so don't hesitate to buy it from Tech Armor. Do read carefully the instructions and I got the best results by doing it on my bathroom countertop when there was no moisture present in the bathroom from shower/bath steam. They also have a video available to watch before you install it and that was helpful as well.",
      "rating": 5.0,
      "verified": true,
      "author": "CDB",
      "helpful_votes": 0,
      "publication_date": 20140228
    },
    {
      "title": "Wow, I love my iPad Air and its fun to learn the newer technology.",
      "text": "Wow, just love my product. I'm used to a computer so its a little adjustment but every time I spend some time with it I pick up things that I can do easier. I have my synced with my iMac for my music and access to some other things but am having fun learning a new tech product. I favor Mac's so I highly recommend, great quality and if you get Applecare you get excellent tech support to help you when you need a questions answered. You have to call Apple to get it, I don't think its offers on Amazon, they have other warranties but they don't give you tech support.",
      "rating": 5.0,
      "verified": true,
      "author": "noknots",
      "helpful_votes": 0,
      "publication_date": 20141204
    },
    {
      "title": "Wouldn't buy anything else!",
      "text": "I love everything Tech Armor because they really stand behind their products, without question. You won't know this screen protector is in place. Watch the instruction videos on website and YouTube. If a tiny bubble or two won't go away then you probably have dust. Lift up protector just enough to use dust remover that comes with kit, on the iPad and sticky side of screen protector. Then reapply it. I believe it's the best out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila in Florida",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Terrible",
      "text": "Doesn’t come with cleaning wipes, so it’s nearly impossible to get the screen clean. Bubbles like crazy and smudges like you wouldn’t believe. Awful product.",
      "rating": 3.0,
      "verified": true,
      "author": "Maria Newhouse",
      "helpful_votes": 0,
      "publication_date": 20200224
    },
    {
      "title": "Awesome screen protector at low cost and you even get ...",
      "text": "Awesome screen protector at low cost and you even get two of them in the box. For those having trouble installing the tricks are: one clean the screen with alcohol, two use a bathroom and turn the shower on to build steam which will create a dust free environment for installation, the steam also helps reduce the amount of bubbles to squeegee out. Do this and I guarantee you will get a bubble free perfect install. The screen protector in general really resists fingerprints all better than the bare glass on my iPad, and you just wipe out off with a tshirt or the included cloth and you're good as gold.",
      "rating": 5.0,
      "verified": true,
      "author": "hatch",
      "helpful_votes": 0,
      "publication_date": 20150520
    },
    {
      "title": "Great Temporary Fix for Cracked Screen",
      "text": "iPad Air screen had been cracked a little, then a lot. Searched online, found this one on Amazon decided to try it out. Easy application and works wonders with all the cracks on the screen. 2 pack made it even more attractive. Checked on replacement for the screen and was told $200 minimum, hence the decision to buy a screen protector instead. Will most definitely keep working the way it is, will now wait to upgrade the device when I choose.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Town",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Ok but not the best out there",
      "text": "I'm only giving this four stars because It doesn't noticed the touch of your finger or stylus as well compared to nothing on the screen at all. Sometimes you have to touch twice or more to get the application to work. I actually thought this was like a glass protector but when I received it I was disappointed to find out it was not. But that would be my fault for not reading the description correctly.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20170617
    },
    {
      "title": "Great customer service",
      "text": "I've purchased a lot of tech armor screen protectors in the past for almost all of my devices, they're so good and you usually get more than one in case you mess up installing it. I've never had a need to go back and request a new one through their warranty service, but I did this time. Their customer service is wonderful and got back in touch with me in less than 24 hours, and within the week they'd sent me replacements free of charge! If you're having trouble laying it on flat so that they don't cover up the home button or the camera, they do have videos that show you how to do it.",
      "rating": 5.0,
      "verified": true,
      "author": "A Gonzales",
      "helpful_votes": 0,
      "publication_date": 20140914
    },
    {
      "title": "Kinda pricey but seems like decent quality",
      "text": "Thickest I could find and only 1 one I could find that fits more comfortably with fintie like brand cover ( that is like really thick foam that you have to squeeze your iPad in and than wrap around the edges of it ) also much better with bubbles than most others that we tried and seems like will hold for a while",
      "rating": 5.0,
      "verified": true,
      "author": "Irena G.",
      "helpful_votes": 0,
      "publication_date": 20180430
    },
    {
      "title": "Good Quality and Great Price",
      "text": "Well-packaged and it's nice to have 2 - a really good deal for under $10. My only complaint is that it is so hard to install the screen protector without any bubbles. I carefully followed the instructions, watched the Tech Armor video about removing the bubbles and while that helped, it didn't help me get all the imperfections off the screen protector. I like this one better than the ballistic glass that I have on my phone.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy S",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "I am new to technology and their support products. ...",
      "text": "I am new to technology and their support products. The Ipad salesman suggested I purchase an \"Armorsuit\" clear screen protector for longevity and safety. This particular store was out of the size I needed so the clerk explained how I could purchase one on line from Amazon. I was scared to apply the protector to the screen however the instructions were so well written that the screen went on with ease. I will trust \"Armorsuit\" and their products that support my new hobby - technology!",
      "rating": 5.0,
      "verified": true,
      "author": "Greek Yayia",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Don’t waste your money...bubbles and frustrating to install!",
      "text": "Terrible. Despite following installation instructions exactly as directed, there were still multiple bubbles after a frustrating ten minutes of putting the darn thing on. I ended up leaving it on for three days before just throwing it away and going with the same brand I use for my cell phone (which I thought I was doing in the first place, but I got the brand names mixed up and realized my error too late and figured I’d just give this one a try since I’d already bought it - regretted it immediately...total waste of money!).",
      "rating": 1.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "VERY big waste of money",
      "text": "An impossible product to install, nothwithstanding the six videos I sat through to make sure I followed instructions precisely. Maybe some folks can install a bubble free screen protector, but nothing I did, from squeegee pad to trying to remove bubbles by peeling back the protector and using scotch tape worked--in fact, it created more bubbles. To add insult to injury, the instructions warn you to be patient and repeat your efforts until all bubbles are eliminated. Impossible! There has to be a simpler way to protect an I pad screen. In fact, I don't know why the Apple I pad doesn't come with an appropriate protector installed. VERY big waste of money, time and effort.",
      "rating": 1.0,
      "verified": true,
      "author": "Tech Armor",
      "helpful_votes": 5,
      "publication_date": 20150121
    },
    {
      "title": "Great!",
      "text": "I bought this for my husband since he was looking for something with a keyboard and Bluetooth capabilities for his iPad Air 2 for work. He was asking for a more expensive version of it but I found this one on Amazon for a lot cheaper price and it has all the same features the more expensive one has. So far he really likes it. I'd say it was a hit and I saved a bit of money by buying this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Dawnmarie",
      "helpful_votes": 0,
      "publication_date": 20170903
    },
    {
      "title": "Good Screen Protector For The Value",
      "text": "This is the first screen protector I've used that didn't require the liquid spray. I really like this screen protector. It comes with 2, which I like. I have a knack for messing up applying the first time. Luckily for me, I got it on the first try. I ended up with only one piece of dust making a bubble. The bubble was on the border so the display isn't ruined. I did notice the finger prints got on there quickly and in daylight, it really sticks out. That's all I can really knock it for. All in all, good product. Would buy again if I didn't have the spare. :)",
      "rating": 4.0,
      "verified": true,
      "author": "Cheddar",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Saved my ipad from damage when stepped on!",
      "text": "My spouse stepped on my ipad while barefoot and it survived without any damage thanks to this screen protector. The protector cracked in a few spots and absorbed all the impact! Bought another set today to replace the broken one.",
      "rating": 5.0,
      "verified": true,
      "author": "Bookworm",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Smooth and Easy!",
      "text": "Awesome! Easy to put on thanks to the video. Fits beautifully. As for the clarity it looks the same as when the iPad has no screen protector. Perfectly clear and smooth. Make sure you have a clean hard surface to apply this onto your iPad, like a table or hard floor. Don't use your bed as a work area or fuzz and lint will try to stick to your protector as you're putting it on your iPad. I speak from personal experience ;-P",
      "rating": 5.0,
      "verified": true,
      "author": "Khadija R.",
      "helpful_votes": 0,
      "publication_date": 20161207
    },
    {
      "title": "Installation issue",
      "text": "I have applied and used other screen protectors for my phone but never one for my iPad. Unfortunately the package didn’t have the initial screen cleaning pad with it (did have the micro-fiber cloth) so apparently I didn’t get the screen completely clean and ended up with a dust bubble. When I tried lifting the screen it only made it worse. Also on the install video they show using suction cups when installing the screen protector on larger screens - like iPads. Be nice if they included these suction cups in the package.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190512
    },
    {
      "title": "it looks nearly perfect. As if there's almost no shield on your ...",
      "text": "I actually purchased this shield for my mom's iPad. She says she loves it because it prevents from scratching the surface of the iPads glass. As for me, being as I was the one who installed it for her, it took me some time to stick it to the screen without getting any hairs & dirt on it. Everything it attracts seems to show if you're not careful. But once you install it, and squeeze out the bubbles, it looks nearly perfect. As if there's almost no shield on your device.",
      "rating": 5.0,
      "verified": true,
      "author": "Starlight",
      "helpful_votes": 0,
      "publication_date": 20160130
    },
    {
      "title": "Good cut and easy install.",
      "text": "So far this screen protector has held up well and appears same quality if not better value than Spigen's and iSmooth iPad screen protectors. Tips: people, when you install, have good lighting (wear led headlamp), have air duster, also have radtech omnicleanz (which is the best kept secret liquid for cleaning residue/fingerprints), line up the protector, lay it down slowly to minimize bubbles. Don't worry about getting it dust bubble free on the first lay down, you can lift up the protector and use the dust stickers to methodically remove those dust causing bubbles.",
      "rating": 4.0,
      "verified": true,
      "author": "KC ESQ",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "Just what I needed!",
      "text": "The online instructional videos were detailed and guided me through the application process. Everything I needed was included for a bubble-free application. There is virtually no distortion and the cutout hole allows for use of the home button on my new iPad. The kit arrived lightning fast, and well packaged. I hope I won't need the other of the two-pack, but I've got it for the price of only one of TechArmor's competitor's. Furthermore, the extra gave me confidence to risk an imperfect try applying the first.",
      "rating": 5.0,
      "verified": true,
      "author": "TL",
      "helpful_votes": 0,
      "publication_date": 20170316
    },
    {
      "title": "Extremely difficult to put on--very bubbly",
      "text": "Extremely difficult to put on. Worst screen protector I have ever tried to put on, and I have used and put on many others before. Tried with both....it was horrible, constant bubbles no matter how carefully we cleaned and tried to get them out.. Am now going out to buy another screen protector, not from this company.",
      "rating": 1.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Two saves in one week!",
      "text": "Last week I had the misfortune of accidentally dropping my iPhone 7+ and iPad within 2 days of each other. Thankfully, Each of them had Tech Armor screen protectors. The screen protectors cracked but the screens on both devices were unscathed. I bought new Tech Armor screen protectors to replace the cracked ones just in case lightning strikes twice. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "AN",
      "helpful_votes": 0,
      "publication_date": 20170727
    },
    {
      "title": "This protector has the best instructions, watch the videos",
      "text": "This protector has the best instructions, watch the videos, There is no reason you should not be able to apply this screen. I prepared as they instructed just make sure you put a good light on the screen once you have prepared. If you have animals you may want to put it on in an environment without. Every part of my house is exposed to animals and it was impossible to get it clean. This is no fault of the screen protector, if you follow the instructions and make sure to check the screen carefully after cleaning you will have no trouble.",
      "rating": 5.0,
      "verified": true,
      "author": "cojo",
      "helpful_votes": 0,
      "publication_date": 20150214
    },
    {
      "title": "Great product! Easy to install (if you follow the instructions)",
      "text": "I watched the video, read the instructions and reviews so that I would get it right the first time. I am pleased to say that it went on perfectly and it only took about 2 minutes. The only thing I would add is that a review I read advised to use tape to create a \"hinge\" on one edge so that it is perfectly lined up before removing the first layer. I knew from previous experience that this would help and I would highly recommend it be added to the Tech armor instructions. I really like the product. Very nice!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bonbon",
      "helpful_votes": 0,
      "publication_date": 20150126
    },
    {
      "title": "OK, though nothing to compare it too.",
      "text": "Seems like in the development of the new iPad Air 2 they took steps to reduce the noticeable glare and fingerprints. However, applying this screen protector eliminates the anti-glare and anti-finger prints technology. I don't know if it's just this screen protector, as this is my first iPad screen protector, or if it applies to all screen protectors, but the glare and fingerprints are more noticeable when viewing. In low light situations the glare is reduced. So I guess there is a trade off when adding screen protection.",
      "rating": 3.0,
      "verified": true,
      "author": "Mick",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Go to screen protectors",
      "text": "Have been using Tech Armor screen protectors on my iPhones so made sense to get them for my iPads. I've gotten pretty good at installing the iPhone screen protectors but the iPad is much harder. I recommend going into a bathroom and running the shower on hot until its steamy (make sure to close the door :P). This allows for the dust to settle and you can hopefully install without as much dust getting trapped under the screen protector. Once installed, looks great and can't even tell its applied. Screen sensitivity is not compromised at all.",
      "rating": 5.0,
      "verified": true,
      "author": "A Lee",
      "helpful_votes": 0,
      "publication_date": 20140317
    },
    {
      "title": "READ THE INSTRUCTIONS FIRST",
      "text": "As a smart guy I thought I'd just take it out of the box and put it on my iPad Air... It's easy, right?? Well, I screwed it up the first time, so I glanced and the instructions. I put the second one on but it still didn't look right....I didn't clean the screen very well before installing. Long story short, READ all the instructions before you even start to install. Now I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "RHB",
      "helpful_votes": 0,
      "publication_date": 20160610
    }
  ],
  "product_meta": {
    "title": "Tech Armor High Definition HD-Clear PET Film Screen Protector (Not Glass) for Apple iPad Air/Air 2 / New iPad 9.7 (2017) [2-Pack]",
    "rating": 4.4,
    "feature_bullets": [
      "Compatible Model(s): iPad Air 2 / iPad Air / NEW iPad 9.7 (2017) by Apple [2 Pack]. This package includes TWO PET film screen protectors – NOT GLASS.",
      "WHAT IS TECH ARMOR HD CLEAR FILM. Tech Armor HD Clear Film Screen Protectors provide maximum clarity, TruTouch Touchscreen Accuracy, and compliment your iPad Air 2 and iPad Air Retina display.",
      "HOW DOES TECH ARMOR HD CLEAR WORK - Tech Armor HD Clear is the affordable way to protect your iPad Air 2/iPad Air screen from scratches, drops, dust and daily wear. Only premium materials and expert design go into this Best In Class product.",
      "WHY BUY TECH ARMOR HD CLEAR - Tech Armor PET Film screen protectors use only Japanese PET film and high-grade silicone adhesives for rainbow-free viewing clarity and easy, bubble-free installation on your iPad.",
      "The anti-fingerprint, oleophobic coating resists smudges to maintain the HD clarity of your iPad display. No Bubble, easy install, and perfect fit. (PLEASE CONTINUE READING BELOW)"
    ],
    "specifications": {
      "Brand": "Tech Armor",
      "Item model number": "SP-HD-APL-ID5-2",
      "Item Weight": "2.4 ounces",
      "Item Dimensions  LxWxH": "9.53 x 6.69 inches",
      "Color": "HD Clear",
      "Manufacturer": "Tech Armor",
      "ASIN": "B00EL94Z4I",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 16, 2013",
      "Customer Reviews": "4.4 out of 5 stars8,346 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#267 in Tablet Screen Protectors"
    },
    "categories": [
      "Tablet Accessories",
      "Computers & Accessories",
      "Electronics",
      "Screen Protectors"
    ],
    "price": 9.95
  }
}