{
  "website_summaries": [
    {
      "verdict": "A very practical tool kit with plenty of extras like slip-joint pliers and air compressor, but it trades quality to meet its low price point.",
      "pros": [
        "Owners find this kit highly practical, with multiple tools",
        "Jumper cables work well",
        "Users like that the storage bag doubles as a reflector"
      ],
      "cons": [
        "Tire gauge and ice scraper are flimsy, users report",
        "A few reports of flashlight not working on arrival",
        "Reports of air compressor not working or breaking on first use"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Kit for a New Driver",
      "text": "Great little kit. I bought this for my daughters first car and it has pretty much anything she might need on the side of the road. I added a blanket and she's good to go. Recommended for anyone that does not have these items in their trunk already. The bag itself has compartments to put the smaller items in. Only thing I might change is swapping the manual tire pressure gauge out for a digital one.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Leonard",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Good product",
      "text": "Bought 8 of these as Xmas gifts. I also included a first aide kit and some flares to complete the package.",
      "rating": 5.0,
      "verified": true,
      "author": "Wanda Gibson",
      "helpful_votes": 0,
      "publication_date": 20191219
    },
    {
      "title": "Piece of mind in a tote bag.",
      "text": "We bought this for our daughter to keep in her car. I don’t necessarily like the colors haha. But I love that this product came with everything our young driver needs to have on hand in an emergency situation. It gives us worried parents a little piece of mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Felicia",
      "helpful_votes": 0,
      "publication_date": 20171102
    },
    {
      "title": "Good",
      "text": "Christmas gifts they liked them got one for my son one for my daughter they both bought their first cars this year",
      "rating": 5.0,
      "verified": true,
      "author": "Signe D. MacKenzie",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Everything might need in emergency in nice compact case.",
      "text": "Given to grandson for graduation now that he has his own not so new car so he is better prepared for problems.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191004
    },
    {
      "title": "Great Kit",
      "text": "Got this as a gift to give to our future son in law. It has everything you could hope to need.",
      "rating": 5.0,
      "verified": true,
      "author": "singleton",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Much much better in pictures!",
      "text": "Not what I expected. Very poor que lift. Flashlight is a joke.",
      "rating": 3.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200117
    },
    {
      "title": "Hell no",
      "text": "Waste of money do not buy. I was really excited about having this kit until trouble struck and i finally got to test the items. I bought this kit and I am definitely going to return it. The jumper cable is useless it doesnt work when i tried to jumpstart my car this morning, the flashlight is defective and the tire inflator doesn't pump",
      "rating": 1.0,
      "verified": true,
      "author": "CocoBarbie",
      "helpful_votes": 3,
      "publication_date": 20180311
    },
    {
      "title": "Has what you need",
      "text": "Cheaply made tools, but they work great in an emergency. Add in a small first aid kit and you're pretty much set. This kit gives you the pieces you need that you can't pick up at your local pharmacy at a good price.",
      "rating": 4.0,
      "verified": true,
      "author": "Kjm31",
      "helpful_votes": 0,
      "publication_date": 20131119
    },
    {
      "title": "Worth it.",
      "text": "Not the one I really wanted, but this will do. Good quality. Will buy more (for my grandkids.",
      "rating": 4.0,
      "verified": true,
      "author": "Allen O. Getz",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "Pray you don't need it.",
      "text": "it is CHEAP! i would not recommend this to anyone. I gave it 2 stars because it is partially my fault, I should have look around and got some reviews. everything in the Chinese bag is junk, I cannot express how cheap it is, words cannot do it.",
      "rating": 2.0,
      "verified": true,
      "author": "Daniel S",
      "helpful_votes": 3,
      "publication_date": 20140722
    },
    {
      "title": "Four Stars",
      "text": "very nice set for the money. love it. everyone should have one",
      "rating": 4.0,
      "verified": true,
      "author": "Traci Baldwin",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "Five Stars",
      "text": "Better quality than I expected. I gave this as a gift and my kids fought over it.",
      "rating": 5.0,
      "verified": true,
      "author": "Davisgurl",
      "helpful_votes": 0,
      "publication_date": 20170415
    }
  ],
  "product_meta": {
    "title": "Performance Tool 60220 Premium Roadside Emergency Kit With Jumper Cables",
    "description": "Size:Premium Roadside Emergency KitPerformance Tool Premium Roadside Emergency Kit contains essential tools for the occasional automotive emergency. Features 12 volt 250 PSI tire inflator, 8 feet 10GA jumper cables for light autos, free standing warning triangle. Also includes, flashlight, slip joint pliers, bungee cords, screwdriver, gloves, snap blade knife, poncho, tire gauge, electrical tape and cable ties. Comes in convenient carry case.",
    "rating": 4,
    "feature_bullets": [
      "Essential tools for the occasional automotive emergency",
      "Features 12 volt 250 PSI tire inflator; 8 foot 10GA jumper cables for light autos; free standing warning triangle",
      "Includes: flashlight; slip joint pliers; bungee cords; screwdriver; gloves; snap blade knife",
      "Includes rain poncho; tire gauge; electrical tape and cable ties",
      "Comes in convenient carry case"
    ],
    "specifications": {
      "Manufacturer": "Wilmar",
      "Part Number": "60220",
      "Item Weight": "5.15 pounds",
      "Product Dimensions": "11.1 x 5.1 x 15 inches",
      "Item model number": "60220",
      "Size": "Premium Roadside Emergency Kit",
      "Style": "Premium Roadside Emergency Kit",
      "Item Package Quantity": "1",
      "Included Components": "1 Performance Tool Branded Product",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00ECWZ0A2",
      "Customer Reviews": "4.0 out of 5 stars34 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#412,676 in Automotive",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Date First Available": "August 6, 2013"
    },
    "categories": [
      "Replacement Parts",
      "Battery Accessories",
      "Battery Jumper Cables",
      "Automotive Parts & Accessories",
      "Batteries & Accessories",
      "Automotive"
    ],
    "price": 48.88
  }
}