{
  "website_summaries": [
    {
      "verdict": "A liquid dewormer that works well for treating roundworms and comes at an affordable price.",
      "pros": [
        "Liquid form that's easy to administer",
        "Treats roundworms, which are common in cats",
        "A popular dewormer by a top brand in pet care"
      ],
      "cons": [
        "Doesn't work for a broad range of worms"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Miracle worker",
      "text": "My cat likes to hunt and play outdoors and ate a few lizards, she contracted a parasite which caused her to stop eating and she lost close to 5lbs. She was still drinking water so I gave her a dose of this and she slowly started eating again and gained her weight back. She was so playful and back to her regular self!",
      "rating": 5.0,
      "verified": true,
      "author": "Shanna",
      "helpful_votes": 13,
      "publication_date": 20190121
    },
    {
      "title": "Excellent Product",
      "text": "Great product for a low price. I added some to the cat food for a feral cat I have been feeding. His health has improved greatly thanks to this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffry Moser",
      "helpful_votes": 10,
      "publication_date": 20181106
    },
    {
      "title": "Mix with wet food",
      "text": "If I make sure my “outdoor” cats are hungry, and I give it to them mixed with wet food they like.... no problem! They gobble it down. I have noticed a significant reduction in them vomiting worms so it appears to be working.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark Sublette",
      "helpful_votes": 7,
      "publication_date": 20190504
    },
    {
      "title": "Worked for feral",
      "text": "I have a feral cat I take care of. Took care of his round worms. Easy to give, is liquid form and mixed in wet cat food he ate it right up, can’t say the same about crushed pills",
      "rating": 5.0,
      "verified": true,
      "author": "K. Chianos",
      "helpful_votes": 6,
      "publication_date": 20190610
    },
    {
      "title": "My Cat Is Still Healthy",
      "text": "My cat is basically an outdoor cat. Kinda 50/50 depending on the weather. Soon to be 12 years old I worry about her health. This is a small price to pay to keep her from worms and other dangers. Been using this product for years and she is still an active and happy kitty. Recomended",
      "rating": 5.0,
      "verified": true,
      "author": "terrance pae",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Works well and is easy to administer",
      "text": "This seems to work well, all the cats I have given it to have happily eatin it and it is very reasonably priced. I used to buy the paste buy the same brand in a small syringe which was sometimes easier to dose but this works just fine.",
      "rating": 5.0,
      "verified": true,
      "author": "BETSY SAWYERS",
      "helpful_votes": 12,
      "publication_date": 20180221
    },
    {
      "title": "Cats HATED this",
      "text": "My cats avoided the bowl I mixed it in and would not drink. We ended up putting it down their mouths and they sputtered and coughed for an hour. We still had to get a much more expensive dewormer from the vet afterward which actually worked.",
      "rating": 2.0,
      "verified": true,
      "author": "J.P,",
      "helpful_votes": 0,
      "publication_date": 20200315
    },
    {
      "title": "other products by Hartz work wonderfully, however",
      "text": "I'm sure it's okay, other products by Hartz work wonderfully, however, the promise of a flavor cats love apparently isn't a flavor mine does (but she does love their hairball medicine, tho). It probably works great, but she won't even taste it.",
      "rating": 4.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 6,
      "publication_date": 20160119
    },
    {
      "title": "This was needed after successful flea treatment,",
      "text": "Mixed with can food with gravy, no problems. But I kept them on dry food for the next day or so, in case it give them any loose stools. I did this on the second treatment, having seen results after first.",
      "rating": 5.0,
      "verified": true,
      "author": "Oneeye",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Almost killed my cats",
      "text": "This almost killed my cats. I called the Vets after they got sick by this dewormer and they said they do not recommend it because it has severe side effects.",
      "rating": 1.0,
      "verified": true,
      "author": "SK",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Works but Bad taste",
      "text": "The cats don’t like the taste. It’s hard to get them to eat it.",
      "rating": 4.0,
      "verified": true,
      "author": "Beverly Faye Mother Earth Apothecary ",
      "helpful_votes": 3,
      "publication_date": 20181209
    },
    {
      "title": "rid wormer for cats",
      "text": "UH....it is rid wormer for cats .... I used it to rid the cats of worms... .... it is a time consuming process but easy to do.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Kingsley",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "effective",
      "text": "i put this on a spoon of tuna to make sure my cat swallowed all of it-not knowing the flavor. she gobbled it all down with great results.",
      "rating": 5.0,
      "verified": true,
      "author": "sonie",
      "helpful_votes": 0,
      "publication_date": 20190801
    },
    {
      "title": "Pet Health",
      "text": "This medication seemed to work well with the first dose. We gave second dose as a precaution.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Dilts",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Saved my kittens life",
      "text": "My kitten has done a complete 360° since given this dewormer. She was, in my opinion, lethargic. Now shes hyper and playful and never stops playing.i couldnt be happier.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina Hernandez",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Good product",
      "text": "Works, not expensive, and easy to use. Like the amount for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan K. Sorrell",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Worked overnight, great product and great price 👍🌞😁",
      "text": "Easier than capsules, cats are it in food better than the Caps. If they smell it they won't eat, had no problem with this liquid , totally sold, on this one Thanks 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20200218
    },
    {
      "title": "It works.",
      "text": "I just put the cat in a cage with the food covered with the medicine. Cat ate it and no more worms.",
      "rating": 5.0,
      "verified": true,
      "author": "Don M. Lugafet Jr.",
      "helpful_votes": 0,
      "publication_date": 20190803
    },
    {
      "title": "Works well",
      "text": "We took in a stray kitten who was already a good hunter. Because there was no history for this 10 mo old, we wanted to worm her and used this product. I suspected she may have roundworm because she had a round stomach. She did have round worm and this product killed them. Since this subject is gross, I will just spare you the details. But I would recommend this for anyone suspicious of roundworm to try this product.",
      "rating": 5.0,
      "verified": true,
      "author": "pegasus9000",
      "helpful_votes": 2,
      "publication_date": 20201123
    },
    {
      "title": "Can't seem to get my cat to drink the dewormer",
      "text": "Finding it hard to get my cat to drink the water with drops of this in the sterile water",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20201120
    },
    {
      "title": "Horrible. Don't waste your money",
      "text": "This product did not work at all for my kitten I treated her four times and she still had worms I ended up having to go to Walmart and get her something",
      "rating": 1.0,
      "verified": true,
      "author": "Amber welch",
      "helpful_votes": 0,
      "publication_date": 20201120
    },
    {
      "title": "Great Cat Dewormer",
      "text": "Well as its not for human consumption i have no idea of the \" flavor\" my cats consumed it fine, no side effects except no more worms.",
      "rating": 5.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20201204
    },
    {
      "title": "Worked well",
      "text": "Cats loved it which was surprising because it smelled aweful lol",
      "rating": 5.0,
      "verified": false,
      "author": "Erica lemaster",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Work's!!!",
      "text": "Thank you! The product ended up in neighbor's mail box and she brought it up to me.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20201205
    }
  ],
  "product_meta": {
    "title": "Hartz UltraGuard Rid Worm Liquid for Cats",
    "description": "Hartz UltraGuard Rid Worm Liquid for Cats is an easy-to-use solution for removing roundworms in cats and kittens. Simply measure one teaspoon (5mL) per 5 pounds of body weight. The syrup can be dropped directly into your pet's mouth or mixed into food. Cats may be dewormed at earliest between 6-8 weeks of age. The first treatment should be repeated 14 days later. If reinfestation is apparent, treat again in another 14 days. Be sure to store this product in a cool, dry place where temperatures do not exceed 86°F. Consult a veterinarian before using in severely debilitated animals.",
    "rating": 4.3,
    "feature_bullets": [
      "A mild and effective method to remove roundworms (Toxocara Canis and Toxacaris Leonia) from cats and kittens.",
      "Includes 4 ounces of dewormer syrup",
      "For use on cats and kittens 8 weeks of age and older",
      "Easy-to-use syrup can be dropped directly into your pet's mouth or mixed into food.",
      "The first treatment should be repeated 14 days later",
      "Store product in a cool, dry place and avoid temperatures above 86°F"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.88 x 1.88 x 5.4 inches; 5.6 Ounces",
      "Item model number": "3270014108",
      "Date First Available": "February 1, 2013",
      "Manufacturer": "Hartz",
      "ASIN": "B00E2DB18Q",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Flea Drops",
      "Pet Supplies",
      "Flea & Tick Control",
      "Cats"
    ],
    "price": 18.3
  }
}