{
  "website_summaries": [
    {
      "verdict": "The Intel Core i3-4330 is the budget CPU to get for general computing and light workloads.",
      "pros": [
        "Best performance in its category",
        "Low power consumption",
        "Supports Intel's Advanced Vector Extensions (AVX2) and Hyper-Threading"
      ],
      "cons": [
        "Weaker graphics performance than the competition"
      ],
      "aspects": {},
      "publication_date": 20140630,
      "rating": 8.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good processor, good price.",
      "text": "This is working well in a mini-ITX hackintosh build, installed in a Gigabyte GA-H87N-WIFI motherboard. Powered with a PicoPSU 160XT power supply.",
      "rating": 5.0,
      "verified": true,
      "author": "Craig W. French",
      "helpful_votes": 7,
      "publication_date": 20140505
    },
    {
      "title": "All you probably need for your desktop",
      "text": "Great efficiency! I went with a lower power Core i3 dual core vs a Core i5, and I'm glad I did. Runs office applications just fine. Couple it with a GTX 750 video card if you want to play intense games without wasting power. I really wish I had bought an SSD for my desktop. The CPU fan on this thing is so quiet that the mechanical hard drive sounds really loud now.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "Great for a mid-range gaming system.",
      "text": "Don't let people fool you, this isn't your Clarkdale i3, it's a dual core beast. I built a small steam box with my old ATI 5870, and am able to comfortably run most games at mid to high settings at 1080p. If you're making a higher end machine then consider the Haswell i5, but don't think for a second that this chip isn't capable at doing some serious gaming at an excellent price.",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent M Pickering",
      "helpful_votes": 2,
      "publication_date": 20140617
    },
    {
      "title": "Great cpu for the price. Intel does it right.",
      "text": "I almost went with an i5, but trying to stay in a budget, I went with the i3. This cpu is solid. OS install went very fast, and web surfing doesn't effect the performance one bit. I have 8gb of system memory installed, and running a 240ssd. Great combo. I will buy again for my customers.",
      "rating": 5.0,
      "verified": true,
      "author": "Mcomeau",
      "helpful_votes": 0,
      "publication_date": 20140602
    },
    {
      "title": "Love this processor",
      "text": "Bought this to build a low-power gaming box. The entire machine idles at about 20 Watts and only uses about 35 Watts flat out. Plenty of horsepower and I'm very impressed. I had intended to add a discrete GPU but the Intel graphics are doing fine (at lower resolutions).",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140316
    },
    {
      "title": "Intel CPUs are rock solid. Had this on my ...",
      "text": "Intel CPUs are rock solid. Had this on my HTPC for awhile now and doesn't miss a beat. Plenty fast for HD movie playback.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Murphy",
      "helpful_votes": 0,
      "publication_date": 20161105
    },
    {
      "title": "This processor is an efficient and affordable powerhouse!",
      "text": "Cool, fast and powerful. Much better balanced than its predecessors thanks to the improved Intel Processor Graphics. Would recommend for HTPC, general use or home made console / emulation machine.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20131113
    },
    {
      "title": "Schweeeeeet CPU",
      "text": "Got this process for a NAS box. Processor worked great out of the box. Enough processing power for my purposes. Integrated graphics are nice since I don't really need a video card.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert T",
      "helpful_votes": 0,
      "publication_date": 20150123
    },
    {
      "title": "Fantastic processor. Combined with a Gigabyte brand motherboard",
      "text": "Fantastic processor. Combined with a Gigabyte brand motherboard, this thing runs OSX as well or better than a real Mac. Using the onboard HD 4600 graphics. Love it. Very very fast! Very low power draw too.",
      "rating": 5.0,
      "verified": true,
      "author": "UnaClocker",
      "helpful_votes": 0,
      "publication_date": 20150917
    },
    {
      "title": "Great budget CPU that I can upgrade later if needed",
      "text": "Built a budget gamer system just for League of Legends and this was the cpu choice. The on-chip video capabilitys give me a great gaming experience for LOL. I will upgrade to a later haswell i7 if I need to but for now this dual core chip runs great.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall Adams",
      "helpful_votes": 0,
      "publication_date": 20140512
    },
    {
      "title": "This guy works great for home computing",
      "text": "This guy works great for home computing. I run semi-complex programs like Adobe Apps and 3D Sketchup. Rendering never lags. Graphics look great with on-board chip. So far so good! Perfect for a Budget Build.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam L",
      "helpful_votes": 0,
      "publication_date": 20150929
    },
    {
      "title": "More than expected from i3",
      "text": "I expected low power from an i3 and was surprised. This little i3 has very low power consumption and is able to play most modern games. I have only once or twice thought I needed more power. I am very glad I didn't go all out with an i7 sucking 130 watts.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin",
      "helpful_votes": 2,
      "publication_date": 20140419
    },
    {
      "title": "Great HTPC processor",
      "text": "I got the i3 for my HTPC and love it. It lower power so it run cool and quiet but if I throw something at it that involves a little more power it can handle it. Love the processor so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott P",
      "helpful_votes": 6,
      "publication_date": 20140208
    },
    {
      "title": "great little processor",
      "text": "I have built two systems, one with the i3-4330, and the other with the i5 Haswell. I cannot tell the difference between the two. I use the onboard graphics, and they work just fine. Good processor for building Hackintosh.",
      "rating": 4.0,
      "verified": true,
      "author": "Double Dee",
      "helpful_votes": 0,
      "publication_date": 20140110
    },
    {
      "title": "Perfect for setting up a Sophos UTM box to increase your network security!",
      "text": "great little processor for low intensity work. I used this in a box I set up as a Sophos UTM. Not the fasted processor out there, but it does what it's supposed to and does it well",
      "rating": 4.0,
      "verified": true,
      "author": "Chief Points",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "good product, work as expected with good performance",
      "text": "work as expected with good performance and low power. I measured about 55Watts on desktop with Intel 530 SSD, 4GB RAM, Intel i3-4330, MSI H87M G43, with 15\" Philips LCD",
      "rating": 5.0,
      "verified": true,
      "author": "ibnu harjanto",
      "helpful_votes": 4,
      "publication_date": 20131231
    },
    {
      "title": "While I wished I could have afforded to purchase a ...",
      "text": "While I wished I could have afforded to purchase a larger one, I'm very impressed with this. It delivers everything it says it can. Strong and very speedy!",
      "rating": 4.0,
      "verified": true,
      "author": "Bud",
      "helpful_votes": 0,
      "publication_date": 20160403
    },
    {
      "title": "Great Processor!",
      "text": "This is a great processor and is definitely a step up from my old AMD CPU. I paired it with a Gigabyte GA-H81M motherboard, 8GB Kingston HyperX FURY RAM and an EVGA 430W PSU. So far it has exceeded expectations.",
      "rating": 5.0,
      "verified": true,
      "author": "Gage",
      "helpful_votes": 0,
      "publication_date": 20151120
    },
    {
      "title": "May not be the best value.",
      "text": "This is a good CPU but you may find the i3-4360 is available for a lower price.",
      "rating": 4.0,
      "verified": true,
      "author": "mit_banana",
      "helpful_votes": 0,
      "publication_date": 20141217
    },
    {
      "title": "faster than my \"old\" Core i5",
      "text": "Very good performance for the money, runs cool with my Noctua heat sink installed. I don't see the need for a faster processor for everyday computing, office work and surfing.",
      "rating": 5.0,
      "verified": true,
      "author": "In His Name",
      "helpful_votes": 2,
      "publication_date": 20140424
    },
    {
      "title": "Great gaming CPU",
      "text": "Got this CPU to power an eventual Steam Machine, but right now I have it doing work for a Windows 8.1 SFF gaming computer. Paired it with 8GB of DDR3 1600 RAM, a Radeon 7850 2GB OC, and an H61 based mITX mainboard. Currently averages around 150-200+ fps in CSGO at 1080p max settings and ~60-100 fps in BF4 at 1080p medium/high mixed settings. All in all, the entire build cost me about $400 or so to put together. Very happy with the price/performance ratio.",
      "rating": 5.0,
      "verified": true,
      "author": "Tim G.",
      "helpful_votes": 3,
      "publication_date": 20140503
    },
    {
      "title": "My best investment",
      "text": "I make some online reviews on uP performance from several brands and references, comparing cost/profit rate, I found this was one with the higher rate due to its lower price and HT capability. It has great performance, I work with rendering and 3D modeling.",
      "rating": 5.0,
      "verified": true,
      "author": "AlexCumbal",
      "helpful_votes": 0,
      "publication_date": 20140508
    },
    {
      "title": "Well worth every penny.",
      "text": "I used this CPU on a budget pc, and it turned out to perform a lot better than I expected.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel",
      "helpful_votes": 0,
      "publication_date": 20140312
    },
    {
      "title": "Five Stars",
      "text": "Powerful enough for my needs, does what it's supposed to do, and doesn't use too much energy.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew",
      "helpful_votes": 0,
      "publication_date": 20150215
    },
    {
      "title": "Works Great",
      "text": "Not much to say, this is an excellent processor for the price. It's fast and runs cool with stock fan. I have not complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Erik",
      "helpful_votes": 0,
      "publication_date": 20140206
    },
    {
      "title": "Surpassed my expectations",
      "text": "I was trying to decide whether I would go with a slower 4 core or a faster two core. This processor surprised me, I thought it would be a dog, slow as molasses. Compared to my other systems, which are high end i7s, this is definitely not as fast, but it's not embarrassingly slow either. Would I put this in my high end gaming rig? No way. Would I put this in an everyday pc for light/casual gaming and movie watching, web surfing? Absolutely.",
      "rating": 4.0,
      "verified": true,
      "author": "Amerikagin",
      "helpful_votes": 0,
      "publication_date": 20140708
    },
    {
      "title": "Great processor for my build.",
      "text": "Great Price for Intel and the product is everything that I expected it would be. Very happy and would recommend this to anyone who is looking to build a PC in the $500-600 price range.",
      "rating": 5.0,
      "verified": true,
      "author": "shayann",
      "helpful_votes": 0,
      "publication_date": 20140507
    },
    {
      "title": "Perfect",
      "text": "Enough power for me, an entertainment user. My new computer runs really fast with this high end i3 processor. Love Intel processors.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarasota Man",
      "helpful_votes": 0,
      "publication_date": 20140310
    },
    {
      "title": "Solid CPU",
      "text": "Using this in a HTPC running Ubuntu 15.04. Right now it's just handing video playback and ripping my DVD and Bluray collection to digital formats. Performance is great so far, and it's not putting off to much heat even when under a heavy load. The head sync fan is inaudible so it doesn't disrupt the movie experience at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc",
      "helpful_votes": 0,
      "publication_date": 20150511
    },
    {
      "title": "Work fine",
      "text": "Get's the job done, it is what it is. Not the fastest processor, but works as expected. I havent use the Intel 4600 GPU",
      "rating": 5.0,
      "verified": true,
      "author": "jpenguin",
      "helpful_votes": 0,
      "publication_date": 20140309
    },
    {
      "title": "Five Stars",
      "text": "works as expected... bits and bytes all about really quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "buyer",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "STOLEN BEFORE PACKAGED",
      "text": "Processor arrived on time just as expected but when i went to open it. It appeared to be stolen. THANKS THIS WAS A LITTLE GIRLS X-MAS PRESENT.",
      "rating": 1.0,
      "verified": true,
      "author": "white",
      "helpful_votes": 0,
      "publication_date": 20151218
    },
    {
      "title": "Perfect for a family computer or media center",
      "text": "I bought this to build for my family and uncle's mini PC. It works incredibly well for basic tasks, up to basic video conversions and light gaming. (Converting videos to iPod/iphone and League of legends.) If you are looking for a family rig, this is the best CPU for the price. If you are also looking to make a hackintosh, this works with the Mac OSX system.",
      "rating": 5.0,
      "verified": false,
      "author": "Caohu09",
      "helpful_votes": 0,
      "publication_date": 20140312
    }
  ],
  "product_meta": {
    "title": "Intel BX80646I34330 - Core i3 (4330) 3.5GHz Processor 4MB L3 Cache 54W (Boxed)",
    "description": "Installed Size:4 MB, Max Dynamic Frequency:1.15 GHz, Base Frequency:1 GHz, Type:Intel HD Graphics 4600, Package Type:Intel Boxed, Compliant Standards:Halogen-free, Processor Qty:1, Cache Memory Details:L3 - 4 MB, Cache:4 MB, Type / Form Factor:Intel Core i3 4330 (4th Gen), Compatible Processor Socket:LGA1150 Socket, Number of Cores:Dual-Core, Number of Threads:4 threads, Clock Speed:3.5 GHz, Architecture Features:Enhanced SpeedStep technology, Hyper-Threading Technology, Execute Disable Bit capability, Intel Virtualization Technology, Intel 64 Technology, Thermal Design Power:54 W",
    "rating": 4,
    "feature_bullets": [
      "Product Type:Processor"
    ],
    "specifications": {
      "Brand": "Intel",
      "Product Dimensions": "11.68 x 11.18 x 8.13 cm; 294.84 Grams",
      "Item model number": "BX80646I34330",
      "Manufacturer": "Intel",
      "Series": "I3-4330",
      "Processor Type": "Core i3",
      "Processor Speed": "3.5 GHz",
      "Processor Socket": "Socket H3",
      "Processor Count": "2",
      "Wattage": "65 watts",
      "Are Batteries Included": "No",
      "Item Weight": "295 g",
      "ASIN": "B00EUUN76U",
      "Customer Reviews": "4.0 out of 5 stars54 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "681,298 in Computers & Accessories",
      "Date First Available": "24 Sept. 2013"
    },
    "categories": [
      "Computers & Accessories",
      "Components & Replacement Parts",
      "CPUs"
    ],
    "price": ""
  }
}