{
  "website_summaries": [
    {
      "verdict": "The Olympus M.Zuiko Digital ED 12-40mm f2.8 PRO lens lives up to its moniker, delivering professional results when paired with a Micro Four Thirds camera.",
      "pros": [
        "Maximum f/2.8 aperture throughout zoom range",
        "Very sharp from edge to edge",
        "Focus clutch system",
        "Protected from dust, splashes, and cold temperatures",
        "Minimal distortion"
      ],
      "cons": [
        "Expensive",
        "Lacks optical image stabilization"
      ],
      "aspects": {},
      "publication_date": 20130925,
      "rating": 9.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great Lens.",
      "text": "This is another amazing lens from Olympus. I have the 40-150 f2.8 and this is every bit as good, it's become my walkabout lens. Sharp even wide open at 12mm. I bought mine through Amazon from Camarthan Cameras, it was split from a kit so sold as second hand, having checked with the supplier they are unused, it just that you don't get the box(unless it's a brownie I don't take pictures with the box!). This made the lens over £200 cheaper. I registered the lens on the Olympus site and they confirmed the warranty plus their usual 6 month extension. Highly recommend Camarthan Cameras great to deal with and friendly on the phone.",
      "rating": 5.0,
      "verified": true,
      "author": "K4Cam",
      "helpful_votes": 9,
      "publication_date": 20151108
    },
    {
      "title": "Best Lense I Ever Owned",
      "text": "The best lens I've ever owned. Clear, sharp, good contrast, good colour tones, good focusing. Looks like quality, works like quality, feels like quality... robust, solid, smooth action. Does perfect landscapes, does perfect macros, and portraits, and anything inbetween.... and is as good as any prime lens of any genre I've ever owned. I sold four lenses to buy this, and it was worth it...because this is so good I now don't need those 4 lenses...and that's all that matters!",
      "rating": 5.0,
      "verified": true,
      "author": "JoGo",
      "helpful_votes": 6,
      "publication_date": 20160407
    },
    {
      "title": "Really Cracking Lens",
      "text": "Terrific build quality not too. Heavy and equal ale to o a 24-80mm lens on a non 4/3system/ . Large consistent aperture F2.8 over entire range making it super versatile in most light conditions",
      "rating": 5.0,
      "verified": true,
      "author": "Tim Moore",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "As good as it should be",
      "text": "A solid lump of a lens but still lighter and much more compact than a full frame equivalent. As a Garden Photographer I find the focal length range and the closest focus ideal. My old Canon lenses don't focus quite close enough for plant portrait work and close ups but this lens does it well. I'm using it on an OMD-M5 to good effect no doubt the EM1 would make even more of it's capabilities.",
      "rating": 5.0,
      "verified": true,
      "author": "Bosky Badger",
      "helpful_votes": 7,
      "publication_date": 20140410
    },
    {
      "title": "Absolutely great all rounder.",
      "text": "I bought this after using a Canon lens and the GH5 Panasonic zooms on my GH5. A friend had one and loved the work he was doing so bought my own. It is a great lens. It is now pretty much permanently attached to the GH5. It just works, has a very nice look to it. Very little distortion and lovely and sharp, when I manage to get it in focus.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Sunderland",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "The image quality is great and the focus ring is fantastic",
      "text": "The image quality is great and the focus ring is fantastic, as you can change easily between manual and auto focus. So if you're trying to take a macro picture and focus goes to infinity, you just pull focus back to a near point and auto focus finds the focus point nearby.",
      "rating": 5.0,
      "verified": true,
      "author": "Gilbert Kuhnert",
      "helpful_votes": 6,
      "publication_date": 20170325
    },
    {
      "title": "Delivers everything I wanted",
      "text": "My first Olympus PRO lens and it delivers well. It gives just that little extra wide angle from the kit lens on my EM-10 MkII with a satisfying weight, fast auto focus (manual focussing is just a slide of the focus ring away if you wished), firm but not over-tight action on the zoom and it has proved useful in lower light situations whilst taking church interior shots. As a novice it feels well balanced too and came supplied with lens hood and pouch. True, I could have purchased two lesser lenses for the price but I've ended up with a great all-rounder and feel confident in saving for the 40-150mm PRO lens.",
      "rating": 5.0,
      "verified": true,
      "author": "badger_beard",
      "helpful_votes": 0,
      "publication_date": 20170122
    },
    {
      "title": "***** Very well built and sturdy, although it is quite heavy",
      "text": "BUILD:***** Very well built and sturdy, although it is quite heavy. The zooming ring is still and overall, this is a lens that feels like it will last 100 years or more. PHOTO QUALITY:***** The quality of pictures in good light conditions is exceptional with sharpness form corner to corner, and even in low light, the sharpness remains good.",
      "rating": 5.0,
      "verified": true,
      "author": "MAX_909",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Better than the Panasonic",
      "text": "The fact it is a focus ring that is not continually going around like the panasonic ones.",
      "rating": 5.0,
      "verified": true,
      "author": "kevin billington",
      "helpful_votes": 0,
      "publication_date": 20200720
    },
    {
      "title": "Excellent lens",
      "text": "Excellent micro four thirds lens,build quality is of the highest",
      "rating": 5.0,
      "verified": true,
      "author": "dave",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Review of Olympus M.ZUIKO DIGITAL ED 12-40mm 1:2.8 PRO Lens for Micro Four Thirds cameras",
      "text": "Everyone seems to wax lyrical about how good this lens is... I was dubious, but I was wrong, it is everything they say about it. I would have preferred it to be 12-50mm but that is being picky!",
      "rating": 5.0,
      "verified": true,
      "author": "Martin. B. Hollands",
      "helpful_votes": 3,
      "publication_date": 20140705
    },
    {
      "title": "Amazing lens, so clear and at a great price",
      "text": "Amazing lens, so clear and at a great price. Would highly recommend this over a kit lens as a first lens.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180514
    },
    {
      "title": "Only used once so far but results have been excellent, crisp and clear - it does add a ...",
      "text": "Only used once so far but results have been excellent, crisp and clear - it does add a little weight versus some of the other lens but image quality I think will make up especially low light - well built lens",
      "rating": 5.0,
      "verified": true,
      "author": "Winnola",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "Olympus M.ZUIKO DIGITAL ED 12-40 mm 1:2.8 PRO...",
      "text": "Lovey lens. ! get good photo's using it but quite a handful of lens.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Scott",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "One of the best lenses I have ever owned",
      "text": "One of the best lenses I have ever owned. I came from Canon EOS system to the mirrors system with Olympus OMD-EM5. Totally amazing. This lens just caps it off.",
      "rating": 5.0,
      "verified": true,
      "author": "John Halvorsen",
      "helpful_votes": 3,
      "publication_date": 20141108
    },
    {
      "title": "Raid your piggy bank for this one.",
      "text": "A well made lens, feels solid and is a joy to use, can easily be the all day lens.",
      "rating": 5.0,
      "verified": true,
      "author": "John Wishart",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "so I will keep it short \" Fantastic\" \"Superb\" \"Wow\" PS I like it!",
      "text": "Only had it 5 days. so I will keep it short \" Fantastic\" \"Superb\" \"Wow\" PS I like it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "My favourite lens for M1",
      "text": "This is the lens I always have on my M1.",
      "rating": 5.0,
      "verified": true,
      "author": "gareth",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Five Stars",
      "text": "A gem of a lens. Very sharp across the focal range. Build quality of a high standard, highly recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Kelly",
      "helpful_votes": 0,
      "publication_date": 20151216
    },
    {
      "title": "Five Stars",
      "text": "All round great lense, I use it in video production and I couldn't live without it!",
      "rating": 5.0,
      "verified": true,
      "author": "HannahG",
      "helpful_votes": 0,
      "publication_date": 20150401
    },
    {
      "title": "excellent value for money",
      "text": "A universal lens for all occasions...excellent value for money...Well manufactured, and a joy to use. Bob",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 2,
      "publication_date": 20141105
    },
    {
      "title": "I liked it BUUUUTTTT",
      "text": "the buttttt is, the zoom ring rotated the wrong way (compared to my panasonic lenses) it was pretty big and heavy, no Image stabilisation in the lens and didn't seem quite as wide at the wide end as other 12mm lenses. but the optical quality is fantastic, the focus speed great, and the DOF good for portraits at 40mm f/2.8 just a bit to big and heavy with no IS that was my problem",
      "rating": 4.0,
      "verified": true,
      "author": "dominic  bower",
      "helpful_votes": 2,
      "publication_date": 20170824
    },
    {
      "title": "Pro quality indeed",
      "text": "Bought this to go with my GH4, sacrificing lens stabilization for movies for sharpness. (The camera body stabilizes images) Fantastic lens, really sharp through all the stops (slight softening at zoom but that's being really picky) and as an incredibly virtually distortion free lens works great as a taking lens for a SLR magic Anamorphot (from about 18mm onwards- vignettes before then) The wide angle is great (24mm @ 35mm equivalent, 28mm when filming 4K on GH4) and sharp edge to edge. Peaking (guides) and auto focusing/aperture etc all still work with the GH4 (electronic zoom not applicable). Very happy with this being the ONLY lens I will need. Pro quality indeed.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Harrison",
      "helpful_votes": 2,
      "publication_date": 20140908
    },
    {
      "title": "It's all good.",
      "text": "So far, it's all great. Have now registered it with Olympus ok, Came with lens hood.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161208
    },
    {
      "title": "Four Stars",
      "text": "Great quality lens for use with micro four thirds cameras.",
      "rating": 4.0,
      "verified": true,
      "author": "TJ",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Top of the Line",
      "text": "These Pro lenses seem very well constructed. So far I have only reviewed the photos on the computer, but they look excellent. One odd thing is that when zooming wide at about 16mm the lens barrel is fully retracted and moves out a little when zoomed to 14 and then 12mm.",
      "rating": 5.0,
      "verified": true,
      "author": "John A.",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "This really is the game changer - if you've been ...",
      "text": "This really is the game changer - if you've been used to the standard bundled lens on an Pen, or the 12-50mm - prepare for a marked step up in IQ!",
      "rating": 5.0,
      "verified": false,
      "author": "Mirrorless Ambassador",
      "helpful_votes": 0,
      "publication_date": 20150918
    },
    {
      "title": "My shots of my family using this lens made me fall in love with it",
      "text": "Wow. My shots of my family using this lens made me fall in love with it. Its worth every penny.",
      "rating": 5.0,
      "verified": false,
      "author": "Mr. Scott Gilbert",
      "helpful_votes": 6,
      "publication_date": 20141214
    },
    {
      "title": "Everything about it is awesome. Buy it",
      "text": "Using this lens with a new em-5 has got me buzzed about photography after a too-long hiatus. Everything about it is awesome. Buy it.",
      "rating": 5.0,
      "verified": false,
      "author": "A. Dobson",
      "helpful_votes": 0,
      "publication_date": 20140921
    }
  ],
  "product_meta": {
    "title": "Olympus M.Zuiko Digital ED 12-40 mm F2.8 PRO Lens, Universal Zoom, Suitable for All MFT Cameras (Olympus OM-D & PEN Models, Panasonic G-Series), Black",
    "description": "Colour Name:Black| Style Name:12-40mm 1:2.8 PRO LensThe robust construction of the M.Zuiko Digital ED 12-40 mm F2.8 PRO lens meets even the highest demands of professional photographers, especially when you add the compact, lightweight design. The fast continuous aperture of 2.8 at all focal lengths, combined with enhanced technology, ensures superb image composition in a wide range of photographic styles, no matter what the lighting conditions or distance.\n\nBOX CONTAINS\nOlympus M.ZUIKO DIGITAL ED 12-40mm 1:2.8 PRO lens\nLC-62D lens cap\nLH-66 lens hood\nLSC-0918 lens case\nWarranty Card",
    "rating": 4.6,
    "feature_bullets": [
      "Ideally suited for: Landscape, travel, nature, low-light, architecture and portrait - equivalent to a 24-80 mm 35 mm lens",
      "Highly powerful zoom lens with highest optical performance thanks to a constant speed of F2.8",
      "Sliding focus ring allows quick change between autofocus and manual focus",
      "Thanks to its dust- and splash-proof as well as frost-proof construction, the lens defies all weather conditions and delivers uncompromising results even in difficult conditions",
      "Outstanding image quality, despite very compact design with pin-sharp images right up to the edges of the image",
      "Ideal processing and high quality metal bayonet"
    ],
    "specifications": {
      "Item Package Dimensions L x W x H": "20.2 x 12.2 x 11.6 centimetres",
      "Package Weight": "0.7 Kilograms",
      "Item Dimensions L x W x H": "8.4 x 7 x 7 centimetres",
      "Item Weight": "382 Grams",
      "Brand": "Olympus",
      "Colour": "Black",
      "Country of Origin": "China",
      "Has Image Stabilization": "No",
      "Included Components": "Olympus M.ZUIKO DIGITAL ED 12-40mm 1:2.8 PRO lens, LC-62D lens cap, LH-66 lens hood, LSC-0918 lens case, Warranty Card",
      "Max Focal Length": "40 Millimetres",
      "Min Focal Length": "12 Millimetres",
      "Min Shutter Speed": "NA seconds",
      "Model Year": "2013",
      "Plug Profile": "Micro Four Thirds",
      "Objective Lens Diameter": "40 Millimetres",
      "Part number": "EZ-M1240",
      "Focus type": "Manual Focus",
      "Style": "12-40mm 1:2.8 PRO Lens",
      "Photo Filter Thread Size": "62 Millimetres",
      "ASIN": "B00EY6AV50",
      "Item model number": "EZ-M1240",
      "Batteries": "1 Lithium ion batteries required.",
      "Date First Available": "10 Sept. 2013",
      "Customer Reviews": "4.6 out of 5 stars342 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "43,923 in Electronics & Photo"
    },
    "categories": [
      "Electronics & Photo",
      "Camera & Photo",
      "Camera Lenses",
      "Lenses"
    ],
    "price": 1012.76
  }
}