{
  "website_summaries": [
    {
      "verdict": "An inexpensive option for JBL headphones.",
      "pros": [
        "A comfortable option as far as in-ear headphones go",
        "The cable is durable, and these feature a built-in microphone so you can transition from music to talking on the phone",
        "Many customers found the sound quality to be excellent for such a tiny pair of headphones"
      ],
      "cons": [
        "The volume control can be inconsistent, and these are on the quieter side"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "JBL for me",
      "text": "I'm getting older and I can't stand so lots of mid and highs. I'm finding JBL is more suited to my ear now than when I was younger. These do try to slide out occasionally. I used the largest rubber pad and the sound improved greatly. I mow with these on and they work good. Microphone seems to work well also. For the price I thought it was a good deal. I'm happy with them.",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn Boy",
      "helpful_votes": 6,
      "publication_date": 20170823
    },
    {
      "title": "Price is right for the Sound!",
      "text": "Love these headphones, they play like a pair of $100 dollar ear buds but cost 1/3. Buy them while you can. I have lost my last two pair by accident. I keep coming back to buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew R.",
      "helpful_votes": 6,
      "publication_date": 20171101
    },
    {
      "title": "I love em",
      "text": "I got these after they were discontinued for half as rice and say they are a nice pair for I think I paid 22 dollars. I hear people complaining about won't stay in your ears even tho it comes with multiple size plugs. I can use any size and it never matters for me. I think some people just love to complain or they paid full price and expected more or something witch I would understand but at this price scoop em up because they are worth it sound quality wise.",
      "rating": 5.0,
      "verified": true,
      "author": "Walter Allen",
      "helpful_votes": 4,
      "publication_date": 20170213
    },
    {
      "title": "Came broken",
      "text": "I bought these new to use with my iPhone 10R and they haven't worked correctly for one day. If the chord moves even a little bit it will either pause, play, rewind or skip to a new song, podcast or video. It has also started calling contacts in my phone randomly when they are plugged in. When I'm walking I can't go more than two seconds with one of these issues happening. The headphone cable is way too thick making the cable heavy and the earbuds will fall out of constantly. Do not buy these headphones.",
      "rating": 1.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20191021
    },
    {
      "title": "Great quality.. durable and good price",
      "text": "You cannot go wrong with JBL..by Hardon Great quality and sound...very comfortable they used to retail for 40 when they came out... they are a very good value at 20. New model might be 10% better but it’s 30 more.. for listening to your phone and making calls they are great cables are very durable... bought one and now just bought another since I’m so pleased with themson (my son uses the first pair)",
      "rating": 5.0,
      "verified": true,
      "author": "Gabriel Areas",
      "helpful_votes": 0,
      "publication_date": 20201022
    },
    {
      "title": "Sound's ok, fit is bad",
      "text": "The sound on these is fine, and the microphone works well. However the buds fall out of my ear very easily, more so than any other pair of headphones I've ever used. Running is almost impossible, even walking isn't great. They're fine but I'd recommend looking elsewhere.",
      "rating": 3.0,
      "verified": true,
      "author": "Jake Sheehy",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Good Purchase for the Price",
      "text": "Just received these and plugged them into my iPhone. With some EQ adjustments in the phone these sound great. I am replacing a set of cheaper Sony buds ($15-20) with these JBL's and they sounds a little better. The bass is more than adequate, and the highs and lows are clear. Not much else to say, I am happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas F.",
      "helpful_votes": 4,
      "publication_date": 20170618
    },
    {
      "title": "Win win deal and great sound and bass that's not over powerful but just right!",
      "text": "Sounds great fits good if you change too your size and working out I would go wireless but JBL is always been good stuff since I was younger than a grasshopper so a must buy if you need a good sound and a great price so a win win....",
      "rating": 5.0,
      "verified": true,
      "author": "Roscoe Jackson",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Great pair of headphones",
      "text": "I love the fact that I can put these in my pocket at work and won't have a problem of them coming out in a knot. I love that they are long and I can easily put my phone in my pocket and not worry about the plug disconnecting if I turn a certain way.",
      "rating": 5.0,
      "verified": true,
      "author": "Armando Perez",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great value!",
      "text": "Bought it for someone and they love the build quality and sound. Two things that you need in an earphone, really. Don’t waste your money on expensive Apple product and get this awesome alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "Ear buds sound amazing, but rubber part too thin of material",
      "text": "Wow, for the price these are a no brainer. I hear things in songs that I have never heard before. I sit in a cubical all day at work and even at low volume the sound is incredible. The one drawback is the rubber ear buds are too thin and sound escapes. I took the rubber off my old pair of Sony and the fit is perfect.",
      "rating": 4.0,
      "verified": true,
      "author": "Robin",
      "helpful_votes": 2,
      "publication_date": 20161018
    },
    {
      "title": "Looks great, Sound Quality is Meh....",
      "text": "There is no way that these are a 4 Star pair of Earbuds, JBL is getting their moneys worth off these things. It must've cost them(JBL) less than $5 to make to be honest. I also think the \"High-performance JBL drivers\" was just words they threw on the listing to make it attractive. They must have made good use of the prevalent Fake Reviewers on Amazon to get it to the 4 Stars it is currently sitting at. I would however recommend these from JBL: \"JBL TMG21BL Tim McGraw Artist Series Earbuds\" instead. (They cost half the price of these.)",
      "rating": 2.0,
      "verified": true,
      "author": "paul rubio",
      "helpful_votes": 0,
      "publication_date": 20171122
    },
    {
      "title": "Garbage",
      "text": "These are bottom of the drawer earbuds for emergency use only. No bass or mid bass, and worst of all, an artificial “plasticky” sound - not at all naturally musical. I find it hard to believe that anyone with minimally good hearing ability would rate these highly. Unlistenable. Not one of JBL’s better products. Skip it.",
      "rating": 1.0,
      "verified": true,
      "author": "Peter Ghitman",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "Great comfort for long-term use.",
      "text": "I have 3 members of family that work on- linecand swear by this brand and model. Outdistanced competitors in comfort and quality!",
      "rating": 5.0,
      "verified": true,
      "author": "pnick",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Five Stars",
      "text": "great earbuds for the price! nice features and sound is very good. So far a great purchase. Just bought a second pair and still very, very happy. Great customer service from 3rd party as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Anita Hanley",
      "helpful_votes": 4,
      "publication_date": 20161108
    },
    {
      "title": "Less than stellar.",
      "text": "Sound quality is subpar, and hurting for bass. They work, and will meet what I want out of them: which is just to play music while I'm sitting on the bus, but for a JBL product? Does not meet my expectations.",
      "rating": 3.0,
      "verified": true,
      "author": "D.A. Stephens",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "not at all durable",
      "text": "purchased this product on August 6th and have been taking great care of them since then. however, 6 weeks later after only using them during my train commute to and from work, the left headphone is damaged on the interior and gives that all-too-familiar sound of vibrations from the broken plastic inside. i had high hopes for these headphones but they let me down way too quickly.",
      "rating": 1.0,
      "verified": true,
      "author": "Alejandro",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Sturdy wires!",
      "text": "The wires are super brawny and not prone to breaking like thinner wires. While a bit heavier, it makes this a good choice for working out and exercising. i use them while solo mountain biking. (Never on the road!)",
      "rating": 5.0,
      "verified": true,
      "author": "History Nut",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "They're Just Okay",
      "text": "JBL has made better. These are on the affordable end for everyone to own. But they're okay for my work outs.",
      "rating": 4.0,
      "verified": true,
      "author": "Val",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Better than expected.",
      "text": "Sounds great, really lengthy and isolates most of the noise around you. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Stase",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Not worth the money even at a heavily reduced price.",
      "text": "They fall out a lot when running. The cord material is a flat finish, so it grabs your clothing. The sound quality is average at best.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Ruegg",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "Great",
      "text": "Amazing earphones. I got this for 9.99USD. Really recommend those earphone. You won't regret it. And it has amazing bass and sound quality.",
      "rating": 5.0,
      "verified": true,
      "author": "vincent",
      "helpful_votes": 3,
      "publication_date": 20160627
    },
    {
      "title": "Good Sound",
      "text": "This is my second pair and the sound is great. Rich base as well. I use them for working out and they're more than adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "P.M.D.",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Good for the price but need after market ear plugs",
      "text": "Moderate sound quality with base, cord is extremely durable with moderate weight, but the ear plugs for the drivers are pretty bad. They have little padding, when you put the ear piece in, you feel the plastic digging in through the ear plugs. Changing the inbox ear plug sizes has no effect for this problem. Thus, it can be rather uncomfortable. I have not owned these for long enough to comment on build quality. I do recommend these ear phones IF you buy or use after market ear plugs.",
      "rating": 3.0,
      "verified": true,
      "author": "Ignatius Varghese",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "So pretty they called attention.",
      "text": "They are cool. I could not use them much, because someone stole them. But I guess that it's because they look awesome. He he he.",
      "rating": 4.0,
      "verified": true,
      "author": "Rafael Gonzalez Jr.",
      "helpful_votes": 0,
      "publication_date": 20180728
    },
    {
      "title": "No",
      "text": "But the other model. This will suction your ear drums. Don’t buy it. Their other models are better.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Cyrus",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "Great set of ear phones",
      "text": "Great pair of ear buds indeed especially for the money I paid for them and they were name brand JBL's.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Knight",
      "helpful_votes": 0,
      "publication_date": 20200804
    },
    {
      "title": "This is the one you want",
      "text": "You won't find any other set of ear buds with this much quality for less than $25. Everything from the sound to the microphone works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Martin",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Love the way it sound clear with the right amount of bass",
      "text": "Love the sound and trouble is trying to get the left side to stay in while on the trademill",
      "rating": 4.0,
      "verified": true,
      "author": "Jalina Jay Cortes",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Five Stars",
      "text": "IMPRESSIVE SOUND for the price of a regular pair of headphones!!",
      "rating": 5.0,
      "verified": true,
      "author": "Juan STARCENBAUM",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "The Worst",
      "text": "The cable is toooooooo long, U will be standing the cable will be touching your knees while the headphones are literally in your ears, the headphones themselves are so uncomfortable. Worst headphones ever.",
      "rating": 1.0,
      "verified": true,
      "author": "AbduAllah Rifai",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Disappointed..",
      "text": "I am actually disappointed.. poor quality. I think there are better quality headphones that are the same price out there..",
      "rating": 3.0,
      "verified": true,
      "author": "Fernandomontijo81",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "Great quality for a great price!",
      "text": "Only issue was with the sizing of the buds. Medium was a bit small, while large was a bit big... but that's not the brand's fault. Amazing sound, love the material and such a great price",
      "rating": 5.0,
      "verified": true,
      "author": "Trevor",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Sound is good, mic isn’t",
      "text": "Sound quality is good. The mic though doesn’t work properly. Whenever I’m on the phone wearing those headphones the other person can barely hear me, my voice is too low.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielcm",
      "helpful_votes": 0,
      "publication_date": 20191118
    },
    {
      "title": "Perfect headphones!",
      "text": "Are prefect for everything you want to do, either if it's workout or just listening to some good music without being disturbed by outside noise. The sound quality it's amazing, you feel like being in a club.",
      "rating": 5.0,
      "verified": true,
      "author": "Constantin Sitaru",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Comfortable and sound great for the money",
      "text": "Comfortable and sound great for the money. Use them almost every day for hours. Even in the rain. I'm on my second set. I broke my last ones by accidentally cutting the cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesse",
      "helpful_votes": 2,
      "publication_date": 20160820
    },
    {
      "title": "Don't get",
      "text": "Did not stay in my ear, i tried all the different size ear pieces and none of them worked. I got some skull candy headphonrs that are way better.",
      "rating": 1.0,
      "verified": true,
      "author": "Nicole R",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Would buy again",
      "text": "I LIKE how these stay in my ear and are comfortable. Good buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvette Marie",
      "helpful_votes": 0,
      "publication_date": 20200303
    },
    {
      "title": "Average",
      "text": "Fit is not good enough. Even trying all the tip sizes. And the cables are too wide, heavy and sticky. The sound quality is good, but not good enough. Bought mine to replace my old AKG K321, but I'll keep using the old ones for a great while longer...",
      "rating": 3.0,
      "verified": true,
      "author": "Leonardo Spínola C V L Pinto",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "Great quality for the price",
      "text": "Sound is great. Didn’t have to use attachments to fit ear. Sound quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry B Blackburn",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Decent Value",
      "text": "Not much base. I guess this is about as much sound as you can expect at this price point from in ear headphones.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon Hall",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Awesome...",
      "text": "I was a little bit surprised by these. They are awesome. Sound quality and functionality are off the charts... Thank you...",
      "rating": 5.0,
      "verified": true,
      "author": "Jay B.",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Four Stars",
      "text": "Amazing sound, not as comfortable as they look despite changing pods.",
      "rating": 4.0,
      "verified": true,
      "author": "Jose Prado",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Great soind quality for the price, bad comfort",
      "text": "Sound quality is great for the money, but comfort is worse than JBL's T-290. I had to borrow a pair of my T-290's silicon rubbers in order get better comfort from J-22a.",
      "rating": 3.0,
      "verified": true,
      "author": "Guilherme jaime",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Not worth it",
      "text": "Hands down the best earbuds for the price.. great bass. UPDATE: Stopped working after a few weeks out of no wear.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert C",
      "helpful_votes": 4,
      "publication_date": 20161125
    },
    {
      "title": "These work great and very sturdy",
      "text": "These work great and very sturdy. I go thru atleast a pair of ear buds a month. Even the Apple ones dont last long with me. But these have stood up to my abuse and are still like new.",
      "rating": 5.0,
      "verified": true,
      "author": "PJHAM ",
      "helpful_votes": 0,
      "publication_date": 20160315
    },
    {
      "title": "very disappointed",
      "text": "I bought it for the promised sound (great bass and all), but I cannot always hear it. Sometimes it's there, sometimes it's not. Also, they plugs keep falling out of my ears, never had that happen before.... very disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "Chana Shaked",
      "helpful_votes": 0,
      "publication_date": 20180220
    },
    {
      "title": "Impressive",
      "text": "Fast delivery and amazing quality for the price. I was impressed so I went ahead and bought 3 more for my kids",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191108
    },
    {
      "title": "they lasted only 3 months",
      "text": "3 months of use and gone. One of the earbuds stopped working",
      "rating": 1.0,
      "verified": true,
      "author": "Jhovanie Álvarez",
      "helpful_votes": 0,
      "publication_date": 20170704
    },
    {
      "title": "Worth every penny. Very good sound for very little money.",
      "text": "Actually a great buy, rubber doesn't stay in my ears very well though even with the smallest ones. Sound quality is exceptional for the money.",
      "rating": 4.0,
      "verified": true,
      "author": "Luke",
      "helpful_votes": 0,
      "publication_date": 20161112
    },
    {
      "title": "Best Performance for this Price",
      "text": "This product is worth every penny, very good cost benefit",
      "rating": 5.0,
      "verified": true,
      "author": "Paulo Eduardo Ferreira",
      "helpful_votes": 0,
      "publication_date": 20200309
    },
    {
      "title": "Amazing",
      "text": "Quality for your money. Sound is amazing and it is comfortable in the ear. Mic is awesome",
      "rating": 5.0,
      "verified": true,
      "author": "Barthlo Klopper",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "Compatible with most devices except iPhone",
      "text": "I use them for work, phone calls, listen to music, best investment I made",
      "rating": 5.0,
      "verified": true,
      "author": "Vincent",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "The Perfect headphones",
      "text": "Excellent headphones , sound quality is an A+ , 1/10th the price of beats !! JBL makes the pros concert speakers , so they know how to make good quality headphones , happy customer here !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Ben S ",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Great buds",
      "text": "Awesome set of buds for the money, got to use with my ps4 and work great",
      "rating": 5.0,
      "verified": true,
      "author": "Greg b",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Two Stars",
      "text": "didn't work nearly as expected from a name brand of jbl",
      "rating": 2.0,
      "verified": true,
      "author": "Kj",
      "helpful_votes": 0,
      "publication_date": 20160921
    },
    {
      "title": "Five Stars",
      "text": "Amazing product, purchased second time after I lost the first ones.",
      "rating": 5.0,
      "verified": true,
      "author": "gogo",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "This is an excellent, cost effective and durable headset",
      "text": "Bought many units for kids. This is an excellent, cost effective and durable headset.",
      "rating": 5.0,
      "verified": true,
      "author": "Tomgadgets",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "5 star",
      "text": "Been using them for months didnt know they came with a little bag for caring.",
      "rating": 5.0,
      "verified": true,
      "author": "Jalenhndz",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Sound was good but there was not alot of volume",
      "text": "Sound was good but there was not alot of volume. I had some off brand that was louder than these and there sound was just as good. They were cheaper too. These were not what i expected from a jbl brand.",
      "rating": 1.0,
      "verified": true,
      "author": "gabriel flores",
      "helpful_votes": 0,
      "publication_date": 20180128
    },
    {
      "title": "I love JBL",
      "text": "I love JBL! They have great sound quality, bass, and comfort! I’ve been using them for years! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Breaks quickly",
      "text": "Left earbud stopped working after 2 months of light use.",
      "rating": 1.0,
      "verified": true,
      "author": "Neo Cortex",
      "helpful_votes": 0,
      "publication_date": 20191201
    },
    {
      "title": "POPLiFE",
      "text": "Great quality sound.. if levels are properly set they sound stupid amazing..",
      "rating": 5.0,
      "verified": true,
      "author": "Saint Eliabithicus",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Great for calls not for music",
      "text": "I picked it up for taking calls and from that aspect it is fine. Sound quality is okay but not great.",
      "rating": 3.0,
      "verified": true,
      "author": "Tanaya",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "nice",
      "text": "They work so well and I can hear them so clearly it is amazing thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Devonne N Hill",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "okay",
      "text": "Not quite as hearty as when I ordered last time. It seems flimsier.",
      "rating": 3.0,
      "verified": true,
      "author": "Fanman",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Perfect headphones for the price 👍👍",
      "text": "Excellent headphones, JBL quality for a greay price. Already recommended to a couple people and will probably be getting a new pair soon although the ones i have work perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Rob II",
      "helpful_votes": 0,
      "publication_date": 20160914
    },
    {
      "title": "Kinda pricy",
      "text": "Ear buds are either too big or too small. It won't fit my ears and stay on",
      "rating": 1.0,
      "verified": true,
      "author": "ANGEL ",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "I'm extremely satisfied With my purchase of my JBL J22a headphones",
      "text": "I'm extremely satisfied With my purchase of my JBL J22a headphones. I want to purchase another pair jus in case these get damage or lost",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny Gilliam",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Don't last",
      "text": "Only lasted a month before one of the ear phones stopped working",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Not that good.",
      "text": "Sounds are not that good, okay I think. Not recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "von khom",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Great sound sleek look",
      "text": "Great sound sleek look. They are just a little heavy. But it's the flat cord. So you either have a little weight or have a pair that tangles. That's why we went with these. I recommend these",
      "rating": 4.0,
      "verified": true,
      "author": "kpeterson",
      "helpful_votes": 0,
      "publication_date": 20160112
    },
    {
      "title": "Don't have much to say",
      "text": "It's pretty nice. My only problem is it keeps falling out.",
      "rating": 5.0,
      "verified": true,
      "author": "Amelia",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Good fit and sound",
      "text": "Very good speakers, especially for the price. They fit well and have good sound quality (for me, a non-audiophile). I use them to bike with and they do a good job cutting out the wind noise. I'm happy with them, and would purchase them again.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Christenson",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "Poor quality of construction",
      "text": "The ear bud separated from the the plastic gauge on the back side",
      "rating": 1.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "good value for money i couldn't use them in my ...",
      "text": "does it's job. good value for money i couldn't use them in my pc :(",
      "rating": 3.0,
      "verified": true,
      "author": "Miguel Costa",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "Brilliant",
      "text": "Fantastic buds for the dosh,can’t fault them,great depth of sound,lovely jubbley",
      "rating": 5.0,
      "verified": true,
      "author": "peter scott johnson",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Wasn't happy with this selection",
      "text": "Cheaply made and did not sound right. Wasn't happy with this selection.",
      "rating": 1.0,
      "verified": true,
      "author": "David H",
      "helpful_votes": 0,
      "publication_date": 20160918
    },
    {
      "title": "they are great.",
      "text": "If you don't mind listening without the bass, they are great.",
      "rating": 3.0,
      "verified": true,
      "author": "Daniel Ríos",
      "helpful_votes": 0,
      "publication_date": 20170112
    },
    {
      "title": "I feel like they broke quickly",
      "text": "I feel like they broke quickly. For the price they worked for as long as I needed them to. Nothing that is the sellers fault just JBL wasn't as quality as I had hoped for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Great for the price",
      "text": "It worked great I can't Complain except I lost them. I'll buy them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 3,
      "publication_date": 20160806
    },
    {
      "title": "Five Stars",
      "text": "AMAZING sound, like what I have come to expect from JBL and HK products.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160511
    },
    {
      "title": "sound amazing!! will defiantly buy more if i need",
      "text": "sound amazing!! will defiantly buy more if i need to",
      "rating": 5.0,
      "verified": true,
      "author": "Slavik",
      "helpful_votes": 0,
      "publication_date": 20160308
    },
    {
      "title": "I have tested my old headphones and they work just fine",
      "text": "Don't buy these ! Mine makes my phone acted up and the volume goes up and down , I have tested my old headphones and they work just fine",
      "rating": 1.0,
      "verified": true,
      "author": "Erick B.",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Not good",
      "text": "I did bot like it. The price is high and is not even bluetooth",
      "rating": 1.0,
      "verified": true,
      "author": "Marcela",
      "helpful_votes": 0,
      "publication_date": 20190127
    },
    {
      "title": "They suck.",
      "text": "Mic does not work well and has no volume at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Jose z.",
      "helpful_votes": 0,
      "publication_date": 20191123
    },
    {
      "title": "Five Stars",
      "text": "Extremely nice sounding headphones for a very low price. Clarity across the range rivals even my over-ear headphones.",
      "rating": 5.0,
      "verified": true,
      "author": "Ben Hill",
      "helpful_votes": 0,
      "publication_date": 20170219
    },
    {
      "title": "Five Stars",
      "text": "These are really good. I had these for about a year now and i love them. Definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "King",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "Awesome",
      "text": "Bought these used and there still kicking after 2 years great headphones",
      "rating": 5.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Does not have the quality of a JBL",
      "text": "no good fit and the sound quality is not good",
      "rating": 1.0,
      "verified": true,
      "author": "Igor Martins",
      "helpful_votes": 0,
      "publication_date": 20171116
    },
    {
      "title": "Even before I ran the JBL burn-in process they sounded wonderful. BUT this headset doesn't deliver much protection from ...",
      "text": "This is a gorgeous sounding pair of ear-buds. Even before I ran the JBL burn-in process they sounded wonderful. BUT this headset doesn't deliver much protection from the sonic environment. I took them with on the subway down to the radio station yesterday and had to turn the sound way up and clutch the earbuds to my ears to deal with train traffic and announcements. SO — top marks for fidelity, but use them in a quiet environment for full enjoyment.",
      "rating": 4.0,
      "verified": true,
      "author": "Bill McGlaughlin",
      "helpful_votes": 2,
      "publication_date": 20150326
    },
    {
      "title": "I am very satisfied with the product",
      "text": "I use these every day, I am very satisfied with the product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jaclyn Trusal",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "awesome",
      "text": "These errands are extremely awesome I ordered four of them.",
      "rating": 5.0,
      "verified": true,
      "author": "GGutz",
      "helpful_votes": 0,
      "publication_date": 20150901
    },
    {
      "title": "Good balanced sound.",
      "text": "These earbuds sound really good, they don't focus on just bass but more on balance, so you may not like these if your a bass junkie. They come with nice leather pouch and three different sizes of buds the choose from. Build quality is typical JBL so they're gonna last so long as you don't abuse them by yanking the cord or something. I can compare these to my Sol Republic Jaxs. The Jaxs are lighter in weight and sound similar. These J22's sound very similar however you get more of everything in each song. More highs, mids and lows.",
      "rating": 5.0,
      "verified": true,
      "author": "ClassicEndurance80",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Great Performance For The Money",
      "text": "I was looking for a good but inexpensive earphones and these are a great buy. Good frequency response and fidelity. The only thing I'm adding to mine are Comply foam tips and that's just a personal preference over the silicone tips that come with these. I'm already thinking I'll buy an additional pair.",
      "rating": 5.0,
      "verified": true,
      "author": "Ishopalot!",
      "helpful_votes": 4,
      "publication_date": 20160710
    },
    {
      "title": "its an ok product but not that great.. it ok to use for talking",
      "text": "its an ok product but not that great.. it ok to use for talking. not that good for hearing music.",
      "rating": 3.0,
      "verified": true,
      "author": "Sreekanth",
      "helpful_votes": 0,
      "publication_date": 20171010
    },
    {
      "title": "Sound clarity is good and the cable is of very good quality",
      "text": "Sound clarity is good and the cable is of very good quality. Only worry is the ear bud which not of highest comfort",
      "rating": 4.0,
      "verified": true,
      "author": "Rama Krishna Raju Kalidindi",
      "helpful_votes": 0,
      "publication_date": 20170811
    },
    {
      "title": "One Star",
      "text": "Horrible. The headphone completely ripped off the wire in two weeks of use.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 11,
      "publication_date": 20160807
    },
    {
      "title": "Totally recommended",
      "text": "More than pleased with the sound, materials and price (I got it for 23 us dls).",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente de Amazon",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "Epic",
      "text": "No regrets at all. Nice treble. Epic bass. Head blown.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170725
    }
  ],
  "product_meta": {
    "title": "JBL J22a BLK High Performance In Ear Headphones with Drivers and Microphone, Black (Discontinued by Manufacturer)",
    "description": "Color:Black| Style:J22AJBL J22a BLK High performance in ear wired headphones with JBL drivers and microphone, Black",
    "rating": 4.2,
    "feature_bullets": [
      "High-performance JBL drivers. Connectivity technology: Wired",
      "Universal one-button remote with built-in microphone",
      "Silicone sleeves",
      "Flat elastomer cables and rubber slider with rugged strain Relief",
      "Carry pouch"
    ],
    "specifications": {
      "Product Dimensions": "6.18 x 5.33 x 1.45 inches",
      "Item Weight": "1.58 ounces",
      "ASIN": "B00EE4DAUU",
      "Item model number": "J22a BLK",
      "Customer Reviews": "4.2 out of 5 stars456 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#2,141 in Earbud & In-Ear Headphones",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "August 14, 2013",
      "Manufacturer": "JBL"
    },
    "categories": [
      "Earbud Headphones",
      "Electronics",
      "Headphones"
    ],
    "price": 19.95
  }
}