{
  "website_summaries": [
    {
      "verdict": "In spite of a couple of missing accessories that are essential, you will not find a hydration backpack that is better suited for extended outdoor workout sessions.",
      "pros": [
        "Holds over 2 liters of water and has enough pockets for snack bars, a phone, a multitool, and other essential items",
        "It's lightweight and doesn't slosh, bounce or contribute to the dreaded \"sweaty back\" syndrome"
      ],
      "cons": [
        "There isn't a quick release valve on the water reservoir (necessary for cleaning) or a cover for the bite valve",
        "Those are both necessary accessories that don't cost a lot, but do add to the final cost of this excellent hydration backpack"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not worth the frustration",
      "text": "AMAZON AND TECH CONCEPTS CANT GET THEIR ACT TOGETHER... Tried THREE TIMES ordering this 2016 style hydration pack w/ antidote bladder #62239... Got the 2017 hydration pack delivered THREE TIMES #1120002000 w crux bladder. Unless your looking to be frustrated dont try it. Too bad, would of liked to try the 2016 Rouge which had BETTER reviews.",
      "rating": 1.0,
      "verified": true,
      "author": "razor",
      "helpful_votes": 8,
      "publication_date": 20180117
    },
    {
      "title": "So awesome!",
      "text": "For riding single track mountain bike trails, you rarely have time to grab a water bottle, unless you stop or really slow down. This eliminates that problem! 2 liters of water or whatever fluid. Also r good sized little pouches for phone, keys, wallet, food bars, etc.....",
      "rating": 5.0,
      "verified": true,
      "author": "Earle Burns",
      "helpful_votes": 32,
      "publication_date": 20140525
    },
    {
      "title": "Leaks like a Sieve",
      "text": "Product description states that this is the 2016 model with the Antidote bladder. Instead, they are shipping the 2017 model with the Crux bladder. The Crux bladder has a different closure mechanism and the gasket does not seal at all. Water pours right out regardless of how tight you get it to close. I bought this to replace my really old CamelBak Rogue that is worn out. I am very disappointed in the low quality of the new hydration pack.",
      "rating": 1.0,
      "verified": true,
      "author": "joel",
      "helpful_votes": 7,
      "publication_date": 20170713
    },
    {
      "title": "Great backpack for single person",
      "text": "I brought this to use for my backpacking trips when I'm out during the day. It's good to keep you hydrated during your day activities. It's good for storing small wallets, phone chargers, snack bars, earphones, etc. It's only good if you want to carry stuff for a singleperson and not two or more.",
      "rating": 5.0,
      "verified": true,
      "author": "Saetric",
      "helpful_votes": 0,
      "publication_date": 20170317
    },
    {
      "title": "Buy this sooner than later!",
      "text": "I'm in love with this! I can't believe I waited so long to buy one of these. I bought the yellow green color because it was the cheapest; however, I'm glad I did because my friends can easily spot me in a crowd. I'm glad I bought this one instead of a smaller version because the zippered pouch is big enough to hold my keys, phone, wallet, and other small items. Also, there's another pouch that can hold a few bottles of water, which I need for longer hikes.",
      "rating": 5.0,
      "verified": true,
      "author": "Justine C",
      "helpful_votes": 3,
      "publication_date": 20170328
    },
    {
      "title": "BEWARE: they shipped me the inferior 2017 version instead",
      "text": "They shipped me the 2017 version instead of the 2016 version that the listing promised. If you look at reviews of the 2017 version, you will see that there are a lot of complaints about leaking and other issues whereas the 2016 version is almost universally loved. Not sure if there's still a way to get the 2016 version.",
      "rating": 1.0,
      "verified": true,
      "author": "T. O'Neill",
      "helpful_votes": 4,
      "publication_date": 20170726
    },
    {
      "title": "I am never comfortable wearing it",
      "text": "A tight fit. I am only 5'8\" but I have wide shoulders. I am never comfortable wearing it. It works as described but I will say any water left in the hose between the storage chamber and mouthpiece will taste bad but if you drain it or just spit it out on the first draw you will be okay.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "Perfect!",
      "text": "I bought this for long bicycle trips and just got a chance to use it yesterday on a 40 miler. I only filled it about halfway, but it was extremely comfortable and did the job. Lots of pockets to stash everything and my iPhone 7 plus fit (which it doesn't in most bike bags). This will be a lifesaver!",
      "rating": 5.0,
      "verified": true,
      "author": "cellis",
      "helpful_votes": 3,
      "publication_date": 20170514
    },
    {
      "title": "Worth the price",
      "text": "I've known Camelbak products are supposed to be some of the best consumer-level products in their categories, especially with their Hydration Packs. I saw a good deal on the Rogue one day on Amazon and decided to bite, despite having purchased an off-brand for $25 just a couple months earlier. Normally I'm all about off-brand products as long as they are similar, but this Camelbak product really is superior. The pack itself is lighter, more comfortable, and has more storage room. I can honestly say that at this point I understand the extra cost is worth it when you purchase a Camelbak product.",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan Ullom",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "great",
      "text": "I ride in central texas. In the dead of summer, i really should have gone with a larger capacity. I end up having to refill at public water fountains on occasion(i also ride for a couple of hours at a time. The pocket storage is plenty for what i bring( wallet, phone, keys, pocket knife). Very durable. I ride a mountain bike and have taken this thing off jumps and put many miles on it. I don't even feel like i have something strapped to my back. I would definitely recommend this brand",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "Great for Day Hikes",
      "text": "Gotta Love Camelbak products. This is my 4th Camelbak hydration pack that I have purchased. One for my husband, one for me, one that I used when I was a lot younger, and one as a gift for another adult. I haven't had a single one fail. We have Camelbak packs that have been working perfectly for 15 years. We only updated for a larger size and more carrying space. This particular pack has just enough space for your essentials like a phone, wallet, and keys plus a small snack. No bulky pack that will get in the way. Perfect for day hikes or even trips to amusement parks.",
      "rating": 5.0,
      "verified": true,
      "author": "natalie.b.",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Won’t Carrying Everything You Want; Will Carry Everything You Need",
      "text": "I got this for my 20 mile trail race. I was able to carry all my water with an electrolyte, 4 food pouches, A protein bar Micro first aid kit with medicine Ruger LCP Streamlight microstream Keys Leatherman Style CS Earbuds and phone charger pack Spare shirt through the straps KaBar TDI Karambif I finished my race with very little chafing and was completely satisfied. Get Darwinian with your loadout. It’ll get you there.",
      "rating": 5.0,
      "verified": true,
      "author": "Tio",
      "helpful_votes": 0,
      "publication_date": 20171220
    },
    {
      "title": "Was Perfect for the Spartan Beast",
      "text": "I bought this for long obstacle course races and I was not disappointed. I filled this up numerous times and it was easy. There is a flap that opens and then you have access to a large opening. The bag itself is good because it has numerous zippered pockets. I was able to keep Clif bars, peanut butter packets, Clif Bloks, KT tape, and even a spare set of disposible contacts (just in case). Also, the fit was great and I could run and didn't even notice that I was carrying 2 liters of water on my back. I would recommend to anybody serious about getting into OCR racing.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark",
      "helpful_votes": 7,
      "publication_date": 20161105
    },
    {
      "title": "Hands-free Safe Hydration While Hiking and Biking!",
      "text": "I've bought two of these thus far. I especially like them for bicycling. I felt it was a much safer way to keep hydrated, so one needn't take a hand off the handlebars to grab a bottle, or lose focus on the road. These are very beautifully, sturdily made!! These are well worth the price, because you really don't want something that may leak, or puncture, or impart an off or plastic-y taste to the water. There are cheaper versions, but they are not going to last as well, and I realized I'd end up paying the same amount, buying replacements. Buy this once and keep it!",
      "rating": 5.0,
      "verified": true,
      "author": "Sea-song by moonlight",
      "helpful_votes": 0,
      "publication_date": 20160607
    },
    {
      "title": "A great unit!",
      "text": "We bought this at the request of our daughter several years ago! She enjoys outdoor concerts and she loves her CamelBak! She is not only able to store a significant amount of water, but the extra pockets make it a convenient carrying case for her phone, ID, etc. She does clean it on a regular basis and it has held up nicely!",
      "rating": 5.0,
      "verified": true,
      "author": "Rene Smith",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "Great pack, perfect storage pockets.",
      "text": "Great pack. Perfect pockets for storage of phone, wallet, and keys and any other essentials. We use them for bike riding and rollerblading, The packs are light and have adjustable straps that make them nice and tight around you. Cleaning is no harder than a standard camelback. The bladder and tubes come out and go back easily. The bladder also has some nice drying legs built into it. My only problem with them is that they don't provide any insulation for the drinks but that is to be expected.",
      "rating": 5.0,
      "verified": true,
      "author": "PETER D",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "... for Spartan Races and they all are quality with great features. These packs hold up and can take ...",
      "text": "I have three different models of Camelbaks that I use for Spartan Races and they all are quality with great features. These packs hold up and can take a serious beating and still look new. They machine wash great and air dry fast, I can't imagine using a different product for my hydration needs.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyson Peltz",
      "helpful_votes": 3,
      "publication_date": 20160919
    },
    {
      "title": "Highly Recommended. Wife Loves It!",
      "text": "we use this all the time while hiking. My wife likes this one, because it's lightweight, but carries plenty of water. Even a little room for keys/wallet/GPS/etc. The small size and design also provides a nice style. Highly Recommended. Fairly easy to clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody mast",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Perfect water pack for music festivals!",
      "text": "I bought this mainly for use at music festivals, it has been perfect for me! High quality materials all around and easy to fill up and drink with. Pockets are small but I chose this size on purpose and they had plenty of room for what I wanted, especially with the adjustable straps. Loosen those straps and you can easily fit a bottle in there even with the zippered pocket being full and the bladder filled up. There is a slight plasticy taste to the water but it has been slowly going away with use and it isn't present at all when the water is cold enough. Great pack! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "John Shifflet",
      "helpful_votes": 0,
      "publication_date": 20151125
    },
    {
      "title": "easily takes the rigors of offroading and repeated cleanings from ...",
      "text": "I have been using one of these for several years, and it was my first choice for a family member who is getting into mountain biking. It has the right amount of storage for gear, tools, phone, foods, and fluids for a solid half-plus-day of self-sustained riding. Well made, easily takes the rigors of offroading and repeated cleanings from regular usage. Extra bonus, the bright \"lemon green\" colorway is a perfect match for Pearl Izumi's hi-viz cycling jackets.",
      "rating": 5.0,
      "verified": true,
      "author": "Carbon Black",
      "helpful_votes": 0,
      "publication_date": 20161224
    },
    {
      "title": "Love this CamelBak",
      "text": "Love this CamelBak, mainly for the color! It's very easy to remove the cap and refill and has enough room in the pockets to put your phone and wallet in it. The only drawback for me is that there is no quick-release for the hydration pack. This isn't really an issue, but more of an annoyance as I like to place the hydration pack in the fridge the night before I go hiking. Overall, good quality and it's lasted me through numerous events and camping trips!",
      "rating": 4.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20161013
    },
    {
      "title": "Different item received",
      "text": "Like others experienced, I received the newer version of this product, NOT the 2016 version pictured. I was ready to return it but the person I gifted it to said this one was fine. Save yourself a couple dollars and just buy the newer version (it’s currently about $8 cheaper).",
      "rating": 3.0,
      "verified": true,
      "author": "aloyscius",
      "helpful_votes": 0,
      "publication_date": 20180903
    },
    {
      "title": "Good small hydration pack+",
      "text": "It's good for carrying a few essential bike tools, a wallet, phone and car keys. Not big enough to carry a lightweight overshirt or jacket. Light weight for the most part (until you add water). I know its a hydration pack, on occasion, I wish it could be used without the water bladder. Without the water bladder, the top flap, flaps wildly. It uses the bladder to hold it securely. Anyway, good small pack for short rides or hikes. Well built too.",
      "rating": 5.0,
      "verified": true,
      "author": "cheslin",
      "helpful_votes": 0,
      "publication_date": 20160425
    },
    {
      "title": "I don't ride my bike without it!",
      "text": "Plenty of storage for what you need to take with you and still remain light. I carry vehicle keys, 2 ammo magazines, a flashlight, sunglass case and I still have room for snack bars/food. With 2L of water I am able to ride my bike for about 3 hours maybe a little less if its hot out (85F is hot to me) before I have to refill. I go off road a lot and you can hear the water slushing around a little but at no bother to me, I would recommend this and a valve cover to anyone wanting to stay hydrated while doing whatever gets you going.",
      "rating": 5.0,
      "verified": true,
      "author": "John Doe",
      "helpful_votes": 0,
      "publication_date": 20150828
    },
    {
      "title": "Awesome pack.",
      "text": "This thing holds a great amount of water while not being too heavy. the pockets provide for a lot of storage. fits comfortably. Easy to dance in. Used at 3 day music festival. cons: the strap that goes across the chest easily falls off and I lost it. Still fits comfy though.",
      "rating": 5.0,
      "verified": true,
      "author": "ReviewMan",
      "helpful_votes": 0,
      "publication_date": 20160714
    },
    {
      "title": "Great for cycling",
      "text": "Replaced a cheaper hydration backpack I got from Amazon last year. Quality seems much better in comparison. Will be using it for cycling. I like the storage pockets for tools and is just the right size for day riding.",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan",
      "helpful_votes": 0,
      "publication_date": 20190226
    },
    {
      "title": "Good quality",
      "text": "Very nice quality! I purchased for myself but haven't had the chance to use it yet. Camelbak makes good quality products, and this is no exception. Easy to use, easy to fill, easy to clean. Also, the two pockets are big enough to fit essentials (wallet, phone, keys, and couple protein bars). Item was shipped the day after purchase and was on my doorstep within a couple days. Overall, very easy transaction!",
      "rating": 5.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20160809
    },
    {
      "title": "Great for mountain biking",
      "text": "I have had this same pack for two years. Great for mountain biking. I bought a second for my fat tire bike so I don't have to change tubs and accessories. I able to carry spare tub, three CO2 16 gram and filler. quick link, glasses, tire tool, multi tool, pliers and bottom bracket hanger. I put my elbow pads in the pocket and strap my knee pads to the outside for the climb. Works great for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Estupinian",
      "helpful_votes": 0,
      "publication_date": 20161205
    },
    {
      "title": "STAY HYDRATED FRIENDS",
      "text": "Perfect for my 5 day trip to EDC Las Vegas! Just enough water to keep you hydrated through a good chunk of the day and to keep your group hydrated too. It has one side ways zipper pocket on the top flap, a round zipper pocket with a mesh inner slot on the bottom, and a part mesh open pocket using the round pocket as the front (if you can picture that...). Fits my Nexus 6, credit cards/ID/money, chapstick, 2 5 hour energy shots, a compact makeup, protein bar, and then some.",
      "rating": 5.0,
      "verified": true,
      "author": "speesea",
      "helpful_votes": 0,
      "publication_date": 20150629
    },
    {
      "title": "Best Water/Light Storage Pack Out There",
      "text": "Best water/light storage pack around. Use for off-roading, snow skiing... pretty much everything. I've landed on it hard a couple times while dirt biking...no damage.",
      "rating": 5.0,
      "verified": true,
      "author": "S B",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "for the casual hiker or cyclist I think this is great. I'm about 5'5\"",
      "text": "I'm a light hiker. Meaning, I don't do incredibly strenuous or long trips and only once or twice a month. So, for the casual hiker or cyclist I think this is great. I'm about 5'5\", 120 lbs and this adjusts to fit me perfect. Nice weight distribution. Never any shoulder pain. My only gripe is that it is difficult to completely dry out the tube, making it prone to developing mold. If Camelback would include some tool specifically for this purpose I would have given it a 5-star rating.",
      "rating": 4.0,
      "verified": true,
      "author": "E. Teb",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Good for any outdoor activity, except for tall people",
      "text": "The pack works well, except for the fact that I am tall and can't figure out the correct placement of the pack on my back. I tried lowering the sternum straps, but they are still near my neck when I clip them together. I also wish there was another clip for the hose, as it kind of dangles around when hiking. Overall though, great product to have for long trips, especially since I drink a lot of liquid during any kind of physical activity,",
      "rating": 4.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Great product, very bright",
      "text": "Great water pack for a quick ride. Cleaning the bladder is a pain though. Also, one has to remove the mouth piece for ease of removal. Otherwise, great for visibility, great for water storage. The pockets are also usable to keep a small bike tool kit in it, as well as a cell phone and wallet",
      "rating": 4.0,
      "verified": true,
      "author": "drinsd",
      "helpful_votes": 0,
      "publication_date": 20160410
    },
    {
      "title": "Great Option for Marching Band",
      "text": "Our high school uses these for the band students instead of clunky water jugs. Best idea ever! We ordered this as a replacement when the original was stolen. We definitely used our silver sharpie to mark it up with first/last name and nicknames to deter anyone else from stealing it. It is just as we expected and it arrived right in time for a Friday night game!",
      "rating": 5.0,
      "verified": true,
      "author": "Vellichor",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Functional w/ storage",
      "text": "My Rogue Hydration Pack works well and I love the extra storage it provides. I use it on hikes with my dog so I not only carry my necessities (first aid kit, phone, etc.) but hers as well (collapsible water dish & treats).",
      "rating": 5.0,
      "verified": true,
      "author": "H. Powers",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "I love this camelbak",
      "text": "I love this camelbak! I mainly use it for snowboarding, as it is a perfect size to hold electronics, snacks, keys, wallet, and obviously water. I have filled this up with gatorade before and it works great. Even cleaning it out wasn't too much of an issue. I've also used this for mountain biking and the slim design is nice and doesn't weigh you down or feel too obtrusive. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Dom&Mak",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "I like to have the water in the Camelbak because I'm ...",
      "text": "My husband and I both have gotten into cycling lately. I like to have the water in the Camelbak because I'm not agile enough yet to get a bottle out of the holster and drink. With this backpack, it's perfect. It's right there and so convenient. My husband loves it too. I also notice I'm drinking a lot more water, which is great. We ride for 30 miles on Sunday, so you need the extra water. Very reasonably priced and a great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "kellikay",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "Good",
      "text": "Got this for my 18 year old son that goes on 80 mile bike rides. He said he didn’t let it get empty so I don’t know if it would last that long but he loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "KT",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Looks to be made as light as possible and I like the pockets for keys",
      "text": "Camelbak products have been around long enough for them to refine their products very well. This package does not come with the quick release hose connections - those are available separately. I bought the insulated hose and quick connect to refit this package. Looks to be made as light as possible and I like the pockets for keys, wallet and energy packets. Almost $30 off the price at the sports stores.",
      "rating": 5.0,
      "verified": true,
      "author": "dawjr",
      "helpful_votes": 0,
      "publication_date": 20161218
    },
    {
      "title": "Nice pack",
      "text": "Nice pack, holds plenty of water, no signs of leaks. Pockets are big enough to hold my Galaxy S8+ and a wallet and some dog poop bags. Plenty of room to spare. This was not the 2016 version, but I don't care.",
      "rating": 3.0,
      "verified": true,
      "author": "Brain Wash",
      "helpful_votes": 0,
      "publication_date": 20180718
    },
    {
      "title": "Great Hydration System",
      "text": "I love this Camelbak. I am using it for long bike rides when I need more liquid than my two 25 ounce water bottles can provide. Of course, it is great for hydration but the storage is nice for carrrying energy bars, gels, wallet, etc. It is light, small and easy to carry. I carried it on the Ride Across Indiana and didn't have any comfort issues with the pack.",
      "rating": 5.0,
      "verified": true,
      "author": "GSH",
      "helpful_votes": 0,
      "publication_date": 20160718
    },
    {
      "title": "works great. I recently started mountain biking a lot and ...",
      "text": "works great. I recently started mountain biking a lot and this thing has changed the game for me. I can finally travel the distance i want, where before i would run out of water and energy. small enough to not weigh me down or get in the way. But large enough for me to bring some basic necessities such as iPhone 6+ (top pocket), and keys and multitool in the bottom pocket. There is more room, but thats all i need.",
      "rating": 5.0,
      "verified": true,
      "author": "Drew",
      "helpful_votes": 0,
      "publication_date": 20160507
    },
    {
      "title": "Perfect for a long day hike",
      "text": "Perfect for a day hike of a couple hours. Enough space for some food, layers and sunblock.",
      "rating": 5.0,
      "verified": true,
      "author": "mom2a2",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Doesn't hold as much as claimed",
      "text": "It didn't get 3 stars because it is a bad product. In fact; I really like the product and it works great. The issue is that it is supposed to hold 70oz and mine only holds 50oz. I didn't notice this until several months after I bought it because I never used a measuring cup to figure out how much it holds. Great product. Just be careful that you get what you pay for.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 0,
      "publication_date": 20170413
    },
    {
      "title": "I love this pack",
      "text": "I love this pack! It holds everythinig I need for nutrition, an extra pair or socks and what not, and most importantly plenty of water. It is very comfortable during trail running/trail marathons, so don't think of it as only for MTB.",
      "rating": 5.0,
      "verified": true,
      "author": "jrnordstrom",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Can't beat the best name in the biz.... CamelBak",
      "text": "Easy to fill, load bladder, clean.... everything. CamelBak just keeps making their products better. Plus, this color is perfect on my son. I let him mountain bike ahead of me.... he has a habit of stopping in the middle of the trail. Sometimes, this hi-viz yellow is what keeps me from rounding a corner and plowing into him!",
      "rating": 5.0,
      "verified": true,
      "author": "dijitz",
      "helpful_votes": 0,
      "publication_date": 20160505
    },
    {
      "title": "Great Design.",
      "text": "Perfect size for a nice day hike or bike ride with a couple small pouches to carry some things. I bought this one for my son because his other one was too small. I haven't bought a newer Camelbak in a while and I really like how they've changed them in the last couple years. They are much easier to open to get the water in. Expensive, but worth it in the long run.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Conklin",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Its pretty nice its not like the old camelbaks that were ...",
      "text": "Its pretty nice its not like the old camelbaks that were more fabric which I like this ones more like waterproof plasticy fabric but it works great and I use it daily. I may get a bigger bladder tho it kinda runs out quick so this isn't really good for hardcore mountain biking deep in the woods you'd wanna get a 2 liter camelbak for that but this one is great for around the town or 1.5 hour hard cardio sesssions",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "It leaks like crazy, must not be a CamelBak?",
      "text": "I have three other CamelBak's and this one leaks around the fill cap. Different design then the others. I was just about to toss it in the 1st garbage I found on my hike but I am going to get another bladder with the original design for the lid/seal.",
      "rating": 1.0,
      "verified": true,
      "author": "azguy",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Great size for both the amount of fluid and storage",
      "text": "Great size for both the amount of fluid and storage. I can fit all my cycling tools, some tubes, Co2 in the bottom pouch; All my food in the top pouch; And even throw a long sleeve shirt/cover in between the bladder and lining!",
      "rating": 5.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 0,
      "publication_date": 20171110
    },
    {
      "title": "Perfect for biking!",
      "text": "I love my camelbak hydration pack! I bought it with the purpose to use it mountain biking and it has been fantastic. It holds the perfect amount of water for a day trip and keeps it cool even in the heat of the day! Also, the bright yellow color with reflectors is great when riding close to roads as it keeps you seen and safe.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "He said it worked out GREAT. Heaven knows how much he would have had ...",
      "text": "I got this for my son who used it when he went to Lalapalooza this summer. He said it worked out GREAT. Heaven knows how much he would have had to spend on bottled water otherwise. My husband will be using this when we go hiking on vacation. I think it was a good investment.",
      "rating": 4.0,
      "verified": true,
      "author": "AnnetteWI",
      "helpful_votes": 0,
      "publication_date": 20161026
    },
    {
      "title": "... MANY years and decided to get the latest and greatest rather than just replace the reservoir",
      "text": "I have used the original Camelbak Rogue for MANY years and decided to get the latest and greatest rather than just replace the reservoir, hose, and bite valve. This new Rogue is a very similar size but has more zippable storage room. My only wish is that they had maintained the adjustable strap between the top and lower compartments - I found an amazing number of uses for that thing!",
      "rating": 4.0,
      "verified": true,
      "author": "RStarr",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "awesome pac!!",
      "text": "I am very happy with this pac, watch the vids, they fully explain every aspect of the pac.Its small enough that you think you are just carrying water, but its a mini back pac, and will hold a lot of essentials. I think this is a awesome product, and highly recommend it!! Get out and ride!",
      "rating": 5.0,
      "verified": true,
      "author": "charlie,long Island  NY",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "Perfect size for MTB, fits larger phones",
      "text": "This is a great hydration pack for mountain biking. Fits plenty of water and can store all the basic equipment. It even fits my phablet with a 5.5\" screen - very hard to find compact packs of any type that can do this.",
      "rating": 4.0,
      "verified": true,
      "author": "uhnonimuss",
      "helpful_votes": 0,
      "publication_date": 20161106
    },
    {
      "title": "and the bladder never made the water taste funny. Great buy",
      "text": "Doesn't leak, has ample pocket storage for such a compact bag. Can fit keys and phone into the top pocket, with plenty of room to spare. Haven't even needed the bottom pocket yet. Water stays cold throughout 2-3 hour hikes, and the bladder never made the water taste funny. Great buy, glad that I went name brand for this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Kate Krontz ",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "great product, work as expected",
      "text": "great product ,work as expected. will buy again if needed. very happy. !",
      "rating": 5.0,
      "verified": true,
      "author": "ramses baez",
      "helpful_votes": 2,
      "publication_date": 20160703
    },
    {
      "title": "works great",
      "text": "I got this for hiking in Utah. It a simple but functional design. I like the ability to remove the bladder for rinsing and filling. The wide cap makes that easy, but it always takes me a couple of tries to get the cap seated properly.",
      "rating": 4.0,
      "verified": true,
      "author": "Running Man",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "Rogue Hydration Pack",
      "text": "Bought this for 2 upcoming Spartan Races this year. I like that itʻs compact, but has pockets that can hold a few bars or gel fuel. So far Iʻve been training with it, running 3-4 miles and doing burpees and other exercises with it on...and itʻs been great. LOVE IT.",
      "rating": 5.0,
      "verified": true,
      "author": "TB96762",
      "helpful_votes": 0,
      "publication_date": 20150601
    },
    {
      "title": "NOT the 2016 model!",
      "text": "Received the 2017 model, not the 2016 model. And it arrived with a scuff mark.",
      "rating": 1.0,
      "verified": true,
      "author": "Bunsen",
      "helpful_votes": 0,
      "publication_date": 20180321
    },
    {
      "title": "Good",
      "text": "Bought this a few years ago. Still in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "perfect for a short hike",
      "text": "Perfect for a short hike. Just enough room to take my basic hiking items (first aid kit, whistle, small needle nose pliers etc) and a power bar and some nuts.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikel Gali",
      "helpful_votes": 2,
      "publication_date": 20170326
    },
    {
      "title": "Solid hydration pack",
      "text": "Its a camelbak. It does what it is supposed to and has no issues thus far. Aside from any potential issues down the road due to wear, you should know what you're buying when you buy a camelbak.",
      "rating": 5.0,
      "verified": true,
      "author": "C.J.",
      "helpful_votes": 0,
      "publication_date": 20170826
    },
    {
      "title": "Great if you're just holding water",
      "text": "Awesome size for a quick trip. Holds enough water for one person, maybe two if it's short, and not much else. Know that you're not fitting much more than water in this pack. If you want snacks and jackets you'll want a much larger size.",
      "rating": 5.0,
      "verified": true,
      "author": "Anon",
      "helpful_votes": 0,
      "publication_date": 20160104
    },
    {
      "title": "Better investment than waterbottles!!",
      "text": "I had been looking for something similar to this but camelback doesn't dissapoint! This was a gift for my boyfriend for when we go hiking. First time we used it, I was stunned at how to fill up the bag! So much water in a backpack. Pure awesomeness! What I love most about this is the compartments! We were able to put our phones, wallets, car keys, and we still had space! I'm feeling like I bought it more for me but for him to carry!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeniffer",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "Great !",
      "text": "I used my Camelbak for 4 different hikes. It held adequate water storage for day hikes. Another fine feature is the small storage areas that can hold some important items. I found great help on Google for the best ways to use this. About the hose...I've been unable to detach the hose from the base of the Camelbak.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Four Stars",
      "text": "Doesn't have as much extra space and pocket as I was hoping for, but serves the purpose well.",
      "rating": 4.0,
      "verified": true,
      "author": "Jane",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Easy to carry",
      "text": "Lightweight. Easy to carry. Holds decent amount of water. Perfect for concerts or light to medium hikes. Easy to clean too. It may be a little difficult The first time you refil the pouch but you learn fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Karmen Wong",
      "helpful_votes": 0,
      "publication_date": 20170404
    },
    {
      "title": "stitching failed during first use",
      "text": "The stitching on the chest strap tore off 30min into wearing it. I did a test for at home to adjust the straps and thought it was good to go. I reached up to close the canopy of a truck and it burst right at the seam. You can hardly see where it was originally stitched together, one small line and not very robust. Usually camelbak's are pretty solid, but not this one. Hopefully the warranty will cover it.",
      "rating": 1.0,
      "verified": true,
      "author": "Vader",
      "helpful_votes": 5,
      "publication_date": 20150629
    },
    {
      "title": "Five Stars",
      "text": "Pretty much a lifesaver when going on hikes or cross country, and you'll look cool doing it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ksaku",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Worked perfectly for a Spartan Beast race in Tahoe. ...",
      "text": "Worked perfectly for a Spartan Beast race in Tahoe. Holds a bunch of gel packs, headlamp and a little room to spare",
      "rating": 5.0,
      "verified": true,
      "author": "Heath",
      "helpful_votes": 3,
      "publication_date": 20151102
    },
    {
      "title": "Great for a walk in the park, not if you want to bring essential tools",
      "text": "This hydration bag is for the minimalist. Does not have much room for biking tools, if you plan on using it for a ride. When full, the bag is very difficult to get into the compartment. It is best to slide the empty bag into the compartment and then fill it.",
      "rating": 3.0,
      "verified": true,
      "author": "Kingkongmegatron",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Everything i had hoped for",
      "text": "I bought this for an 8 mile trail/obsticle race and it held enough water for my dog and I as well as food gel, dog treats and of course my phone so I could document the whole thing. Fits great, doesn't shift around when completing awkward movements, and a nice low profile so I could still fit under stuff. The hose does just dangle and got dirty constantly but small price to pay to have water I guess. Love this pack",
      "rating": 5.0,
      "verified": true,
      "author": "jesse",
      "helpful_votes": 0,
      "publication_date": 20150914
    },
    {
      "title": "Love it!",
      "text": "I've had this for a couple years and its worked great, I've used it while mowing the lawn, hiking, biking or just about anytime I want a hands free water bottle on me. I've used it well over 200 times and its been through the ringer but looks no worse for wear. 5 stars!",
      "rating": 5.0,
      "verified": true,
      "author": "Matt H.",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "A Welder's Dream",
      "text": "Bought this for myself to wear at Welding school. Fits under my gear. Keeps me cool with ice cubes on extremely hot days. It even has my name on it..Rogue. The red color matches my jacket. Convenient. Affordable. Keeps me hydrated for 8 hours.",
      "rating": 5.0,
      "verified": true,
      "author": "ROGUE",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Festival Must Have!!",
      "text": "Bought this Camelbak for music festivals and hiking and so far it has proved its worth. It holds enough water for a good distance hike and it also is very easy to use. It's extremely comfotable and has plenty of pockets to hold your keys, wallets, portable chargers, etc. its really hard to beat for the price. Also they have a great selction of colors (I went with black). Another great feature it has is reflective material on the back so if you run or hike during night You will be able to be seen.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyler",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "No quick release like all the other Antidote bladers. 😕",
      "text": "I really like the pack but the 2L Antidote reservoir that comes with the pack is not the one with the quick release tube which was the main reason I purchased the pack.",
      "rating": 3.0,
      "verified": true,
      "author": "Paul Lopez",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "It is super convenient for biking",
      "text": "My boyfriend loves it! It is super convenient for biking, and an added plus is how many little pockets it has!",
      "rating": 5.0,
      "verified": true,
      "author": "KN",
      "helpful_votes": 0,
      "publication_date": 20171103
    },
    {
      "title": "good condition. This is a great product",
      "text": "Delivered on time and in new, good condition. This is a great product. I just bought one for each of my boys. I've been using mine for years now.",
      "rating": 5.0,
      "verified": true,
      "author": "Meg S. Ferguson",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Great for Cyclists and Runners",
      "text": "I got the women’s version of this hydration pack for my birthday and loved it so much I bought the Rogue for my boyfriend’s birthday. Camelback makes excellent products. The Rogue is specific for cyclist but can be used for running as well. There is ample room to put cycling tools, Stinger bars/gels, and a spare tire. For longer rides, the 70 ounce capacity is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "JAY",
      "helpful_votes": 0,
      "publication_date": 20150408
    },
    {
      "title": "Happy with Quality of Product",
      "text": "We are very happy with the DPO mailing service as it took just a week. I ordered two of these camel backs and immediately took them out on a 24 mile bike ride. My wife and I are very happy with the quality of the product as it far exceeded expectation. After 24 miles of a ride, the camelbacks felt fine in our backs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jesus Romero",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Little small, but my guy is a little big ...",
      "text": "Little small, but my guy is a little big. Its not that big once you slip it on your back. Almost more made for a girl. It seems to do the job. Its Lightweight, holds about 2 small bottled waters, maybe more.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161202
    },
    {
      "title": "If you are not a 5'3 woman try a different option.",
      "text": "While the bladder is .5L bigger then my previous pack the structure of this item is for small women. Sizing says unisex but at 6'2 I must not fall into that category.",
      "rating": 2.0,
      "verified": true,
      "author": "Johnny55",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Five Stars",
      "text": "love this item! really helps keep my hydrated during the summer on camping trips/hikes/festivals",
      "rating": 5.0,
      "verified": true,
      "author": "Cristine Wu",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Works for my son to hike with",
      "text": "Bought for my son's campingtrip and 11 mile hike. Works great. Great that he could wear this on his back (he's 11) and not have to carry bottles of water. It does not have a lot of space to carry other items. He was able to bring a small flashlight, energy bars, bandaids.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Ferguson",
      "helpful_votes": 0,
      "publication_date": 20150814
    },
    {
      "title": "Mouth piece broke within minutes",
      "text": "I bought this bag for my 11year old son. Within 2 hours the mouth piece was leaking. The tip of the mouth piece began to break away on the side creating a tiny ant size hole. I was a little disappointed because I watched several YouTube videos about how durable and well tested these parts were. Aside from that, great bag.",
      "rating": 2.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Really love this purchase",
      "text": "Really love this purchase. After doing a decent amount of hiking over the last 4 months, I've really enjoyed the pack. It's a lot better than hauling a number of water bottles around and is super lightweight and comfortable. The best part for me were the extra pockets. They were large enough to hold my wallet, keys, phones, and snacks.",
      "rating": 5.0,
      "verified": true,
      "author": "NiceGuy",
      "helpful_votes": 0,
      "publication_date": 20170109
    },
    {
      "title": "The lid is just a pain to screw on without ...",
      "text": "The lid is just a pain to screw on without spilling water everywhere. It takes me a couple tries to even get it to",
      "rating": 4.0,
      "verified": true,
      "author": "lilyhammer",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Keeps Me Hydrated",
      "text": "I bought this for hiking and also for Spartan Races that I participate in. Not only is this very convenient, but it is high quality. Also, the two pockets are nice for carrying my keys and such when hiking or energy gels during races.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Coberly",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "The lid is a little difficult to put on properly ...",
      "text": "The lid is a little difficult to put on properly, but the pack works as expected without issue. Unfortunately the color has faded from its original bright hi-viz yellow after a summer of frequent use.",
      "rating": 4.0,
      "verified": true,
      "author": "goldy",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Perfect for every MTB/bicycle ride",
      "text": "This was a gift for my Dad who wont MTB without it. His chain broke the other day and lucky for him he had a Camelbak carrying his tools. I have had my Camelbak since 2007 and its still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Willetts",
      "helpful_votes": 0,
      "publication_date": 20150217
    },
    {
      "title": "Love CamelBak products!",
      "text": "I'm prior Army and we were always issued CamelBak hydration for our missions. LOVE this brand and the quality. The bladder is easy to open & easy to unlatch the top flap. Plenty of of room for snacks, and a key holder in the top zipper pocket :) I live in Austin, TX and I do a lot of hiking, bike riding and also perfect for festivals. EDIT: I finally remembered to take a pic of the camel bak with a ful bladder. Top pocket can hold your keys and Anker Powercore charger. Just to give you an idea. Hope this review helps.",
      "rating": 5.0,
      "verified": true,
      "author": "Nancy",
      "helpful_votes": 4,
      "publication_date": 20161005
    },
    {
      "title": "Great pack. Lightweight and yet holds a nice amount ...",
      "text": "Great pack. Lightweight and yet holds a nice amount of water. For me, the actual storage of the pack is enough to carry a couple of glasses cases, wallets, and sunscreen. Perfect for hiking, music festivals, or really any activity. Very versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "ckrapp",
      "helpful_votes": 0,
      "publication_date": 20150626
    },
    {
      "title": "It's a \"men's\" pack but it can work for anyone",
      "text": "It's a \"men's\" pack but it can work for anyone. This is an awesome back. I bought this for my wife who is 5'4\" and it fits great on her and on me 6'1\". It's not heavy when full and there is room for cell phones, keys and granola bars.",
      "rating": 5.0,
      "verified": true,
      "author": "Lance Bass",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Five Stars",
      "text": "Looks good, haven't given it as a gift yet, but hope she loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Deanna Maddox",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "It is strongly built have not encountered any problems a great backpak enough room to carry the necessary items you ...",
      "text": "The hydration pak work as illustrated in the demonstrate as advertised. It is strongly built have not encountered any problems a great backpak enough room to carry the necessary items you may need. The price was right would recommend it to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Anestercia Bailey",
      "helpful_votes": 0,
      "publication_date": 20151019
    },
    {
      "title": "Five Stars",
      "text": "My granddaughter took it to camp with her to keep hydrated n hikes.",
      "rating": 5.0,
      "verified": true,
      "author": "GranSt",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Really a solid product, however the lid on my ...",
      "text": "Really a solid product, however the lid on my bladder sometimes refuses to seal properly. The pockets are waterproof to an extant, allowing for generous amounts of spillage before seepage finally occurs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Its a lightweight on your back, and is real ...",
      "text": "Its a lightweight on your back, and is real well made. This is my second one. My first point we're out after 5 years.",
      "rating": 5.0,
      "verified": true,
      "author": "larry Ross",
      "helpful_votes": 0,
      "publication_date": 20160811
    },
    {
      "title": "Best thing for a short day hike",
      "text": "Good capacity for fluids. It has pockets for wallet and keys, or snacks.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin",
      "helpful_votes": 0,
      "publication_date": 20200115
    }
  ],
  "product_meta": {
    "title": "CamelBak 2016 Rogue Hydration Pack",
    "description": "The convenience of external fill in a sleek bike pack. The 2L Antidote reservoir can be refilled on the fly via the quick-release flap on the front of the pack. Two external pockets for small items like keys, wallet, phone or storage for a shed layer. Stretch elastic side panels provide for expansion; twin compression straps shrink pack down when empty. Reflective back strip with tab to click on a blinker for early morning and evening safety.",
    "rating": 4.4,
    "feature_bullets": [
      "100% Nylon",
      "Imported",
      "One interior slip pocket. Two exterior pockets"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "Yes",
      "Item Weight": "15 Ounces",
      "Item model number": "62239",
      "Department": "Mens",
      "Date First Available": "March 14, 2014",
      "Manufacturer": "Camelbak Products",
      "ASIN": "B00J08L7RI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Hydration Packs",
      "Accessories",
      "Sports & Outdoors",
      "Outdoor Recreation"
    ],
    "price": ""
  }
}