{
  "website_summaries": [
    {
      "verdict": "A moisturizing bodywash that keeps skin soft and clean with no residue left behind.",
      "pros": [
        "Leaves skin smooth and clean",
        "No residue left on skin",
        "Subtle, masculine scent",
        "Locks in moisture for hydrated skin"
      ],
      "cons": [
        "Some feel that the scent doesn't match what is promised"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Fake",
      "text": "This is a fake. Barely had any smell and most definitely doesn't smell anything like the samples from the hotel. Returning. At that price buy straight from manufacturer's website",
      "rating": 1.0,
      "verified": true,
      "author": "Charlie S.",
      "helpful_votes": 24,
      "publication_date": 20180805
    },
    {
      "title": "Fraudulent Product",
      "text": "I have generally had good experience with Amazon beauty products, and have never in my life written an Amazon review before, but as a longtime user to Malin + Goetz products, i can promise this is a fake product. The scent, consistency and bottle are all off. I tried to refund the product and am now denying on my credit card bill. Buyer Beware!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 15,
      "publication_date": 20190421
    },
    {
      "title": "Not the same stuff you see in hotels",
      "text": "I thought I was ordering the same bodywash I found in a hotel in Jackson, WY, but this smells different and not nearly as strongly. It's completely different. Upon further examination, the stuff I liked in the hotel was 12% rum perfume. This is 0.5%. Will not be buying more until M+G releases the same formula they sell to hotels to the public. Extremely disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "guerrieraspirant",
      "helpful_votes": 10,
      "publication_date": 20190720
    },
    {
      "title": "Absolutely fake",
      "text": "I had the real gel before & then purchased this one. I was in the shower a few days later after the original one was finished & this one just didn't smell like the old one & didn't have the scent at all. I questioned it a couple days until I came back to amazon & saw other people had posted the same. This is definitely a fake product. They've filled it with some generic shower gel & it's awful. I poured it all out. Really folk, don't buy this.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20191018
    },
    {
      "title": "Something seems wrong... will try one more time for Prime Day.",
      "text": "When I got this I knew something didn't smell right — not nearly as amazing as the smaller bottles I’ve bought and used in the past. Seeing hear a lot of reviewers thing this is fake. Will try one more time...",
      "rating": 1.0,
      "verified": true,
      "author": "BCS",
      "helpful_votes": 3,
      "publication_date": 20190716
    },
    {
      "title": "Average",
      "text": "We bought this after using a hotel set. We had loved the smell of it. I’m not sure if it’s the change in elevation or the difference in the amount/size of bottle, but it doesn’t smell the same. Both my husband and I had the same thought and were disappointed. It’s still a nice unusual body wash, but I’m not certain if we will be ordering a second bottle.",
      "rating": 3.0,
      "verified": true,
      "author": "Brittany J. Wyse",
      "helpful_votes": 2,
      "publication_date": 20190518
    },
    {
      "title": "JUst oK",
      "text": "Scent not strong enough. Will order from the merchant next time.",
      "rating": 3.0,
      "verified": true,
      "author": "Funderburk Books & Such",
      "helpful_votes": 4,
      "publication_date": 20181019
    },
    {
      "title": "Not worth the money. A let down.",
      "text": "It's a thick consistency. Smells okay. Not much like dark rum though. It just smells sweet. It doesn't longer on my body after use at all. I will not be spending my money on the expensive Malin + Goetz products again.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Parrott",
      "helpful_votes": 0,
      "publication_date": 20190117
    },
    {
      "title": "Terrible product change from previous version",
      "text": "They completely changed the formula and this NO LONGER smells anything like the previous Rum version. It smells like some generic scented soap you find in a public restroom. I had read they made a change, but had no idea it was this drastic. Honestly have no idea why they would continue to sell it under the same Rum name. If they made the change to save money, they made a terrible choice as I don't see why I would possibly buy it again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190916
    },
    {
      "title": "Love the product",
      "text": "Love the product. Used it recently on a trip to Kuala Lumpur at the hotel and was so impressed I bought it and the shape and conditioner. Usually hotel shampoos only work on one type of hair texture but this product especially the conditioer does just that conditions and detangles wonderfully. Its great to use especially since I swim almost every day. Body wash is gentle and smells really fresh. I have all sorts of allergies and find that other washes burn when I use them. This one is great!!",
      "rating": 5.0,
      "verified": true,
      "author": "sholder",
      "helpful_votes": 3,
      "publication_date": 20160823
    },
    {
      "title": "Disappointed",
      "text": "I first discovered this body wash when I was staying in a hotel in Asbury Park, NJ. The body wash there had 1.5% dark rum in it, and smelled so much better than this .5% dark rum body wash. It’s not the same. I bought it because of what I used in the hotel. I’m severely disappointed, especially since the price on these are up there.",
      "rating": 2.0,
      "verified": true,
      "author": "Dylan",
      "helpful_votes": 0,
      "publication_date": 20191030
    },
    {
      "title": "Rum fragrance is luxurious",
      "text": "Discovered malin + goetz at the 21C in Louisville. The rum soap had an amazing fragrance. I keep it as a hand soap in my master bath. It is luxurious.",
      "rating": 5.0,
      "verified": true,
      "author": "MM",
      "helpful_votes": 0,
      "publication_date": 20171005
    },
    {
      "title": "Do not buy",
      "text": "Either fake or Malin is selling unscented crap. Do not buy.",
      "rating": 1.0,
      "verified": true,
      "author": "Owlsgone",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great smelling body wash",
      "text": "This is really a nice body wash. The Dark Rum scent is very pleasing. My only gripe is the cost. But it's a luxury I am willing to get.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeffery R. Akin",
      "helpful_votes": 0,
      "publication_date": 20190129
    },
    {
      "title": "Beware Fake Products on Amazon",
      "text": "I believe this to be a counterfeit product. I’ve compared it to the real one I bought earlier this year and the packaging and smell are very different. It’s body wash, it just isn’t the real thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191120
    },
    {
      "title": "Scent is wrong",
      "text": "The smell is completely off. Amazon must have old/expired inventory, will be ordering directly from the website from now on. Very disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Mario Incandenza",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Not the same scent as previous Malin-Goetze Rum body wash used in the past",
      "text": "I bought this shower gel in January and just started using it this month. I have used the rum scented body wash many times in the past. The scent for this product was not what I had received in the past. I'm wondering if it was a knock-off?",
      "rating": 1.0,
      "verified": true,
      "author": "Michael l Wolf",
      "helpful_votes": 0,
      "publication_date": 20200404
    },
    {
      "title": "product scent no longer the same",
      "text": "either it’s a fake or malin+goetz changed the scent . either way, it’s not the same as it was as recently as 2018 which is the last time i purchased the product and was totally in love with it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kali Ma",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Yummy",
      "text": "I love the everlasting smell it leaves on your body! Also it lathered very nicely",
      "rating": 5.0,
      "verified": true,
      "author": "S. Cardillo",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Product came without seal, open in packaging and leaking.",
      "text": "I love Malin + Goetz products, but this is absurd that I received this product in a package without the safety seal under the cap, leaking in the package and clearly missing some of the product. Not acceptable, Amazon.",
      "rating": 1.0,
      "verified": true,
      "author": "Justin Boone",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "Read all the reviews first - unfortunately fake",
      "text": "This is unfortunately fake. As soon you open the box you can tell. I wish I had read the reviews ahead of time.",
      "rating": 1.0,
      "verified": true,
      "author": "Carlos Plascencia",
      "helpful_votes": 0,
      "publication_date": 20190722
    },
    {
      "title": "FAKE!",
      "text": "This product is a FAKE. Do not buy. Smells nothing like the real thing.",
      "rating": 1.0,
      "verified": true,
      "author": "Philippa ",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "FANTASTIC!",
      "text": "Tried this in a hotel in Maine and fell in love with the clean, fresh feeling AND THE SCENT! It's awesome! highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "mykidsdad",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "A very good product!",
      "text": "Hard to find good products for sensitive skin - this is!",
      "rating": 4.0,
      "verified": true,
      "author": "Philip Segal",
      "helpful_votes": 0,
      "publication_date": 20200121
    },
    {
      "title": "Perhaps order from seller directly",
      "text": "The product must have been old or not stored under proper conditions. It does not have the proper smell",
      "rating": 1.0,
      "verified": true,
      "author": "Mark S. Wittman",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Product has changed",
      "text": "They changed the scent of the rum body wash and now call it hand and body wash. It’s not nearly as good smelling",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Impostor",
      "text": "I've used this same stuff for a few years now, but this isn't the real thing. But -- An Impostor! --seriously though, yeah, this is unfortunately deluded or a clever fraud.",
      "rating": 1.0,
      "verified": true,
      "author": "Brutus Jones",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Smells Incredible!",
      "text": "I absolutely love! Use as a hand soap in my bathroom. Guests constantly compliment the scent and ask what’s the brand and fragrance. Super fast delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Ferguson",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Product arrived damaged",
      "text": "Product arrived w/ open security cap and leaking....lost maybe 10 % of volume.",
      "rating": 2.0,
      "verified": true,
      "author": "Scott W.",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Awesome fragrance.",
      "text": "I love this body wash and would buy it more often if it wasn’t so expensive!",
      "rating": 5.0,
      "verified": true,
      "author": "Sheridann Biddle",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "Fake",
      "text": "Got the real thing a couple times, then they dropped a fake on me..",
      "rating": 1.0,
      "verified": true,
      "author": "Ryan Blomster",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Fake Peoduct",
      "text": "Fake product. Smelled terrible and not even close to the orginal scent.",
      "rating": 1.0,
      "verified": true,
      "author": "Meg",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "BEWARE- it’s a fake.",
      "text": "Looks like a fake. The bottle to the left I bought direct... this one on the right (this purchase) has smudged labeling in monochrome.",
      "rating": 1.0,
      "verified": true,
      "author": "Kristin",
      "helpful_votes": 0,
      "publication_date": 20190326
    },
    {
      "title": "I tried this body wash at a $500/night hotel in ...",
      "text": "I tried this body wash at a $500/night hotel in New York and have never gone back. If God used body wash this would be it.",
      "rating": 5.0,
      "verified": true,
      "author": "CL",
      "helpful_votes": 3,
      "publication_date": 20150609
    },
    {
      "title": "Smells great but too expensive",
      "text": "I went to a hotel in Phoenix Arizona that had this in their shower. The smell was amazing and it's still the best scent I've come across. Only downfall is the insane price tag for such a small amount. Don't know if I'll buy again because it breaks the bank.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "eh. smelled better.",
      "text": "love the bergamot, not so keen on the rum. it doesn't smell like rum, but more of a cheap pina colada. of course, this is just personally prefference - so, i am marking it as just ok. Their other stuff is great.",
      "rating": 3.0,
      "verified": true,
      "author": "Christopher Lepard",
      "helpful_votes": 0,
      "publication_date": 20150118
    },
    {
      "title": "One Star",
      "text": "didn't smell like the ones you get in Delta SkyClub.",
      "rating": 1.0,
      "verified": true,
      "author": "Andi",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Fabulous Scent!",
      "text": "Far and away my absolute favorite! I use it as a hand soap given it’s so pricey. I love the scent and a little goes a long way.",
      "rating": 5.0,
      "verified": true,
      "author": "gina",
      "helpful_votes": 0,
      "publication_date": 20190217
    }
  ],
  "product_meta": {
    "title": "Malin + Goetz Rum Hand + Body Wash — cleansing, purifying, hydrating women and men’s hand + body wash. for all skin types, even sensitive. No stripping or irritation. Cruelty-free + vegan 16 Fl oz",
    "description": "Our gentle, everyday Rum body wash balances natural glycerin with amino acid technology to hydrate and purify skin. Scented with our best-selling Dark Rum fragrance. We’re excited to let you know we’re in the process of going back to our roots. We’re making a return to single-color packaging design we launched MALIN+GOETZ with 15 years ago. Don’t worry… the formulas you know + love will remain the same.\n\nBRAND STORY\nmalin+goetz simple skincare solution\n\nBRAND_DESCRIPTION\nMalin + Goetz combines natural ingredients with advanced technology to create uncomplicated skincare. Our products are gentle and effective for all skin types and genders. Made locally in New York and cruelty-free.\n\nSee more",
    "rating": 3.9,
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "7.5 x 2.7 x 2.7 inches; 1.2 Pounds",
      "Item model number": "B00F57OWWK",
      "UPC": "856359008347 794437469935",
      "Manufacturer": "(Malin + Goetz)",
      "ASIN": "B00F57OWWK",
      "Amazon Best Sellers Rank": "#15,867 in Beauty & Personal Care",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Skin Care",
      "Body",
      "Cleansers",
      "Beauty & Personal Care",
      "Body Washes"
    ],
    "price": 36.0
  }
}