{
  "website_summaries": [
    {
      "verdict": "This quiet microwave works well, and comes with all the standard features.",
      "pros": [
        "This quiet microwave features an easy-to-clean nonstick interior and a light and fan built in under the unit",
        "If the unit overheats from the stove below, the exhaust fan comes on automatically so that the microwave is not damaged"
      ],
      "cons": [
        "A few customers complain that the display and control panel are difficult to read at a distance"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The price is right. One warning to buyers though ...",
      "text": "The price is right. One warning to buyers though, the exhaust fan is automatic. While you can manually turn it on, you should be aware that if it detects heat from the stove underneath it then it will stay on until it thinks that things have cooled down. And it is *loud*. The microwave itself is quieter than our last one, but a fan that you can't turn off - that's almost a deal breaker.",
      "rating": 4.0,
      "verified": true,
      "author": "Chip",
      "helpful_votes": 222,
      "publication_date": 20170101
    },
    {
      "title": "Had this item for 1yr and 3 months and now ...",
      "text": "Had this item for 1yr and 3 months and now it has stopped working. This has only been used for popcorn, reheating and once in awhile for steaming vegetables, other than that it sat idle. At least for the first year it worked, then it began tripping the circuit. If it had worked as it was said to have worked rating would be higher but due to issues I'd give it half star.",
      "rating": 1.0,
      "verified": true,
      "author": "l stevenson",
      "helpful_votes": 66,
      "publication_date": 20170911
    },
    {
      "title": "DO NOT SUPPORT GE OR BUY THIS PRODUCT EVER! BROKE AFTER 1.5 YEARS!",
      "text": "THIS MICROWAVE BROKE AFTER 1.5 years. 1 year warranty on this piece of s**t. Just called GE and they offered to come out for a $99 service fee plus parts and labor. What a cheap rip-off!! We are so incredibly angry at this company and WILL NEVER EVER BUY ANOTHER GE PRODUCT. I will shout this from the rooftops until someone helps us - we have 2 young kids and need our microwave! We can't afford to buy a new one every year! This is insanity. Someone from GE needs to provide a better customer experience, I'll be taking this to twitter and all social media outlets. RIDICULOUS!",
      "rating": 1.0,
      "verified": true,
      "author": "K Lord ",
      "helpful_votes": 43,
      "publication_date": 20180107
    },
    {
      "title": "GE Stands Behind this Microwave",
      "text": "I have owned this microwave for just over twelve months and it has worked perfectly. However, it did suddenly cause the circuit breaker to trip every time it turned on, so I thought I'd be replacing it. However, I scanned the bar code on the door which took me to the GE appliance website. There, I registered the microwave and the service issue. GE sent a service tech out the next day and they replaced a switch that malfunctioned. Here's the most impressive part of the story: the charged me nothing! I am so impressed how GE stood behind this product. I am now a raving GE appliance fan!",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Kuhn",
      "helpful_votes": 30,
      "publication_date": 20170824
    },
    {
      "title": "Worked fine until catastrophic switchboard failure after 18 months of usage",
      "text": "Worked fine until catastrophic switchboard failure after 18 months of usage. The switchboard failure immediately trips my home's circuit breaker whenever unit is turned on. At least it is still usable for the fan and light in the interim while I shop for yet another new microwave. Seller description of item reads: \"Free 10yr Warranty on Major Components\". A misrepresentation. The microwave actually has a 1-year warranty. The description needs to be corrected before it influences anyone else's buying decision or delays anyone's decision to purchase an extended warranty.",
      "rating": 1.0,
      "verified": true,
      "author": "Brock T Brown",
      "helpful_votes": 26,
      "publication_date": 20170922
    },
    {
      "title": "I'm a GE fan!",
      "text": "Exactly as described. Great product to replace our 25-year-old Spacemaker (the old old model of this one). Son installed it in a little over an hour and said the directions were great. We tried it out for reheating and it worked just fine. I saw the reviews about difficulty reading the selection buttons, but we had no trouble at all. Hope this one lasts as long as the old one did.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy",
      "helpful_votes": 21,
      "publication_date": 20170112
    },
    {
      "title": "13 months and it's done.",
      "text": "Most microwaves last years, if not decades. Not this one; 13 months and it's done. Trips the breaker after 1 or 2 seconds. Every. Time. Edit: Just spoke with a repair person. He thinks it's the transformer. $350 for him to fix it.",
      "rating": 1.0,
      "verified": true,
      "author": "A Busch",
      "helpful_votes": 12,
      "publication_date": 20171127
    },
    {
      "title": "Poor quality microwave",
      "text": "The handle is made of plastic and in 7 months the steel paint or film covering the handle is coming out loose and the plastic casing is broken. Poor quality",
      "rating": 2.0,
      "verified": true,
      "author": "RAJESH RAINA",
      "helpful_votes": 18,
      "publication_date": 20170521
    },
    {
      "title": "Way better than our old microwave",
      "text": "Way better than our old microwave! Be aware though, this model installs by bolting straight up from the front of the microwave through the bottom of the cabinet above it, not diagonally up/back to the wall plate like some models. Not cosmic but be ready to drill some holes and have 2 people or some creativity to install it. Works great though!",
      "rating": 4.0,
      "verified": true,
      "author": "Ben and Jess",
      "helpful_votes": 12,
      "publication_date": 20160403
    },
    {
      "title": "Shorted out after 20 months use...",
      "text": "This microwave was great while it lasted. However, at around 20 months of use it started tripping the breaker, and then it shorted out. Of course, the thing has a one-year limited warranty. Definitely not impressed with GE microwaves.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20180830
    },
    {
      "title": "looks great and is so quiet",
      "text": "Works well, looks great and is so quiet! It's only the first day. Installation was challenging. We installed the charcoal filter, but putting the front cover back on wasn't easy. We thought we snapped it back in, but then the door wasn't working correctly. The microwave was dented on the top right edge, but not a big deal because it was the cabinet covers it. We also were not given enough screws necessary for installation.",
      "rating": 3.0,
      "verified": true,
      "author": "lowi",
      "helpful_votes": 5,
      "publication_date": 20170102
    },
    {
      "title": "Failed 3 times during warranty.",
      "text": "After 3 service calls during warranty for blowing fuses and related parts it failed 3 months after the one year warranty expired. They say it was only serviced once so they have problems with records so ask your serviceman for a receipt. Mine was a lemon...",
      "rating": 1.0,
      "verified": true,
      "author": "lon ballard",
      "helpful_votes": 7,
      "publication_date": 20180206
    },
    {
      "title": "2 stars for 2 years use, a few months later...",
      "text": "Worked fine for a few years, buttons were hard to press to get a response from day 1. Popped the breaker outside when I inadvertently pulled the door open. Seemed to have recovered, still had an occasion to pop the breaker outside and a few fuses inside. As of today, it blows the breaker consistently. Now faced with replacing it, GE earns the coveted (X) customer award. These should last 5 years minimum, not like I'm nuking a 20lb frozen turkey on a daily basis...more scrap headed for the landfill.",
      "rating": 2.0,
      "verified": true,
      "author": "Private",
      "helpful_votes": 2,
      "publication_date": 20190320
    },
    {
      "title": "Halogen work lamps keep oven warm",
      "text": "Have had this for 2 years, and it works great. We discovered a hidden gem though. If you leave the work lights on, the oven can be used as a warming oven ! They are Halogen and they get hot. No danger of injury, but the oven stays warm enough to keep food warm (not hot) for as long as they are on. This is due the the amount of insulation in any microwave oven. We are happy with the oven and look forward to many more years of trouble free operation.",
      "rating": 5.0,
      "verified": true,
      "author": "White Rabbit",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "2 years is all you get",
      "text": "I have owned 2 of these microwaves and both have failed after two years of use. The first one I bought in 2015 and it failed in 2017. Thinking it was just a bad egg I bought another one but it just failed in 2019 after two years... Buyer beware they do not last.",
      "rating": 1.0,
      "verified": true,
      "author": "Evan",
      "helpful_votes": 2,
      "publication_date": 20191115
    },
    {
      "title": "Great Microwave until it stopped working",
      "text": "UPDATE: After 2 years of use this microwave is completely dead. I’ve never had a microwave die this fast. To get a repair person out to fix it is going to cost more than just replacing it completely. So annoyed and it looks like I’m not the only one that got a poorly made microwave. GE should be replacing these defective models but since I’m out of the one year warranty period I doubt they’ll do anything. Looks great and works really well! I've cooked a lot of things in this microwave and it gets the job done very quickly. I recently cooked a large sweet potato in it and it only took a few minutes!",
      "rating": 1.0,
      "verified": true,
      "author": "Plant Based B",
      "helpful_votes": 6,
      "publication_date": 20160819
    },
    {
      "title": "Great microwave. Scored highest on Consumer Reports",
      "text": "Love it. I saved a few hundred dollars by not buying the steam sensor version, both scored at the top of Consumer Reports. Didn't miss the sensor a bit.",
      "rating": 5.0,
      "verified": true,
      "author": "JEF",
      "helpful_votes": 89,
      "publication_date": 20150116
    },
    {
      "title": "Manufacturer Changed Mount Points",
      "text": "Bought to replace a JVM3150RFSS, which I am assuming is the previous model since the 5 is now a 6. Could be wrong on that. But It doesn’t change the incredibly frustrating fact that GE slightly changed the top mounting points from where they are on my old one, requiring more drilling of my cabinets. This just boggles my mind...why can’t stuff like mounting points be universal and standardized. Thanks for the massive headache, GE, should have been a simple swap.",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie Mitchell",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "LASTED ONLY 20 MONTHS",
      "text": "Purchased this microwave to replace one I had for over 15 years that still worked great. Did a complete kitchen remodel so wanted a new one. Bulb went out, then 2 weeks later, it started to blow my breaker. Tested it and the Magnetron is out - the part cost is $286, plus labor since the warranty is only good for 1 year. This is more than I paid for the microwave. Will not purchase from GE again.",
      "rating": 2.0,
      "verified": true,
      "author": "Dawn Archer",
      "helpful_votes": 2,
      "publication_date": 20200411
    },
    {
      "title": "Gone too soon",
      "text": "We've had this just over 2 years and it completely died. Kept blowing fuses until it was a fire hazard and had to replace. Of course it was out of warranty, so I called a repair place which which was going to cost nearly as much as a new micro just to diagnose. Also you can't see into the oven at all even with your face plastered against the window, and it's somewhat loud. Not going with GE microwaves again.",
      "rating": 2.0,
      "verified": true,
      "author": "Abraham McMahan",
      "helpful_votes": 2,
      "publication_date": 20181207
    },
    {
      "title": "Has needed repaired three times in a little over two years.",
      "text": "We've had this microwave in our office for a little over a two years now. It worked fine for 9 months but then started blowing the breaker. It was the switch on the door causing the problem. A known problem according to the repairman. We've had to have a GE repair person out twice to fix this same issue within two years. Same problem each time. Buying a new microwave now. Guess what brand it won't be? STAY AWAY!",
      "rating": 1.0,
      "verified": true,
      "author": "mattman",
      "helpful_votes": 3,
      "publication_date": 20180322
    },
    {
      "title": "ITEM WAS A DAMAGED RETURN RESOLD AS “NEW”",
      "text": "Microwave was delivered with damage on 3 places. 2 sharp dents on the front and 1 big dent on the bottom of the right side, which all three are noticeable after installation. It has been scratched in different places on the front which is stainless steel so it really shows. Obviously this was not a New unit and it clearly said New in the product description.",
      "rating": 1.0,
      "verified": true,
      "author": "Owen Joseph",
      "helpful_votes": 3,
      "publication_date": 20180720
    },
    {
      "title": "GE JVM  brand and lasted a very long time (10+ years)",
      "text": "I ordered this microwave, because the previous one I had was GE JVM brand and lasted a very long time (10+ years). I can honestly say not even the LG or Samsung brands have better reviews. There is a reason this is a Best Seller on Amazon. It may not have all the bells and whistles as others, but it last a very long time. Seller shipped item very fast and I am very happy with this purchase, that I took the time ti write this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel",
      "helpful_votes": 11,
      "publication_date": 20160719
    },
    {
      "title": "This is a flawed product- it will stop working",
      "text": "I guess i should be thankful this lasted two years. It doesn't work now- poor circuitry and impacted the outlet. The quality for GE products is unfortunately faded. Try another brand.",
      "rating": 1.0,
      "verified": true,
      "author": "TaraB",
      "helpful_votes": 2,
      "publication_date": 20181201
    },
    {
      "title": "Great for the money - lots of extras.",
      "text": "This is the second microwave (same model). Had it a little over a year and it quit working or rather kicked the circuit breaker when trying to cook. Everything else worked however. The Assurance plan immediately covered the cost of the microwave and I contacted GE as well and they too stood behind their product and provided a rebate for any other GE product of my choice. I got the same model because it is a good microwave for the money and installation was easier because the mounting hardware and placement was exactly the same which wasn’t true the first time even though we replaced GE for GE.",
      "rating": 5.0,
      "verified": true,
      "author": "Deane",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "VERY WEAK DOOR HANDLE Bought this a year and half ...",
      "text": "VERY WEAK DOOR HANDLE Bought this a year and half ago for a rental. Door handle cracked at the top and the bottom screw broke. Replacement handle is $119 and replacement handle support is $33 for a total of $152, yes, $152. Time to buy a different brand...",
      "rating": 1.0,
      "verified": true,
      "author": "Brian",
      "helpful_votes": 2,
      "publication_date": 20180723
    },
    {
      "title": "Love it.",
      "text": "I loved everything about it until the handle broke at the bottom about a year after owning it. It's still attached but loose at the bottom. Inconvenient and can see it's broken, but not enough to warrant replacing as everything else is still great.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert D. Wanless",
      "helpful_votes": 0,
      "publication_date": 20200411
    },
    {
      "title": "highest rated over the range microwave",
      "text": "everyone had dissed this units installation instructions so much so I was ready for a fiasco...no problems on the install and took about an hour alone. I have chosen to leave one screw out of the vent flue so that I can access the charcoal filter without removing the microwave from over the stove...that's not a recommendation, just something that made a lot of sense to me",
      "rating": 5.0,
      "verified": true,
      "author": "blacklisted",
      "helpful_votes": 0,
      "publication_date": 20181116
    },
    {
      "title": "Good Cookin!",
      "text": "I had ordered the same kind of microwave I had before because I was pleased with my old one. The one I replaced was 12 years old so I felt safe getting the new version of the old. I am very happy with it and look forward to same long relationship I had with my old model!",
      "rating": 5.0,
      "verified": true,
      "author": "truth seeker",
      "helpful_votes": 2,
      "publication_date": 20170920
    },
    {
      "title": "Died after 15 months (and look how many other people have the same complaint).",
      "text": "The microwave worked fine, but it started tripping the circuit breaker regularly to the point where it was unusable. I didn't opt for the extended warranty because my previous unit lasted for 7 or 8 years.",
      "rating": 1.0,
      "verified": true,
      "author": "Bob Fenster",
      "helpful_votes": 2,
      "publication_date": 20200429
    },
    {
      "title": "Do not buy this junk",
      "text": "The microwave after a year failed. It began to trip the circuit breaker. I called GE and after two hours on the phone with tech support and service i was told the product was out of warranty. They wanted $99 to sow up and repair would include additional costs for parts and labor. this would have added up to more than i paid for the unit. Now i am stuck with a dead microwave and no unite.",
      "rating": 1.0,
      "verified": true,
      "author": "Chuba Udokwu",
      "helpful_votes": 2,
      "publication_date": 20180810
    },
    {
      "title": "light bulbs a pain to replace and silver covering cheap, ripped off",
      "text": "The microwave itself works fine but the silver covering over the handle could not handle the heat of the stove, and it bubbled up and ripped off. Looks awful. Also, could not find replacement bulbs at any hardware or home improvement store. Had to order off Amazon, very few choices all very expensive for tiny bulbs. And it takes 2. Would never buy this microwave again.",
      "rating": 2.0,
      "verified": true,
      "author": "JF",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "I'm in love with this microwave",
      "text": "***UPDATE*** Just 2 Years Later it started tripping the breaker if the door was opened during use (I know-unsafe operating procedures), then suddenly it trips the breaker, when NOT in use. I tried plugging it into other outlets, it trips whatever breaker it gets plugged into. ***ORIGINAL REVIEW*** I installed this myself, the instructions were very clear to understand. I appreciate all of the features it has. It has only been a week, but as of now, it is very quiet and performs great!",
      "rating": 2.0,
      "verified": true,
      "author": "MJ Harris",
      "helpful_votes": 57,
      "publication_date": 20160718
    },
    {
      "title": "Major issues less than 2 years old",
      "text": "The microwave itself is fine. I find the placement of the cook time and timer button to be annoying. The issue is after less than 2 years it has tripped our circuit 3 times, resulting in an electrician saying it was the microwave, and two (about to be 3) visits from a repair person. (The second attempt shortly after the first, we got 4 mos of moderate use before tripping again today). I have never had to have a microwave repaired before this one. Our last microwave lasted 14 years and still kicking, we just renovated our kitchen. Wish I kept it.",
      "rating": 2.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Annoying.",
      "text": "It's a decent microwave. Does the job. I will agree with previous reviewers that the buttons are hard to read unless the light is just right. We have also found that the surface lights burn out really fast! Both bulbs burned out shortly after we purchased it. I bought 2 replacement bulbs, replaced them at the same time, and one of them burned out within a few weeks. Not sure if there's a short circuit or something. Annoying.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Streeby",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "ONLY LASTED 2 YEARS!",
      "text": "Loved it when I bought it. But it only lasted 2 years. Was hesating up a paper plate of food for 20 seconds, made a pop noise and died. GE is an excellent, reliable company, so it makes me wonder if the company selling their product sold me a refurbished one.",
      "rating": 1.0,
      "verified": true,
      "author": "Laura Cammarata",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Costs more to fix than to replace",
      "text": "Died after 3 years. Would cost more to fix it than to replace it, so I guess I’m replacing it with a different model. I had a microwave in the 90’s that lasted 15 years, but now they make them to break often.",
      "rating": 2.0,
      "verified": true,
      "author": "Kristi Wimmer",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "If you don't like the unit",
      "text": "Had to send it back through no fault of the product. It simply didn't fit. But beware: If you don't like the unit, you will have to pay the return postage. Company wouldn't do it. The cost to do so was substantial enough that I simply gave it to the contractor for use on another job. Hate wasting that kind of money!!!!",
      "rating": 3.0,
      "verified": true,
      "author": "roxie",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "A perfectly competent microwave oven.",
      "text": "A perfectly competent microwave oven. Installation was a bit fussy and the template wasn't exactly on the mark, but not too bad. I will say that I had dismissed the comment I read from some other reviewers about the button visibility at night as something that was unlikely to bother me. Turns out it actually is pretty annoying - the button labels are effectively invisible in a dimly lit kitchen. Otherwise, it looks pretty nice and cooks my food well.",
      "rating": 4.0,
      "verified": true,
      "author": "J. Demetre",
      "helpful_votes": 2,
      "publication_date": 20161013
    },
    {
      "title": "fairly easy installation, took us about 1 hour",
      "text": "fairly easy installation, took us about 1 hour. that includes removing the 22 year microwave that was originally installed. very quiet, hard to see the numbers etc on the black keypad. gave us an extra 3 inches that the old unit took up. very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170114
    },
    {
      "title": "Great microwave, lousy installation template",
      "text": "Love the microwave, it's very quiet, but I cannot believe how ridiculous it was trying to install! We were trying to hold a piece of paper up to the bottom of the cabinets and trace and imprint just right.. which doesn't sound bad but was seriously a pain in the neck and much harder than it should've been. They definitely need a more sturdy template than cheap paper. But, we do love the microwave now that it's in!",
      "rating": 4.0,
      "verified": true,
      "author": "MrsFtz",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "Unreliable",
      "text": "Basically it stopped working after a year and change. I have had microwaves that wouldn’t heat, made noise or keypads became unresponsive. This one simply didn’t turn on all of a sudden. Repair costs being what they are we had to toss it, what a waste and detriment to the environment. Tip, if it’s less than 3 years old check with your credit card company they might insure the product for one year after the manufacturers warranty ends.",
      "rating": 1.0,
      "verified": true,
      "author": "cLaSsIc",
      "helpful_votes": 0,
      "publication_date": 20190112
    },
    {
      "title": "BUYER BEWARE",
      "text": "After just 16 months the microwave has stopped working...started by tripping the circuit breaker- tried several outlets and had electrician look at the situation to be sure. It is the microwave...and of course the warranty ended 4 months ago. BUYER BEWARE!! I see in other reviews where this model of microwave has tripped other circuit breakers and finally just died...obviously there is a problem with this model. VERY DISAPPOINTING...$255 later UGH",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Microwave Less",
      "text": "This item was purchased as a new item, replacing the same make and model purchased approximately one year ago. The box looked like it was housing a new item; but, once opened, I found the packing Styrofoam not to be in the best of condition and it was missing the oven turntable. So, somebody pulled a fast one! Fortunately, since, I was replacing the same model I was able to keep the old turntable. Also, the time window is light with a bright white light. I have never had a microwave with a white time window.",
      "rating": 3.0,
      "verified": true,
      "author": "KMitch",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "I have always liked GE appliances, this one is no exception.",
      "text": "It works great and the price was right. If I were going to complain about anything, it would be that it is a little noisier than I expected. Shipping was very quick.",
      "rating": 5.0,
      "verified": true,
      "author": "Maddog From Florida",
      "helpful_votes": 4,
      "publication_date": 20170104
    },
    {
      "title": "Probably should have sent it back because of damage!",
      "text": "This microwave was for my 85 y/o mother. It came damaged, bent on both sides but didn’t hurt the function so we kept it! I wasn’t happy about it though! Within a year started to blow the braker and had to be repaired, was free of charge but took 2 months!! Numbers have no backlight so not good for the elderly and hard to open the door! It works again after the repair!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200715
    },
    {
      "title": "good microwave, terrible quality",
      "text": "We've owned this item for just over a year. To start the magnetron buzzes very loudly like its about to go out. Thought it was an issue w/ the unit so replaced the first one and the second was just the same. Now a year in, it still works just fine which is good, but the bottom of the handle has broken so its about to come off and the top of the casing has cracked. 2 stars because i like the function and how it works. still heats the food.",
      "rating": 2.0,
      "verified": true,
      "author": "Eric J",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Disappointed only lasted 2 years",
      "text": "This worked great at first. It only worked for two years. At first the door switch would break the fuse. Then the whole thing broke and wouldn’t work.",
      "rating": 1.0,
      "verified": true,
      "author": "Massagemamma",
      "helpful_votes": 0,
      "publication_date": 20181109
    },
    {
      "title": "The door was uneven  and also blew the fuses",
      "text": "Had this new one installed in Oct 2017- The following year I noted that if I open the microwave door before the time was up there was a short circuit . Eventually I could not even use it because as soon as I pressed \"start\" it will happened again. I bought the insurance and all they did was gave the money I spent for the microwave and nothing else- . I still paid for installation of my new microwave and disposal of the this one.",
      "rating": 1.0,
      "verified": true,
      "author": "Carolina Montoya",
      "helpful_votes": 0,
      "publication_date": 20200812
    },
    {
      "title": "Broke down after 2.5 years",
      "text": "we bought this microwave to replace our builder installed GE microwave which we had for 10 years without any complaint. This microwave stopped working suddenly and now we are looking for another one in 2.5 years. We have been amazon customers for a while now but now we are scared to buy appliances or any high priced item through amazon. Not sure they are enforcing quality control from the sellers. we should have paid more attention to determine who the seller is. Microwave worked good as long as it worked and it is a great seller according to Home depot guys.",
      "rating": 1.0,
      "verified": true,
      "author": "Ramu Nair",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "NO NO NO",
      "text": "After 1.5 years of use it's dead. Trips the house breaker. Tried the door switch and thermostat repair without success. Will never buy a GE again.",
      "rating": 1.0,
      "verified": true,
      "author": "John Allen",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "We easily installed it",
      "text": "This microwave was rated #2 in consumer reports! I bought it and it arrived the very next day! We easily installed it, it works great and is very very quiet-great microwave!!! I would recommend it to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "MalloryMae",
      "helpful_votes": 3,
      "publication_date": 20180221
    },
    {
      "title": "Horrible install - template is bogus",
      "text": "I haven’t even used it yet, but we already do t like it. We followed instructions meticulously, but had all sorts of trouble installing it. We used the template but managed to drill holes in the upper cabinet that were 1/2” off. Huge pain. Took us hours (and we are generally pretty handy.)",
      "rating": 2.0,
      "verified": true,
      "author": "Tish",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Lasted 2 years",
      "text": "My last Microwave lasted 7 years and this one has had issues since it was 6 months old. Not much life built into this product... don't buy it",
      "rating": 1.0,
      "verified": true,
      "author": "John Beck",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "junk microwave",
      "text": "This microwave died after 13 months which was one month out of warranty !! The microwave was good while it worked. If you buy this microwave better purchase the extended warranty",
      "rating": 1.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "One Star",
      "text": "Microwave arrived damaged with a big dent in the back. Box was fine. In order to return an opened box that will charge 20%. Would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Jennifer",
      "helpful_votes": 3,
      "publication_date": 20180318
    },
    {
      "title": "Microwave fails after a year of use.",
      "text": "Like many others the microwave died about a year after it was installed. It trips the circuit breaker and is now worthless. Far too expensive to repair verse buying a new one. Don’t waste your money like I did.",
      "rating": 1.0,
      "verified": true,
      "author": "GUCCIFER 2.0",
      "helpful_votes": 2,
      "publication_date": 20190505
    },
    {
      "title": "The microwave works just fine and looks good",
      "text": "The microwave works just fine and looks good, just like the description given. However, we bought the identical microwave one year ago (2015) and a change was made to the tray fitting inside on the 2016. This change causes a loose fitting on the 3 glass pegs designed to hold the tray. This looseness causes the tray to tip when something is set on it, unless you have the item to be warmed centered and balanced. This is an unnecessary inconvenience.",
      "rating": 3.0,
      "verified": true,
      "author": "spook",
      "helpful_votes": 8,
      "publication_date": 20160923
    },
    {
      "title": "Excellent Choice",
      "text": "Consumer Report lists as a \"best buy\" and was second highest rated microwave, overall. It was easy to install, quiet operation, intuitive control panel, excellent fan air exchange, quality appearance and most important, it does a great job cooking. I am very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "DaveR",
      "helpful_votes": 4,
      "publication_date": 20160912
    },
    {
      "title": "... this microwave in May of 2015 and its working great so far",
      "text": "Installed this microwave in May of 2015 and its working great so far. It fit into the exisitng cabinet opening and installation was easy. Looks great and family is happy with the purchase. This unit seems well made and likely to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 4,
      "publication_date": 20150818
    },
    {
      "title": "Just what I needed",
      "text": "So far so good. It has all the features I need, I like that you press 1 for one minute, 2 for two minutes etc without having to press anything else. You can also add 30 seconds. At first I thought it wasn't as powerful as my previous one but actually cook time is much the same. I've only had it three weeks but it's just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "C.Allison",
      "helpful_votes": 2,
      "publication_date": 20160428
    },
    {
      "title": "Lived 2 years 360 days R.I.P.  POS",
      "text": "Here is an update. It lasted 2 years and 360 days. Dead. The first microwave the door was smashed. Quick return and reorder. I was replacing am old one so all the marks were there. Just mount the back plate and bolt it up. The only con I have is the buttons are not back lit and can not be seen in low light. Love it otherwise. Great seller.",
      "rating": 2.0,
      "verified": true,
      "author": "leadpipe58",
      "helpful_votes": 0,
      "publication_date": 20180114
    },
    {
      "title": "Excellent choice, easy to install",
      "text": "I read other's reviews and decided to buy item. Excellent choice, easy to install, works great and looks fabulous.",
      "rating": 5.0,
      "verified": true,
      "author": "robthehandyman",
      "helpful_votes": 11,
      "publication_date": 20141007
    },
    {
      "title": "Died after less than 2 years/ replaced with the same model for easy install",
      "text": "My first one died after 2 years it was easier to just replace with the same model as before",
      "rating": 3.0,
      "verified": true,
      "author": "David G M",
      "helpful_votes": 2,
      "publication_date": 20170811
    },
    {
      "title": "GE still produces some of the best products out there",
      "text": "GE still produces some of the best products out there. Once I got used to the proper touch on the key pad and the position of particular keys, it was easy to warm, defrost and cook everything. I have become creative with warming times and powers for several items and have never been disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma D.",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "I had the box unopened for one month till a ...",
      "text": "I had the box unopened for one month till a handy man came over to help with the installation today. As we opened the box, the glass door was all shattered to pieces. Now I cannot return it because I took longer than a month to open it. :-(",
      "rating": 1.0,
      "verified": true,
      "author": "Maria E. Hamm",
      "helpful_votes": 5,
      "publication_date": 20171212
    },
    {
      "title": "GE microwave",
      "text": "This microwave broke within 14 months right after the warranty expired I would not buy this product ever again plus the phone number for support listed on my Amazon account under the product is no longer available.",
      "rating": 1.0,
      "verified": true,
      "author": "DL",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "Some minor issues with installation.",
      "text": "The microwave seems high quality. As mentioned the key pad is quite dark fortunately we have a well lit kitchen. The installation instructions were very good with the exception of the template for installation of the mounting bolts from above. The thin paper template was impossible to attach as directed. It should be made of some sort of construction paper so that it could be held up to locate the drilling holes and other cuts necessary. Mounting of the damper was not well explained. All in all a good buy. I would purchase again.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaypee",
      "helpful_votes": 7,
      "publication_date": 20170210
    },
    {
      "title": "Great heavy duty oven.",
      "text": "Works like it is supposed to. It is a larger oven than I am accustomed to so will cook things quicker. Something I had to get used to. Does a great job, but can be a little difficult to clean on the outside. I like to keep it sparkling.",
      "rating": 4.0,
      "verified": true,
      "author": "butterfly",
      "helpful_votes": 2,
      "publication_date": 20171008
    },
    {
      "title": "Unreliable GE Microwave",
      "text": "This GE microwave died after 2 1/2 years. Cost to repair, according to GE factory technician, would be 2 1/2 times the original purchase price. Based on other reviews, it appears this GE model has severe issues. Appears many others have experienced the same issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Works for me - good quality",
      "text": "This better live up t o Consumer Reports. It's my third microwave in four years. The panel is a little difficult to translate, so save the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "Jan Tomas",
      "helpful_votes": 0,
      "publication_date": 20180608
    },
    {
      "title": "Replacement item",
      "text": "They changed the color of the readout from green t0 white numbers and letters. Doesn't match the other GE products. This was an exact replacement for a 2 year old GE oven of the same model number.",
      "rating": 5.0,
      "verified": true,
      "author": "NS",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "I really like this microwave.",
      "text": "I really like this microwave. Cooks everything very evenly and it really makes the appearance of my kitchen stand out. I did have to adjust the area where it was being mounted due to the Tile backsplash in my kitchen, but that's not really the microwaves fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Nice replacement,",
      "text": "Pain in the butt to install. We purchased this to replace the 15 year old GE that finally quit working. We were able to use the previous wall bracket, thank goodness.",
      "rating": 5.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 2,
      "publication_date": 20160522
    },
    {
      "title": "New microwave",
      "text": "Excellent unit. Easy to mount, easy to use, perfect for our use. We like the new features that are installed. Happy with the price. The last GE microwave we had lasted over 10 years with lots of use. Only problem we find is the control panel is almost impossible to see in a low illuminated area. We have to turn on the bright lights to see the panel. Is there an illuminated panel available?",
      "rating": 4.0,
      "verified": true,
      "author": "Bob40- NOT ME!=",
      "helpful_votes": 2,
      "publication_date": 20160929
    },
    {
      "title": "Died in 2 years and 3 months",
      "text": "Headline says it all. Bought new here on Amazon in October of 2016. Just died today, 1/9/2019 after weeks of tripping circuit breaker over and over again. Stay away! Consumer Reports reviews are mostly 1 star...",
      "rating": 1.0,
      "verified": true,
      "author": "DoITRight2112",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "Not even two years with minimal use",
      "text": "Please, read the reviews confirming my negative experience. Although it worked well until the end, the end was at least eight years too soon. After replacing a 10+ year old unit, this one died in less than two. It was used only occasionally. Now we have no microwave, no stove light, and no ventilation fan. Junk!",
      "rating": 1.0,
      "verified": true,
      "author": "ASD",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Broke after 2 and a half years",
      "text": "I am livid. $200 microwaves only last less than 3 years now. Such junk and I am screwed now because the warranty is up and it will cost more to fix it than it would to buy a new one.",
      "rating": 2.0,
      "verified": true,
      "author": "Bridget T",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Unreliable",
      "text": "I bought this microwave in Dec. 2016 from Amazon. It has suddenly stopped working (June 2018). Really disappointed with this. GE appliances suck. It is not in warranty anymore. My previous microwave lasted over 10+ years.",
      "rating": 1.0,
      "verified": true,
      "author": "AnjuScout",
      "helpful_votes": 0,
      "publication_date": 20180613
    },
    {
      "title": "Just opened today... unit was damaged. ...",
      "text": "Just opened today...unit was damaged...was going to return but the return window closed 2 days ago...unfortunately I just open the package",
      "rating": 1.0,
      "verified": true,
      "author": "Leif Keelty",
      "helpful_votes": 2,
      "publication_date": 20170930
    },
    {
      "title": "Looks nice, but the menu is hard to read because ...",
      "text": "It works, that's the main thing. Looks nice, but the menu is hard to read because the color contrast on the lettering is too light. When I open the door, it makes a noise that sounds like a spring might be loose.",
      "rating": 3.0,
      "verified": true,
      "author": "Lenore",
      "helpful_votes": 2,
      "publication_date": 20170329
    },
    {
      "title": "Had to replace it after 3 years.",
      "text": "Would not buy one of these again, After 3 years it stated throwing the breaker. Stopped working and would not start. Buy at your own risk!!",
      "rating": 1.0,
      "verified": true,
      "author": "Mike W.",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "t",
      "text": "Arrived promptly and product was as advertised. The biggest disappointment was significant shipping damage, crushing both bottom rear corners of the microwave. Was shipped in its original manufacturer's box in a flimsy foam mold that did not seem to protect such a heavy object from careless handling. Installed it anyway because of the hassle involved in a return, and because the major damage was a the rear. The template instructions are ambiguous for a recessed overhead cabinet install. Also, there are 3 screws to hang the microwave but the template shows only the 2 outer ones. The rear wall bracket positioning is easy, however. The machine is quiet and has more features than average for its price.",
      "rating": 3.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 16,
      "publication_date": 20170115
    },
    {
      "title": "Nice",
      "text": "Not bad for the price, work pretty good , the only draw back is the underside range lights have a T7 base so they can't be replaced with long life LED bulbs.The replaced incandescent bulbs are $16.00 per bulb",
      "rating": 4.0,
      "verified": true,
      "author": "Tony Elam",
      "helpful_votes": 0,
      "publication_date": 20170607
    },
    {
      "title": "If you buy it, get the insurance",
      "text": "We have been using this item for 1 year and a few weeks and it has already died on us. When it was working it made an odd creaking noise as the plate turned. This does not seem to be a quality product.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170731
    },
    {
      "title": "Last 2 1/4 years",
      "text": "Not bad considering the other reviews I see now only made it a year. Still, I expect 7 - 10 from a microwave. I did some troubleshooting and it's the high voltage transformer so it's not an inexpensive fix. Might as well buy a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Matt V.",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Great price, fast delivery",
      "text": "Excellent price, and fast delivery. Installation was interesting, but done fairly easily. Beats waiting weeks for Lowes or Home Depot, who wanted over $100 more for it!",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton E. Laballe",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Basic microwave that does its job perfectly",
      "text": "It was easy to install even with drilling new holes. The lights for over the range are brighter too compared to the old one it replace.",
      "rating": 5.0,
      "verified": true,
      "author": "Doc B",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Can't Read Panel",
      "text": "Impossible to read panel. Gray on black has no contrast. shine a light on it to see, and the glossy face glare makes viewing difficult. Big mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "glop",
      "helpful_votes": 4,
      "publication_date": 20170613
    },
    {
      "title": "It does the job.",
      "text": "Great product. Easy install and has all the bells and whistles you could ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl J. Laguzzi",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Doesn’t last",
      "text": "July of 2018 and a Lilly’s over 18 months and this oven is now garbage. Started blowing the circuit breaker in June and afte installing higher amp line and dedicated circuit we achieved the same results. Would not recommend. I hold replaced an old Montegery Ward oven that came with house. 20+ year and eight folks in the house. I should have never made the switch",
      "rating": 2.0,
      "verified": true,
      "author": "JOHN L.",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Do not purchase",
      "text": "Had two of these fail in 18 months. The fans let go and sounded like a Mac truck",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Just as advertised.",
      "text": "Not too much stainless so that it goes well with my black appliances.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180915
    },
    {
      "title": "Not as a sturdy as the similar GE model from 15 years ago",
      "text": "Was a good deal, looks nice and works. And, it feels \"plinky\" and less robust as it used to be. Now owned and built by Haier, which I hadn't realized. Hope this one last 15 years too, finger crossed.",
      "rating": 3.0,
      "verified": true,
      "author": "Matthew S. Hanover",
      "helpful_votes": 0,
      "publication_date": 20200518
    },
    {
      "title": "Ge microwave",
      "text": "Fit perfectly in the place my old microwave, has improved light display. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Rena greisel",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Good Microwave but Space Between Glass Panels Trap Steam",
      "text": "I installed it the same day I received it. The unit works well and was easy to install. My only minor complaint is that the space between the glass panels on the door steam up when defrosting items. The manual says this will happen sometimes but should dissipate over time. Well, mine did not. I had to run the microwave for 5 minutes to make it dry up. While the manual says this is expected, I am not sure I like that this happens. We will see what happens.",
      "rating": 4.0,
      "verified": true,
      "author": "SC",
      "helpful_votes": 7,
      "publication_date": 20170118
    },
    {
      "title": "Don't waste your money.",
      "text": "Had this microwave for a year then it died. The same model before, that one died after 2 years. Garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "Jesse Loman-Hayes",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Two Stars",
      "text": "The buttons should light up. Can't see where the light button is at night.",
      "rating": 2.0,
      "verified": true,
      "author": "fococo",
      "helpful_votes": 0,
      "publication_date": 20171030
    },
    {
      "title": "Dead after 14 months",
      "text": "Started tripping the circuit breaker after 14 months. Stopped working entirely shortly afterwards.",
      "rating": 1.0,
      "verified": true,
      "author": "MARK N GIBSON",
      "helpful_votes": 4,
      "publication_date": 20180217
    },
    {
      "title": "Worked beautifully. The range lights have 2 setting night and ...",
      "text": "Worked beautifully. The range lights have 2 setting night and bright. They work well by my door and are replaceable.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20170327
    }
  ],
  "product_meta": {
    "title": "GE JVM3160RFSS 30\" Over-the-Range Microwave Oven in Stainless Steel",
    "description": "1. 6 cu. Ft. Capacity convenience cooking controls auto and time defrost turntable on/off two-speed, 300-cfm venting system^^color: stainless MICROWAVES number: jvm3160rfss commercial category: over-the-range TOTAL capacity (cubic feet) : 1. 6 Microwave watts (iec-705) : 1000 power levels: 10 turntable: glass Microwave convenience cooking controls : Popcorn beverage potato reheat defrost: WEIGHT/time cook time overall depth: 15. 25 overall height: 16. 5 overall WIDTH: 29. 875.",
    "rating": 3.1,
    "feature_bullets": [
      "1. 6 cu. ft. capacity. 1000 Watts (IEC-705 test procedure)",
      "Dimensions: 29.87\" W x 15.25\" D x 16.5\" H | Net Weight: 63.0 lb",
      "Auto and time defrost. Defrosting times and power levels are programmed automatically or manually for optimal results",
      "Turntable On/Off. Controls turntable operation",
      "Two-speed, 300-CFM venting system. Removes smoke, steam and odors"
    ],
    "specifications": {
      "Brand Name": "GE",
      "Model Info": "JVM3160RFSS",
      "Item Weight": "61.9 pounds",
      "Product Dimensions": "15.25 x 29.88 x 16.5 inches",
      "Item model number": "JVM3160RFSS",
      "Is Discontinued By Manufacturer": "No",
      "Energy Use": "1000 Watts",
      "Capacity": "1.6 Cubic Feet",
      "Installation Type": "Over-the-Range",
      "Part Number": "JVM3160RFSS",
      "Color": "Stainless Steel",
      "Wattage": "1000 watts",
      "Material Type": "Stainless Steel",
      "Included Components": "JVM3160RFSS",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "Manufacturer Warranty": "Free 1yr Warranty on Major Components",
      "ASIN": "B00F2QFX5O",
      "Customer Reviews": "3.1 out of 5 stars491 ratings3.1 out of 5 stars",
      "Best Sellers Rank": "#18,278 in Kitchen & Dining",
      "Date First Available": "September 9, 2013"
    },
    "categories": [
      "Microwave Ovens",
      "Small Appliances",
      "Home & Kitchen",
      "Over-the-Range Microwave Ovens",
      "Appliances",
      "Kitchen & Dining"
    ],
    "price": 279.0
  }
}