{
  "website_summaries": [
    {
      "verdict": "A fantastic choice for parents who want a toy that functions as well indoors as it does outside.",
      "pros": [
        "Includes a track for damage-free indoor riding",
        "Can be removed from track and ridden outside",
        "Easy push of a button begins and ends battery-powered ride",
        "Parents with toddlers adore this versatile product"
      ],
      "cons": [
        "Recharging battery is a bit of a hassle",
        "Some customers have issues with the train arriving with missing pieces"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "An easy-to-ride Thomas the Tank Engine that works off or on its 18-ft. track.",
      "pros": [
        "Familiar face and charming sound board",
        "Kids can sit or stand while driving, as the T-bar handle is easy to hold either way",
        "Track is easy to assemble",
        "Train can be used on or off the track",
        "2mph speed is ideal for younger kids"
      ],
      "cons": [
        "Weight capacity is 40 lb., and it’s recommended for indoor use only",
        "Learning curve for press-button operation"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Whether he follows the tracks or chugs over your floors and sidewalks, this ridable Thomas the Tank Engine is guaranteed to impress his smallest fans.",
      "pros": [
        "Extremely simple push-button operation",
        "Includes circular train track",
        "Rides up to 2 mph",
        "Talks and makes train sounds",
        "Especially durable",
        "Can ride without the track"
      ],
      "cons": [
        "The most expensive Thomas available"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Totally recommend.",
      "text": "This is awesome, simply awesome! My 2 1/2 year old fell in love with it as soon as he got on after I put together the track & hasn't gotten off... It's been 3 hours! This picture shows how much he loves it, he fell asleep after being on it for 4 1/2 hours <3 ^-^",
      "rating": 5.0,
      "verified": true,
      "author": "MyGee",
      "helpful_votes": 294,
      "publication_date": 20160728
    },
    {
      "title": "A lot of fun for little people:)",
      "text": "We have a lil quad with track already, which my son really loves to play with. So I decided to extend the track and now we have some more fun :)",
      "rating": 5.0,
      "verified": true,
      "author": "Slk",
      "helpful_votes": 91,
      "publication_date": 20180109
    },
    {
      "title": "3 years and 5 grandchildren later",
      "text": "Bought this for 15 month and 18 month old grandchildren over three years ago. It has been used by a toddler for three years. We just got it out of storage, purchased a new 6volt battery. Just set it for the next two grandchildren ages 15 months and two years. Sturdy, easy to assemble and a favorite of 5 little ones used frequently over three years. Wish all toys were made this well.",
      "rating": 5.0,
      "verified": true,
      "author": "DW",
      "helpful_votes": 36,
      "publication_date": 20171228
    },
    {
      "title": "Durable, easy, and long lasting battery.",
      "text": "This train is awesome! I bought it for my grandson for Christmas. He is just barely 1 year old. I was amazed at how within minutes he was able to operate the train completely on his own! The track is a large circle and even having a small home, it works nicely in my living room. Off of the track we do have to help him navigate it because he doesn't understand turning. But on the track he goes all by himself! The best part is, I haven't had to charge it since Christmas! That is over a month now that it's run on the same charge. Great price for a really great product. Very satisfied!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer ward",
      "helpful_votes": 16,
      "publication_date": 20180127
    },
    {
      "title": "Missing parts!!!!",
      "text": "I ordered this train for my Godson birthday. As his mother started to put it together she noticed that the train may have been used because in the directions it says to put the battery inside the train & the battery came already inside the train. It was also missing the charger & the steering column cap. I paid for a NEW train not an used one & most definitely not one that’s missing parts. This is unacceptable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmine Patillo",
      "helpful_votes": 12,
      "publication_date": 20180819
    },
    {
      "title": "One of the best gifts we bought for our kids.",
      "text": "This is a hit at our house. We have a play room where we are able keep it assembled. My kids continue to play with it on and off but anytime friends come over, it is a big hit. We purchased the extension peices that I would recommend getting to make an oval and a slightly bigger track. We did get a second track with an extension from someone selling their used one online and we were really able to make a fun configuration. CAUTION: because it is in a track it is more of an in door Powerwheel. However, don’t let your kids drive it off the tracks on hardwood floors, it will scrape and sand the floor.",
      "rating": 5.0,
      "verified": true,
      "author": "cdl",
      "helpful_votes": 4,
      "publication_date": 20181124
    },
    {
      "title": "Must have for toddler!",
      "text": "Oh man, we got this for our toddler last Prime Day and gifted it to him on Christmas (I'm super late on this review) but it is AWESOME. My 22 month old wakes up in the morning and immediately goes \"choo, choo\" and jumps right on. He is obsessed with it. I highly recommend it. The tracks are so smooth and the battery life on the train is actually great for the amount of time spent on it. We absolutely love it and recommend it to all our friends. It does take up a lot of space but totally worth it for all the joy it brings to our little bud!",
      "rating": 5.0,
      "verified": true,
      "author": "Julia",
      "helpful_votes": 3,
      "publication_date": 20190409
    },
    {
      "title": "Best Toy Ever",
      "text": "This train is awesome. Perfect Christmas gift for my 13 month old. He LOVES IT! My 3 yr old loves it too. I wish there were cool toys like this out when I was a kid. The only thing I don't like is in order to charge the battery you have to unscrew the seat- that's annoying. The upside to that is it holds a charge. We charged it for 18 hrs on Christmas day, its four days later and we haven't had to charge it since and the kids play with this throughout the day, even took it outside. The tires could be made a tad better. Other than that two thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Yvette King",
      "helpful_votes": 6,
      "publication_date": 20161228
    },
    {
      "title": "He wants to ride it all the time and has so much fun. He even falls asleep riding sometimes haha",
      "text": "I can't give this toy enough stars. I got this for my little boy who is 11 months for his first Christmas and he absolutely won't leave this thing alone. He wants to ride it all the time and has so much fun. He even falls asleep riding sometimes haha. The only thing that could have made this better is if there was a switch instead of a button to make it go. We just take the button down since he doesn't quiet understand to push it yet but he LOVES this toy. Would recommend to anyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 8,
      "publication_date": 20161227
    },
    {
      "title": "Great!",
      "text": "It is exactly as described. The battery holds a charge for a really long time and my 2 year old loves riding it! It does have a big footprint when you use the track but you can use the train without the track too. That being said, the track is easy to take apart and put back together so, you can easily put it away when you don't want it taking up space. When deconstructed, the track doesn't take up much space and is easily stored in a closet. It was a great purchase that made my 2 year old light up! Definitely recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Johnson",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "My 3 year old loves this train!",
      "text": "My 3 year old loves this train set! He rides on it literally everyday. The directions were very clear and the product is amazing quality. You can ride on it with or without the track but he loves the track the post. He’s 34lbs and it’s perfect for him. The only complaint I would have is the stickers. They about sent me over the edge lol. You best make sure once you press it even a tiny bit that’s where it needs to be because they will rip to pieces If you attempt to reapply. That’s a small issue compared to how amazing this product is. Highly recommend!!",
      "rating": 5.0,
      "verified": true,
      "author": "Heather ",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Too loud and small",
      "text": "For the price, you get a really small track. I bought the extra track and it's still so small, your kid like mine will get tired of going around in a small circle. It's also super loud, drowning out any tv or conversation. It can run off the track if your child steers it straight. It works and does as it says. Haven't tried it outside yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Eugene",
      "helpful_votes": 3,
      "publication_date": 20180329
    },
    {
      "title": "Love it!",
      "text": "My boy was 2 years old when he got this. It is perfect for him! It allows him to ride even though he is not able to steer yet. It's super loud, but he doesn't care. He can ride it unsupervised because the tracks keep him on the loop and keep him from hitting a wall or furniture. 6 months later, he still likes riding it and when he's ready, he will be able to ride it without the track so pretty good staying power so far. When he has friends over, it's a favorite for them too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jumps in Leaves",
      "helpful_votes": 5,
      "publication_date": 20170918
    },
    {
      "title": "Cute!!!!!!!!!!",
      "text": "Very cute. 10 month old loves it. He def needs some time but he will grown into it. We taped the button down for now until he can learn to push the button on his own. I also love that the car drives without the track.",
      "rating": 5.0,
      "verified": true,
      "author": "Rmsoo",
      "helpful_votes": 3,
      "publication_date": 20190205
    },
    {
      "title": "Not bad",
      "text": "This is a pretty cool train that works well and has a good amount of sounds. My only disappointment is in the number of tracks and the difficulty in maintaining the trains movement. The train is more adequate for kids from 2 years old to early 3 and around then it can be difficult for them to maintain the button to go forward. My son would get frustrated and just manually push it around or give up. So, its a cool toy but really did not get much use.",
      "rating": 3.0,
      "verified": true,
      "author": "Mukaking",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Best ride on toy-Power Tracks Ride on Thomas the Train with tracks",
      "text": "This ride on train and track are the best! It was easy to finalize the assembly by putting the steering handle on. My grandkids had fun putting the track together and putting the stickers on, as well as riding on it. With almost constant use, the battery lasts a good six hours on one charge. Be sure to charge it before you want to use it the first time!",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Great Christmas Gift",
      "text": "Great gift for the two-year old. It moves across the lawn well too. I added duct tape to the drive wheels to help with traction as it the wheels can slip a bit on the track - now it scoots along fine. Battery lasts a long time. Track is easy to set up. It was a pan to apply all the decals and they are fading fast but we keep in the shed out back. We've had this one year and it still is holding up with no signs of slowing down.",
      "rating": 5.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 4,
      "publication_date": 20161213
    },
    {
      "title": "A great buy !!",
      "text": "My 14 mth.old Nephew is having lots of fun with his Thomas ride on toy. The battery takes 18 hrs. to charge for the first time, but with full power it's able to ride two toddlers on it. It has pretty good speed, perfect for his age. They work well on the track, but they can be ridden around without the track. Great buy for the price !! I def scored big points with this gift. He loves it. This was one of 2 that I bought, both toddlers love their new train.",
      "rating": 5.0,
      "verified": true,
      "author": "Susie Boudreaux",
      "helpful_votes": 0,
      "publication_date": 20190114
    },
    {
      "title": "One grandtwin LOVES it, one is not so sure ...",
      "text": "One grandtwin LOVES it, one is not so sure. I think he'll come around. Be aware that the white plug connection to the battery is really hard to push together. It took some steady pressure, easing it back and forth and its still not completely locked in. It'll be ok since there is no way for anyone to knock it around, but I almost gave up.",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela Scherzer",
      "helpful_votes": 2,
      "publication_date": 20180725
    },
    {
      "title": "So stinking cute!!!",
      "text": "I got this for my grandson. He is 14 months old and mastered the buttons after 15 minutes. It's the cutest thing and he LOVES his choo choo... The best thing about this is you can take it off the track and let them drive around outside on it when it warms up.. I highly recommend and I think the price is great for what you get and foot the smiles that it puts on my grandsons face!",
      "rating": 5.0,
      "verified": true,
      "author": "superstar",
      "helpful_votes": 3,
      "publication_date": 20180122
    },
    {
      "title": "Highly recommend!",
      "text": "Bought this for my great grandson’s first birthday. He took to it instantly and loves it. Now at 16 months old, he rides his Thomas train all of the time. This can be used with track or without and inside or outside. My great grandson loves this! I highly recommend. I purchased this based on reviews. Now I, too, give this Thomas train my high recommendation.",
      "rating": 5.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 2,
      "publication_date": 20180914
    },
    {
      "title": "Amazing product but the stickers come off easily and a pain to put on.",
      "text": "Its incredibly easy and quick to assemble and take apart. The battery life is excellent and my sons absolutely loves riding it on and off the tracks, as well as pushing it around. Excellent item and totally worth the cost. My only complaint is the stickers. They are a pain to put on and should already be done by manufacturing. They also come off easily after a few weeks of use. Still a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "Faina",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Fun for kids of different ages",
      "text": "We purchased this as a Christmas gift for our boys ages 1 and 4. They both really enjoy being able to ride on it. Our 1 year old typically just rides in circles around the track which keeps him from crashing into the walls while our 4 year old will take it off the track and ride around the house. The battery lasts a long time and provides hours of entertainment. The biggest pain is having to remove the screws on the back whenever you need to recharge the battery.",
      "rating": 5.0,
      "verified": true,
      "author": "Jlrrx2206",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "hours of fun!",
      "text": "the only bad thing about this train is having to explain to your kid that they cant ride it till you initially charge it.. so if you're buying it as a gift for someone else charge the battery before you gift it to them! hours and hours of fun! just remember to charge it every night! have gone through hundreds of charge/drain cycles and the battery is still good. when the battery dies i will replace it with a lithium battery (search youtube lots of instructions)",
      "rating": 5.0,
      "verified": true,
      "author": "Mohammed j.",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "This is a great toy",
      "text": "We got this train two years ago in December of 2016 and it's still going strong and a favorite among our children. Our four year old daughter is starting to out grow it but our two year old son loves it. We bought the extra track so they could have a larger circle, which I would highly recommend. The battery lasts longer than i expected as well. Overall, this has been one of the best toys we have gotten for them.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171019
    },
    {
      "title": "Great ride on toy!",
      "text": "My son loves this! He got it at 11 months old and has been able to ride it by himself since day 1. The go button is easy enough for him to hold in and keep himself entertained!! He loves the sounds Thomas makes as well! My son weighs 23 lbs so sometimes he has a hard time getting Thomas to go but that’s only because he’s standing up riding it like a wild man and there’s not enough weight!",
      "rating": 5.0,
      "verified": true,
      "author": "Maxtrans",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "BEST TRAIN",
      "text": "My grandson is only two but lives and breathes CHOO CHOOs. I found this and couldn't resist. He got it for Christmas and they didn't have to charge the battery for about a month. Right now it is an indoor toy. There was a little assembly required, that I didn't need to do, but overall this is an awesome purchase and will last a long time. I would highly recommend this train. They just use it w/o the rail.",
      "rating": 5.0,
      "verified": true,
      "author": "BuckeyeFan",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Played with everyday by both 2 and 4 yr old! Where is this additional track everyone speaks of?",
      "text": "Great product overall! Very cute lots of stickers and such to tend with so don’t think you are just gonna throw it together in 15 min plug it in and be out the door. However....totally worth it. I thought the music and voice of Thomas would annoy me but I actually find it charming (they don’t push the button on repeat and actually use it appropriately lol) battery life lasts forever. I would highly recommend more track and an easy link to access said track! We have a pretty large open floor plan so it gets moved from the track often but More track would keep it contained and add an additional element of play.",
      "rating": 5.0,
      "verified": true,
      "author": "CAT",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "An amazing toy for any Thomas fan!",
      "text": "ABSOLUTELY ADORABLE! Super easy to put together and has now lasted us 2 years!!! Thomas rides both on the tracks and floor (weve never brought it outside) and even 2 years later is still one of my sons favorite toys. The sounds are great and if you buy a cute enginer hat, your child will have hours of play :) My son even uses his tools to \"work on\" Thomas. Perfect addition.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie Jo",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Push start glitches sometimes, but otherwise fun!",
      "text": "There are many things that I like and few things that I dislike. I like the quality of the Thomas Train itself. It’s very durable! I wish the factory put the stickers on instead of sending them for consumers to apply, but it came out just fine! The battery lasts, but sometimes the push start button glitches and doesn’t want to go from time to time. My son is 20 months old and loves it!",
      "rating": 4.0,
      "verified": true,
      "author": "Mariah L.",
      "helpful_votes": 0,
      "publication_date": 20200320
    },
    {
      "title": "Buy it",
      "text": "My son loves this. He was a little unsure at first because its a bit loud but once he got a hang of it he’s not even two and he’s doing tricks on it. He figured out he can “sidesaddle”, and stand on it in different ways. We live in a small apartment and with the world being so crazy I wanted more for him to do inside. This was definitely worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Story",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Would definitely buy again",
      "text": "My grandson absolutely loves this train!!! He rides it all day till he literally falls asleep on it. Turned out to be his favorite Christmas present. I did buy some extra tracks but it only came with 4 straight tracks which was nice however I would have liked to have bought some additional curved tracks too.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "GRANDSON LOVES THOMAS THE TRAIN",
      "text": "This is such a cute ride on toy. Our almost 2 year old grandson loves Thomas the Tank. He rides it so long, he actually falls asleep on it. We got him a lot of the small battery operated Thomas the Tank trains and he uses the inside of the track for his trains to ride around. You have to put Thomas off the tracks to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "So cute! My son loves it",
      "text": "Got it for my sons 1st birthday gift l. Took him a day or so to figure out how to push and hold the button but once he figured it out he was cracking up and obsessed!! It is a little loud but so is his laughter on it - fair trade",
      "rating": 5.0,
      "verified": true,
      "author": "M. Woods",
      "helpful_votes": 2,
      "publication_date": 20190212
    },
    {
      "title": "Battery or motor broken after 6 months",
      "text": "Baby didn't start enjoying riding this with battery mode till maybe 2 months ago, and the battery or motor has already broken. The warranty pdf on this page needs an update on return form and shipping label. Other than that, this has been a really fun toy and one of baby's favorites!",
      "rating": 2.0,
      "verified": true,
      "author": "Li Pi",
      "helpful_votes": 0,
      "publication_date": 20190920
    },
    {
      "title": "My Grandson LOVES TO RIDE THIS TRAIN and cries when he has  to get off!!!!",
      "text": "Great Quality and very easy to recharge the battery. The battery life lasts a long time also which is great. This is an adorable toy and is one my Grandson never tires of. He is 14 months old and cannot push the on button yet, but we use a small pad and a rubber band to keep the train on. He will ride it for an hour if we let him. Cries when we take him off.",
      "rating": 5.0,
      "verified": true,
      "author": "PATTY MILLER",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Once we got everything scrubbed down and cleaned it was great. Not worth the $7 savings for open box ...",
      "text": "Fabulous toy! My son LOVES it. Don't order the open box/Amazon Warehouse deal. Opened the box after it was delivered and it was FULL of MOUSE POOP! So gross. Once we got everything scrubbed down and cleaned it was great. Not worth the $7 savings for open box though. Yuck.",
      "rating": 4.0,
      "verified": true,
      "author": "That1girl",
      "helpful_votes": 2,
      "publication_date": 20180426
    },
    {
      "title": "BEST TOY!",
      "text": "My son is obsessed with this toy! Its amazing because its sits on the track so he is running or driving all over my house just going in circles and he loves and I mean loves it! all his friends fight over it and my friends have bought them for their kids. We were going to save it for Christmas but I'm glad we gave it now! I wish they made more toys like this that stayed on the track its makes it so much easier on the parents. HIGHLY RECOMMEND",
      "rating": 5.0,
      "verified": true,
      "author": "Christine",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Best toy ever",
      "text": "This is the perfect goft for a 1 year old. My child loves his train and spends a lot of time going in circles on the track. The track is just large enough to go around a small reclining chair. The battery life is very long when only used on the track. I think my son did close to 1000 laps on the first charge. The battery dies much faster when used on carpet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Rohlik",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Wonderful Toy!!!",
      "text": "LOVE that this comes with a train track so that I don't have to keep re-routing the train. The fact that this doesn't come with a \"reverse\" button doesn't matter because of the tracks! Genius! So far, the tracks that comes with the set is enough to keep my 18 mo old interested. I'm glad that there is the option to extend the tracks by purchasing additional track pieces. The sounds that Thomas makes totally delight my son. He just loves pressing the button over and over again. He even dances to one of the songs. This will bring smiles to any child. Installation was a breeze. The quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "KamikazeKidd",
      "helpful_votes": 2,
      "publication_date": 20161215
    },
    {
      "title": "REVERSE ONLY....NOT THE BATTERY!",
      "text": "The train must be wired backwards when we press the button it goes in reverse. The representative said the battery’s polarity was reversed and promised to send me a new one. It did not show up and I replaced it myself. It still goes in reverse.... the assembly Must be wired backwards....which I cannot fix because the space is so tight inside of the train you can’t get to the wiring without totally taking apart the whole train apart which is made of plastic and would make it not rebuildable.",
      "rating": 1.0,
      "verified": true,
      "author": "James Holcombe Jr.",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Versatile",
      "text": "Great for indoors or out. It could take up most of your room, need about 6 feet round for the track. However can be used without the track. The battery charging is a little tough. You have to open the seat to charge it. However it does keep kids from getting to the battery when riding. Our grandson loved it! Rode it frontwards, backwards and on the side. Well worth the value.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie YG",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Great present for a toddler",
      "text": "Can’t wait to give this to my youngest grandson for Christmas. I have friends that own one and they love it for their toddler. It will keep the child happily occupied.",
      "rating": 5.0,
      "verified": true,
      "author": "Cozetta C. Herron",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Big surprise your child will love",
      "text": "Granddaughter loves. Check item before you gift. Had to send first one back. It looked used but amazon CS immediately shipped another one. Granddaughter loves Thomas. She also loves this! You won’t be disappointed if it’s new eapecjally if there’s a price drop, which it was purchased at - a Black Friday special pricing!",
      "rating": 5.0,
      "verified": true,
      "author": "CeeCeeCPA",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Thomas Train equals Lots of fun for My Grandson",
      "text": "I really like this Thomas Train set. I ordered more track with it but wish curved track was also available to be able to put it on our porch. My grandson just loves it. It came packaged well and the service was on time as promised. I also wish that the battery was more easily accessed but considering the safety issues",
      "rating": 5.0,
      "verified": true,
      "author": "Trin",
      "helpful_votes": 0,
      "publication_date": 20181223
    },
    {
      "title": "Adorable and well made!",
      "text": "This is a well constructed train set, very easy to put together. One has to take time to apply the stickers/decorations to the train, but they were simple enough. I wish there was an on off switch to have the train would keep running without the toddler having to press the button in the whole time. I can see that not having one might be a good safety feature if the child was using it outside on sidewalks. I bought two sets of extensions rails, of which I have used one set. It's easy enough to add the other extensions when I want to. This is a wonderful item! Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Branch",
      "helpful_votes": 2,
      "publication_date": 20151026
    },
    {
      "title": "Great Purchase",
      "text": "We bought this for my 20 month old son for his birthday/Christmas because he loves Thomas the Train. The train was easy to assemble and the track was also easy to put together. The stickers on the train bubble very easily if the train is left outdoors, but that is my only critic. My son loves to ride this every day and has even learned to ride off the track. He is an average sized boy and he fits perfectly on the train. I think he will probably be able to ride this for at least another year. I recommend buying extra track since the track that comes with the train is very minimal.",
      "rating": 5.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 2,
      "publication_date": 20151230
    },
    {
      "title": "Toddler approved!",
      "text": "We bought this for our 2 year old after watching a youtube video on it. From the moment he got it he hasn't gotten off. He rides it all over the house and loves it. The track was very easy to snap together and is a big circle. It's also easy to take apart. Our son doesn't like riding on the track so we took it down and he just rides it all over the house. He's had it for almost a week now and rides it daily and we haven't needed to recharge the battery yet. The noise it makes while driving is loud, but I guess it's the price to pay for his happiness.",
      "rating": 5.0,
      "verified": true,
      "author": "The Amazon Family",
      "helpful_votes": 2,
      "publication_date": 20151229
    },
    {
      "title": "1 year olds cant push button",
      "text": "so i have twins. one likes this. one us scared of it. the one that likes it cant push and hold the start button so i have to follow the train and hold it. less then 5 mins in my husband and i agree that really hurts our back. the other kid follows the track and train. its a great toy but we need to figure out how to hold this on button....",
      "rating": 4.0,
      "verified": true,
      "author": "Giovanni Beltran",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Awesome!",
      "text": "I just love this thing. My son got it for his second birthday, and he already drives it like a pro. He doesn’t stay on the track, but I doubt that most kids do. The track itself takes up quite a bit of room.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber :)",
      "helpful_votes": 0,
      "publication_date": 20190503
    },
    {
      "title": "Super cute!",
      "text": "Really cute train. Got it for my baby’s first birthday. He learned to press the button within a day. His 2 year old cousin loves it too. The battery lasted for over a month before we had to charge it again. It is kind of loud but it’s a power wheel so it is what it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 0,
      "publication_date": 20181018
    },
    {
      "title": "My Grandson Loves This Train",
      "text": "As soon as we heard about this train, we knew our grandson would love it. He's interested in all things train. It was an excellent present for his second birthday. His parents were somewhat less thrilled with it--until they figured out how to disable the sound. Now everyone is happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Thinker3",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Terrible customer support",
      "text": "Bought on March 6 for our grandbaby's Birthday and it didn't work. Called that day and they said they would get us another shipped out. Well its now April 7 and still no new train! I have emailed them every week only to be told its processing every single time. Well I know we're going through some abnormal times with this virus thing but this actually could have been done before that even started. So disappointed and don't know what else to do at this point.",
      "rating": 1.0,
      "verified": true,
      "author": "Melonie",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "The boy is in love",
      "text": "Our 2 1/2 year old loves this! He is tall, 50lbs and fits it perfectly! Hours of fun. It is a little pain to charge the battery but one charge lasts really long. I love that he can ride it one the sidewalk outside too. Did not come with instructions :( but we figured it out.",
      "rating": 5.0,
      "verified": true,
      "author": "MzDelgado",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Fun train ride",
      "text": "Our grandson loves this train! He’s two years old. We purchased this last Christmas 2018 and just recharged the battery mid-February. He uses it almost daily. The track is easy to assemble and is compact enough to be left out in a play area. Overall, great quality, very durable and lots of fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 0,
      "publication_date": 20190217
    },
    {
      "title": "Buy it!",
      "text": "My kid has been on this non stop since we put it together. It’s quite loud inside but you get use to it! Makes noises/plays songs. Charge has lasted days with lots of use. You won’t regret buying!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190430
    },
    {
      "title": "Super cute",
      "text": "Love this! My 18 month old son was so excited on Christmas morning to see this set up in our living room. We ordered the extra track because it only comes with a circle. However, have since removed the extra track because the circle is plenty big enough. The extra track doesn't extend it enough but, extended it to the point where it seemed to overwhelm our living room. Would definitely recommend this for any Thomas fans.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen O.",
      "helpful_votes": 2,
      "publication_date": 20170105
    },
    {
      "title": "Hands down - the absolute best toy for a two year old that anyone could ...",
      "text": "Hands down - the absolute best toy for a two year old that anyone could have invented. My son is a fairly tall 2 year old and his grandparents bought this for his birthday. He can sit and ride Thomas Independently and safely around the track. And you absolutely can’t beat the price! This toy is cooler than the standard power wheels. And a fraction of the cost. We ordered 6 extra feet of track for about $22 each. Amazing!!!!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Clyde",
      "helpful_votes": 2,
      "publication_date": 20180610
    },
    {
      "title": "Great fun!",
      "text": "Great! My toddler loves this toy and it was easy to assemble. The only thing is that you have to unscrew the seat to reach, remove and recharge the battery. It would have been nice to be able to charge without having to remove screws.",
      "rating": 4.0,
      "verified": true,
      "author": "BeTheSunshine",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Only goes backwards",
      "text": "We finally set this up for mygrandson and it only goes backwards! Whoever put it together didn’t pay attention to the skematics. We have one very disappointed little boy!",
      "rating": 1.0,
      "verified": true,
      "author": "Linda W",
      "helpful_votes": 2,
      "publication_date": 20190109
    },
    {
      "title": "This is great",
      "text": "So much fun for the kiddies. Everything perfect running order. Charges fine. Ordered extra track separately for longer fun. Used with track at birthday boys party and as ride alone fun on sidewalk. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Medina",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Fantastic toy!",
      "text": "Bought this for my grandson's 3rd birthday in October. He loves it. It's easy to set up and easy for little one's to operate. Even his little brother, who's 15 months old, can operate it. My only regret is that I wish we could buy more track for it.",
      "rating": 5.0,
      "verified": true,
      "author": "MVS",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Wouldn't get off",
      "text": "My son would not get off of this train for his birthday party. Very unfortunate as he had to share with the other children there. He still likes his Thomas but not as much as that first day. Easy for him and the 1 year old to ride. But big enough for his 5 year old friend too.",
      "rating": 5.0,
      "verified": true,
      "author": "sammysam",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Great!",
      "text": "My 21 month nephew loves it! He knew what to do with it right away!! He has even fallen asleep while riding :) I don't like how you have to take the thing apart every time you need to charge it. Hold the charge well. Last 1-2 weeks of constant riding. The motor is also a bit loud, but worth it to see his excitement!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla H.",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Buy buy buy!",
      "text": "Absolutely amazing! My son (1 year) and my daughter (2.5 years) love this toy. We bought two extra extenders and it is huge now. My mom loves that the kids can use it off the tracks also. Great for a Christmas gift since it was too cold to go outside. The battery lasts a very time. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "DBrown",
      "helpful_votes": 0,
      "publication_date": 20180121
    },
    {
      "title": "Awesome - but one big flaw",
      "text": "Yes, my kid loves it and it's built sturdy - not cheap at all. However, there is not recharge port for the battery. So each time you need to charge the battery, you have to screw off the seat to get to the battery. I know there's added cost to add in an extra recharge port but it's a $100 toy, should be able to put it in!",
      "rating": 4.0,
      "verified": true,
      "author": "Alexy",
      "helpful_votes": 0,
      "publication_date": 20190521
    },
    {
      "title": "My kids love it",
      "text": "My 1 and 2 year olds never get bored With this. The battery lasted for about a month before we had to charge it again. I wish charging the battery was easier. But since you don’t have to change it often it’s not a problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Vee Jones",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Bought this for my 2 year old, worked for ...",
      "text": "Bought this for my 2 year old, worked for one day, after the second charge the battery does not seem to recharge.Amazon offered full refund however I just want the issue resolved. Seem to be going really round in circles contacting fisher price. The box mentions year warranty on battery/charger..",
      "rating": 1.0,
      "verified": true,
      "author": "paula",
      "helpful_votes": 8,
      "publication_date": 20161230
    },
    {
      "title": "So many stickers",
      "text": "My husband and I got this for my son for his birthday and at the time he was unsure of it. He is now starting to ride on it more and more. The assembly wasn’t terrible but there are so many stickers. My husband and I decided to skip the stickers because you can still tell it is Thomas without them.",
      "rating": 4.0,
      "verified": true,
      "author": "Rebecca Kunkle",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "A little pricier than other ride-on trains, but well worth it",
      "text": "Returned another brand and bought this one in Hope's that it would be better quality. Did not disappoint. We charged the battery in early January... it's almost March and it still hasn't died yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Big C",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Works as promised!",
      "text": "This works as described, and the kids love it. I haven't told them yet it can be taken off the track. They will be running it into walls and knocking stuff over all day long. Took about 30 minutes or so to put together, and I am no expert when it comes to putting stuff together. Using it for 10 minutes a day, the thing has been going for weeks on one charge (they suggest you charge it after every use).",
      "rating": 5.0,
      "verified": true,
      "author": "DWB",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "Choo choo!",
      "text": "Perfect for my almost 2 yr old to ride around house. Really glad it can be driven off tracks. Great speed for indoors stays charged a long time. Only dislike is it's a little noisey but most toys are lol my little guy has fell asleep riding this a couple of times.",
      "rating": 5.0,
      "verified": true,
      "author": "tammy",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "My 2 year old is in love",
      "text": "I build it around our kitchen table, which is oval and tall. My son will make believe that he was riding around a mountain or in a cave..lol truly a blessing to have invested in this item because it is an investment when my son is in all with his new toy!",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "This is a really great train. Only complaints I would have is that ...",
      "text": "This is a really great train. Only complaints I would have is that the stickers were a little difficult to apply and the seat has to be screwed off to get to the battery. Also it is supposed to be charged for 18 hours before use for all of the parents out there giving it as a gift.",
      "rating": 4.0,
      "verified": true,
      "author": "BD Colo",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "I got this for my 13 month old son. ...",
      "text": "I got this for my 13 month old son. He loves it. He figured out how to keep it going by pressing the button on the handle bar. If you show your kid enough, I'm sure they'll be able to figure it out. Before he did though, we were getting dizzy pushing the button for him and going around in circles. I don't know if it's just my son, but I don't think this will keep your kid's attention occupied for that long. I think maybe 5 min tops. Then he's off playing with something else.",
      "rating": 4.0,
      "verified": true,
      "author": "jsmha81",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "Hours of fun!",
      "text": "Got this for my two year olds birthday because he is obsessed with Thomas! He loves it. The track in nice because he doesn't yet understand how to steer but soon he will outgrow the need for the track so it's a nice option that's it works on and off the track. Ours came without the sound box but it was easy to contact Fisher Price and have then send it to us. The only thing I would say bad is that it's pretty loud and the child has to keep the bottom held down to move which keeps the from crashing obviously but can be confusing for them when on the track.",
      "rating": 4.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Best gift ever!",
      "text": "Purchased this as a gift for my Gordon's 1st birthday. I was a little concerned that he might have to grow into it a bit, but I was OK with that. But he loved it from day 1! In no time at all he was riding around and having a blast! It's now his favorite toy. Battery lasts forever on a charge, and the track ensures that he can utilize it year round. Best of all, this is something that is fun and appropriate for a good couple of years. If you're thinking about this as a gift for a little one, DO IT! You will be a hero.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160711
    },
    {
      "title": "doesn't need 18 hour charge :) perfect toy!",
      "text": "My little guy (just turned 3) loves this. I sacrificed to get it and would do it again to re encounter the moment of his excitement upon receiving it. I was so nervous because I assumed (not sure why) that the battery would be a quick charge (like 8 hours), but then noticed that it's advertised to charge for 18 hours, and his bday party was that next morning! But to anyone facing the same, don't worry. After charging for 9-10 hours, I tested it, and it worked! Even lasted 2 weeks!! I ordered 2 sets of the extra tracks to give him a huge oval. He loves it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 2,
      "publication_date": 20150705
    },
    {
      "title": "So much fun!",
      "text": "The baby loves it! Given on his first birthday from auntie and Uncle, it was his most favorite thing he recieved! We nailed it! If you’re debating it, get it",
      "rating": 5.0,
      "verified": true,
      "author": "Sunkissedsunkist ",
      "helpful_votes": 2,
      "publication_date": 20180607
    },
    {
      "title": "This a super fun ride on toy",
      "text": "This a super fun ride on toy! I bought it for my 2 year old nephew for Christmas. My 6 year old nephew who is just at the pound limit kept wanting to ride it when the little one wasn't looking. He can ride along with his older brothers. He loves all things trains and Thomas especially. The assembly was quick and easy to follow the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "Christy",
      "helpful_votes": 2,
      "publication_date": 20160512
    },
    {
      "title": "Boys love it!",
      "text": "My sons loves it. Using it on the track works great but off the track not so much. I think it needs a little more traction on the wheels. I just don't want my LO going around in circles only. My personal preference.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "grandson loves it!",
      "text": "best Christmas present ever! can't believe how my 1 year old grandson just jumped on this and somehow knew to push the button to make it go! he has been riding it every day and now gives his 18 mon old cousin a ride too! they are adorable!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Pitney",
      "helpful_votes": 2,
      "publication_date": 20180213
    },
    {
      "title": "Great fun",
      "text": "Such a great way to introduce your kids to ride on toys. The train stays on the track well, eliminating the need to steer. My two year old son picked it up in a matter of minutes and months later it is still a favorite pastime. The battery life is good, which is good because the charging the battery involves taking the seat off.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric d.",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "Awesome buy!",
      "text": "I sent this to my grandson and he LOVES it! What’s nice is it doesn’t have to be ridden just on the tracks. Any Thomas The Train lover will adore this ride on Thomas and tracks!",
      "rating": 5.0,
      "verified": true,
      "author": "Wendy",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Christmas hit",
      "text": "This is well loved by my 4 year old and 1.5 year old. Battery charge has lasted over 1 week now! One negative is that it’s a little noisy",
      "rating": 4.0,
      "verified": true,
      "author": "Nicole F.",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "He can sit on it fine, but he hasn't figured out how to make ...",
      "text": "I bought this for my son when he turned 1 year old. He's had this for about two months. He can sit on it fine, but he hasn't figured out how to make it go (you have to hold the button down the entire time you want this to go). I'm sure that when he figures that out, he will spend all day on it. The train has 5 or 6 little recorded sounds. They are good, and he likes the thomas theme music the best, but because the motor of the vehicle is so loud, you can't really hear the recording while the train is moving.",
      "rating": 4.0,
      "verified": true,
      "author": "mark r mataya",
      "helpful_votes": 0,
      "publication_date": 20150407
    },
    {
      "title": "My toddler loves it",
      "text": "My toddler loves this train. The battery lasts I haven’t had to recharge it since I got it and when friends came over with their kids they all wanted to ride the train.",
      "rating": 5.0,
      "verified": true,
      "author": "Ana",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Love the train, but wish you could be extra track",
      "text": "I love this and my toddler daughter loves it. I really wish you could buy some additional track--some straight track--though, but while I've been able to find it on Amazon singapore they will not ship to the US. It seems like they're missing out on selling their product. Is it so much to ask to be able to easily buy some extra track?",
      "rating": 4.0,
      "verified": true,
      "author": "Bryan Smith",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Charge up",
      "text": "It's great! Made a very merry Christmas! Just wish I read outside of the box which states to charge for 18 hours prior to first use. Got 12 hr charge in and it has gone three days of on and off us by a 2yo. So 18 hrs was probably a worst case estimate.",
      "rating": 5.0,
      "verified": true,
      "author": "Mikey Mike and the Funky Bunch",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Son loves it",
      "text": "My son likes it. Seems like the battery has a long life. Easy to use. I really wish I could find more tracks to extend the circle a little",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "Great Buy!",
      "text": "I rarely take the time to write a positive review. But a few years in, this train has been great! The battery life is remarkable. It has been left out in the rain - no issues. All five stars are well deserved.",
      "rating": 5.0,
      "verified": true,
      "author": "HG Jenkins",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "Great product but make sure you check the battery",
      "text": "I ordered this for my daughter for Christmas. I ordered it 2 months earlier to get a head start on shopping, plus it was on sale. We took it out of the box on Christmas eve to put together for when she woke up Christmas day. While putting it together, we found out that the battery it came with was the wrong battery. I had to order a new battery which didn't get here til after Christmas. Other than that, it's great and she loves it.",
      "rating": 4.0,
      "verified": true,
      "author": "Suzanne Simons",
      "helpful_votes": 0,
      "publication_date": 20200119
    },
    {
      "title": "Nice product, charging is a bit of a pain",
      "text": "Quick and painless setup, should deliver hours of fun. Battery needs to be removed from the unit to charge, kind of a pain. Why do I need to take it apart each time it needs a charge, seems as though I should be able to plug the charger directly into the unit. Lots of stickers to apply- hope you have a steady hand!",
      "rating": 3.0,
      "verified": true,
      "author": "Fritz",
      "helpful_votes": 0,
      "publication_date": 20170117
    },
    {
      "title": "Kid loves its",
      "text": "Got this for my 2 year old's birthday and he loves it. Only issue was applying the stickers but otherwise easy assembly.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Great little train",
      "text": "This was a Christmas gift for my 10 month old grandson and has been a huge hit! He's still to young to hold down the button to make it move forward but a piece of tape later and he's on the go and grinning from ear to ear! The train seems to hold a charge really well. I highly recommend this train.",
      "rating": 5.0,
      "verified": true,
      "author": "cwelty",
      "helpful_votes": 2,
      "publication_date": 20170105
    },
    {
      "title": "This product is good but not great",
      "text": "This product is good but not great. Using a screw driver to charge the battery is obnoxious. It’s really large ... so make sure you have plenty of space for it. It’s also loud so it may drive you nuts in the house.",
      "rating": 3.0,
      "verified": true,
      "author": "Sidney",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Fun toy",
      "text": "The only thing I'd change is that I'd give it a foot pedal. The thumb throttle is too hard for my grandson to hold and steer at the same time. He pushes with his feet.",
      "rating": 4.0,
      "verified": true,
      "author": "DMR",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "So disappointed! Grandsons 1st Birthday train doesn’t work",
      "text": "never worked, bought it 2 mo. Before my grandsons 1st birthday. Took it out of the box 2 days before his party to charge it. It. It does not work! Today is his party and I’m stuck with a gift that doesn’t work. Too late to return. I’m crushed! I even purchased extra track.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180721
    },
    {
      "title": "Great",
      "text": "Our 2 year old grandson loves this train very sturdy and easy to assemble battery is great so far just got it for Christmas",
      "rating": 5.0,
      "verified": true,
      "author": "PamAmazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Choi choo",
      "text": "Bought it for my one year old grandson and he was too young but he is almost two now and loves it. It.also goes on the floor without the track",
      "rating": 5.0,
      "verified": true,
      "author": "robin dorrin",
      "helpful_votes": 0,
      "publication_date": 20191218
    }
  ],
  "product_meta": {
    "title": "Power Wheels 6V Battery Powered Thomas & Friends Thomas Train with Track",
    "description": "Fisher-Price brings the excitement of Power Wheels indoors so young drivers can take a ride with Thomas! Specifically designed for toddlers, it offers toddler-friendly features including easy-to-use push-button operation, comfortable footrests and six volts of battery power for a fun but safe 1 mph forward speed on track and up to 2 mph off track. Get started by putting together the easy-to-assemble track and letting kids ride Thomas around & around! Then, when they’re ready to steer, simply take the train off the track for limitless adventures! Thomas fans can add to the fun by pressing the yellow whistle for phrases and sounds from their favorite blue engine!",
    "rating": 4.7,
    "feature_bullets": [
      "6 Volt battery powered ride on",
      "Up to 1 mph maximum speed on track  and up to 2mph off track",
      "Fun thomas styling with thomas phrases and sounds",
      "Push button operation for easy stop & go",
      "18 feet of easy to assemble track",
      "Train works on or off the track",
      "For indoor use only.  Weight limit: 40 pounds (18 kg)"
    ],
    "specifications": {
      "Product Dimensions": "27.75 x 13.1 x 17.5 inches",
      "Item Weight": "26.6 pounds",
      "ASIN": "B00F6N06CS",
      "Item model number": "BCK92",
      "Manufacturer recommended age": "12 months - 3 years",
      "Batteries": "1 AA batteries required.",
      "Best Sellers Rank": "#39,115 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars2,177 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "12 months - 3 years",
      "Manufacturer": "Fisher Price"
    },
    "categories": [
      "Ride-On Toys & Accessories",
      "Tricycles, Scooters & Wagons",
      "Toys & Games"
    ],
    "price": ""
  }
}