{
  "website_summaries": [
    {
      "verdict": "This versatile backpack sprayer has a high-volume fan for large lawns and a low-volume fan for foliage and compact areas.",
      "pros": [
        "Comfort-grip wand, continuous spray lock, inline filter, and shutoff",
        "Comfortable: straps are adjustable and padded, and the unit provides lumbar support",
        "Includes 3 nozzles"
      ],
      "cons": [
        "May not maintain pressure very well, so you might find yourself pumping more frequently"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent purchase.",
      "text": "For the price, it simply doesn’t get better than this. Five or six pumps and the sucker is ready to roll. I ended up rinsing it with a gallon of water and letting it go out the nozzle after I was done. It’s probably still a little dangerous after that, but, at least it’s no for the price, it simply doesn’t get better than this. Five or six pumps and the sucker is ready to roll. I ended up rinsing it with a gallon of water and letting it go out the nozzle after I was done. It’s probably still a little dangerous after that, but, I don’t think I want to run soap through it just yet. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Jack H.",
      "helpful_votes": 7,
      "publication_date": 20180824
    },
    {
      "title": "Slow flow, not great quality",
      "text": "This sprayer tolerates much less pressure than an even cheaper model I purchased years ago. As a result, the flow isn’t as fast as you’d want for spraying larger areas. Also the sprayer wand and nozzle are all plastic. I would get a nicer model if I had it to do over.",
      "rating": 2.0,
      "verified": true,
      "author": "bchambers",
      "helpful_votes": 10,
      "publication_date": 20180614
    },
    {
      "title": "Return window STINKS",
      "text": "Did not work on the first time using it. Gee, it's $60 and it doesn't work??? My 2 gallon hand held sprayer has worked for me without issues for 5 years and I needed to upgrade to a larger size as I have a huge yard and was tired of refilling it. Tried it out this morning and already had it filled and on my back and it will not pressurize. I had already read instructions once before filling it and took it off my back and came inside the house all dirty to read them again. No dice, it WILL NOT PRESSURIZE! UGGGGH. Going in the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "betsallonu",
      "helpful_votes": 6,
      "publication_date": 20181121
    },
    {
      "title": "Stopped pumping after just a few spray sessions",
      "text": "I was happy with this pump sprayer the first couple time I used it, but then it suddenly stopped pumping correctly-when you pushed the crank down to increase pressure, the handle would no longer bounce back to suck more air in-I emptied the liquid out and pumped a bunch of air through it and it seemed to work again, but as soon as I put liquid back in it, it stopped pumping again. This is very frustrating since it was not a cheap product. This should be a very simple mechanism that doesn't break after just a few gallons of usage-won't buy again...",
      "rating": 1.0,
      "verified": true,
      "author": "J. Ayers",
      "helpful_votes": 4,
      "publication_date": 20190908
    },
    {
      "title": "this little thing saves the arms. don't have to ...",
      "text": "this little thing saves the arms . don't have to carry a heavy bottle anymore. backpack is the way to go.",
      "rating": 5.0,
      "verified": true,
      "author": "Patty-Jean Dye",
      "helpful_votes": 10,
      "publication_date": 20180127
    },
    {
      "title": "Poor ergonomic design",
      "text": "Handle is not placed properly. Upstroke requires unnaturally high stroke and downstroke you need an arm the length of a gorilla to reach anywhere close to bottom. For this reason it takes an exceptionally high number of strokes to maintain a reasonable pressure. My previous back pack sprayer handle was longer with bends in the handle that made optimum use of your pumping action. I hate this thing will all the passion I can muster, worst one I have ever owned. Look elsewhere. (I HAVE MODIFIED THIS A BIT SINCE I WROTE THIS REVIEW, HAD THE HANDLE BENT UPWARD 30 DEGREES TO ACCOMMODATE THE LENGTH OF STROKE, WORKS MUCH BETTER NOW)",
      "rating": 4.0,
      "verified": true,
      "author": "Dean Fileccia",
      "helpful_votes": 2,
      "publication_date": 20191218
    },
    {
      "title": "Works great",
      "text": "This is my 2nd roundup brand backpack sprayer, my first one is still in great shape (have replaced the spray wand twice) after over 10 years. I wanted a second unit so I can stop using the same hardware for both total vegetation killer and selective broadleaf applications. For anybody wondering if a backpack sprayer is worth the cost, absolutely. No longer lug around a heavy sprayer with one hand, stopping repeatedly to forever pump and pump and pump. These units lets you mix up a good volume (4 gallons) and then hoist on your back for effortless carrying, and then casually pump with one hand while pointing & spraying with your other. This is a huge time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary R Zarback",
      "helpful_votes": 2,
      "publication_date": 20180807
    },
    {
      "title": "Leaks",
      "text": "Worked good the first few times I used it. Just after the return window closed, the tip started to drip, leaving spots everywhere I walked. I followed all of the directions and trouble shooting guides and it still leaks. Would not recommend this sprayer to anyone.",
      "rating": 1.0,
      "verified": true,
      "author": "graywolf201",
      "helpful_votes": 3,
      "publication_date": 20191023
    },
    {
      "title": "Very pleased with my purchase",
      "text": "Much better than expected. I brought this sprayer because in the back of my land there is an abandoned land and I mostly get bad grass growing on my side because of it. This sprayer delivered. It's very comfortable to wear and easy to use. You can put the pump handle on your left or right side, you can adjust the waist and shoulders belt and it includes a kit with different nozzles for your needs. 4 Gallons were more than enough for my needs, I even sprayed some bad grass on my neighbor's side. I use a Roundup herbicide as well. The sprayer has a 5-year limited warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Eliezer",
      "helpful_votes": 4,
      "publication_date": 20180929
    },
    {
      "title": "Solid Backpack Sprayer at a Reasonable Price",
      "text": "Can't believe I waited so long to purchase a Backpack Sprayer. This sprayer has cut my \"spray\" time by 70% over the one/two gallon sprayers. With a lot of fencing around our property I'm spraying weed/vegetation killer many times throughout the spring and summer. This sprayer is easy to assemble and use. There are two things to note: a full sprayer (4 gallons) weighs about 38-42 lbs. I found filling the tank on a table or the tailgate of our truck makes it much easier strapping it on my back and this sprayer requires \"almost\" constant pumping while sprayer (doesn't hold a lot of pressure). Neither are show stoppers for me -- it works great! I recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Grumpy Gramps",
      "helpful_votes": 0,
      "publication_date": 20200712
    },
    {
      "title": "Product defective.  Customer service not good",
      "text": "I am honestly a reasonable person. I used this product once. Went to use the following weekend again and it did not build pressure. Called customer service who suggested it was my fault and will send a replacement part. So now I must take the new product apart to fix. I must now spend more time trying to fix a product I just bought. Unacceptable. I would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20190604
    },
    {
      "title": "Not easy to store",
      "text": "One of the most important features for these sorts of tools is their ability to be stored. This sprayer is very bulky. The stand at the bottom and the pumping handle do not fold in, so you are always left with these parts jutting out wherever you store it. Edit a few months after purchase: the sprayer nozzle is already defective and I can no longer affect the shape/size of the stream. I would not recommend this product.",
      "rating": 1.0,
      "verified": true,
      "author": "rmchambe",
      "helpful_votes": 3,
      "publication_date": 20180808
    },
    {
      "title": "Worked great for the first 3 times out , third time went to use it and it leaks bad.",
      "text": "Worked great for the first 3 times out , third time went to use it and it leaks bad. Was cleaned out and clean water run through it after each use but for whatever reason the bottom now leaks badly even after trying to tighten everything up. Update: called MFG and was sent a repair kit including the failed 0ring , will improve score if this hold up.",
      "rating": 3.0,
      "verified": true,
      "author": "R T. Millar",
      "helpful_votes": 2,
      "publication_date": 20200817
    },
    {
      "title": "Bad choice",
      "text": "Had this unit since July will not build pressure company sent repair kit of seals replaced them small pressure but not adequate then quit all together. Contacted company again with no response. I owned a SOLO brand for 20-25 years without any repairs whatsoever. Guess I’ll just have to eat it. Warenty is as worthless as a tit on a boar hog.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190812
    },
    {
      "title": "junk",
      "text": "I used this one time and all went well,(Purchased June 22, 2018) When I tried to use it yesterday it would not create pressure. I called the ortho help line. Ortho does not even make this thing, They directed me to the \"fountainheadgroup\" There is no info on a warranty, just a lot of directions on how to order parts and rebuild it and even that is limited, It keeps referring to sections in the manual that just do not exist. I ordered something different and this one will go out with the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "John Donnelly",
      "helpful_votes": 4,
      "publication_date": 20180916
    },
    {
      "title": "Works like a champ!",
      "text": "This thing is terrific. I used it to spray about an acre of Japanese Stiltweed with Acclaim and it worked flawlessly. When spraying continuously, you pretty much have to pump it constantly, but it's no problem. You just spray with your right hand and slowly pump with your left. I usually mix 3-gallons of herbicide instead of 4. For me, four gallons gallons gets a bit unwieldy on the rough slopes I was spraying. By the way, this thing costs about twice as much at Lowes.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20180627
    },
    {
      "title": "Used unit for anew price",
      "text": "Very disappointed to received my RoundUp sprayer today and find out it was used AND the previous user left some sort of chemical in the tank.",
      "rating": 1.0,
      "verified": true,
      "author": "David L.",
      "helpful_votes": 5,
      "publication_date": 20180903
    },
    {
      "title": "Works great",
      "text": "The guy working for me misplaced the handle before assembling. He spent a couple hours looking for it while I was at work. He used a vice grip for the pumper. A week later I find the handle where I told him it was. Now it is attached and stored for spring. I almost got a smaller cheaper unit, but this one has the back pack style carrier and capacity to last long enough to do the whole job.",
      "rating": 4.0,
      "verified": true,
      "author": "Mr Fun Guy",
      "helpful_votes": 0,
      "publication_date": 20201011
    },
    {
      "title": "So much easier than a 1 galleon sprayer!",
      "text": "I'm battling crown root rot in my liriope (and I've got a lot of liriope) which necessitates repeated spraying. With my 1-gal sprayer I'd have to refill about a dozen times! This 4-gal means 2-3 fills and the job is done. I've used it about 5 times and it's holding up well. The pumping handle can be placed on either side. I feel like a turtle when using it but it's preferable to hauling around my little sprayer.",
      "rating": 5.0,
      "verified": true,
      "author": "orlandocommando",
      "helpful_votes": 0,
      "publication_date": 20200317
    },
    {
      "title": "Stop Working After a Month",
      "text": "I bought it because I already had one like it and it is still working perfectly. I didn't want to keep changing the content of the sprayer; so I bought another to hold other spray products. I got a lemon this time. The pump won't work on this one any more. I still may try the same pump out, but buy it directly from a hardware store again so that I can easily take it back.",
      "rating": 1.0,
      "verified": true,
      "author": "C. Burns",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Better than a lot of other options",
      "text": "My favorite sprayer out of all the backpack options. I’ve been in the lawncare & pesticide application industry for 19 years and this is my favorite sprayer. Internal pump, straps wrap around the frame instead of the plastic hooks, and a plastic wand instead of the metal. Generally these only get replaced because they get ran over or fall out of the truck and break. I’ve never actually had a failure that wasn’t my own fault.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "Should have bought this years ago",
      "text": "This got flagged as having an F-Grade in a review monitor so I was a little dubious about buying it, but all is good. It works easily, and gives much better coverage and accuracy than the hand carry sprayer I have used for years. Just remember that if you fill it right up (and you do not have to ) then it will weigh pushing on for 40 pounds.",
      "rating": 4.0,
      "verified": true,
      "author": "David C. Rose",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Works well",
      "text": "I am very happy with this. I am using it with a soap, oil, water mixture to clean and de-mite my chicken coop. This has different tips and its is easy to install. Cut my normal time down from a hour to 10 min.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack Hale Jr",
      "helpful_votes": 0,
      "publication_date": 20200503
    },
    {
      "title": "Use on Farm",
      "text": "I put a lot of corner stone weed killer in it. Kills everything. Trees weeds and any other Use with Premethin for bugs. If you take card of it This spray will last a few years. Don't just throw in the back of trucks. Take care of it. it will spray about Sixteen feet. Willy T from Nashville TN",
      "rating": 5.0,
      "verified": true,
      "author": "Willy T from Nashville TN",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Go from hours to minutes in applying sealer.",
      "text": "Don’t know what sheerness means in this app. Found unit very very useful applying sealer to 6’ wood fence..saved a great deal of time and prevented product waste. The constant pressure during use keeps good flow of product and the nozzle is perfect to cover 3 - 6” wide pockets at about 19/12 inches. Easy use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Bradley",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "works perfect.. can be heavy when you fill it ...",
      "text": "works perfect.. can be heavy when you fill it all the way,, but that's just my silly husband whom i told don't do that ,, but he did anyway,, very very easy to use and clean",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20170209
    },
    {
      "title": "Outstanding product!",
      "text": "Great sprayer for the money! I use it commercially and I have ZERO problems out of it and it comes with numerous spray tips.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven",
      "helpful_votes": 2,
      "publication_date": 20190901
    },
    {
      "title": "Good sprayer, not so good handle grip fit.",
      "text": "Good size sprayer. Works exactly as described. Easy to clean. Only negative is the handle grip slipped off immediately. I slipped it back on and sometime during the day (spraying for canada thistle on our forest land property) it slipped off again and was gone forever. Overall happy with the sprayer. Sure wish I still had a handle grip.",
      "rating": 3.0,
      "verified": true,
      "author": "No Mercy",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Solid",
      "text": "so far has been easy to use with no leaks. Using to knock down mosquitoes. Because of the portion of the tank that is opposite your back is rounded. It slides around a bit when full as you walk but it is not sharp or uncomfortable. Seems like it will be good for years with proper maintenance.",
      "rating": 5.0,
      "verified": true,
      "author": "RRRRFFFF",
      "helpful_votes": 0,
      "publication_date": 20200329
    },
    {
      "title": "A must have",
      "text": "If you do any spraying at all this is the only way to go. Having the capability to mix up to four gallons is a big plus. Also being able to add pressure while you are spraying saves time. Easy to use and well worth the money. Have used 3 times so far with no problems. Time will tell how well it holds up.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven F",
      "helpful_votes": 0,
      "publication_date": 20191215
    },
    {
      "title": "Works great and feels good wearing it too",
      "text": "Works great and feels good wearing it too . I’ve used off brands in the past that are quiet uncomfortable to wear but this is great . Comes with a few extra tips too . Wish the wand was metal though",
      "rating": 5.0,
      "verified": true,
      "author": "Kelly",
      "helpful_votes": 3,
      "publication_date": 20180411
    },
    {
      "title": "Half the price of the big box store",
      "text": "Lowes wanted double the price. I've had Solo brand and these and I cant tell the difference. They both work well. This beats the HECK out of those rediculous canisters you carry around and pump up. You waste so much time stopping to pump them up.....with these style you cam pump as you are spraying. Much faster. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190807
    },
    {
      "title": "If you're short, it's challenging but not impossible",
      "text": "I'm 5' tall and the only complaint I had was pushing down on the pump handle. I didn't feel like I got the full amount of pump due to the length of my arm, but it was nice to be able to spread weed killer easily with it on my back instead of using a small bottle/spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Andrea K",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "Stopped working after 2 gallons",
      "text": "It didnt even last 2 gallons. Stopped building pressure after the 1st 2 gallons..",
      "rating": 1.0,
      "verified": true,
      "author": "Mike and Jennifer",
      "helpful_votes": 2,
      "publication_date": 20190727
    },
    {
      "title": "used 3 times and broke",
      "text": "it worked great at 1st. the 3rd time we used it . pumper broke. now its useless",
      "rating": 1.0,
      "verified": true,
      "author": "\"TREE GOD \" 904-584-TREE",
      "helpful_votes": 2,
      "publication_date": 20190729
    },
    {
      "title": "You get what you pay for",
      "text": "The straps on this are like a childs school back pack even though you are carrying quite a lot of weight. I would not have purchased this if I saw it in person first. Tiny straps won't stay on when pumping. You can't reach the spayer wand, it is perfectly located to not be reachable with either hand. Otherwise it pumps fine",
      "rating": 3.0,
      "verified": true,
      "author": "Stephen S.",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Failed after 2 uses",
      "text": "In all fairness, I only partially did the in depth storage and re use procedures. Did empty it, died with no pressure. Stored indoors. BUT, I didn't die upside down and I didn't take it apart and lubricate it. I purchased on Sept of'18. Used then and again in Feb. Just got it out (May '19) and the valve won't build pressure. Since I'm not going to do 2 hours of maintenance each use, I'm considering this \"annual disposable\".",
      "rating": 2.0,
      "verified": true,
      "author": "Ron Kutinsky",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Great Buy",
      "text": "This is an awesome sprayer for the price! It holds a charge well, spray is adjustable ans STRONG. The waist band is a pleasant surprise- it makes the weight of a full tank evenly distributed and comfortable for a woman to wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "As advertised",
      "text": "I returned this product and rec'd my refund. I just decided not to buy it because I was getting a divorce. This stayed in my \"queue\" for review and I got tired of seeing it.",
      "rating": 3.0,
      "verified": true,
      "author": "Bunkie McBride",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "Best Price !",
      "text": "I assembled the handle, sprayer tip, filled it up with roundup concentrate sprayed weeds and a few days later weeds dead, I've enjoyed using their products ever since this replaced the other sprayer which was worn out. Better price than other local stores and Amazon Prime is the way to go. HAPPY CAMPER 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Holman",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "I Like It",
      "text": "After three back to back days of use I can say with some authority \"I like this\". I would have given it five stars if the container held pressure longer then it does. My arm is sore from continuous pumping. Other than that, no problems.",
      "rating": 4.0,
      "verified": true,
      "author": "By CJs Pirate",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Nice sprayer",
      "text": "This sprayer is convenient and comfortable. I spray my roof to kill moss this beats going up and down the ladder to refill a smaller sprayer. Next I'll kill weeds.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey & Curt",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Cheap and works.",
      "text": "Works really well and worth the money. The only thing I didn’t like is the rubber grip slides like it’s coming off when you’re constantly pumping. For the money though it’s a great sprayer.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven Moring",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "low price,  low quality",
      "text": "got what i paid for, bought the cheapest one and now I'm ready to throw it away. Uncomfortable - my old one had a chest strap to help keep the shoulder straps in place. This one doesn't have that and the straps slowly slide off my shoulders. Pump action is more difficult than expected. Next season I'm going to upgrade, I'll toss this one out.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Great Sprayer!",
      "text": "This is a great sprayer. It holds a lot of weed killer and has adjustable nozzle that allows you to spray where and how you need to. The only downside is that when full, it is very heavy and the shoulder straps are not very comfortable. Also your arm is definitely going to get a workout keeping enough pressure pumped into the tank to spray an adequate stream. But overall it works great.",
      "rating": 4.0,
      "verified": true,
      "author": "Ethan Cole",
      "helpful_votes": 0,
      "publication_date": 20181017
    },
    {
      "title": "WORST INSTRUCTIONS IMAGINABLE! - entire diagram only 1 inch x 1 inch! See pics!",
      "text": "I honestly don't know what to say. The assembly instructions are literally 1 inch by 1 inch. I have 20/20 vision, but this must have been written for ants. Pathetic.",
      "rating": 1.0,
      "verified": true,
      "author": "Collector",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "Junk",
      "text": "I used once, worked great. Next use less than a week later, the pump mechanism is not working. Cleaned, retired, nope. Save your money, do not buy this!!",
      "rating": 1.0,
      "verified": true,
      "author": "DeAnna W. Jensen",
      "helpful_votes": 3,
      "publication_date": 20180916
    },
    {
      "title": "Don't buy this backpack sprayer!",
      "text": "I bought 2 of these backpack sprayers in Feb. of this year. It is December and we opened them both. ( We buy them in advance for our business.) Neither spray well. The worst sprayer we have ever had. I would NOT buy them again.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20181209
    },
    {
      "title": "I love my backpack sprayer!!!",
      "text": "This is a back saver. I'm left handed, so easy to set it up for me. Easy to see if you have 1, 2 or 3 gallons in the tank. Strong padded adjustable straps to wear it as a back pack. I honestly have Nothing bad to say about this backpack sprayer. Thanks!! 😊",
      "rating": 5.0,
      "verified": true,
      "author": "Mark C. Williams",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "USeful Product",
      "text": "The Back Sprayer is easy to use and helps to maintain the invasive plants on our hill.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen",
      "helpful_votes": 0,
      "publication_date": 20201001
    },
    {
      "title": "did not last long",
      "text": "need to contact seller for warrenty because it has a warrenty some body let me know pump issue",
      "rating": 1.0,
      "verified": true,
      "author": "Keith A.",
      "helpful_votes": 0,
      "publication_date": 20200620
    },
    {
      "title": "Pretty easy to put together",
      "text": "Pretty easy to put together, and it sprayed way more comprehensively than the spray containers that come with traditional week killers.",
      "rating": 5.0,
      "verified": true,
      "author": "Lael Beckwith",
      "helpful_votes": 3,
      "publication_date": 20170821
    },
    {
      "title": "A bargain but has a low flow rate.",
      "text": "Gets the job done. After using many backpack sprayers over the years, this one has the lowest flow rate. For the price, it works but compared to others it is not the fastest.",
      "rating": 3.0,
      "verified": true,
      "author": "A.Team",
      "helpful_votes": 0,
      "publication_date": 20180818
    },
    {
      "title": "Great product for the money.",
      "text": "I have no complaints. The sprayer has a strainer & 3 different tips to use. Just make sure you spray clear water after spraying or the handle can get gummed up & will be un-useable. Happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby Bear",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "So easy to use",
      "text": "was contemplating typical pump sprayer or back pack sprayer, knowing with the typical pump sprayer , you have to stop place it on the ground and pump it, so I decided to try the back pack sprayer, wow, great decision, holds 4 gals, the weight load of 3 gallons was plenty , minimal assy required, so easy to use and mix, the pump handle is positioned perfectly, pump as you go, about every 10 seconds, very happy with the choice.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Broke after light use",
      "text": "Stopped giving pressure to hose and functioning properly after 1 year of once per month use.",
      "rating": 1.0,
      "verified": true,
      "author": "Mitch Hansen",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "Sprayer nozzle does not work well it is made of plasticDoes not spray at a distance",
      "text": "Sprayer nozzle does not work well it is made of plastic",
      "rating": 1.0,
      "verified": true,
      "author": "dls",
      "helpful_votes": 2,
      "publication_date": 20190811
    },
    {
      "title": "This thing rocks",
      "text": "When full its a little heavy , But I can do the whole acre lawn in one fill . easy to pump as you go , Has 5 different nozzles to spray different chemicals .",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20190822
    },
    {
      "title": "Worth the money",
      "text": "Was and is very good, I just had to gorilla glue the plastic slip on handle. No big deal, it’s worth the money and carries good on my back and I’ve had two back surgeries.",
      "rating": 5.0,
      "verified": true,
      "author": "Terrence ",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "must have this product",
      "text": "I have tried so many different sprayers on my 164 acre cattle ranch. This one fits the bill to a tee. I ride on my ranger spraying the fence line with no problem without stopping and pumping. Do have to watch which way the wind is blowing so that the spray drift does not return. I love this product!",
      "rating": 5.0,
      "verified": true,
      "author": "john l.",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "It leaks",
      "text": "This backpack sprayer is very awkward to use and it leaks around the cap. I wouldn’t purchase this again.",
      "rating": 1.0,
      "verified": true,
      "author": "sandra r",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "Buy it, you will be glad you did",
      "text": "Why did I wait so long to buy this. Has a good 4 year warranty and makes life so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "dfitz",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "Great!",
      "text": "We went to Lowe’s to buy this, but it was cheaper on Amazon! My husband really likes it and likes that it pumps instead of needing to charge. Comfy straps and easy pump.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous ",
      "helpful_votes": 0,
      "publication_date": 20190502
    },
    {
      "title": "2.3 acres",
      "text": "Works great spraying my large front and back yard... Easy to pump and nice spray pattern. Much cheaper than rival brands.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Lasted 2 times",
      "text": "Only lasted two times, now it is somehow clogged, will not spray out, builds pressure but will not spray, not as good of quality as I expected. Cannot use now, resorted to my $10 1 gallon sprayer which works over and over . Not worth the money.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Great product, easy to use.",
      "text": "I bought this for my husband's birthday, and he absolutely loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "mkmkm",
      "helpful_votes": 0,
      "publication_date": 20200621
    },
    {
      "title": "Ease of use",
      "text": "Covering a large area. Never again will I have to stop and pump every 2-5 minutes. It’s great the pump,lever is easy to pump every 30 sec 1 are 2 pumps and you keep on going. The only down side it’s 4 gallons on your back. When you first start be careful lean to far to one side down you go.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Holmes",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "So nice to not have to keep mixing",
      "text": "So nice to not have to keep mixing,holds a lot. Just a few pumps and you’re on your way. It’s remarkable how much spray you get for so little effort. I do kind of feel like a ghostbuster though wearing it, but worth the money!",
      "rating": 5.0,
      "verified": true,
      "author": "Deon Pohlmann",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Easy setup",
      "text": "Bought this backpack sprayer off of amazon which was $20 cheaper then the home improvement store. Also, it only took about 5 minutes to put together and being a round up product I can only assume it'll last awhile.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Love it",
      "text": "Still works to kill weeds. Used on 1/3 acre land",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon M.",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "The price is right and it woks well. Holds ...",
      "text": "The price is right and it woks well. Holds its pressure and only takes a few pumps. If anything it pumps out the spray almost too quick...or at lease quicker than the cheap sprayers i have been using!",
      "rating": 5.0,
      "verified": true,
      "author": "Bowslayer",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Works Well",
      "text": "For the price, this is the best backpack sprayer I could find. Looks to be the same sprayer marketed under different names as more expensive (all made by the same company).",
      "rating": 5.0,
      "verified": true,
      "author": "Rob B.",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "Lots of volume!",
      "text": "Easy to put together, works great.. lots of volume.. so it’s not real easy to squeeze a light stream.. but if you’re trying to cover a large area, just a few pumps, and spray it all..",
      "rating": 5.0,
      "verified": true,
      "author": "kaptan",
      "helpful_votes": 0,
      "publication_date": 20181011
    },
    {
      "title": "2nd One That Has Broken Within The First Month!!",
      "text": "The handle pump on this product has broken within the first month of use. The first time, we thought it was just that one until so returned the until and received a replacement. Now the second one did the exact same thing. DO NOT waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200901
    },
    {
      "title": "Time saver",
      "text": "Easy to assemble and use. Makes spraying large areas a lot quicker.",
      "rating": 5.0,
      "verified": true,
      "author": "Andy",
      "helpful_votes": 0,
      "publication_date": 20200923
    },
    {
      "title": "Best sprayer",
      "text": "Used it to spray the siding on my house with cleaner. Worked great! Easy to use on ladders. I know this is not it’s intended use but works great",
      "rating": 5.0,
      "verified": true,
      "author": "Gregory",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "I feel like a Ghostbuster around my yard.",
      "text": "Good product and very sturdy. Holds a lot so I don't have to stop frequently.",
      "rating": 5.0,
      "verified": true,
      "author": "Cristina",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Well made/easy to operate",
      "text": "This is a great backpack sprayer. I own a little less than an acre that’s fenced in, and this sprayer is comfortable enough and holds enough liquid to complete spraying the entire fence line.",
      "rating": 5.0,
      "verified": true,
      "author": "JPG",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Quit Working",
      "text": "Not even a year old. Quit working. Pump went out.",
      "rating": 1.0,
      "verified": true,
      "author": "Patricia Von Ehwegen",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "Don’t buy",
      "text": "Terrible literally had it for 3 hrs. Worked ok for about 30 min then would not pressurize. Can here air leaking. Don’t buy",
      "rating": 1.0,
      "verified": true,
      "author": "Peggy",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "EXTREMELY UNCOMFORTABLE",
      "text": "It is EXTREMELY UNCOMFORTABLE to use. The straps are so close together it is a chore to put on. It works well once it is put on, a couple or three pumps and it sprays well. As far as being heavy 4 gallons of water weighs about 33.3 lbs.; so one has to realize it is heavy when full.",
      "rating": 2.0,
      "verified": true,
      "author": "Bon Temps",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "great product",
      "text": "does a good job. used the last one alot for six years . sturdy and comfortable to wear",
      "rating": 5.0,
      "verified": true,
      "author": "bender101",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "Makes spraying  easy",
      "text": "Makes a difficult job very easy! I have a large area that I sprayed and it was nice to be able to carry it on my back. Covered large Area In a very short period of time. I highly recommend this product",
      "rating": 5.0,
      "verified": true,
      "author": "Dan M.",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Works fine and cheaper than Solo.",
      "text": "Only issue I have with it is that you do have to work the pump handle fairly often in order to keep up a good spray and pressure.",
      "rating": 4.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20190205
    },
    {
      "title": "Roundup 190314 Backpack Sprayer, 4 Gallon",
      "text": "My husband is very happy with the sprayer. he is the smartest man and can make anything. He made a roll around carrier for the sprayer, so the sprayer is happy & so is my husband.",
      "rating": 5.0,
      "verified": true,
      "author": "Millie Tutokey",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Easy to use",
      "text": "A whole lot better then the other pump style sprayer",
      "rating": 5.0,
      "verified": true,
      "author": "Phil Gallegos",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Great Value",
      "text": "Actually made as well as sprayers up to three times the price. Same quality and performance too.",
      "rating": 5.0,
      "verified": true,
      "author": "David Boyle Sr.",
      "helpful_votes": 0,
      "publication_date": 20190619
    },
    {
      "title": "Good product",
      "text": "Well worth the money excellent sprayer I have had it for couple weeks and used it for a total of 6 hours so far very good.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Ann Raissi",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Good for large areas",
      "text": "I'm clearing about 1/4 acre of grass, weeds and brush. This has definitely gotten some use. No leaks, easy to put together, and has a good spray.",
      "rating": 5.0,
      "verified": true,
      "author": "Raist",
      "helpful_votes": 0,
      "publication_date": 20190928
    },
    {
      "title": "Easy to use",
      "text": "Done a awesome job, saves a lot of time. No more bending over to pump up sprayer.",
      "rating": 5.0,
      "verified": true,
      "author": "Danny Powers",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Easy to carry.",
      "text": "So much better than my one gallon sprayer. Can finish the back yard much faster and easy clean up.",
      "rating": 5.0,
      "verified": true,
      "author": "Perry Smith",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "love it",
      "text": "love it. just a couple pumps and your ready to go. did a great job applying endurant premium turf paint to my dormant grass.",
      "rating": 5.0,
      "verified": true,
      "author": "Tower21",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Pleasantly surprised, very impressed.",
      "text": "Makes life so much easier, way less effort, way less time! Only issue I have is that it leaks at the bottom from time to time, even after tightening the clamps.",
      "rating": 4.0,
      "verified": true,
      "author": "McO",
      "helpful_votes": 0,
      "publication_date": 20180703
    },
    {
      "title": "works great",
      "text": "I have been using the handheld sprayers but upgraded to this backpack one. I am very pleased with it so far. Works great and no issues so far. Good product for the price. Would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20200316
    },
    {
      "title": "Sturdy product ease to assemble and use.",
      "text": "I ran 40 gallons of weed killer through this item and didn’t let me down once... plus I felt like a ghostbuster when I was using it.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom Cauley",
      "helpful_votes": 0,
      "publication_date": 20181110
    },
    {
      "title": "Works great!",
      "text": "Needed this in a hurry. Received it on time and it’s very easy to put together. Took 5 minutes. Great sprayer, just be sure to clean out after use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "makes spraying easy",
      "text": "I love putting it on my back. less strain and you I can spray everything with out hurting my back",
      "rating": 5.0,
      "verified": true,
      "author": "Michael C. Gowan",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "very satisfied!",
      "text": "if you have been looking for a backpack sprayer, definitely get this one!",
      "rating": 5.0,
      "verified": true,
      "author": "lindsay",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "It is comfortable to wear and the pump is at waiste level",
      "text": "saves a lot of time, not having to keep filling the gallom ones and carrying them around. It is comfortable to wear and the pump is at waiste level.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Johns",
      "helpful_votes": 0,
      "publication_date": 20180701
    },
    {
      "title": "Comfortable and works great",
      "text": "Comfortable and works great. Hope it lasts for a while. I use one of these all day long on a golf course and first day, like it better than the $400 ones.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas Bear",
      "helpful_votes": 0,
      "publication_date": 20180510
    }
  ],
  "product_meta": {
    "title": "Roundup 190314 Backpack Sprayer for Fertilizers, Herbicides, Weed Killers & Insecticides, 4 Gallon",
    "description": "Size:4 gallonThis Roundup 190314 backpack sprayer meets all your spraying needs - Whether it's cleaning, sealing, fertilizing your lawn or garden, or controlling insects in your yd. The large piston pump pressurizes in fewer pumps & has Viton seals for long-lasting chemical resistance. Heavy duty, non-corrosive wand with reinforced hose helps you spray the hard-to-reach areas. Premium shut-off features a comfort grip, Lockable trigger to prevent hand fatigue & a removable in-line filter to reduce clogging. Roundup 190314 backpack sprayer is also great for spraying herbicides & Weed killers. The large tank opening & basket filter makes it easy to add liquids & catch debris before going into the tank. With adjustable padded straps, waist belt & Chest cinch strap, The backpack harness ensures comfort while you work. Pump handle reverses for left- or right-handed use & tank has a built-in carry handle with wand storage. Multiple nozzles are included for ultimate versatility: poly adjustable nozzle (easily adjusts from solid stream to fine mist), high volume flat Fan (for broad coverage of large areas like lawns) & low-volume flat Fan (for foliage or confined areas). Also accepts tee jet nozzles.",
    "rating": 4.5,
    "feature_bullets": [
      "4-Gallon sprayer meets all your spraying needs (controlling weeds and pests, growing flowers and vegetables and cleaning decks and siding)",
      "Heavy-duty poly wand with shut-off featuring a comfort grip, lock for continuous spraying and an in-line filter",
      "Viton seals and gaskets throughout the pump and shut-off for long lasting chemical resistance",
      "Adjustable padded straps with waist belt and built-in lumbar support",
      "Includes 3 nozzles for versatility: poly adjustable, high volume fan, and low volume fan"
    ],
    "specifications": {
      "Product Dimensions": "9 x 15 x 22 inches",
      "Item Weight": "10 pounds",
      "Manufacturer": "Roundup",
      "ASIN": "B00FN3MS8Q",
      "Item model number": "190314",
      "Customer Reviews": "4.5 out of 5 stars636 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#9,670 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Sprayers & Accessories",
      "Gardening & Lawn Care",
      "Sprayers"
    ],
    "price": 65.98
  }
}