{
  "website_summaries": [
    {
      "verdict": "Suitable for multiple types of cooking, this high-quality skillet is the best available.",
      "pros": [
        "Aluminum/stainless steel combination is great for cooking",
        "Safe for oven and dishwasher"
      ],
      "cons": [
        "Expensive",
        "Overheating could lead to discoloration/scorch marks"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It has arrived alas is concave thus oil pools at ...",
      "text": "It has arrived alas is concave thus oil pools at the sides of the pan. Food in the middle, therefore, gets no oil. Returning.",
      "rating": 2.0,
      "verified": true,
      "author": "Humperty dumperty",
      "helpful_votes": 61,
      "publication_date": 20171201
    },
    {
      "title": "Overrated",
      "text": "The center of the pan is slightly convex, so liquid tends to pool around the edges. Food in the center of the pan tends to burn more easily. See attached image. Overall, the pan performance is finicky. I was expecting better for $120.00",
      "rating": 3.0,
      "verified": true,
      "author": "Bill",
      "helpful_votes": 17,
      "publication_date": 20190310
    },
    {
      "title": "Two pans were warped",
      "text": "As others have stated, pan arrived warped. Replacement arrived today, not looking good on the replacement either.",
      "rating": 1.0,
      "verified": true,
      "author": "TD",
      "helpful_votes": 19,
      "publication_date": 20190214
    },
    {
      "title": "surprised, but not in a good way",
      "text": "I have a number of All-Clad products, including a chicken roaster that is 25 years old. When I got this, I was surprised how light the pan seemed. I warmed up leftovers in it, and couldn't believe how things stuck. I feel the quality has definitely gone downhill, and decided the pan was not worth the price. It has been returned, and I am breaking out my mother's old copper bottom pans. Unfortunately, I feel it may be time to try Viking stainless products.",
      "rating": 1.0,
      "verified": true,
      "author": "LadyMacbeth",
      "helpful_votes": 11,
      "publication_date": 20190731
    },
    {
      "title": "Even cooking and sticking isn't that bad",
      "text": "with a little insight on when to place ingredients and when to turn them the pan usually doesn't get too grimy and as long as you got some hot oil and let the meat brown it doesn't stick bad. Food cooks beautifully in this pan and it distributes heat very evenly. If I burn a lot of liquids or something in the pan I just pour some vinegar in it while it is hot and scrape it up with spatula. Occasionally I use Bar Keepers friend to polish it back up.",
      "rating": 5.0,
      "verified": true,
      "author": "Clifford R. Browning",
      "helpful_votes": 12,
      "publication_date": 20180123
    },
    {
      "title": "A workhorse",
      "text": "I traded up from nonstick Calphalon to this pan because I go tired of replacing the nonstick every 3-4 years. And, frankly, it is almost as easy to clean as a nonstick. The trick is to let the pan cool before trying to clean it...don't toss it in the sink sizzling hot and run water on it. It heats up quickly, is light enough to \"flip\" the contents, the handle stays cool, and it's really nice to look at. I don't think I'll have to replace this baby. Well worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 8,
      "publication_date": 20181107
    },
    {
      "title": "Happy with my purchase",
      "text": "rule #1 - Heat the pan, drizzle some oil, then place the food rule #2 - Get you some Barkeepers Friend for washing. Once used, your pan will never look like the day you got it but this will get it as close as possible. rule #3 - Don't rely on this to be an \"egg frying\" pan. you'll be sorely disappointed But the sear you can get on your meat makes you feel like you visited a fancy restaurant. Do I recommend? yes, but know what you're getting here. do some research. this is not a non-stick pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia M",
      "helpful_votes": 5,
      "publication_date": 20190906
    },
    {
      "title": "good pan. Eggs are hit and miss",
      "text": "Its a very nice pan and looks good hanging up in the rack. I use a little barkeepers friend to keep it shined up when I burn some stains into it. Not a non stick and requires oil, i use a fried egg and butter as my benchmark test. Sometimes I can get a perfect over easy that slides around and flips no spatula required. Other times not so much, and I can't seem to figure out what the secret is. For all other cooking though it works good and cleans up easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon49",
      "helpful_votes": 7,
      "publication_date": 20190527
    },
    {
      "title": "No Lid!!",
      "text": "Good fry pan, but did not come with a lid as advertised",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 13,
      "publication_date": 20190219
    },
    {
      "title": "First all clad pan",
      "text": "There is a difference with all clad vs my cheaper pans. This pan is our work horse pan. This is our first/only all clad so we use it for as many things as we can. The first time searing steaks we noticed a huge difference compared to our nonstick cheap pan. Plan on purchasing more all clad products in the future. All clad is expensive but it says lifetime warranty. We've been using this pan nearly daily for 6 months and it still looks in great condition.",
      "rating": 5.0,
      "verified": true,
      "author": "Austin Esparza",
      "helpful_votes": 12,
      "publication_date": 20170703
    },
    {
      "title": "Not Flat. Annoying.",
      "text": "Don't usually write reviews. The other's are correct, I put a rafter's square up to this skillet and it's so bowed you can press the square on one side so it'll lift up on the other side and then slide a quarter under the lifted side. Didn't even use it, I'm returning it. Annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "Adnan Choudhary",
      "helpful_votes": 8,
      "publication_date": 20191022
    },
    {
      "title": "Sticks like mad. No treatment works.",
      "text": "This pan could make any food stick to it. Tried all types of treatments, etc.; but nothing made it easier to use. We've had many types of stainless cookery that worked great; mostly with minimal treatments and cleaning. Something about this one was horribly wrong; though it looked pretty enough. Somehow this pan's surface was made incorrectly. It's literally the worst piece of cookware we've ever owned; and we've both been cooking for over 50 years with cast iron, stainless, etc.",
      "rating": 1.0,
      "verified": true,
      "author": "Jumpnswing",
      "helpful_votes": 6,
      "publication_date": 20190823
    },
    {
      "title": "Terrific",
      "text": "This is one of the best pieces of cooking equipment ever. The pan conducts heat unlike anything else and allows you to cook quickly with an even and intense heat. Way better conductivity than cast iron or Teflon. You just need to follow the instructions -- generate heat so water beads before you oil the pan. If you can't follow that direction find something else. Some people also criticize because oil pools on the sides. That is true but it does not affect the pan's function and I assume it is part of the design. Clean up is easy -- again if you follow the directions.",
      "rating": 5.0,
      "verified": true,
      "author": "JDC",
      "helpful_votes": 3,
      "publication_date": 20191213
    },
    {
      "title": "I am bitterly disappointed in this Fry Pan",
      "text": "I am bitterly disappointed in this Fry Pan. The FIRST time I used it and then tried to clean it was a disaster. There are some kind of white spots on the inside of the pan and the bottom has marks and discoloration. I cooked chicken breast pieces at medium heat in olive oil. There should not have been this type of result. I'm complaining to All-Clad. Too expensive for what you get!",
      "rating": 1.0,
      "verified": true,
      "author": "SARAH B LARIVIERE",
      "helpful_votes": 21,
      "publication_date": 20180203
    },
    {
      "title": "Winner",
      "text": "All clad is expensive. Sometimes inexpensive is great, in this case this fry pan is worth every penny. It's america's test kitchen winner twice, and I know why. The quality is superb. There are no hot spots, the handle is generous, it easily goes from stovetop to oven. You can put it under the broiler, and it is induction ready. The shallow pan makes flipping omelets and making pizza easy. Being flat is important when trying to brown meat. This is just a great pan, the lid fits well, and worth the investment as, with basic care, it will last a very long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Becky at the beach",
      "helpful_votes": 3,
      "publication_date": 20190720
    },
    {
      "title": "Pan wobbles",
      "text": "Pan was not flat when ordered. Would not sit flat on my glass-top stove and had a noticeable wobble. Cooking surface was also very small for a 10-in. Cooking surface was barely 7 inches, while my other two (this was set to replace one!) 10-in both had 8+in cooking surface. If you are on the fence between the 10 and 12 inch, go with the 12. (assuming you still want to buy)",
      "rating": 2.0,
      "verified": true,
      "author": "Quinn Struble",
      "helpful_votes": 5,
      "publication_date": 20200130
    },
    {
      "title": "It's an excellent pan. One cannot complain about the quality",
      "text": "It's an excellent pan. One cannot complain about the quality. It heats evenly, is large enough, and to my surprise, cleans up very easily. It's a little heavy, but I have both cast iron and black steel pans and they are much heavier. So, I suppose it's relative. Besides, as a 12 inch pan it's not surprising that it's heavy. To give you an idea about it, it weighs 2 lbs 12 oz without the top (with the top it's 4 lbs. 4.5 oz). Cast iron (no top): 7 lbs 8.5 oz. Black steel (no top): 5 lbs. 13 oz. I like the pan and I use it. It's expensive, but you know that.",
      "rating": 5.0,
      "verified": true,
      "author": "Carol Rubin",
      "helpful_votes": 9,
      "publication_date": 20161209
    },
    {
      "title": "The Best Stainless Steel Pan on the Market",
      "text": "I bought one of these a few years ago and didn't actually read the instructions. I tried to use it before seasoning it and had a very bad experience so never used it again. Our house burned down it and it with it. Recently I've been doing a lot of cooking and saw on You Tube instructions for using stainless steel and seeing the top rated pan on America's Test Kitchen - it was this one! They explained how to season it and how to cook and clean with it. I get it now. I used it just the other day and it was perfect!!! It's now my \"go-to\" skillet and I just love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Dal Asher",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Versatile two-piece stainless set made in the USA",
      "text": "I finally got rid of my last nonstick pan that I always used to make scrambled eggs and other foods that I \"thought\" I had to cook in nonstick. My husband could TASTE the difference when I used this All-Clad fry pan. I've owned another brand of stainless cookware, but this is my first All-Clad pan. It is beautifully made--nicely balanced, gorgeous finish, great handle, and best of all it cooks foods better than you can imagine WHEN YOU USE IT CORRECTLY. Read the instructions. I purchased this on Amazon for a great price for the pan and lid. If I could, I'd replace my entire set with all All-Clad.",
      "rating": 5.0,
      "verified": true,
      "author": "Smart Blonde",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Worth the money to cook evenly",
      "text": "I already had a good set that I bought from Costco that was professional-grade and thought I was all set on my stainless steel cookware. However, I wanted a 12 inch frying pan and decided to give All-Clad a try. Reminds me of what my parents SS cookware from Farberware was like but lighter. This is so light it is a dream to cook with and cooks more evenly than anything I've cooked with in the past. I highly recommend it because it will make you seem like a pro.",
      "rating": 5.0,
      "verified": true,
      "author": "TmLC",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Hard, hard to clean",
      "text": "One month use experience has not good, pan don’t sticking but cleaning is difficult, especially on the side, we followed the instruction, trying to pre heat, add oil, set in low heat, edge and side are baked in, using bar tenders friend. I will return this pan as I’m so disappointed with this expensive purchase.",
      "rating": 2.0,
      "verified": true,
      "author": "Terry Chain",
      "helpful_votes": 2,
      "publication_date": 20200503
    },
    {
      "title": "It's worth having one good, oven safe skillet",
      "text": "It's worth having one good, oven safe skillet. Easier to maintain than cast iron, more versatile (can use acidic foods like tomato or vinegar based sauces) and also gets a good sear.",
      "rating": 5.0,
      "verified": true,
      "author": "c",
      "helpful_votes": 6,
      "publication_date": 20180803
    },
    {
      "title": "Real nice but expected for the price",
      "text": "I guess for most people these are fairly pricey. They are what we expected for the price. Sturdy, well made, great cooking, and they look awesome. We also bought some Tramontina Tri-Ply Clad (Made in Brazil) just to compare and to also save some money. Man those are really close to All-Clad. Maybe not quite up to par with All-Clad but very close and somewhat cheaper to buy. If you don't really need to save the money go with All-Clad you won't be dissatisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Shuryje",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Bummer",
      "text": "Well I guess a picture is worth a thousand words...",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20200122
    },
    {
      "title": "Awasome Pan!",
      "text": "It is, indeed, a bit pricey but certainly pays off. I had been checking on this pan quite awhile and finally, got the courage to buy it! All I can say that it is an unbelievable pan especially if you are in to cooking. It distributes heat as promissed as long as you follow the product's instructions. With a little bit of a care, you don't need to buy another pan again!! Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Tugba A.",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Works great but discolored after one use",
      "text": "This is a highly rated frying pan and I waited for a long time until it went on sale. I cooked pecan chicken for its first use and the stainless steel discolored with one use. Also used it for blackened tilapia and take a look at the photo after using it for this purpose. This pan is junk and high maintenance. I doubt I can get it back to the way it should look with heavy scrubbing. I would not recommend this pan. What's it's purpose if it's so delicate?",
      "rating": 1.0,
      "verified": true,
      "author": "Matthew J. Trout",
      "helpful_votes": 55,
      "publication_date": 20161115
    },
    {
      "title": "It's not dishwasher safe",
      "text": "I bought one of these about 2 years ago. It looks good and it cooks good. I used it frequently and washed it in the dishwasher with Cascade. The aluminum middle layer eroded around the edge leaving 2 sharp steel layers around the rim which cut my finger. I contacted All-Clad and they had me return the pan at my expense. About 2 months later they sent me a new pan, with no comment. They advertise this as dishwasher safe, but it's not. If you get one you need to wash it by hand.",
      "rating": 2.0,
      "verified": true,
      "author": "Tom G",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Recommended by America’s Test Kitchen",
      "text": "This pan was recommended by America’s Test Kitchen and definitely worth the money. We have an old stove but everything turns out as though we had a top of the line kitchen because the pan heats evenly (despite a wonky heat source) and has such a lovely smooth finish. After cooking, pour water into the pan and bring to a simmer. Scrape up any stuck on bits with a wooden spoon and then wash like normal. Super easy. To get the “out of the box” shine back, just use a little Bar Keeper’s Friend - ta da! Like new.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristine M. Sandy",
      "helpful_votes": 2,
      "publication_date": 20190730
    },
    {
      "title": "Item arrived dented -- and replacement had another issue",
      "text": "The first pan I bought arrived with a dent in the handle. My replacement order arrived with a wobbly lid that did not fit securely on the base. I know it was defective because the previous lid fit snuggly on the first pan that arrived. All Clad came highly recommended, and I expected much better quality for a $130 pan...",
      "rating": 1.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 3,
      "publication_date": 20200902
    },
    {
      "title": "great skillet",
      "text": "I love this skillet. It is a stainless steel skillet and if you are expecting it work like a non-stick skillet you will be very upset. If you don't oil and preheat properly things will stick. But, with proper heat and oil I make fired rice in this and it wipes clean. I am not sure about the issues others have reported with the bottom not being flat and oil pooling around the edges. I have experienced some of this but at times it does not. I am not sure if it has to do with the amount of heat being applied. Overall amazing skillet with great heat distribution and a versatile tool everyone should have in the kitchen.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "I would not buy it again.",
      "text": "I purchased this to replace the $300 All-Clad non stick which began to rub off around year 2. I watched plenty of videos of chef's using this pan with little or no issues with food sticking and easy clean up. I'm a average cook. I can not get this pan to cook without food sticking. And CLEAN UP is a nightmare. I will say that Barkeepers Friend is a MUST if you plan on buying Stainless steel. I have put this pan away for special use only. I went to Target, bought a Cuisinart 13\" inch Pan Non-stick for $40. It works great for every day usage.",
      "rating": 3.0,
      "verified": true,
      "author": "TM195",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "All-Clad All-American",
      "text": "All-Clad is number 1 in this business space with good reason. I've had a few different tri-ply pans and these are by far the best (also own the 12\" variety). Super lightweight compared to other pans, yet ultra durable. They pre-heat in no time on my induction range. Cooks anything from delicate eggs and fish to searing steaks and burgers. If done properly, these pans stick less than \"non-stick\" pans and these will last a lifetime while still looking great. All-Clad's all American products can't be beat!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Are they good?  I own one and we have two at the firehouse!",
      "text": "It just gets the job done and you have no issues with anything. It heats evenly and well, handle is comfortable and functional, it’s well balanced, cleans up easily, good size (any larger and it would be too much.) It also is the top-rated skillet as tested by America's Test Kitchen, a sort of Consumer's Report for cooking equipment (they also develop the best recipes by modifying recipes 50-100 ways until it's perfect.)",
      "rating": 5.0,
      "verified": true,
      "author": "Lou Menendez",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "A three pan comparison",
      "text": "Between myself, my brother, and my parents, my wife wound up with this pan, a SS Cuisinart pan, and an SS Williams Sonoma pan for Christmas. While all three are quite good, the material is holding up the best on this one. The others have minor stains and spots at this point, while this one is still nice and shiny. All have been used extensively. So based on that and without going into technical details I know nothing about, I would highly recommend this product and this line. Oh, almost forgot, COMFORTABLE. Really well designed to hold, flip food, swirl food, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Haon the GreatTop Contributor: Chess",
      "helpful_votes": 7,
      "publication_date": 20160225
    },
    {
      "title": "Don't buy",
      "text": "Used 2 times on medium-high heat and the pan was discolored. Called customer service and waited 40 minutes and no one picked up. Wrote an email and they returned my message the next day telling me to use bar keepers friend which did not work. Called customer service and finally, they picked up and told me it was not under warranty. I'll stick to buying Cuisinart. Poor pan and poor customer service.",
      "rating": 1.0,
      "verified": true,
      "author": "Aaron ",
      "helpful_votes": 3,
      "publication_date": 20200221
    },
    {
      "title": "Nice!",
      "text": "I haven’t actually used this yet but am already impressed! I get a thrill just putting the lid on and off, the pieces fit so perfectly! Unlike some reviewers, I don’t intend to use such a finely crafted pan to fry eggs - that’s what non-stick pans are for!, But for high heat searing I just can’t imagine a finer pan! I wish I could afford the entire set but for most cooking my “common” cookware will do. I just needed something of high quality for the finer points and this pan is clearly going to be perfect! One day I’ll win the lottery. :-)",
      "rating": 5.0,
      "verified": true,
      "author": "Craig A ",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "100% Legit - Perfect Pan from All-Clad",
      "text": "This is the D3 Steel Collection w/ Lid. Its a steal @ $99.00. Sometimes is will go on sale. I've been searing perfection every time. To Clean - Let cool down then lightly scrub with handheld plastic bristle brush and warm water. Use a little white vinegar and warm water to remove any charred discoloration. Restores back to beautiful every time. Coat lightly with olive oil and paper towel after dry and put away. Gift that keeps on giving.",
      "rating": 5.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 2,
      "publication_date": 20200206
    },
    {
      "title": "Don’t understand why everyone loves these pans",
      "text": "Dislikes- impossible to clean in the sense that it looks like new. Once you’ve used it once it will always look like you haven’t washed it. Food sticks no matter what. The lid handle gets hot - almost burned my hand the first time I used it. Takes a long time to heat up. Likes: it does heat evenly Frankly I like my Circulon cookware better. Even it isn’t great a non-stick but it’s better than ‘this and at least when you wash it it looks clean. Lid handles don’t get hot either and they can go in the oven. Even on sale this is overpriced and disappointing.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer (Maryland)",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "Quality pan!!",
      "text": "beautiful, distributes heat perfectly, cooks well (esp when seasoned properly) cleaning (stains/burn marks/water spots) can be a little annoying but if you spend over $100 on a pan you want to make sure it stays looking nice (esp if you hang in your kitchen) Bar Keepers Friend will get it clean, woks like magic, but it will take some elbow grease too. Once seasoned, cleaning in between uses is simple. Usually water alone will get the pan clean, no need for soap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Mc",
      "helpful_votes": 0,
      "publication_date": 20201014
    },
    {
      "title": "Quickly becoming one of my favorite frying pans.",
      "text": "Cooked four salmon patties at the same time, did great. However, you must understand how to season stainless steel pans correctly or your food will stick. I followed instruction I found online from professional chefs and had no issues. Beautiful pans and quality. Decent heat distribution and works great with my induction cooktop. Recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff A.",
      "helpful_votes": 0,
      "publication_date": 20200822
    },
    {
      "title": "Horrible handle design",
      "text": "The handle kills these pans. They’re heavy which I like, but being heavy with such weird uncomfortable handles that easily roll around in your hand due to their shape is a problem for my wife and son. Im going to try putting a lodge silicone handle cover on them (I bought the nonstick as well), but if that doesn’t work then I’m sending these back before one of them loses their grip on the handle while it’s full of hot oil or food. Quality of the pan itself is great, but the handle sucks",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190601
    },
    {
      "title": "Good size light weight but what is wrong with finish?",
      "text": "Nice size, light weight, handle stays cool. But what's wrong with the finish? Cooked one time and made quesadillas on low heat. They turned out great. I let the pan cool before washing in hot soapy water. I used barkeepers friend. I used white vinegar. As other reviewers have remarked, there is a film that will NOT come off. My D5 pan doesn't do this. Only the D3. Going to return.",
      "rating": 4.0,
      "verified": true,
      "author": "cards&crafts",
      "helpful_votes": 0,
      "publication_date": 20191027
    },
    {
      "title": "Best Fry Pan/Saute Pan in the world",
      "text": "Al-clad is the only brand you should ever buy. It's what the pros use and this version of the al-clad line-up is all you need. Don't waste your money on the more expensive lines they offer as they really don't offer any actual improvement. I've used al-clad for 20 years now and they work and look as great as when I first got them. This thing is amazing. Sears steaks perfectly! Cleans up easily afterwards. The handle stays nice and cool and won't slip out of your hand. I also own the 10 inch version which is great, but this one offers a lot more space. I love it! Perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "C.J. Lang",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "DO NOT BUY",
      "text": "I literally have nothing positive to say about this pan. Doesn't matter what heat or any type of oil you use, burns on and sticks on forever. No amount of scrubbing makes it clean. I am so mad I learned this after my return window closed because I purchased 4 pans and I am out over $500. DO NOT BUY.",
      "rating": 1.0,
      "verified": true,
      "author": "Joanne C.",
      "helpful_votes": 0,
      "publication_date": 20200707
    },
    {
      "title": "Food sticks & hard to clean",
      "text": "Food sticks, hard to clean. Bought this 12” pan because of the excellent reviews over the years. I use it every night. It replaced placed a Tremontana pan whose bottom was not perfectly flat on our new ceramic cooktop. Food sticks in the All clad pan despite seasoning and washing without soap. After each use extensive cleaning must be done including the backside of the pan. This never was as difficult with my Tramontana Pan. There is a $180 All clad pan, maybe this is the one that has been reviewed favorably.",
      "rating": 2.0,
      "verified": true,
      "author": "Mark Beaugard",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "More Than Worthy Replacement",
      "text": "This All-Clad 10\" pan replaces 9\" and 12\" stainless-bottom Farberware Classics that were getting a bit tired after 20+ years. The All-Clad is also -- within limits -- oven-safe, a hazard for the Classics with their compound handles and cover-knobs",
      "rating": 5.0,
      "verified": true,
      "author": "jaymac",
      "helpful_votes": 2,
      "publication_date": 20190628
    },
    {
      "title": "VERY DISAPPOINTING",
      "text": "This was a Christmas gift, and the first time it was used, it failed miserably. Everything sticks and leaves a mess to try and clean. French Toast NO, chicken NO, eggs NO, bacon NO. Everything we've tried resulted in a mess. I could have bought a cheap Wal-Mart pan and would have performed better for 1/4 the price. I am returning for something better. Very disappointed in this \"professional grade\" pan.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20200114
    },
    {
      "title": "Great pan, no regret with our purchase.",
      "text": "If all-clad made a car I’d buy it in a New York minute. This pan is reliable, versatile, and will be with us until we’re too old to cook. My wife was convinced that while it looked beautiful out of the box it would not hold its luster over time. We’ve had it for a year and a half of almost daily use and even she’s impressed by its ability to be brought from our teen’s fascination with high heat cooking. It is surprisingly easy to maintain with the right tools. Those tools? A nylon scrub pad, bar keepers friend, some hot water, and sometimes a bit of concentrated elbow grease. This pan works well.",
      "rating": 5.0,
      "verified": true,
      "author": "JFK",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Versatile",
      "text": "This pan replaced one of the non sticks after I watched a documentary on Teflon. Heat distribution is great. Size is pretty versatile and the lid comes in handy. Construction is top notch. Food is easy to brown though I'm still struggling with stickiness. Cooking white fish like cod is impossible, it comes out much better on a seasoned steel pan. Great surface and size for omelettes. Make sure to read instructions if you're new to stainless cookware.",
      "rating": 4.0,
      "verified": true,
      "author": "leonid nechayev",
      "helpful_votes": 0,
      "publication_date": 20200619
    },
    {
      "title": "It's a flawed product",
      "text": "Thinking I paid a lot of money for this item it should at least cook evenly. There is a hot spot and no matter how low you keep the flame it burns. Very dissatisfied with this pan. If I could I'd exchange it ,but unfortunately I just missed the cut off. Would not recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Dorothy C.",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Versatile and produces great flavor",
      "text": "This pan will become your go to pan. Large enough to handle all your meals and versatile to transfer your food from stovetop to oven. Comes with a lid too. I definitely recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pasquale Melillo",
      "helpful_votes": 0,
      "publication_date": 20200530
    },
    {
      "title": "Solidly made",
      "text": "This thing is built to last a lifetime. It's beautiful out of the box. It's easier to clean than I thought. For those interested in buying this, do your research ahead of time on how to cook with stainless steel, it requires some training.",
      "rating": 5.0,
      "verified": true,
      "author": "kyle",
      "helpful_votes": 2,
      "publication_date": 20190125
    },
    {
      "title": "Bottom not flat. Wobbly on stove and concave shape causes pooling...",
      "text": "As others have stated, bottom just isn't flat...which is something I have no problems with when using far less expensive pans. My 12 inch pan arrived both wobbly on my glass-top stove and with a curved (concave) bottom. It's difficult to show the wobbliness on the stove top, but see attached pictures which show just how concave a base is. You can see light under the flat surface of the cutting board and also the very straight edge of my level. Also note that water poured into the pan pools around edges. This is cold water. Hot oil would likely be even worse...but I'm not even going to heat this thing before returning it. Disappointed.",
      "rating": 2.0,
      "verified": true,
      "author": "CS",
      "helpful_votes": 0,
      "publication_date": 20201006
    },
    {
      "title": "Real Professional Quality",
      "text": "Great pan arrived with a perfect flat bottom unlike other reviews complained about. My only gripe might be how uncomfortable the handle is, my Cuisineart Multiclad Pro pans are much more comfortable in hand other than that a perfect 12 inch pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Tyree",
      "helpful_votes": 0,
      "publication_date": 20200113
    },
    {
      "title": "Beautiful piece of kitchen equipment",
      "text": "i took the plunge and invested in top end cooking equipment. If I’m going to spend money, might as well be on something I use daily, right? So far this has exceeded my expectations. Have to use kid gloves while cleaning or else I’ll scratch it up, but so far I’m able to return it to its original polished glory with a dish rag, bar keepers friend, and not much elbow grease. I’m hoping It will stay this nice as time goes on.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter M",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Good stainless steel frying pan",
      "text": "I like the way this pan looks and it cooks food very well. We always preheat the pan and use a lower heat when cooking, so we haven’t had any problems with food sticking. It’s easy to clean too. I only wish that it was a little deeper and that it had a glass lid. Other than that, I like this pan and I would recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "A.B.",
      "helpful_votes": 0,
      "publication_date": 20190218
    },
    {
      "title": "Absolutely amazing!",
      "text": "I absolutely LOVE this pan!!!! I have another All-Clad pan, which is why when I needed to replace my other frying pan, I just knew I was going to replace it with an All-Clad. A lot of people complain about cleaning stainless steel pans but, if you know how to properly cook in them, and maintain them, then they are a breeze to clean. (They do include instructions on how to properly cook in them and how to maintain them). If you are looking for any type of pan, I HIGHLY recommend you spend the extra money and get an All-Clad, they are absolutely worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric D",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "My Favorite Pan!",
      "text": "This is my absolute most favorite pan! It is wonderful! I bought the All-Clad 10-piece set, which I absolutely love. But I found myself needing a slightly bigger pan than the 10-in fry pan it comes with. This definitely fits the bill. I also absolutely love that it is dishwasher safe!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Bottom Bulges",
      "text": "t more than $100 more expensive this is just plain unacceptable. Maybe I am doing something wrong. I put some heat unuder it to make an omelette. Just before I add the eggse I turn the burner up all the way, in go the eggs and the center domes up. Please, someone, explain what is going on. This is supposed to be the best clad pan out there.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert D. Noyes",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Use this All The Time",
      "text": "This is by far the best pan I ever owned. I use it all the time heats wonderfully even and performs well. It can be a pain to clean sometimes but usually Bar Keepers Friend will get anything out of it. The handle stays cool and is easy to grab. The only key you need to remember is that you need to pre heat the pan, use oil and heat until it shimmers then out your food in.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Gibson",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "best pan i've ever used",
      "text": "best pan i've ever used. Retains heat well, has a nice large cooking surface and the edges are nicely curved so that food doesn't get stuck in the corners. The lid is nice and sturdy. The handle isn't exactly comfortable to hold, but it's also sturdy and seems to be attached to the pan well. It's an All-Clad. For the price, it should be high quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171119
    },
    {
      "title": "Know how to cook in stainless before cooking",
      "text": "Fantastic pan. No it's not non stick but you have to know how to cook in stainless steel. I can cooks eggs in this with little to no sticking. Great heat distribution and it's great at maintaining heat. I will be buying a smaller one next",
      "rating": 5.0,
      "verified": true,
      "author": "Catcity",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Nice pan, but ....",
      "text": "I bought this to fry potatoes in but they stuck like crazy. By the time they were done they were pretty much mush because I had to constantly scrape the bottom to try to loosen them up. it probably won't be used again. sad considering the price I paid for it.",
      "rating": 3.0,
      "verified": true,
      "author": "Janet R. Lanasky",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "D3 is great for induction",
      "text": "This pan is incredible. Can't say enough good things about it. We bought itbfornuse with our Frigidaire induction stove. Heats incredibly fast, consistent and evenly. Nothing sticks to it of you use it right. High quality but not stupidly heavy. Look forward to buying more all clad pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "Addicuss",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "It looked like a truck ran over it",
      "text": "Arrived damaged. No idea how that happened. It looked like a truck ran over it. Returned.",
      "rating": 1.0,
      "verified": true,
      "author": "Chessie Hanna",
      "helpful_votes": 4,
      "publication_date": 20180825
    },
    {
      "title": "The go to for everything.",
      "text": "Heats evenly. Sears meat wonderfully. Heavy duty but light enough to only need one hand. It's my #1 pan for everything. Cast Iron has it's place, non stick has it's uses, but if you have to choose one high quality pan to do everything this is it. I do suggest getting some barkeepers friend for cleaning. The minerals in tap water can leave a white residue on the stainless steel after washing that just doesn't look nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Baker",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Excellent pan, but . . .",
      "text": "The pan itself is wonderful, huge, and easy to clean. The lid handle, however, gets very, very hot on this and my other All Clad pans. For comparison, I also have several Cuisinart and Calphalon tri-ply pans, and theIr lid handles stay comfortable to grab no matter how hot the pan is or how long the pan has been on the burner.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Walker",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Lives up to the hype!",
      "text": "I've had this pan for almost two months now, and it has lived up to the hype and proven itself worthy of the expense. I was going to buy a whole set of All-Clad cookware and I got good advice, \"Just buy one and see if you like it before spending that much.\" Well, I love the pan and will be buying more for sure.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis",
      "helpful_votes": 2,
      "publication_date": 20171220
    },
    {
      "title": "Great Fry Pan",
      "text": "A great fry pan but, you are limited in the temperature range you can subject it to. Otherwise, a great investment that should last a very long time if you care for it in the manner the owner's manual suggest.",
      "rating": 4.0,
      "verified": true,
      "author": "1stRaymond",
      "helpful_votes": 3,
      "publication_date": 20180130
    },
    {
      "title": "Great product made in USA.",
      "text": "Awesome, heavy duty product, made in the USA, works with flat top range.",
      "rating": 5.0,
      "verified": true,
      "author": "S+K_AmazonBuyer",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "Works on induction cooktop.",
      "text": "This pan replaces another brand 12 inch pan that warped. I have always liked the other All-Clad pots I have and so far this one does not disappoint. I am also happy to see it is made in the USA. Although it is supposedly dishwasher safe I never put my pots and pans in the dishwasher, preferring to wash them by hand with an occasional dab of Barkeepers Friend that keeps them looking sparkling and new.",
      "rating": 5.0,
      "verified": true,
      "author": "Roxie Tolman",
      "helpful_votes": 0,
      "publication_date": 20190414
    },
    {
      "title": "LOVE this pan!",
      "text": "I absolutely love this pan and use it all the time. It's way too expensive for me, however. It was given to me as an xmas gift. I don't think I could afford to buy so many All-Clad pans. I ended up buying the Cuisinart MultiClad Pro  Which I think is comparable to the All-Clad pans at a much cheaper price. But I do, LOVE the All-Clad frying pan.",
      "rating": 5.0,
      "verified": true,
      "author": "Patricia Khan",
      "helpful_votes": 2,
      "publication_date": 20151228
    },
    {
      "title": "Best pan ever!!!!!",
      "text": "This is the best pan ive ever had! It was totally worth the money spent. Several posts are upset because they say the pan warps easily. I’ve found if I cook on medium heat and never wash the pan while hot it stays perfectly flat! Love it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Dunn",
      "helpful_votes": 0,
      "publication_date": 20200601
    },
    {
      "title": "Still the Best.",
      "text": "When I first used this pan years ago, it changed cooking for me. You can really abuse it in terms of cleaning (or lack there of) and with just a little elbow grease it brightens right up again. The handle is plenty comfortable, contrary to what some detractors say, and maneuvering the pan by the handle is incredibly easy and balanced. All-Clad is the best compromise between the heat retention of cast iron, the even heating of aluminum, and the durability and no-nonsense properties of stainless 316. Every kitchen is seriously lacking until it has one of these.",
      "rating": 5.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Worth Every Penny",
      "text": "I'm a housekeeper by day and a serious cook by night, not a lot of income but ok. To buy a 120$ skillet is preposterous or is it? I'm so happy I did, I just wished I had not waited so long, the best pan I could have ever wished for.",
      "rating": 5.0,
      "verified": true,
      "author": "Steven H Nelson",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "... expensive fry pan I have ever purchased and the beautiful silver is no longer after the first use I ...",
      "text": "This pan is very hard to clean Is the most expensive fry pan I have ever purchased and the beautiful silver is no longer after the first use I have scrubbed and scrubbed and can’t get the pan clean after searing chicken and the oil splattered in the sides. It probably cooks ok, that good but very sad it doesn’t still look beautiful after just one use:(",
      "rating": 3.0,
      "verified": true,
      "author": "krk",
      "helpful_votes": 3,
      "publication_date": 20180301
    },
    {
      "title": "The fry pan all other are measured against",
      "text": "I have 3 now - best all around fry pan - can go from stove top burner to 500F oven - cleans up well (this is not a non stick pan - soak it a little - and if you have something tough to get out - use a little baking soda and a sponge). This one is nice as it comes with a lid also.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim G",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "Love this pan...and I especially love that it is made in the USA!",
      "text": "I am very happy with this purchase. I use it on an electric stove top and have had no issues with it. I use it at least 3 times a week and it has not let me down yet. It was a bit pricey, but well worth the cost. I would rather purchase a good quality pan at a higher price than to purchase several low quality pans that do not hold up. The cover fits well. So overall I am happy with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "BTB",
      "helpful_votes": 2,
      "publication_date": 20161023
    },
    {
      "title": "everything sticks",
      "text": "first time I used it meat stuck to the pan & left white spots after cleaning. not impressed with All Clad. I would return it if it wasn't too late. Don't think I will purchase All Clad again",
      "rating": 1.0,
      "verified": true,
      "author": "Charles",
      "helpful_votes": 2,
      "publication_date": 20200714
    },
    {
      "title": "No regrets / excellent purchase",
      "text": "I am extremely pleased with the quality of this fry pan. It distributes heat better than any other skillet I have seen, and is easy to clean. It has good weight and is well-crafted. It is worth the price, spacious by design, and makes me want to purchase other products from the All-Clad line.",
      "rating": 5.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Great cookware",
      "text": "I received a set of this cookware as a gift, but needed an additional frying pan. This matches the set perfectly. Stainless is a great cooking tool. I have been using bar keepers friend to wash the pans., they still look brand new. Loving them",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda Longbine",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "One beautiful skillet.",
      "text": "I seasoned this skillet with coconut oil and it have performed perfectly. Along with the even heat distribution characteristics of the skillet I can now cook omelets or burgers and simply wipe the surface to clean it. I use this pan for more than I imagined.",
      "rating": 5.0,
      "verified": true,
      "author": "ChuckV",
      "helpful_votes": 3,
      "publication_date": 20180128
    },
    {
      "title": "Solid pan",
      "text": "So far so good. Can’t comment on longevity yet, though. The trick with this pan is knowing how it should be used and how to clean it. If you clean it right away and occasionally use the all clad powder detergent to clean, it’s a great pan. I have to use a decent amount of oil to keep stuff from sticking too bad when frying - but if it does the powder and a sponge do the trick removing it.",
      "rating": 5.0,
      "verified": true,
      "author": "A Person",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "My go to workhorse in the kitchen",
      "text": "Good weight, balance, heat distribution, and handling. East to clean when preheated and seasoned. Keep in mind nonsticks/stainless steel/cast iron all are used differently from each other, so before purchasing, do a bit of research on usage and care - so at least you know what to expect. This elevated my cooking and I highly recommend anyone to buy this as long as they know what they're in for cooking with stainless steel. Abused this many times already and i do a deep clean about once a week and looks brand new each time. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tee Villa",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "Bird safe",
      "text": "The only reason I purchased this is it is bird safe. Although it is nice and solid, I believe it is way overpriced only because food tends to stick unless a lot of oil or butter is applied first. However 3 stars for being bird safe.",
      "rating": 3.0,
      "verified": true,
      "author": "ricochet",
      "helpful_votes": 0,
      "publication_date": 20191223
    },
    {
      "title": "Happy with This Purchase",
      "text": "Happy to finally have purchased All-Clad cookware and this fry pan with lid is great and so much better than the coated fry pan we were using. It does take a bit of learning how to use the stainless and how to care for it, but so far it has cooked well and cleaned up very easily. We are looking forward to many years of use.",
      "rating": 4.0,
      "verified": true,
      "author": "DAP",
      "helpful_votes": 2,
      "publication_date": 20170325
    },
    {
      "title": "It’s worth the price.",
      "text": "I bought this pan because I don’t have gas in my new house, and I thought it would help with heat distribution on an electric cooktop. It far exceeded my lofty expectations. It’s surprisingly easy to clean, and surprisingly versatile.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Worst Pan I've ever had?",
      "text": "So if you notice I rarely review products. But this one takes the cake after a month of use this pan is basically a type of super glue for food products. It is completely unusable as every food item glues to the pan no matter how much oil or butter you use.",
      "rating": 1.0,
      "verified": true,
      "author": "marina perelman",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Gonna be a good marriage!!!",
      "text": "Got mine for $92 because it had a dent in the lid edge. Used a hammer, chisel with rubber pieces and a needle nose with hard plastic pinchers to bend it back straight. Works great!!! Couldn't wait so made a beef and potato goulash with gravy. Plenty of food for delicious leftovers. Already my favorite pan and I got some good ones!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200322
    },
    {
      "title": "Nice but...",
      "text": "Thought I was buying a do all pan...cooks great, but everything sticks and nothing comes off unless you spend hours scrubbing. Fairly new and it looks like I have had it working in restaurant kitchen.",
      "rating": 2.0,
      "verified": true,
      "author": "Troy",
      "helpful_votes": 0,
      "publication_date": 20200323
    },
    {
      "title": "Solid do all pan.",
      "text": "Love this pan. Favorite piece of cookware I own. Holds even temp, easy to handle, easy to clean once you understand how to use non Teflon pans...note for people who don’t understand uncoated pans... do research, super easy clean. I wish the handle was a little wider for grip but still great. Construction is solid. Sidewalls are nice for easy toss. Generally balanced feel. This one is gonna be in my kitchen a long while.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Jones",
      "helpful_votes": 0,
      "publication_date": 20180408
    },
    {
      "title": "Love this pan!",
      "text": "Great quality pan that should last a lifetime. Was looking for a new pan without all those chemical coatings for safer cooking and this was perfect. Purchased almost a year ago and it still looks like new thanks to my bar keepers friend cleaner.",
      "rating": 5.0,
      "verified": true,
      "author": "Teri",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "My new go-to cookware item.",
      "text": "Picked this up on the advice of two of America’s Test Kitchen’s reviews. What they say is right by me. It is now my most used piece. It cleans easily better than non stick..... I don’t fuss over stains on the back but agree with the reviewer who said you have a brand new pan until you use yours once. I love the results when I cook with it.",
      "rating": 5.0,
      "verified": true,
      "author": "sn",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Awful handle.",
      "text": "This pan has a terrible handle, not ergonomic, not naturally curved but straight which forces me to tilt my wrist uncomfortably down and it's not wide enough to hold this large 12 inch pan without twisting. Very disappointed, I returned it without using it.",
      "rating": 2.0,
      "verified": true,
      "author": "Manfish",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Good pan but the quality is questionable",
      "text": "This is by far the best pan I've ever cooked in. The heat distribution is excellent and the pan is comfortable to hold while cooking. Unfortunately, I question the quality of the build. I had very high expectations for the quality of this pan based on the reputation of All-Clad. After about a month of use, the side of my pan developed a bubble. For the money, I expected much higher quality and am disappointed by this defect.",
      "rating": 3.0,
      "verified": true,
      "author": "Kireesa",
      "helpful_votes": 0,
      "publication_date": 20201023
    },
    {
      "title": "Ordered 10inch fry pan with lid, came with no lid",
      "text": "It's astounding. The box even says it comes with lid. No lid inside though.",
      "rating": 1.0,
      "verified": true,
      "author": "Jimmjim",
      "helpful_votes": 2,
      "publication_date": 20200902
    },
    {
      "title": "Not as good as they claimed. Food still sticks.",
      "text": "For the price we expected to get a pan that we can actually cook food in and it wouldn’t stick. We followed the instructions on heating, cooking and cleaning but everything still sticks.",
      "rating": 1.0,
      "verified": true,
      "author": "Shawn webb",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Won’t clean right",
      "text": "Don’t waste your money on this it doesn’t clean right I really expected more from paying this price I was much happier with my $50 Cuisinart nonstick pan. Avoid this product I will never buy from all clad again",
      "rating": 1.0,
      "verified": true,
      "author": "Dan Halen",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "Hard to clean",
      "text": "Sorry I spent money on this pan. I wanted to get a nice pan and am very disappointed in this pan. Everything sticks and burns on the bottom. Difficult to clean. Wish I could return it!",
      "rating": 1.0,
      "verified": true,
      "author": "Christine Schoengarth",
      "helpful_votes": 0,
      "publication_date": 20191214
    },
    {
      "title": "good purchase",
      "text": "So far I am perfectly happy with this pan. I have been using it for two weeks now. it's not completely non-stick, but I only found it sticks a bit when I am cooking fried rice (might be the way I cook is wrong). Otherwise, pretty good.",
      "rating": 5.0,
      "verified": true,
      "author": "Yifei Liu",
      "helpful_votes": 0,
      "publication_date": 20191004
    }
  ],
  "product_meta": {
    "title": "All-Clad D3 Stainless Cookware, 12-Inch Fry Pan with Lid, Tri-Ply Stainless Steel, Professional Grade, Silver, Model:41126",
    "description": "Size:12-Inch| Style Name:CookwareThis All-Clad D3 Stainless Steel 12-Inch Fry Pan with Lid is an essential tool to let your inner chef out, from preparing cozy family dinners to cooking for guests with confidence. Made in the USA and crafted to ensure safe and even heating, this classic style boasts 3-ply bonding and extraordinary performance that will last for generations. This 12-inch fry pan comes with a stainless-steel lid and is ideal for searing, browning and pan frying just about everything. For over 40 years, All-Clad has been inspiring and equipping both the world’s top chefs and the top chef in each of us.",
    "rating": 4.6,
    "feature_bullets": [
      "TIMELESS PROFESSIONAL APPEAL: All-Clad D3 Stainless is the perfect choice for anyone who loves to cook. Beyond the classic stainless-steel style, you will find a well-constructed, high-performance, easy to use skillet for all, from beginner to culinary artist",
      "VERSATILE FOR ALL YOUR COOKING NEEDS: This 12-inch fry pan features low, sloped sides for easy flipping and turning, and a wide flat surface for searing and browning, fitting 3-4 chicken breasts at once. Each piece is crafted with quality materials to hold and distribute heat evenly throughout the pan, so only medium heat is needed for most searing, sautéing, and simmering",
      "MADE IN THE USA TO LAST A LIFETIME: The D3 Stainless collection features three alternating layers of American-made stainless-steel and aluminum, bonded together all the way to the rim. The classic stainless-steel handles stay cool on the stovetop and are permanently secured with stainless-steel rivets. Products are rigorously tested to ensure that every item with the All-Clad logo offers a lifetime of beauty and performance",
      "CONVENIENT AND LOW MAINTENANCE: All items included are dishwasher safe. For anything stuck on, use a mixture of white vinegar and water, or a stainless-steel powder cleanser, such as Bar Keepers Friend.Use a sponge or soft cloth on exterior surface",
      "LIFETIME WARRANTY: D3 Stainless cookware pieces are crafted in our factory in Canonsburg, Pennsylvania. Each piece is compatible with all cooktops, including induction, is oven and broiler safe up to 600 degrees Fahrenheit, and is covered by our limited lifetime warranty",
      "12-Inch covered fry pan with wide flat base and versatile low-profile shape",
      "3-ply bonded construction consists of durable stainless steel encapsulating an aluminum core for even heating throughout",
      "Highly polished cooking surface with starburst finish offers stick resistance and easy maintenance, plus won’t react with food; Material: ALU TRIPLY",
      "Contoured stainless-steel handles permanently secured with stainless-steel rivets; capacity etched on base",
      "Oven- and broiler-safe up to 600 degrees F; induction compatible; limited lifetime warranty; Made in USA"
    ],
    "specifications": {
      "Product Dimensions": "20.5 x 12.5 x 2 inches",
      "Item Weight": "4.5 pounds",
      "Manufacturer": "Groupe SEB",
      "ASIN": "B00FUF5K8W",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "41126",
      "Customer Reviews": "4.6 out of 5 stars1,686 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#1,580 in Kitchen & Dining",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 11, 2013"
    },
    "categories": [
      "Woks & Stir-Fry Pans",
      "Home & Kitchen",
      "Cookware",
      "Pots & Pans",
      "Kitchen & Dining"
    ],
    "price": 129.95
  }
}