{
  "website_summaries": [
    {
      "verdict": "This is an effective high-end volumizing mascara that really delivers on length and wards off smudges.",
      "pros": [
        "Provides a wealth of volume without causing clumps or feeling heavy",
        "Doesn’t smudge, even if eyes tear",
        "Removes easily without leaving residue",
        "Does a good job volumizing and lifting lashes, making them appear longer than they are, particularly for those with short lashes"
      ],
      "cons": [
        "May produce minimal flakes throughout day"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not all the hype",
      "text": "No problems with the seller. The rating is based on the product. I am so disappointed with the mascara. It seemed to be dried up. Doesn’t go on with ease. I use L’Oréal and the lush bar works well by gliding and brushing my eyelashes to darken and extend. I just want something that people would say wow your lashes are lush; are they real? This product does not meet that expectation.",
      "rating": 1.0,
      "verified": true,
      "author": "D E",
      "helpful_votes": 23,
      "publication_date": 20180115
    },
    {
      "title": "Unfortunately, this isn’t the right product for me.",
      "text": "I just received the mascara today. Unfortunately, this isn’t the right product for me. As I open the new brand product, the odor disturbe me. Smell like alcohol or plastics, really strong odor. Anyway, I tried the mascara on both eyes. In my opinion this works as a cheap mascara and I didn’t noticed any remarkable change, big or volume lashes, also has a strong chemical odor. Finally, I have to remove the mascara, because, the smells is disturbing, It feels heavy and annoying into my eyes.",
      "rating": 1.0,
      "verified": true,
      "author": "yadira lopez",
      "helpful_votes": 8,
      "publication_date": 20180814
    },
    {
      "title": "It's SO Big Mascara",
      "text": "Honestly I don't understand the crazy hype about this mascara. It curls well, sure, but doesn't help with length or volume. It also flakes, and doesn't go on smooth. And don't even think about putting it over a lash primer - it won't coat your lashes at all then. In all, it's probably close to the worst quality mascara I've tried. The one plus I can think of, is that it doesn't smudge. But then again, generally quality mascaras don't anyhow. I hope this helps! Maybe I just got a bad batch?",
      "rating": 1.0,
      "verified": true,
      "author": "Molly King",
      "helpful_votes": 8,
      "publication_date": 20160716
    },
    {
      "title": "Disappointing in every way",
      "text": "Am I missing something or not using it correctly? I was pretty disappointed after using this mascara a few times, especially after reading so many great reviews. Unfortunately I found this mascara clumpy and heavy. I like it when my mascara separates my lashes then makes each individual lash thicker and longer. This did the complete opposite. It made my lashes stick together, look super sparse and clumpy. It also took the curl away from my lashes, because it was so heavy. I really wanted to love it, but I guess I'm with the few it didn't work for. I VERY rarely give one star, but I can't find anything positive to say about this product.",
      "rating": 1.0,
      "verified": true,
      "author": "Monica",
      "helpful_votes": 16,
      "publication_date": 20150626
    },
    {
      "title": "Nice clean long lashes with a side of flakes",
      "text": "I was a long time user of Dior extase which is now discontinued and was looking for a comparable mascara. This one does give the night defined long lashes that my old mascara did and is a nice dark color. However, beware, this mascara is very flaky. After a full day of wearing this mascara I noticed a couple of tiny black specks on my face. As the night progressed more and more flakes appeared. I do not touch my face or rub my eyes so it was just happening with wear. I will use this until its gone, but my search for a great mascara continues.",
      "rating": 4.0,
      "verified": true,
      "author": "Sarah Sip",
      "helpful_votes": 3,
      "publication_date": 20180103
    },
    {
      "title": "The jury is still out on this one...",
      "text": "This mascara was highly recommended so I decided to give it a try thinking it would be better than my usual store brand mascara but it I’m not so sure yet. My review is a bit mixed because it does add length which I love just not the thinkness I was looking for. It comes off very easily with pure water or just a makeup wipe and it lasts all day. It doesn’t get very clumpy like the usual mascara..could there be a perfect mascara?? One that adds length and mega volume?? Girl could only dream!",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Great Cruelty Product",
      "text": "Cruelty free products are very important to us. Some of these products, unfortunately, can cause some irritation, ie, burning of the eyes. This was present in the last mascara, which will remain nameless, did. BIG gladly does not perform that way. BIG, is easy to apply, last all day, and is incredibly easy to remove; So much so that this makes BIG one of the easiest all day mascaras that we have ever used. The applicator applies the exact amount of mascara which allows you to avoid the \"gluppy\" ugly looking, artificially looking \"uni-lash. With BIG your eyelashes appear full and natural. BIG for us is KIND(curelity free) well performing.",
      "rating": 5.0,
      "verified": true,
      "author": "Althe J.",
      "helpful_votes": 2,
      "publication_date": 20170508
    },
    {
      "title": "So bummed, disappointed 😕",
      "text": "So bummed cause I had such high hopes for this mascara... It's a huge key down and there's only one good thing about it... PROS: -It gives a soft natural look after two Coats. (However it markets dramatic volumized lashes which is what I was really looking for) -Decently priced. (But you get what you pay for here) CONS: -Terrible flaking! -Smudges -Takes a long time to apply dude to and product being very thin, each coat is very faint in color, but more three coats is pushing it and the flashing gets really bad.",
      "rating": 1.0,
      "verified": true,
      "author": "Heather",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "pretty good!",
      "text": "I like this mascara a lot because it doesn't flake. I can't stand when I get flakes all over my face half way through the day and this definitely doesn't do that. It also makes my lashes look longer and voluminous with one coat without making my eyelashes look like spider legs. The only downside is that it's definitely not waterproof. I cut an onion with this stuff on and it totally smeared down my face, so I wouldn't get this if you're looking for pure waterproof. Plus side of that though is that it comes off very easily at the end of the day.",
      "rating": 4.0,
      "verified": true,
      "author": "Allison M.",
      "helpful_votes": 0,
      "publication_date": 20200414
    },
    {
      "title": "Best one yet",
      "text": "I love that this stuff doesn’t smear and rub off on my upper eyelids. It does tend to come off in chunks by the end of the day, but that doesn’t look nearly as weird as a big black half circle above my eyes. It comes off easily, almost like a clump of soft liquid rubber. I’ve tried many products and this is literally the best of all of them.",
      "rating": 5.0,
      "verified": true,
      "author": "ZenGirl",
      "helpful_votes": 0,
      "publication_date": 20201002
    },
    {
      "title": "Awesome for the price.",
      "text": "This is a game changer. You can easily get a natural look. Or you can coat the lashes from the front and the back, getting a super long, voluminous look. I worked a12 hour shift the first day I tried it. I put it on my bottom and top lashes. Literally no smudging whatsoever. No crumbling.. nothing. And I sweat a lot.. and have oily skin. But it came right off with warm water and cerave cream cleasner. I was so close to getting Thrive Causemetics tubing mascara for around $30. This is a great dupe. We'll see how long the tube lasts me. Will have to update in a month.",
      "rating": 5.0,
      "verified": true,
      "author": "Angel Dively",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "Tube was dried out; non-refundable",
      "text": "My friend works at Macy’s and bought me a travel case as a Christmas gift that included this mascara in it. It was awesome! Lots of fresh product that made my lashes look amazing! And, it didn’t irritate my eyes. However, this tube had very little product in it and within 15 mins I had to take it off due to irritating my eyes. This is non returnable, so a wasted $15. I’m going to reach out to the seller about lack of quality. I’m highly disappointed with the quality and highly dissatisfied with the no- return/no-refund policy.",
      "rating": 1.0,
      "verified": true,
      "author": "popcornfrenzy",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Did not make the cut",
      "text": "I wanted to love this mascara. I have medium length lashes, and I tend to stick to waterproof. Most nonwaterproof mascaras make my eyelashes not hold a curl even after curling them. I gave this mascara a go twice hoping it would do what it says hold curl. I heated the curler with my blow dryer and then applied, and lastly, I used the curler with no heat and both times my curl fell. Really disappointed with my mascara. All the reviews were good which is why I made a choice to buy. If you struggle holding a curl in your lash, this is not the mascara for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia Jaime",
      "helpful_votes": 3,
      "publication_date": 20181024
    },
    {
      "title": "Greatest mascara ever.",
      "text": "Best mascara out there. It is waterproof even though it doesn't state that. Only mascara that I can use with others and it doesn't clump, nor does the other one. I combine this with Maybelline rocket mascara. The only reason I do this is because the Maybelline gives a little more thickness at the roots. Plus somehow the combo of these two works awesome! I put like three/four coats on total and no clumping or smudging. I once in a while try something else and nothing else has worked as well or goes on as easy. I should just stop wasting time and $ on others.",
      "rating": 5.0,
      "verified": true,
      "author": "aaustad",
      "helpful_votes": 0,
      "publication_date": 20180109
    },
    {
      "title": "Best mascara out there!",
      "text": "I’ve tried hundreds of mascaras and this one exceeds every single one! I have really long lashes and most mascaras leave black on my eyes where my lashes hit both above and below my eyes and this is the only mascara that o have found that doesn’t do this. It is easy to remove, unlike waterproof mascara, but it has the staying power of a waterproof formula. It’s like little tubes around each eyelash. I get compliments every time I wear it! Honestly, there is nothing to compare this to, it’s in a class of its own and I’m totally in love!",
      "rating": 5.0,
      "verified": true,
      "author": "Sworsham",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Holy Grail",
      "text": "This is the 4th tube I've purchased. I constantly look for newer and better tubing mascaras but end up coming back to this. Its just plain reliably great. I have oily lids so smudges are always a problem for me but this refuses to smudge, it also comes off super easy with plain water when I shower at night. The other Japanese brand of mascara that I really like is damn near impossible to get off, to a point that its a fault not an attribute. Anywho, this is good stuff, you too should get it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sasha",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "literally the best mascara ever. I've bought it three times",
      "text": "This product is wonderful it stays on your lashes it doesn't drip off I leave it on my eyes for 3 days why scrub it off my eyelashes in risk my eyelashes coming off? I've never removed mascara what's the point you put it on elongate the look of your eyelashes why would you want to remove it? So anyway this is the best product and it'll be the only product I ever use I hate makeup I only wear eyeliner mascara and lipgloss that's it.",
      "rating": 5.0,
      "verified": true,
      "author": "Truth serum",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Please! Must try this mascara!!",
      "text": "This is the best mascara I have ever used. I have tried $30 mascara to $5.00 drugstore mascara and this is the BEST. It covers extremely well. It does not clump when applied. I applied 3 coats and my lashes were close to hitting my eyebrows. I also fell asleep with my make up on and it didn’t budge. No raccoon eyes even after a night of sleep. No smudging no flaking AT ALL.... also what I love - not tested on animals. It is 2018 why are we still testing on animals?!? I cannot say enough good about this mascara. I will never use another mascara again. Elizabeth Mott you are genius!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180815
    },
    {
      "title": "sub-standard mascara",
      "text": "I purchased the trial size pack. The mascara is some what drying, and is not easily removed. I found it to be clumpy and non-flattering. I see overall this product has high ratings, so perhaps the trial size is not the same quality as the normal size tube.",
      "rating": 2.0,
      "verified": true,
      "author": "Jenny Jenny",
      "helpful_votes": 0,
      "publication_date": 20190825
    },
    {
      "title": "Very disappointed. This is first time I have ever gotten ...",
      "text": "Very disappointed. This is first time I have ever gotten any allergic reaction to any cosmetic ever. Swollen eyes, itchy and lot of discharge. On top Of that it clumps the lashes, doesn’t add any volume and it’s impossible to remove it.",
      "rating": 1.0,
      "verified": true,
      "author": "Emil",
      "helpful_votes": 2,
      "publication_date": 20171226
    },
    {
      "title": "Stays on and washes off...",
      "text": "I've been using this mascara for over a year now and love how it stays on when you apply it but washes off with simply water when you want to remove it, which is so important because I really like to start with clean, non-goopy lashes every day. I would have given it 5 stars - because it IS a 5 star product - but the last tube I received hasn't been as great (perhaps it has been on the shelf for a minute or so). I truly believe that's a one-off if you will, so I still swear by this brand!",
      "rating": 4.0,
      "verified": true,
      "author": "CML",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Flaky and Clumpy",
      "text": "Only giving this mascara one star because it’s true that it doesn’t smudge, but it does flake, a lot. Aside from this, this product is probably the clumsiest mascara I’ve ever tried. Product is so thick as it comes out that it’s difficult to apply a thin layer. It could be that the shape of the brush is what does the trick but it does no good with thick and clumpy product. I agree like some others have said it actually makes my lashes look shorter! I like cover girl bombshell products much better.",
      "rating": 1.0,
      "verified": true,
      "author": "410",
      "helpful_votes": 2,
      "publication_date": 20180317
    },
    {
      "title": "Love love love",
      "text": "My favorite mascara . This will not flake off throughout the day nor will it smear if you rub your eyes after it dries. Plus it's easy to wash off with soap and water I like the trial sizes better than the regular size. I never use a regular full tube in the 3 months it lasts and this is just right for me. I wear mascara at least 5 days a week and I only apply in the morning. it doesn't need a touch up, it wears just like a waterproof but washes off like regular mascara.",
      "rating": 5.0,
      "verified": true,
      "author": "A big nobody",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Believe the hype!",
      "text": "I've tried so many brands of mascara - mainly from Sephora or department stores but also some drugstore varieties looking for one that makes my lashes look full (but not fake or clumpy) and most importantly doesn't give me raccoon eyes. It is the worst when you catch yourself in the bathroom mirror & have to wonder how many people you've talked to with mascara UNDER your eyes. I don't wear make-up every day so this 3-pack is perfect, knowing I will have a fresh tub waiting. So glad I stumbled on this product. For reference, my go-to has been Blinc - it stays on great & provided length but no so much fullness.",
      "rating": 5.0,
      "verified": true,
      "author": "Bunny MacDougal",
      "helpful_votes": 0,
      "publication_date": 20190104
    },
    {
      "title": "Alright",
      "text": "Unfortunately it’s just okay. Pros: it does not leave residue under my eyes which is my main problem with mascaras due to my extremely oily eyes. Cons: the mascara brush comes out clumpy, I have thin but long eyelashes and the mascara makes it look like I have 3 short lashes on each eye. I’m really disappointed about that because I love that it doesn’t make me have raccoon eyes but it makes my eyelashes look worse. Guess I’ll have to keep shopping for a water resistant and oil resistant mascara.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsay Foster",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Eyelashes are getting longer",
      "text": "Found this because I'm looking to replace all cosmetics to cruelty free products. Didn't know it would be the best mascara I have ever used! Not only does it go on super smooth and clumpless, it never feels like I have mascara on. I can rub my eyes with no bending or smudging my eyelashes. And the best part? My eyelashes are getting to be the longest they ever have been after washing off!! I think it's because it feels so weightless, it's not damaging my eyelashes like previous mascaras have. New staple for sure!!",
      "rating": 5.0,
      "verified": true,
      "author": "brianna morgan",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Stays on but easy off NOT ANYMORE",
      "text": "UPDATE:The formula has changed. It no longer comes off easily in the shower. I now have to use harsh make up removers to get it off my skin under my eyes. I'm so disappointed. Off to find another brand. :( I've been using this product for about 4 years now. I love it! If I sweat or cry it doesn't come off, but comes off easily in the shower with just water. I'm a redhead with sensitive skin, so having something like this that comes off with just a shower and no harsh chemicals is a huge plus. I love the way it goes on too! great product. I'll never use anything else.",
      "rating": 1.0,
      "verified": true,
      "author": "R. Langley",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "It is a very nice mascara. At first I was a little bit ...",
      "text": "It is a very nice mascara. At first I was a little bit suspicious about the way you have to take it off, because it does not wash away like a liquid, but more like small pieces (I use my fingers, when I wash it off and it is pretty easy to do. Only water needed). However, later I discovered that it is very cool, because actually it does not \"melt\", so I wear it to my hot yoga class and never have dark circles. And even in the swimming pool - if not much water splashes at your face, it does not washes away.",
      "rating": 5.0,
      "verified": true,
      "author": "Kristina",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "NO NO NO!!! DONT BUY!!",
      "text": "WAIT lmao. THIS IS THE WORST MASCARA I HAVE EVER USED. it literally had the most liquid-y consistency which made my lashes look non existent. I literally wiped it off and my eye lashes looked better WITHOUT IT. mascara has always been my favorite makeup choice - if I had to choose one makeup item to rely on for the rest of my life... it would be mascara. IT SUCKS. go get smashbox 'xrated' or too faced 'better than sex'. this is truly awful.",
      "rating": 1.0,
      "verified": true,
      "author": "Sheridan Peterson",
      "helpful_votes": 4,
      "publication_date": 20170314
    },
    {
      "title": "best mascara I've found",
      "text": "all mascaras I've tried end up under my eyes by the end of the day. this stuff stays on AND I like the look of it. I just do one coat for work but do multiple coats to go out (on those rare occasions). I like the multiple small containers too - smaller amounts means less is wasted when it dries out - and the smaller tubes actually end up cheaper.",
      "rating": 5.0,
      "verified": true,
      "author": "DogMom",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Buyer be aware... great product until it fell apart!",
      "text": "After about a month of using the product the 'ring' at the top of the opening that serves to remove the excess mascara from the brush when it's pulled out to apply came loose and is now stuck on the brush, not on the bottle where it should be. So now when I pull out brush it's all globby with mascara because the excess is not getting wiped off. So I can't use it any longer and need to pitch it. I have to say, until this happened I really like the product. Not sure if this is just a fluke or others have had this problem.",
      "rating": 1.0,
      "verified": true,
      "author": "NOVA DIYers",
      "helpful_votes": 4,
      "publication_date": 20150706
    },
    {
      "title": "My #1 go to mascara!",
      "text": "This mascara is my favorite mascara I’ve ever tried. It isn’t waterproof, but it will not budge from your lashes until it gets wet and you rub it off. There is MINIMAL flaking when the tube is almost empty and it does not run. I don’t need to use a makeup remover or even a wash cloth. It adds volume without getting crunchy and does not irritate my sensitive eyes. Definitely a great alternative for those who struggle with using a non-waterproof mascara.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah & Jason",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Best mascara formula I’ve ever used.",
      "text": "It doesn’t clump my lashes, doesn’t smudge, doesn’t flake after hours, stays on ALL day, yet is super easy to remove. I take it off when I get in the shower by wetting my lashes. It doesn’t smear away, but rather turns into a soft paste on your lashes that you can easily remove by combing them with your fingers. Doesn’t leave me with raccoon eyes. I’ve worn it to the beach before and it’ll still stay on your lashes when they’re wet, as long as you don’t touch them. Literally amazing. Only “compliant” is it doesn’t make my lashes as FULL as i’d like. Could use improvement in the brush aspect but I’m still buying it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina Santiesteban",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "MY EYES LIDS ARE SWOLLEN!!!!!!",
      "text": "This is not a hypoallergenic product! I used this mascara for 2 days and on the second days my eyes lids began to swell and itch. Woke up this morning to “juicy” eyes; full of mucus and pain. DON’T BUY THIS MASCARA!",
      "rating": 1.0,
      "verified": true,
      "author": "Shopaholic",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Good cruelty free option",
      "text": "This mascara works pretty well in terms of volume. It’s not the best I’ve tried but it is the best of the cheaper cruelty free options. Most important to me, it holds up well without flaking and is water resistant. It’s also less clumpy than others I’ve tried, though it does get a little more over time. The benefits have made it my go-to product!",
      "rating": 4.0,
      "verified": true,
      "author": "Emmylou Blue",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Formula too thin",
      "text": "I normally use better than sex mascara (which I absolutely love) but to save some money I decided to try this. For some women this might work great but for me it didn't the formula is very thin. I have very long eyelashes anyway so I need a thicker mascara. This also does not separate whatsoever it's kind of like throwing Black Ink on your eyelashes the formula is way too thin and the brush does not separate. I will stick with the better than sex.",
      "rating": 3.0,
      "verified": true,
      "author": "Danielle Kesling",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "Falsies look",
      "text": "This mascara makes your eyelashes stand out. It seems to have a charcoal face mask type of feel when you dont remove it with the correct make up remover. It peels and runs off on water easily. Gives your eyes an amazing look, they definitely seem to look at falsies lashes. Use 2 coats for a dramatic look. Creates an extended eyelash look, fibers give the length we all want. Products came in a small box 3 per box. Great small size to carry in your purse, travel or for a backup at work. Not sure if other tones are offered other than just black.",
      "rating": 5.0,
      "verified": true,
      "author": "Lilybree",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Clumpy and flakey fallout",
      "text": "The mascara did not perform the way i expected It flaked off throughout the day causing fall out. It did not provide much volume, however it did coat my lashes. I expected a bit better performance for the name and the hype. The company is small so this is just the beginning for them and I know they will grow and progress.",
      "rating": 3.0,
      "verified": true,
      "author": "Gina M 💕",
      "helpful_votes": 0,
      "publication_date": 20190805
    },
    {
      "title": "Not an easy application",
      "text": "So disappointed! When you pull wand out of the tube it is completely coasted you can’t even tell there is a wand on the end of it!! Had to wipe off excess before every use! Formula was easy to wash off, dried quickly with little mess, some clumping but not terrible. Not the best, probably won’t buy again",
      "rating": 2.0,
      "verified": true,
      "author": "kes",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "This mascara is the best!",
      "text": "This mascara is amazing. It's so hard to find one that doesn't smudge and this mascara is truly smudge-free. It is also easy to take off...no need for removers. It's the only kind I've used for years now. My only complaint is that after enough use, the piece that removes mascara once you pull the applicator from the tube breaks and it's a bit of a pain...but that usually means it's time for a new order anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Not BIG nor Volumizing",
      "text": "Idk what the big fuzz is about. I was trying to find an alternative for my Lancôme monsiour mascara and saw this had amazing reviews. I was so disappointed, I honestly have it as a back up now because the makeup is very thin I didnt enjoy it like other people did. There’s nothing Big and volumizing about it Had to spend more money and buy me the Lancôme one.",
      "rating": 3.0,
      "verified": true,
      "author": "Carlos",
      "helpful_votes": 0,
      "publication_date": 20181112
    },
    {
      "title": "... product wow is the only word to describe this amazing mascara. I am 58 years old and I ...",
      "text": "Let me just tell you about this product wow is the only word to describe this amazing mascara. I am 58 years old and I will pull no punches with anyone !! My eye lashes have gotten thinner over the years, and this product just put them back to my youth again... BIG IS A GREAT PRODUCT PERFECT NAME FOR IT TOO!!!",
      "rating": 5.0,
      "verified": true,
      "author": "elizabeth",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "Doesn’t flake or smudge",
      "text": "I was looking for a product that didn’t flake and this stuff is great. I notoriously rub my eyes (contacts hurt by the end of the day) and little to no smudging. I use it in conjunction with a good lash conditioner (Jane Iredale pure lash extender/conditioner). While this product doesn’t smudge or flake at all, it doesn’t seem to “extend” or “thicken” my sparse lashes. It is still a great every day mascara.",
      "rating": 4.0,
      "verified": true,
      "author": "Jennifer L. Rubio",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Not my favorite.",
      "text": "I was excited to try this because I'm always searching for the perfect mascara. I want something that darkens my lashes but didn't leave mascara under my eyes at the end of the day. This succeeded in not landing under my eyes, but didn't coat my lashes well. I felt like I needed to keep putting another coat on...then it looked clumpy. I won't buy it again.",
      "rating": 3.0,
      "verified": true,
      "author": "B. Beths",
      "helpful_votes": 0,
      "publication_date": 20181107
    },
    {
      "title": "Skip it...flaky and irritates sensitive eyes",
      "text": "Bought this as a replacement for Blinc mascara, which is my favorite but it's pricey. Well, this stuff definitely does not serve as a replacement. It is NOT for contact lens wearers or sensitive eyes. My eyes watered terribly with this stuff. It was very flaky and uncomfortable to wear. I also found it hard to remove with plain water, so I used soap to help to remove it. I tried to make it work but it made my eyes water so badly that I had to toss it. Would not recommend or repurchase.",
      "rating": 1.0,
      "verified": true,
      "author": "Vbunny",
      "helpful_votes": 0,
      "publication_date": 20180914
    },
    {
      "title": "Bam!  Best in class.",
      "text": "This is the best mascara ever! It does better than the several gel and fiber products that come In two separate tubes. It does not clump, it catches ALL lashes, even the inner and outer corners, and the distribution is even. It takes me half the time to do big lashes and I couldn't love it more. Perfect every time.",
      "rating": 5.0,
      "verified": true,
      "author": "Tina Alves",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Does lengthen lashes and makes them more prominent!",
      "text": "I saw a big difference in the lengthening of my, \"scrawny\" lashes! The product dries fast and is clump free! Price is fine for this mascara ! I did however have to wash a few times to remove it. It's not a bad thing, it's just what I noticed compared to my other mascaras. All in all, I would purchase again!",
      "rating": 5.0,
      "verified": true,
      "author": "Becky",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "The bottle is cheap but mascara is good before the bottle messes up on you",
      "text": "I like the mascara but once the part is the bottle moves up onto the cap in the pic, it’s not usable anymore. Please fix this problem. And it happens with no warning. I bought this mascara twice because I do like it until the container malfunctions after you use it awhile and now I can’t use it with no warning and have to buy another soon. Fix this and let me know if I can get it replaced even though it’s passed the return time.",
      "rating": 2.0,
      "verified": true,
      "author": "Carla",
      "helpful_votes": 0,
      "publication_date": 20190425
    },
    {
      "title": "amazing mascara",
      "text": "I am a 'senior' and have tried for years to find a mascara that did not lead to racoon eyes, clumpy spikes and other unpleasant results. No luck until this one... it really does what it says, does n't run or smear, goes on easily, etc., After decades of searching, this is it!",
      "rating": 5.0,
      "verified": true,
      "author": "Seale",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "I love this mascara but...",
      "text": "I love this mascara but....I hate the brush! The mascara itself is perfect. It goes on easily, doesn't clump and stays forever! Its seriously amazing! But the brush that comes with it is weird. It has a knob a the tip, dips in to the middle and then comes back out again at the bottom. I don't like the brush at all. I can kinda do my top lashes with it but doing my bottom lashes are out of the question. I used the brush from another mascara and was happy. If you changed the brush to a normal mascara brush, this mascara would be the best ever!!",
      "rating": 4.0,
      "verified": true,
      "author": "Pamela Craner",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "It's the best I've tried - but still looking for the perfect mascara",
      "text": "Pros: It does not smudge AT ALL Really lengthens and holds a curl It is SO easy to take off, it glides off into clumps like a fiber mascara Cons: It's quite difficult to apply, really wet and needs multiple layers The brush is awkward so it gets on my eyelids when I'm applying it and it does take a while to dry The brush layers it on unevenly, so you really have to work with it It does not add volume, only lengthens.",
      "rating": 4.0,
      "verified": true,
      "author": "jennie",
      "helpful_votes": 0,
      "publication_date": 20181111
    },
    {
      "title": "Works well, but probably not worth all the money",
      "text": "This mascara works, but it's not anything super extraordinary. It definitely makes my lashes look normal (I have tiny eyelashes) and usually requires 2+ coats to see full, noticeable lashes. Based on the reviews, I thought I was going to be impressed with the lack of clumpy, gross-looking lashes, but I was actually fairly disappointed. This mascara doesn't seem to have any particular clumping advantage over Covergirl or Revlon mascaras I've tried, and doesn't do a better job of creating more definition between each eyelash, especially some of the slightly longer ones. While I'm happy with it as a product, it really wasn't worth the money I spent VS a normal Covergirl mascara.",
      "rating": 3.0,
      "verified": true,
      "author": "Lindsey Bartholomew",
      "helpful_votes": 0,
      "publication_date": 20150809
    },
    {
      "title": "So far so good, still in test mode..",
      "text": "I just tried this on tonight, so far so good. I wear contact lenses and have very sensitive eyes as well. I have not noticed any irritation as of yet. Fingers crossed because I have tried every mascara from very pricey ($30) to el cheapo..and have yet to find one that does what I want without giving me an eye infection.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E Angrisano Ladner",
      "helpful_votes": 0,
      "publication_date": 20190531
    },
    {
      "title": "Quality Mascara",
      "text": "Great Mascara! I really love this product. It wears well and is easy removal at night. Does not smear. Acts like a permanent mascara, but easily removes with water and gentle exfoliation. I liked it so well I ordered it for my Granddaughter and got the same positive report from her.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Necoechea",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "It really doesn't smudge!",
      "text": "It delivers! I have longer eyelashes that always end up leaving a bit of mascara under my eyes whether smudges, flakes, etc. so annoying. this is a solid, smooth mascara that doesn't come off till you want it too with soap and water. it isn't thick so good for definition but the product doesn't take two coats. So i use a primer to build up thickness then put this on top for color, definition.",
      "rating": 5.0,
      "verified": true,
      "author": "heather",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "Not great, not horrible, definitely not worth the price",
      "text": "OK mascara, I have long lashes that look false with the right mascara. I had high hopes for this product and it definitely did not live up! Made my lashes spidery with no separation, clumpy, and really did not lengthen much. My favorites right now are Butter London \"Oh My How High\" and Lancome Hypnose Drama, I'd reccomend those but not this. I did give this to a friend to have, but she thought it was pretty sub-par, REALLY not worth the high price, I know drugstore mascaras with better results!",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Really makes lashes appear longer",
      "text": "The So BIG Volumizing Mascara does lengthen your lashes. Mine have become more sparse and there is a noticeable improvement with this mascara. The only negative, and I use the term lightly, the mascara doesn't come off as easily as other brands. Instead of one eye makeup remover pad, it takes two, but that won't stop me from re-ordering when I run out.",
      "rating": 4.0,
      "verified": true,
      "author": "Christy Jankowski",
      "helpful_votes": 0,
      "publication_date": 20181212
    },
    {
      "title": "NO RETURNS/ Do not purchase",
      "text": "This is non returnable and it is the worst tubing mascara that I have tried so far. I had racoon eyes by the end of my day and no one told me. Not sure when it started in my workday but by the end I looked embarrassingly bad. So far the best one that I have found is No.7 available at Target. AND you can return it if it doesn't work for you.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Queen",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Lasts all day and doesn't run",
      "text": "I really like this product; it doesn't clump (like some volumizing mascaras), it's light, and it lasts pretty much all day. Yes, it's not the MOST volumizing mascara, but it does add some noticeable \"weight\". Who wants the big ol' clumps hanging off of their lashes, anyway? Not this gal! Most importantly, while \"It's So BIG\" does NOT advertise that it's waterproof, I have never had a problem with it running (during the normal course of the day, mind you, I've never tested in the rain, etc). I have tried a LOT of different mascaras and this was the first time that I've had one that I could say lasts 9-10 hours without making me look like Tammy Faye Bakker.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer L",
      "helpful_votes": 0,
      "publication_date": 20151106
    },
    {
      "title": "I'll buy again",
      "text": "This stuff is pretty good! I am used to using the Too Faced Better Than Sex mascara, but I wanted to try something less expensive while still being cruelty free. It does not flake off my lashes throughout the day like some cheap mascara tends to do. The packaging is cute, and the wand is nice. It gives good volume and length, but doesn't really curl your lashes. This is okay because you can just use a lash curler :)",
      "rating": 4.0,
      "verified": true,
      "author": "Lily",
      "helpful_votes": 0,
      "publication_date": 20171021
    },
    {
      "title": "Can’t recommend. Read review",
      "text": "Purchased in August 2019. I used occasionally. The wand always came out with globs of mascara. Very hard to apply. On dec 22 2019 the brush end broke off inside the tube. No way to retrieve. Would like the seller to respond to this. I can not recommend this product.",
      "rating": 2.0,
      "verified": true,
      "author": "b",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Read the ingredients",
      "text": "My fault for not reading the ingredients. Thought I would give it a try because the Thrive I usually use is over twice the price. Methyl Paraben and Propylparaben ? Who still puts that trash in their product? Because this is a no return product, that is exactly where it is going...the trash.",
      "rating": 1.0,
      "verified": true,
      "author": "PH",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Great wand, great deal",
      "text": "I've only used it a couple of days and I'm already a big fan. I prefer trial size mascaras because my eyes are small. The brush is one of the best I've used. The formula dries quickly so I'd recommend using primer if you're wearing eyeshadow so you can clean up if need be. Just work quickly with it. Very impressed. I plan to add a little eye drops to it if it dries out but we'll see. Will probably buy again.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Reeves",
      "helpful_votes": 0,
      "publication_date": 20180322
    },
    {
      "title": "Finally... The Mascara of My Dreams!!",
      "text": "All I can say is that this mascara lives up to claims. My fine, sparse and straight lashes have never looked better and I am 54! I am a product queen, always in search of the perfect cosmetics for me and I have found it in this mascara. My lashes look longer, thicker (not too thick), stay curled, do not smudge or flake and it stays on even overnight! ( I normally don't sleep in it but the 2 occasions that I did fall asleep I did not wake up with raccoon eyes. It even comes off easily and does not irritate my sensitive eyes. I swear no one is paying me, lol, this mascara just really is the Bomb!!",
      "rating": 5.0,
      "verified": true,
      "author": "Mommaof2Boys",
      "helpful_votes": 0,
      "publication_date": 20180925
    },
    {
      "title": "Goes on pretty easily, no irritation (I have very sensitive skin/eyes",
      "text": "Goes on pretty easily, no irritation (I have very sensitive skin/eyes, so this was great). It's not super buildable, but still gives me fuller lashes, enough to satisfy, without that spider lash fake look. While it's not described as waterproof, I put it on yesterday and dug up my garden, as a test. It held on all day, through the sweat and heat. Takes a little bit more effort to remove with baby oil than other mascaras, but I see this as a plus. Will definitely purchase again",
      "rating": 5.0,
      "verified": true,
      "author": "tj thrasher",
      "helpful_votes": 0,
      "publication_date": 20180521
    },
    {
      "title": "New favorite!",
      "text": "I received a sample of this in my monthly IPSY bag. Thank the Lord for that because this mascara is a game changer for me. I love it. I apply 3 coats in the AM and my lashes look so long and thick. I'll never do the fake eyelashes that are the trend right now but this mascara is close enough for me. Love it. And NO clumping!",
      "rating": 5.0,
      "verified": true,
      "author": "Monnie_Ham_Ham",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "This is the best mascara I have ever bought",
      "text": "This is the best mascara I have ever bought. I put it on my lashes, and that's where it stays. I just purchased a mascara for $26.00 that claims it is 500 times for length, thickness, or whatever, and it eventually will wind up where it does not belong. So Big Mascara lengthens my lashes, and is so easy to remove. I accidentally slept with it on all night, and expected it to be all over my under eye's the next day, but nope it was not. It was just where I put it, on my lashes. I will be buying this from now own as long as they keep making there mascara the way they do now.",
      "rating": 5.0,
      "verified": true,
      "author": "Babushka",
      "helpful_votes": 0,
      "publication_date": 20160226
    },
    {
      "title": "Love this product!",
      "text": "This is my go to mascara. Stays on really great, no smearing or flaking and I love that its travel size because I can toss it in my smallest purse for on the go. The formula also seems gentle because I've gotten it in my eye by accident and had no stinging or irritation despite having sensitive eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "L. Kamila",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "BIG Disappointment",
      "text": "The brush has short bristles, not holding much mascara on it. It applies with thin, barely noticeable layer on on my lashes. Feels like it's a little dried out. Wore it for the day and when I tried to remove it with eye makeup remover it stuck like glue. Felt like trying to remove waterproof mascara with water. Took some effort with baby oil to remove it all and ended up taking some eyelashes in the process :(",
      "rating": 1.0,
      "verified": true,
      "author": "Michele Hahn",
      "helpful_votes": 2,
      "publication_date": 20181230
    },
    {
      "title": "Nice Stuff, could use a few tweaks.",
      "text": "There are some great things about this Mascara. First it doesn't flake off, second it washes off without leaving black smudges under the eyes and the same can be said if you fall asleep with it on. One thing I would prefer is a fatter brush. I like my mascara to go on heavy and thick without clumping and I think if the brush was fat in the middle and came to a point it would provide thicker coverage without clumping. Also I would say that you can't really re-apply so if you want a light look for work and then heavy to go out after it ends up just looking like you glued your lashes together.",
      "rating": 3.0,
      "verified": true,
      "author": "Aliki Russo",
      "helpful_votes": 0,
      "publication_date": 20160205
    },
    {
      "title": "THE BEST mascara I have ever owned",
      "text": "This is, hands down, THE BEST mascara I have ever owned. At first I was skeptical to buy sit since I never heard of this brand before and its price is comparable to other more popular ones. I am so glad I bought it based on feedback. I have been using this mascara for over two weeks and it is as good as on the first try. It does what it promises to do: voluminizes my eyelashes beautifully, no crumps, doesn't smear through the day, and even gives some length. I have normal to long eyelashes, but I like them to look full and vibrant and this product does the trick. 100% recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "JoJo",
      "helpful_votes": 0,
      "publication_date": 20150108
    },
    {
      "title": "Amazing mascara!",
      "text": "I LOVE this mascara!!! I am always on the hunt for quality mascara and I’m always trying to save a buck. This mascara is both. I am used to spending $20-$30 on mascara to find something that doesn’t give me raccoon eyes by the end of the day. My lashes stay fully curled and don’t fall all day long, I don’t even get out of the shower with raccoon eyes, it literally just rubs off. It doesn’t smudge, clump, or flake. As long as they don’t change the formula ever and keep this mascara as affordable as it is I will always come back to it!!! Awesome stuff!",
      "rating": 5.0,
      "verified": true,
      "author": "Alana Colaruotolo",
      "helpful_votes": 0,
      "publication_date": 20190305
    },
    {
      "title": "My all time favorite mascara!",
      "text": "I wasn't blessed with the most luscious thick, long lashes and this mascara really makes up for it! I'd compare it to a tubing mascara version of the Too Faced Better Than Sex (except without the god awful flaking). I'm now on my third tube!",
      "rating": 5.0,
      "verified": true,
      "author": "R.",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "This. is. IT!",
      "text": "This. is. IT! After trying nearly every mascara I could get my hands on (former Nordstrom and Sephora employee) I stopped my search about 4 years ago when I found THIS lil tube of magic. I have a tendency to get raccoon eyes a couple of hours in and this product completely solved that for me. It doesn’t smudge whatsoever. This a “tubing” mascara and will remove easily with warm water or your fav makeup remover.",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsie Jones",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Doesn’t flake but brush sucks",
      "text": "Works great at non clumping. The brush sticks!! Had to use the brush from another brand. Cap is a direct size so it’s not air tight. I might look at something else next try. I wear contacts so anti flaking is what I’m searching for.",
      "rating": 3.0,
      "verified": true,
      "author": "Diane",
      "helpful_votes": 0,
      "publication_date": 20200407
    },
    {
      "title": "This is the best mascara!",
      "text": "Worth every penny. I’ve tried every mascara out there, even way more expensive than this one. Never flakes, stays on perfectly until you decide to take it off, yet it comes off easily with soap and water. Resistant to sweat and tears without the difficulties that come with waterproof mascara. Makes your lashes look long and beautiful without clumping!",
      "rating": 5.0,
      "verified": true,
      "author": "MB - Cincinnati",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Great buy!",
      "text": "I was a fan of the Benefit and Better Than Sex mascara, however it seemed a little pricy. I thought I'd give this a chance and I really loved it!! It makes my lashes look longer, and although it does clump a little, I use an eyelash brush/comb to separate my lashes. This will be my mascara from now on! Loved it!! And my lashes did remained curled after curling them and using the mascara. They did not weigh down.",
      "rating": 5.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Meh.",
      "text": "Wasn’t so great. While the formula is nice it still didn’t do much for my lashes. For the extra money I paid I didn’t get the wow long lashes you see in the video. Save your $ and go to the drugstore and get the regular stuff. Guess I’ll be shelling out $75-$100 for extensions instead. What a shame.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "BEST MASCARA EVER",
      "text": "I initially tried this product as a sample in an Ipsy bag. I thought, \"Hmm, this is okay...\" then I went back to my original brand and thought, \"What is wrong with this crap?!\" I bought a new tube of my usual and was still very disappointed. So you have all been warned. Once you try this, there is no going back. Perfect Mascara! Not too thick and not too thin. When you apply more than one coat, you don't get the Gabore Look...not that there is anything wrong with that. If that's what you want! Me, not so much. Thicker, longer looking lashes and easy to apply. Worth every penny",
      "rating": 5.0,
      "verified": true,
      "author": "S. Francis",
      "helpful_votes": 0,
      "publication_date": 20150103
    },
    {
      "title": "Disappointed",
      "text": "I was super disappointed with this product. The review were so good I had high expectations but this mascara fell flat.... literally! It takes like 10 coats to even look like it’s on and no volume what’s so ever, maybe I just got a bad one I don’t know 🤷🏻‍♀️",
      "rating": 1.0,
      "verified": true,
      "author": "nixie",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Stays on without smearing pretty well",
      "text": "I have been looking for a replacement for my favorite Clinique mascara that was discontinued. This is pretty close. It goes on very well, volumizes and washes off easily without smearing during the day. I have curly lashes and have issues with “raccoon eyes”. This mascara stays on the lashes for the most part. I would recommend it and I would buy it again.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "Meh",
      "text": "Bought this based on all the amazing reviews. It’s just meh. I have drugstore brands that I like better. It doesn’t volumize or lengthen any more than just a regular $7 mascara. Disappointed. Was exited based on the reviews.",
      "rating": 3.0,
      "verified": true,
      "author": "RunnerGurl",
      "helpful_votes": 0,
      "publication_date": 20191231
    },
    {
      "title": "Love this mascara",
      "text": "I love this mascara! Does not smear, smudge, or flake on me. Its not too wet or too dry. Its the perfect consistency. Most mascaras cause the tips of my top lashes to point down, and the tips of my bottom lashes to point up. (Does anyone else have that problem)? This mascara does not change the direction of my lashes after it dries. It also provides a decent amount of both thickness and length. Will continue to repurchase this. Its a little pricer than drugstore, but in my opinion well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Lance",
      "helpful_votes": 0,
      "publication_date": 20161111
    },
    {
      "title": "Love, love, love!",
      "text": "OK. I am a TOTAL product junkie \"specializing\" in mascara and hair spray. LOL! I read the reviews on this mascara and thought I would add it to my collection. I have very straight eyelashes that are on the short side and am always on the hunt for a mascara that adds volume and length without clumping, flaking or smudging - it HAS to last all day. This mascara is great! The brush is awesome and grabs every little lash (top AND bottom) for a perfect application and the formula is not too thick or too thin. No clumping, flaking or smudging (I will not put up with a smudge). In a nutshell... this is my new favorite!",
      "rating": 5.0,
      "verified": true,
      "author": "Ande Ricks",
      "helpful_votes": 0,
      "publication_date": 20150327
    },
    {
      "title": "Not like it used to be?",
      "text": "Not as good as it used to be, little chunks fall off on cheekbones throughout day.",
      "rating": 2.0,
      "verified": true,
      "author": "Knute",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Snapped my lashes off like a twig.",
      "text": "It looked great the first time I used it but I could not figure out why it never looked that good again until I noticed broken eyelashes on my make up remover pad. That's when I realized how short and ragged my lashes had become. I even tried soaking it off with cotton pads with make up remover on it and still, it actually broke half to a quarter of my lash length off. I have never had this problem with any other mascara before or since.",
      "rating": 1.0,
      "verified": true,
      "author": "Darla",
      "helpful_votes": 2,
      "publication_date": 20160109
    },
    {
      "title": "Great product",
      "text": "I received this product as a sample with the Ipsy subscription years ago and I’ve been hooked ever since. It’s my favorite mascara!!! I’ve never had issues with smudging. My eyes are very unforgiving if I’m not wearing the right product: it’ll all be smeared under my eyes because they “sweat” with most other mascaras. I’ve never had that issue with It’s So Big! For normal daily use, a tube lasts me ages.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190617
    },
    {
      "title": "Last two tubes turned  into a gummy mess",
      "text": "I’ve been using this mascara for about five years and love it, however the last two tubes turned into a gummy mess after just a few weeks of use. I’m going to attempt one more order and if happens again find a new product.",
      "rating": 3.0,
      "verified": true,
      "author": "jCervi",
      "helpful_votes": 0,
      "publication_date": 20201017
    },
    {
      "title": "DOES NOT RUN and is easy to apply",
      "text": "I am VERY picky when it comes to mascara. It is my only \"must have\" cosmetic. For whatever reason, my face turns all other mascaras to unflattering pools of blackness quite soon after applying. THIS mascara is very different. It stays on, DOES NOT RUN and is easy to apply. I like that they offer the option of getting the three small tubes as opposed to one large one. The customer service was excellent. They even offered to mail me a free sample. This is really good stuff. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Grace Silver",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Good Mascara",
      "text": "This mascara holds true to it's name. It does provide extremely big volume. The thing I like the best about it is, it does not smudge at all, even 12 hours later still no smudging or black dots under eyes. Yay finally! It is cry proof too, and I also splashed water in my eyes, and it is pretty waterproof, would say like 90% waterproof, so it is definitely sweat proof. It removes easily with my eye makeup remover. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fancy Face",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Cap and wand function broke",
      "text": "While I love the mascara itself I had an issue with the tube about a month after purchasing. When I unscrew the cap the center section stayed inside the tube and I was unable to then use the wand part. It was an expensive product that I would love to be able to still use or exchange since it was after the time I could return it to amazon. I wondered if anyone had had a similar problem. I'm sure it was just an unfortunate defective product for me.",
      "rating": 2.0,
      "verified": true,
      "author": "joan",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Smaller containers not for me",
      "text": "So I have been purchasing this mascara for a while now. This was the first time I picked the three smaller containers. I wasn't pleased with them. They seemed to dry out faster. And call me crazy but didn't seem to have as much product inside. I won't be buying these ones again. I'll stick to the larger container.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. & Mrs. Royals Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20190918
    },
    {
      "title": "It comes off easily at night when I wash my face",
      "text": "The mascara doesn't smudge or flake in any way throughout the day which is a big plus for me. It comes off easily at night when I wash my face, kind of like in little chunks rather than all over my face. I just don't see that it makes them more voluminous or a lot longer and that's why I took a star off. You can see I have mascara on but there is now wow factor on my lashes. With that being said, it's a nice quality mascara for all the reasons mentioned above. I'll keep it for every day use but to go out at night, I need something more dramatic.",
      "rating": 4.0,
      "verified": true,
      "author": "sophie09",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "Best. Mascara. Ever.",
      "text": "This is my first Amazon review, and I buy stuff through Amazon all the time - that's how much I love this mascara. I have really sensitive eyes that water a lot, so I have always bought waterproof mascara so it doesn't end up running down my face. The mascara usually ends up irritating my eyes even more. Not so with Elizabeth Mott. It goes on smooth, not at all clumpy, the brush is great. And best of all, it doesn't irritate my eyes at all. Even if I do have teary eyes, it doesn't run. Looks great all day too! This is an all around fabulous product. I would recommend it for anyone, especially anyone with sensitive eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "TaylorEF",
      "helpful_votes": 0,
      "publication_date": 20140830
    },
    {
      "title": "This mascara is a god send!",
      "text": "I've been looking forever for a mascara that doesn't make my eyelashes feel like crusty spider legs. This stuff lasts all day without a smudge, and comes off with a few swipes of warm water leaving my lashes feeling healthy! I haven't been able to wear mascara for years for smudging or just being a beast to remove taking half my lashes with it. I'll be a life long customer for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "It’s OK",
      "text": "There’s nothing wrong with this mascara, it works just fine and does give some volume - it’s just not what I expected based on the name, description, and other reviews. I thought there would be more “vavoom”, if you will. I’m going to keep looking for other mascaras.",
      "rating": 3.0,
      "verified": true,
      "author": "Justine Slosson",
      "helpful_votes": 0,
      "publication_date": 20190917
    },
    {
      "title": "Am I missing something?",
      "text": "How are there so many rave reviews for this mascara? I'm almost wondering if I was duped and not giving the real thing when I purchased this. Yes, there is definitely lengthening with this mascara, but \"volumizing?\" No. I have admittedly sparse lashes, and I don't use fake lashes or anything, so when I use this mascara, it just makes me look like I have maybe a dozen thin long lashes on each side. That just doesn't do enough for me! I have had better luck with other mascaras than with this one. I guess I'm going back to \"They're Real\" by Benefit until I find one that works better.",
      "rating": 2.0,
      "verified": true,
      "author": "Ellie M",
      "helpful_votes": 0,
      "publication_date": 20141210
    },
    {
      "title": "No flaking",
      "text": "Excellent little mascaras. Each tube lasts about 45 days before drying out, with daily use. Easy to clean off. No smudges throughout the day, even with watery eyes. Little to no flaking. You must use a lot of product to build dramatic results for thin lashes. Four coats made my lashes look thick and appropriate for office wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Mel S.",
      "helpful_votes": 0,
      "publication_date": 20200703
    },
    {
      "title": "Perfect!",
      "text": "Best mascara ever! I have oily eyelids, so finding a mascara has been next to impossible. But this stuff is, hands down, perfect! No smudging, flakes, or fading! This is now on my subscribe and save, cuz I don’t ever want to run out!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah W",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Not much volume",
      "text": "I wanted to love this mascara. It doesn't smudge which is great but not big on volume, not great.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth B Wedgeworth",
      "helpful_votes": 0,
      "publication_date": 20190729
    }
  ],
  "product_meta": {
    "title": "Black Volumizing Smudge Proof Mascara:Elizabeth Mott It's So BIG Volumizing Mascara-Waterproof Liquid Lash Extending Mascara Tube with Hourglass Wand-No Clump,Curl,Cruelty Free Eyelash Mascara 10ml",
    "rating": 3.9,
    "feature_bullets": [
      "FLEXIBLE 360° TUBING POLYMERS PREVENTS SMUDGES AND CLUMPS: Each tube wraps around the lash for perfectly, sweat-proof voluminous lashes that prevents smudging and clumping",
      "NATURAL WAX FORMULA HOLDS THE CURL: A lightweight, natural wax formula won’t weigh down lashes like other oil-based wax mascaras, and holds curl all day",
      "CORSET SHAPED BRUSH FOR EVEN APPLICATION: Deliver the perfect amount of mascara even to hard-to-reach lashes",
      "GENTLE ON LASH EXTENSIONS: The water-based, lightweight formula won't harm or reduce the full look of your lash extensions",
      "NO ANIMAL TESTING: Elizabeth Mott is a cruelty free brand in PETA's Beauty Without Bunnies program. 100% SATISFACTION GUARANTEE - If you are not happy with your order, just contact us and we will refund you, no questions asked. Email us (Elizabeth Mott) to try a sample!"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1 x 1 x 5 inches; 0.33 Ounces",
      "Item model number": "ISB",
      "UPC": "696859276217 794168025141 794168528406",
      "Manufacturer": "Elizabeth Mott",
      "ASIN": "B00FAEOCP0",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Makeup",
      "Mascara",
      "Eyes",
      "Beauty & Personal Care"
    ],
    "price": 13.0
  }
}