{
  "website_summaries": [
    {
      "verdict": "If you're trying to lighten your backpacking load, the Sawyer mini fits in the palm of your hand and weighs less than 2 oz.",
      "pros": [
        "0.1 Micron absolute hollow fiber membrane inline filter",
        "Attaches to included drinking pouch and other bottles",
        "Use the straw to drink directly from source",
        "Removes 99.9% of bacteria, protozoa",
        "Includes 16 oz",
        "reusable squeeze pouch, 7\" drinking straw, and cleaning plunger",
        "Lightweight and highly portable"
      ],
      "cons": [
        "Over-tightening the filters onto bottles or pouches can cause the gaskets to fail"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This highly-rated filtration straw offers multiple attachments and drinking options for exceptional hydration and safety.",
      "pros": [
        "Able to filter up to 100,000 gallons of water – an exceptionally high number compared to other straws",
        "Removes more than 99.99% of bacteria and protozoa",
        "Includes a portable drinking pouch, plain straw, and cleaning kit",
        "Lightweight and versatile"
      ],
      "cons": [
        "Many buyers had issues getting in touch with the company's customer service representatives"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "the dialysis system of water filtration made perfect sense. I bought it for my son",
      "text": "This product has everything needed to simplify hiking and carrying water. As a nurse, the dialysis system of water filtration made perfect sense. I bought it for my son, with a platypus 2 liter bag, to hike the PCT in Oregon. I thought it was brilliant. And it is. Except that on day two of his hike the O ring to create a seal transferring water into the reservoir- broke. Other PCT hikers were familiar with the problem on the mini. Apparently the regular size Sawyer filter does not have the same problem. Sawyer company- fix your O rings on the mini and you go from a 1 star to a 5!",
      "rating": 1.0,
      "verified": true,
      "author": "kirsten luft",
      "helpful_votes": 867,
      "publication_date": 20160820
    },
    {
      "title": "Tiresome; get the Squeeze instead.",
      "text": "It got so tiresome sucking water through this little tube when I was thirsty and just wanted to chug full mouthfuls. After 2 weeks of using it on the Pacific Crest Trail, I began to be envious of those who had the Squeeze and other filters. Also, the cap easily breaks or falls off and gets lost. I lost 1 cap and 2 snapped off, and didn't find anywhere where I could purchase just the caps and not the entire filter all over again. I wrote more about my hike on elinatravels.com",
      "rating": 1.0,
      "verified": true,
      "author": "elinaoli3",
      "helpful_votes": 149,
      "publication_date": 20170710
    },
    {
      "title": "False advertising",
      "text": "WARNING: It advertised that it can be used with the inline adapter accessory on CamelBacks, but it will not connect to the inline adapter. The grey part attached, but there is no threading for the blue part. I tried, and my spouse tried to unscrew the down flow end, but it does not come off. Upon closer inspection of the inline adapter diagram, they appear to be using a different type of filter. FALSE ADVERTISING.",
      "rating": 1.0,
      "verified": true,
      "author": "Shops From Home",
      "helpful_votes": 43,
      "publication_date": 20180524
    },
    {
      "title": "Broke after the second use!",
      "text": "I want to love this product. It is highly rated in the backpacking community. It is light and easy to use. BUT I took it out on two overnight trips and it broke on the second night in the field! I didn't do anything. It just came apart. I contacted the seller and they said: \"well that's unusual, but there's nothing we can do.\" You would think if it is so \"unusual\" they would stand by their product and replace it or at least give me some kind of discount.",
      "rating": 1.0,
      "verified": true,
      "author": "MomS",
      "helpful_votes": 178,
      "publication_date": 20160610
    },
    {
      "title": "Buy the regular one, not the mini",
      "text": "Sawyer changed the threads so it no longer fits on a smart water bottle. upon first use the filter snapped in half. luckily we had a spare on my backpacking trip",
      "rating": 1.0,
      "verified": true,
      "author": "Moose Wrangler",
      "helpful_votes": 30,
      "publication_date": 20180227
    },
    {
      "title": "Faulty gasket renders product useless. Company unresponsive",
      "text": "The gasket that forms a seal between the filter and the bag failed after the first few uses. This caused the dirty water to leak out when attempting to filter it and rendered the device almost useless. Attempted to contact Sawyer with my defective product but have not received a response from the company.",
      "rating": 1.0,
      "verified": true,
      "author": "pauly",
      "helpful_votes": 106,
      "publication_date": 20160624
    },
    {
      "title": "DO NOT BUY THE MINI",
      "text": "Placed this product securey onto a 1 liter smart water bottle and turned it upside down and squeezed...water poured all around the cap, but very little came through the spout. SO, i tightened it down real good...same problem, but when I went to remove the filter from the bottle, the body of the filter broke away from the part that was on the bottle, which stayed put. My assessment of this product is that it is poorly made and has no spot on any hike of mine, period. Get the regular Sawyer Squeeze, instead...tried and true!",
      "rating": 1.0,
      "verified": true,
      "author": "Perry McCullough",
      "helpful_votes": 16,
      "publication_date": 20180410
    },
    {
      "title": "Try something else",
      "text": "Nearly useless. Took on a four day hiking trip. After 6th use fill bottle began to leak. By next day where lucky to get 200ml per fill. Poor design and in need of better gaskets. Got to the point to fill 2 liters was an hour long process.",
      "rating": 1.0,
      "verified": true,
      "author": "Jay",
      "helpful_votes": 14,
      "publication_date": 20180714
    },
    {
      "title": "Very disappointed in this product and the lack of customer service",
      "text": "Very disappointed in this product and the lack of customer service. Used the filter on a 3 day trek, only to have major leakage at the seams after a few liters of water processed,following all the instructions (including cleaning, et cetera). We had to boil water the rest of our trip. I left a message with customer service from Sawyer a week ago and they have not had the time or courtesy to even bother to respond.",
      "rating": 1.0,
      "verified": true,
      "author": "Dr. Mark",
      "helpful_votes": 105,
      "publication_date": 20150830
    },
    {
      "title": "Everything started out great, but fell apart in the end",
      "text": "Everything started out great, but fell apart in the end. I loved this product when it was working but one of the gaskets failed and I could no longer use the filter. This was a huge problem, I was using this as a backup to my hand pump filter that clogged due to silty water, and I was left to boiling water like the good old days. Really a let down as I was hoping this would be a great piece of lightweight gear to keep on me for all my backpacking trips.",
      "rating": 1.0,
      "verified": true,
      "author": "Aurora Borealis",
      "helpful_votes": 23,
      "publication_date": 20170330
    },
    {
      "title": "Product description lied",
      "text": "The last item starting with \"Filter rated up to 100,000 gallons\" stated at the end that one \"pack\" included \"two Sawyer Mini filters, two 16-ounce reusable squeeze pouches, two 7-inch drinking straws, and two cleaning plungers\". Notice the word \"two\" is used four (4) times. HA! I ordered one \"pack\" and got \"one\" of everything the ad said I would get \"TWO\" of!! Don't fall for this ruse. With 1 \"pack\" you get ONLY ONE of each item. Bill Herald; Venetia, PA. Knuck4@verizon.net",
      "rating": 1.0,
      "verified": true,
      "author": "Bill Herald",
      "helpful_votes": 10,
      "publication_date": 20181209
    },
    {
      "title": "Great for traveling in countries where you shouldn’t drink the water",
      "text": "Recently bought this for a trip to Cuba where I was told you should only drink bottled water. I was able to use this to drink tap water when bottled water was not available. This filter does screw easily to most water bottles available. It comes with a handy pouch you can use as well but since I had empty water bottles saved I didn’t use the provided pouch. It doesn’t change the water flavor but it does seem to filter bacteria and Impurities from water. I would definitely take with me if and when I travel or camp in places where water quality is questionable. I have not used life straw but I can definitely recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Lajavrac",
      "helpful_votes": 4,
      "publication_date": 20190809
    },
    {
      "title": "BUY THIS FILTER!",
      "text": "BUY THIS IT IS WORTH IT. I've used it few times deep in backpacking country and have yet to have any problems. Didn't get sick or Montezuma's Revenge. Here's what I like: 1. can take water at any water source with immediate results. 2. compact. 3. orange - very visible at night. 4. easy to clean. 5. very lightweight and easy to assemble. What I don't like: 1. The little bags it comes with are worthless. Invest in the 64oz. large capacity bags. The little ones are the size of a toddlers juice bag.",
      "rating": 5.0,
      "verified": true,
      "author": "chris",
      "helpful_votes": 28,
      "publication_date": 20160622
    },
    {
      "title": "Doesn’t fit on Pouches",
      "text": "None of the filters easily screw on to even the supplied pouch, let alone other pouches. I bought a single one last year and it works great. Fits on the supplied pouch as well as others. Looking closely at the 4 pack and the threaded knob end is not the same size as the one on the individual one I bought. If you don’t screw these on carefully then leak when squeezing the pouch.",
      "rating": 1.0,
      "verified": true,
      "author": "leedew59",
      "helpful_votes": 9,
      "publication_date": 20180504
    },
    {
      "title": "Received a FAKE! Very disappointed!",
      "text": "I received a FAKE! Note the misspellings (there's another one on the front side of the bag). The filter doesn't screw onto any bottle (including Smart Water) and barely screws onto the squeeze bag. I'm glad I took a good look at it, because I can't even trust that it'll filter water properly for my backpacking trip in a few weeks (I don't have time to work out a return, so I'll have to purchase a legit one locally). I'm VERY disappointed in Amazon, as this is an \"Amazon's Choice\" product.",
      "rating": 1.0,
      "verified": true,
      "author": "Dean",
      "helpful_votes": 18,
      "publication_date": 20180618
    },
    {
      "title": "The o ring fell out and the device started leaking despite my attempts to put the stupid thing back in the device to the point that ...",
      "text": "The thing broke on me. The o ring fell out and the device started leaking despite my attempts to put the stupid thing back in the device to the point that i couldn't use it efficiently anymore. Imagine this happening in rural Africa of all places where things like this are supposed to be reliable or else i risk being poisoned. Well, that happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 7,
      "publication_date": 20180726
    },
    {
      "title": "Worked great the first few times",
      "text": "Very easy to use, effective indeed. However, the bag you use to collect the water to be filtered, split after just a few days on the AT. Thankfully one of my friends bought the slightly more expensive version of the same filter that came with two bags. He loaned me his, or I might have been in trouble. Great product, but maybe a stronger seam on the bags would be a good idea considering many thru hikers are solo and this could have been bad news.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Stephens",
      "helpful_votes": 5,
      "publication_date": 20190708
    },
    {
      "title": "Only reason to buy this one is to learn you should have bought the bigger one.",
      "text": "The only reason to buy it is to learn you should have bought the bigger one. Minimal flow. I upgraded to the larger Sawyer filter shortly after starting the Pacific Crest Trail after seeing how much faster a trail mates water flowed. I am a cheapskate and I regret being thrifty with this purchase. It takes substantially longer to filter the water through this one compared to its larger cousin. This is a pain in the booty when you need to do a couple litres of water and/or want to drink some serious water at that moment in the desert. Learn from my lesson and get the larger sawyer. It is absolutely worth it.",
      "rating": 2.0,
      "verified": true,
      "author": "Feeder of Floyd",
      "helpful_votes": 5,
      "publication_date": 20171019
    },
    {
      "title": "HORRIBLE taste and stopped working after just 3 day hikes!",
      "text": "MAJOR DISAPPOINTMENT considering I like Sawyer products usually. The large squeeze Sawyer is fine, but this product isn't worth $3, let alone $20. The taste was horrible, and even though I back flushed it after each use it was challenging to get water to run through it. I didn't use it for a week, and now the taste is somehow worse. After 3 hikes I can not use it anymore. Since it's past the 30 days I am now stuck with it. NOT HAPPY WITH THIS PRODUCT AT ALL!! I would like a refund or send me a Sawyer squeeze! I didn't expect perfection but 3 hikes is ridiculous, it should last longer than that SAWYER!!",
      "rating": 1.0,
      "verified": true,
      "author": "Roen ",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Squeeze Pouch fails soon",
      "text": "Did a 4 day backpacking trip in the Sierra Nevada Range with my wife. Plastic squeeze pouch fails badly on day two, with water leaking out everywhere. If we had not had a separate bottle of water treating tablets, we would have been in really bad shape. Although technically you could still drink through the filter and use it as a straw, or use it as an inline filtration system for the hydration system, this was not feasible for two people. The filter is fine, but the squeeze plastic pouch is dangerously low quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Sectas",
      "helpful_votes": 2,
      "publication_date": 20191118
    },
    {
      "title": "Great Little Filter",
      "text": "This filter is awesome! Light, easy to use, and pretty quick when paired with a plastic bottle for water collection. Ditch the silly squeeze bag that comes with it; it’s very hard to fill from small water sources, so if you can’t fully submerge it you’ll be filtering 4oz at a time. Luckily, the threading is the same as any water/soda bottle, and using one of those as the dirty water container works great, and is about the same weight as the bag it comes with. I have a feeling I’ll be getting use out of this filter for years to come!",
      "rating": 4.0,
      "verified": true,
      "author": "KG Grapefruit Supremeo",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "1/2 review because it was open.",
      "text": "Mine arrived in an open package within an envelope. I'm not sure if that's just from bouncing around in transit or if this was a returned item. Inspecting it and all looks good, I will have to give it a try. I will backflush it first and then see if there are any telltale signs of use, then flush it out with a few water purification tablets in a 2 liter bottle of water and see if all is good. All that being said, I trust the Sawyer Mini based on the many 5 star reviews, just giving it a 3 star because the package was open.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200415
    },
    {
      "title": "Nice compact Water Filter that performs as well as the best units",
      "text": "I purchased this filter to use while back packing, after hiking with someone recently, who had a nice filter pump and realizing I did not have one of my own. I absolutely love the small / compact size, that is still big on performance, filtering as good as the best units available (down to 0.1 micron). I especially enjoy the flexibility of the included equipment, that allows either drinking directly from a water source, filling the water bladder and then filtering the water to fill a water bottle, or drinking filtered water, from the bladder. Back flushing the filter is also easily done using the included plunger / syringe. Great System that will be getting a lot of use.",
      "rating": 5.0,
      "verified": true,
      "author": "Larry K",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Quickly became unusable and a hazard.",
      "text": "I took this to hike half dome in yosemite since the pouch would allow me to refill my 2L bladder. But things didn't go according to plan. The item I received quickly became defective after screwing the pouch on and off about 8 times (not nearly enough to fill 1L of water). There is a washer that fits loosely on the filter where the pouch screws on to prevent leaking. The washer is very low quality and became deformed so quickly, this caused unfiltered water (possibly containing Giardia) to get into my water bladder (thankfully i had some hand soap to clean the bladder before borrowing a friends filter to finish refilling). 2 star because it does filter fairly quick",
      "rating": 2.0,
      "verified": true,
      "author": "Wilson",
      "helpful_votes": 0,
      "publication_date": 20200719
    },
    {
      "title": "UNUSABLE",
      "text": "It will not attach to its own pouch or any other standard bottles such as Smart Water bottle. The pouch is fine because it takes any standard bottle cap. The threads at the filter are defective. Very disappointed.",
      "rating": 1.0,
      "verified": true,
      "author": "Connie",
      "helpful_votes": 6,
      "publication_date": 20180723
    },
    {
      "title": "Counterfeit! Beware!",
      "text": "If you want a Sawyer mini please buy it from a brick and mortar store. I bought this one and could NOT get it to work. It leaked and would not fit water bottles as it should. Turns out, it’s counterfeit. Sawyer even has a statement about it on their website. Bought a 2-pack from Academy today and they work amazing with NO leaks!",
      "rating": 1.0,
      "verified": true,
      "author": "Holly Sensabaugh",
      "helpful_votes": 4,
      "publication_date": 20200124
    },
    {
      "title": "Such a pain to use.",
      "text": "It takes a lot of time and effort to squeeze a tiny bag of water through a small filter. Also, the bags are difficult to fill with water. Not enough juice for my squeeze, literally! I'll keep using my awesome single-bag GravityWorks filter straight into my 1L bottle.",
      "rating": 1.0,
      "verified": true,
      "author": "M. Mathis",
      "helpful_votes": 3,
      "publication_date": 20190908
    },
    {
      "title": "Wonderful for your backpacking trips!",
      "text": "This is my second sawyer filter. I love how small it is, and the versatility of it! I installed mine in-line to my camelback hose. It’s amazing to have the ability to scoop up a bladder of lake/river/creek/stream water, and just drink immediately! I took my system on a multi-day backpacking trip this summer. While the other part of my party spent a good while pumping their water, cleaning their pumps, and doing the “chores” of water purification, I was able to scoop up 2L of lake water, tighten the lid, and be fishing before they had even started!",
      "rating": 5.0,
      "verified": true,
      "author": "Madison Wellington",
      "helpful_votes": 0,
      "publication_date": 20191009
    },
    {
      "title": "Wonderful small kit",
      "text": "I originally bought a Lifestraw, but realized how useless that item is. I'm glad I got this one instead the thing that excites me the most is that it can go inline with my bladder! How easy and fast! I hope I never need to use it, as I bought it for my emergency hiking kit, but I'm glad it's still there! My only suggestion would be to add a zip pouch to hold all the items so I don't have to buy one separately :)",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "The most useful thing you can take on a backpacking / longer hike trip",
      "text": "This is amazing product if you go to longer backpacking or hiking trips. It’s very handy especially during the summer when water consumption is higher. I tried it on mountain creeks and lakes and the water didn’t have any foul taste even when the springs/creeks looked dirty. Make sure you clean it after every trip because it can clog and it’s harder to use it if you don’t clean it regularly. While the water pouch that comes with it is not bad, I think it’s pretty small capacity so you might want to invest in some higher quality and capacity water pouch. It’s probably the best money you’ll spend if you are frequently doing longer backpacking / hiking trips",
      "rating": 5.0,
      "verified": true,
      "author": "Dejan Markovkj",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Leaks dirty water at bag connection",
      "text": "The gasket that forms a seal between the filter and the bag immediately failed . This caused the dirty water to leak out when attempting to filter it and rendered the device useless. I paid for a beginner back packing trip that included others from different states; four of us had brand new Mini's and all four of us had the EXACT SAME ISSUE. Thankfully the group leaders were able to filter water for us on our 6 day trip in the Ansel Adam's Wilderness.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Smith",
      "helpful_votes": 6,
      "publication_date": 20180816
    },
    {
      "title": "Necessary for any bug out bag or hiking pack",
      "text": "This is my second Sawyer mini and I’ve given many as gifts to my outdoor friends. Still my go to for water filtration. I tried the squeeze and found that I still prefer the mini for ease of use with a water bladder or just setting it up with a cnoc at camp and letting gravity do the work while I move onto other things around camp. Just be sure not to let these freeze or they are compromised. They are small enough to put In your pocket and body heat should keep it warm enough though. I don’t leave home without it when I’m gonna be on the trail.",
      "rating": 5.0,
      "verified": true,
      "author": "AppyMountainTrekker",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Replaced my life straw very well. Love it.",
      "text": "My new favorite hiking tool. Works great, is very light and takes up very little space. I use it as a gravity filter most of the time. I cut off most of the bottom of a 1.5 liter essentia water bottle, poked a hole for a carabiner to hang it. Screw it on and use a length of tubing from the hardware store, works like a charm. Now it's a squeeze and gravity sawyer. ;) Update: Upon back flushing my syringe broke, I don't see this much! Currently trying to find a replacement. Within 24 hours of emailing sawyer a cs rep contacted me and is sending me a replacement syringe. Very cool! Thanks Ms J.",
      "rating": 5.0,
      "verified": true,
      "author": "SuperDave",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Worked well...until it didn't",
      "text": "I bought this for a canoe trip. It was very highly reviewed so I figured it would be fine, nevermind the one review that it went kaputt. The first few days of filtering lake water went well. After that, it became more difficult to filter. According to the directions, at that point, I backflushed it. All seemed to be well then, except that it was still difficult to push through to filter. I backflushed some more in case that was the problem. After that, I tried drinking through it again and TASTED lake water. There were also some dirty chunks coming through. Since I can't seem to return this item, I'm stuck with a faulty filtration system.",
      "rating": 1.0,
      "verified": true,
      "author": "Amber R Bosch",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Not a very sturdy product",
      "text": "Had this for a month and used it on 2 long hikes but it broke on the third long hike. The middle filter part broke away from the bottom part that screws into a water bottle. A very thin bit of plastic is holding these pieces together. Thought the product was great before that.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20200928
    },
    {
      "title": "Okay device.",
      "text": "It is okay. But ours 8s leaking so much between the bag and filter that the unfiltered water flows down and contaminates the filtered water. It started out fine but I think it may have got cross-threaded and some point and through threads on both pieces look fine, Incannot get it to seat right anymore. Useful now as a straw only.",
      "rating": 3.0,
      "verified": true,
      "author": "hike4diamonds",
      "helpful_votes": 0,
      "publication_date": 20201004
    },
    {
      "title": "Every hiker should carry this in there pack.",
      "text": "Love the Sawyer Filters. I have a regular sawyer filter and have used it for over two years while day hiking in Colorado. What a game changer not having to carry the weight of 3 liters of water. This mini is for my daughter who hikes in Utah. If water is plentiful on the trails you hike, this light weight filter is a must. It’s also reassuring to know I can have clean filtered water while out hiking. Bonus it fits in the 1 liter smart water bottle.",
      "rating": 5.0,
      "verified": true,
      "author": "Nconner",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Plastic bag ripped after 3rd use",
      "text": "The filter itself is fantastic, but the plastic bag it comes with is bad quality. It started getting small holes after the 3rd use and leaked water everywhere while we were trying to filter it. It could have been bad if we didn’t have consistent access to waterways. We ended up having to drink directly out of the streams with the straw, which sucked since we had perfectly good water bottles. Filter=great, water bag=terrible.",
      "rating": 2.0,
      "verified": true,
      "author": "Alexander Spagnoli",
      "helpful_votes": 2,
      "publication_date": 20190625
    },
    {
      "title": "Would not seal",
      "text": "Would not fit bottles, water has no seal. Tried several bottles. I’m not saying they are all like this but mine is. Glad I checked it & didn’t have to use it in an emergency since I have had it for some time",
      "rating": 1.0,
      "verified": true,
      "author": "FP",
      "helpful_votes": 2,
      "publication_date": 20200607
    },
    {
      "title": "Order one that has a bag",
      "text": "I should ordered the other one that's rated the same from the competition but had a pouch that came with it. This seams to be nice, but with all the pieces that come with it, there going to get lost. Come on supply a .25 cent cloth bag to keep this all together. I know I'm going to be bent everytime I try to dig it out of my back pack and the pieces arnt all there together.",
      "rating": 3.0,
      "verified": true,
      "author": "Dave M. Shaw",
      "helpful_votes": 0,
      "publication_date": 20200509
    },
    {
      "title": "This is the one you want to buy",
      "text": "I wanted a simple water filtration for personal use that is small and effective. When compared to LifeStraw, which has a huge marketing program, you'll see that this Sawyer filter has many advantages and better filtering. And the threads on the foyer are the same threads on a Dasani water bottle and many other bottles. Regarding water Bottle threads, there is not really a standard thread, but there is some regularity. And Sawyer's match most",
      "rating": 5.0,
      "verified": true,
      "author": "RoadTrip Eddie",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Hardly a working product...",
      "text": "Bought the two-pack. Only one of the two had any flow though. The syringe provided does not fit neither the tube nor the filter itself, so flushing it with provided tools is not possible. I tried adapting other hoses I had around the house to the filter, and managed to flush it with force as described in the instructions. Even after, one filter had NO flow through it, while the other had very minimal. To drink from the filter that worked, it felt like sucking an elephant through a straw.",
      "rating": 1.0,
      "verified": true,
      "author": "Ajeet Thaevar",
      "helpful_votes": 3,
      "publication_date": 20181107
    },
    {
      "title": "It works just fine, but it's very slow if you need to ...",
      "text": "I drink a LOTTTT of water and recently went on a 6 day trip with only this. It works just fine, but it's very slow if you need to filter 4-5 liters of water a couple times a day. I'd think it would be perfect for day trips and an EXCELLENT backup system, but for longer and group trips I'll opt for a gravity setup. My main complaints are that the filter doesn't easily screw onto the provided pouches...the threads seem a little off or maybe the TPI is just making it difficult. Aside from that the little o-ring inside the filter kept popping out which is not fun in the wilderness.",
      "rating": 3.0,
      "verified": true,
      "author": "PDV",
      "helpful_votes": 3,
      "publication_date": 20170630
    },
    {
      "title": "Came in handy during an earthquake.",
      "text": "Summary: I was on a team expedition on an island a couple years ago. There was an unexpected earthquake which stranded for several days. Luckily, most of the team members were given these in their emergency packs. Toward the end of our stay we had to use several of these, and they worked well. However, the quality/durability can be improved. Pros: 1) It works. 2) Easy to use. Cons: 1) Needs better build quality.",
      "rating": 4.0,
      "verified": true,
      "author": "JKN",
      "helpful_votes": 0,
      "publication_date": 20190710
    },
    {
      "title": "Highly recommend",
      "text": "Wow these were great. Used these in Nepal and through SE asia for reliable water. Worked easily and qickly. We just set them up propped up over a water bottle and let them go. In a few minutes, fresh water. Kept us from having to buy lots of bottled water, and not having to add to the plastic water bottle pollution problem there. Had no problems at all. Used 2 for water for 5 people, for 2 weeks and then 1 of them for 2 people for another month, with occasional bottled to supplement, as bottled was sometimes provided at our lodging. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Foodmaven",
      "helpful_votes": 2,
      "publication_date": 20181229
    },
    {
      "title": "Awesome Deal on a GREAT Filter",
      "text": "this is a very good deal. This water filter is used by backpackers to be as lightweight as possible because it is compatible with a smart water bottle. You can buy smart Waters at any convenience store for a dollar fifty. I'll go the water is just water in my opinion, the real values that you can use that light weight and indestructible smart water bottle to screw into this water filter and it is an awesome lightweight combination do you ensure that you have clean drinking water.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike Bius",
      "helpful_votes": 0,
      "publication_date": 20200903
    },
    {
      "title": "Understandably slow, highly recommend",
      "text": "Love this thing. It connects right to the water line, and adapters made it a simple click. You can fill a pouch with lake water to sip purity on demand or let it gravity purify a separate pouch to swap out. It does clog easily and requires frequent backwashing. It's a straw filter! DO NOT try to rush filtering by squeezing the pouch, the pouch WILL fail. Literally trusted my life with this device on the 100 mile Uintah Highline trail and others, and I will do so again with my original purchase. Also got the Sawyer 4 pack of pouches. Redundancy helped when one pouch failed. Still had purifying tablets if the filter itself failed.",
      "rating": 5.0,
      "verified": true,
      "author": "Drumdogma",
      "helpful_votes": 0,
      "publication_date": 20200711
    },
    {
      "title": "Non functional",
      "text": "Completely useless, non functional straight out of the box. Does not thread onto the included bag, or the 32oz Sawyer bags ordered separately, correctly and thus sprays dirty water everywhere when you try to filter. Saw some threads suggesting the O ring might be the problem, replaced that with a new one I had on hand - no change. O ring doesn't help if you can't even screw the thing on straight.",
      "rating": 1.0,
      "verified": true,
      "author": "Dobbs",
      "helpful_votes": 6,
      "publication_date": 20180705
    },
    {
      "title": "Must have for ANY traveler.",
      "text": "This is my second one that I've purchased. That's because when I was traveling, our host liked it so much, she wanted to keep it. I gave it to her and now this one is for me. Very light. I take a simple, light weight drinking bottle wth me and fill up on tap water through this no matter what country I travel to. Saves money on buying botled water and gives me peace of mind knowing I'm safe anywhere. This is a must have for any traveler. At airports, I can get through security with an empty bottle, go to the drinking fountain, and have free, safe water to drink.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayner",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "The best water filter on the market",
      "text": "I do quite a bit of backpacking and I have found my go to water filtration system. I have used iodine drops, purification tablets and other life straw type devices. This one is by far the best for the price. Just fill up the bag with stream water, screw on the filter and squeeze the water into a bottle or straight into your mouth. No waiting for the drops to work, no chemical taste. We just used this on Mt Adams and 3-4 other hikers asked to use it while waiting for their drops to work.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Wallace",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Will not fit a standard water bottle",
      "text": "I purchased this To take on a weekend outing hiking around. I tried ti out with the straw and it works fine, bit when I tried to attach it to different water bottles I was surprised it did not fit a standard water bottle. I tried life water, smart water and even a plain 2 liter. This will not fit these bottles. It seems the threads are different. I went to the store and purchased a mini from the store and it fits a standard water bottle just fine. The treads are different. I don;t know if this is a old model or a bad batch.",
      "rating": 2.0,
      "verified": true,
      "author": "Angela",
      "helpful_votes": 3,
      "publication_date": 20180418
    },
    {
      "title": "Lifesaver!",
      "text": "This thing is awesome! Bought this for my first backpacking trip and definitely worth the money. Used it mostly to filter water straight into my bottle or water pack. Also drank right out of it at times. Never had any issues and water flows through it better than I expected",
      "rating": 5.0,
      "verified": true,
      "author": "Nick Hansen",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "So Far So Good 👍",
      "text": "I did test the filter and the bag it came with twice to make sure it worked, and the bag did not leak either time. I bought this for use in case of emergency. I like that it comes with a straw you can attach so you can drink directly from the water source. The only problem is when I tried to attach it, I was afraid it would break :( I read the reviews on the Lifestraw, and many of them were saying to buy this instead.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Water bladder and inlet rubber seal leak after 2 liters of filtering",
      "text": "I would not recommend this product. Using a medium squeeze after 2 liters of filtered water the bladder burst and contaminated the 2 liters of clean water. The rubber seal on the inlet side of the screw cap started leaking as well. I would not recommend as your stand along filtration system. Once it’s leaking it’s u usable. What a waste of money.",
      "rating": 1.0,
      "verified": true,
      "author": "shimon ",
      "helpful_votes": 0,
      "publication_date": 20200228
    },
    {
      "title": "It's a real life saver when you need it.",
      "text": "Although I've only used this product once, I will say that it performed flawlessly when I needed it. I took it on a camping trip to a relatively stagnant lake/pond. The water was still and covered in moss. I was running short on clean water and decided to give the Sawyer a try. I loaded the squeeze bag up with some water free of debris and filtered it into my water bottle and drank it/used it for cooking. Well, I woke up the next morning not-dead or with a severe case of diarrhea. The Sawyer mini was there for me when I needed it.",
      "rating": 5.0,
      "verified": true,
      "author": "David B. Schnipke",
      "helpful_votes": 0,
      "publication_date": 20200608
    },
    {
      "title": "It works! Just... be careful. Giardia's a thing.",
      "text": "My partner and I have used this little sawyer filter for years on backcountry camping trips, and it's worked like a dream. We typically jerryrig a gravity filter out of two water bladders and this filter. It's worked GREAT for ages, until this spring when we went camping on the Potomac and filtered some of the water from it. We both got really sick for a good 48 hours with giardia and strep. I didn't dock more stars from this product because I think drinking from the Potomac was a stupid decision on our part. That river is NASTY! We should have just gone longer without water and saved ourselves the trouble of medical bills. lol..",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Filter works well, good price, horrible bag",
      "text": "Filter has performed well and the price is good. The bag that comes with the filter is horrible. They call it a squeeze bag (if I remember correctly) when it is really just a gravity drainage bag. Minimal pressure will cause the sealant to break and the bag to no longer function. I would plan on buying another vessel to use with the filter.",
      "rating": 2.0,
      "verified": true,
      "author": "cg",
      "helpful_votes": 0,
      "publication_date": 20200118
    },
    {
      "title": "Safely filters flowing or still water that would otherwise be very dangerous to your health.",
      "text": "I love these filters. They are easy to pack and filter better than any competition in their price range. Keeps you from carrying a lot of water on hikes. Not to mention they are rated to filter more gallons than their competitors. I swap them out every three or four months just to be safe since price is so reasonable. I don't want to risk a hiking vacation using a filter that has been wet for three months even though I've seen nothing to say it needed changing. My father has very sensitive kidneys and filters his tap water for his daily hydration needs with this filter. He uses them for 6 months and has never been happier.",
      "rating": 5.0,
      "verified": true,
      "author": "18whlsrolin",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "I Bought Two (2) & Plan on Buying More!",
      "text": "I’ve already purchased two (2), and am planning on buying more. For some reason, Buying Two (2) Separately is CHEAPER THAN Buying a 2-pack! Go Figure! I’m thinking about buying the squeeze type as well, for it surely will not only speed up filling bottles & jugs, but works with Hydration Packs, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "Pelagius ",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "WORKS GREAT",
      "text": "Went to Estes National Park and decided to try out the product at the top of Alberta Falls. I filled the bag with water and secured the Sawyer Water Filter to it and drank. Did not get sick and enjoyed cool potable water. My kids also tried and none got sick. We all enjoyed the water for the rest of the hike. For my bug out bag this product works and I have piece of mind. Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20190812
    },
    {
      "title": "Filter works; bag broke on first day of use and filter slowed down by third day.",
      "text": "Title says it all. The filter itself appeared to be functional, but the bag that came with it burst in the first day or use. Luckily we had other water bottles with compatible heads, so we weren't in that bad shape, but a bursting bag could really have left us stranded in the wilderness without water. Additionally, by the third day of use, the filter had slowed down significantly. Back-washing with the provided syringe didn't have any effect and the filter remained almost unusably slow.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Works great as long as you don't let it freeze at night.",
      "text": "I was very pleased with it overall. While backpacking in the mountains in the middle of summer, we had an unexpected cold spell one night and my filter froze. That meant it was boiling water for the rest of the trip. These guys are light enough weight that I am going to start carrying two of them. And I will also be keeping them in my sleeping bag with me as a matter of practice to prevent from freezing.",
      "rating": 4.0,
      "verified": true,
      "author": "Christopher Rowley",
      "helpful_votes": 0,
      "publication_date": 20200927
    },
    {
      "title": "Works fine, but how do you know if it's stopping bacteria?",
      "text": "I bought one of these awhile ago and have finally used it. It works as expected. If I had it to do over again I think I would get the upgrade. I like the idea of having the ability to back flush in the woods without having to carry a creepy syringe around with you. With the Sawyer Squeeze you can get a simple adapter too hook up a soda bottle to the clean end and use your filtered water to back flush. I have something similar set up for this using tubing, but sometimes the tubing blows off. I guess it's fine either way, and I haven't had it clog up on me over a few gallons of filtering.",
      "rating": 5.0,
      "verified": true,
      "author": "Just Some Guy",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Excellent mini system use as a straw or drain to a container.",
      "text": "Great mini filtration system. Can use as a straw or drain to a container. I’ve used on several occasion with tap water sources in the Phillipines, Mexico, Indonesia, Vietnam, Cambodia, Malaysia where direct consumption is not recommended. Also used in outdoor settings where water is free flowing and clear. I don’t push it with turbid or water with possible solid contaminates. Flow rate is ok for single or couple. After each use I reverse flush and insure its dry before stowing. As with all filter systems I would discard after 1 year as there is no cheap way to insure water quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed in Sacramento",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Great filter for backpacking",
      "text": "I bought this filter as a backup to my LifeStraw Flex, and to use on the trail rather than breaking out the LifeStraw bag. The filter works great, and in fact I ended up using the Sawyer in place of the LifeStraw because I got more reliable flow from it. The filter is sealed, so there's no need to open it up for cleaning. My only complaint is that the 16 oz. bag this unit comes with is hard to fill completely.",
      "rating": 4.0,
      "verified": true,
      "author": "LAB",
      "helpful_votes": 0,
      "publication_date": 20200710
    },
    {
      "title": "Significant quality drop",
      "text": "Sawyer has been the go-to option for backpacking filters but its QC has been terrible lately. We brought three brand new sets to a recent trip to the high sierra. All three pouches broke on the first day. By day2, 2 of 3 filters started leaking from the bottle connectors. By day3, all 3 filters failed due to severe leak or losing bottle connectors. Highly unreliable for multi-day trips.",
      "rating": 1.0,
      "verified": true,
      "author": "yetiti02",
      "helpful_votes": 2,
      "publication_date": 20190914
    },
    {
      "title": "Great product",
      "text": "I have friends who use this so I kind of knew what to expect and it didn't disappoint. It's super easy to use and filters pretty fast for how small it is. We took it backpacking and will definitely be packing it from now on. The only reason it lost a star was that the package came severely damaged upon arrival. The box was smashed and parts were everywhere inside the delivery bag - it would've been nice if it had been delivered in a box.",
      "rating": 4.0,
      "verified": true,
      "author": "Whitney Brunson",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Looks good but will it work.",
      "text": "I got this not long ago so I can not give it 5 stars. It's plenty compact and the water bladder is pretty stout. I have used the Life Straw but bought this as an alternative since it can be used for 100,000 gallons if you back wash the filter. The problem I foresee using it is you have to have a real good supply of clean fresh water to back flush the filter. So, we will see.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Great if you don't need it very often. Get the Sawyer Squeeze if you do.",
      "text": "This thing is so small and light, there's no excuse not to carry it in your pack when you go outdoors. Nobody needs giardiasis, crypto, etc... So it excels in that aspect. Only issue is that the flow rate is a bit anemic, even when new, and forget about it after a few gallons. Seeing I was going to need a filter for an extended period on a trip to the Sierras, I decided to try both the Sawyer Mini and the Squeeze. Trust me, dear UL hiker, the Squeeze is worth the extra ounces. It will flow better for longer and save you the hassle and annoyance.",
      "rating": 4.0,
      "verified": true,
      "author": "Walter U.",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Buy several , saves $ and could save life",
      "text": "I've bought more than 1 after I tried them. Compact but very effective , no taste. Great kit which lets you use several ways. Sending these to Puerto Rico family after disaster where water has been short . LIFESAVING You don't need bottled water . They have lots of fresh water sources which they can now safely drink , and not wait for bottled water . I have several in emergency kit and even I use it to take to places and save $$ on expensive bottled waters. Simple fill container from tap or fountain and you have plenty fresh filtered water. Even take it on hikes to drink from streams, and not carry lots heavy water",
      "rating": 5.0,
      "verified": true,
      "author": "Jb",
      "helpful_votes": 0,
      "publication_date": 20171014
    },
    {
      "title": "Bag leaked on day 2 of 6 day trip! NOT RELIABLE!",
      "text": "Water is CRITICAL to survival! First use - the bag LEAKS around the nozzle so could no longer filter water on a 6 day trip after only 2 days!! Could only use straw option sucking from water source, couldn't fill up water containers. DO NOT BUY THIS! Not reliable. Choose any other filter system. Or buy extra bags = extra weight extra space taken up. Very disappointed!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Karl Bastian",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Best filter I've ever used",
      "text": "I love this water filter. I've used Sawyer filters for years while deployed overseas with ZERO problems. The Sawyer mini is perfect for carrying in my pack. It's small, lightweight and screws onto standard plastic bottle threads. I recently used this filter on a 2 week trip to central Mexico. I filtered my drinking water every night and upon return Stateside, no Montezuma's revenge. These are worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Squeaky Huevos",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Second time now I have tried to get this and still wrong!!",
      "text": "Not sure how else to get ahold of a human these days at Amazon so I am giving this a try. This is the second \"4\" pack I have received that is only a 1 pack. This was almost 100$ and keeps showing up with a label that says 4 pack and only one unit. My only choices are to return for various reasons that do not apply. I do not want to return, I simply want the other 3 units!! These are awesome, but just not what I ordered. Thanks",
      "rating": 1.0,
      "verified": true,
      "author": "Joe",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "For the price/size, it's perfect.",
      "text": "Worked great as my main filter on a 15 mile backpacking trip. For it's weight and size it handled all my filtering needs well. It is time consuming to filter large amounts of water so if you have long stretches without access to water like I did recently, plan on spending some time filtering. I don't particularly like carrying the syringe to back-flush the filter, but it is still smaller with the syringe than most other filters. Drinking directly from the filter is surprisingly easy and convenient. A really great product.",
      "rating": 5.0,
      "verified": true,
      "author": "JeronimoHIllam",
      "helpful_votes": 2,
      "publication_date": 20170620
    },
    {
      "title": "Filter may be a great filter but the syringe is quite fragile!",
      "text": "Just a note. I took this filter on an overnight backpack trip. After my first use when I went to back flush the filter, I discovered that the syringe had cracked and was not working properly. While the filter may be a great filter, the syringe is pretty fragile for an item that one might throw in a backpack and take camping. I will follow up on this when I heard from the company. For now I have marked my rating down a notch for this issue. Other than that, I didnt get sick from the water!",
      "rating": 3.0,
      "verified": true,
      "author": "S Rees",
      "helpful_votes": 2,
      "publication_date": 20171125
    },
    {
      "title": "Peace of mind in a small package",
      "text": "After several camping trips last summer i quickly realized that the amount of water I was able to carry on my motorcycle was very limited. The solution was this Sawyer filtration system. Easy to pack, requiring very little space in my camp pack. It's a well known fact that drinking untreated water is extremely dangerous so the purchase and use of this filter provides me a great deal of flexibility. It's well worth the price for a little peace of mind, one less thing that I need to be concerned about while traveling and camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Buckeye HD Rider",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Wish it was a little faster",
      "text": "My first time hiking and using the product. Overall this is a good system for one person who has plenty of water stops along the way. The system is a little slow and I did carry and extra fiji bottle just incase the pouch popped. It didn’t pop and my only reason for giving it 4 stars is because it’s kinda of a slow system but overall does the job well!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Wow!",
      "text": "I work at a school and brought this in for the biomedical class to do labs with. She brought in unfiltered creek water and some really nasty looking standing water from a puddle, both were filtered through my Sawyer. The results were looked at under a relatively powerful microscope. They found no organisms or parasites, only a few small “specks” which she surmised came from the cup it was poured into. This product has my endorsement!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Craig Westfall",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "Works as described",
      "text": "I use this as a backup to a UV system as the latter uses batteries and can let you down at any time. The main reason it is not my go to system is because I find the need to attach it to my water container and then suck or squeeze on it , (or transfer it to another container), inconvenient as opposed to taking a minute to treat 1l of water with UV and then drinking straight from the same bottle you treated the water in.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Sellers",
      "helpful_votes": 0,
      "publication_date": 20191216
    },
    {
      "title": "Simply the best.",
      "text": "The Sawyer Mini is the absolute best personal water filtration system on the market. It really has no equal. It is lightweight and works flawlessly. It's great for hiking, backpacking and could save your life in an emergency. I live in an earthquake zone and every SHTF kit I own, at home, the office, our vehicles, etc. has a few Sawyer Minis and some water purification tablets in them. It's a critical survival tool.",
      "rating": 5.0,
      "verified": true,
      "author": "jd williamson",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Great, versatile product",
      "text": "I ordered the 4 pack. Already installed one inline with my bladder without any issues. I really appreciate how you can push a hose on it or screw it in to a standard bottle. They're small and light enough that I'll keep extra's in my pack just in case one fails/gets lost/etc. It was a tossup between this or one of the lifestraws but I'm glad I landed on these for their versatility and light weight. No charcoal filter but that should be fine in my area. Maybe even ideal since these can be backflushed and used indefinitely.",
      "rating": 5.0,
      "verified": true,
      "author": "leenyx",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Great for long distance trail runs",
      "text": "I am a trail runner. Just used it yesterday on a 20mi trail run through knobstone trail. Incredible device. Simply scoop up water from a stream and go. To use this in conjunction with a hydration pack, just cut the tubing and shove the ends onto the kini filter. Stays secure the entire run. It takes a large bit of effort to suck the water through the tubing, but you eventually get used to it and the time and effort saved while filling up greatly makes up for this. Will be testing this out in freezing temperatures tomorrow.",
      "rating": 5.0,
      "verified": true,
      "author": "Phillip Sullivan",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "I love my Sawyer mini water filter!",
      "text": "The Sawyer water filter is by far the best product I have ever purchased. I use it for backpacking to filter many sources of natural water. These natural water sources can have bacteria and protozoa and other contaminants that can cause illness. It is very versatile in different environments to filter water. it's simple design makes it very reliable. There are very few parts that will fail. And since it is such a simple design it also takes less components to carry. It is lightweight and easy to take on any traveling trip where water quality is questionable. This is an exceptional product! it is on the top of my recommendation list.",
      "rating": 5.0,
      "verified": true,
      "author": "Theresa",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Anyone living on planet earth should buy one of these",
      "text": "I'm an ER and public health, registered nurse (RN). BUY THIS. If you venture into the woods, BUY THIS. If you are subject to a disaster, natural or human-made (which is everyone), BUY THIS. This will put all the other manufacturers of similar product out of business. The UN has purchased thousands (millions?) of these for use all over the world. Very light weight, very effective, very small, very cheap.",
      "rating": 5.0,
      "verified": true,
      "author": "DanangDoc",
      "helpful_votes": 3,
      "publication_date": 20170702
    },
    {
      "title": "Good Filter Bad Attachment Design",
      "text": "This is a great filter but the flushing plunger does not attach to either the filter (plunger has a screw tip and filter has smooth tip) or the straw (straw is too big for the inner opening on the plunger and too small to fit over outer screw tip) which means that you cannot get a good seal when trying to clean the filter. Both the bag and the straw fit and operate well but the plunger is almost useless.",
      "rating": 3.0,
      "verified": true,
      "author": "Kristina Brissette",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "BEST WATER FILTER FOR CAMPING, don't use bag",
      "text": "This is a great, great lightweight small water filter. Everything about it is so great (including how small the filtering pores are and what a large number of gallons it's rated for) that I am not subtracting a star for the ineffective bag for capturing dirty water. It's almost impossible to fill by submerging it. The best thing to do is bring your own plastic water bottle instead, or cut off the bottom of water bottle to use to pour water into the bag. The straw function works great. The filter is great. You can work around the silly bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Awesome filter, so easy to use!",
      "text": "Highly recommend this filter...a must have for those traveling to developing countries. We travel to parts of Asia and Africa a couple times a year. While we need to drink plenty of safe water, we hate to purchase bottled water all the time and add to the waste and plastic issue. This allows us to bring our own bottles and use regularly throughout the trip. It has been so easy to always have fresh water available for drinking and brushing teeth. Water always tastes great, even well water. I often leave these behind for local friends and give as gifts to fellow travelers.",
      "rating": 5.0,
      "verified": true,
      "author": "soccer mom",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Compact, recommended by people who should know",
      "text": "I haven't had to use this (and hopefully won't have to use it), but I bought it for an emergency kit based on the recommendations from Lifehacker's posts on how to build a useful kit. It's relatively compact and doesn't take up much space, but it's nice to know it's there in case we ever get a \"boil water\" notification.",
      "rating": 5.0,
      "verified": true,
      "author": "War2d2",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Bulky",
      "text": "I haven't used this item yet, it was for my bug out bag. The unit itself is twice as big as the lifestraw, and the \"drinking pouch\" makes it even bulkier. So, instead I can put two lifestraws in the bag, and it will take the same space as one of these. As I said, I have no idea how well it actually works yet.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Stevens",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Worked really well",
      "text": "We recently bought these for a camping trip and had one each. They worked really well! We attached them to our camelback bladders which was really convenient. I did find I was drinking less than I thought as you don’t get heaps of water out through the thin tube each time. Also you have to keep track of the cap as it comes off fully if you’re not careful.",
      "rating": 5.0,
      "verified": true,
      "author": "Akkapo ",
      "helpful_votes": 0,
      "publication_date": 20200702
    },
    {
      "title": "Great water filter, but filler bag broke",
      "text": "Great water filter, but filler bag broke after two days of filtering. It is very light weight. I missed the return date by one day or I would have returned it. I did order a replacement filler bag. Just be aware that pushing on the bag leads to failure. In my opinion, this filtering system favors gravity not pressure. Again, pushing on the bag will lead to the bag breaking near the mouth of the bag (See picture). If I was hiking for more than one day, I would order a replacement bag(s) or have some other method of purifying water as a backup.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Must have prep bag item",
      "text": "These are an essential part of any emergency preparedness bag, who can carry 3 days worth of water with them? anyone? that's what I thought, it's a great recommendation but not very realistic. With this I can carry the equivalent of an almost never ending supply of clean water (the filter can be back flushed for repeated use) This filter is an amazement to me. What a marvel of engineering to be able to do what it does, and especially at the size it is! Well worth the investment!",
      "rating": 5.0,
      "verified": true,
      "author": "axlec",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Very smart purchase, regardless of your lifestyle.",
      "text": "I barely go 2 miles from home without this. Great for traveling, camping, long city walks, or at home. It works on swamp water, or regular tap water. Cheaper than a Britta-type filter in the long run. Cleanable, reusable, a must have.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Martin",
      "helpful_votes": 0,
      "publication_date": 20200127
    },
    {
      "title": "Blocked Up",
      "text": "I used this twice and stored it in my kitchen drawer. I cleaned it both times as directed. Took it on the trail the 3rd time and it was like there was concrete inside the filter. No water was allowed through and I went thirsty, not cool. Hard to believe.",
      "rating": 1.0,
      "verified": true,
      "author": "Buddy",
      "helpful_votes": 0,
      "publication_date": 20191119
    },
    {
      "title": "A Filter above it pears.",
      "text": "I worked for an NGO that used these. They are lifesavers, last years longer in use, and filter considerably more water than most \"survival\" water filters. Don't waste your money on life straws, get these. This company has no marketing as far as I know, but from field experience they work, and I'm talking making contaminated water with human waste and making it safe to drink.",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Hoffmann",
      "helpful_votes": 0,
      "publication_date": 20200227
    },
    {
      "title": "These Sawyer mini filters are really the best way to go whether for emergencies",
      "text": "These Sawyer mini filters are really the best way to go whether for emergencies, hiking/camping, etc. Their size make them easy to carry, the flexibility make them excellent for different situations, and their lifespan easily make them worth the money. I primarily use mine with a couple of Smart water bottles to filter spring water when solo hiking/camping, but also carry them in day packs and the like when with the family. I easily trust this from a company located in Florida whose products are certified versus the Chinese junk being sold everywhere. Staying safe/healthy is easily worth any cost difference for something you'll rarely purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "J. C. a Go GoTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Works great. My standard procedure for water collection is pre-filter ...",
      "text": "Works great. My standard procedure for water collection is pre-filter over my shemagh, boil then pass through one of my Sawyer minis once it has cooled. People always ask me why I boil first, peace of mind mostly. I do not through camp, I set camp, so boiling water first isn't an inconvenience as I will already have my pot with me and have a fire going either via logs or my wood gas stove. Hands down the best bottles to use for these are the Glaceau Smart Water bottles. The threading is PERFECT and you have several size options that are readily available at most groceries and just about every gas station.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan C. Mercer",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "I like that it has the bag / bottle attachment",
      "text": "I was looking for one of the life straws to have for filtering water and saw this recommended in one of the reviews. I am very pleased with the way the bag fits on for the same price as the life straw. It will make it much easier to drink. It takes quite a bit of section but the bag allows you to squeeze it through that way. I’m very pleased with this product",
      "rating": 5.0,
      "verified": true,
      "author": "Greg",
      "helpful_votes": 0,
      "publication_date": 20200318
    },
    {
      "title": "easy to transport",
      "text": "Used this occasionally in Mexico City, mostly at my B&B, where even the host didn't drink the water straight (she had filtered water, but I'd already brought this, so I used it in the morning during shower time, etc.). Small, easy to transport, draws sufficient water easily enough that you don't turn blue in the process. A great doodad for hiking, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "aztecthrushTop Contributor: Photography",
      "helpful_votes": 12,
      "publication_date": 20150113
    },
    {
      "title": "Perfect for backpacking!",
      "text": "This is small enough to take up very little space and adds almost no weight to your pack! The bag is useless for collecting water in a stream, but it is absolutely necessary to process the water. I gather in a water bottle and then transfer that to the bag to avoid having to unscrew the filter to get air into the water bottle every few squeezes. it’s simple to backwash and good for so many gallons of water that I’ll never need to buy another one! It filters enough of the bad stuff out that I have no concerns about drinking the filtered water. Highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Elaine M.",
      "helpful_votes": 0,
      "publication_date": 20180926
    }
  ],
  "product_meta": {
    "title": "Sawyer Products MINI Water Filtration System",
    "description": "A lightweight, versatile personal filtration system, the second-generation Sawyer MINI Water Filter fits in the palm of your hand and has a total field weight of just 2 ounces. Perfect for everything from camping with the kids to traveling abroad where tap and bottle water can't be trusted, the tiny MINI provides 0.1 micron absolute filtration for clean drinking water on the go — filtering out bacteria, protozoa, and microplastics. The MINI filter removes 7 log (99.99999%) of all bacteria (like salmonella) as well as other harmful bacteria which causes cholera and E. coli and 6 log (99.9999%) of all protozoa such as giardia and cryptosporidium. These removal rates equal or exceed other filter options. EPA guidelines allow ten times more protozoa left in the water than Sawyer MINI filters allow. The MINI also filters out 100% of microplastics. The MINI 0.1 micron absolute filter houses a cluster of micro-fibrous tubes which use similar technology found in medical dialysis. As water passes through the side walls of the tubes, harmful bacteria and protozoa are trapped on the outer walls so you can be confident your water is safe to drink. Great for outdoor recreation, hiking, camping, scouting, domestic and international travel, and emergency prepping, the Sawyer MINI gives you a number of ways to access clean water. Attach it to the included drinking pouch, use the included straw to drink directly from your water source, connect it to hydration pack tubing (sold separately), or screw it onto standard disposable bottles (28mm thread). Since 1984, Sawyer Products has offered the best, most technologically advanced solutions for protection against sun, bugs, water, and injuries — everything from first aid kits developed for wilderness to point-of-use water filters that filter contaminated water to levels cleaner than U.S. bottled water.",
    "rating": 4.7,
    "feature_bullets": [
      "Ideal for outdoor recreation, hiking, camping, scouting, domestic and International travel, and emergency preparedness",
      "High-performance 0.1 Micron absolute inline filter fits in the palm of your hand and weighs just 2 ounces; 100% of MINI units individually tested three times to performance standards by Sawyer",
      "Attaches to included drinking pouch, standard disposable water bottles, hydration packs, or use the straw to drink directly from your water source",
      "Removes 99.99999% of all bacteria (salmonella, cholera, and E. coli); removes 99.9999% of all protozoa (such as giardia and cryptosporidium); also removes 100% of microplastics",
      "Filter rated up to 100,000 gallons; Includes one Sawyer MINI filter, 16-ounce reusable squeeze pouch, 7-inch drinking straw, and cleaning plunger"
    ],
    "specifications": {
      "Date First Available": "January 9, 2020",
      "ASIN": "B083PX573V",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Water Filters",
      "Camping & Hiking",
      "Hydration & Filtration"
    ],
    "price": 16.39
  }
}