{
  "website_summaries": [
    {
      "verdict": "Worth considering if you want a very affordable option for small, easy-to-cut pills or occasional use. Otherwise, competing pill cutters on our list are better suited for tougher tasks and regular use.",
      "pros": [
        "Low-cost model",
        "Easy to use",
        "Comes with handy features for the affordable price, including grips and blade guard"
      ],
      "cons": [
        "It doesn't always cut large, hard pills evenly",
        "Some durability concerns, including the hinge that is prone to malfunctioning when used frequently"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "PLEASE READ :UPDATED",
      "text": "I like that the pills do split, I can only speak to a rather soft and small pill and it would not split, even crush, if I didn't make sure the indention line was lined up EXACTLY WITH THE RAZOR BLADE, ALSO, ONE HALF OF A DANGEROUS MEDICATION FLEW OUT OF ONE OF THE 2 HOLES AND I'VE BEEN SEARCHING LIKE CRAZY. SO, THAT IS BAD! It's tedious and a little dangerous in the sense that it does not contain the pill entirely during or after the cut...but it got the job done. Update, I've used it on less than 20 pills and it's just crushing them now. Ya get what you pay for!",
      "rating": 3.0,
      "verified": true,
      "author": "Megan Y",
      "helpful_votes": 8,
      "publication_date": 20180724
    },
    {
      "title": "Best pill splitter I've used",
      "text": "I've owned several different designs of pill-splitters, and this is by far the best. It holds the pill in place so that it's easy to split it into near-equal halves (not guaranteed, but pretty close). I use mine a fairly often (not daily, but more than weekly). After a couple of years, the thin flexible plastic shield--that slides up over the blade every time the splitter is opened--broke, and whole splitter ceased to move well. (You can extract the broken shield, but then there are other issues, I don't remember exactly. ANYWAY, it's inexpensive, so I just bought another one, and was HAPPY to do so.",
      "rating": 5.0,
      "verified": true,
      "author": "Scholumba",
      "helpful_votes": 7,
      "publication_date": 20180726
    },
    {
      "title": "I love these pill cutters",
      "text": "This is the second one of these I've owned; the first one lasted about a year, and after using it one time a day for that year it failed. The cut is not always perfect, occasionally resulting in big-side, small-side situations. But it's better than several other pill cutters I've tried. I'm using this exclusively for small 5mg thyroid pills for my cat. Since those pills are fairly small, they will sometimes fall out the wrong end of this cutter, and I certainly would not try cutting a pill any smaller than these. But as I said, this works better than any of the other cutters I've tried.",
      "rating": 5.0,
      "verified": true,
      "author": "jim griffin",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "I had one just like this before and it worked great for several years ...",
      "text": "This one is not working properly as it gets stuck in the closed position. I had one just like this before and it worked great for several years before the blade got worn out. Anyway the one I just got has 2 issues: one it gets stuck in the close position and the other it seems like the blade does not cut through the pill all the way - not positioned properly",
      "rating": 2.0,
      "verified": true,
      "author": "Sam N",
      "helpful_votes": 9,
      "publication_date": 20160301
    },
    {
      "title": "Perfect for small pills",
      "text": "I cut 5 very small round pills into quarters with no crushed or smashed pills. Very precise cuts. Granted, I am being gentle with this as the pills are small and require very little force but it is working perfectly. The blue part is slightly textured and holds the pills right where I put them and does not allow the cut pills to slide out as other reviews have stated. This is exactly what i was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 2,
      "publication_date": 20180613
    },
    {
      "title": "First pill I cut, its pieces came flying out ...",
      "text": "First pill I cut, its pieces came flying out of two small holes in the back of the device. Didn't cut it cleanly either. Save your money, and buy a premium cutter at Walgreens or CVS.",
      "rating": 1.0,
      "verified": true,
      "author": "Iggy",
      "helpful_votes": 5,
      "publication_date": 20170926
    },
    {
      "title": "Not perfect",
      "text": "I have had this style before. My previous blade had fallen out so I tried another style that was even worse. This is only OK. I use it correctly yet it still does not cut my meds in half, one side is often larger than the other. I can't recommend it but I have yet to find the ideal product yet for my needs.",
      "rating": 3.0,
      "verified": true,
      "author": "Trinket's Mom",
      "helpful_votes": 0,
      "publication_date": 20190328
    },
    {
      "title": "Extremely Poor Quality & Cheap Mechanism",
      "text": "This is an extremely poor pill splitter. It's not designed well and the blade is weak. Although does cut pills, it often causes the pill to crumble into small pieces. The pills often fall backwards and get stuck on the underside of the splitter. It takes several tries to get them out. You have to hold the splitter at a perfect angle towards you so that the pills fall into the front section. The mechanism is astonishingly dysfunctional. This is the cheapest and worst pill splitter I've ever used. Don't spend a dollar on this thing.",
      "rating": 1.0,
      "verified": true,
      "author": "P@¡n ₩@rr¡0rTop Contributor: Baking",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Deal breaker",
      "text": "Pills kept falling out the bottom. Why is it left open?",
      "rating": 1.0,
      "verified": true,
      "author": "Honora09",
      "helpful_votes": 6,
      "publication_date": 20180124
    },
    {
      "title": "Doesn't work for my needs. I'm trying to split ...",
      "text": "Doesn't work for my needs. I'm trying to split a hypothyroid pill into 4ths. It splits it all right in half, with just a little breakage. But it's nearly impossible to split my pill a second time into fourths. So for now I'm going back to doing it by hand with a knife and cutting board.",
      "rating": 2.0,
      "verified": true,
      "author": "SuzieQ",
      "helpful_votes": 0,
      "publication_date": 20180822
    },
    {
      "title": "Definitely better and more accurate than by hand",
      "text": "Makes it much easier to cut pills in half. When doing my mom's medicine box there are several pills that she takes half daily. Before I got this I used a knife and ended up with mutilated uneven halves. This is easy to use and seems accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Courtney Strickland",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "Worst Pill Cutter",
      "text": "This is the worst pill cutter I've ever used. It had trouble cutting scored pills. Part of the problem is that it didn't work when I place the pill all the way into the \"V\" part of the platform. Into the trash it went.",
      "rating": 1.0,
      "verified": true,
      "author": "Daneth",
      "helpful_votes": 2,
      "publication_date": 20180507
    },
    {
      "title": "Very good products",
      "text": "Very good products. Does the trick. I have had other pill cutters ordered from Amazon that was more expensive and yet don't work at all! I even cut myself using one of the other pill cutters that don't work. This one works very well. Good price too.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason W.",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "Terrible design and no return/refund!",
      "text": "Poor design. There is a “guard”, if you will, to cover the blade upon opening so you don’t get cut. However, after the first few pills that I cut, the cover for the blade gets stuck halfway up, so you can’t fully open the pill cutter. If you try to put another pill in, you’d be apt to get cut. And now I find there is NO return/refund available. Waste of time and money. No more from this company!",
      "rating": 1.0,
      "verified": true,
      "author": "Linda D Morris",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "plastic \"belt\" attached to lid sticks after every use",
      "text": "Not happy with product. Plastic \"band\" sticks after each use and cutter top has to be forced back. Would like to return for refund and will look for a different pill splitter.",
      "rating": 1.0,
      "verified": true,
      "author": "Marian C. Macbeth",
      "helpful_votes": 2,
      "publication_date": 20190325
    },
    {
      "title": "Horrible",
      "text": "Smashes the pills. I've used these for years, but this is the first one that literally smashes up the pills. Do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Kay Preston",
      "helpful_votes": 2,
      "publication_date": 20190614
    },
    {
      "title": "dose of pill will not always be accurate",
      "text": "the pill moved when you insert it. the pill when cut is not consistent in size therefore the dose of medication is not exact",
      "rating": 4.0,
      "verified": true,
      "author": "june h.",
      "helpful_votes": 0,
      "publication_date": 20191113
    },
    {
      "title": "Worst pill cutter I've ever purchased",
      "text": "Did not cut small pills well. Plastic guard moved and got on the way within first 15 pill cuttings. Had to remove it. Now over half the time it will not cut through pill. Worst pill cutter I've ever purchased!",
      "rating": 1.0,
      "verified": true,
      "author": "Denise B",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Good!",
      "text": "Works great so far! Not the highest quality pill cutter but good product for the price. Edges are good and nice blade cover and catch mechanism.",
      "rating": 5.0,
      "verified": true,
      "author": "mari",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Very easy to use",
      "text": "Pill crusher was easy to use perfomed exacty as advertised. Unit was safe to use, with built in features that mitigated misuse and injury. Much better performance than other crushers I have tried. Delivered on time, would buy from this supplier again.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave Davidson",
      "helpful_votes": 0,
      "publication_date": 20190831
    },
    {
      "title": "This is a good product and easy to use and very accurate",
      "text": "This is a good product and easy to use and very accurate. I am very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "B. Corporation",
      "helpful_votes": 0,
      "publication_date": 20170527
    },
    {
      "title": "Do not waste your money",
      "text": "The product description and photos claim that it cuts pills without turning them into dust. Thats a lie.",
      "rating": 1.0,
      "verified": true,
      "author": "Luis Pagan",
      "helpful_votes": 0,
      "publication_date": 20190128
    },
    {
      "title": "Pill splitter works great!",
      "text": "The pill splitter works great. Our dog had to take pills for a month and they had to be split in half. This was great to have for that and a big time saver.",
      "rating": 5.0,
      "verified": true,
      "author": "RDede",
      "helpful_votes": 0,
      "publication_date": 20200729
    },
    {
      "title": "Thumbs down",
      "text": "More of a crusher then a cutter. Save your $$ a sharp kitchen knife would be more effective",
      "rating": 2.0,
      "verified": true,
      "author": "KG",
      "helpful_votes": 0,
      "publication_date": 20190913
    },
    {
      "title": "Flimsy and awkward",
      "text": "Very awkward to use, pills pop out and are split unevenly. After splitting 180 tiny pills, the unit broke.",
      "rating": 1.0,
      "verified": true,
      "author": "FlowerLady",
      "helpful_votes": 0,
      "publication_date": 20190214
    },
    {
      "title": "Still using it.",
      "text": "Use all of the time. Works as advertised. Good product.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "Cut 'em all",
      "text": "Great product, even for small pills. You can easily see what is happening and all pieces are contained. Convenient size for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenneth bishop",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Works great!",
      "text": "This is so much easier than trying to break a pill by hand or using a knife! I can't believe I haven't ordered it before now. A must-have for your home.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheryl",
      "helpful_votes": 0,
      "publication_date": 20190409
    },
    {
      "title": "broke after a few uses...",
      "text": "Unfortunately blade bent off to the side and did not cut pills. Had to throw it away.",
      "rating": 1.0,
      "verified": true,
      "author": "Dana",
      "helpful_votes": 0,
      "publication_date": 20180405
    },
    {
      "title": "Will not last long!",
      "text": "I had a problem with my first one of these when the flexible plastic part split in two... the. Was dead, I got another and it has done the same thing. If you need to regularly cut pills DO NOT PURCHASE THIS. Spend more money for a better one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisha Bracco",
      "helpful_votes": 3,
      "publication_date": 20180309
    },
    {
      "title": "Works very well.",
      "text": "This surprised ne because it did work so well ,quickly and accurately.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth A.",
      "helpful_votes": 0,
      "publication_date": 20190720
    },
    {
      "title": "Works great for what I needed!",
      "text": "Works great for what I needed it for. Splits evenly with little effort. The pills I’m splitting are small, not sure how it would work on larger pills but for the price you really can’t go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Amy",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "It’s like magic",
      "text": "Works great. It cuts the pills evenly and it has a safety guard over the blade so it can’t cut you... it’s like magic",
      "rating": 5.0,
      "verified": true,
      "author": "Kouri",
      "helpful_votes": 0,
      "publication_date": 20190105
    },
    {
      "title": "Apex Pill Splitter",
      "text": "Don't get me wrong, I love the splitter...I just wish it would last longer. I take a large thick pill, half in the morning and half at night and this splitter can split it but it finally cracks after a couple of months, leaving me to find a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "E.J.G.",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "It works",
      "text": "Use to cut little round pills in half with out crushing them",
      "rating": 5.0,
      "verified": true,
      "author": "GrapeApe",
      "helpful_votes": 0,
      "publication_date": 20190814
    },
    {
      "title": "You get what you pay for",
      "text": "Pills need to be lined up perfectly or they get crushed.",
      "rating": 4.0,
      "verified": true,
      "author": "Rochelle",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Cuts pills just fine.",
      "text": "Cuts pills just fine. Sure better than using a knife. So far working good after several months.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Grokett",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "works well",
      "text": "not only are the pills cut in half but in quarters so this makes it easier",
      "rating": 5.0,
      "verified": true,
      "author": "L. Panzino",
      "helpful_votes": 0,
      "publication_date": 20181222
    },
    {
      "title": "worked wll",
      "text": "bought 80 mg pills,but only needed 40 mg per day,so I used this to cut the pills and save money",
      "rating": 5.0,
      "verified": true,
      "author": "bob mccallum",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "a simple functional splitter",
      "text": "Ive been using a few days now for med adjustments. It feels like light and cheap material but it functions well. I have no complaints so far.",
      "rating": 4.0,
      "verified": true,
      "author": "swimmer07",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "OK",
      "text": "This pill splitter locked up after 5 pills. We had to pull the plastic (that keeps the pills from going out the back) toward the back of the unit. It slipped forward and kept the unit from opening all the way.",
      "rating": 3.0,
      "verified": true,
      "author": "JFish",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "It cuts evenly",
      "text": "This item does a great job in cutting my pills evenly in half. Great",
      "rating": 4.0,
      "verified": true,
      "author": "Cheryl Basnight",
      "helpful_votes": 0,
      "publication_date": 20180927
    },
    {
      "title": "Pill Splitter",
      "text": "I used it to split my pills and other meds.",
      "rating": 4.0,
      "verified": true,
      "author": "Lula Smith",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Needs improvement",
      "text": "Too large, dull cutting blade - crushes half of the pills.",
      "rating": 2.0,
      "verified": true,
      "author": "Zceska",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Good for cutting small pills",
      "text": "Works well. It cuts even the smallest of pills that don't have indents.",
      "rating": 5.0,
      "verified": true,
      "author": "Bethany",
      "helpful_votes": 0,
      "publication_date": 20191107
    },
    {
      "title": "It does the job well.",
      "text": "Had an odd plastic blade protector which we removed with some difficulty. But then smoothe sailing.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "Great for round pills",
      "text": "I bought this to cut round pills. It does a consistently good job at cutting round pills, though probably not for other shapes.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryce L. Tidwell",
      "helpful_votes": 0,
      "publication_date": 20181102
    },
    {
      "title": "Five Stars",
      "text": "Like the see through pill cutter is to cut correctly.",
      "rating": 5.0,
      "verified": true,
      "author": "ellen rhodes",
      "helpful_votes": 0,
      "publication_date": 20180308
    },
    {
      "title": "Not Great",
      "text": "I used this on small pills and it never really cut them evenly. Often I'd be left with half the pill as powder and unusable.",
      "rating": 2.0,
      "verified": true,
      "author": "Kelbell",
      "helpful_votes": 0,
      "publication_date": 20181215
    },
    {
      "title": "Works well",
      "text": "It cuts my pills perfectly in half and quarters! No complaints here!",
      "rating": 5.0,
      "verified": true,
      "author": "kah",
      "helpful_votes": 0,
      "publication_date": 20181007
    },
    {
      "title": "does not cut at center",
      "text": "you want it to cut in half, right ? well, it does not",
      "rating": 2.0,
      "verified": true,
      "author": "Alexy",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "Affordable and Reliable",
      "text": "This product is affordable and does its job. I would say that the plastic is not super sturdy, but as long as you're not letting your kids play with this, you should be fine. I would recommend this.",
      "rating": 5.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Perfect!",
      "text": "I have used many pill cutters, but this is the best one I have used.",
      "rating": 5.0,
      "verified": true,
      "author": "tmcgant",
      "helpful_votes": 0,
      "publication_date": 20181010
    },
    {
      "title": "Just OK",
      "text": "It's ok, does not cut pill evenly which is aggravating!",
      "rating": 3.0,
      "verified": true,
      "author": "Lizzy May",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "Pill cutter",
      "text": "I had another cutter which I used years and gave to my son. I hated this one. The pills kept falling out, and then it broke and I had to throw it away after not very many uses.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "4 Stars",
      "text": "Works well. Small pills are a little harder to cut due to a gap at the end of the triangle. But made it work.",
      "rating": 4.0,
      "verified": true,
      "author": "BeFree",
      "helpful_votes": 0,
      "publication_date": 20180923
    },
    {
      "title": "Pill cutter that cuts cleanly",
      "text": "Does what it needs to do, and does it well.",
      "rating": 5.0,
      "verified": true,
      "author": "Didit",
      "helpful_votes": 0,
      "publication_date": 20171031
    },
    {
      "title": "Much better than using a razor blade",
      "text": "These make cutting your pills so easy. work great on large and small pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Ralph L.",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "Great Product for a great price",
      "text": "to split round pills in half that could not be split by hand!",
      "rating": 5.0,
      "verified": true,
      "author": "Sherri Y. Dawson",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Easy to use, effective",
      "text": "Finally, a well made product to divide those pesky huge pills I take four times a day.",
      "rating": 5.0,
      "verified": true,
      "author": "Ginger's Daughter",
      "helpful_votes": 0,
      "publication_date": 20170511
    },
    {
      "title": "Works great, a sturdy little pill splitter",
      "text": "Works great. Has a handy catch-all for the pills. ❤️",
      "rating": 5.0,
      "verified": true,
      "author": "Mary S. Tormey",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "DIvides the pill evenly",
      "text": "This works perfectly for splitting my pills, gets it in the middle every time and splits the pill evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Dale Musser",
      "helpful_votes": 2,
      "publication_date": 20170516
    },
    {
      "title": "Perfect for all mine and my pet’s needs!",
      "text": "Exactly what I was looking for! It easily cuts oblong or oval shaped pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Love to Shop! ",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "Doesn’t with",
      "text": "It doesn’t cut the pills in half, it crumbles it",
      "rating": 1.0,
      "verified": true,
      "author": "Ashley Zubia",
      "helpful_votes": 0,
      "publication_date": 20190323
    },
    {
      "title": "Five Stars",
      "text": "Works great, easy to use and clean. Does the job great and cuts pretty evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "StruggleBugStee",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Totally worthless",
      "text": "This thing is a piece of junk. It split 3 pills then the blade broke. Save your money.",
      "rating": 1.0,
      "verified": true,
      "author": "CKH",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Works very well",
      "text": "Used yesterday to split 1,000 mg Metformin pills and it worked great.",
      "rating": 4.0,
      "verified": true,
      "author": "Deborah J. Lambert",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "The pill cutting blade bends sideways",
      "text": "The pill cutting blade bends sideways with every use. Feeble. I have contacted both the Seller and Amazon Prime Customer Service to get a stronger replacement and have ZERO RESPONSE TO DATE from either entity.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Pill cuter",
      "text": "I sent for this pill cuter since it was very like the last one but you have to be careful where you put the pill or it doesn’t cut it, I am 87yrs old and it’s hard for me to get it right",
      "rating": 2.0,
      "verified": true,
      "author": "Laura R.",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Works so well",
      "text": "I am so glad I took a chance based on other reviews. This pill splitter is so easy and best of all cuts evenly.",
      "rating": 5.0,
      "verified": true,
      "author": "Minnesota Transplant",
      "helpful_votes": 0,
      "publication_date": 20180817
    },
    {
      "title": "Best pill splitter ever",
      "text": "This is the best pill splitter I've ever had. It actually splits the pill instead of crushing them. Thank you so much",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20181205
    },
    {
      "title": "Great product!",
      "text": "Best pill cutter I've used. Cuts pills and doesn't crumble them to tiny pieces like some others do.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachel Harris",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Four Stars",
      "text": "Nice pill splitter. Rubberized pad holds pills firmly while being split.",
      "rating": 4.0,
      "verified": true,
      "author": "STEVEN E. BRUCE",
      "helpful_votes": 0,
      "publication_date": 20170204
    },
    {
      "title": "NOT FOR SMALL PILLS!",
      "text": "Gap at end of cutter 'V' notch is too large for small pills, so pill splits unevenly and then falls into 'no where land'. Not fun.",
      "rating": 2.0,
      "verified": true,
      "author": "MarkJ99",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "Doesn’t work",
      "text": "This thing if it doesn’t crush my pills it’ll split them but not equally.",
      "rating": 2.0,
      "verified": true,
      "author": "PumperNickle1994",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Works well",
      "text": "I was able to cut my thick husband’s pills in half with very little effort and much ease",
      "rating": 5.0,
      "verified": true,
      "author": "anabelle cardona",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Don’t buy, cheap make!",
      "text": "The blade bent, not a quality product, don’t buy this!!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Leeper",
      "helpful_votes": 0,
      "publication_date": 20180820
    },
    {
      "title": "One Star",
      "text": "the one i received does not look like this and it does not cut in half.",
      "rating": 1.0,
      "verified": true,
      "author": "Gloria",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Just what I wanted!",
      "text": "I have used this item in the past and needed another. Very satisfied with it. Excellent delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Does the job right",
      "text": "Got it and it did exactly what it was suppose to do. Split my med in half!",
      "rating": 5.0,
      "verified": true,
      "author": "Kimberly K",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Easy for Arthritis",
      "text": "Bought this for my parents. My mother loves it she said it is so easy to use and she love that it has a container to catch the pills.",
      "rating": 5.0,
      "verified": true,
      "author": "Sylvia",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Crushed, not split",
      "text": "I was looking for a pill splitter to cut very small 5mg tablets, this definitely did not do the trick. I wound up with a pile of dust and two very uneven pieces.",
      "rating": 1.0,
      "verified": true,
      "author": "Sarah Scatamacchia",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Great tool. Works great and a good deal for ...",
      "text": "Great tool. Works great and a good deal for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "John Richard Boren",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "It works well. I wish it had rubber or ...",
      "text": "It works well. I wish it had rubber or some non-skid material in the bottom though.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Middleton",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "One Star",
      "text": "Undeliverable and damaged so i need to reorder a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Lianne",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Great for Tiny Pills, too!",
      "text": "I used this to cut my cat's 5 mg. tablets into quarters. Works VERY well!! Also, it was delivered 2 days after ordering. Very pleased!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 0,
      "publication_date": 20181230
    },
    {
      "title": "Broke after a couple uses",
      "text": "It worked great, but then broke. The blade turned sideways and it no longer worked.",
      "rating": 2.0,
      "verified": true,
      "author": "Kyle McGrath",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Five Stars",
      "text": "glad to have it, makes it easier to split pills",
      "rating": 5.0,
      "verified": true,
      "author": "Phyllis Bright",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Keep it in my medical bag",
      "text": "Use it almost every day. Vital for nurses, especially when in home care",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190421
    },
    {
      "title": "Dissapointing",
      "text": "This pill cutter was very good while it lasted. However, after a couple of weeks the open/close mechanism is not working as intended. I have to force open and close it to be able to cut the pill.",
      "rating": 1.0,
      "verified": true,
      "author": "Cancer Slayer",
      "helpful_votes": 0,
      "publication_date": 20170918
    },
    {
      "title": "Would not recommend this product.",
      "text": "This product being made of plastic lasted about 200 pills and the hinge broke which appears to be shoddily made.",
      "rating": 2.0,
      "verified": true,
      "author": "Thomas A Schindler",
      "helpful_votes": 0,
      "publication_date": 20180122
    },
    {
      "title": "That is easy for older people",
      "text": "Like .. my grandparent loved it !! They’re enjoying it and helpful for them to cut their medications",
      "rating": 5.0,
      "verified": true,
      "author": "Edlyn Al Bee",
      "helpful_votes": 0,
      "publication_date": 20190120
    },
    {
      "title": "Not recommended",
      "text": "This item worked well for about 2 months, but then it broke. It had good reviews which is why I bought it. But I can't recommend it.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 3,
      "publication_date": 20160623
    },
    {
      "title": "Five Stars",
      "text": "Pill splitters are fine, vendor used was horrible with tracking information",
      "rating": 5.0,
      "verified": true,
      "author": "A. Miller",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Good simple cutter",
      "text": "Great splitter. If you can't use this splitter, you probably shouldn't use a knife during food prep.",
      "rating": 5.0,
      "verified": true,
      "author": "William W. Manning DDS",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Not accurate.",
      "text": "Too much play on the guillotine. Pills not cut in half. More noticeable on small pills.",
      "rating": 2.0,
      "verified": true,
      "author": "Julio",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "One Star",
      "text": "Tried this out a few times but only crumbled the pills, do not buy!",
      "rating": 1.0,
      "verified": true,
      "author": "cassie",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Very bad quality",
      "text": "its made of cheap plastic material, it s not a splitter but a pill crusher!",
      "rating": 1.0,
      "verified": true,
      "author": "May Halden",
      "helpful_votes": 0,
      "publication_date": 20190401
    },
    {
      "title": "Don't spend your money on this.",
      "text": "It crushed instead of cut. The blade is a flimsy razor and it was already warped when I got it. On top of that, I cannot return it.",
      "rating": 1.0,
      "verified": true,
      "author": "Tracie",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Good pill cutter for small pills",
      "text": "This works really well for small pills. I like that the bottom part is sort of rubberized so the pill doesn’t slip around a lot when trying to cut. The blade is also very sharp which is good for precise cuts. I have to cut a small oval tablet into 1/4s for my cat so it can be tricky, but having the top clear so I can see where the cut is being made is very helpful. Overall this is a really good cutter for small pills!",
      "rating": 4.0,
      "verified": true,
      "author": "George",
      "helpful_votes": 0,
      "publication_date": 20171231
    }
  ],
  "product_meta": {
    "title": "Apex Ultra Pill Splitter with Ergonomic Design and Unique V-shape Grips Pills for an Accurate Cut",
    "description": "This pill cutter is safe and durable. Made to fit in your pocket or purse and includes a handy storage compartment for your pills. Taking large pills is a snap when you can cut pills into smaller more easy to swallow pieces.",
    "rating": 4.1,
    "feature_bullets": [
      "Optical grade polycarbonate",
      "Contoured design with overmold for comfort. Fits comfortably in your pocket or purse.",
      "Flexible V-shape holder grips all size pills firmly for accurate cutting of most pill shapes and sizes",
      "Cut pills in half to make swallowing easier",
      "Includes Blade Guard for added safety"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "4.1 x 2.2 x 1 inches; 1.59 Ounces",
      "Item model number": "BD10109",
      "Date First Available": "February 13, 2013",
      "Manufacturer": "Carex",
      "ASIN": "B00FJYMLAY",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "OTC Medications & Treatments",
      "Health & Household",
      "Pill Crushers & Splitters",
      "Health, Household & Baby Care",
      "Medication Aids"
    ],
    "price": 6.76
  }
}