{
  "website_summaries": [
    {
      "verdict": "How good is this? It is used in developing nations around the world to provide clean drinking water.",
      "pros": [
        "Fantastic filtration, and it dispenses water into sealable bags for storage",
        "Works fast",
        "Filter can last up to three years"
      ],
      "cons": [
        "Cleaning this unit can be a real chore"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I add a carbon filter from platypus and I am good to go",
      "text": "These are LIFE SAVERS for those of us on well water with iron. I add a carbon filter from platypus and I am good to go! no more toting gallons of bottled water from the store to the house. We drink our own water and it is peace of mind and refreshing to be able to do this!",
      "rating": 5.0,
      "verified": true,
      "author": "CAJUN",
      "helpful_votes": 36,
      "publication_date": 20180327
    },
    {
      "title": "GREAT FIND!",
      "text": "This is a life saver for my family and all those in need! I have been sending these to my family in Puerto Rico. They distribute them to people in the community in need of a water purifying system. They are really being put to great use. They are easy to use and they love them! Wish I could order more than 9 at a time!",
      "rating": 5.0,
      "verified": true,
      "author": "Gia",
      "helpful_votes": 38,
      "publication_date": 20171028
    },
    {
      "title": "Highly recommended!",
      "text": "Works great and leaves no foul taste. I suggest you use coffee filters to pre-filter your water. They are cheap and keep the larger debris out of your container and filter. I will eventually buy another as it produces much more water than the smaller personal filters.",
      "rating": 5.0,
      "verified": true,
      "author": "BonesTop Contributor: Woodworking",
      "helpful_votes": 26,
      "publication_date": 20170809
    },
    {
      "title": "Well worth taking to the backcountry!",
      "text": "I bought this for a 5 day 4 night Bounderey Waters canoe trip. It is kind of bulky for a trip like that, but I wrapped it in a blanket to keep from getting broken, and worked fine. We purified at least 3 gallons of water every day .Once it gets going, you can filter a gallon of water in 20 minutes or so. We just set it up first thing when making camp and go back every 5 minutes and refill it. The water tasted fine to us, but, in all fairness, we were filtering clean water from a lake that was already clear water. Still glad I bought this at a sale price and would buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Taylor",
      "helpful_votes": 8,
      "publication_date": 20171228
    },
    {
      "title": "Plastic/Chemical Taste",
      "text": "I have filtered dozens of liters of water through it already and followed the instructions precisely. The water still tastes of a foul plastic. I used tap water and the tap water tastes better than the water coming through. It's an unbearable taste. I am very disappointed and wish I could use this for an upcoming trip to China. I thought it would get better after a few liters, but after dozens of liters, it still tastes disgusting. I will be returning the product. Perhaps it's defective? I wish I could've use it.",
      "rating": 1.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 14,
      "publication_date": 20180116
    },
    {
      "title": "I bought one 3 years ago and it was very good but the one I just received keeps a kind ...",
      "text": "After one week the filter seems not working as I hope. I bought one 3 years ago and it was very good but the one I just received keeps a kind of chemical taste......",
      "rating": 2.0,
      "verified": true,
      "author": "louis",
      "helpful_votes": 9,
      "publication_date": 20171209
    },
    {
      "title": "Water is a good thing",
      "text": "\"Basic\" prepper. Should the world commence to collapsing I'll be able to scrounge water for the family. Haven't tried it and don't plan on it unless excrement hits the breeze maker. I have no doubt it will do what it claims.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Davis",
      "helpful_votes": 5,
      "publication_date": 20180426
    },
    {
      "title": "Smaller than it looks",
      "text": "I thought this would be larger, but thats not a bad thing. It is a compact unit that will move a lot of water, especially over it's lifetime. I purchased as a back up filter to my barreled water supply, but now feel confident that in an emergency I could use other water sources and not worry about drinking anything questionable. Priced right for what you get.",
      "rating": 5.0,
      "verified": true,
      "author": "Renocoyote",
      "helpful_votes": 2,
      "publication_date": 20200421
    },
    {
      "title": "Great for access to pure drinking water",
      "text": "We bought The lifestraw family 1.0 Portable Gravity water purifier mainly to use during and after a hurricane. Thankfully we've not had to use it. However, we have checked it out with and are very satisfied with the water flavor and the ease of use. There was no problems with cleaning the lifestraw. So we gave it a thumbs up in this review.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20200708
    },
    {
      "title": "Excellent for emergencies and emergency preparation",
      "text": "I think this product should be included in every family that has an emergency food storage. It claims to be able to supply a family of four for three years with water. That's amazing. I have it for my two person family as an emergency source of clean water. Given the calamaties we've been experiencing in the continental US lately, it is probably a good thing for every person to consider.",
      "rating": 5.0,
      "verified": true,
      "author": "Blind Dad",
      "helpful_votes": 4,
      "publication_date": 20170914
    },
    {
      "title": "Safety First",
      "text": "Have been using daily for about a week. Our city has raised threshhold for EColi in city water so I was concerned. Easy to use and I filter water daily for drinking, water pik and neti pot.",
      "rating": 5.0,
      "verified": true,
      "author": "Janeen Curtiss",
      "helpful_votes": 7,
      "publication_date": 20170818
    },
    {
      "title": "Works well. based on stated purification capacity should serve ...",
      "text": "Works well. based on stated purification capacity should serve a family of 4 for months in case of natural disaster where normal clean water supply is interrupted for months!",
      "rating": 5.0,
      "verified": true,
      "author": "Vic S.",
      "helpful_votes": 4,
      "publication_date": 20180107
    },
    {
      "title": "It works great.",
      "text": "Filtered water very well but a bit clunky to use. We purchased a 5 liter water storage bag to reduce the amount of time spent filtering water when we needed it. During our mission trip to the Dominican Republic we used this to filter the tap water and stream water.",
      "rating": 4.0,
      "verified": true,
      "author": "rondrei",
      "helpful_votes": 15,
      "publication_date": 20150615
    },
    {
      "title": "Great Water Filter",
      "text": "Delivered on-time, no issues. I haven't used it, and I hope I never have to, unless its for a long camping trip. This seems to be the best deal in water filters. Its not as pretty as the other gravity filters that are on the market, but it works just as well, and it is much more affordable. This product provides me some comfort of mind knowing I have a good quality water filter, should the need arise. I would buy this product again, and I would recommend to family and friends.",
      "rating": 5.0,
      "verified": true,
      "author": "BillnWa",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Makes crystal clear and excellent tasting water.",
      "text": "Perfect for traveling the country and camping in the National Forests. I've been using this to filter lake and creek water with zero problems to date. The water comes out crystal clear and tastes great. I've yet to use it with standing water, but that'll be a last resort.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan Crosby",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "This is a great product to have in your emergency  Kit at home.",
      "text": "This is an absolute must if we have an earthquake or natural disaster. or the water gets a little questionable. if you have pets you should get one of these. because it's a way to fill their water bowls with good water. remember you love them to!",
      "rating": 5.0,
      "verified": true,
      "author": "D J",
      "helpful_votes": 0,
      "publication_date": 20200424
    },
    {
      "title": "Love it!!",
      "text": "Due to a recent spike in white sediment in our public water, I had to resort to using this as my in home water filter for our drinking water. It is a hassle to climb a stool to pour water in the top, but, other than that, I'm extremely happy with it",
      "rating": 5.0,
      "verified": true,
      "author": "Lumina",
      "helpful_votes": 6,
      "publication_date": 20151214
    },
    {
      "title": "Super awesome water filter",
      "text": "Super awesome water filter...at a great price...but the necessary squeeze bulb used to clear the filter was poorly made and now after only 7 months of necessary use it is leaking...I could not find a replacement....this is the only reason such a low rating.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon customer",
      "helpful_votes": 5,
      "publication_date": 20170527
    },
    {
      "title": "Great filter!",
      "text": "We just returned from a two week camping trip and used this every day to get clean drinking water. We were able to use it with multiple water sources, and the end result was consistent, great tasting water. Our only issue is that the blue plastic part you fill up is smaller than the pictures seem...but it didn't effect performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200814
    },
    {
      "title": "awesome",
      "text": "We aren't planning for Armageddon but it is awesome for camping in remote areas so youdon't have to carry in water",
      "rating": 5.0,
      "verified": true,
      "author": "jeff",
      "helpful_votes": 0,
      "publication_date": 20190721
    },
    {
      "title": "If you are a prepper you must have several ways ...",
      "text": "If you are a prepper you must have several ways to purify water. I can check this one off on my list of preps.",
      "rating": 5.0,
      "verified": true,
      "author": "CB Graphics",
      "helpful_votes": 2,
      "publication_date": 20180606
    },
    {
      "title": "Nice to keep in my family bugout bag instead of ...",
      "text": "Nice to keep in my family bugout bag instead of having a bunch of their smaller ones. Come package well to keep clean even during a flood.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry Davis",
      "helpful_votes": 2,
      "publication_date": 20180307
    },
    {
      "title": "Horrible product! Don’t waste your money!",
      "text": "Horrible product! Didn’t work anything like they said, the water doesn’t flow out, it is a slow drip,takes forever to fill anything up! Very disgusted with this product! Don’t waste your money!",
      "rating": 1.0,
      "verified": true,
      "author": "C.Chu",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "One of those things you may never need but when you do PRICELESS  !!",
      "text": "This is something I purchased for In case of emergency ! Be prepared ! If i never use it ,it was still well worth having ! Piece of mind ! Great reviews, and proven product .",
      "rating": 5.0,
      "verified": true,
      "author": "Jab",
      "helpful_votes": 0,
      "publication_date": 20200502
    },
    {
      "title": "Filters lake water for drinking, but leaks out the ...",
      "text": "Filters lake water for drinking, but leaks out the side nozzle even when closed, so have to put a cup under that too for indoor use.",
      "rating": 4.0,
      "verified": true,
      "author": "irishrose",
      "helpful_votes": 3,
      "publication_date": 20170801
    },
    {
      "title": "Thought it would be good to have on hand in-case we get hit with ...",
      "text": "Got this just in case of a SHTF situation. I'm not a prepper......really! Thought it would be good to have on hand in-case we get hit with a worst case scenario hurricane or other catastrophe. It came sealed in a heavy duty plastic bag with directions. Again.......just in case!!",
      "rating": 5.0,
      "verified": true,
      "author": "RodsVrod",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Perfect Solution",
      "text": "Great peace of mind having this in my emergency kit. Water is heavy and cumbersome to carry. This device weighs next to nothing and gives the peace of mind in an uncertain world.",
      "rating": 5.0,
      "verified": true,
      "author": "BigD",
      "helpful_votes": 3,
      "publication_date": 20161202
    },
    {
      "title": "Impressive water filters",
      "text": "These are very impressive emergency water filters. Although i have not needed to use one yet, I have two on hand at each of my two dwellings and I've sent one to each of my adult children. Safe drinking water is essential to human life. That says it all.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger",
      "helpful_votes": 3,
      "publication_date": 20170516
    },
    {
      "title": "I can not say how it performs, as I ...",
      "text": "I can not say how it performs, as I purchased this item as a donation for some young friends who went on a mission to Puerto Rico after the hurricane. I believe they were able to acquire 15 of them to take. They are still there helping the people.",
      "rating": 5.0,
      "verified": true,
      "author": "Jackie L. Likes",
      "helpful_votes": 2,
      "publication_date": 20171115
    },
    {
      "title": "Great water purifier in an emergency",
      "text": "You don't need to be prepper to own one or more of these handy little water filtration device. Could become very useful if you have access to any kind of water.",
      "rating": 5.0,
      "verified": true,
      "author": "Pastor Walt Guimbellot",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "Seems good",
      "text": "I won't really know how good this is until the apocalypse.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Kuyat",
      "helpful_votes": 3,
      "publication_date": 20170721
    },
    {
      "title": "Great for emergencies",
      "text": "This is an emergency product so I have not used it as of yet I gave five stars for the idea of it but one star because I have not used it yet",
      "rating": 5.0,
      "verified": true,
      "author": "Joy",
      "helpful_votes": 0,
      "publication_date": 20190926
    },
    {
      "title": "hope never to need, but...",
      "text": "Bought for emergency preparedness. Water is the #1 necessity. I bought this on its reputation and it gives me some peace of mind in the event it's needed. I have family that thinks prepping is a waste of money, so I'm sure they'll be knocking on the door if they can't get food or water. I have the smaller lifestraw for me and my wife, so this is in reserve for the deniers.",
      "rating": 5.0,
      "verified": true,
      "author": "DoninWV",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "Five Stars",
      "text": "Bought and out away in case it's ever needed. Makes me feel a little more secure.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve Healy",
      "helpful_votes": 2,
      "publication_date": 20171025
    },
    {
      "title": "LifeStraw Seems well made.",
      "text": "I bought this LifeStraw and hope to never have to use it. Kind of just putting it on a shelf, in case someday the world comes apart. The one thing we need even more than food is good drinking water.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff D.",
      "helpful_votes": 0,
      "publication_date": 20181125
    },
    {
      "title": "Peace of mind",
      "text": "I have not used it, yet. Bought for an emergency. It does give me peace of mind. One less thing to worry about.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Fields",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "H2O filter",
      "text": "Well, regarded for \"just in case\". Happy to have it",
      "rating": 5.0,
      "verified": true,
      "author": "PWswfla2011",
      "helpful_votes": 0,
      "publication_date": 20180721
    },
    {
      "title": "Five Stars",
      "text": "Anyone need to drink clean water? This will do the job perfectly! No worries.",
      "rating": 5.0,
      "verified": true,
      "author": "Judy L",
      "helpful_votes": 0,
      "publication_date": 20180423
    },
    {
      "title": "Very happy.",
      "text": "Works really well. Went to the boundary waters in mn and it supplied water for 8 guys. Pour in the water and let it run. Clean the filters once or twice a day and it keeps flowing.",
      "rating": 4.0,
      "verified": true,
      "author": "Thomas Esco",
      "helpful_votes": 5,
      "publication_date": 20150927
    },
    {
      "title": "Peace of mind",
      "text": "Peace of mind knowing I have fresh water for the family in times of need",
      "rating": 5.0,
      "verified": true,
      "author": "John ",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "perfect size. added to my hurricane emergency supplies",
      "text": "perfect size. added to my hurricane emergency supplies. I hope I dont ever have to use it but if I do then i will be set.",
      "rating": 5.0,
      "verified": true,
      "author": "AB",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "good unit",
      "text": "good product dont try urine through it though, not a good idea",
      "rating": 5.0,
      "verified": true,
      "author": "Edward M",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "shutoff valve doesn't work",
      "text": "This product is a good idea, but it is cumbersome to hang and use AND mine has had a leak in the shutoff valve since the day I got it - which means that anything in the tank ends up dripping out onto the floor after you shut off the valve - a pain!!",
      "rating": 2.0,
      "verified": true,
      "author": "Sephronia",
      "helpful_votes": 17,
      "publication_date": 20150409
    },
    {
      "title": "Four Stars",
      "text": "I love the concept and it definetly works, the flow rate is VERY slow.",
      "rating": 4.0,
      "verified": true,
      "author": "3-7-77",
      "helpful_votes": 5,
      "publication_date": 20161208
    },
    {
      "title": "Satisfied",
      "text": "Item arrived in a timely manner and was as advertised",
      "rating": 5.0,
      "verified": true,
      "author": "dn",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "This is a must for families in todays uncertain world ...",
      "text": "This is a must for families in todays uncertain world. It filters a lot of water and removes both bacteria and viruses.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris F.",
      "helpful_votes": 4,
      "publication_date": 20160513
    },
    {
      "title": "Five Stars",
      "text": "As described and on time delivery. Everyone should have one of these for their home emergency supply kit.",
      "rating": 5.0,
      "verified": true,
      "author": "Steele Magnolia",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "happy to not have had one yet",
      "text": "purchased for emergencies, happy to not have had one yet!",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel Cozad",
      "helpful_votes": 0,
      "publication_date": 20171226
    },
    {
      "title": "Greater water filter capicity for a reasonable cost",
      "text": "The natural next step to take after the personal Life Straw for a supply of clean safe water. This filter is very efficient and cost effective.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike K.",
      "helpful_votes": 0,
      "publication_date": 20170804
    },
    {
      "title": "must have item",
      "text": "best price I have ever seen ! peace of mind now that I have one",
      "rating": 5.0,
      "verified": true,
      "author": "Robert  47",
      "helpful_votes": 0,
      "publication_date": 20180905
    },
    {
      "title": "Five Stars",
      "text": "Very nice water purifier to have for emergency kit and outdoor recreation. Large enough to keep the family hydrated.",
      "rating": 5.0,
      "verified": true,
      "author": "Godog",
      "helpful_votes": 0,
      "publication_date": 20170313
    },
    {
      "title": "Its not something you can just throw in a bag and go and it doesnt exactly fold up nicely either. The hose is already kinked and",
      "text": "Bought this to go on a hiking trip. When I received it I didnt realize just how big it is. Its not something you can just throw in a bag and go and it doesnt exactly fold up nicely either. The hose is already kinked and i have prop it just right to keep the water flowing through.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy Kellum",
      "helpful_votes": 2,
      "publication_date": 20151207
    },
    {
      "title": "Everyone needs one",
      "text": "Always be ready this will save your family from bad water",
      "rating": 5.0,
      "verified": true,
      "author": "R. Ryder",
      "helpful_votes": 0,
      "publication_date": 20190228
    },
    {
      "title": "Five Stars",
      "text": "Very nicely made, very clever and they make it easy to clean out the filter. Thanks LifeStraw!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171202
    },
    {
      "title": "Get one tomorrow",
      "text": "This thing will save your life in a SHTF scenario. It’s good practical insurance",
      "rating": 5.0,
      "verified": true,
      "author": "Coachjpc",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Five Stars",
      "text": "dont go cheap buy the good ones these are for this level",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer nutbutter",
      "helpful_votes": 0,
      "publication_date": 20170523
    },
    {
      "title": "We’ll see",
      "text": "Haven’t used it yet. Part of my prep kit for “the big one” here on the Olympic peninsula 👍 Should be able to filter for the whole neighborhood!",
      "rating": 5.0,
      "verified": true,
      "author": "GeeMaw",
      "helpful_votes": 0,
      "publication_date": 20190325
    },
    {
      "title": "Good to know I have it, if needed",
      "text": "I hope I never have to use this. It’s going with my hurricane preparedness supplies",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Five Stars",
      "text": "it was a gift for daughter and they love it.",
      "rating": 5.0,
      "verified": true,
      "author": "cisco22",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Every Family should own this",
      "text": "Life straw makes a superb product. I own 4 straws for my family and when I discovered this I jumped on the purchase. Do not shy away from the price; you can't put a price on safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott T.",
      "helpful_votes": 3,
      "publication_date": 20140703
    },
    {
      "title": "It's easy to use and allowed us to save a lot ...",
      "text": "We brought this to Peru for hiking. It's easy to use and allowed us to save a lot on bottled water. We're happy to have it now for backup if there is another hurricane or other emergency/disaster.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa D S",
      "helpful_votes": 2,
      "publication_date": 20150331
    },
    {
      "title": "Five Stars",
      "text": "This is great, just takes a long time to filter through.",
      "rating": 5.0,
      "verified": true,
      "author": "BT",
      "helpful_votes": 0,
      "publication_date": 20170715
    },
    {
      "title": "Good quality. Price a little steep for the quality ...",
      "text": "Good quality. Price a little steep for the quality of the materials and manufacture but I am sure they are giving these away in the 3rd world and somebody has to subsidize that.",
      "rating": 5.0,
      "verified": true,
      "author": "TK Wonderful",
      "helpful_votes": 0,
      "publication_date": 20150412
    },
    {
      "title": "The only problem I had was it drained the fresh ...",
      "text": "The only problem I had was it drained the fresh water really slow. Other then that the water was fresh and tasty.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Davey",
      "helpful_votes": 7,
      "publication_date": 20140815
    },
    {
      "title": "Developed Mold.",
      "text": "Had high hopes for this. Used it as instructed. Bulb developed massive amounts of mold which clogged filter. Not sure if I did something wrong, but product became pretty much useless and I had to throw it away after discovering the mold inside. Awesome concept. Perhaps if all parts are taken apart and dried out after use it would prevent mold. Not sure. Won't be buying again. Probably good for someone wanting to store it for emergencies.",
      "rating": 2.0,
      "verified": true,
      "author": "thedudeabides",
      "helpful_votes": 6,
      "publication_date": 20151004
    },
    {
      "title": "Wet my Whistle",
      "text": "It arrived on time undamaged. It is functional and compact. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed KEim",
      "helpful_votes": 0,
      "publication_date": 20170604
    },
    {
      "title": "Don't buy 1 buy 2!!!",
      "text": "After using one of these that a friend owned I was so impressed I bought 2. They last years and save a lot of $$$$$ vs the Brita filters. It's also much faster / easier to filter water with this vs the Brita. I have well water so this has made life much nicer as I just use this to filter water into my water container that stays in my fridge so I always have bottled water it seems like. Also I bought one for home use the other for emergency use as I live in southern Louisiana and when you lose power and need something like this for an emergency it's a godsend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake",
      "helpful_votes": 3,
      "publication_date": 20160929
    },
    {
      "title": "Great Unit!",
      "text": "The best and cheapest water filtration out there for larger amounts of water at a low price. Gets ALL the critters.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne J. Hamilton",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Clean water safety net!",
      "text": "Bought a couple to keep just in case. I hope i never have to use it but i am glad it is there",
      "rating": 5.0,
      "verified": true,
      "author": "Charlie H.",
      "helpful_votes": 0,
      "publication_date": 20170430
    },
    {
      "title": "Buy one!!! EVERYBODY Now!!!",
      "text": "Everybody needs to buy one of these!!! I'm going to buy two more soon as I can.",
      "rating": 5.0,
      "verified": true,
      "author": "Benjamin Selby",
      "helpful_votes": 0,
      "publication_date": 20190508
    },
    {
      "title": "The water tasted fine, the filter will last a long time",
      "text": "Used this in the Mountains in colorado. The water tasted fine, the filter will last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "OCD Reader",
      "helpful_votes": 3,
      "publication_date": 20160116
    },
    {
      "title": "I definitely recommend this filter to those living in or visiting places ...",
      "text": "Works very well. I definitely recommend this filter to those living in or visiting places with limited filtered water.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle M.",
      "helpful_votes": 0,
      "publication_date": 20160513
    },
    {
      "title": "Four Stars",
      "text": "have not tried it. put it in emergency storage box",
      "rating": 4.0,
      "verified": true,
      "author": "Josey",
      "helpful_votes": 0,
      "publication_date": 20170813
    },
    {
      "title": "Great product.",
      "text": "I bought it for an emergency and our town was devastated by a hurricane a few days ago and I had not told my wife I had bought because I knew she would criticize me for buying it, but after the hurricane she did not say a word and I know she was very happy I bought it, we used it every day for 10 days and worked awesome! The water comes out slow, but I expected that to happen, it means its filtering.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Tapia",
      "helpful_votes": 7,
      "publication_date": 20141002
    },
    {
      "title": "This is a great way to plan for the future",
      "text": "This is a great way to plan for the future. You never know when a disaster will hit and you need to supply your family with clean drinking water.",
      "rating": 5.0,
      "verified": true,
      "author": "KonstantineMeetsArcadia",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "Takes time to set up but is usable when hiking ...",
      "text": "Takes time to set up but is usable when hiking if you don't mind waiting at the end of the day.",
      "rating": 4.0,
      "verified": true,
      "author": "Avid Reader",
      "helpful_votes": 0,
      "publication_date": 20160705
    },
    {
      "title": "Five Stars",
      "text": "We keep this on hand just in case. Seems to be very solid and quality construction.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky",
      "helpful_votes": 0,
      "publication_date": 20161002
    },
    {
      "title": "Great device! We use it at our camp in ...",
      "text": "Great device! We use it at our camp in Northern Ontario. Works quickly and water tastes great. Probably going to by the Lifestraw bottle soon.",
      "rating": 5.0,
      "verified": true,
      "author": "Kilo9r",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "preparing for family emergency",
      "text": "It works perfectly as far as I can tell. It arrived on time and in a sealed bag. I am extremely pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "C W",
      "helpful_votes": 0,
      "publication_date": 20150510
    },
    {
      "title": "great product",
      "text": "everyone should have a coulee of these, just in case.....",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "Could be very useful in a pinch",
      "text": "Could be very useful in a pinch. One star off as I was disappointed that the packaging was torn.",
      "rating": 4.0,
      "verified": true,
      "author": "frogperson",
      "helpful_votes": 2,
      "publication_date": 20150219
    },
    {
      "title": "Great buy",
      "text": "We took this campinging and loved it. Easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Regina",
      "helpful_votes": 0,
      "publication_date": 20190504
    },
    {
      "title": "but if one can be found in bad times, this is essential to cleaing the",
      "text": "a must for survival or camping supplies. Needs a water source, but if one can be found in bad times, this is essential to cleaing the water",
      "rating": 5.0,
      "verified": true,
      "author": "topknat",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "Easy to use and easy to clean.",
      "text": "It's all plastic with some cheap metal clips holding the hose and bulb on. However, it seems to work fine. Without testing the water in a lab, I don't know how well the filtration system works. I would suggest getting this size at a minimum unless you have lots of time to wait. This filter does not produce water very fast. If you wanted to hydrate a family of 4....it would barely keep up. Still, it's easy to use and I'm glad I have it.",
      "rating": 5.0,
      "verified": true,
      "author": "liberal warrior",
      "helpful_votes": 5,
      "publication_date": 20150402
    },
    {
      "title": "Prepare for emergencies",
      "text": "Although we haven't had to use this (and I hope we never do), it's a well-designed and packaged item kept on hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Shells",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Have not used it but man it came like the next day",
      "text": "Have not used it but man it came like the next day!! Good job!! I'm sure if I ever have to use it it will do fine!!",
      "rating": 5.0,
      "verified": true,
      "author": "joe perry",
      "helpful_votes": 0,
      "publication_date": 20150328
    },
    {
      "title": "Five Stars",
      "text": "This did an outstanding job although it's a little bulky for kayak camping.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Calewarts",
      "helpful_votes": 0,
      "publication_date": 20160530
    },
    {
      "title": "But will be a much loved item when the stuff hits the fan",
      "text": "Haven't used it yet. But will be a much loved item when the stuff hits the fan.",
      "rating": 5.0,
      "verified": true,
      "author": "Anonymous Annie",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "My buy!",
      "text": "Great tool for \"bob\". Also great to have in case of natural disaster. Great product! Must buy! Larger than I thought, can handle a lot of water at once",
      "rating": 5.0,
      "verified": true,
      "author": "emma maddox",
      "helpful_votes": 0,
      "publication_date": 20150619
    },
    {
      "title": "Water are you looking at? Clean water.",
      "text": "I have not used it yet. But I have read a lot about it, and is highly recommended. Hurricane Katrina showed us how, in a disaster, the government may not be able help us. Lead in our drinking water in some of our big cities, terrorist attack on our power grid or water supply, or some natural disaster would make this a must have. I refuse to stand in line, in some parking lot, where they are handing out water. Then a fight begins and its a free for all.",
      "rating": 5.0,
      "verified": true,
      "author": "T. F. Mena",
      "helpful_votes": 2,
      "publication_date": 20170724
    },
    {
      "title": "Good for home family use",
      "text": "This is used in Africa in places that don't have drinkable water and it's also good for home use if your water system goes down for any reason or as a good base camp water filter for long camping trips.",
      "rating": 4.0,
      "verified": true,
      "author": "biff101",
      "helpful_votes": 10,
      "publication_date": 20140304
    },
    {
      "title": "Five Stars",
      "text": "Very pleased with order. Haven't had a need to try it out yet. Bought it for emergencies.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Flood relief?",
      "text": "I wish someone would distribute these to people after a hurricane -- like in Texas and Florida (and the Caribbean). IMO it would make more sense than bottled water..",
      "rating": 5.0,
      "verified": true,
      "author": "Raci570",
      "helpful_votes": 4,
      "publication_date": 20170918
    },
    {
      "title": "every one should have one",
      "text": "Havent used it just put up for emergency situations everyone needs atleast 3yrs of water on backup this filters almost 5000 gallons plenty of water for years of drinkable water w/out having to boil water",
      "rating": 5.0,
      "verified": true,
      "author": "aaron",
      "helpful_votes": 0,
      "publication_date": 20150206
    },
    {
      "title": "Simple to operate-Recommend it for every family for emergencies.",
      "text": "I bought this for my family in case of an emergency when we don't have running water. I bought the life straw and liked it very much. Hence, this purchase. We received it promptly and exactly as described. It seems durable and simple enough to operate. It doesn't require any power. It uses gravity to do its work. I recommend every family owns this for an emergency.",
      "rating": 4.0,
      "verified": true,
      "author": "University DocTop Contributor: Camping",
      "helpful_votes": 3,
      "publication_date": 20150813
    },
    {
      "title": "Five Stars",
      "text": "Filters water great perfect hurricane back up if tap water is bad.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Bought for preparedness purposes",
      "text": "I rate this product 5 stars, not because I have used it yet but because of the various articles I have read about it's use in other countries that have very limited sources of safe water. I bought it in the event of a crisis or natural disaster. We live on a fault and are \"due\" for an earthquake. We have been looking at various types of water purification products some very expensive, and we felt this one will meet our needs and budget best.",
      "rating": 5.0,
      "verified": true,
      "author": "S Rawlins",
      "helpful_votes": 0,
      "publication_date": 20131121
    },
    {
      "title": "This is what I was looking for in a larger ...",
      "text": "This is what I was looking for in a larger system to provide clean drinking water, in an emergency, for more than one person. And in a sealed container for long term storage.",
      "rating": 5.0,
      "verified": true,
      "author": "Scotty R",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Works exactly as advertised.",
      "text": "Works exactly as it is supposed to. We have it for the potential of future emergencies, but in the mean time, I am using it to purify spring water for use in our camping trailer.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Hicks",
      "helpful_votes": 0,
      "publication_date": 20150316
    },
    {
      "title": "This water purifier is awesome, have been drinking a lot of rain water",
      "text": "This water purifier is awesome , have been drinking a lot of rain water , highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Bobby",
      "helpful_votes": 2,
      "publication_date": 20150211
    }
  ],
  "product_meta": {
    "title": "LifeStraw Family 1.0 Portable Gravity Powered Water Purifier for Emergency Preparedness and Camping",
    "description": "Size:1PACKProvides a family of 5 up to 3 years of safe, filtered water! The LifeStraw Family 1.0 purifies up to 4,750 gallons, or 18,000 liters of water. For roughin' it in the wilderness or surviving a natural disaster, that's up to 3 years of water for a family of 5! If you need to purify contaminated water or make tap water safe during a boil advisory, LifeStraw is simply the best filter out there. No bug-out or emergency kit is complete without a LifeStraw. Weighing in at under 2 lbs. and designed for easy packing, it's the perfect traveling companion for adventure and preparedness. It's no wonder LifeStraw is an internationally recognized, award-winning water filter! Filters up to 4,750 gallons or 18,000 liters of water to 0.02 microns (20 nm); Removes minimum 99.99% of viruses; Removes minimum 99.9999% of bacteria; Removes minimum 99.9% of protozoan cysts; Requires no electrical power, batteries or replacement parts; Requires no running water or piped-in water supply; Reduces turbidity; Flow rate of 9-12 liters / hour; Has an easy-to-clean pre-filter and purification cartridge; Red bulb for backwashing filter; All raw materials are US FDA compliant or equivalent; Used worldwide in harsh conditions since 2005; Lifespan: 4,750 gallons (18,000 liters); Flow Rate: 9-12 liters / hour; Weight: 1.6 lbs.; Mfg. Number: LSF101402.",
    "rating": 4.7,
    "feature_bullets": [
      "Award-winning LifeStraw Family is used by over 13,200,000 people worldwide",
      "Surpasses EPA standards for water purifiers: removes 99.99% viruses, 99.9999% bacteria and 99.9% protozoan cysts to 0.02 microns",
      "Purifies 18,000 liters/4755 gallons WITHOUT iodine, chlorine, or other chemicals; Clean drinking water for a family of four for 3 years",
      "Gravity filter - pour water in the top and clean water comes out the bottom; Comes in a sealed bag, perfect for storing for emergencies",
      "Flow rate of 9 -12 liters per hour"
    ],
    "specifications": {
      "Product Dimensions": "11 x 9 x 4.5 inches",
      "Item Weight": "1.15 pounds",
      "Department": "Unisex-adult",
      "Manufacturer": "LifeStraw",
      "ASIN": "B00FM9OBQS",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More",
      "Item model number": "LSF101402",
      "Customer Reviews": "4.7 out of 5 stars984 ratings4.7 out of 5 stars",
      "Best Sellers Rank": "#10,737 in Sports & Outdoors",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "October 3, 2013"
    },
    "categories": [
      "Camping & Hiking",
      "Sports & Outdoors",
      "Hydration & Filtration",
      "Outdoor Recreation"
    ],
    "price": 66.11
  }
}