{
  "website_summaries": [
    {
      "verdict": "A unique option for having a classic-looking and functional steering wheel spinner all in one knob.",
      "pros": [
        "The all-aluminum construction and zinc mounting plate stand out in retro and vintage style cars",
        "Steering knob is taller than most other options, providing extra leverage in turns"
      ],
      "cons": [
        "May require a shim to fit on smaller steering wheels found on boats",
        "Too small for larger truck steering wheels"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The best on Amazon",
      "text": "This spinner is just what I was looking for and works perfectly. The axis of the spinner on almost all of the units at Amazon are offset from center and stick out beyond the steering wheel. This is much better with a centered axis. Fine quality metal and spins nicely. I think there are ball bearings supporting the handle, but not sure. The attachment hardware is extremely versatile. The only thing you would possibly have to change is to substitute longer attachment bolts if you had a very fat steering wheel, but these are easily obtained and may already be in your garage.",
      "rating": 5.0,
      "verified": true,
      "author": "Daddy Waddy",
      "helpful_votes": 13,
      "publication_date": 20160510
    },
    {
      "title": "It works fine like that but it's not right",
      "text": "Yeah, it's OK. It frees up my beer hand. I'm using it on my John Deere 125 riding mower. It comes with 2 back plates and the bigger one fits my thick steering wheel. The bolts are too short for the thick wheel. Bearings work well. The finish was rubbed off when I got it, new. The top cross plate won't stay on the top of the steering wheel so I put it at a 45* angle where the spoke meets the wheel. It works fine like that but it's not right. Good enough for this application, it's a lawn mower, but if it had to be nice I would have returned it.",
      "rating": 3.0,
      "verified": true,
      "author": "chris larson",
      "helpful_votes": 7,
      "publication_date": 20171115
    },
    {
      "title": "This thing is awesome! My 1971 Dodge Sweptlines manual steering turns so ...",
      "text": "This thing is awesome ! My 1971 Dodge Sweptlines manual steering turns so much easier backing into spots , up to the trailer , or just going around town . The knob swivels very freely , and does not slip . I used my own hardware because of the thickness of the steering wheel . Al;l in all , for the money , it is a very nice piece . I will be putting one in my '73 Dodge truck too . . .",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Sanger",
      "helpful_votes": 5,
      "publication_date": 20161208
    },
    {
      "title": "Just the spinner for an old guy with limited range of movement.",
      "text": "This wheel spinners is rock solid and bullet proof. Many reviews for steering wheel spinners complained about them becoming loose (not staying in place), or breaking. I did have to modify the mounting clamp to fit my golf cart, but this spinner's ball bearings were worth the extra modification time.",
      "rating": 4.0,
      "verified": true,
      "author": "f1ycaster",
      "helpful_votes": 8,
      "publication_date": 20160104
    },
    {
      "title": "Polished Aluminum Wheel Spinner",
      "text": "Quality made. Would have gotten 5 stars if I didn't have to got buy longer bolts to fit on my rig. But big deal. I hade to make a trip to a hardware store. Poor me. Spins smoothly and it's has zero plastic! You'll dig it.",
      "rating": 4.0,
      "verified": true,
      "author": "Mattybone Peeks",
      "helpful_votes": 12,
      "publication_date": 20160410
    },
    {
      "title": "I had another one of my vehicles outfitted with a far more expensive spinner knob an d flat out like these affordable options be",
      "text": "For price ease of installation you can't beat this one.I had another one of my vehicles outfitted with a far more expensive spinner knob an d flat out like these affordable options better.None of us wants to need one of these but for those that do ,keep it simple and be sure to add lock washers if the one you get doesn't come with them. This one fortunately does.",
      "rating": 5.0,
      "verified": true,
      "author": "Bart Langly",
      "helpful_votes": 5,
      "publication_date": 20160907
    },
    {
      "title": "Not Useable",
      "text": "A nice product but for me it didn't work out. Because of the design of the mounting plate with two \"wings\" on it I was not able to find a way to mount it on the steering wheel of my Simplicity lawn tractor. Also there is a small dent in the top of it, not something that affects how it would work but still not a perfect new item. I will ty to sell it locally as maybe someone will be able to make it work on a different steering wheel.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael A. Jurkowski",
      "helpful_votes": 2,
      "publication_date": 20170916
    },
    {
      "title": "best suicide knob ive found, and its not just for cars!",
      "text": "i love this thing but gave it 4 stars becuse when it arrived, the bracket was less a U and more a V. a couple taps with a hammer fixed that and it fit fine, though did damage the finish. i loved the suicide knob on the forklift, and decided to install one on the autoscrubber. like the forklifts knob, this thing sits in the middle of the wheel instead of off to the side, allowing full and easy range of movement, and superior control in tight spots. its easy to install and remove as well, and stays in place regardless of heavy use, very solid.",
      "rating": 4.0,
      "verified": true,
      "author": "Daniel V",
      "helpful_votes": 3,
      "publication_date": 20170207
    },
    {
      "title": "Fits great",
      "text": "I installed this on my John Deere mower so I could mow using one hand after having shoulder surgery. I was concerned that it may not stay tight but it works great. I had to use longer screws but worth the effort.",
      "rating": 5.0,
      "verified": true,
      "author": "Monty T.",
      "helpful_votes": 0,
      "publication_date": 20200708
    },
    {
      "title": "Doesn't work for the wheel I purchased it for, looks to be made good otherwise.",
      "text": "Looks to be of good quality. Unfortunately can't use it for the steering wheel I purchased it for. The bottom part that surrounds the wheel is too small, seems to small for ANY steering wheel I've seen. Also, even if it did fit the wheel the bolts are to short. A quick trip to hardware store will fix the bolt problem but can't fix the bottom part that is to small. I'm going to return it for a refund.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin M.",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "It rusts in 2 months.",
      "text": "I loved when I first installed it. Good size and it fitted my boat steering wheel perfectly. The knob still moves very smoothly, but look what a terrible job the manufacturer made with the brackets. In 2 months the rust was already damaging my boat steering wheel. They forgot to say that it is good only for fresh water.",
      "rating": 1.0,
      "verified": true,
      "author": "FloridaCustomer",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "So good it's no longer a suicide handle",
      "text": "I haven't used a suicide handle in 20 years. And this is one of the few products that have gotten much better. It's smooth, comfortable and work's great so good it shouldn't be called a suicide handle anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "warlord",
      "helpful_votes": 0,
      "publication_date": 20200128
    },
    {
      "title": "IT'S OK, BUT NOT GREAT.",
      "text": "IT WORKS WELL, ONCE INSTALLED, HOWEVER IT IS A PAIN TO INSTALL! IT BARELY REACHED AROUND MY KUBOTA 4340'S STEERING WHEEL. IT ALSO SITS HIGH ABOVE THE WHEEL, COULD HAVE A BETTER MOUNT DESIGN.",
      "rating": 3.0,
      "verified": true,
      "author": "THUMS-UP",
      "helpful_votes": 0,
      "publication_date": 20191017
    },
    {
      "title": "Not for a thin wheel.  Clamp is large",
      "text": "Nice spinner. Well made. Turns nicely. The clamp was a bit big for the wheel on my boat. I put a rubber shim under the clamp to hold it tight and to protect the wheel from scratches.",
      "rating": 5.0,
      "verified": true,
      "author": "Credx2",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "SPINNER on steering wheel",
      "text": "This spinner is nice looking, and sturdy. I only wish they supplied rubber to go under it so it does not cause pressure marks on the steering wheel but other than that very nice product.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Bock",
      "helpful_votes": 0,
      "publication_date": 20200718
    },
    {
      "title": "Installed on my golf cart.",
      "text": "Knob comes with 2 adapters to use depending on the thickness of your steering wheel. It mounted firmly to the skinny steering wheel on my cart and seems well built.",
      "rating": 5.0,
      "verified": true,
      "author": "Henry Famularo",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "It worked perfectly on our Polaris 900 Ranger. My ...",
      "text": "It worked perfectly on our Polaris 900 Ranger. My husband just found out he has RA and this makes driving the Ranger and lot easier with the pain in his hands.",
      "rating": 5.0,
      "verified": true,
      "author": "Tami B. Meyer",
      "helpful_votes": 6,
      "publication_date": 20150817
    },
    {
      "title": "I love there are no plastic parts and will probably last ...",
      "text": "Fit the steering wheel in the John Deere combine perfectly. Made harvest sooo much easier. I love there are no plastic parts and will probably last a lifetime.",
      "rating": 5.0,
      "verified": true,
      "author": "roll cyclones",
      "helpful_votes": 2,
      "publication_date": 20170426
    },
    {
      "title": "Poorly made.",
      "text": "Looks nice, but no bearings, and it's loose and sloppy. I don't expect it to last long, but only time will tell. I would probably have given it at least 4 stars if it had decent bearings.",
      "rating": 2.0,
      "verified": true,
      "author": "Gale Haines",
      "helpful_votes": 0,
      "publication_date": 20190115
    },
    {
      "title": "How in the heck does this install? Zero instructions! Weird design.",
      "text": "What is there to like? It didn’t even come close to fitting my 1” steering wheel. No instructions included and seller couldn’t provide any useful information. It did feel sturdy, but never could get it installed.",
      "rating": 1.0,
      "verified": true,
      "author": "JUSTCOCONUTS",
      "helpful_votes": 0,
      "publication_date": 20190517
    },
    {
      "title": "It hard to tell what it fits but nice product",
      "text": "My fault for ordering the wrong one, didn't fit well on husqvarna tractor but it's well made and will use it on something else",
      "rating": 5.0,
      "verified": true,
      "author": "paul",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Good value, in my opinion",
      "text": "Good value, in my opinion. Does loosen up a bit with time, but have only had to re-tighten about once every 6 weeks. I bought it because I have muscle weakness. Back in control!",
      "rating": 5.0,
      "verified": true,
      "author": "tom poulton",
      "helpful_votes": 2,
      "publication_date": 20170117
    },
    {
      "title": "Heavy duty. Steel roller no plastic!",
      "text": "I use it for my concrete mixer which takes a lot of maneuvering to get closer to the jobs. More Percision holding your lane at higher speeds. Can’t live without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Unhappy wife",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "Relax while you drive",
      "text": "Works great for my tractor. I remember my Grandfather having them on his tractors",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20200124
    },
    {
      "title": "Affordable",
      "text": "I brought for use when I shifting in yards but the idea of installing (set up) on steering isn’t really designed,I have ask mechanic to helping. It’s ok to use after setup.......😩",
      "rating": 1.0,
      "verified": true,
      "author": "Kyin Mung",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Was a gift",
      "text": "Father in law wanted one so I sent him this one and he seems to like it",
      "rating": 5.0,
      "verified": true,
      "author": "Georgia",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "spins nicely and works great",
      "text": "Product and hardware fit my steering wheel but the strap that goes around the back side is a little small. Be aware of this. Otherwise, spins nicely and works great. The hardware has started to rust a little as this is for my boat and is exposed to the elements. All of that said, I would still buy this knuckle buster again",
      "rating": 4.0,
      "verified": true,
      "author": "Bryce",
      "helpful_votes": 0,
      "publication_date": 20170606
    },
    {
      "title": "Don’t buy",
      "text": "If I could give zero stars I would, inaccurate description plus no return , this is a waste of money",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "... one has zero turn or has steering wheel working great had to trim rubber coating on wheel to be ...",
      "text": "added to my 2 riding mowers one has zero turn or has steering wheel working great had to trim rubber coating on wheel to be able to fit around and get tight",
      "rating": 5.0,
      "verified": true,
      "author": "Hoyt Curtis",
      "helpful_votes": 0,
      "publication_date": 20180801
    },
    {
      "title": "works good",
      "text": "Use it on my NH tractor with power steering. I like it.",
      "rating": 5.0,
      "verified": true,
      "author": "PSVFD1",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Fits small dia. wheels",
      "text": "Had to enlarge the clamp to fit the wheel. Worked ok.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert R",
      "helpful_votes": 0,
      "publication_date": 20200824
    },
    {
      "title": "Hard to mess up a simple device like a \"spinner\" but this one is even better as ...",
      "text": "Hard to mess up a simple device like a \"spinner\" but this one is even better as it is ball bearings. Great transaction.",
      "rating": 5.0,
      "verified": true,
      "author": "heathhobbyent",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Screws too short",
      "text": "Mounted on a Sears lawn mower. Properly affixed it does stay in place. Had to provide my own screws as the ones they send are way to short.",
      "rating": 3.0,
      "verified": true,
      "author": "OLDER THAN DIRT",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Not for padded steering wheels",
      "text": "Will not fit newer vehicles with wrapped steering wheels. I bought it for a friend who was disabled in a accident and only has use of one arm. He lives 300 miles away from me. He came up for a visit and I was going to surprise him by installing it on his vehicle. Wouldn't work.",
      "rating": 1.0,
      "verified": true,
      "author": "Sgrabiec",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "If you have a salt water boat, you need this for quick maneuvering... Or even in fresh water.",
      "text": "Just put it on our new, (used), boat. Heavy duty, classic shine, stainless steel.",
      "rating": 5.0,
      "verified": true,
      "author": "Manoli",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "Makes driving vehicles with standard transmission much easier",
      "text": "Love this thing, I've got one on every vehicle i drive and now my whole family has one too. A must have for backing trailers and for anyone driving a vehicle with a standard transmission. Shifting while turning is a breeze",
      "rating": 5.0,
      "verified": true,
      "author": "Carson Fletcher",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "Love this thing",
      "text": "Love this thing. I had no trouble getting it installed and it works great. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Obie R. Hale",
      "helpful_votes": 0,
      "publication_date": 20170124
    },
    {
      "title": "Well built",
      "text": "I used this on my 2005 Polaris Ranger and it works like a charm!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181213
    },
    {
      "title": "Suicide knob",
      "text": "Well made Using it on one of my Deere tractors, Love it. Recommended",
      "rating": 5.0,
      "verified": true,
      "author": "Morris Edmonds",
      "helpful_votes": 0,
      "publication_date": 20180918
    },
    {
      "title": "Fun, Helpful",
      "text": "Spins fine; works well. Don't install it low on the weel because the screws stick out and can cut you if you are not careful.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert S. Stone",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Works great",
      "text": "I have two of them one on a boat and tractor they are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Toney Beal",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Golf Cart",
      "text": "Got this for my golf cart awhile back and it works very well, should have bought it a long time ago.",
      "rating": 5.0,
      "verified": true,
      "author": "lama",
      "helpful_votes": 0,
      "publication_date": 20200829
    },
    {
      "title": "Good quality but the only think negative thing about it ...",
      "text": "Good quality but the only think negative thing about it that it did not fit my freightliner steering wheel. I had to buy longer screws to fit",
      "rating": 3.0,
      "verified": true,
      "author": "Ryan Valdes",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Nice knob! :-D",
      "text": "Comes with two clamp sizes for thin and thick diameter steering wheels.",
      "rating": 4.0,
      "verified": true,
      "author": "512KJT",
      "helpful_votes": 0,
      "publication_date": 20170920
    },
    {
      "title": "Threw it in the garbage.",
      "text": "This is just junk. The shape of it makes absolutely no sense.",
      "rating": 1.0,
      "verified": true,
      "author": "the electrician",
      "helpful_votes": 0,
      "publication_date": 20170729
    },
    {
      "title": "Solid product",
      "text": "Replaced a plastic one and should have bought this one first",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Strong and durable",
      "text": "Strong and durable made from quality metal. I've had it in my truck for two years and tis still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "justin",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Chrome  dull looking",
      "text": "Chrome is dull looking has pit marks in chrome did not fit right on my 2014 camaro steering wheel",
      "rating": 1.0,
      "verified": true,
      "author": "edward brosky",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Excellent product",
      "text": "Great product Easy to install, very smooth rotation. Very well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Package was missing parts",
      "text": "Looks like someone wasn't paying attention as package was open and brackets to install had missing parts.",
      "rating": 3.0,
      "verified": true,
      "author": "Les Jones",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Three Stars",
      "text": "Works OK but was sadden it is not designed for a larger diameter steering wheel.",
      "rating": 3.0,
      "verified": true,
      "author": "Thomas E Gallentine",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "he said it is sturdy for what he needs it for",
      "text": "Got this for my husbands boat, he said it is sturdy for what he needs it for.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "works great",
      "text": "Works great on my ole Carryall 2. I have these on all my stuff that has a steering wheel (except cars & truck)",
      "rating": 5.0,
      "verified": true,
      "author": "Handyman",
      "helpful_votes": 0,
      "publication_date": 20170725
    },
    {
      "title": "dont waste your time and effort with this product",
      "text": "it came apart like a cheap watch in about 15 minutes",
      "rating": 1.0,
      "verified": true,
      "author": "stash",
      "helpful_votes": 0,
      "publication_date": 20181203
    },
    {
      "title": "Worth it.",
      "text": "I love it. Solidly built and works great. The feel of the knob in hand is good and the rotation is smoooth.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Denyer",
      "helpful_votes": 2,
      "publication_date": 20160918
    },
    {
      "title": "Four Stars",
      "text": "This works great on my 800 Ranger Crew, but I needed longer bolts, which is why the 4 stars.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20170718
    },
    {
      "title": "Great for truckers.",
      "text": "Highly recommend to other drivers. Drive across country and wouldn’t wanna be without it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alljonas",
      "helpful_votes": 0,
      "publication_date": 20191103
    },
    {
      "title": "Four Stars",
      "text": "Good quality fits nice on the work truck frightliner 2012 cng",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Molina",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Three Stars",
      "text": "Good quality, but doesn't stay put on the steering wheel.",
      "rating": 3.0,
      "verified": true,
      "author": "John Ross",
      "helpful_votes": 0,
      "publication_date": 20170710
    },
    {
      "title": "Four Stars",
      "text": "Very nice gear... Installed on my 26' Angler and haven't had any issues at all...",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 0,
      "publication_date": 20171009
    },
    {
      "title": "Not for boating use",
      "text": "This review pertains ONLY TO BOAT USE. I didn't pick up that the back of the bracket was zinc coated steel, and it rusted to hell. Not their fault, but just want to warn you if you are going to use this for a boat, don't!",
      "rating": 1.0,
      "verified": true,
      "author": "Eejit",
      "helpful_votes": 9,
      "publication_date": 20160424
    },
    {
      "title": "Good buy",
      "text": "Very smooth and sturdy. Much better than the JD one I had on the tractor",
      "rating": 5.0,
      "verified": true,
      "author": "Paul",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Home run!",
      "text": "Great service, fast delivery, outstanding product, Quality unbeatable all for a very modest price.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Barton",
      "helpful_votes": 2,
      "publication_date": 20160321
    },
    {
      "title": "needs longer bolts",
      "text": "once installed works good knob just the right size the bolts too short replacements just a couple of dollars",
      "rating": 4.0,
      "verified": true,
      "author": "Ruben Martinez",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "One Star",
      "text": "This sucks its to big for the wheel and sticks out on the sides..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180201
    },
    {
      "title": "One Star",
      "text": "Did not fit properly on steering wheel. We will be returning :(",
      "rating": 1.0,
      "verified": true,
      "author": "foley daudier",
      "helpful_votes": 0,
      "publication_date": 20171115
    },
    {
      "title": "works great on my lawn mower since I have trouble turning ...",
      "text": "works great on my lawn mower since I have trouble turning the wheel due to upper spine and shoulder problems.",
      "rating": 5.0,
      "verified": true,
      "author": "more ozzy 4 me",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Four Stars",
      "text": "Appears to be a good quality ptoduct. They need to supply longer screws for attaching it",
      "rating": 4.0,
      "verified": true,
      "author": "Kodi S",
      "helpful_votes": 0,
      "publication_date": 20180330
    },
    {
      "title": "... put this on our golf card and it is wonderful. Makes driving so much easier",
      "text": "We put this on our golf card and it is wonderful. Makes driving so much easier.",
      "rating": 5.0,
      "verified": true,
      "author": "Linda K.",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Nice bearings. Fit perfectly on my old Ford/Versitile tractor",
      "text": "Solid, quality feel. Nice bearings. Fit perfectly on my old Ford/Versitile tractor.",
      "rating": 5.0,
      "verified": true,
      "author": "Marcy L.",
      "helpful_votes": 0,
      "publication_date": 20171210
    },
    {
      "title": "Five Stars",
      "text": "Everything was great, no problem, will order from that vender again. Thanks guys.",
      "rating": 5.0,
      "verified": true,
      "author": "Clayton",
      "helpful_votes": 0,
      "publication_date": 20160823
    },
    {
      "title": "Wish screws were a bit longer but very sturdy and",
      "text": "Wish screws were a bit longer but very sturdy and tough",
      "rating": 4.0,
      "verified": true,
      "author": "Ma V",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "It cuts into the steering wheel of my $60, ...",
      "text": "It cuts into the steering wheel of my $60,000 Ram. To keep this from happening, I went to lowes and spent $10 on some longer (2\") screws and some foam weatherstripping. I wrapped the foam weatherstripping around the wheel, then wrapped electrical tape around the weatherstripping, then I tightened the screws down with the clamps over the weatherstripping, not the steering wheel. Seems to be working for now, not sure if its going to hold.",
      "rating": 3.0,
      "verified": true,
      "author": "anonymous",
      "helpful_votes": 2,
      "publication_date": 20160923
    },
    {
      "title": "Won't fit large diameter steering wheels",
      "text": "I have a 2007 Ford truck and there was no way this would fit as it was delivered. I had to mount it on the wheel with bolts that were twice as long as the ones that came with it. Don't know how well it works yet, but I suspect it will be fine. Since it is made of metal, I can't wait to grab hold of it after it bakes in the arizona sun for several hours.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Martin",
      "helpful_votes": 5,
      "publication_date": 20140611
    },
    {
      "title": "Five Stars",
      "text": "What can I say spins the steering wheel like a charm",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey L Gage",
      "helpful_votes": 0,
      "publication_date": 20150428
    },
    {
      "title": "Very good!! This one bolts on to steering wheel",
      "text": "Very good!! This one bolts on to steering wheel, don't buy the ones that just snap on. They fall off and it's annoying. I own two of these for my two vehicles",
      "rating": 5.0,
      "verified": true,
      "author": "Julie Masuicca",
      "helpful_votes": 4,
      "publication_date": 20151116
    },
    {
      "title": "Have leather cover on steering wheel and it seems this ...",
      "text": "Have leather cover on steering wheel and it seems this product keeps shifting and is not stable on the wheel. Had to have longer screws and they stick out the underside and have torn a pair of pants on them when the wheel is in down position.",
      "rating": 2.0,
      "verified": true,
      "author": "Hotair",
      "helpful_votes": 2,
      "publication_date": 20161114
    },
    {
      "title": "Pass on this",
      "text": "Developed a small crack in the base of the handle. Used it driving a yard hauler at Dole (yes, your bananas and pineapples). Not gonna buy this one again, it did not last long. Don't waste $. ps., photo is the Dole yard and those are your containers lined up in the feather pattern. Yes, I do work there, driving the UTRs.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazed by upchuck",
      "helpful_votes": 0,
      "publication_date": 20170304
    },
    {
      "title": "it is very sturdy and well made",
      "text": "I believe this product is made for speedboats or other marine craft. However, it is very sturdy and well made. Other ones I have used were made of cheap plastic and broke. This has a bearing in it. I used it on my Ford Van and it works great.",
      "rating": 3.0,
      "verified": true,
      "author": "tetek",
      "helpful_votes": 0,
      "publication_date": 20170104
    },
    {
      "title": "NOT THE RIGHT PRODUCT",
      "text": "I THOUGHT THIS WOULD FIT A LAWN MOWER. HUSBAND RECENTLY HAD SURGERY AND CAN'T USE HIS LEFT ARM.",
      "rating": 1.0,
      "verified": true,
      "author": "barb",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Nothing special",
      "text": "Bolts are too short and mounting brackets were narrow or too shallow. Did not work for my wheel. Didn't look too bad but nothing great.",
      "rating": 2.0,
      "verified": true,
      "author": "Travis Echols",
      "helpful_votes": 2,
      "publication_date": 20150723
    },
    {
      "title": "Ball bearings are not smooth while turning but was had ...",
      "text": "Ball bearings are not smooth while turning but was had for a cheap price and will work for my application.",
      "rating": 2.0,
      "verified": true,
      "author": "Roland P.",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Thanks for your knob lol",
      "text": "I ordered one on ebay first and I got it and it was crap. The one I got from u actually was what it said",
      "rating": 4.0,
      "verified": true,
      "author": "mike bradley",
      "helpful_votes": 0,
      "publication_date": 20140530
    },
    {
      "title": "But I'm sure all is good.",
      "text": "Haven't used it yet. But I'm sure all is good.",
      "rating": 5.0,
      "verified": true,
      "author": "ED",
      "helpful_votes": 0,
      "publication_date": 20170922
    }
  ],
  "product_meta": {
    "title": "United Pacific 70108 Heavy Duty Aluminum Steering Wheel Spinner,Metallic",
    "description": "Heavy Duty Aluminum Steering Wheel Spinner. Time tested quality and durabilty for commercial trucks & heavy equipment. Heavy duty ball bearing design with metal base, and includes 2 metal brackets to fit most steering wheels",
    "rating": 4.3,
    "feature_bullets": [
      "Designed to reduce effort and fatigue",
      "Time tested quality and durabilty for commercial trucks & heavy equipment",
      "Heavy duty ball bearing design with metal base, and includes 2 metal brackets to fit most steering wheels",
      "Note: Universal design may require bracket modification to fit application. May cause perminent damage to the steering wheel, especially wood, rubber & leather.",
      "Check laws and/or regulations in your state, county, and/or municipality regarding installation and use of this product"
    ],
    "specifications": {
      "Manufacturer": "United Pacific",
      "Brand": "United Pacific",
      "Model": "70108",
      "Item Weight": "9.1 ounces",
      "Product Dimensions": "6.9 x 4.8 x 2.55 inches",
      "Item model number": "70108",
      "Is Discontinued By Manufacturer": "No",
      "Exterior": "Polished",
      "Manufacturer Part Number": "70108",
      "Folding": "No",
      "Cover Included": "One steering wheel spinner",
      "ASIN": "B00F0YHZSQ",
      "Customer Reviews": "4.3 out of 5 stars252 ratings4.3 out of 5 stars",
      "Best Sellers Rank": "#54,077 in Automotive",
      "Date First Available": "April 3, 2013"
    },
    "categories": [
      "Interior Accessories",
      "Steering Accessories",
      "Automotive Parts & Accessories",
      "Steering Wheels & Accessories",
      "Automotive"
    ],
    "price": 17.92
  }
}