{
  "website_summaries": [
    {
      "verdict": "Those looking for a high-quality teddy from a reliable brand will enjoy this oversized creation from Vermont Teddy Bears.",
      "pros": [
        "Available for purchase in various sizes",
        "Customers appreciate the extremely soft material, making it the perfect snuggle buddy",
        "Stuffing is 100% recycled"
      ],
      "cons": [
        "A few customers complained that the bear arrived with damage from shipping",
        "Fur can shed"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Five Stars",
      "text": "Very pleased, at least my wife is. I'm a little jealous.",
      "rating": 5.0,
      "verified": true,
      "author": "Furman J Rogers",
      "helpful_votes": 60,
      "publication_date": 20170922
    },
    {
      "title": "It is soft and fuzzy and such a darling face ...",
      "text": "It is soft and fuzzy and such a darling face. Just what I needed. I'm 71 years old, had a stroke last year and lost my little dog at Christmas. I needed something to lift my spirits and the Teddy Bear did it! Thank you Vermont Teddy Bear for making such a loving bear!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 35,
      "publication_date": 20180220
    },
    {
      "title": "Goldy Locks & her bear buddy",
      "text": "I bought Vermont Teddy Bear 4 ft for my 6 yr god daughters birthday,she loved it so much she feel asleep on it ! She says it's soooo soft and huggable !! And I was worried I wouldn't get it in time but it showed up on time on the delivery date.A day before her birthday ! VERY HAPPY !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Deihl",
      "helpful_votes": 33,
      "publication_date": 20170914
    },
    {
      "title": "Perfect Vermont teddy Bear for comfort and love.",
      "text": "This is a cuddly, super soft BIG (but not too big) Vermont Teddy Bear that's fun; it's a feel-good stuffed animal perfect for hugging, resting on, and bringing smiles and comfort. It's not the fancy, articulated version for collectors. I looked at generic versions, but just couldn't do it. Maybe being a former Vermonter and now living in another NE state famous for quality goods has ingrained the idea of buying well-made items worth the (sometimes) extra. In actuality other, generic BIG bears were available and cost a heck of a lot more. The price is very reasonable for product !",
      "rating": 5.0,
      "verified": true,
      "author": "SacoFamily2",
      "helpful_votes": 13,
      "publication_date": 20171106
    },
    {
      "title": "SO CUTE AND COMFORTING",
      "text": "I feel zero shame in loving the hell out of this bear. I'm a tad anxiously attached and it's just nice to lay around with my bear when my man isn't around. I bought the 4 foot bear and for the record the bear fits an XL/2XL shirt, lol. I end up using him like a pillow to lean up against while watching tv. His body proportions are great and as far as I can tell he is built to last **4 month update: My bear friend is going strong. He holds up to lots of loves and hugs, I haven't noticed any lost fur or holes and I would still recommend strongly. So fluffy!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 6,
      "publication_date": 20191025
    },
    {
      "title": "Love him!",
      "text": "Hubby bought him for me for Valentine's day! His name is Charley Bear! Love him!",
      "rating": 5.0,
      "verified": true,
      "author": "myra65",
      "helpful_votes": 21,
      "publication_date": 20170215
    },
    {
      "title": "The fur and threads are not stiched well. The size mentioned is correct.",
      "text": "Just received my teddy bear. The teddy is the perfect size and right size as mentioned in the description. I am happy with the size but the stuffing feels less, as the teddy isnt able to sit without support and some places like hands and legs are havr empty places. Also the fur is coming out. I am going to keep it for a day or two n watch, of it holds its form and stop shedding the fur. If it doesnt I'll return. So its cuddly n soft but not a good quality like I was expecting.",
      "rating": 3.0,
      "verified": true,
      "author": "Pardeep",
      "helpful_votes": 5,
      "publication_date": 20181114
    },
    {
      "title": "The fluffiest!",
      "text": "The best gift ever! He's so fluffy and sweet 😍 He's huge even for a 5'11\" like myself. The brand company seem so nice, even though I didn't have to use them yet, but their \"hospital\" sounds fabulous. I'm so happy I got him!",
      "rating": 5.0,
      "verified": true,
      "author": "Alex ",
      "helpful_votes": 2,
      "publication_date": 20200723
    },
    {
      "title": "Amazingly soft and cuddly",
      "text": "This was the perfect Valentines Day gift for my woman. I am out of the country for a contract and she adores it. Perfect quality and great size (3.5 ft). She never liked teddy bears until this one arrived in perfect shape. It is also so large that her cat and dog leave it alone, they don't dare attack it like every other small stuffed critter she has.",
      "rating": 5.0,
      "verified": true,
      "author": "TJ Arn",
      "helpful_votes": 2,
      "publication_date": 20190219
    },
    {
      "title": "Meet Gus",
      "text": "This very handsome bear is a great snuggle partner and seems to enjoy his new digs! He is very soft and huggable...well worth the purchase price. The Vermont Teddy Bear company has the advantage of being a USA company which give me confidence that the bear does not have any possibly unhealthy components. Gus is dressed up with a hat and tie also available form Amazon and it seems to suit him.",
      "rating": 5.0,
      "verified": true,
      "author": "SenecaSailor",
      "helpful_votes": 0,
      "publication_date": 20200820
    },
    {
      "title": "Worth the comfort of a snuggle when you are lonely",
      "text": "I bought this instead of a body pillow and oh how it has helped my sleep. I work long night shifts in the healthcare field and when I get home I have difficulty relaxing for sleep - first night(well it was day) I snuggled up and almost immediately was asleep - I often also use soothing scents and it’s great. I put an extra large shirt on it to protect it from body oils as much as possible too. Very much worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "RDJ",
      "helpful_votes": 0,
      "publication_date": 20200924
    },
    {
      "title": "I love it!",
      "text": "He’s very cozy and cuddly -please note that I’m 5’6” and 180 lbs. I always drag with me to bed or couch. I can easily lay on him comfortably. The only downside is that if you grabbed him with his fur.. it’s gonna come out very easily.",
      "rating": 4.0,
      "verified": true,
      "author": "Noora",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "A Jack Russell’s best friend!",
      "text": "We LOVE their Teddy Bears! We have a Jack Terrier that needs to play every night before bed. When the weather is too bad for her to play outside which is a lot where we live she plays “attack” the teddy for 20-30 min a night. She has even fallen asleep while playing with her teddy. It’s so big and sturdy that nothing happens to teddy during these play sessions. If she doesn’t get to play with teddy on the days she can’t go outside she is not a happy dog. A great dog lady once told me a tired dog is a happy dog. We also bought a smaller “travel” size teddy for when we are on the road.",
      "rating": 5.0,
      "verified": true,
      "author": "WRPS",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Big soft lovable bear!",
      "text": "Came all squished up in a box and was a little worried but it puffed right up. Gift for my granddaughter a year ago Christmas. She weighs 70 pounds and her dog weighs 80 pounds, they both lay on that big old bear almost every night while relaxing before bed. There is a little hole that started in the seam under it's chin that was very easy to sew right up. Considering the amount of loving that this thing gets I'm surprised it's still in one piece.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill S.",
      "helpful_votes": 0,
      "publication_date": 20200123
    },
    {
      "title": "Second to none. Vermont Teddy Bears delivered.",
      "text": "I would recommend this big ol' bear to anybody. Purchased this as a Valentine's Day present, and she was ecstatic, to say the least! It's absolutely ginormous, and any child or female in your life will be thrilled to receive this as a gift. Outstanding quality and build. Second to none.",
      "rating": 5.0,
      "verified": true,
      "author": "GRaFTON DeRKa-DeRKa",
      "helpful_votes": 2,
      "publication_date": 20190817
    },
    {
      "title": "Tearing me up.",
      "text": "This bear is so huge it's like cuddling with a small person. Put it on the couch next to you and never be lonely. Very soft and very fluffy. My only complaint is there was a tear on the back. It looks to be maybe where they stuff it. I expected perfection from the notorious Vermont Teddy Bear Co. That's why I gave it a 4/5.",
      "rating": 4.0,
      "verified": true,
      "author": "Donnie Ray.",
      "helpful_votes": 5,
      "publication_date": 20170406
    },
    {
      "title": "Disappointed.",
      "text": "I bought this as a Valentines Day Gift. Upon arrival the Bear’s head had a hole on the left side of its neck about 2 inches wide. I sewed it only to discover another hole on the right side of its neck...the thing arrived decapitated pretty much.",
      "rating": 2.0,
      "verified": true,
      "author": "Jose Hernandez",
      "helpful_votes": 4,
      "publication_date": 20180225
    },
    {
      "title": "Snuggable. Huggable. Happy making. Great Size. Wonderful Gift.",
      "text": "I have bought several of these over the years for my adult friends in various mental stages. I have one for myself, too. You can squish, hug, embrace, talk to, toss, dress in hats. Bella Bear is gender fluid. Sometimes she's Bella; sometimes Bear. A true boon during these social distance days. How can one look at that bear face and not smile.",
      "rating": 5.0,
      "verified": true,
      "author": "CF FL",
      "helpful_votes": 0,
      "publication_date": 20201020
    },
    {
      "title": "Perfect!",
      "text": "My wife has a really old teddy bear she got from her grandmother nearly 25 years ago, and you can tell the poor thing was very loved throughout my wife’s childhood. She had mentioned how soft it used to be. Well I got this as a replacement bear since it’s the same company that made the bear her grandmother gave her, and she’s totally in love with it! I got the 3 foot bear, and it’s actually a lot bigger than her original bear (oops) but my wife loves it none the less. I decided to also get her a 6 foot one as a surprise!",
      "rating": 5.0,
      "verified": true,
      "author": "S.F.",
      "helpful_votes": 0,
      "publication_date": 20200428
    },
    {
      "title": "Fantastic bear!",
      "text": "This is the most beautiful \"stuffed animal\" I've ever seen. It is soft, well-made, and the company is wonderful. I bought a 4ft and a 6ft bear, and both were shipped quickly, arrived in perfect condition, and have held up with kids laying on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen",
      "helpful_votes": 2,
      "publication_date": 20190416
    },
    {
      "title": "Really fluffy",
      "text": "very fluffy and soft. came in a very sturdy box and the big guy was folded in half but he sprang out of box to his big fluffy self! At first I thought the $95 was a lot of $ for a bear but the quality of it was worth it. He will be around for along time!",
      "rating": 5.0,
      "verified": true,
      "author": "MeMe",
      "helpful_votes": 6,
      "publication_date": 20170220
    },
    {
      "title": "The best!!",
      "text": "Bought as a gift for my nephew’s 2nd birthday. He effin’ LOVES this thing. My sister says every morning he wakes up and first thing he want to do is play with Teddy. He abuses the daylights from thing. Wrestles with it, body slams it, drags it from room to room (takes all of his strength). It’s held up really well. I was a little nervous, as the instructions say to not pull on the limbs or ears because they may rip, but nobody told him that and Teddy is doing just fine. 10/10!! Best gift for a 2 year old you can find.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "American-Made Quality!",
      "text": "I bought an American-made teddy bear because I wanted great quality and no weird smells! Vermont Teddy Bear did not disappoint! Our son loves this bear and we know he will get years out of it. The cute care instructions are a plus. I have friends who have bought giant teddy bears made in China and when they ripped, they found recycled stuffed animals inside as part of the stuffing!! I am so glad we bought from this company.",
      "rating": 5.0,
      "verified": true,
      "author": "AVG",
      "helpful_votes": 0,
      "publication_date": 20200625
    },
    {
      "title": "Wonderful! Except she's got some hard furs",
      "text": "She is wonderful! So soft that I can lay on her all day long! The only reason I give 4 stars is because few of her furs fall on the floor, and some have hard ends attached to the main body, which make me want to pull them away from her... but the hard furs mostly are on the edge of her feet and I can find less than 10 throughout her soft body.",
      "rating": 4.0,
      "verified": true,
      "author": "Sharon Young",
      "helpful_votes": 4,
      "publication_date": 20170825
    },
    {
      "title": "Expensive but good quality and no off gassing.",
      "text": "Lovely, soft and odor free...no off gassing like some stuffed products. And he is BIG. Kids love him.",
      "rating": 5.0,
      "verified": true,
      "author": "Weema",
      "helpful_votes": 4,
      "publication_date": 20180116
    },
    {
      "title": "Soft, cute and addictive teddy.",
      "text": "The product is overall good. It is soft and very comfortable for cuddling. But the order I received had a big hole on the right side of the neck. Disappointed. Update: I got a replacement from the seller and the new teddy is great! I love it. Great customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "Parveen Sultana",
      "helpful_votes": 0,
      "publication_date": 20200605
    },
    {
      "title": "This bear looks good only in laying down position.",
      "text": "Cons: 1. Big legs and spread apart 2. Head is limp, no support. 3. The quality is questionable. Pros: 1. Keeps us company.",
      "rating": 2.0,
      "verified": true,
      "author": "Tievoli",
      "helpful_votes": 2,
      "publication_date": 20180918
    },
    {
      "title": "Lovely and a bit creepy",
      "text": "Super soft bear that my kids love. Beware, though, his long legs make him a bit creepy. One moment he’s sitting pleasantly on the couch, the next he’s slouched over with his head buried between his legs, or on his back with his legs dangling every which way. Other bears don’t do this.",
      "rating": 4.0,
      "verified": true,
      "author": "JJB",
      "helpful_votes": 0,
      "publication_date": 20190620
    },
    {
      "title": "“Best bear ever”-I’m 70 years old!",
      "text": "Love my Boo...my husband is a hunter so I have many nights alone, and now I’m not❣️ Absolutely perfect (lifetime guaranteed, machine-washable) and made for pet lovers who rent NO PETS ALLOWED homes.",
      "rating": 5.0,
      "verified": true,
      "author": "jonni",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Soft and Snuggly",
      "text": "This bear was purchased as a gift for my daughter. She loved it and immediately snuggled up with it, exclaiming it was the best present ever. Highly recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Melinda Atwell",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "Great Bear For All Ages",
      "text": "With the lose of my girls Dad, I wanted to give them something BIG and HUGGABLE to have . My girls are 15 and 13 . Acted like little kids when they pulled them out of the box. I'm SO HAPPY with my decision to get the bears from you all. Everything is great about them. No Complaints. Thank You Vermont Teddy Bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 5,
      "publication_date": 20170227
    },
    {
      "title": "Great surprise gift",
      "text": "Husband got me this for Valentines Day. Great gift surprise. So soft. Sits at the table or on the bed. Anywhere it sits looks cute. Lifetime warranty is a plus. Well made. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "weezie8101076",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "We are super pleased with this purchase and couldn't have been happier ...",
      "text": "Bought my son this giant teddy bear for his 8th birthday, and he absolutely loves it! It is comfy, warm, and everything a giant stuffed bear should be! We are super pleased with this purchase and couldn't have been happier about the price!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Not Happy",
      "text": "It’s very nice and fluffy teddy bear. But it’s neck is very floppy and always falls down. I should have returned it at first place but my daughter loved the feel. I would not recommend buying this product since there are many similar good products in market.",
      "rating": 2.0,
      "verified": true,
      "author": "Kedar Sharbidre",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Good proportions",
      "text": "I’ve bought these giant teddy bears before, and each time it’s been one from China that’s far bigger height wise but has absurdly long legs and looks horrible. Finally decided to spend a little more on a bear that was a bit smaller from a proper brand, and it’s definitely worth it. The bear looks and feels good, with properly sized legs.",
      "rating": 5.0,
      "verified": true,
      "author": "justin r.",
      "helpful_votes": 0,
      "publication_date": 20190224
    },
    {
      "title": "Perfect for the empty side of the bed",
      "text": "Gifted this to my mom to use like a body pillow. After we lost my dad last year, she’s had a difficult time sleeping in an empty bed. The size and weight of this bear fits perfectly on the empty side of the bed. He’s soft, cuddly and helps my mom feel not quite so alone at night.",
      "rating": 5.0,
      "verified": true,
      "author": "Keri Grier",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "perfectly safe and made in the USA!",
      "text": "I have to admit I bought these for my two fur babies( pup)s who love to sleep with giant bears ... they love them, they don't tear them up like they do their smaller toys... I think the size helps them feel comforted like a bed! I am very happy with the Teddy bear and so are my Furbabies! NOt so worried about the material as I am most dog toys.",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Ridgeway",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great for BFF",
      "text": "Got this for my best friend as a surprise, she had no idea at all it was coming nor that it was from me! And she absolutely loves it 😊",
      "rating": 5.0,
      "verified": true,
      "author": "chuckles",
      "helpful_votes": 0,
      "publication_date": 20200603
    },
    {
      "title": "Super soft and super big",
      "text": "This bear is incredible. Not only is it huge, but it’s so soft and cuddly. My son loves it. And the box was so fun to open!",
      "rating": 5.0,
      "verified": true,
      "author": "A. Lieby",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "... decide if I should send him back he is Perfect other than a lack of stuffing in his stomach ...",
      "text": "I can’t decide if I should send him back he is Perfect other than a lack of stuffing in his stomach area that creates a hole I’ve fluffed and fluffed him out but it won’t go away it really isn’t that bad but I wish she or he was perfect",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Watkins",
      "helpful_votes": 2,
      "publication_date": 20171119
    },
    {
      "title": "New snuggle buddy!",
      "text": "I did not want a cheap looking stuffed bear, and this one was PERFECT! He's good-looking and plump. My 16 year old daughter loves him. The bear looks attractive and decorative on her white comforter and is her new nighttime snuggle buddy. Only drawback is he's too big to take when she spends the night with a friend, haha.",
      "rating": 5.0,
      "verified": true,
      "author": "Rhonda J.",
      "helpful_votes": 4,
      "publication_date": 20170227
    },
    {
      "title": "we are so glad we made the purchase",
      "text": "Our two grand children 18 months and 3 were speechless when the bear arrived. they play with it, lay on it sleep on it and drag it around the house it is soft, very well made, safe for children of all ages, we are so glad we made the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "james b king",
      "helpful_votes": 9,
      "publication_date": 20160310
    },
    {
      "title": "Big bear is adorable, but not as high",
      "text": "Big bear is adorable, but not as high, quality, as expected. There was a defect on the back/neck seam of the bear & the store emailed me quickly to offer a replacement, so I was very happy about that.",
      "rating": 4.0,
      "verified": true,
      "author": "Melodie Chisteckoff",
      "helpful_votes": 8,
      "publication_date": 20150406
    },
    {
      "title": "The best part is you don't have to feed or walk it",
      "text": "What more can a single guy/gal ask for. It's like having a best friend for all your secrets and doesn't need a lot of care. No food or walks or clean up after. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "A Peterson",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Awesome Huge bear!",
      "text": "Awesome bear for 1 year old birthdays!! Very large and cuddley.",
      "rating": 5.0,
      "verified": true,
      "author": "None",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Gift for wife",
      "text": "Bought this to sit in the rocker in my wife's office at her work. Looks cute and fitted into rocker nicely",
      "rating": 5.0,
      "verified": true,
      "author": "Al R.",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Finally a perfect teddy bear",
      "text": "real feel of an friendly animal big enough soft enough for an amazing hug pet warm.teddy will be with our family for many decades",
      "rating": 5.0,
      "verified": true,
      "author": "realdeal57",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Luxurious/soft",
      "text": "Luxurious, soft. No chemical smell. Looks/feels expensive. Great to cuddle with",
      "rating": 5.0,
      "verified": true,
      "author": "Amanda",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "Love this bear which we purchased for our 7 year ...",
      "text": "Love this bear which we purchased for our 7 year old granddaughter for Christmas. The only reason I didn't give it 5 stars is because there was not as much stuffing in the belly as I expected, or maybe it has migrated to the legs. She sleeps on it and sits on it for school and to watch TV and the belly is not as full as it was when we first got it. Otherwise very durable and well made.",
      "rating": 4.0,
      "verified": true,
      "author": "CB",
      "helpful_votes": 2,
      "publication_date": 20170321
    },
    {
      "title": "Great bear",
      "text": "Love this bear. Vermont bears always come through with a quality product. Couldn’t be happier about it as it was a gift for friends with a new baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Christa",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Survived a wresting match with the 7yr old",
      "text": "He is soft, his fur was super soft, and my nephew helped fluff him up the day of arrival by repeatedly using him as a landing pad and wrestling partner. Such a huggable, tackleable bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "For the Tim Treadwell in all of us",
      "text": "The bear is big. The bear is soft. The price was right. The bear is named Gus now thanks to our cute grandkid. The grandkid is happy. We are happy. All is well.",
      "rating": 5.0,
      "verified": true,
      "author": "ThunderBumper",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Grand daughters loved ths Valentine Day gift",
      "text": "My two grand daughters, 10 and almost 2, were completely delighted by this 4 foot bear. The almost 2 year old had been fussy with her recent teething, but her joy over this surprise has made my daughter smile too. Now I'm enjoying being \"The best Poppy ever.\" Grand parents take notice and enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "5kman",
      "helpful_votes": 0,
      "publication_date": 20190222
    },
    {
      "title": "Great!",
      "text": "Huge, fluffy, lots of stuffing in this great bear! HIGHLY RECOMMEND!",
      "rating": 5.0,
      "verified": true,
      "author": "DEM",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Best bear ever",
      "text": "The bear arrived clean, soft, and well stuffed. I’ve had bears that come half stuffed or have a chemical odor but neither were problems with this company. The bear made a very nice gift and made someone really happy.",
      "rating": 5.0,
      "verified": true,
      "author": "DD",
      "helpful_votes": 0,
      "publication_date": 20200212
    },
    {
      "title": "Loves it",
      "text": "My son who has Fragile X loves laying with the bear!",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Love",
      "text": "Love! Fits in front loader. Daughter uses as a pillow. Durable and soft!",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Ahne",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "Great bear!!",
      "text": "Love him!!! Just the right size. Super soft and cuddly. Needed a little more stuffing in his head but otherwise fantastic",
      "rating": 5.0,
      "verified": true,
      "author": "DS",
      "helpful_votes": 0,
      "publication_date": 20200301
    },
    {
      "title": "Look no more this is an awesome teddy bear",
      "text": "Wow what a nice product !!! I couldn’t believe how happy this bear made someone. Ultimate in teddy bears !!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bill ",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Excellent customer service",
      "text": "I LOVE this bear and so does my daughter (and dog) ! I love that this product has a lifetime guarantee, my dog ripped a hole in my daughter's bear and I contacted the seller and they are sending a replacement! Soo grateful! Thank you, excellent customer service with same or next day response rate.",
      "rating": 5.0,
      "verified": true,
      "author": "Nyre Treblot",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Good gift",
      "text": "Worked really well as a gift, Happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Hare",
      "helpful_votes": 0,
      "publication_date": 20200909
    },
    {
      "title": "Great Bear",
      "text": "Really a great bear, gave to my girlfriend but she dumped me a couple of weeks later and kept the bear",
      "rating": 5.0,
      "verified": true,
      "author": "Jbutler53",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Super Gift",
      "text": "She loves it. Unfortunately, it occurs the only chair in the bedroom and scares me occasionally when I think someone is there.",
      "rating": 5.0,
      "verified": true,
      "author": "Noblenorm",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "PERFECT TEDDY BEAR!!",
      "text": "So cute, soft and cuddly I sleep with it on my bed every night! Even my cats love Teddy! They sleep in between his legs at night. Very Very Satisfied with purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Suzy",
      "helpful_votes": 0,
      "publication_date": 20180429
    },
    {
      "title": "Very soft and cuddly",
      "text": "My son loves it. Nice and big and very soft and made of very nice material. Every child needs one!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "BUYER BEWARE!",
      "text": "BUYER BEWARE: the box says teddy bear on the outside. If you’re trying to surprise someone send it somewhere else. Other than that, great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Vanessa Pons ",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Big Bear",
      "text": "A little smaller than I expected, but pretty cool. Will make a great gift.",
      "rating": 4.0,
      "verified": true,
      "author": "Duane O. Abbott",
      "helpful_votes": 2,
      "publication_date": 20171008
    },
    {
      "title": "A bear to love !",
      "text": "I loved the packaging, simple and fun, and my grandson drags it all over the place. He named him Hank and we put a red bandana on Hank. Now, the three siblings gotta have one too ! Nana is a RockStar ! Thank you Vermont Bears for RockStar Status. Hank is sturdy, plush and obviously loved !",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Great Teddy Bear",
      "text": "We got this for my daughter on her 10th bday. It’s her FAVORITE gift. It’s extremely soft and plush. Her friends love it as well and some have fallen asleep cuddling it when they are sleeping over. Wonderful product.",
      "rating": 5.0,
      "verified": true,
      "author": "Monica C.",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Very soft and fluffy",
      "text": "I ordered this for my mother’s 70th birthday!!! She ❤️❤️❤️ it !!! It’s so cozy and huge!!!! I would definitely recommend this item!!",
      "rating": 5.0,
      "verified": true,
      "author": "Bubble ",
      "helpful_votes": 0,
      "publication_date": 20200819
    },
    {
      "title": "Great quality and great packaging!!!",
      "text": "I ordered the Vermont Teddy Bear -Big Love and it was just before Christmas. The bear arrived on Christmas Eve and it was perfect! The packaging was very well done and the bear is incredibly soft and wonderful!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Linda",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "He is a great pillow to lay on when she has a movie ...",
      "text": "I bought the three foot brown Vermony Teddy Bear for my four and a half year old granddaughter. She wanted a teddy bear as big as she is. She loves her bear and tucks him in her bed at night. He is a great pillow to lay on when she has a movie night at home. Great choice!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerianne Lackey",
      "helpful_votes": 4,
      "publication_date": 20161227
    },
    {
      "title": "gift",
      "text": "It is the gift for my girl friend. She pretty like it",
      "rating": 5.0,
      "verified": true,
      "author": "Teddywang1992",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Nice size bear",
      "text": "Nice size bear, but I only had it 2 weeks and there was a rip on the leg. The hair also sheds. Cost way to much for that to happen so soon.",
      "rating": 3.0,
      "verified": true,
      "author": "Carinthia Miller",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "A friend for life!",
      "text": "OMG! He is huge and soft and well made and what's not to love?",
      "rating": 5.0,
      "verified": true,
      "author": "1Shopper",
      "helpful_votes": 2,
      "publication_date": 20170814
    },
    {
      "title": "Nice gift",
      "text": "This was a gift for my grandson during the pandemic. He loves it. Soft and cuddly and comforting.",
      "rating": 5.0,
      "verified": true,
      "author": "Helen Nashawaty",
      "helpful_votes": 0,
      "publication_date": 20200420
    },
    {
      "title": "Lovely Huggable Bear",
      "text": "Got this for my son's first birthday and he loves it! The Made In USA tag also makes you feel proud of buying something valuable!",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Hospital Companion  Raises Spirits",
      "text": "It was the perfect gift for our friend in the hospital. She could not have flowers due to her condition. Excellent quality! don't be fooled by cheap knockoffs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20170421
    },
    {
      "title": "I love my hunka bear !!!!! PERFECT!!!!!!",
      "text": "I love my hunka bear ! Perfect for my baby shower theme which is teddy bears ! He will be the center of attention lol ! He’s so big n soft . So worth it !",
      "rating": 5.0,
      "verified": true,
      "author": "Loveely.a",
      "helpful_votes": 0,
      "publication_date": 20200222
    },
    {
      "title": "Perfect",
      "text": "I love this bear! I bought it for my friend fir valentines, and I'm sure she's going to love. I was worried about the stuffing being smashed in the packaging making the pair lumpy or flat, but luckily this was not the case. It came in a box just as big as the bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20170211
    },
    {
      "title": "It is perfect.",
      "text": "Just as I expected: larga, soft, cuddly, and my granddaughter loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "lynne williams",
      "helpful_votes": 0,
      "publication_date": 20191126
    },
    {
      "title": "Not as described, not worth the money. Do not purchase",
      "text": "This bear is not as described. It’s small ! Like very small and not worth the money at all. It looks absolutely positively NOTHING like the picture. I’m so mad I wasted my money on this bs. DO NOT BUY ITS A HUGE SCAM",
      "rating": 1.0,
      "verified": true,
      "author": "Jasmine",
      "helpful_votes": 0,
      "publication_date": 20200207
    },
    {
      "title": "Big, soft and cuddly",
      "text": "Great big soft cuddly bear! Very well made as all Vermont Teddy Bears are",
      "rating": 5.0,
      "verified": true,
      "author": "Ursula",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "YOU GET WHAT YOU PAY FOR",
      "text": "I like this Teddy Bear, there is some good build quality I would give it 5 stars but there is one thing that this bear lacks and it is the stuffing maybe it could just be MY bear but mine seems a little under stuffed and it is saggy",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200324
    },
    {
      "title": "He was perfect. So soft & cuddly",
      "text": "He was perfect. So soft & cuddly, I wanted to keep him. Prompt arrival (time was a factor) & excellent packaging. Totally encased in protective plastic inside the box.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynnette Betz",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "On my Wish List!",
      "text": "OMG! Purchased for our grandson, now I want one for myself!...",
      "rating": 5.0,
      "verified": true,
      "author": "Ms. Marta",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "I bought it for my 2 year old great nephew's birthday since he loved mine sooooo much",
      "text": "I already have one of these. I bought it for my 2 year old great nephew's birthday since he loved mine sooooo much. He likes to run and jump on the bear. He loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Cjk",
      "helpful_votes": 0,
      "publication_date": 20170307
    },
    {
      "title": "why bother",
      "text": "Don't get it for her. She will cheat on you. Just save your money. The stitching was great and it was soft.",
      "rating": 4.0,
      "verified": true,
      "author": "Aidan",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "cozy and soft",
      "text": "Me and my 3 years old daughter loved it!! Cozy and soft 🥰😍",
      "rating": 5.0,
      "verified": true,
      "author": "Malka",
      "helpful_votes": 0,
      "publication_date": 20200823
    },
    {
      "title": "GREAT STUFFED BEAR",
      "text": "GREAT STUFFED BEAR, IT IS PERFECT FOR ANYONE WHO LOVES ANIMALS AND IT KEEPS YOU WARM IN THE WINTER -",
      "rating": 5.0,
      "verified": true,
      "author": "Marion Truglio",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Adorable",
      "text": "My girls love this bear and I appreciate the lifetime warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190311
    },
    {
      "title": "Great Gift. Wife loves it!",
      "text": "Item was a gift and is perfect. Right size, right price. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "hyck",
      "helpful_votes": 0,
      "publication_date": 20191210
    },
    {
      "title": "Very pleased with my purchase",
      "text": "This was a Christmas present & my daughter loves it. Very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "karen",
      "helpful_votes": 0,
      "publication_date": 20170703
    },
    {
      "title": "Good product.",
      "text": "Great teddy bear that my sister loves. But I wish I would have purchased the 3.5 or 4 ft bear.",
      "rating": 5.0,
      "verified": true,
      "author": "Brunk",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Five Stars",
      "text": "Fantastic Teddy Bear, Made in America Quality! Vermont Teddy Bears are the best! It even arrive 3 days early!",
      "rating": 5.0,
      "verified": true,
      "author": "mmgyver",
      "helpful_votes": 2,
      "publication_date": 20170215
    },
    {
      "title": "It's huge!",
      "text": "Awesome! My wife was said she missed when I would buy her a teddy bear as a gift when we were younger. So I got her the biggest one I could find! The look on her face was priceless!! She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "Jason T.",
      "helpful_votes": 8,
      "publication_date": 20140403
    },
    {
      "title": "Not recommended",
      "text": "It’s a cute bear but it’s extremly soft, it doesn’t have near enough stuffing. I’m still contemplating if to return it and try find a better one",
      "rating": 1.0,
      "verified": true,
      "author": "Andrea Abeli",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Poor Quality Bear from Vermont Teddy Bear",
      "text": "The bear fur seemed matted not real fluffy and he seemed to not quite have enough stuffing. After giving it to my grandson who loved it, we noticed the back was not stitched shut. Very disappointed in the quality of the Vermont Teddy Bear. Due to lack of support from either Vermont Teddy Bear or Amazon we are having it stitched and walking away. I am having more and more problems with items I order from Amazon.",
      "rating": 2.0,
      "verified": true,
      "author": "ROBERT L   SNYDER",
      "helpful_votes": 7,
      "publication_date": 20161229
    },
    {
      "title": "Quality and worth the money.",
      "text": "Our granddaughter loves hers.she carries it everywhere.it kinda heavy she said and a bed hog.lol.she is five.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent Patterson",
      "helpful_votes": 0,
      "publication_date": 20200627
    },
    {
      "title": "Five Stars",
      "text": "girlfriend like it very much. but we broke up. had nice time with her tho",
      "rating": 5.0,
      "verified": true,
      "author": "gc",
      "helpful_votes": 0,
      "publication_date": 20180717
    }
  ],
  "product_meta": {
    "title": "Vermont Teddy Bear Giant Teddy Bear - Big Teddy Bear, 4 Foot",
    "rating": 4.7,
    "feature_bullets": [
      "SOFT FUR MAKES THE BEST BEAR HUGS - Because we make our big fluffy Teddy Bears with the highest-quality fur, there's no shedding or clumps; 4-foot brown huge Teddy Bear is soft, smooth and oh-so squeezable, and the large size is perfect for cuddling",
      "HIGH-QUALITY CONSTRUCTION - A Bear stuffed animal you can feel good about; Our 4 ft Teddy Bear is stuffed and back-stitched with love in Vermont, USA, using 100% recycled stuffing and soft fur, making it the perfect gift or children's toy",
      "LIFETIME GUARANTEE - The second your large Bear comes out of the box, it's guaranteed for life, meaning any damage can be mended at the bear hospital in Vermont; If it can't, a new Bear will be sent along with condolences-and a new lifetime guarantee",
      "A BEST FRIEND WITH PERSONALITY - Gigantic soft brown Teddy Bear has an adorable expression, a unique mix of curiosity, mischief and fun that brings a lifetime of joy; Huge, fun Teddy Bear is a thoughtful gift for the wife, daughter or girlfriend",
      "OUR CUSTOMERS LOVE A BIG SQUEEZE – \"It's so soft and works well as a backrest pillow!\" \"Cute, soft and cuddly; I sleep with it every night!\" \"Super soft and a perfect size to cuddle up to!\" \"My daughter loves it-very pleased with my purchase"
    ],
    "specifications": {
      "Product Dimensions": "26 x 19.7 x 17.3 inches",
      "Item Weight": "6.57 pounds",
      "ASIN": "B00GVDIVEC",
      "Manufacturer recommended age": "0 months and up",
      "Best Sellers Rank": "#15,768 in Toys & Games",
      "Customer Reviews": "4.7 out of 5 stars661 ratings4.7 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "0 - 0 years",
      "Manufacturer": "Vermont Teddy Bear"
    },
    "categories": [
      "Toys & Games",
      "Stuffed Animals & Plush Toys",
      "Stuffed Animals & Teddy Bears"
    ],
    "price": 90.99
  }
}