{
  "website_summaries": [
    {
      "verdict": "A powerful, 7-ton log splitter that packs a surprising amount of power for a 2-HP motor.",
      "pros": [
        "This powerful unit is compact and quiet enough to be used indoors, if needed",
        "The smooth automatic ram return allows you to work without interruptions",
        "You can quickly upgrade your log splitter by purchasing a 4-way cross wedge that can cut your work time in half"
      ],
      "cons": [
        "Rarely, a log might slide up and off the unit while splitting, but as long as you are paying attention, it is more of a frustration than a safety issue"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Worth considering if you want a 7-ton electric splitter that is easy to use; but it's a bit lacking in power compared to similar gas-powered options.",
      "pros": [
        "An electric-powered model that is easy to use one-handed",
        "Construction and tires are sturdy",
        "Customer service is supportive"
      ],
      "cons": [
        "Some reports of fluid leaks",
        "It may struggle when it come to slitting some types of hardwood"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Build a bench to put it on so you have a 36” working height.",
      "text": "Amazing pocket splitter for home use. I’ve been using gas engine splitters for 40 years and all are noisy, heavy, polluting, expensive...etc. I now use about one cord of wood per year. I like it split extra small but always have to re-split about a fourth of the load, which is a pain. I’m 70 and my shoulders and back can’t take hand splitting any more...so this splitter is just the ticket. I built a rugged little table on casters to place it at 36” working height and it’s perfect. I leave in on the breezeway next to the stacked wood and re-split as needed. It has plenty of power, is quiet and non-polluting. I highly recommend this splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "DN",
      "helpful_votes": 27,
      "publication_date": 20180205
    },
    {
      "title": "Return process was best part of this order",
      "text": "I was excited to buy this as a Christmas present for my husband. We had a pile of oak logs that couldn't wait, and neither could i. I made him open it early just because i was so excited. My excitement fizzled when we plugged it in and it struggled on the easiest of logs. Wha Wha Wha. So disappointing. However, my return process was very easy and didn't cost me anything as the product was defective. Got my credit in around 7 days. All good, but would not recommend.",
      "rating": 1.0,
      "verified": true,
      "author": "sarry abfalter",
      "helpful_votes": 5,
      "publication_date": 20190222
    },
    {
      "title": "Splitting wood like a (wait for it . . . ) BOSS",
      "text": "We've split at least three to four cord of fresh cut wood (pine and fir) this fall using our new Boss Wood Splitter. We chose this one based on its splitting power (7 ton). Although a few other reviewers reported minor problems with their machines, we have had none at all. It met our expectations in every way -- Although the instructions specifically say that for safety sake, only one person should be operating the splitting process, we found it much more efficient to have one person run the lever that puts the splitting maul into motion and have another person lifting the logs into place. We love our Boss and highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara A Smith",
      "helpful_votes": 0,
      "publication_date": 20191122
    },
    {
      "title": "A heavy but hard working splitter.",
      "text": "I'm 73, dealing with cancer and arthritis, but we live on a wooded lot and access to quite a bit of timber. I bought this because of the positive reviews and just tried it out today. It pushed through all the wood like a hot knife through butter. My neighbor, who pushed me to try it out for the first time was impressed enough that he was going home to order one. I must admit to feeling sorry for the UPS driver who had to dig this out from the bottom of a loaded truck - we couldn't have loaded this item from a store into our car, so I'm grateful for the Amazon delivery service.",
      "rating": 5.0,
      "verified": true,
      "author": "John W. Sheridan",
      "helpful_votes": 5,
      "publication_date": 20180510
    },
    {
      "title": "I bought this to simplify my life...and it is working",
      "text": "I should have bought this years ago. So much easier than using an axe. It arrived on time and in the original factory box. The box was beat up and the Styrofoam packing inside the box was damaged but the log splitter is OK. IMHO, the factory box should have been repackaged into a slightly larger box with appropriate packing material. This is a very heavy unit to ship in original package. That said, it arrived fully assembled except for the operating handle, and that took maybe 30 seconds to install. The unit's wheels are large enough that it will roll on rough terrain, and the unit works fine. Yes, I'd do it again.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Good Product",
      "text": "I really like this product. It sure beats using an axe, and does not take up all the room as the big ones do. The one negative is that all the action happens very close to the ground, so you find yourself constantly bending over while handling heavy lumber. I have not yet explored incorporating some type of low seating option to the splitting process, but may give that a try. Otherwise, it is worth the money, for sure!",
      "rating": 4.0,
      "verified": true,
      "author": "JD18960",
      "helpful_votes": 10,
      "publication_date": 20161126
    },
    {
      "title": "Good for small. dry otherwise easily splittable wood",
      "text": "Good for small. dry otherwise easily splittable wood. Cherry - not so much. Elm - better be dry. Ash - no problem. As an introduction to automatic wood splitters this is good. Like a 14\" beginner chainsaw. If the wood was pretty dry: Cherry it would split up to 16\" round no issue. Elm 18\", Ash - 20-22\". Otherwise for larger or damp pieces (the ones I needed a break from maul splitting) it was a frustrating process of turn the machine on, pull lever, wood gets stuck, unstick wood, turn machine off, flip wood, turn machine on and repeat 2 dozen times or more before I got a split.",
      "rating": 3.0,
      "verified": true,
      "author": "1magine",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Very good choice !",
      "text": "I was puzeled by the low pwer advertised and the easy of use in comparison with what my friends told me about what they had bought but, after using this log splitter for a month I am verry happy with my choice. It can handle easily larger logs than the manufacturer recomends , but make sure you cut them shorther, no more than 16 in ! You will be surprised how good it is working ! I will recomendit for the mid range user, it will serve you well. The warranty is good , so if it fails I will update my review.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Stefan",
      "helpful_votes": 3,
      "publication_date": 20190111
    },
    {
      "title": "Unit works great. Only issue is I busted the handle off ...",
      "text": "Unit works great. Only issue is I busted the handle off when I tilted it up to move (supposed to remove handle before doing that). Perhaps Boss should have design where you don't have to remove the handle and still be able to tilt upright. Will order new handle part number 520-401 to replace. Great product other wise. Definitely would recommend buying the extension legs for ease of operation. Would recommend passing on the 4 way attachment for splitting as it has a tendency to ride up and come off. Enjoy Brian",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20180117
    },
    {
      "title": "Not a good option, too flimsy construction",
      "text": "I bought this in anticipation of making short work of splitting firewood for our firepit and fireplace. I had to wait a year before using it due to a back injury. When I finally got it out to use on a new batch of wood the mounts bent after a few pieces of wood and now it won't even split pine, let alone oak or hickory.",
      "rating": 1.0,
      "verified": true,
      "author": "Taz",
      "helpful_votes": 4,
      "publication_date": 20170402
    },
    {
      "title": "excellent machine/top notch service",
      "text": "Splitter arrived with busted wheel. I contacted company and was asked one question: what is your address? New wheel arrived at my doorstep within 3 business days. I have used the machine for about 20 hours. Large red oak rounds, anywhere from 15-20 inch diameter, cut down about 2 months ago. Dense and stringy stuff. The Boss was surprisingly effective. So far I've had one piece it just wouldn't split--about 16 inches across, 18 inches tall--with a triple knot in the middle. A mean piece of wood. Eventually, I tossed it to the side. The machine handled every other piece pretty easily. I dealt with Danny in Service. So machine A Service A+",
      "rating": 5.0,
      "verified": true,
      "author": "oola",
      "helpful_votes": 0,
      "publication_date": 20191102
    },
    {
      "title": "Really good moderate duty splitter.",
      "text": "I got this yesterday and used it all afternoon today. It is for me, every but as good as advertised. I have split a large number of black cherry log pieces with a few other pine logs and some other things. No problems with the splitting, it has worked great. A few reviewers have commented that it is lower and not very ergonomical, which is fair. The product video even shows it being used up on a table. I put it in my trailer, cub cadet hauler and it works very well. It could have been designed a little taller. I am pleased to have the capability without adding another gas engine to my garage.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Gannon",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "works great, long cycle time",
      "text": "This is a remarkable tool, and really gets the job done for the homeowner. The only reason I didn't give it 5 stars is because the cycle time for each split is pretty long. The wedge probably takes 10-15 seconds to travel the length of the bed and make the split. That's an eternity when you're splitting a couple cords of wood. Other than that, it works great ... and we've put some BIG logs on this!",
      "rating": 4.0,
      "verified": true,
      "author": "Tommy in MA",
      "helpful_votes": 5,
      "publication_date": 20160423
    },
    {
      "title": "VERY WEAK AND LIMITED, TORQUE AND SAFETY ISSUES",
      "text": "I was very excited to get at first, til i saw how small it actual was. Wood cannot be the least bit wet inside. It has a safety function that shuts controls off if wood does not get split and it stalls. Pusher will come back but will not engauge without turning off power. In a perfect world, wood is all cut straight and totally dry. This is a very finicky splitter. Inside maple is usual a core of decaying wood, which this splitter hates. NOT ENOUGH TORQUE TO SPLIT WOOD FOR ALOT OF ISSUES.",
      "rating": 3.0,
      "verified": true,
      "author": "On the Road again",
      "helpful_votes": 0,
      "publication_date": 20200830
    },
    {
      "title": "Very satisfied",
      "text": "Works good, even on green oak. Ours came with a bent wheel(a common complaint.) Amazon could not just send the wheel, they would have sent an entire new splitter and we would have either sent this one back or taken the wheel off the new one and sent the other back. This thing is heavy, very heavy. Rather than go through all that, we accepted a generous discount/credit (imagine the money they save on shipping it here and back.) We will buy a set of wheels if we find it to be a problem.",
      "rating": 4.0,
      "verified": true,
      "author": "LCPIKE",
      "helpful_votes": 0,
      "publication_date": 20191010
    },
    {
      "title": "Timmmbbbeeer!!!!",
      "text": "Will chop wood like a crazed monkey eats bananas! Very impressed with how well this splits rounds I've split logs way oversized for this electric splitter you have to work the sides on the big ones but anything under 12\" diameter is headed to the furnace! Built very well! Only dislike is that when you get it stuck in a large log it will auto retract and needs to be restarted to operate again",
      "rating": 4.0,
      "verified": true,
      "author": "Morgan J. Murphy",
      "helpful_votes": 8,
      "publication_date": 20160922
    },
    {
      "title": "Log splitter does an excellent job. While it is advertised to split logs ...",
      "text": "Log splitter does an excellent job. While it is advertised to split logs up to 10 inches in diameter, I have easily split white pine logs as big as 22 inches in diameter. The only reason for the 4 stars is that the unit is really unsteady if you have to pull it along uneven ground because of the narrowly spaced small wheels. It makes it difficult to move because of the overall weight.",
      "rating": 4.0,
      "verified": true,
      "author": "Bob S.",
      "helpful_votes": 3,
      "publication_date": 20170531
    },
    {
      "title": "BEST Investment we've made in a long time!!!",
      "text": "My husband wasn't so sure we should put a lot of money into a log-splitter...I mean he's split our wood for how many years? A lot!! But I wanted to make things easier for him, so I pushed to get this. He has NOT STOPPED THANKING ME FOR THE PAST FOUR MONTHS SINCE WE GOT THIS!! He loves splitting wood, and it is so easy to use, and gets the job done without any problem!! It has been worth every penny...even HE thinks so!!",
      "rating": 5.0,
      "verified": true,
      "author": "Breadqueen",
      "helpful_votes": 2,
      "publication_date": 20180202
    },
    {
      "title": "Simple easy to use...worth the money spent.",
      "text": "Arrived on time and packaged well. First time user of a log splitter and electric, but it's simple to use. Had to hook it up to my gas generator due to the house fuse being blown everytime I turned it on, maybe due to my long extension cord. But anyway it ran fine and split the size wood recommended to use without any problems. I expect alot of usage due to the many limbs fallen by Hurricane Laura, we thank you come the cold season.",
      "rating": 5.0,
      "verified": true,
      "author": "BrashNaziReviewer....",
      "helpful_votes": 0,
      "publication_date": 20200917
    },
    {
      "title": "Checked the fluid level which was fine. Referred to owners manual",
      "text": "Worked well for a total of maybe 20 hours when the hydraulics started running extremely slow. Checked the fluid level which was fine. Referred to owners manual. Yes we had loosened the wing nut and run it through the cycle several times. Leveling of machine was correct. No leaks and the right gauge of electrical cord. For no apparent reason it just quit working. I would not buy this splitter again.",
      "rating": 2.0,
      "verified": true,
      "author": "Jane LaRock",
      "helpful_votes": 12,
      "publication_date": 20170103
    },
    {
      "title": "So far so good",
      "text": "The only negative is its speed. I wish you could set the return distance as I am splitting shorter fire pit wood. The good thing is even knotty oak and hickory have been no issue with this splitter. I have only used it twice but for the but I am blown away by the power and convenience of this electric splitter over using a gas powered type. Electric is so much less maintenance with not needing fuel, oil and keeping the carb cleaned. Go for it.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen L. Armstrong",
      "helpful_votes": 0,
      "publication_date": 20200828
    },
    {
      "title": "Nice Sturdy Machine",
      "text": "So far so good. I have only split a couple of cords of wood at this point, but so far I love the machine. Its quiet, fast, and build like a rock. The only negative I would say about this splitter is the wheels seem undersized and kind of cheap like wheels you would expect to find on a kid's toy. I would have given 5 stars except for the instructions. Apparently they changed the design of the hydraulic oil vent and dipstick but the instructions were not updated. Required a call to factory while the guy ran back to the warehouse to look at the latest ones being made. All in all a great purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180331
    },
    {
      "title": "... this item until I used it and I really like this splitter",
      "text": "I waited to review this item until I used it and I really like this splitter. Its a simple machine and works well. Its seems to be constructed well and I only had a very few logs that I could not split (mostly knots). After a very short time my back started to really bother me, so I might get the extension legs or just keep taking advil. I split about 2 cords and some rounds as big as 24 inches (once I manually split it in half) so I could handle the pieces.",
      "rating": 5.0,
      "verified": true,
      "author": "simpleperson",
      "helpful_votes": 0,
      "publication_date": 20170820
    },
    {
      "title": "I highly recommend this splitter!",
      "text": "I am so pleased with this splitter. I did lots of research before making my decision. It is a bit of money..... but well worth it. My husband has a fused spine so swinging a heavy ax is not feasible. It is a bit heavy, but I weigh 130 lbs and am able to wheel it where I want it. I just finished splitting a pile of pine, ash, and plum wood and I'm not tired in the least. It does all the heavy work. ** I didn't purchase the stand. In my opinion, I know that I couldn't lift it onto the stand. It works just find on the ground plus no worries about it tipping over.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170827
    },
    {
      "title": "Solid, does the job",
      "text": "After 2 wood-burning seasons splitting nearly all our maple and oak with this splitter, I'm very glad we bought it. The stupid little handle did break, but it's easy enough to use a locking wrench. It's had trouble splitting a few of our knotty chunks of maple, and it's not fast, but those are small issues. This is easy to use, efficient, and powerful, and I'm very happy not swinging that stupid maul around.",
      "rating": 4.0,
      "verified": true,
      "author": "Tiva",
      "helpful_votes": 5,
      "publication_date": 20160309
    },
    {
      "title": "Its stood up to abuse! Splitter is reliable",
      "text": "Waited awhile before reviewing, this does its job well and has stood up to some serious punishment going through oak and black cherry. Its a humble machine and doesnt pretend to be a 25 ton splitter, but as you gain skill you can split most anything. Glad I bought this tough little machine! Only criticism is its little warning stickers peeled off quickly, but so what! I got the 4 way accessory wedge head, not enough power to really harness it but great on dry or small log rounds.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunny Regent",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "nice unit for small residential projects",
      "text": "The ES7T20 is a good light weight log splitter for small residential applications using light to medium density wood. However, it cannot touch heavy density wood such as eucalyptus, nor large diameter wood. You might need to split larger pieces by hand to fit. Suggest going to a larger tonnage machine for bigger pieces and high density wood or all weekend long projects.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20171112
    },
    {
      "title": "Performs flawlessly and great customer support",
      "text": "Since purchasing, I've used the splitter 3-4 times. It has effortlessly split anything I can fit in it! Very pleased with it's operation. The last time I went to use it, it refused to turn on. I contacted the manufacturer that said it was likely a bad starter capacitor and immediately sent me a new one. It was easy to replace and solved the issue. As an electrical engineer I know that these capacitors can fail fairly easily so I don't fault Boss for this issue and their quick response was outstanding customer service.",
      "rating": 5.0,
      "verified": true,
      "author": "JCK",
      "helpful_votes": 0,
      "publication_date": 20200811
    },
    {
      "title": "Great value ..",
      "text": "Nice machine for the money, the size of log you can split depends on the type of wood, one reviewer said he was splitting large pieces of pine, well, its pine. I do split fairly large pieces of oak, sometimes...if it already has a natural split in it, then aim for that, some I had to cut around 10 inches thick, or cut them in half length wise... I wouldn't recommend the 4 way splitter head, its just not powerful enough for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Allansmix",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "Saves Me Money",
      "text": "This thing is strong. It split many wide logs and some were almost at the maximum length that would fit on the splitter. The only complaint I have is when it stops on a really tough piece of wood, you have to shut off the motor to reset it once it returns to the start position. I am happy with this and it saved me a lot of money on my last wood purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Good quality and easy to use.",
      "text": "1star off because the shaft gets a little jerky as it gets extended. Otherwise I am quite pleased. I haven’t pushed it much over the recommended size of logs but it’s handled everything I’ve put on it with ease. I used it on my pickup tailgate to make everything including the height handy. I used a heavy 50’ extension cord and made sure the oil was right because of other reviews. The brass washer is an extra for the oil plug, which I screwed up by putting it on the control handle for safe keeping. “ bad idea “",
      "rating": 4.0,
      "verified": true,
      "author": "Stanley D",
      "helpful_votes": 0,
      "publication_date": 20190322
    },
    {
      "title": "BEST PURCHASE EVER!!",
      "text": "Works great right out of the box! The only assembly required is putting on control handle. It split our oak rounds with ease! Buy this if you want your life to be wayyyyyy easier!",
      "rating": 5.0,
      "verified": true,
      "author": "Jordan823",
      "helpful_votes": 6,
      "publication_date": 20180106
    },
    {
      "title": "Great working log splitter!",
      "text": "Just what we needed to replace our older log splitter! Using all the information out there, we decided to buy the Boss Industrial ES7T20 log splitter, and we have not regretted our decision. It is easy to use, and will split most any diameter of log, if careful in how you proceed. It is a bit heavy to move, but it needs this weight also to do it job. We like our replacement!!",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Works Great. Adequate power",
      "text": "This works great. I stacked 12 cords of wood that was pre-split but some pieces were really too big to dry and fit in my stove. I used this to split those down and it worked great. Anything with a really narly grain it struggles a bit, but usually just have to flip it after the first try and it makes it through. very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric G.",
      "helpful_votes": 0,
      "publication_date": 20190723
    },
    {
      "title": "quick work of thick logs",
      "text": "Low stance stains ones back but otherwise perfection with out the noise of a gasoline motor. Quick operation with a very deliberate stroke. Wish wheels were a little wider for crossing ruff turf. Quick return stroke. only flaw is the operate handle has to be removed for vertical storage. Better than 10 ton Gasoline rental!!!",
      "rating": 5.0,
      "verified": true,
      "author": "David A. Lohr",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Also - i suppose it it tiresome to bend down all the time pressing the lever ...",
      "text": "helped me power through a big pile of logs ( a couple chords ). the only thing i would have preferred is a longer bed - some long logs simply wont fit. Also - i suppose it it tiresome to bend down all the time pressing the lever to activate the ram - a little hard on my back, but nothing compared to swinging an axe or maul.",
      "rating": 4.0,
      "verified": true,
      "author": "RandyD",
      "helpful_votes": 2,
      "publication_date": 20170707
    },
    {
      "title": "Does Everything It Says It Will... And More!",
      "text": "I love this wood splitter, read the specifications carefully for the suggested wood diameters. I have found that I can split sticks much bigger than the size listed, however it will not split everything. If you feel that the Overview and Specifications listed should meet your needs don't be afraid to purchase this machine. If you want to split wood any distance from your power supply go ahead and purchase some 30 amp extension cords, you will need them. The splitter will not function using smaller cords at a distance greater than 30 feet or so. Follow the easy to read directions and you will be splitting wood in a matter of minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "TAS",
      "helpful_votes": 2,
      "publication_date": 20150128
    },
    {
      "title": "Great little splitter",
      "text": "Great little splitter. Had for over a year, no problems. As long as wood is well cured, this splitter pops it every time. I've split black walnut, red oak, maple, hickory. Make sure the hydraulic fluid is proper level. Open the valve slightly before running as per instructions. Make sure to close the valve after. I always clean up the machine after every use.",
      "rating": 5.0,
      "verified": true,
      "author": "G. Bradford",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "I'm very happy with this splitter.",
      "text": "I've split almost a cord of wood since i got this splitter about a month ago. In the beginning I had some trouble with interrupted travel of the ram all the way to the end and limited power. It turns out the cause was that i failed to keep the splitter on a level surface. Now that's been corrected nothing stops it. I split 15 inch diameter black walnut, and ash. It even splits stringy swamp maple.",
      "rating": 5.0,
      "verified": true,
      "author": "V. Camiolo",
      "helpful_votes": 0,
      "publication_date": 20181118
    },
    {
      "title": "Great Value - Great Product!",
      "text": "We can't praise this Electric Log Splitter enough! Best Value and Works like a Champ! We split a cord of wood so far with no problems. It runs pretty quiet - We also purchased the Boss Industrial FT5 Log Splitter Stand and WOW! It stands high enough to save the back, was easy to assemble! Great Value - Great Product!",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Fonden",
      "helpful_votes": 2,
      "publication_date": 20180115
    },
    {
      "title": "Splitter that works, and is built strong.",
      "text": "Well, been splitting some red eucalyptus rounds that I had, that I can't split with an 8 lb maul with 35 swings. So I broke out the Boss. It will split it no problem. You have to take small pieces at a time, I am splitting 15\" rounds. Seems to hold up quite well. Split 2 cords of wood in 2 days. Can't beat that right? It's pretty sturdy, but you can still lug it around, and it stores upright. Less room taken in your garage. ;)",
      "rating": 5.0,
      "verified": true,
      "author": "ULB",
      "helpful_votes": 3,
      "publication_date": 20160419
    },
    {
      "title": "Not my first splitter",
      "text": "I am extremely pleased with this purchase. It has almost made splitting my firewood a pleasure. I’ve had a tractor based hydraulic splitter at my other place for years but wanted a smaller less expensive one for our Mtn cabin. After a summer’s worth of splitting I am as happy with this unit as my much bigger one. I use it in 16”x12” to 20” rounds of larch and fur.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl C. Hansen",
      "helpful_votes": 0,
      "publication_date": 20190927
    },
    {
      "title": "Great, dependable splitter.",
      "text": "Perfect electric log splitter, I have split so far 8 cords of freshly cut down red oaks without any issues. Well built and very consistent in operation. Excellent warranty service support, had an issue with ram supporting rod, part was sent out within couple hours and delivered in two days. Highly recommended !!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "What a great little splitter!",
      "text": "This little splitter definitely does the job for me! I usually split oak or juniper and it's very seldom that it can't handle the job. Very good purchase in my opinion. I bought the extension legs for this splitter which makes it much easier to use without constantly bending over all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith",
      "helpful_votes": 4,
      "publication_date": 20160202
    },
    {
      "title": "This 7 ton unit is very powerful use caution",
      "text": "I love this log splitter I had an Ash tree that I had to take down due to property damage. It was huge. I decided to keep the wood for burning. Ash wood is so hard I went through a 5 ton Iog splitter I got at harbor freight it was useless I took it back and picked up this 7 ton unit. I got to tell you I had doubts. But this 7 ton unit blew through this extremely hard wood like butter I was amazed! I’m extremely satisfied with this unit. Highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ernie M.",
      "helpful_votes": 2,
      "publication_date": 20181226
    },
    {
      "title": "Best little work horse I ever did buy.",
      "text": "When I purchase this log splitter I wasn't sure if it could split the very big pieces of logs that I had but it did it was no problem slice through them like butter. Pick this up you will not be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Lowkey1229",
      "helpful_votes": 2,
      "publication_date": 20180829
    },
    {
      "title": "Like the single hand operation",
      "text": "Like the single hand operation. Thought it might have a little more power than it does. It replaced a 6 ton I was using for 10 years and is better than that splitter.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "Well made piece of kit.",
      "text": "I used to have a 5 ton splitter. It didn't last and spares were not found. The 7 ton effort really makes a difference. I trust that this equipment will be repairable. The single control is excellent. If sitting, one hand. If standing - use your foot. I've only used it twice and I have a nice stack of wood. So far - so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Pubmaster",
      "helpful_votes": 0,
      "publication_date": 20191022
    },
    {
      "title": "It's an easy set up and took only 15 minutes to get ...",
      "text": "The Boss 7 ton splitter does 90% of all the splitting I need. It's an easy set up and took only 15 minutes to get going. So far I've split Almond, Oak and Pine. It does a great job but-within the guidelines of the splitter i.e., log diameter and length. The Boss was delivered by UPS in great shape.. The Boss sets low to the ground so I sit on a chair to do the splitting work. I've only had it for a month but so far so good. PS the posted was done by Tom.",
      "rating": 4.0,
      "verified": true,
      "author": "denella kimura",
      "helpful_votes": 2,
      "publication_date": 20160202
    },
    {
      "title": "This is a great little machine",
      "text": "This is a great little machine! We bought it to put in our downstairs so we could use it to cut small shims to start our woodstove. It works like a charm to do that but it also works great on larger pieces of hard wood! Very happy with our purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "MDownes",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "It does the job.",
      "text": "Works as advertized. I bought this splitter because I wanted the single handed function and do not regret the choice. Very easy to move around and store. It's ready to go out of the box. It is a little low, might build a platform to put it on. It does the job I wanted it to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Ann Marie Auburn",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Great log splitter for a homeowner",
      "text": "I just received the 7 ton log splitter and have already cut just over half a cord of wood with it. Works great and easy to assemble (literally screw in the handle). Easy to use with the one handle operating system. It split a few 14\" diameter logs with ease even though Boss indicates that 10\" diameter is the limit. It went through them with no problem at all. A great addition to help with the chores! Henry",
      "rating": 5.0,
      "verified": true,
      "author": "Henry",
      "helpful_votes": 3,
      "publication_date": 20161017
    },
    {
      "title": "Boss 7 ton stopped work after a few months.",
      "text": "Well it worked great for awhile then dies just when I need it. Just stalls out and then wont split at all. Probably a bad seal. I have been really careful with it so very disappointed, now we'll see how service is. Low stars for now.",
      "rating": 1.0,
      "verified": true,
      "author": "Jamie",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "The others are just throw always they work while they are running but try to get parts good luck with that",
      "text": "I have splits wood up to 20in or so that did not have knots. If you have some knots in your wood you have to keep turning and working it. I chose this one over all the others because its made in USA and I can get parts for it as long as I own it, The others are just throw always they work while they are running but try to get parts good luck with that, i love this log splitter for around the home. I called Boss and talk to them before I bought it about replacement parts for in the future.They said if they don't have it on the shelf they can make for you.",
      "rating": 5.0,
      "verified": true,
      "author": "Joseph Wagner",
      "helpful_votes": 3,
      "publication_date": 20150410
    },
    {
      "title": "So far, so good...",
      "text": "Made short work of nearly a cord of maple. Even split some very large pieces, just taking smaller bites at a time from one side then the next. Also used the 4 way optional wedge on the logs that were “in spec” for the splitter with great success. Solidly built, I really think this will last for quite some time. In my opinion, this is a bargain for the price, just be reasonable and don’t expect it to do the job of a larger, gas powered splitter.",
      "rating": 5.0,
      "verified": true,
      "author": "Ron Brooks",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "This is  the  one folks",
      "text": "Very impressed with this unit. Works like a champ. Seems to be sturdy and well built.Would recommend to a friend. BUY THE STAND you will be glad you did.",
      "rating": 5.0,
      "verified": true,
      "author": "KEN",
      "helpful_votes": 4,
      "publication_date": 20161205
    },
    {
      "title": "it split even the chunks saved for last (the burley stuff)",
      "text": "I have split my fair share of wood, only having used PTO drive or 4 stroke splitters... I figured this \"might\" work for kindling. After putting two solid cords through this little fella and saving the worst for last, my doubts were converted! Not having to wear ear plugs or cranking on a pull cord, or smelling exhaust.... I'm tickled pink",
      "rating": 5.0,
      "verified": true,
      "author": "darya",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Nice splitter for its intended use.",
      "text": "I have only used it twice but I found this splitter to be easy to use and can handle most of what I need. It isn't a big gas splitter so there are limits to what you can do, but I was able to split logs 16 to 18 inches long and 12 to 14 wide without any trouble.",
      "rating": 4.0,
      "verified": true,
      "author": "John",
      "helpful_votes": 2,
      "publication_date": 20180110
    },
    {
      "title": "Works great",
      "text": "Overall, this product worked exactly like I had hoped. I used it on some oak and pecan we already had cut and split them up to use for grilling and fire. Worked really easy and make fast work of an otherwise very difficult job.",
      "rating": 5.0,
      "verified": true,
      "author": "Anne M. Stasny",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Fantastic log splitter",
      "text": "Bought this to split wood over Memorial Weekend. It worked perfect! Split logs much larger than advertised with not problem. Not for really hard wood, but perfect for fir.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamasan9",
      "helpful_votes": 0,
      "publication_date": 20190612
    },
    {
      "title": "Lickety Splits!",
      "text": "I've had this splitter for almost a year. I've probably split 500+ logs with it. Very few logs would not split. It splits logs 15 inches in diameter if they are not fresh wet cut logs. It will do 12 inch wet just cut logs right away. I've split hedge, locust, pear, peach, elm, juniper, pine, birch, oak, walnut, mimosa, redbud, and many more. Best money I've ever spent on a splitter and it's nice not having to maintain a gas machine. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Fixsen",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Works great but have an oil leak right away",
      "text": "Works great but have an oil leak right away... I open the breather valve, split 2 face cords of wood, put it away in the garage and the next day I had a few drips of oil on the floor... The Boss does operate even better than advertised and only logs with \"Y\" in them stopped it (split a 20\" oak seasoned log - WOW)... Since it has a 2 year warranty I plan to split my 6 face cords of wood and have it fixed.... Overall a powerful little machine",
      "rating": 3.0,
      "verified": true,
      "author": "Harry V.",
      "helpful_votes": 4,
      "publication_date": 20150505
    },
    {
      "title": "Powerful",
      "text": "Comes fully assembled. Powerful beyond my expectations. This machine popped fresh oak logs twice the recommended diameter. Works for small kindling also. Just fabulous. Only negative not USA made in China.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190921
    },
    {
      "title": "Perfect for home/cabin use.",
      "text": "This wood splitter is perfect for use at our cabin.....we cut and split wood for our wood-burning stove. It has never rejected any log we have given it (average of 9-12 inches around) and we love that it's electric so it's a guarantee start. This really saves my husband's back. Would highly recommend this splitter! Cindy Wisconsin",
      "rating": 5.0,
      "verified": true,
      "author": "Cindy",
      "helpful_votes": 0,
      "publication_date": 20161009
    },
    {
      "title": "Great splitter!",
      "text": "Great little wood splitter. Does an incredible job splitting logs. Only drawback: wish it had a longer adjustable leg base. The unit sits so close to the ground that I need to kneel down to work it. I will put it on my tailgate for now to use it, until I build a platform for it. Otherwise, great product and would highly recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Beth Morris",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Compact power",
      "text": "Outstanding power for a compact machine. I wouldn’t recommend for everyday use, but it can certainly deliver. I use it for random stumps that my friends bring over, I would highly recommend for the not so everyday wood burner like myself. Cannot beat the price either!",
      "rating": 5.0,
      "verified": true,
      "author": "G.ALDAPA",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "Good tool and easy to use",
      "text": "I did a lot of research on splitters and this one is perfect for the casual homeowner with a fire pit. I cut a half cord per year at most ... primarily for fun. This works perfect for me and is easy to store when I don’t need it. It handles everything I throw at it.",
      "rating": 5.0,
      "verified": true,
      "author": "Pat2A",
      "helpful_votes": 0,
      "publication_date": 20190907
    },
    {
      "title": "I'm grateful for how easy this splitter is to work",
      "text": "We split 2 cord of wood in record time. I'm grateful for how easy this splitter is to work, and how light and maneuverable it is. My husband usually splits all 10 cord we need each year by hand, and with this nifty log splitter, my daughters and I can match his splitting log for log.... The price was right and it does exactly what we needed. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "M. Inwards",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "\"Man does it work great\"",
      "text": "Bought this for my Uncle. He's in his 70's and has been foraging and chopping his own wood for well over three decades. He and a buddy tried it out the day it was delivered and they were both very impressed. He said, \"Man does it work great\". It has already saved him aches in his neck and back. He is very happy he got it and said it was well worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Mama Bear",
      "helpful_votes": 0,
      "publication_date": 20191203
    },
    {
      "title": "Great for older gentleman, women and youngsters!",
      "text": "I have been cutting and splitting my own wood since age 12. Now, at 68 years of age, with a shattered shoulder from a horse accident, I find it difficult to use the vertical splitter on the three-point hitch on my diesel tractor and/or my 20 ton horizontal splitter. This littler rig is perfect for splitting smaller longs and making kindling on a cold fall day. Fine piece of machinery. My compliments to the engineer and manufacture that brought this product to market. thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Clyde J.",
      "helpful_votes": 0,
      "publication_date": 20181208
    },
    {
      "title": "This splitter is very simple to operate.",
      "text": "We have had no serious issues with this machine thus far besides having some of the glued decals peal off. It does the job it's designed to do, and the auto return of the ram expedites the sorting of the bucked logs. The electric motor seems to provide enough power to split the wood found in our state of Colorado. Another bonus is that it runs relatively silent, so hearing protection is optional, and you won't be disturbing your neighbors with a noisy gas engine.",
      "rating": 4.0,
      "verified": true,
      "author": "Jon Matuszczak",
      "helpful_votes": 0,
      "publication_date": 20200925
    },
    {
      "title": "Size limits",
      "text": "I like the splitter it's easy and portable. I have put a few logs on that are just a little too much for it. Not blaming the product, it is as advertised. Over all a good log splitter",
      "rating": 4.0,
      "verified": true,
      "author": "RICHARD DOHERTY",
      "helpful_votes": 0,
      "publication_date": 20190718
    },
    {
      "title": "EASY TO MOVE",
      "text": "IT SPL[T WOOD THAT WE DIDN'T THINK IT, SON AND I. IT SPLIT GOOD SIZES OF OLD OAK, WE WERE IMPRESSED. I WOULD RATE IT A VERY GOOD BUY.",
      "rating": 5.0,
      "verified": true,
      "author": "aspen",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "grate tool",
      "text": "I have had this splitter for one month.And have split 2 cords of wood of all kinds up to 20 inches in diameter with no problems.This is one tough splitter with plenty of power. If I could I would give it ten stars.",
      "rating": 5.0,
      "verified": true,
      "author": "William Wells",
      "helpful_votes": 0,
      "publication_date": 20181221
    },
    {
      "title": "Big power in a small package",
      "text": "I've used this splitter on rounds up to 33 inches and it just pushes through. Lifting a round that large was an issue so I used an engine hoist to get them loaded.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich Walter",
      "helpful_votes": 0,
      "publication_date": 20190701
    },
    {
      "title": "So far, So good!",
      "text": "This little machine splits like cray-cray! I can’t believe i’ve been splitting wood by hand all these years. Super quite,fast,easy to use. We split all this wood in a hour. So far so good, I will give 5 stars and hopefully it will last. I will give an update in a couple of months... stay tuned!!",
      "rating": 5.0,
      "verified": true,
      "author": "JBshopper",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Perfect for our life in the Montana woods",
      "text": "I bought this splitter because we moved out into the woods and FAR away from any medical centers. We are not young and I no longer wanted my husband swinging an ax to chop all of our wood. This product has been FABULOUS. It's not too difficult to move (one person can wheel it around pretty easily) and it has taken care of every log we've fed to it, big and small. We have been extremely pleased with ease of use as well as efficiency of use. It's small, but it's mighty. Love that it just plugs in, no need to store and pour gas.",
      "rating": 5.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "HAPPY HUSBAND",
      "text": "Christmas gift for my husband, who is picky picky about the quality of his equipment and tools, and he LIKES THIS!! We split our firewood with our big gasoline splitter outside, then can further split it into kindling right there in the basement garage. Quiet, powerful (he tried it on a couple major logs before \"accepting it into the family\"), and we are very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Down to Earth Reader",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "It is a heavy well built machine that even I enjoy splitting wood now",
      "text": "This splitter has made our life so much easier. We haven't found anything that it couldn't bust so far. It does have a safety feature to keep you from burning up the motor. If it has a little trouble with knotty wood we just reset and continue although it doesn't do it often. I would suggest buying the stand since it is really low to the ground. It is a heavy well built machine that even I enjoy splitting wood now.",
      "rating": 5.0,
      "verified": true,
      "author": "Dora Long",
      "helpful_votes": 2,
      "publication_date": 20141106
    },
    {
      "title": "A snap to use",
      "text": "After using the Boss 7 ton log splitter several times, I just wondered why I didn't get it sooner. The splitter works with ease and does its job. I was able to split weeks of firewood in a few hours rather that split a day's worth by hand. Set up was a snap and then use. Actually if was fun to split firewood. My wife even spit some logs and had fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Willie H",
      "helpful_votes": 3,
      "publication_date": 20160313
    },
    {
      "title": "Nice unit!",
      "text": "Very pleased with this product. Nice and small and compact; easy to move around. My wife can handle this unit. Split logs quite well; bigger than 10\"; up to 12\" diameter pecan. The only reason I rated it a 4 was it came a little low on hydraulic fluid; below recommended minimum. Be sure to check this level before you operate it and refill if necessary. I would definitely recommend to others.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom H.",
      "helpful_votes": 7,
      "publication_date": 20150222
    },
    {
      "title": "Great Electric Wood Splitter",
      "text": "This log splitter is great for splitting logs used for wood burning, although I have cut very large logs. It is great at cutting through hard woods. You can also purchase the 4-way cross wedge to split larger logs is saves so much time.",
      "rating": 5.0,
      "verified": true,
      "author": "Alice Gorney",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "the best",
      "text": "really like this splitter and has split everything I put on it. it is a little heavy as I lift it on a platform I made but is so nice not working off the ground. would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "Jer",
      "helpful_votes": 0,
      "publication_date": 20191217
    },
    {
      "title": "Great splitter, will handle large logs",
      "text": "Great splitter, will handle large logs, just know your limit. I was surprised at this electric splitter, will handle just about everything you throw at it, for real big logs, you will have to manually split the log one time, then this will do a great job.",
      "rating": 5.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 2,
      "publication_date": 20170303
    },
    {
      "title": "Fantastic Splitter",
      "text": "Best Value I have gotten in years. I bought the small one ( 7 ton ) and it out works my 15 ton gas rigg ( now sold ).I split live oak and it works fantastic. Only thing is it is low to the ground,so I bought a tow behind lawn trailer (agri-fab 45-0303)and it fits in and gives height plus working bed, Not so much stooping. GREAT SPLITTER",
      "rating": 5.0,
      "verified": true,
      "author": "Ron",
      "helpful_votes": 0,
      "publication_date": 20191117
    },
    {
      "title": "What's not to like?",
      "text": "Excellent quality, strong and dependable. LOVE splitting wood with this, it's fast and saves my back. Doesn't take up much room, plug in and go. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff & Lisa R.",
      "helpful_votes": 0,
      "publication_date": 20190824
    },
    {
      "title": "Poor QC",
      "text": "Plugged it in, turned on, motor hummed and then blew the circuit. Opened her up to see if their were any obvious visible shorts. Tried again same thing. Poor QC control. Sent back unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Sailawayny",
      "helpful_votes": 0,
      "publication_date": 20200910
    },
    {
      "title": "Must have tool for wood fire fans",
      "text": "Wow. I’ve been splitting my firewood for 30+ years. With a recent back injury, I decided to get a little help. YES, this is a great splitter. It’s actually fun to use. Wished I had it 30 years ago. I really like how simple and safe it is to oprerate and I can store in inside inside easily. The wheels allow it to be moved and stored in a vertical poison, taking upvery little space .",
      "rating": 5.0,
      "verified": true,
      "author": "Kathy Christiansen",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "works well as advertised",
      "text": "I am pleased with this log splitter and have used it for about 20 hours so far. My initial problems were due to insufficient power because there was a refrigerator on the same line. Once I made sure the circuit was dedicated to the log splitter everything worked well. I would recommend this splitter.",
      "rating": 4.0,
      "verified": true,
      "author": "Gary Allen",
      "helpful_votes": 0,
      "publication_date": 20200929
    },
    {
      "title": "Worked great",
      "text": "This is my first splitter, It operated as expected or perhaps a bit better. The power is exceptional, the first time I used it it had to tackle some very large logs and did not hesitate. Seems very well built, and likely why it so heavy. The one handed operation, once turned on is great. I would certainly recommend.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike Jackson",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "Awesome splitter",
      "text": "Best investment I’ve made in a while. It works as described, I have no problems with this splitter. I use it for splitting pecan and Hickory",
      "rating": 5.0,
      "verified": true,
      "author": "scsa694",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Great machine",
      "text": "Most logs I split are limbs trimmed from my red oaks, live oaks, and water oaks. They are usually between 6 and 10 inches in diameter. I have split about 2 cords of fire wood for the fall and this spitter has been great so far. If you follow the manual you wont have any problems. I even look forward to splitting more. Great product for the money. Wish I had bought one sooner.",
      "rating": 5.0,
      "verified": true,
      "author": "Wayne",
      "helpful_votes": 0,
      "publication_date": 20190626
    },
    {
      "title": "Fabulous splitter!!",
      "text": "So love this splitter we bought for my husband. It saves his back with not having to split it by hand. It worked fabulous. Thank you!",
      "rating": 5.0,
      "verified": true,
      "author": "Bev",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Excellent Quality",
      "text": "Used this for one season, so far so good. Splitting cord wood into smaller peices. Oak, birch, and maple.",
      "rating": 5.0,
      "verified": true,
      "author": "The Judge",
      "helpful_votes": 0,
      "publication_date": 20190525
    },
    {
      "title": "great shape upon arrival",
      "text": "shipped fast and packaged well, great shape upon arrival. The splitter is strong and will split wood well above the rated diameter if you off set the log and split it in a few passes. Stores with a very small foot print when set on end.",
      "rating": 5.0,
      "verified": true,
      "author": "T.J. F.",
      "helpful_votes": 3,
      "publication_date": 20160122
    },
    {
      "title": "Packaging could be better for a heavy item",
      "text": "The unit works very will. Managed 20 inch logs with branches in then with several passes. Packaging could be better for a heavy item. There was damage to the position shield.",
      "rating": 5.0,
      "verified": true,
      "author": "antanasvn",
      "helpful_votes": 0,
      "publication_date": 20171216
    },
    {
      "title": "quality",
      "text": "My husband is pleased. Works great and does the job so far. The real test will be this summer when he does the major splitting.",
      "rating": 5.0,
      "verified": true,
      "author": "out west",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Great machine!",
      "text": "Awesome little splitter. Easily splits big hardwood rounds. I use it atop a small trailer to raise the working height. I've gone thru 4 cords of wood ranging from sycamore to ash. Ifcthe ends are square, it will split any reasonable size log.",
      "rating": 5.0,
      "verified": true,
      "author": "jode",
      "helpful_votes": 0,
      "publication_date": 20180319
    },
    {
      "title": "Works great",
      "text": "Have now used the log splitter for several seasons, mostly splitting oak logs, with some up to 16 inch in diameter. The splitter works great. It has had no problem splitting even the largest of these. Very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 3,
      "publication_date": 20161023
    },
    {
      "title": "Hard Working Unit!",
      "text": "I just spent a day splitting all of this Aspen wood practically non-stop. Now I'm ready for winter in Colorado! This machine made short work of three cords of wood. A welcome addition to my toolshed!",
      "rating": 5.0,
      "verified": true,
      "author": "Tony K",
      "helpful_votes": 0,
      "publication_date": 20181218
    }
  ],
  "product_meta": {
    "title": "Boss Industrial ES7T20 Electric Log Splitter, 7-Ton",
    "description": "The Boss Industrial ES7T20 is among the Top Rated Electric Log Splitters offering unparalelled quality and performance with its patented technologies. It offers the same convenience and portability of our EC5T20, but ramps the power up a notch to tackle larger projects! The powerful 2 HP electric motor delivers 7 tons of splitting force with of the harmful emissions that come with gas-powered units, allowing users to split indoors and outside. Built-in side rails keep logs stable while splitting, and the front handle allows for easy maneuvering. A patented hydraulic system and one-handed operation make Boss Industrial electric log splitters stand out from the rest of the pack.",
    "rating": 4.6,
    "feature_bullets": [
      "Powerful 2 HP electric motor",
      "7 tons of splitting force",
      "Convenient one-Handed operation",
      "Automatic ram return",
      "2-year residential warranty.Hydraulic Pressure (psi):3500"
    ],
    "specifications": {
      "Product Dimensions": "40 x 13.5 x 20.5 inches",
      "Item Weight": "117 pounds",
      "Manufacturer": "Boss Industrial, Inc.",
      "ASIN": "B00GNSCGIW",
      "Item model number": "ES7T20",
      "Customer Reviews": "4.6 out of 5 stars498 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#14,112 in Patio, Lawn & Garden",
      "Is Discontinued By Manufacturer": "No"
    },
    "categories": [
      "Power & Hand Tools",
      "Tools & Home Improvement",
      "Power Tools",
      "Garden & Outdoor"
    ],
    "price": 434.63
  }
}