{
  "website_summaries": [
    {
      "verdict": "Popular sand filter pump that gives you multiple options for running the device, including an automatic timer.",
      "pros": [
        "Works nicely with even large pools, as it's rated for pools up to 21,200 gallons of water",
        "Long power cord (25 feet) is handy",
        "Provides multiple operation settings, including backwash filtration and re-circulation",
        "Includes automatic timer and automatic shut-off features"
      ],
      "cons": [
        "Occasionally, some parts may not fit together tightly",
        "Some longevity questions"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Compatible with Coleman Pool",
      "text": "So, we gave an above ground Coleman Pool. We needed to get a new pump, but we weren't sure this one would fit. It does. We didn't have to buy any additional parts. It was easy to install, but it did take me a while. My husband was at work, so I did it by myself. It pumps much harder than the pump that comes with the pool. It is keeping our pool clean so far, but we have only had it a few days. Will update review if that changes. Sorry for the Snap photo. That's all I have! ha!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 22,
      "publication_date": 20170613
    },
    {
      "title": "Works better than cartridge",
      "text": "I have a 15' x 48\" bestway pool that came with nothing but the pool. I bought the intex 1500gph cartridge pump and the saltwater system. I went through a new cartridge almost weekly and a washed out one in 3 days. So I decided to switch to the 3000gph sand pump model sf60110-1 and not mess around. Man does this thing move water. I am using quikrete pool filter sand. All of the Ace Hardware's were out of the recommended hth pool sand. So I first backwashed, then rinsed. Then set to filter and runs for 4 hours and set the SWG for 4 hours too. So far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas",
      "helpful_votes": 7,
      "publication_date": 20170628
    },
    {
      "title": "Missing parts",
      "text": "This order has missing item to install and get the pool to work. Missing : plunger valves (2), hose o-rings, step washers, strainer grid and rubber washers. Should have been stated in the discription before everyone considers buying it on line at Amazon. I would have never ordered this item if I knew it was not including the entire parts for this item. Somebody needs to make it right!!",
      "rating": 1.0,
      "verified": true,
      "author": "Simon49ers ",
      "helpful_votes": 6,
      "publication_date": 20180622
    },
    {
      "title": "Best upgrade for above ground pools.",
      "text": "Prior to this product we had Shrek's swamp in the backyard. We bombed it with chlorine about 3 lb,s in this 14 ft pool, some acid, and yellow out. As you can see crystal clear in two days. The sand filter removed all the dead algae and then I did a backwash and it runs amazingly now no more green water. Local pool stores will have you spend a fortune on chemicals, instead do what I did if you see a guy doing pools out and about sit and have a chat. Could not be more impressed by this sand filter. The original filter is crap that comes with your pool do this simple upgrade you will be thoroughly satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Stealey",
      "helpful_votes": 5,
      "publication_date": 20180714
    },
    {
      "title": "Best pool filter ever.",
      "text": "I love this pool filter! Most of the time, things aren't what they seem. But this pool filter works great. My pool is clear and it is the best it has ever been. I have a Coleman 15'x48\" above ground pool. The pump with a paper filter just did not do the job. The water stayed cloudy and the filter would stop up within an hour. It took about 30 minutes to put it together and fill it with sand. It was ready to go. Within 3 hours, the water was perfectly clear. There is no need to run the pump 24 hours a day - only 2-4 hours. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Barker",
      "helpful_votes": 21,
      "publication_date": 20160605
    },
    {
      "title": "Expect it to break every year.",
      "text": "This pump lasted exactly one summer. Used it for 3 months and then it quit. These are not made to last more than one summer. This is the third pump for a 3 year old pool. Every summer we need a new one. Who knows if Intex will honor the 1 year warrantee. I guess I will find out Monday if Intex will even answer the phone.",
      "rating": 1.0,
      "verified": true,
      "author": "whatapples",
      "helpful_votes": 6,
      "publication_date": 20170602
    },
    {
      "title": "Perfect",
      "text": "I had a big index pool. Finding the right fittings was annoying so do yourself a favor and buy the recommended fittings from amazon too, and send them back if you don’t need it. You do not wanna think you have the right one only to spend the day away attaching pipes and failing. Home Depot doesn’t have it, and local pool places have what amazon sells for double the price. Buy everything together. Pump is AWESOME! Once we got everything correctly fitted, I’ll never go back to the small lump the pool came with. Worth it even if your pool isn’t huge. It will just clean faster.",
      "rating": 5.0,
      "verified": true,
      "author": "Fiscal Triumph",
      "helpful_votes": 2,
      "publication_date": 20180405
    },
    {
      "title": "If you’re in the south or have hot summers, you need this pump!",
      "text": "Life changer. Constantly fighting green nasty pool growth. Always shocking and treating. Purchased this pump and the saltwater system and it’s now nearly maintenance free. Here in south, water gets in the 80s which will pretty much grow everything. The little filter pump that came with the pool is totally inadequate even for our 14’x42” Intex pool. My parents have the same pool in the PNW and they can get by with the little factory pump. We upgraded to this sand pump, and kids and there friends enjoy swimming in every day. Intex customer service was supremely helpful in getting adaptor valves to convert new pump which is made for larger pools.",
      "rating": 5.0,
      "verified": true,
      "author": "Blessed Dad",
      "helpful_votes": 3,
      "publication_date": 20180621
    },
    {
      "title": "Must have for above ground pools.",
      "text": "Bought this to replace the horrible cartridge filters that came with my 14' Summer Waves pool. I used about 35lbs of Zeosand in it. Absolutely noticed a difference in one day with this filter. Keeps my pool clean easily and really isn't too loud at all. Replace your cartridge filter now and save yourself some money and headaches. I highly recommend also buying an automatic pool vacuum to go along with this. All I really have to do is skim a few leaves and bugs off the top and the pool stays nice and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 2,
      "publication_date": 20180702
    },
    {
      "title": "Keep your pool nice!",
      "text": "Worked as said. Just be sure and put a little petroleum jelly on all the water connections if do not want a leak. They did improve the design over the last one. It lasted 4 years. Remember to purchase a larger size pump than required. More power! More flow and easier to maintain. Works so much better than the paper pool filters. Cheaper in the long run too!",
      "rating": 5.0,
      "verified": true,
      "author": "Lazarus",
      "helpful_votes": 5,
      "publication_date": 20161129
    },
    {
      "title": "Best pool pump",
      "text": "Wish I had discovered this pump last year when I bought my pool. I just assumed the crappy pump and paper filters that come with the pool were sufficient. This pump will not disappoint. It takes all the work out of cleaning my pool. So grateful!",
      "rating": 5.0,
      "verified": true,
      "author": "fetherheth",
      "helpful_votes": 37,
      "publication_date": 20170518
    },
    {
      "title": "MUCH BETTER than the standard pump & filter!!",
      "text": "This is a MUST! If you're getting any of the simple pools, you MUST pick up this pump/filter. The standard pump/filter included with the pools is worthless--it gunks up quickly, the pressure is next to nil, and you spend tons of time & money trying to balance chemicals..Not to mention replacing the cartridges every week. Save yourself the trouble and money, just order this along with your pool. The 2100 is perfect for our 22ft round pool, which holds over 10,000 gallons. All that's left is the $10 bag of sand from your local pool store, and you're in business! Pool is much more clear and balanced! I can't stress this enough.",
      "rating": 5.0,
      "verified": true,
      "author": "CRA-zy Momma",
      "helpful_votes": 2,
      "publication_date": 20170618
    },
    {
      "title": "GAME CHANGER!!!!!",
      "text": "I messed around twice a week with a cartridge filter pump last summer, and was always adjusting the chemicals. I'd cross my fingers every time I lifted the cover because I didn't know if the water would be cloudy. This year I upgraded to the sand filter. It has been about 6 weeks so far and I haven't had to backwash it, mess with chemicals other than keeping chlorine dispenser full, and every day I have a crystal clear pool!!! Everyone was right when they said to ditch the cartridge filters and get a sand filter! I also got a Wanda the Whale, and this drives it perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Gochnauer",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great product",
      "text": "I have a 22'x52\" round pool and would recommend this product to anyone that gets a cheapy little cartridge-type pump that comes with their above ground pool. I should've purchased this pump three years ago instead of wasting my time (and money) cleaning and buying cartridges. It has saved time with lower maintenance and money with not having to buy cartridges, using as much chemicals and the electricity to run it! Best buy for your buck!",
      "rating": 5.0,
      "verified": true,
      "author": "Anderson Engineering, Inc.",
      "helpful_votes": 0,
      "publication_date": 20190903
    },
    {
      "title": "Just received and opened the box and found what I've ...",
      "text": "Just received and opened the box and found what I've seen before in other reviews... One of the screws seems to be over tightened and it broke the plastic housing of the motor. Appears to be still secured so we will see what happens once we get it hooked up.......",
      "rating": 3.0,
      "verified": true,
      "author": "Race Bannon",
      "helpful_votes": 8,
      "publication_date": 20170428
    },
    {
      "title": "Things you will need that are not included",
      "text": "Gave this a 4 star rating because it does not include a hose for backwashing. This should be included. I was upgrading my 16 ft round above ground filter. Original filter not sufficient. This sand filter is great. But, I had to order a hose for the backwash. Really should be included. I would have paid more if I had to to have it included. Made the transition difficult because I had to order the hose. This filter has to be backwashed when you install the new sand so the hose is needed immediately.",
      "rating": 4.0,
      "verified": true,
      "author": "jwelsh-horselvr",
      "helpful_votes": 0,
      "publication_date": 20180827
    },
    {
      "title": "Missing needed parts.",
      "text": "The description did not state this was for pools with 1.5' hose openings, and my pool has 1.25\". Adapters were needed to fix this problem but needed to be ordered directly from Intex. A total of 4 hoses are needed for hook up and only 2 were in the box. Of course those also are available through Intex along with a hose splitter that was not included. I thought I should watch the included demo DVD in case I was not understanding something only to find it was severely warped therefore unwatchable. Boxed it all back up and returned with no problems.",
      "rating": 1.0,
      "verified": true,
      "author": "Krystal McBride Folsom",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "upgrade with this from cheap paper filter pump",
      "text": "Turned my... Intex 15ft X 48in Easy Set Pool Set with Filter Pump, Ladder, Ground Cloth & Pool Cover ... into a good working pool!! The filter that came with pool was weak and I could tell it was not doing the job on day 1 so I ordered this pump and everything is good now! you are going to need.... INTEX 1.25\" to 1.5\" Type B Hose Adapters for Pumps & Saltwater System | Set of 2 ...to make it work with this pool",
      "rating": 5.0,
      "verified": true,
      "author": "tom",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Do not recommend this Intex Sand Pump!",
      "text": "i purchased this Intex Sand pump in July 2015, and as of June 8, 2017, the tank has already cracked and leaks. Plus, this one throws sand back in pool. Have to vacuum every time I get in the pool, sometimes twice a day. This is the second Intex pump like this we have purchased in 4 years, neither lasted 2 seasons. Tank on each one cracked and leaked. I will not be buying another from Intex. I do not recommend this pump or Intex.",
      "rating": 1.0,
      "verified": true,
      "author": "S. Lee Butler",
      "helpful_votes": 3,
      "publication_date": 20170608
    },
    {
      "title": "Didn't last two seasons without breaking and zero customer service.",
      "text": "I bought this pump last year as soon as we turned it on this year the entire skimmer basket broke away from the housing. I've been trying to contact the company since the 1st of April with no reply they will not answer emails they will not accept phone calls I have sent them five different emails including all the information they've responded to one email telling me to supply them with the information for my warranty claim that I provided in the five previous emails. I will never buy another Intex product ever again.",
      "rating": 1.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 0,
      "publication_date": 20200706
    },
    {
      "title": "Watch the video first!",
      "text": "I already had the same system but the 12\" previous. Replacing pump and sand filter was easy, but watching the video made it go a lot faster replacing. I purchased Zeolite Sand instead of Silica Sand as recommended by the pool store. Silica Sand is a known carcinogen. Zeolite is better for trapping, even metals. You only need half the amount of Zeolite as opposed to Silica. I put in two bags, 50 lbs total, in the 16\" sand filter. Everything is working wonderful! The product was shipped super fast too!! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry",
      "helpful_votes": 0,
      "publication_date": 20190530
    },
    {
      "title": "Awesome Powerful Filter!",
      "text": "Ive had this pump for about a month and it has ran great! Its about twice as powerful as the one i replaced and makes hooking up my intex vacuum easy and it has tons more suction! Easy to assemble, and all connections fit my coleman 18 x 48 pool with little effort. The power of the pump allows me to run my external skimmer and vacuum at the same time. The timer and extra skimmer basket on the pump are great features!",
      "rating": 5.0,
      "verified": true,
      "author": "Jonathan Strong",
      "helpful_votes": 2,
      "publication_date": 20180530
    },
    {
      "title": "Got it in 2017 for $155.93 now it's doubled priced but it's great filter!",
      "text": "Great filter! Purchased in July 2017 still working great! Only one issue is: the printed settings selection on the top of the drum in completely gone due to weather and tear and tear. So now it's kind of difficult to select the correct cycle. Have to check with manual all the time. Another thing I've noticed: in 2017 I paid $155.93 for this filter- today it's doubled in price? That's weird.... If you're looking for great, reliable above ground filter-this one is to go with. Had no issues for past two years!",
      "rating": 5.0,
      "verified": true,
      "author": "Vlad Bykov",
      "helpful_votes": 0,
      "publication_date": 20190715
    },
    {
      "title": "Busy signal when calling for customer service",
      "text": "The pump works get at first compared to the pump that came with the pool (which is not useful). Pump know that you will spend lots of time messing with getting the pool clean, getting the suction strong again, backwashing, buying parts, finding the right vacuum when the filter cant get the debris on the bottom of the pool, buying a better filter basket for your pool and keeping it emptied. I know someone who gave the pool to their neighbor because they had no time for this. And let's hope you don't need warranty service because you can't get through the phone line.",
      "rating": 1.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20200526
    },
    {
      "title": "Pump",
      "text": "Installed per instructions it started to work then it wouldn't keep pressure called company and sent me new motor installed and still same problem now they are sending me a new six way value so for 30+days no pool",
      "rating": 1.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 7,
      "publication_date": 20170504
    },
    {
      "title": "Works good so far.",
      "text": "I'll remain skeptical for now... I just set this thing up last night. It took 3.5 25lb bags of filter sand to fill this thing up. The only place to get filter sand here is Lowe's and it's $25 a bag. So far so good though. It moves some water. I have it hooked to the split T on the intake side and there's enough draw to operate the skimmer on one input port and leave the other open. Even with both inputs open the skimmer works better than it ever did with the stock cartridge pump. I've got nothing on longevity. I'll update if anything changes.",
      "rating": 4.0,
      "verified": true,
      "author": "Naviathan",
      "helpful_votes": 0,
      "publication_date": 20180711
    },
    {
      "title": "Great Pump & Filter!",
      "text": "Great replacement pump. Cleans really well, powerful but rather quiet. Easy to use - just add sand. Has timer, which is a great feature. Just wish I could buy pump without sand tank. Husband had surgery last fall and we never brought the pump inside, and therefore the casing cracked due to water still in it and the freezing winter weather. It was our fault and does not reflect on quality. This replacement pump has been improved from the older one we had. Trash your paper filter, and buy this one! LOVE our Intex Metal Ultra Frame pool! Tenth season & still going strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy M. Suggs",
      "helpful_votes": 0,
      "publication_date": 20180719
    },
    {
      "title": "Doesn't work on a 24' pool.",
      "text": "Put this filter on a 24' above ground pool in the spring. The description said it would work on our pool. Used it all summer and struggled with keeping water clean and clear. I went to a sand filter over a the cartridge filter I've had for years to make things easier. This did not work for our pool. Spent a lot of money and time going back and forth to pool shop getting water tested and buying chemicals to fix the water. We haven't been able to use the pool much this year and now just going to close it early because we're tired of messing with it.",
      "rating": 2.0,
      "verified": true,
      "author": "AverageHunter",
      "helpful_votes": 0,
      "publication_date": 20190830
    },
    {
      "title": "Best Add on upgrade I have ever done",
      "text": "I am writing this review June 28 2020, I bought this filter in 2018 when I went from a 15 foot Intex pool to an 18ft intex pool. I had spent buco bucks on the paper filters with the 15ft pool and when I went bigger I decided to go with the sand filter. It is still running and works great this year we changed the sand, there was really no need but I just thought 2 years with same sand in filter might not be good. I am able to vaccum and pool is always crystal clear and I spend no money on changing cartridges.",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Not reliable enough for outdoor use, but with care is effective.",
      "text": "We have this pump attached to our stock tank pool. It works OK. It died for about a week last month, but randomly worked again this week. I think there may have been water in the plug housing, so I've wrapped it and will keep it out of the weather. For such a small pool, the suction is never as good as I think it should be. I may need to change out the filter media (again) to something better, I'm not sure. I feel like I've tried everything.",
      "rating": 3.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Leaky but cleared the water crystal clear .",
      "text": "Easy to set up and operate. Cleared the green water crystal clear. When it worked it worked great. Arrived with damage to the pressure gauge but was still able to use it. Unfortunately it started leaking at the catch viewer and when I ordered a replacement the second one did as well. Would not order again due to the constant leaking . I followed directions for installment to the T and was not willing to alter it to stop the leaking.",
      "rating": 2.0,
      "verified": true,
      "author": "Shannon Keevan",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "It gets one star for not even coming close to cleaning an 8400 gallon pool.",
      "text": "Says it will work for up to an 8400 gallon pool. Don't even try it! We have a 5000 gallon 16ft. Intex pool and this thing struggled to keep it clean until it died in one week short of a year. The paper filter pump that came with our pool performed better. You'll need to back flush this sand filter about 3 times every time you want to vacuum your pool. Spend the extra money and go with a bigger GPH pump.",
      "rating": 1.0,
      "verified": true,
      "author": "Jeremy",
      "helpful_votes": 0,
      "publication_date": 20180601
    },
    {
      "title": "Rave Reviews from Others Poor performance for me.",
      "text": "The concept is great and I hear rave reviews about sand pumps, but I never got to experience it. Followed all instructions to a T and the sand pump spewed sand into my pool. Lots of it. I had to spend $100 to get a powerful vacum to clean the pool. very next time I started the pump it spewed more sand into the pool! It is probably defective or broke in transit, but I'm afraid to try it again. Only so much summer in the Midwest and I can't afford any more delays. It took a week to get the first one.",
      "rating": 1.0,
      "verified": true,
      "author": "cindywebb",
      "helpful_votes": 3,
      "publication_date": 20170614
    },
    {
      "title": "Perfect for my 15x48 intex metal frame",
      "text": "Great Product, works very well, 4 stars because they should have suggested the 1.5 to 1.25 connectors to purchase alongside. Luckily amazons frequently bought together brought it to my attention. I would have been slightly frustrated if I would have purchased this pump without the adapters/connectors because I would have had to wait another few days before installing. My only other regret was not purchasing the skimmer at the same time. This was mainly due to the fact that I am a cheapskate and has everything to do with my upbringing and again has nothing to do with this seller. Cheers.",
      "rating": 4.0,
      "verified": true,
      "author": "395rider",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "The pool came with a 1500 GPH pump which worked great..",
      "text": "Worth every penny..hands down! We have a 18x48 Intex above ground pool. The pool came with a 1500 GPH pump which worked great... I wanted to buy an automatic vacuum, which meant I needed a bigger pump for the vacuum to work. The set up was so easy and I found the sand at Home Depot for $5.49 for a 50 lb. bag. I will say this, I could not find how much sand the pump would need in the description and had to google. It said 100 lbs. would be sufficient; however it takes closer to 125-150 lbs. The vacuum works like a champ now! I am super impressed with all Intex products, especially this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Karen Glover",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Fits Coleman powersteel pool perfecly",
      "text": "This is our second season with this filter/pump and it is still keeping our pool nice and clean. We have the Coleman powersteel pool and switched the intake and output around, which allows us to use the intex skimmer basket perfectly. I was very pleased that the intex pump and filter worked for my Coleman pool.however, I had to give 3 stars because I am pretty sure it is putting out some sand into pool. Something inside the filter must have cracked. It is still working for now, but I dont anticipate getting too many years out of it. I will update once I get more info on this issue.",
      "rating": 3.0,
      "verified": true,
      "author": "Courtney Jay",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Well Built, Easy to Set-up and Runs Quiet",
      "text": "Well, I've only had it for a week, but so far so good. This review is mainly for the setup. I've had several pool and pond filters in my day and this one is very well put together and seems to be sturdy and well built. I put this on a 12'x30\" Intex pool, which is much smaller than this pump and filter is rated for, and it really keeps the water moving and circulated. You can never really over filter a pool. I made sure to not reduce the intakes lines by much and plumbed two separate return lines. This pump really moves some water so don't restrict it. I'll report back in a few months.",
      "rating": 4.0,
      "verified": true,
      "author": "JW",
      "helpful_votes": 2,
      "publication_date": 20160621
    },
    {
      "title": "Small, quiet, efficient!",
      "text": "This pump is programmable, which means I won't ever have to worry about forgetting to turn it on again! We were a little worried about the strength of the pump and the size of the filter, since our old one was much larger. Our pool is on the larger end of what this pump and filter are made for. Not only does it work, our water has never been more clear! Since it is smaller, it is much less of an eyesore, and the hoses allow it to be even closer to the pool than our last big clunky one. It is also very quiet! I cannot think of a negative thing to say about this product!",
      "rating": 5.0,
      "verified": true,
      "author": "Donnastoys",
      "helpful_votes": 0,
      "publication_date": 20160917
    },
    {
      "title": "lasted one year",
      "text": "After 1 year of ownership (2 months of use last summer), the pump no longer works and I am upset it is dead already. This year, rather than starting it hummed, so we tried to get it started by taking it apart and moving the shaft (with a drill to break up any corrosion from sitting). Husband works with fish tank pumps often and is used to this issue. After a lot of fiddling, it turned on. I set it up to the pool and left it to run. The next morning, it was off and wouldn't start. We've managed to get it started one other time for a few short minutes before it shut off.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160801
    },
    {
      "title": "Works great, tremendous force of water pressure for return to ...",
      "text": "Works great, tremendous force of water pressure for return to pool. Easy to put together and easy to work. I love the extra long electrical cord! I can't say a thing bad about it. I do feel however I should have to water returns to the pool because of the tremendous water pressure. I have a 16' by 48\" pool. I did have to recut the return hole and the filter hole to add a new skimmer basket to match the 1.5 hose fittings so I did not use the reducers. But it was simple enough for a 65 year old granny to do!",
      "rating": 5.0,
      "verified": true,
      "author": "Bernice H.",
      "helpful_votes": 0,
      "publication_date": 20170719
    },
    {
      "title": "Lifespan sucks.",
      "text": "Pretty poor lifespan. 11 months and 2 weeks in, the pump started making noise. I assumed it was low on sand, and other things came up. I turned it off, and by the time I got around to filling it, the year had passed. Out of warranty, and I am SOL. Sand level was fine. Im pretty sure the bearing in the motor went out. At any rate, I ended up having to trash it. $100+ for less than a years use I find to be ridiculous. When it did work, it worked great. I have a smallish 10' pool, but 5 kids who jump in complete with dirt, and it kept the pool beautiful and clear.",
      "rating": 2.0,
      "verified": true,
      "author": "Anna",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "Works great for 14 foot pool",
      "text": "This pump works great for our 14' pool (x3'). we added a skimmer and fountain to keep the water cool and clean. It will vacuum as well, but struggles toward the end of vacuuming as it gets full of junk. It is so easy to backwash it every Saturday. We LOve that feature. It is a pain to have to undo so many screws to clean out inside where the spinner turns (just after the leaf catcher) but that does need to be cleaned out occasionally to keep water flowing. Overall, we're very pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20180830
    },
    {
      "title": "Must have.",
      "text": "Bought this pump as a replacement to the original one that came with my above ground pool. The small pump that comes with the pool didn’t keep the pool clean so I searched for something else. This is a great price and works wonders. Once it was attached and running within a day it cleared up the dirty water and has worked great for the past two years",
      "rating": 5.0,
      "verified": true,
      "author": "AJ Davila",
      "helpful_votes": 0,
      "publication_date": 20200217
    },
    {
      "title": "works just great, and moves the water really well",
      "text": "Have only used this new pump a couple weeks now after pool was shut down during winter time. We had one of those small filter pumps that came with our pool, and it had no power or suction at all. This new pump, however, works just great, and moves the water really well. What a difference. I will update this review after another season of using this pump. Thanks seller.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Uratani",
      "helpful_votes": 0,
      "publication_date": 20180604
    },
    {
      "title": "Dont buy this product",
      "text": "I bought this sand filter for my pool, we had it all set up, ready to go and come to find out the main clamp that holds the two pump parts together is cracked. Now trying to get things done with Intex is the most painful production. Cant even find the part on Intex's online store. I now have a pool pump that doesn't work and a pool my kids cant use. Thanks for nothing.",
      "rating": 1.0,
      "verified": true,
      "author": "Misris",
      "helpful_votes": 0,
      "publication_date": 20180623
    },
    {
      "title": "Does the job, easy to install, electricity bill unaffected",
      "text": "Pump came with everything needed, I did NOT need anything extra to connect it to my Coleman above ground pool, but bought them just Incase (some people suggested to buy them, but we’re not needed). Very easy to hook up, as I made my husband do it! But he said it was easy, and only took minutes. We bought sand at local hardware store for like $5. Pool has been crystal clear since buying it, runs on a timer and our electricity bill didn’t noticeably change, and we have it running 10 hours a day.",
      "rating": 5.0,
      "verified": true,
      "author": "REStew",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Worth the money for sure!!",
      "text": "What a difference from the crappy stock filter. My pool used to turn green every other day, I literally threw hundreds of dollars worth of chemicals into this pool. I caved and bought this filter as a last stitch effort to save the pool. OMG what a difference, I wish I bought it sooner. Don’t bother with the instructions, watch the YouTube instructional video, so much easier to understand. I’ve included a before pic with my stock intex filter (running daily) and 24 hours after hooking up the sand filter. Don’t second guess this one, just do it. You can thank me later.",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "Perfect upgrade to my tiny pool!",
      "text": "My 10ft inflatable pool ($69 at kmart) with filter that was actually useless. Upgraded to this filter and make it run only 4 hours per day. Results are great! It came with a GFI plug that is not so weather proof. 1st rain got the GFI to keep tripping. My home's outside receptacle are already GFI protected so I put a regular plug and connected to my GFI protected receptacle. Back in business!!! That is the only reason it is getting a 4 star rating!",
      "rating": 4.0,
      "verified": true,
      "author": "D. B.",
      "helpful_votes": 0,
      "publication_date": 20180924
    },
    {
      "title": "intex sand filter on intex 22' x 52\" round pool",
      "text": "this is the third intex round pool we have had, first two were on cartridge filters and always needed some kind of work to keep clean, and this 22' pool started out with cartridge filter which required daily cleaning that I got tired of and bought the sand filter. All I can say is why did I wait so long. The sand filter was easy to install and has performed great with very little attention all summer. I would recommend it 100%. No smart phone so no photo.",
      "rating": 5.0,
      "verified": true,
      "author": "Jake W. Duncan",
      "helpful_votes": 0,
      "publication_date": 20181003
    },
    {
      "title": "excellent!!!",
      "text": "first one I ordered was broken at the base, I messaged Amazon and they replied VERY quickly, and got my exchange sent out the next day, and that was over the Memorial day weekend. I hooked this new pump up with help from my son. Pool was green when I hooked this up and clear in 12 hours!! works EXCELLENT!! very impressed. my pool is 22'x 52\" BTWs.",
      "rating": 5.0,
      "verified": true,
      "author": "Jules",
      "helpful_votes": 0,
      "publication_date": 20180530
    },
    {
      "title": "Big difference!!",
      "text": "Replaced a cheap intex pool pump for a 14\" pool with this pump, and what a difference. Easy setup following other reviewers advice. Love the timer feature. Only gave 4 stars because pump looses pressure after first hour, or has no pressure at start unless I wash and rinse the sand everyyyy time. Probally defective, however, I couldn't find an affordable replacement pump so I held on to it and prayed.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "This is a monster pump in a good way!",
      "text": "Much bigger than I expected. I ended up building it's own little pump house with decking. If I had known what a difference this would make in filtering our pool, I would have bought one of these years ago. Well worth the money! Make sure that you have it installed where you want it because once the sand goes in, you won't want to move this around!",
      "rating": 5.0,
      "verified": true,
      "author": "GS",
      "helpful_votes": 0,
      "publication_date": 20181114
    },
    {
      "title": "Game changer!",
      "text": "Man let me tell you this thing is worth every penny especially if your using the filter the Intex pool comes with. Last year I went with the Intex salt water setup and that was awesome except for always having to change the filter. This year is a new year and it already is a game changer. Buy this same filter and save yourself the headache, time and money.",
      "rating": 5.0,
      "verified": true,
      "author": "Elder03",
      "helpful_votes": 0,
      "publication_date": 20190601
    },
    {
      "title": "This updated pump runs quieter and draws less current than ...",
      "text": "This updated pump runs quieter and draws less current than the previous model. The pump on the previous model quit working after three years. I suspect this new pump will last much longer but time will tell. Why? Because drawing less current means it should not heat up as much and running quieter means it isn't straining and therefore should result in less wear and tear.",
      "rating": 5.0,
      "verified": true,
      "author": "Billy709",
      "helpful_votes": 2,
      "publication_date": 20170628
    },
    {
      "title": "Great alternative to Intex' even worse filter however",
      "text": "Great alternative to Intex' even worse filter however, this thing puts sand in the bottom of your pool quicker than you could ever imagine. China made garbage... you get what you pay for. Other friends of ours have the same issue. Do not buy this unless you want to vacuum your pool every 2 or 3 days. We live in the country with woods right by us, bugs always land in the pool every day. We get more sand in our pool than bugs now. At least it runs? DO NOT BUY THIS JUNK!",
      "rating": 2.0,
      "verified": true,
      "author": "Mary Crowell",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "Horrific technical support",
      "text": "After one day of use the pump would not turn on. Called customer service to try to troubleshoot and they treated me like the enemy telling me since I tried to fix it I voided the warranty. IF I used an extension cord I voided the warranty. If you even open the top you void the warranty. Jennifer was incredibly rude and really made me never want to buy from intex again. All I wanted was some tips on how to fix it and get it running. Anyways, after tinkering on my own I found that the \"rainproof\" GFCI cord was full of water and rusted. DO NOT BUY FROM INTEX",
      "rating": 1.0,
      "verified": true,
      "author": "John Pyle",
      "helpful_votes": 0,
      "publication_date": 20190515
    },
    {
      "title": "Best filter for Intex pools",
      "text": "I bought this three years ago and simply love it. Have had zero issues and works a hundred times better that the Intex paper filter units. I wish it had a little more suction, as I have an automatic pool cleaner that at times gets stuck; however, I found that weekly cleaning of the unit's filter eliminates this issue.",
      "rating": 5.0,
      "verified": true,
      "author": "Gray Surfer",
      "helpful_votes": 0,
      "publication_date": 20190930
    },
    {
      "title": "Great pool pump; quiet, powerful and priced right",
      "text": "I have an 18' above ground round poo and Ive been running this for 2 seasons after the 20 year old hayward got super noisy and weak and the Intex was an immediate improvement in power and (Ultra-low) noise. Seems to use less power even though it's not an EnergyStar product. Overall very happy and definitely recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "tech junkie",
      "helpful_votes": 0,
      "publication_date": 20200928
    },
    {
      "title": "VM customer service great, Intex not good.",
      "text": "The pump is awesome!! Have it on the timer and the pool has been clear ever since. Don't have to change or wash filters which took time. I love it. Had small leak but VM customer service is excellent, however I'm having issues with Intex customer support with them not speaking clear English causing a major communication problem. Still dealing with Intex with NO RESULTS. Yet. Been 2 months and no replacement part. Intex service gets a 0.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "Great product at a great price!",
      "text": "I’m not understanding why pool manufacturers are selling pools with pump and filter systems that are not adequate. We fought with our pool last summer and spent a ton of money on Filters and chemicals to still having cloudy and green water. Got this system and it’s been clear blue for months. Highly recommend this for above grounds.",
      "rating": 5.0,
      "verified": true,
      "author": "SOULREEPER",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Bought this larger to me pump and it works great. Added the intex pool cleaner vacuum and am ...",
      "text": "Bought this larger to me pump and it works great. Added the intex pool cleaner vacuum and am quite happy with the two together. We are surrounded by fires dropping so much ash that if it wasn't for these two items our pool would be a mess. We can see the ash falling and sinking to the bottom of the pool but it doesn't stay long thanks to having these. Thanks so much for a great item.",
      "rating": 5.0,
      "verified": true,
      "author": "Amoonsinger",
      "helpful_votes": 0,
      "publication_date": 20180804
    },
    {
      "title": "Awesome pool filter for an awesome price!",
      "text": "Best thing I ever bought for the pool! I hated those cartridge filters. They always gummed up and never worked great anyway. This pump is awesome for an awesome price! It was fairly easy to put together. It only took less then a bag of pool sand. After a heavy swimmer load, I just backwash, rinse, and done! Water always clears right up after a large swimmer load. Sand is supposed to be good for 5 years, so really this will be rather low cost to use! I also love that there's a timer on it, so I can set how many hours I want it to run each day, to save energy. This pump makes pool care a breeze!",
      "rating": 5.0,
      "verified": true,
      "author": "yoadri99",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Awesome product and Customer service!",
      "text": "I bought this as a replacement for the older model. The first one I received had a leak where the leaf catcher and pump connected. I contacted VM Innovations and they immediately sent me a return label via FedEx in an email. I received the replacement product within 4 days and man what a quiet, water moving pump it is!! I have this installed on a Bestway 18'x52\" pool and am super pleased with both the product and their awesome customer service!!",
      "rating": 5.0,
      "verified": true,
      "author": "soberatlast",
      "helpful_votes": 0,
      "publication_date": 20190519
    },
    {
      "title": "This pump is powerful and works great for vacuuming the pool!!!!",
      "text": "I ordered this pump as an upgrade to my Intex Easy Setup oval 18x10x42 pool. It took some adjusting of hoses with pvc fittings (didn’t require but a couple fittings to reduce to fit the hoses that came with the pump), and purchasing 2 plunger valves to cut off the water from the pool when backwashing or adding sand to the filter. It works wonderfully and using my vaccum to clean the pool really did the job. The pump is powerful and keeping my pool clean. I love it and would make this purchase again for any other pool I may have in the future.",
      "rating": 5.0,
      "verified": true,
      "author": "Tereasa Walls",
      "helpful_votes": 0,
      "publication_date": 20180622
    },
    {
      "title": "This is a great Filter and has lasted for many years",
      "text": "This is a great Filter and has lasted for many years! BUT.... The switch for the pump has failed. I found someone on Ebay that sells the replacement switch for $10 with instructions. Search \"INTEX-PUMP-SWITCH-3-way-switch-Hayward-CZ-And-HM2-Series-fixes-stuck-switch\" . I replaced the switch (better feeling switch) and got it going in a few minutes.",
      "rating": 5.0,
      "verified": true,
      "author": "carguy12224",
      "helpful_votes": 2,
      "publication_date": 20180625
    },
    {
      "title": "will fit coleman pool.",
      "text": "I have a 22 foot coleman above ground pool the filtering system was not cleaning like I thought. I purchased this one and what a difference no more changing cartridegs.went together good works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jim Ashmore",
      "helpful_votes": 3,
      "publication_date": 20180504
    },
    {
      "title": "Stong , reliable, not very loud , and impressive looking",
      "text": "I purchased this pump as an upgrade to an above ground pool. Best decision ever. The crappie pump that came with the pool was not moving enough water to maintain a clean pool. This pump can handle the job without breaking a sweat. Easy set up and install. I used a set of small bolts, washers, and nuts to connect the filter base to the pump. It seems to be much stronger. I shopped around for pool filter sand, and what worked for me was the HTH pool sand from ACE hardware store. It’s cheap and readily available. Now my family and I will enjoy a clean pool for the rest of the summer",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180819
    },
    {
      "title": "BEST PURCHASE EVER",
      "text": "This has saved TONS of money buying new filters for our pool. I wish we'd found this years ago. DO NOT let pool dealers talk you into getting replaceable filters, this is the last filter you will need and replacing the sand is MUCH easier than paying all that money for the replaceable filters!",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Hughes",
      "helpful_votes": 0,
      "publication_date": 20200508
    },
    {
      "title": "Throw your paper filters away and buy this!!!",
      "text": "I wasted a year of my life changing paper filters rinsing them out hoping to save money. I finally decided to go ahead and purchase the sand filter for this years pool season and I am so glad I did!!! So easy to use and clean. I live in the country so we get a lot of dirt in our pool and this thing is a beast!!! We bought the size up from what was recommended and it does a really good job.",
      "rating": 5.0,
      "verified": true,
      "author": "ranchy momma",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Great pump",
      "text": "I bought this pump because the pump on my pool was not getting the job done and it had turned green. I have a 20' x 4' round pool. It took me about a half hour to get it all attached to my pro-series pool and I did get a little wet. It took about a bag and a quarter of sand to fill the pump. After a week of cleaning and running this pump on the 12 hrs time , plus some chemicals. Now I have a crystal clear pool. Wish I had bought this last year.",
      "rating": 5.0,
      "verified": true,
      "author": "Heather smith",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "This sand filter pump is amazing. We converted our Summer Escapes pool so that ...",
      "text": "This sand filter pump is amazing. We converted our Summer Escapes pool so that we could use it with this pump and it works great. I love that we don't have to but paper filters anymore and feel like this will save us money in the long run. This pump runs quietly and is very easy to set up and maintain. Our pool had gone completely green when our original pool pump quit working- this sand filter pump got the water moving and filtering and with minimal chemicals we were able to clear up our water and swim again after only 48 hours. I can't say enough positive things about this pump. It really makes maintaining our pool very easy.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsay Patton",
      "helpful_votes": 0,
      "publication_date": 20160628
    },
    {
      "title": "Works great... for the first few months...",
      "text": "Well... I bought this pump last summer and it initially worked great! I only used it for a few months last summer, then again starting a couple weeks ago and 2 days ago the pump started running very poorly. It has very little suction so it wont even run the vacuum. I took it apart and cleaned out the debris stuck in the sand filter part and it it still having issues. It'll work strong for a minute every now and then, then it'll just barely work. It's been slightly over a year since I bought it so the warranty is no good. What a waste of money. :-(",
      "rating": 2.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20160803
    },
    {
      "title": "Well made, way better than cartridge filter",
      "text": "I’m quite impressed with the construction of this pump and filter. The size should be more than adequate for my 16’ intex pool. I don’t see any negatives thus far. Will update next season when I start using the pump. Update July 2018* This pump is working great. In combination with the saltwater system, it really keeps the water clean. I have a lot of trees so I still need to vacuum twice a week to keep the floor free of debris. This is a necessary upgrade for an intex pool this size. Might as well take the cartridge filter that comes with the pool and toss it in the trash.",
      "rating": 5.0,
      "verified": true,
      "author": "TheRealMikeZ",
      "helpful_votes": 0,
      "publication_date": 20171025
    },
    {
      "title": "I do not recommend this company to anyone",
      "text": "Pump only lasted about one month. Would not put volume of water out that it should. Called Intex, they did not want to honor the warranty. Ask to speak to supervisor, they would not let me speak to anyone else. I do not recommend this company to anyone. Will never buy this brand again.",
      "rating": 1.0,
      "verified": true,
      "author": "Bruce E. Lane",
      "helpful_votes": 17,
      "publication_date": 20170511
    },
    {
      "title": "IT WORKS GREAT FOR TWO YEARS NOW. NO PROBLEMS CLEAREST WATER .",
      "text": "THIS PUMP AND FILTER IS THE BEST FOR ANY SIZE POOL FROM 10 FT. ROUND TO 20 FT. ANY DEPTH. IT PRODUCES THE CLEAREST WATER THAT YOU COULD EVER WANT. VERY EASY TO OPERATE . ONCE SET UP, JUST FLIP THE SWITCH. GREAT VALUE FOR THE MONEY. THROW AWAY YOUR PAPER FILTERS THAT ARE USELESS.",
      "rating": 5.0,
      "verified": true,
      "author": "FRANK P",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "This pump moves a lot of water!",
      "text": "We upgraded this for our 22 foot Coleman pool. This pump and filter has kept our pool extremely clean. We have had other pools with lesser filters and systems that haven't kept up with the demand. The sand filter does a great job of clearing up the water in mere hours after initial fill up and cleaning. It is a great value for the money. Components are solid and I expect them to outlive the pool itself.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "quiet and powerful but now dead...",
      "text": "Revision. Installed 6/2016 dead after 2 summer only uses! 90 warranty doesn't cut it! I loved this filter! Now it is 1 star... Just installed it yesterday. Upgraded from a 1200 GPH to the 3000 GPH model. Wow what a difference. i have the Intex spray fountain and it is over powered with it. I think I will rig up a flow valve to divert some of the flow to the wall outlet AND the Intex fountain.",
      "rating": 1.0,
      "verified": true,
      "author": "Mike McC",
      "helpful_votes": 2,
      "publication_date": 20160623
    },
    {
      "title": "Fortunately we had part of an old unit we could ...",
      "text": "Beware you may be ordering the \"pump only\" which does not come with the ECO. If you need a complete saltwater be sure you're ordering the complete system. Otherwise you'll get only the pump! Fortunately we had part of an old unit we could piece together to make a complete system. We thought we were getting a complete system and were only sent the pump (and only charged for the pump!).",
      "rating": 4.0,
      "verified": true,
      "author": "VickyB",
      "helpful_votes": 0,
      "publication_date": 20180610
    },
    {
      "title": "Get this sand filter system",
      "text": "This is the fourth year for our above ground 20'x48\" intex pool....the first 2 years we used the supplied pump and filter system.....talk about a pain in the butt, changing filters and waiting on that little pump to clean the pool. Last year i bought this sand filter pump and the first day our pool was crystal clear after running it for a few hours. I had to modify the bottom of the old filter housing to accept the inch and a half hose to the new pump and that was the hardest part of setting it up.......i might mention that ace hardware sells 50 lb pool sand for 13 dollars a bag.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry Ritteman",
      "helpful_votes": 0,
      "publication_date": 20160612
    },
    {
      "title": "Awesome filter. Would highly recommend.",
      "text": "We purchased the 16 inch model and are using it on our 17-18 foot above ground pool. Within 2 days the water is possibly the clearest it has been in the 6 or 7 years we have had the pool. There is so much water flowing through that our vacuum moves faster and cleans up better than with any sand filter we have had before. Hands down I would purchase again and I would even recommend to anyone looking.",
      "rating": 5.0,
      "verified": true,
      "author": "T. H. Murray",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Buy this if you want you pool as clean as it can be!",
      "text": "Had a nice slimy pool due to the previous pump failing (the dinky one that came with my 18x10 oval intex). Upgraded to this bad boy and the salt water system and my pool was literally crystal clear before the next day. This thing has power and actual moves the water around the pool. You can get the sand at Home Depot, and you will need a lot of it. It will be heavy after it's filled so make sure u have it where it will stay. All of the fittings were compatible. Easy to use and flush. I would definitely recommend just buying this to place on ur new pool.",
      "rating": 5.0,
      "verified": true,
      "author": "nursenikki",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "BEST SET-UP HANDS DOWN",
      "text": "We purchased this pump for our pool and could not be more happy! This setup is by far the best and most cost effective. The set-up was very easy and it functions perfect. The sand filter replaces the cartridge filters that were costing us $5 dollars each, which saves you a ton of money. We live in a hot climate so we use our pool year round, during the summer it was hard to keep it clean and algae free before we got this system. I would recommend this to anyone with an above ground pool, the money you save in filters alone will pay for the system and not to mention it keeps the pool crystal clear.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160708
    },
    {
      "title": "Very good pump for the price.",
      "text": "What a great pump. Works better than our last sand pump and was $130 less. I like that you can easily turn it on and off with out having to unplug it, our last pump was a pain. This is much quitter than our last one too and runs very smoothly. The basket is twice the size for catching debris, which is nice, because one big leaf could make the last pump stop flowing. Overall very happy with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Momwith2boys",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Slapped it on my 15' round intex (approx 4000 gal) and I only need to run it 4-6 hours during the day for it to do a great job. Backwashing / Rinsing / Timer settings are ...",
      "text": "This thing is powerful. Slapped it on my 15' round intex (approx 4000 gal) and I only need to run it 4-6 hours during the day for it to do a great job. Backwashing / Rinsing / Timer settings are all simple to use. Setup was quick and straightforward. Love it.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Janz",
      "helpful_votes": 2,
      "publication_date": 20170608
    },
    {
      "title": "This filter was a great choice",
      "text": "This filter is incredibly powerful. I would have written sooner but I had medical issues. Upon inspecting the items that Came In The Box the pump housing had a crack in it. I needed to use the filter my old filter had died and I needed one right away. I would definitely recommend buying this to anybody looking for one",
      "rating": 4.0,
      "verified": true,
      "author": "donald iannucilli",
      "helpful_votes": 0,
      "publication_date": 20180824
    },
    {
      "title": "Quit after 1 season!",
      "text": "Went to set this up for the season and the motor has seized! I bought this with the salt system and both components have seized. I stored them properly and in a she away from the pool. Dissatisfied to have to pay another $300 after so short a lifespan on these!!",
      "rating": 1.0,
      "verified": true,
      "author": "Trooper Gore",
      "helpful_votes": 0,
      "publication_date": 20200418
    },
    {
      "title": "Accessories are cheap.......look elsewhere",
      "text": "stopped pumping after two days after being installed; ruining salt water filter and turning salt water green. And after all this, I am trying to gt a hd f the men who put up the pool and by that time they said I as TOO late to return this defective product.I will not buy any pools from Intex again.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "need better instructions",
      "text": "we had issues adding the sand, they failed to mention to hold down the pipe or else sand gets under it. we had to remove all the sand to fix the issue. Also could not find an easy way to empty the sand. I would hate to have to do it with dirty gross sand.",
      "rating": 5.0,
      "verified": true,
      "author": "David & Roberta",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Great Filter and Pump For ALL Pools",
      "text": "This pump's hoses may not fit your pool but it's well worth it to hard plumb with pvc pipe. I hard plumbed this pump with 1 1/2 pvc a intex skimmer in a 15 foot round pool. We run this pump 4 to 6 hours a day. It has so much suction we have not had to skim the pool all year.",
      "rating": 5.0,
      "verified": true,
      "author": "Trey",
      "helpful_votes": 0,
      "publication_date": 20190728
    },
    {
      "title": "Only lasted a year",
      "text": "So I've had this for a year and I just refilled my sand and was getting my pool ready and when I went to turn it on the motor went out! It has only been a year and it's done. It did work great at first but it's not worth it if it only lasts a year I've been trying to get ahold of Intek because it has a 2yr warranty and I haven't had any luck they have the worst customer service I wouldn't recommend anyone to waste your money on this filter.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Working perfect for our pool!",
      "text": "Last summer we purchased an above ground pool. It came with a small filter pump that did not keep the pool very clean. We could not swim a full day without the water getting really gross. My husband found this pump and after reading reviews and looking at other filter pumps we went with this one. We had to do some slight modifications for the plumbing of the hoses, but it was easy and is working great. Our pool is crystal clear and we are not having to put as much chemicals in it. Absolutely, no regrets in buying this pool filter pump.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Manalo",
      "helpful_votes": 0,
      "publication_date": 20190516
    },
    {
      "title": "Great buy",
      "text": "I bought this as an upgrade to the pump that was provided with the pool. Three times the power and the pool is crystal clear",
      "rating": 5.0,
      "verified": true,
      "author": "Kirk Radovcich",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Extremely wonderful pump!",
      "text": "Very pleased with new pump! I have a 15'x48\" Intex metal frame pool and my original pump that can with the pool broke twice so I wanted to upgrade. I'm so glad I did. The old pump only cycled 1500GPH where as this new one moves 2500 GPH so much better and after sitting for 6 days with no pump the pool got really nasty I hooked up this new pump and within two days it was completely clean! extremely happy with my purchase and would definitely recommend to anyone who would like to upgrade. The sand for this system is also much cheaper than replacing the paper Cartridge filters like I was doing before. A much better buy",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160317
    },
    {
      "title": "This is cheap, seasonal, limited use gear. Don’t expect much.",
      "text": "After four days of intermediate usage the hose between the filter and the return to the pool has blown apart. The hose is damaged beyond repair so I will now attempt to contact customer service when they open on Monday. I’m glad I was home when it happened and heard the gushing water, otherwise I’m sure the pool would be half empty and the pump would have likely burned up from running dry.",
      "rating": 2.0,
      "verified": true,
      "author": "T. Keplinger",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "Awesome Filter",
      "text": "We use this pool for a 6,000 gallon pool and it keeps out water crystal clear. We converted it from salt to chemical and it worked out great. It has a timer so that makes it convenient to keep the up with filtering daily. We kept the sand with the chemical process and it seems to be doing fine. Great filter, good price and arrived quick.",
      "rating": 5.0,
      "verified": true,
      "author": "ojust4today",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "Just awesome!",
      "text": "I recommend these sand filters to anyone who owns an intex, Colman, bestway etc. type pool. It’s a must have. Easy set up. Easy programming. Sand will last two to three years. Pair this with a salt filter and your practicals trouble free all season. You still need to vacuum and sweep your pool regularly but as long as you backwash once a week and do your weekly cleaning your going to be happy.",
      "rating": 5.0,
      "verified": true,
      "author": "The real dad show!",
      "helpful_votes": 0,
      "publication_date": 20181117
    },
    {
      "title": "Worked great, Heavy, plenty of power, used w/Saltwater system.",
      "text": "Rock solid. Worked great, used all summer. Cleaned, emptied, ran, flushed, did all the expected things. Everything worked flawlessly all summer. While one summer is not a true gauge of quality and performance, so far - it has been perfect. More water movement than the previous/original pump, which is a very good thing for pool circulation. Unit says to not leave in the rain, so I built a platform above the units to provide at least some protection from rain, but it still was damp off & on during the summer. Used in conjunction with the Krystal Clear Saltwater System w/ECO for a 18ftx4ft round pool. Plenty of power.",
      "rating": 5.0,
      "verified": true,
      "author": "ForrestA",
      "helpful_votes": 0,
      "publication_date": 20161104
    },
    {
      "title": "Works wonders",
      "text": "Wow, This pump has some power. We have had it for a month or so and it does the job. The only thing I was disappointed with is, it did not come with the screws that attach the two pumps together to the base provided. The box was pretty mangled at that the bottom, so I’m not too sure who’s at fault. Whether it be, the company or it just got damaged during transportation that maybe caused the screws to fall out.",
      "rating": 4.0,
      "verified": true,
      "author": "duchene3",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "So glad I bought this",
      "text": "So glad I bought this! We have an 18x48 Coleman above ground pool -water is clear- great circulation- we also installed an Intex Salt water pump- purchased a wall mounted skimmer from our local pool store and installed it as well. I reviewed many post and watched several videos before deciding on my purchases & it's by far the b st decis",
      "rating": 5.0,
      "verified": true,
      "author": "Glampers@theLake",
      "helpful_votes": 2,
      "publication_date": 20170705
    },
    {
      "title": "I bought the 16\" model and it does a fantastic job cleaning our 18' intex pool",
      "text": "I bought the 16\" model and it does a fantastic job cleaning our 18' intex pool. I have to back flush about every 2-3 weeks depending on the weather and how much trash the gets blown into the pool. We also bought the auto pool cleaner made by intex and has no issues at all driving the vacuum. I'll update this review as time goes on but after several weeks I have to say I highly recommend moving to this sand filter over any of the cartridge based filters. You won't be disappointed!",
      "rating": 5.0,
      "verified": true,
      "author": "Impact9",
      "helpful_votes": 0,
      "publication_date": 20170722
    }
  ],
  "product_meta": {
    "title": "Intex Krystal Clear Sand Filter Pump for Above Ground Pools, 12-inch with GFCI and Intex Deluxe Wall Mount Surface Skimmer",
    "rating": 4.5,
    "feature_bullets": [
      "Keep your above ground pool water clean, soft, and refreshing with the Krystal Clear Sand Filter Pump by Intex. The all natural sand provides excellent water filtration as the 6-function control valve allows the pool owner to: filter, backwash and rinse, recirculate, drain and close the system.",
      "The built in 24-hour timer adds to the hassle-free experience with maintaining a cleaner pool. The strainer basket provides easy-cleaning, and prolongs the life of the sand.",
      "The Krystal Clear Sand Filter Pump generates a pump flow rate of 2,100 gallons per hour, ideal for above ground pools 16' to 24'. This pump requires virtually no maintenance except replacement of sand every 5 years.",
      "Intex Deluxe Wall Mount Surface Skimmer",
      "Help catch leaves and debris before they sink to the bottom of the pool with the Intex Deluxe Wall Mount Surface Skimmer.",
      "The skimmer easily mounts to Easy Set or metal frame pool sidewalls with an adjustable bracket and attaches to the filter pump for automatic skimming."
    ],
    "specifications": {
      "ASIN": "B077JB2NVS",
      "Customer Reviews": "4.5 out of 5 stars4,757 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#39,873 in Patio, Lawn & Garden"
    },
    "categories": [
      "Pools, Hot Tubs & Supplies",
      "Patio, Lawn & Garden",
      "Garden & Outdoor",
      "Filters & Filter Media",
      "Sand Pool Filters"
    ],
    "price": ""
  }
}