{
  "website_summaries": [
    {
      "verdict": "Nice three-seater theater unit doesn't have as many bells and whistles as some others, but is a good price and looks great.",
      "pros": [
        "Easy to use manual recliners",
        "Two consoles with cup holders",
        "Fairly concise length at 95 inches",
        "All one unit",
        "More affordable than other theater seating on the market",
        "The \"Leathersoft\" material has a nice feel",
        "Comfortable padding"
      ],
      "cons": [
        "This unit is not a wall-hugger",
        "You will need a couple of feet behind the unit to be able to completely recline"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Better than advertised",
      "text": "Better than advertised! Professional delivery service. Great quality and modern look to my home theatre room. One note... All three chairs come as one unit. They do not come apart except for the backs of chair. Something to think about if you are putting them in a basement with narrow stairs or corners to work around. They are heavy but nothing two average size guys couldn't handle.",
      "rating": 5.0,
      "verified": true,
      "author": "Melissa ",
      "helpful_votes": 102,
      "publication_date": 20160829
    },
    {
      "title": "Better Than AMC!",
      "text": "My first thought when I think of home theatre furniture is unaffordable, especially when shopping around at theatre stores... But these totally changed that for me! They are so affordable, very comfortable, recline easily and look stylish. The storage options within them for drinks or snacks is also great. I purchased two and raised one by building a carpeted platform to maximize the viewing potential! They are very heavy and some assembly is required but it's all worth it when you're done!",
      "rating": 5.0,
      "verified": true,
      "author": "James Judge",
      "helpful_votes": 233,
      "publication_date": 20150131
    },
    {
      "title": "Comfortable and beautiful.",
      "text": "Absolutely love it!!! I just realized that my apartment has been furnished by Amazon. Any how, this arrived on time and the two gentleman delivered this majestic beauty inside my apartment - but they didn't open it. It took my husband's strength and my brain to unbox this. Very well packaged. Now the 3 of us can go back binge watching :) Update: So far it's been awesome-- except for one thing. You really need to push back hard in order to recline. If you are holding a plate of something- you will need to first put it down since you will need both of your hands to help you recline. Other than that- it's been performing well for us.",
      "rating": 5.0,
      "verified": true,
      "author": "Bejeweled",
      "helpful_votes": 28,
      "publication_date": 20160726
    },
    {
      "title": "Five Stars",
      "text": "Amazing product and great price. Love my new movie theater thanks to these seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Max Grinberg",
      "helpful_votes": 20,
      "publication_date": 20170524
    },
    {
      "title": "Fun - Leather Seating!",
      "text": "I feel like you get what you pay for, so I don't want to be too harsh. If I could give 4.5 stars I would. 1. They work just like they are supposed to. 2. They are very easy and quick to assemble 3. They have good cup holders and storage places 4. They look nice enough 5. They were very inexpensive and delivered directly to my door 7. It is really fun watching movies in them 8. They are a really nice espresso brown 9. They seem pretty durable",
      "rating": 4.0,
      "verified": true,
      "author": "SuperTwinsMom",
      "helpful_votes": 66,
      "publication_date": 20140714
    },
    {
      "title": "STAPLES in the screw threads, From bad to worse!",
      "text": "Poor workmanship on the two seater, missing parts, then reclined in this chair and a screw dislodged! Ordered a replacement, which was a complete headache as the shipping Company had NO IDEA that this was a same time delivery of the replacement and pickup of the damaged seats. We eventually received the replacement in WORSE condition than the original! Staples in the screw threads, a GIANT Rip in the liner, another leg hole was already torn open so much that the material was coming out. This set definitely skipped a quality check! VERY DISAPPOINTED",
      "rating": 1.0,
      "verified": true,
      "author": "mor",
      "helpful_votes": 4,
      "publication_date": 20180210
    },
    {
      "title": "They do not recline and lock in place!",
      "text": "The chairs came in and were delivered to the door - they kindly took them 8 feet into the living room for me and put them together (placed the backs on). At the time I did not know they were not real recliners that actually lock into position. They are to be pushed and your weight balance is the only thing to keep the recline position. Called immediately to get them returned as that was the whole purpose of this purchase. They looked cheap in the black vinyl so you get what you pay for.",
      "rating": 1.0,
      "verified": true,
      "author": "webers",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "Love it, but cautiously...",
      "text": "The gentleman who delivered the couch helped me get it up three flights of stairs into my apartment. The good news is assembly is the easiest thing imaginable. You literally just snap the back rests into place and it seems to be extremely tight, which is good. I love the deep storage compartments and the cup holders. The reclining action is also great. the only reason that I give this four stars is that the seat portion seems to be coils and while this gives good support, it concerns me that the coils will have issues after use. If it makes it the distance, I will come back and update.",
      "rating": 4.0,
      "verified": true,
      "author": "jake",
      "helpful_votes": 5,
      "publication_date": 20150815
    },
    {
      "title": "These units can be easily moved with 2-3 persons",
      "text": "I agree with others. These are first quality theater seats. I was going to replace 6 worn-out theater chairs in our home theater with chairs on sale at costco. These were at least $1200 less for 6 chairs delivered considering no tax. Quality the same . These units can be easily moved with 2-3 persons. My advice: Give the delivery guys $20-40 and they will unwrap the units and carry in and take the rubbish out including the wooden pallet.",
      "rating": 5.0,
      "verified": true,
      "author": "none",
      "helpful_votes": 7,
      "publication_date": 20151230
    },
    {
      "title": "Good value, not that comfortable.",
      "text": "Likes: 1. Leathersoft has a nice feel 2. Storage consoles are big, I can put a blanket and the remote controls inside. 3. Price 4. Looks good. Dislikes: 1. Not that comfortable as many reviewers state. Not suitable to take a nap. 2. I am 5'10\", 170lbs, I don't find it roomy. 2. It has 3 positions, no intermediate positions available. 3. Cup holders are good for glasses, not for coffee mugs.",
      "rating": 3.0,
      "verified": true,
      "author": "Manolo",
      "helpful_votes": 3,
      "publication_date": 20180415
    },
    {
      "title": "I do not recommend.",
      "text": "Unfortunately the chairs are uncomfortable and in the half reclining position the chair does not stay locked in. The full reclining position is very uncomfortable putting your head straight up in the air. I do not recommend this unit.",
      "rating": 1.0,
      "verified": true,
      "author": "Gary",
      "helpful_votes": 4,
      "publication_date": 20170401
    },
    {
      "title": "A dual throne fit for the \"Man Cave\"",
      "text": "The \"Man Cave\" needed seating fit for the king and a friend. I got this setup as soon as I moved into my new castle. Initially, I was worried that it wouldn't be all I hoped. I've been pleasantly surprised. This set is comfortable, electrically adjustable, has a roomy center console (for remotes, snacks, etc.) that acts as a wide armrest. The only downside to it is that if you have a \"fidgeter\" (that annoying person who squirms and tries to \"find the right contortion\") the right chair may come uncoupled from the left. Not really an issue of sturdiness, but I do wish something rather than inertia held the two seats together.",
      "rating": 4.0,
      "verified": true,
      "author": "BEAST",
      "helpful_votes": 0,
      "publication_date": 20180618
    },
    {
      "title": "it's pretty good.",
      "text": "When you lay back in it, there is a big bar in your back that makes in very uncomfortable. The seats are also quite narrow. Other than that, it's pretty good.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Callahan",
      "helpful_votes": 13,
      "publication_date": 20150303
    },
    {
      "title": "NOT A lOUNGER",
      "text": "This truly is a theater seat and would be fine for that but this is not a lounge chair. I was not able to lay one side back at all and the other side would not stay laid back. The footrest only went up half way and would slowly go down. This was not a powered one. Don't know if having it powered would make the difference. It is a small chair. Not comfy for my hubby, 6 feet, 200 lbs. We are returning it. It is nice looking and I liked the leather. It seemed to put together OK. Just not what we needed.",
      "rating": 3.0,
      "verified": true,
      "author": "Kim",
      "helpful_votes": 0,
      "publication_date": 20190604
    },
    {
      "title": "Nice seats, manual recline here means push back with your body.",
      "text": "Great seats but definitely not for bigger people. Not a huge fan of the push-back recline, I'd have much preferred the usual pull-release lever. The description only said \"manual\" recliner, they should specify what type of manual recline it has.",
      "rating": 4.0,
      "verified": true,
      "author": "Dani",
      "helpful_votes": 3,
      "publication_date": 20170527
    },
    {
      "title": "Well built. Leather-like buttery soft material. Comfortable.",
      "text": "Comfortable; well built, with leather-like feel. Plenty of room for larger-taller people. The tilt mechanism appears sturdy. Arrived on time and very little assembly (just sliding the two back pieces onto metal catches). This is a heavy piece of furniture; it doesn't sway back and forth when two people sit in it. The center console area is quite large-and deep, as are the two cup holders. The brown color is about what you view in the picture-not light, not real dark. I view this definately worth the price. The quality is well above the price. I'd buy this recliner again and recommend it.",
      "rating": 4.0,
      "verified": true,
      "author": "Yarburger",
      "helpful_votes": 35,
      "publication_date": 20140715
    },
    {
      "title": "great chairs for theater",
      "text": "great chairs for theater. May have to take them a part to get them in to the basement. Not a big deal. Four screws and they are separate.",
      "rating": 5.0,
      "verified": true,
      "author": "Sanjiv  Naik",
      "helpful_votes": 7,
      "publication_date": 20170602
    },
    {
      "title": "Our Home Theater is complete.",
      "text": "Lives up to expectations and other positive reviews. Well made and comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Steve Gordo",
      "helpful_votes": 22,
      "publication_date": 20150705
    },
    {
      "title": "Good for about 2 years then the chairs start to fall apart",
      "text": "I bought this a few years ago and they worked pretty well for my media room. Fast forward a couple of years and the upholstery started to peel off. Now every chair is missing big chunks of the faux leather upholstery. No I need to replace these theater seats. I only got ab out 3 years out of these. Not good quality at all.",
      "rating": 1.0,
      "verified": true,
      "author": "JN",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "I should have paid more attention to some of the ...",
      "text": "I should have paid more attention to some of the other previews, there is no handle to let the seats back and after several months the seat bottoms are lumping and makes popping noises.",
      "rating": 3.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 26,
      "publication_date": 20150709
    },
    {
      "title": "Come in 1 piece so may be hard to move to your basement",
      "text": "Gave 4 stars because I had to take it apart in order to move it to my theater room which is in my basement. I’m so happy I figured out how to take it apart. Other than that I love it",
      "rating": 4.0,
      "verified": true,
      "author": "Ebony",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Affordable",
      "text": "AFFORDABLE movie room chairs. Quick shipping. Properly protected. Not real leather, bolts missing on some of the chairs, legs hang over the foot rest if you're over 5ft 6, comes 95 % assembled just snap on the back and screw in the legs.",
      "rating": 4.0,
      "verified": true,
      "author": "mor",
      "helpful_votes": 0,
      "publication_date": 20180127
    },
    {
      "title": "So far, so good",
      "text": "So far, so good. We tried out several different theatre style chairs and decided to take a chance on these. So far they are very comfortable and seem to be higher quality than you would expect for the price. I have three herniated disc in my lumbar spine and these chairs offer great support for me. The shipping was fantastic and the guy who delivered helped me carry them upstairs to my bonus room.",
      "rating": 5.0,
      "verified": true,
      "author": "Stuart",
      "helpful_votes": 4,
      "publication_date": 20151003
    },
    {
      "title": "Depends on what you are looking for....",
      "text": "These chairs look very nice! I gave it a 4 stars because the material quality is very questionable and I am not sure how long it will last with the use of them everyday. Also, one of the chairs, you really have to work hard for it to stay reclined. Overall, my husband is very happy with them for his man cave.",
      "rating": 4.0,
      "verified": true,
      "author": "Finding Tammy",
      "helpful_votes": 2,
      "publication_date": 20170906
    },
    {
      "title": "Poor Quality",
      "text": "The recliners look nice. How ever they will not stay reclined and padding is horrible. Save your money. This is a very poor quality, virtually no usable as a recliner and the odd angle of the seat makes it a tiny bit uncomfortable to sit in.",
      "rating": 2.0,
      "verified": true,
      "author": "Md",
      "helpful_votes": 0,
      "publication_date": 20190501
    },
    {
      "title": "Look good but won't stay open on it's own.",
      "text": "Yes, these are cheap as far as theater chairs go, but they don't stay open at all without your body weight. Afraid to fall asleep in them because i'm sure once I stop pushing they will close up! Sitting in these is really a chore, wish I had paid a little more for something that would lock open.",
      "rating": 3.0,
      "verified": true,
      "author": "wendy ducham",
      "helpful_votes": 2,
      "publication_date": 20180413
    },
    {
      "title": "the Chinese have done a remarkable job remarkable job of making this \"leather\" look and feel exactly like the much sought after",
      "text": "Advertised as leather, yet if it is in fact leather, the Chinese have done a remarkable job remarkable job of making this \"leather\" look and feel exactly like the much sought after.....vinyl..! However construction quality is quite good, and the unit is quite comfortable, but the reclining mechanism allows only two reclining positions as opposed to variable. That being said,\"you get what you pay for\" and for the money l'm happy with my purchase.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171211
    },
    {
      "title": "I really love my recliner's I purchased it for my theater room",
      "text": "I really love my recliner's I purchased it for my theater room, I think they look really stylish, fancy and comfortable. For what I paid I think they are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Roger Cruz",
      "helpful_votes": 3,
      "publication_date": 20161220
    },
    {
      "title": "Looks great! Only problem is no lever to push back",
      "text": "Looks great! Only problem is no lever to push back. You need to push hard to enjoy push back. Assembly is easy. If kids pull it from back very hard, seat may fall. First seat and then push back. Nothing in seat and push back, the seat may fall down. Great for it's price.",
      "rating": 4.0,
      "verified": true,
      "author": "Mahesh Rajyaguru",
      "helpful_votes": 3,
      "publication_date": 20160209
    },
    {
      "title": "This was an awesome product. I'm not going to lie when I ...",
      "text": "This was an awesome product. I'm not going to lie when I first looked at it online I was kind of skeptical but the pictures help me to make this purchase. This is exactly what it looks like online when it reclines it reclines all the way flat and is very comfortable the middle Council is enough space where you can put covers or maybe one pillow. It looks great in my theater room",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20151224
    },
    {
      "title": "Good for price",
      "text": "Good for what it is. I'm 6'8\" and fit ok in these. They are the cheapest available so don't expect them to be more than they are.",
      "rating": 4.0,
      "verified": true,
      "author": "Jaborrowman",
      "helpful_votes": 25,
      "publication_date": 20140701
    },
    {
      "title": "Ok",
      "text": "These are ok, but if you are tall these are not for you. The recliner won’t stay up, if you have long legs. These are not very comfortable either. So if you’re looking for comfy movie night, you might want to go with something else.",
      "rating": 2.0,
      "verified": true,
      "author": "Chastity Stiff",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Seats are nice..",
      "text": "Seats are nice...definitely not oversized so be aware. The material the seats are covered with feels like good quality and we'll see how it holds up. The only major complaint I have about these seats is that there is not a lever releasing the reclining function you have to push back and pull it forward. I think if a handle was installed for the reclining function I would increase my rating by one star.",
      "rating": 3.0,
      "verified": true,
      "author": "DK",
      "helpful_votes": 3,
      "publication_date": 20140904
    },
    {
      "title": "Comfortable",
      "text": "Really comfortable and fit into my decor perfectly. Recliner is push up with your feet (no levers) so may be a bit difficult for some. Love the material. The counsel is HUGE.",
      "rating": 5.0,
      "verified": true,
      "author": "Me",
      "helpful_votes": 0,
      "publication_date": 20180507
    },
    {
      "title": "They look great in my home theater",
      "text": "These seats for the price are great I got 2 units each unit is one piece you just have to put the back rests in which is very easy no tools required and there are feet that screw into the bottom the cup holders are very handy and each unit has 2 storage compartments",
      "rating": 5.0,
      "verified": true,
      "author": "Rich B",
      "helpful_votes": 4,
      "publication_date": 20141018
    },
    {
      "title": "Very pleased with these",
      "text": "Very pleased with these. I bought two for a theater room. They arrived by CEVA 3 hours late but they delivered in house when I requested it. The couches are very plush on the back. The seats are a little firm but comfortable and I'm sure they will break in over time. They look very high end and I would definitely recommend them. Cons: reclining isn't extremely smooth and the lack of headrest on the back puts your head in an unsupported position. A head pillow is almost needed if you intend to watch TV.",
      "rating": 4.0,
      "verified": true,
      "author": "buddy",
      "helpful_votes": 3,
      "publication_date": 20150320
    },
    {
      "title": "seats will not recline and it will popup slowly. ...",
      "text": "seats will not recline and it will popup slowly. if you all over 5'8 the legs part of the chair will not stand recline.",
      "rating": 1.0,
      "verified": true,
      "author": "Felicia T",
      "helpful_votes": 3,
      "publication_date": 20170818
    },
    {
      "title": "Reasonably comfortable. For the money they are actually more comfortable ...",
      "text": "Reasonably comfortable. For the money they are actually more comfortable than I expected, but I can already tell that with moderate use the padding in the armrests in particular is going to wear thin fairly fast. Overall, happy with this purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "D. DAmico",
      "helpful_votes": 0,
      "publication_date": 20170302
    },
    {
      "title": "Very happy with my purchase",
      "text": "Very happy with my purchase. It was an excellent price, and the product was just as described, Looks great in my home theater!",
      "rating": 5.0,
      "verified": true,
      "author": "Jamie K",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Theater seats",
      "text": "Shipped very fast was easy to assemble seat backs snap right in .material is very plush feeling like real leather seats are extremely comfortable you will have to fight to stay awake when reclined all way back lots storage in arm rests.love it I'm Saveing up to buy another row.",
      "rating": 5.0,
      "verified": true,
      "author": "Drakelore",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Too expensive for only relining in 2 positions but very nice looking furniture.",
      "text": "They seats are very modern and sleek looking, however they only recline 2 ways and have no in between. I think for 1000 dollars they should recline to where I want them. Overall...kinda expensive for what they are but also very nice looking in my living room.",
      "rating": 4.0,
      "verified": true,
      "author": "Chefron213",
      "helpful_votes": 0,
      "publication_date": 20190607
    },
    {
      "title": "You get what you pay for",
      "text": "That saying: \"you get what you pay for \" absolutely applies to this product. Cheap, uncomfortable, and not very solid!",
      "rating": 2.0,
      "verified": true,
      "author": "jeff",
      "helpful_votes": 0,
      "publication_date": 20200102
    },
    {
      "title": "Surprise Hubby gift!",
      "text": "I bought two sets for my husband as a surprise for a room remodel and he is a happy camper!",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Hodge",
      "helpful_votes": 2,
      "publication_date": 20170624
    },
    {
      "title": "Nice looking and comfortable",
      "text": "Very impressed with these, but have not had much time in them yet. But they arrived in great condition and are very comfortable. Yeah, they were heavy getting to the upstairs game room.",
      "rating": 5.0,
      "verified": true,
      "author": "Russell C. Cole",
      "helpful_votes": 2,
      "publication_date": 20151017
    },
    {
      "title": "Very pleased with purchase!",
      "text": "Nice seats for the money. Although not real leather, look very good in out tiered theater. Had the seats for a few days and am very pleased with purchase. Easy to assemble. Bottom portion is very heavy to move - beware!",
      "rating": 5.0,
      "verified": true,
      "author": "T. Garey",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Squeaky and cheap. Keep looking!!",
      "text": "Got the electric version and it was not leather and was poorly constructed!",
      "rating": 1.0,
      "verified": true,
      "author": "ssanch",
      "helpful_votes": 0,
      "publication_date": 20200628
    },
    {
      "title": "Good buy- very comfortable",
      "text": "Great buy for the money. I was a little nervous when I ordered these, but they are way more comfortable than I was expecting. The \"leather\" actually feels like real leather and not some recycled plastic posing as leather (I'm looking at you Hyundai). Don't be afraid to spend less. You are not sacrificing quality, these are great chairs. I also got the 2-seat set.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared M.",
      "helpful_votes": 0,
      "publication_date": 20151105
    },
    {
      "title": "Disappointing for the money spent",
      "text": "I've had these for about four months, and one of the reclining mechanisms is already broken. That will teach me for trying to go cheap.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael",
      "helpful_votes": 6,
      "publication_date": 20150702
    },
    {
      "title": "Cheaply made",
      "text": "I've owned this for two years now, the springs in the seat have failed, one recline switch has failed and the faux leather is peeling off",
      "rating": 2.0,
      "verified": true,
      "author": "Alfred C. Ritter",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Nice comfortable furniture",
      "text": "Nice comfortable furniture. No problems or complaints. The distance needed from wall seems excessive,its more than the 12\" given I think. Lots of lost space in my room.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Vest",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Perfect for our playroom gaming area",
      "text": "Perfect for our playroom gaming area. Kids love it no is great for adults too. Simple to put together. It was heavy, but husband and I got it up the stairs. Cup holders and storage is wonderful.",
      "rating": 4.0,
      "verified": true,
      "author": "zenaairgal",
      "helpful_votes": 2,
      "publication_date": 20150308
    },
    {
      "title": "Five Stars",
      "text": "They are comfortable and the right size. The seats are easy to clean",
      "rating": 5.0,
      "verified": true,
      "author": "tcrossmd",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Happy Owner",
      "text": "Good quality leather, comfortable and sturdy chairs. Furniture works for my kids playroom. However, furniture will not be feasible for adults 250lbs and plus...not wide enough. Overall, I am happy I purchased the chairs.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170623
    },
    {
      "title": "Looks good but not as comfortable as they look",
      "text": "Looks good but not as comfortable as they look. But serves the purpose",
      "rating": 3.0,
      "verified": true,
      "author": "Troy Williams",
      "helpful_votes": 0,
      "publication_date": 20171213
    },
    {
      "title": "This product looks great but to me the flaws outweigh the aesthetics",
      "text": "This product looks great but to me the flaws outweigh the aesthetics. The recline function goes back to normal with the slightest movement. And the cushioning in the seats feels like I'm sitting on springs and its very uncomfortable after an hour or so.",
      "rating": 2.0,
      "verified": true,
      "author": "Lannard Brown",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Three Stars",
      "text": "When you lean the seat back there’s a bar that awkwardly presses into your back.",
      "rating": 3.0,
      "verified": true,
      "author": "Ché Bey",
      "helpful_votes": 0,
      "publication_date": 20180212
    },
    {
      "title": "Great value for HT seating",
      "text": "Bought these for our HT room. A neighbor had some and we liked the feel and look. Yes, they're a pain to get up stairs as they're bulky and heavy but they're also a tremendous value. 5 HT seats for barely 1k? Heck yes. They are extremely easy to put together as the back only needs to be slid into place. We have a teen and pre-teen and didn't want to invest thousands into seats that may not be treated as gently as we'd prefer. As sturdy as these feel they seem a safe investment. I can handle the occasional tear or finish issue as long as they continue to function properly.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rader",
      "helpful_votes": 3,
      "publication_date": 20170407
    },
    {
      "title": "Awful",
      "text": "Very uncomfortable, feels like you will fall forward right out of the seat. Doesn’t really stay reclined. Very poorly made. Flimsy. Almost completely broken after first year of owning it.",
      "rating": 1.0,
      "verified": true,
      "author": "Paul Daley",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Uncomfortable. Too stiff and was hoping it would be ...",
      "text": "Uncomfortable. Too stiff and was hoping it would be softer for long sitting watching TV . Made cushions for it .",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161229
    },
    {
      "title": "Came in one large box, curb to curb. ...",
      "text": "Came in one large box, curb to curb. Will need some heavy lifters to get it inside. I give these 4 stars because you either are completely reclined, or sitting up with your feet up or down. There is no in between.",
      "rating": 4.0,
      "verified": true,
      "author": "BB",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "Excellent value, just make sure you get \"white glove\" ...",
      "text": "Excellent value, just make sure you get \"white glove\" shipping or it will left at your doorstep (even in the rain). VERY HEAVY!",
      "rating": 5.0,
      "verified": true,
      "author": "P. R. Wilson",
      "helpful_votes": 2,
      "publication_date": 20160218
    },
    {
      "title": "Five Stars",
      "text": "Good quality recliners, would've given 10 stars for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron54",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Very comfy. So glad I made this purchase.",
      "text": "Love these amazon has done my whole house. Thank you.",
      "rating": 5.0,
      "verified": true,
      "author": "Holly Amromin",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "Nice set. Not much cushion on the seats but ...",
      "text": "Nice set. Not much cushion on the seats but it's ok.",
      "rating": 4.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20160305
    },
    {
      "title": "Game Time",
      "text": "The seats feel great on my injured back. The seats are not leather , but they look awesome in my home theater. I purchased two rows of three. Each set had a couple of nicks on the bottom of them so Juniper reimbursed me 1/3 of the purchase price on one of them and $200 on the other one. I can't wait for football season to start. Go Dawgs and Falcons! Perry from Atlanta, Ga",
      "rating": 4.0,
      "verified": true,
      "author": "Pdubb2986",
      "helpful_votes": 8,
      "publication_date": 20140720
    },
    {
      "title": "I love the look",
      "text": "I love the look! It fits perfect in my man cave area. I will say that the delivery guys were jerks but I will not fault the product for that. Great buy and I am satisfied with the product",
      "rating": 5.0,
      "verified": true,
      "author": "London L.",
      "helpful_votes": 2,
      "publication_date": 20160607
    },
    {
      "title": "Very nice, one piece",
      "text": "It's one piece had to mcgyver it a bit and unstaple bottom and take apart to get it upstairs, but at least that is an option! Heavy! Comfortable.",
      "rating": 5.0,
      "verified": true,
      "author": "BLUEBUNNY",
      "helpful_votes": 0,
      "publication_date": 20160331
    },
    {
      "title": "Cannot beat this!",
      "text": "This is a great set. We love it. It is heavy and they deliver to the house but don't carry it in. For this price, you can pay your neighbor to help! Will buy another row I love them so much. All recline, the storage is an added bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Buyer",
      "helpful_votes": 0,
      "publication_date": 20151212
    },
    {
      "title": "Not happy with delivery",
      "text": "Doesn’t seem like real leather, delivery people broke my entry light and damaged my ceiling just dropped left in box",
      "rating": 3.0,
      "verified": true,
      "author": "Shane L Stenberg",
      "helpful_votes": 0,
      "publication_date": 20191228
    },
    {
      "title": "NICE LOOKING COMFORTABLE SEATING FOR THE PRICE",
      "text": "GREAT PURCHASE. COMFORTABKE SEATING, NICE LOOKING FOR THE PRICE. IT IS IN MY HUSBANDS MAN CAVE. HE LIKES IT AND THAT IS ALL THAT MATTERS.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Hall",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "... seats are smaller than expected it is definitely a good value for the money However",
      "text": "Although the seats are smaller than expected it is definitely a good value for the money However, since the seats are fairly small an average to tall person cannot comfortably recline. Also the seat support is not designed to accommodate much weight and subsequently fails after frequent use.",
      "rating": 3.0,
      "verified": true,
      "author": "ross fillingsness",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "They are comfortable & a great price",
      "text": "I just recieved these chairs. I ordered 2 sets to go in my theater room. They are comfortable & a great price! Everyone that has seen them is very impressed! My 5 year old can push back the seats into reclining position easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Thriftymom",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "GREAT DEAL",
      "text": "I bought 2 sets of 3 for my home theater. You can't do better for the price. Well packaged, very comfortable, easy to set-up. It's a tremendous value. Please don't expect premium leather or the easiest recliner operation. Regardless of this it's a hell of a deal and I am very happy with my purchase.",
      "rating": 4.0,
      "verified": true,
      "author": "William Jazon Jr",
      "helpful_votes": 9,
      "publication_date": 20140614
    },
    {
      "title": "Four Stars",
      "text": "Well made, could use a latch to hold the footrest in the open position.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Anderton",
      "helpful_votes": 0,
      "publication_date": 20180706
    },
    {
      "title": "love these! it was easy to set up and ...",
      "text": "love these! it was easy to set up and they are very comfortable!",
      "rating": 5.0,
      "verified": true,
      "author": "Skittles",
      "helpful_votes": 0,
      "publication_date": 20151220
    },
    {
      "title": "Comfy and durable, great value!",
      "text": "Comfy and durable, great value! Been enjoy 2 3-seats in my new home theater for a month, everyone loves them. Need some strong arms to lift them, be aware.",
      "rating": 5.0,
      "verified": true,
      "author": "Haokun Zhu",
      "helpful_votes": 3,
      "publication_date": 20140923
    },
    {
      "title": "Great buy!",
      "text": "The furniture was delivered as promised. The assembly was not hard (although the pieces are extremely heavy). Keep in mind that the 3 seats are attached so you cannot separate them. I love these recliners. They are comfortable and they look great. For the price, you can't go wrong!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160503
    },
    {
      "title": "Very highly recommended.",
      "text": "Very, very pleasantly surprised. Quality exceeded expectations and delivery was seamless. Very highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170519
    },
    {
      "title": "Great recliner movie teather chairs.",
      "text": "I never tough to buy great recliners home theater seats for that price. The quality is great, and movers were great. I paid $40 to let the movers leave the home theater seats on my basement, then I opened and assembled. Very easy to assemble, great quality, great price.....",
      "rating": 5.0,
      "verified": true,
      "author": "Carmine",
      "helpful_votes": 6,
      "publication_date": 20140609
    },
    {
      "title": "very good chairs. my doberman sits in one of them ...",
      "text": "can't beat the price for the quality. very good chairs. my doberman sits in one of them and it's holding up with the quality well.",
      "rating": 5.0,
      "verified": true,
      "author": "TM",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Great value for HT seating",
      "text": "Bought these for our HT room. A neighbor had some and we liked the feel and look. Yes, they're a pain to get up stairs as they're bulky and heavy but they're also a tremendous value. 5 HT seats for barely 1k? Heck yes. They are extremely easy to put together as the back only needs to be slid into place. We have a teen and pre-teen and didn't want to invest thousands into seats that may not be treated as gently as we'd prefer. As sturdy as these feel they seem a safe investment. I can handle the occasional tear or finish issue as long as they continue to function properly.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Rader",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "I like it for the reasonable price",
      "text": "I like it for the reasonable price, but laying it back is a little difficult. It doesn't recline in a comfortable position.",
      "rating": 4.0,
      "verified": true,
      "author": "Ariana knighton And WILLIS knighton",
      "helpful_votes": 4,
      "publication_date": 20141113
    },
    {
      "title": "Very nice",
      "text": "Great buy for the money. I was a little nervous when I ordered these, but they are way more comfortable than I was expecting. The \"leather\" actually feels like real leather and not some recycled plastic posing as leather (I'm looking at you Hyundai). Don't be afraid to spend less. You are not sacrificing quality, these are great chairs. I also got the 3-seat set.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared M.",
      "helpful_votes": 5,
      "publication_date": 20151105
    },
    {
      "title": "They are awesome and I am about to order another set right ...",
      "text": "Just got these. They are awesome and I am about to order another set right now. My delivery was from CEVA and they sure did drop it off outside. I slid that sucker in though no stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Kingston",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Great Seats",
      "text": "We love these seats. It absolutely makes our home theater. I felt it was my duty to review these seats. It was easy to assemble... basically just putting on the back and legs. That's it! They are comfy and looks of great quality. I haven't had them very long but wanted to review now before I forgot. Great buy.",
      "rating": 5.0,
      "verified": true,
      "author": "Maleisa",
      "helpful_votes": 8,
      "publication_date": 20140618
    },
    {
      "title": "Great chairs. Not top of the line but great ...",
      "text": "Great chairs. Not top of the line but great for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Southern gal",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Four Stars",
      "text": "Comfortable, but the fixed reclining position is a little lower than expected. Most are flat.",
      "rating": 4.0,
      "verified": true,
      "author": "wizatht",
      "helpful_votes": 2,
      "publication_date": 20140725
    },
    {
      "title": "These chairs are very comfortable and sturdy",
      "text": "I would give it 4 1/2 stars if I could. These chairs are very comfortable and sturdy. The material is durable and has withstood abuse from both kids and dogs.",
      "rating": 4.0,
      "verified": true,
      "author": "Addie Dee",
      "helpful_votes": 0,
      "publication_date": 20141011
    },
    {
      "title": "Four Stars",
      "text": "looks good and as advertised. good value for the money. i'm ordering another one",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20151103
    },
    {
      "title": "We are using it in our lounge room at work and so far the employees really like it.",
      "text": "It was what I expected. The delivery of it was right on time and they contacted me to let me know when they would be there. We are using it in our lounge room at work and so far the employees really like it.",
      "rating": 4.0,
      "verified": true,
      "author": "Jodi Acevedo",
      "helpful_votes": 0,
      "publication_date": 20150706
    },
    {
      "title": "Easy to put together but it sits funny",
      "text": "Easy to put together but it sits funny. Really only has 2 recline positions, opened up with little recline and feet still facing down or reclined all the way back like you're sleeping. Anything in between just causeso your body weight to sling you forward. Overall it's a nice and I don't regret buying it but I was expecting the recline feature to be better.",
      "rating": 3.0,
      "verified": true,
      "author": "Bo Fo Sho",
      "helpful_votes": 2,
      "publication_date": 20160329
    },
    {
      "title": "Flash Furniture 3-Seat Brown Leather Home Theater Recliner with Storage Consoles",
      "text": "I use this for gaming in and TV watching. The seats are a little stiffer than my existing couch which I don't really like. The seat area feels a little short when the seat folds back but not a deal breaker. This has taught me that I have to sit in a couch before I buy one.",
      "rating": 3.0,
      "verified": true,
      "author": "Steve Nicholas",
      "helpful_votes": 2,
      "publication_date": 20170123
    },
    {
      "title": "Purchased 3 sets of these for my new theater room.",
      "text": "Purchased 3 sets of these for my new theater room. All 3 came in faster than the original shipping stated. All 3 were in excellent condition, no issues during shipping. Not much setup to these, just slide the back of the seats in and you're done, very easy. 10/10, would order again. Much cheaper than the local furniture stores and great quality.",
      "rating": 5.0,
      "verified": true,
      "author": "AJC",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Five Stars",
      "text": "I love this set and will probably buy another one",
      "rating": 5.0,
      "verified": true,
      "author": "Lisa Ullrich",
      "helpful_votes": 0,
      "publication_date": 20150713
    },
    {
      "title": "I love it!",
      "text": "I love it!! The shipping and delivery company is a joke, but the furniture is everything I thought it would be.",
      "rating": 5.0,
      "verified": true,
      "author": "Angela Heron",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Love these",
      "text": "These are very comfortable. Box is heavy but very easy to assemble",
      "rating": 5.0,
      "verified": true,
      "author": "Dan Gregory",
      "helpful_votes": 0,
      "publication_date": 20160629
    },
    {
      "title": "... some negative reviews of these but frankly they are awesome. I have a room that i turned into ...",
      "text": "There were some negative reviews of these but frankly they are awesome. I have a room that i turned into a theatre room and there were alot of chair options. Most were over 1600$ for a set of 3 and had silly lights in the cups as well as electric up and down options. I didnt need any of that and it sounds to me like something that will eventually break and cost alot to fix. I just want comfortable chairs that recline and these are PERFECT. Dont waste your money on the expensive ones, there are easily as good and look great (contrary to the pic they used on the advert).",
      "rating": 5.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 6,
      "publication_date": 20160809
    },
    {
      "title": "Four Stars",
      "text": "To current date, I have no complaints. The product has met all expectations.",
      "rating": 4.0,
      "verified": true,
      "author": "Rodney Thomas",
      "helpful_votes": 0,
      "publication_date": 20160206
    },
    {
      "title": "Not Leather",
      "text": "Not Leather, Very Hard to recline, most women could not recline, a man has to use a lot of force to move back. They look good though.",
      "rating": 3.0,
      "verified": true,
      "author": "PoppyOK",
      "helpful_votes": 5,
      "publication_date": 20140808
    },
    {
      "title": "nice piece of furniture",
      "text": "nice looking piece, mostly very comfprtable, not enough reclining positions. I have multiple sliped disc, this piece offers great lumbar sipport.",
      "rating": 4.0,
      "verified": true,
      "author": "richard ydoyaga",
      "helpful_votes": 4,
      "publication_date": 20140812
    }
  ],
  "product_meta": {
    "title": "Flash Furniture Eclipse Series 3-Seat Reclining Black LeatherSoft Theater Seating Unit with Cup Holders",
    "description": "Color:Black| Style:3-SeaterSpend some quality time with your family and friends for memorable movie nights, epic game days and legendary video game marathons, relaxing on this Home Theater Seating Unit.The ultimate in contemporary home theater seating, it features 3 leather push back recliners with generous amounts of CA117 fire retardant foam padding in the back and seat. The seat back has an integrated headrest for extra comfort. This recliner unit has 2 double cup holders for your favorite beverages, and 2 storage consoles for remote controls, magazines and game controllers. Plastic floor glides protect your floor by sliding smoothly when you need to move it.When you have home theater seating, you can make every game day an event that rivals the Big Game; treat your friends to a cinematic experience; and challenge your friends and family to a virtual duel!",
    "rating": 3.5,
    "feature_bullets": [
      "Contemporary Theater Seating",
      "3 Push Back Recliners",
      "Black LeatherSoft Upholstery",
      "Curved Arms",
      "2 Storage Consoles with 2 Cup Holders"
    ],
    "specifications": {
      "Product Dimensions": "68 x 95 x 43.5 inches",
      "Item Weight": "238 pounds",
      "Manufacturer": "Flash Furniture - DROPSHIP",
      "ASIN": "B00GN96JFW",
      "Item model number": "BT-70259-3-BK-GG",
      "Customer Reviews": "3.5 out of 5 stars175 ratings3.5 out of 5 stars",
      "Best Sellers Rank": "#773,671 in Home & Kitchen",
      "Is Discontinued By Manufacturer": "No",
      "Seat Height": "18 Inches",
      "Max Weight Recommendation": "250 Pounds",
      "Finish Types": "Black",
      "Is Assembly Required?": "Yes",
      "Number of Pieces": "1",
      "Warranty Description": "5 year limited",
      "Number of Shelves": "1",
      "Batteries Required": "No",
      "Import Designation": "Imported"
    },
    "categories": [
      "Furniture",
      "Home & Kitchen",
      "Home Theater Seating",
      "Living Room Furniture",
      "TV & Media Furniture"
    ],
    "price": 960.61
  }
}