{
  "website_summaries": [
    {
      "verdict": "Extremely long USB extender cable, so you can use it in many different situations successfully.",
      "pros": [
        "At 15 feet in length, you'll always have enough cable to reach your devices",
        "Delivers the high speed data performance you need with USB 3.0",
        "Cable bends relatively easily to move around obstacles"
      ],
      "cons": [
        "May drop the connection from time to time, especially with hubs"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Cable quit working after 3 months.",
      "text": "Well after a few months of owning this, the cable constantly will disconnect and mess up my video feed from the Oculus. Extremely disappointed in the product. I urge buyers to find a different cable, as this has no longevity.",
      "rating": 1.0,
      "verified": true,
      "author": "DarthBrodius",
      "helpful_votes": 13,
      "publication_date": 20180119
    },
    {
      "title": "Super long and works!",
      "text": "This is pushing it when it comes to usb extenders, but it does work. I have mine going from the computer to another usb A to B cable, which then plugs into a monitor's usb hub. I can simultaneously use a wireless mouse/keyboard combo AND a 1080p webcam, with no loss in video quality. However, sometimes it just doesn't work. I have to replug it to get it to work again. I chalk it up to the other extension cable, not this one. Even then, the total extension was 20ft and it still ran a webcam!",
      "rating": 5.0,
      "verified": true,
      "author": "Feliciano Montoya",
      "helpful_votes": 2,
      "publication_date": 20191121
    },
    {
      "title": "Works with USB hubs without external power",
      "text": "Works well. I use it to connect my PC in my room to a USB hub in the living room which I use to plug in wireless keyboards and flash drives.I stream my desktop computer's screen to the TV in the living room with a 25-foot HDMI cable (link:  and use the USB hub along with this USB 3.0 Extender to handle the keyboard and mouse input. The USB 3.0 Extender is well made as I didn't need an external power source for the peripherals I plugged into the USB hub connected to it.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred L.",
      "helpful_votes": 6,
      "publication_date": 20170520
    },
    {
      "title": "Works As Advertised",
      "text": "I've been trying to find the right USB cord to extend my mouse cord without degrading the signal or causing any kind of delay. Many that I've tried could not do it or would not even recognize the mouse when connected with it. This USB cord worked right out of the box and I do not have any delay or lag between movement and input of my mouse. Highly satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Steve",
      "helpful_votes": 2,
      "publication_date": 20190404
    },
    {
      "title": "Does NOT work as 3.0 with Oculus Rift",
      "text": "I've seen a couple reviews now (far too late) saying that these don't work with the Oculus after a few hours, weeks, or months. the ones I bought don't work from the get-go. Don't waste your time.",
      "rating": 1.0,
      "verified": true,
      "author": "Kenji Lum",
      "helpful_votes": 4,
      "publication_date": 20180930
    },
    {
      "title": "John russo",
      "text": "hello to Amazon customer service I have purchased extension cords for my USB devices and I have to say I have purchased quite a few in my life but this one it is the best ones I ever purchased the quality of the cords of extremely well-made it charges my devices quite fast and delivers information extremely well but my main uses to charge my devices I will definitely give this 5 stars if you need extension cords for your USB extensions these are the ones I purchase you will not be disappointed thank you",
      "rating": 5.0,
      "verified": true,
      "author": "John Russo",
      "helpful_votes": 0,
      "publication_date": 20180814
    },
    {
      "title": "Excellent cable for connecting Nvidia shield to HiBy R6 Pro DAP",
      "text": "I recently bought an Nvidia Shield Pro, which is an amazing device. However, my research indicated that it only supports SBC. In any case, all Bluetooth is “lossy” I bought this cable to be able to sit on the couch 15 feet from the Shield, which is connected to my projector. I had to add a short USB male to USB-C cable to connect to my DAP, which I set to USB-DAC mode The sound is awesome, using Audeze LCD-2 headphones. Surprisingly, the cable supplies enough power to keep the DAP fully charged Excellent cable",
      "rating": 5.0,
      "verified": true,
      "author": "Luke Skywalker",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Works as expected",
      "text": "Purchased to facilitate quick and dirty computer configuration from the comfort of my TV chair in the living room. No one around complain about the long cable running through the middle of the room. :) I actually have it connecting to a USB 3.1 hub, which connects to my mouse and keyboard for easy chair configuration of my new home media server.",
      "rating": 5.0,
      "verified": true,
      "author": "David K.",
      "helpful_votes": 0,
      "publication_date": 20190731
    },
    {
      "title": "Messy when extended and no strap to tie it together.",
      "text": "Product does the job for my Nintendo switch wired controllers extended cable. However, when you extend it all out it’s a mess trying to wrap it back together. Where is those straps that lets you organize the length of the cable you don’t need? The copper metal on the mouth of the cable make it rather ugly, why not use sliver metal instead of copper? Overall the product functional maybe not the design and convenience of storage.",
      "rating": 3.0,
      "verified": true,
      "author": "TheFinerEdge ",
      "helpful_votes": 0,
      "publication_date": 20200727
    },
    {
      "title": "Perfect solution for the short cord on Logitech steering wheel for XboxOne",
      "text": "Works perfectly for Xbox . Bought this because Logitech steering wheel does not come with a long enough cord to reach my console. This 15' cable does the job perfectly. Now I can sit across the room and drive the days away without worrying about pulling on the cord, or the dogs tripping over it and pulling it out or damaging it.",
      "rating": 5.0,
      "verified": true,
      "author": "RL Dreams",
      "helpful_votes": 7,
      "publication_date": 20160918
    },
    {
      "title": "I wanted to do a VR setup.",
      "text": "I wanted to do a VR setup with an Oculus rift. I had messed around with the headset a bit, and through some research, found that it worked well with the two provided cameras on opposite ends of the VR playspace. This isn't how Oculus intends for you to set it up, so they don't include a USB cable long enough to do the trick. I figured it'd be best if I didn't have a short cable going through the center of where I'll be messing around (while more/less blind to my surroundings), so I opted for a better route by buying this. It works well for what it needs to do. Haven't had any problems yet.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob arbuckle",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Rugged Cable Does the Job",
      "text": "Two of us are hosting a live radio show over the Internet. The issue was we needed the camera connected to the computer yet had to have the computer at hand to control the show. We've been using this extender for a month now, and it is holding up well over the constant plugging and unplugging that is necessary due to the other uses we have for the camera. Very happy with the ruggedness of this product. I can see why the company is willing to offer a lifetime warranty.",
      "rating": 5.0,
      "verified": true,
      "author": "Dee ArrTop Contributor: Harry Potter",
      "helpful_votes": 2,
      "publication_date": 20170627
    },
    {
      "title": "Insufficent Shielding for 15n Ft Version",
      "text": "Purchased this Cord for my HOTAS game controllers. In games and the HOTAS config Software was registering button/control pushes that I was not making. After 3 Days of TSHOOT found that it was this cable. I suspect that the Cable has Insufficient shielding for the 15 Ft version I purchased. Will be returning!!!",
      "rating": 1.0,
      "verified": true,
      "author": "Zendorea",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Extension for days!",
      "text": "Bought this cable in order to have a wired connection to my PC from my couch. Yes, I'm that lazy, but it's also great having no input lag when playing input sensitive games. A must-have for couch-gaming.",
      "rating": 5.0,
      "verified": true,
      "author": "Marco",
      "helpful_votes": 3,
      "publication_date": 20171218
    },
    {
      "title": "Recommended",
      "text": "This was to replace an extension I had for a long time and connector was loose , just for lightning jack to charge phone, didn’t use for data. This cord looks very rugged, the connections snug. My old cord was slow to charge, thought it was due to length, this one is fast, as fast as my fast charger on a short chord. I liked it enough I bought a second one the day after",
      "rating": 5.0,
      "verified": true,
      "author": "Tooljunky",
      "helpful_votes": 0,
      "publication_date": 20200429
    },
    {
      "title": "Used with Logitech c922x, no loss of quality.",
      "text": "Needed for one time use with Logitech c922x, in USB 2.0, and saw no loss of video quality with 1080p 30fps. Cable seemed sturdy, rolled it up and will get it out next time i need to extend position of webcam. For me, at the price point, getting one successful use out of it, its already paid for itself, hoping it will last long time and that will all be bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "somethingonthewing",
      "helpful_votes": 0,
      "publication_date": 20191114
    },
    {
      "title": "It's a cable, not much more to say. It's good",
      "text": "Does what it's advertised to do. I use it to extend a keyboard from a server that's across the room as I didn't want a wireless keyboard and have to deal with replacing batteries, and dropped connections. It appears to be true USB 3.0.",
      "rating": 5.0,
      "verified": true,
      "author": "G.",
      "helpful_votes": 2,
      "publication_date": 20171227
    },
    {
      "title": "Long and inexpensive, didn't work for my application",
      "text": "The cable is plenty long and has stood up to a toddler messing with it when she can reach it. Unfortunately, my goal was to use this as an extension for connecting my racing wheel to a ps4 and it hampered the connection to the point that the wheel/pedals were rendered useless, but they worked perfectly fine without the extension. Works great as an extension for chargers though.",
      "rating": 3.0,
      "verified": true,
      "author": "Justin dew",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Speed, Length, and Price are Unbeatable",
      "text": "I bought this to keep my webcam plugged into my computer, but to have the ability to move it around the room with it. I chose it because of the length and the fact that it is USB 3.0. While I didn't need it to be 3.0, I do have devices that will be able to take advantage of it. The extender is simple to use and works perfectly. All you need to do is plug it in, no drivers to install or anything. Highly recommended for anyone looking to extend an existing USB 3.0 port on their computer.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "Works but recognized as USB 2.0 for Oculus",
      "text": "The purpose of this buy was to extend the Oculus sensors I have so I can mount them on higher ground. These did the job well and it seems that it did not cause any latency with extending the connection, though the software now recognizes it as a USB 2.0 and not a 3.0. I am very satisfied though as it did the job and I have a larger play area as a result of the extension.",
      "rating": 5.0,
      "verified": true,
      "author": "Cat",
      "helpful_votes": 2,
      "publication_date": 20170803
    },
    {
      "title": "Really good cable extension",
      "text": "I needed to get my vinyl cutter a little bit further away from my desk and I had a shorter cable extension that was giving me issues with connectivity. Order thus one as a replacement and it is working perfectly. Great quality and construction. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Duke H.",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Works Great!",
      "text": "I recently put this to use along with a 4 Port USB Hub and an external DVD burner and they all work great. I bought them so I could connect they external DVD burner that I can now easily reach on my desk right under my monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Wahlstrom",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Works great!",
      "text": "Exactly what I needed. I wanted to extend my peripherals into my living room to play games on the TV with my friends without having to move my computer. I have not tried to transfer data over them so I cannot confirm USB 3.0 speeds, however no connection problems with anything I've plugged into them individually. I did buy 2 and when I put them together for an even longer reach my webcam was having issues detecting in OBS setting up my stream, however I think this was an issue with either OBS or drivers at the time. I haven't retried, but individually I have not had any problems with the cables. Cable quality is good and feels durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Dylan B",
      "helpful_votes": 2,
      "publication_date": 20161010
    },
    {
      "title": "Fantastic buy! Take your nerdy Hobbies to the NEXT LEVEL!",
      "text": "These cables are an absolute life-saver! I am a PC gamer, and I bought these so that I can play PC games on my 4K TV in the living room, while leaving my PC in my bedroom (I have a tiny apartment, as you can tell). They work flawlessly. Obviously I would recommend plugging a device directly into your PC / Device for first time use / driver set-up, but after that these cables will work every time. No lag or latency issues whatsoever - don't believe any who claims otherwise.",
      "rating": 5.0,
      "verified": true,
      "author": "Alec",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Highly recommended!",
      "text": "Used this with my logitech c920 webcam so I can cover more areas of my kitchen while live streaming on Facebook for my Facebook page, \"The Not So Neat Chef\" (YouTube as well). There was no reduction in video quality. This product is highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "john campo",
      "helpful_votes": 0,
      "publication_date": 20180806
    },
    {
      "title": "Great cord, worked well upon arrival",
      "text": "I purchased this to replace a defective USB cord from another seller. It worked as soon as it came. I don't know about things like camera quality as I'll be using it in my church's audio-visual loft primarily. Thanks for a great cord.",
      "rating": 5.0,
      "verified": true,
      "author": "Cali Carol",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Makes connecting USB drives to Mac Mini SO EASY",
      "text": "Exactly as described. We just needed an easy way for visiting presenters to plug their USB drives into the Mac Mini, and this cord is not fastened (and labeled) in a conspicuous location (as well as plugged into the Mac Mini) and it saves a lot of time and anxiety. Based on that use, it's easy to say I love it. Adding 3' for USB might be a problem in your particular situation is you are using this as an extension on to another USB cable. The is the only cable I am using from the computer director to the USB device. So, be aware that your situation may be different and you might have different results.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Hendrix",
      "helpful_votes": 2,
      "publication_date": 20150418
    },
    {
      "title": "a lot of signal loss",
      "text": "i use this cable to connect my Oculus bay stations to my pc for vr they require or recommend really a usb 3 connection but no matter what usb 3 port i plug in it wont recognize the connection as usb 3 so i though it might have been an oculus issue so i try using it to use a external drive the drive didnt recognize it as usb 3 so as far as im aware this is a broken usb 3 cable or not one at all",
      "rating": 3.0,
      "verified": true,
      "author": "max newman",
      "helpful_votes": 0,
      "publication_date": 20200610
    },
    {
      "title": "experienced constant dropouts using it with a DisplayLink dock",
      "text": "This cable is sturdy and well made, but I experienced constant dropouts when trying to use it to extend access to a Diamond Multimedia DisplayLink dock. Switched to an Anker PowerLine 10ft cable instead and haven’t had any of the same issues.",
      "rating": 2.0,
      "verified": true,
      "author": "cassian78",
      "helpful_votes": 0,
      "publication_date": 20200104
    },
    {
      "title": "Sturdy and tight connections",
      "text": "This cord works great and feels sturdy, tight connection. I use it to extend my mouse and key board to my bed. My tv is across my room and rather than buy cordless keyboard and mouse (plus batteries every so often), I decided to just extend the cords a little longer. It's much cheaper this way!",
      "rating": 5.0,
      "verified": true,
      "author": "Jubilee Jones",
      "helpful_votes": 0,
      "publication_date": 20190427
    },
    {
      "title": "Incompatible with Windows 10 using external audio source.",
      "text": "Appears well made but documentation and support is inadequate. Struggled for several days attempting to make it record with an audio source other than the internal mic (Windows 10). All efforts unsuccessful. Don't have any more time to fight with it. Disappointing. Returned to Amazon for refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Sharon Meltzer",
      "helpful_votes": 0,
      "publication_date": 20180921
    },
    {
      "title": "Work Around....",
      "text": "Works as advertised. Built a new PC which unfortunately was taller than my old one. My USB ports on top didn't have much clearance for my to utilize them, so I used these cables as a workaround. By connecting 2 of these to the rear ports (one 2.0 and one 3.0 port) I was able to come up with a way, in which I didn't have to keep pulling out my computer or reaching around the back of it all the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Rexruger44",
      "helpful_votes": 0,
      "publication_date": 20160211
    },
    {
      "title": "Quality product",
      "text": "This usb extender has done exactly what I wanted it to do. I have had zero issues with it. It always works and has never disconnected or malfunctioned. For the price this cannot be beat. I went to Best Buy to grab a usb extender and it was 4x the price. Ordered this on Amazon and I could not be happier. I'd recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Cody M.",
      "helpful_votes": 0,
      "publication_date": 20181211
    },
    {
      "title": "Works Great!!!",
      "text": "I needed it for my building out back. I have a personal desktop set up in the building to watch \"how to\" videos on youtube. I have my wifi device plugged into it an strung it up along the inside roof of the building. Works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Randy Thomas",
      "helpful_votes": 0,
      "publication_date": 20190130
    },
    {
      "title": "It keeps dropping the connection",
      "text": "Avoid. I got the 15 feet USB extender but it keeps dropping my connection on Window 10 machine. You might be able to use this for a clothesline, or perhaps a dog walking leach but not an USB extension cable.",
      "rating": 1.0,
      "verified": true,
      "author": "Capitalist",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "Doesn't transmit data",
      "text": "Tried this with several devices and it seems to only provide power. Works with: - Phone/Phone Charger, Power banks, etc. Did not work with (tested): - USB Mic (Blue Snowball), USB Keyboard, USB HardDrive, Webcam A bit disappointing as I bought this primarily to extend my USB Mic from my PS4 to my PC/Desk",
      "rating": 1.0,
      "verified": true,
      "author": "Joe Tullar",
      "helpful_votes": 0,
      "publication_date": 20200528
    },
    {
      "title": "Doesn't maintain connection",
      "text": "I tried to use this to move my wifi adapter to a better location to get better reception. The computer can't maintain a connection to the wifi adapter using this cable. A 15' usb 2.0 cable from a different vendor works fine, without dropping the connection. Bad cable.",
      "rating": 1.0,
      "verified": true,
      "author": "Jack the Bear",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "Works great",
      "text": "No issues using as an extender for a camera. Like the thin cable, easier to manage. So when I needed another I purchased from this manufacturer again. Very happy with these.",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Perfect",
      "text": "what I was expecting is not what showed up. What showed up was a much higher quality for the price and I was very pleasantly surprised. It was definitely not no thin run-of-the-mill piece of junk",
      "rating": 5.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "Great for anything",
      "text": "Great for my oculus rift sensors and actually work without any lag or signal loss, tested and monitored. Even when mounted on the wall. I bought 3 of them and still work seem good quality build and durable.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivan",
      "helpful_votes": 0,
      "publication_date": 20190201
    },
    {
      "title": "Not actually usb 3.0",
      "text": "Cannot use my Oculus Rift S, because it is not actually usb 3.0 but is 2.0 instead, unlike advertised.",
      "rating": 1.0,
      "verified": true,
      "author": "Jane Knizek",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "works perfectly",
      "text": "works perfectly for wireless mouse/keyboard adapter and Bluetooth adapter (bought 2 of these). plugged into USB 3.0 ports on the back of my PC and ran the LONG cable across the room so we can play games using our projector (PC games on a 200 inch screen :)",
      "rating": 5.0,
      "verified": true,
      "author": "Mike, Saugatuck",
      "helpful_votes": 0,
      "publication_date": 20170801
    },
    {
      "title": "It gets you more USBfoots!",
      "text": "Great quality. Nice sturdy cable. little dainty cables can get trashed easily. and one going this far needs to be able to take a little abuse. This one is up to the job. I'm using mine to extend my sons usb wifi adapter from his pc to a bit closer to the wall near the router. Getting great signal!",
      "rating": 5.0,
      "verified": true,
      "author": "Blacksunshine",
      "helpful_votes": 0,
      "publication_date": 20180213
    },
    {
      "title": "Doesn't work with all devices...",
      "text": "I got this to move my external usb WiFi receiver, but it doesn't work with this cable. It does however work with my Logitech webcam and a lexar thumb drive, perhaps it's not really 3.0 but only 2.0",
      "rating": 3.0,
      "verified": true,
      "author": "falconer",
      "helpful_votes": 0,
      "publication_date": 20181204
    },
    {
      "title": "Good quality, would buy again!",
      "text": "Everything has worked as expected!! The cable seems pretty sturdy and appears to be of high quality. I've had other shorter USB extension cables and this one is by far my favorite. I've used two different USB hubs, both USB 2.0 and numerous controllers and have not had one issue. I highly recommend this product!",
      "rating": 5.0,
      "verified": true,
      "author": "RollJordanRoll",
      "helpful_votes": 0,
      "publication_date": 20170129
    },
    {
      "title": "does not work with Oculus Rift",
      "text": "This might be fine for other USB devices but something about these is not good enough for the Oculus Rift. A different brand did work for me.",
      "rating": 3.0,
      "verified": true,
      "author": "this_guy",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "Great for the kids' bluetooth headphones so they can be charged while playing and sitting on the couch.",
      "text": "Works. No need now to let headphones charge and play a foot away from the tv. Now the charging and the headphones work and from the comfort of the sofa",
      "rating": 5.0,
      "verified": true,
      "author": "B. Kodgis",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Seems alright",
      "text": "I accidentally ordered these but to lazy to return for $6. It appears to be fine. If/when I ever use it, I’ll update.",
      "rating": 5.0,
      "verified": true,
      "author": "Frank",
      "helpful_votes": 0,
      "publication_date": 20180726
    },
    {
      "title": "NOT ACTUALLY USB 3.0 CABLES",
      "text": "Buyer beware! These cables are not actually USB 3 cables, and instead USB 2! They will not transfer a USB 3 signal, you will be limited to USB 2.0 speeds, and whatever you are using them for (in my case an Oculus Rift) will suffer for it.",
      "rating": 1.0,
      "verified": true,
      "author": "Will Mason Moses",
      "helpful_votes": 2,
      "publication_date": 20190515
    },
    {
      "title": "This set of extension cables is an excellent product, I used it with my Logitech Circle ...",
      "text": "This set of extension cables is an excellent product, I used it with my Logitech Circle 2 cameras, and it works well. Update, cable failed after 5 month of usage, about to contact manufacturer for warranty purpose - will update review if they honor warranty.",
      "rating": 2.0,
      "verified": true,
      "author": "Pete",
      "helpful_votes": 0,
      "publication_date": 20180320
    },
    {
      "title": "Great value USB extender.",
      "text": "Bought it for a Video NVR hidden away in the cloud, so we still have access to the mouse feature. Super heavy cable so no signal loss.",
      "rating": 5.0,
      "verified": true,
      "author": "Big Spud's",
      "helpful_votes": 0,
      "publication_date": 20191110
    },
    {
      "title": "Seems to be good enough",
      "text": "I’ve been using for about a month. Seems to be good enough quality",
      "rating": 5.0,
      "verified": true,
      "author": "Ian Page",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "I works",
      "text": "I bought this for my son to hook a keyboard to his PS4. Seems to work fine and gives him a little more space away from the TV screen.",
      "rating": 5.0,
      "verified": true,
      "author": "MikeM",
      "helpful_votes": 0,
      "publication_date": 20190621
    },
    {
      "title": "Works perfect.",
      "text": "I bought this extender because the cable on my gaming keyboard was not long enough. I love it. There is no lag in keystroke, and I can have my gaming keyboard wherever I want now within the ten extra feet.",
      "rating": 5.0,
      "verified": true,
      "author": "brafar1824",
      "helpful_votes": 2,
      "publication_date": 20160911
    },
    {
      "title": "Expand your use.",
      "text": "Good quality and great to have around. I use mine to extend to a DVD player.",
      "rating": 5.0,
      "verified": true,
      "author": "book man",
      "helpful_votes": 0,
      "publication_date": 20181023
    },
    {
      "title": "Thanks for fast shipping",
      "text": "This came very fast and packaged safely. Will order again items came in perfect condtion. Thanks you. Items worked perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Chance",
      "helpful_votes": 0,
      "publication_date": 20200405
    },
    {
      "title": "it works. not sure what else to say but ...",
      "text": "it works. not sure what else to say but there is a word minimum for these reviews when i just wanted to give it 5 stars to begin with. every device ive plugged in is read by the hub this is plugged into.",
      "rating": 5.0,
      "verified": true,
      "author": "Liverpooligan",
      "helpful_votes": 0,
      "publication_date": 20161127
    },
    {
      "title": "Great",
      "text": "Great item bought this to power my led backlighing works great",
      "rating": 5.0,
      "verified": true,
      "author": "Matt",
      "helpful_votes": 0,
      "publication_date": 20180829
    },
    {
      "title": "Great usb extension !!",
      "text": "This cable is exactly what needed. I have a security system setup away from the monitor. This cable enabled me to connect to the monitor in one room away from the dvr. Great item and yes I would buy it again.......",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Primeaux",
      "helpful_votes": 2,
      "publication_date": 20170313
    },
    {
      "title": "As advertised - great!",
      "text": "Really gives a super long extension for any USB powered device, especially in a vehicle. Seems well made and durable after a few months of heavy use. I recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Ally L",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "just good",
      "text": "How simple does it need to be? This wire simply does it's job as advertised and is one of the longest and cheapest usb3.0 extenders you will find.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170630
    },
    {
      "title": "These extension cables work great. I was impressed by the quality appearance but ...",
      "text": "Bought 2 of these to extend USB KB and Mouse for 8-port KVM to go along with the extended VGA cable I already had. This allows a person at a desk to monitor the servers instead of having to stand at the server rack. These extension cables work great. I was impressed by the quality appearance but especially how well they work.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160318
    },
    {
      "title": "Five Stars",
      "text": "It's a cord. And it works. What more can I say?",
      "rating": 5.0,
      "verified": true,
      "author": "Alex",
      "helpful_votes": 0,
      "publication_date": 20180217
    },
    {
      "title": "High quality, low price :)",
      "text": "This cable not only has excellent connectors(will last a good long time), but the quality of the cable and coax seem high.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170707
    },
    {
      "title": "Does the job",
      "text": "Needed this to run a wire far away from the screen and computer for a mic. This thing works exactly as how I wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Vince C",
      "helpful_votes": 0,
      "publication_date": 20190227
    },
    {
      "title": "Works Great with my 1080P Hi-Def Web Cam !!!",
      "text": "Works Great !!! I was initially concerned if this would work to extend the 6' cord for my Hi-Def 1080P Web Cam with Zoom function to 21' for greater range and flexibility. I was thrilled to not only see that it worked, but there was no noticeable loss in picture quality, panning and zoom functions at all. Quality construction and excellent product for the price!!!",
      "rating": 5.0,
      "verified": true,
      "author": "ALL THE BEST",
      "helpful_votes": 0,
      "publication_date": 20161114
    },
    {
      "title": "Worked good. USB 3",
      "text": "Worked good. USB 3.0/ 3 1 doesn't go as far as USB 2.0 but much faster. Max at 9 feet for 0/3.1 vs 16 feet for USB 2.0 with no added power.",
      "rating": 5.0,
      "verified": true,
      "author": "SkyNet",
      "helpful_votes": 0,
      "publication_date": 20180204
    },
    {
      "title": "Great product",
      "text": "This is a heavy duty cord! I expect it to last.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruth",
      "helpful_votes": 0,
      "publication_date": 20180823
    },
    {
      "title": "Heavy duty cable",
      "text": "I bought this to go from my wall to the couch so I didn’t have to reach to plug in my phone. It’s a heavy duty cable and has great firm connectors",
      "rating": 5.0,
      "verified": true,
      "author": "Seth",
      "helpful_votes": 0,
      "publication_date": 20190125
    },
    {
      "title": "Five Stars",
      "text": "it's a cable. If is the correct one it works great",
      "rating": 5.0,
      "verified": true,
      "author": "csifife",
      "helpful_votes": 0,
      "publication_date": 20170814
    },
    {
      "title": "Does exactly what we bought it to do",
      "text": "I bought this so we could move a webcam at work farther away from the computer for meetings. It's been hooked up for a while and we've had zero issues with image quality or speed. I would assume this would work fine for any USB device that needs to be relocated farther away than the 'stock' cord would allow.",
      "rating": 5.0,
      "verified": true,
      "author": "scott696d",
      "helpful_votes": 0,
      "publication_date": 20170213
    },
    {
      "title": "Works great",
      "text": "Surprisingly nice quality for such an inexpensive cable. I am using it to connect a usb flash drive to the usb port on my tv - works great so I don't have to reach around the side of the tv to get to the port and so I don't wear out the built in usb port on my tv. Digital movies and music play great and I have noticed absolutely no difference between using this cable and plugging my flash device directly into the TV. Very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Compulsive Reader",
      "helpful_votes": 0,
      "publication_date": 20140520
    },
    {
      "title": "Very good!",
      "text": "Perfect! Product of good quality and fair price. According to specifications and delivered on time. I am satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "Alexandre",
      "helpful_votes": 0,
      "publication_date": 20190330
    },
    {
      "title": "Work Great!",
      "text": "Works great! I have this to help with some long connections between gaming computers and monitors and accessories. haven't had any issues yet and have been using it for a while!",
      "rating": 5.0,
      "verified": true,
      "author": "cdf",
      "helpful_votes": 0,
      "publication_date": 20170103
    },
    {
      "title": "Xbox steering wheel extension",
      "text": "Works perfectly for my son’s Logitech G920 steering wheel to Xbox.",
      "rating": 5.0,
      "verified": true,
      "author": "mark twain",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "Works great to extend my camera cord",
      "text": "Needed to extend the length of the cord on my webcam for taking ID pics at work. This cord works perfectly",
      "rating": 5.0,
      "verified": true,
      "author": "Sam I Am",
      "helpful_votes": 0,
      "publication_date": 20191222
    },
    {
      "title": "Excellent product and strongly made.",
      "text": "Ends are sturdy and made well. Cord is thick,and has a good cover jacket on it.",
      "rating": 5.0,
      "verified": true,
      "author": "Glen.",
      "helpful_votes": 0,
      "publication_date": 20180624
    },
    {
      "title": "Five Stars",
      "text": "Works! and I guess that's all you could ask from this product.",
      "rating": 5.0,
      "verified": true,
      "author": "-Lyra-",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "USB 3.0 Extender with gold tips",
      "text": "High quality and fits with no issues I definitely will buy more EZO cable products.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad M.",
      "helpful_votes": 0,
      "publication_date": 20180511
    },
    {
      "title": "great product and fast shipping",
      "text": "great product and fast shipping :) I am using it for my webcam and have not had any problems :)",
      "rating": 5.0,
      "verified": true,
      "author": "Paul cross",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "Does the job",
      "text": "Used to extend usb3 from a server rack to a nearby desk",
      "rating": 5.0,
      "verified": true,
      "author": "Brent Blood",
      "helpful_votes": 0,
      "publication_date": 20190707
    },
    {
      "title": "I would buy again.",
      "text": "Works as described. I needed to be able to reach across network closets and this is perfect for that.",
      "rating": 5.0,
      "verified": true,
      "author": "Ricky Watt",
      "helpful_votes": 0,
      "publication_date": 20171209
    },
    {
      "title": "Don't buy for speed",
      "text": "I bought this item mainly for its length and 3.0 speeds, but when I used it, the USB speeds were definitely on par with USB 2.0. So if you do buy it, expect USB 2.0 speeds if you intend to use it to connect a hard drive. I've heard that longer USB extensions will give slow speeds, but I wasn't expected it to be that slow.",
      "rating": 3.0,
      "verified": true,
      "author": "EJAYMES",
      "helpful_votes": 0,
      "publication_date": 20190110
    },
    {
      "title": "Yep, it's a USB cable.",
      "text": "They both work, no noticeable input lag on mouse, keyboard or Xbox 360 wireless controller dongle. nice long usable USB cable delivered on time and cheaply.",
      "rating": 5.0,
      "verified": true,
      "author": "wriquee",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Wish I had read more reviews, cheaply made connector bent and damaged laptop",
      "text": "Product arrived damaged, was not able to plug into computer. Even when I straightened to make it fit with a knife it took a piece out of my usb port. Not the smartest, but giving a heads-up to other people. The metal is pliable like tin foil. Defiitely not quality or built to last.",
      "rating": 1.0,
      "verified": true,
      "author": "thedukeofeli",
      "helpful_votes": 2,
      "publication_date": 20190724
    },
    {
      "title": "Works perfectly for my needs. I bought this to ...",
      "text": "Works perfectly for my needs. I bought this to extend the Lego Dimensions toy pad across the room from where the Xbox One is sitting. I haven't had any problems and everything appears to work the same as it did without the extension cable (15 foot extender)",
      "rating": 5.0,
      "verified": true,
      "author": "Diacis",
      "helpful_votes": 0,
      "publication_date": 20170130
    },
    {
      "title": "Exactly as advertised and works great.",
      "text": "Used to extend my game pad for use in my bed from where my laptop is located. Worked great.",
      "rating": 5.0,
      "verified": true,
      "author": "Marc McFarland",
      "helpful_votes": 0,
      "publication_date": 20181019
    },
    {
      "title": "Doesn’t work",
      "text": "Bought this to connect a usb microphone. When it didn’t work, I began trying to get it to work with other usb items I own. The only thing it worked for was charging a controller when plugged into a Nintendo switch. Don’t buy this if you plan on using it for anything involving data transfer.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Works great for adding 3rd Oculus Rift Sensor to main unit,",
      "text": "Used this for adding 3rd Oculus Rift Sensor and it came pretty fast.",
      "rating": 5.0,
      "verified": true,
      "author": "Robo",
      "helpful_votes": 0,
      "publication_date": 20180130
    },
    {
      "title": "Excellent for extending a USB cable",
      "text": "Excellent for extending a USB cable. Needed to extend the USB power adapter for a Yi Home camera and this worked perfect. Plug and Play",
      "rating": 5.0,
      "verified": true,
      "author": "Novak",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Good quality cable.",
      "text": "Perfect and absolutely a fantastic price. This cable lets me locate devices where ever I want and not clutter my desktop. You just can't beat 15 feed for $8.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Kiser",
      "helpful_votes": 0,
      "publication_date": 20170517
    },
    {
      "title": "Great for relocating WiFi router to ceiling without moving a n attached USB external drive!",
      "text": "Worked as advertised - had an external USB drive connected to my WiFi router, but had to relocate router to hang from ceiling to address coverage issues. Didn't want to hang USB drive, so used this 15' USB 3 cable to leave drive in position at cabinet level.",
      "rating": 5.0,
      "verified": true,
      "author": "WFW",
      "helpful_votes": 0,
      "publication_date": 20170910
    },
    {
      "title": "Occlus ready",
      "text": "Works for occlus rift! I use it for my 3rd sensor that's connected via usb 2.0.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott Macuska",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "this product works great so far",
      "text": "i bought this to use the new racing rig steering wheel and pedal set in my living room but i have everything hidden in a corner behind my couch so the USB cord that came with it was well short. this product works great so far.",
      "rating": 5.0,
      "verified": true,
      "author": "doug",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "for simple things like cables, all that really matters is that it ...",
      "text": "Well, for simple things like cables, all that really matters is that it functions as intended, and then continues to do so. It's only been a couple weeks, but so far so good.",
      "rating": 5.0,
      "verified": true,
      "author": "0xFFF1",
      "helpful_votes": 0,
      "publication_date": 20180329
    },
    {
      "title": "Good Product",
      "text": "My SUV has an USB adapter where I can plugin my iPhone, iPod or plain USB Drive and listen to songs. I wanted to be on the protective side and not use that Adapter as plugging in and removing every-time on the SUV might not be good in the longer run.The best way to handle is to use a product like this which extends the Adapter. I plugged the cable in and now use the extender so that it takes the wear and tear. Good Fit and Great Price.",
      "rating": 4.0,
      "verified": true,
      "author": "ASAM",
      "helpful_votes": 6,
      "publication_date": 20140830
    },
    {
      "title": "This extender is working perfectly in both of my two usb 3.0 hubs",
      "text": "This extender is working perfectly in both of my two usb 3.0 hubs with loads of things in them. All my problems went away after installing these (disconnects, resets, lost power to devices, etc). I highly recommend sticking with USB 3.0 or better for your devices and cables,",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Gorman",
      "helpful_votes": 0,
      "publication_date": 20150615
    },
    {
      "title": "... the first time but they are all working just fine.",
      "text": "Not as long as the other 15ft cord I got the first time but they are all working just fine.",
      "rating": 4.0,
      "verified": true,
      "author": "Melissa ",
      "helpful_votes": 0,
      "publication_date": 20170528
    },
    {
      "title": "They work",
      "text": "Used for my CV1 Oculus Rift Sensors they work well and the price was really good compared to others that do the same job.",
      "rating": 4.0,
      "verified": true,
      "author": "Mark M.",
      "helpful_votes": 0,
      "publication_date": 20170509
    },
    {
      "title": "This USB Extension cable seems to be great quality.",
      "text": "I like that the cable is thicker than most USB cables, it gives you a good sense of owning a quality product.",
      "rating": 5.0,
      "verified": true,
      "author": "Nick",
      "helpful_votes": 0,
      "publication_date": 20181203
    }
  ],
  "product_meta": {
    "title": "iMBAPrice USB 3.0 Extender - 15 Feet SuperSpeed USB 3.0 A Male to USB 3.0 A Female Extension Cable (Black)",
    "description": "Size:15 Ft| Color:Black (USB 3.0)This is an iMBAPrice USB 3.0 A male to USB 3.0 B female cable. This cable is great for extending your USB 3.0 products. Our cables are made with the finest materials -- built to last and out perform. In fact, we offer lifetime warranty for our USB 3.0 cables.",
    "rating": 4.6,
    "feature_bullets": [
      "Connectors: USB 3.0 A (male) -to- USB 3.0 B (female)",
      "Great for extending USB 3.0 cables",
      "Backwards compatible with older USB technologies (USB 2.0/1.1/1.0)",
      "Lifetime Warranty"
    ],
    "specifications": {
      "Product Dimensions": "9.25 x 5.4 x 0.7 inches",
      "Item Weight": "4.8 ounces",
      "ASIN": "B00GS8GHQO",
      "Item model number": "4447931",
      "Customer Reviews": "4.6 out of 5 stars971 ratings4.6 out of 5 stars",
      "Best Sellers Rank": "#213 in USB Cables",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 19, 2013",
      "Manufacturer": "iMBAPrice"
    },
    "categories": [
      "Computers & Accessories",
      "USB Cables",
      "Computer Accessories & Peripherals",
      "Electronics",
      "Cables & Interconnects"
    ],
    "price": 8.79
  }
}