{
  "website_summaries": [
    {
      "verdict": "Ideal for those who want the calming effects of patchouli oil but live or work with people who hate the smell.",
      "pros": [
        "Scores big for its perfect balance of five oils with calming properties",
        "Can be added to a diffuser, mixed in a spray bottle with water or applied directly to skin",
        "Bonus points for the bottle's large size"
      ],
      "cons": [
        "Some say the scent of patchouli is still too noticeable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "*sniff sniff*",
      "text": "This is my daughter's new signature scent. Sometimes I sneak into her room and swipe some. Always get compliments when I do. I can't wear it when she's around because she doesn't want to share \"her smell.\" Whatever, kids suck. Will purchase (for her) again.",
      "rating": 5.0,
      "verified": true,
      "author": "DaisyBug",
      "helpful_votes": 21,
      "publication_date": 20190719
    },
    {
      "title": "Wonderful relaxing scent.",
      "text": "My husband is a veterinarian. One thing that we pride ourselves on is that our vet clinic does not smell like a vet clinic. I'm very careful with using essential oils around the animals because cats especially are so sensitive and it can even cause health issues. We put a few drops of this in a coffee mug of water and put it on a coffee mug warmer. It lets out just a subtle scent that the clients love and the vet techs swear that the animals are calmer too.",
      "rating": 5.0,
      "verified": true,
      "author": "I'm a mom",
      "helpful_votes": 68,
      "publication_date": 20151021
    },
    {
      "title": "When diffusing this smells like black pepper. Might be a bad batch?",
      "text": "When I diffuse this it smells like black pepper. I looooove Now blends normally, but this one is gross. I don't know if I got a bad batch, but since there is no way to return this I'll never know. I'm thinking I may avoid getting oils on Amazon and try going directly to the source going forward. I'm never a fan of not being able to return an item, especially something like this that is easily broken in transit.",
      "rating": 1.0,
      "verified": true,
      "author": "dawnyd528",
      "helpful_votes": 6,
      "publication_date": 20190114
    },
    {
      "title": "Dynamic scent",
      "text": "This is such a dynamic blend. Other blends seem stuck in the \"similar rut,\" but this has its own distinct scent. The peppermint and patchouli are prominent with something unexpected happening because of the orange, basil and lavender. I wear this blend in a wrist diffuser, and have it in a hanging diffuser in my vehicle. One breath of it cues me to chill out. It's great.",
      "rating": 5.0,
      "verified": true,
      "author": "Catchy Tune ",
      "helpful_votes": 4,
      "publication_date": 20190428
    },
    {
      "title": "Heaven in a bottle",
      "text": "I smelled this at the store, AMAZING. seriously one of the top oils I've ever smelt. I had to have it, I knew I could find a better deal online and did. I can't wait to defuse this and make different stuff with this.",
      "rating": 5.0,
      "verified": true,
      "author": "Monika Snow",
      "helpful_votes": 20,
      "publication_date": 20151022
    },
    {
      "title": "NOW foods essential oils are my favorites!",
      "text": "I love NOW foods essential oils! I use them in my homemade skin care products, in my essential oils perfumes and in my diffusers, both at home and at work! This blend is sharper than I expected, but lovely! I use fewer drops in my diffuser than some of the other blends, but it is refreshing and calming.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Dunlap",
      "helpful_votes": 12,
      "publication_date": 20161001
    },
    {
      "title": "I absolutely love this oil",
      "text": "I absolutely love this oil. It has a slight cooling effect when applied to your skin. I diffuse it at home for a calming, uplifting effect. I also use a few drops in my bath at night. I have applied this on my forehead for headaches and it gives a nice comforting, cooling feeling. It smells divine! My yoga teacher used it on our foreheads during savasana and I had to know what it was! Amazon has the best price too. This is a winner!",
      "rating": 5.0,
      "verified": true,
      "author": "Connor W.",
      "helpful_votes": 11,
      "publication_date": 20160216
    },
    {
      "title": "peppermint and patchouli",
      "text": "i have a lot of now essential oils that i love but this peace and harmony oil smells like patchouli and peppermint only ,it say that it has a mix of peppermint,patchouli ,orange,lavender,basil ,oils but i put it in my diffuser and my house smells like patchouli and peppermint..i did not like the smell..",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200617
    },
    {
      "title": "Delightful but very pepperminty",
      "text": "Delightful. My coworker had this in her diffuser at work and I just loved it so I bought myself a bottle. The only reason why I took a star off is because the smell is different than my coworker's oil. The patchouli is the top scent when she uses it but for mine the peppermint takes over and the other oils don't come through as much. I have added my own patchouli to it to try to replicate the scent but it's not the same.",
      "rating": 4.0,
      "verified": true,
      "author": "SweetSunniD",
      "helpful_votes": 2,
      "publication_date": 20190123
    },
    {
      "title": "Wonderful smell",
      "text": "Every want your living room (classroom, bedroom, etc.) to smell like every therapist, accupuncturist, or massage office you've ever been in? This is the blend. I love it and use it in a mist diffuser. However, the scent is powerful enough that I need to be careful and not overdo it. There's a few drops difference between soothing and overwhelming.",
      "rating": 5.0,
      "verified": true,
      "author": "carb101",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Clean, herbal scent",
      "text": "Bought this for use in my office at work, so I was looking for something that was both pleasing to me and not offensive to my coworkers. I'm definitely a fan of patchouli - and the other oils in this blend balance it out nicely. I can have the diffuser on all day without it becoming overpowering - and this also is lovely with a few drops of cheer up buttercup added. I'm a huge fan of NOW oils - great value, selection, and quality. This was my first blend - at home I typically make up my own scents from the million bottles I have collected.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 5,
      "publication_date": 20160309
    },
    {
      "title": "Leaked all over and cannot return",
      "text": "I love this product, but this arrived today having leaked all over the packaging, and when I went to click on the \"return item\" button, I found out it is not eligible for returns. So - overall not happy, but wanted to give more than one star, because I do love the product when it arrives intact.",
      "rating": 2.0,
      "verified": true,
      "author": "Margaret Adams",
      "helpful_votes": 2,
      "publication_date": 20181105
    },
    {
      "title": "Nasty smelling oil and INELIGIBLE FOR RETURN",
      "text": "Buyer beware! This oil absolutely stinks! When I was a kid my grandmother had stuff she put on cuts and such....I believe she also cleaned with it. It was called Germtrol. This oil smells just like that. Gross! I tired to return it and found out the product is ineligible for return. I will not buy this brand again since they apparently don’t stand behind their products.",
      "rating": 1.0,
      "verified": true,
      "author": "Robin D",
      "helpful_votes": 2,
      "publication_date": 20190429
    },
    {
      "title": "Love this scent!",
      "text": "Love this product. I am a school teacher and my teaching partner purchased this particular scent, and we love it. Everyone comes into our room and raves about the way it smells. It is a clean uplifting, happy scent. I will be purchasing more.",
      "rating": 5.0,
      "verified": true,
      "author": "Monique W.",
      "helpful_votes": 0,
      "publication_date": 20191025
    },
    {
      "title": "Bottle had a leak...",
      "text": "I love NOW oils. This blend is a gentle peppermint - not overpowering. But the moment I took the package out of the mailbox I smelled something was wrong. The bottle though it was not broken, and \"appeared\" sealed it was covered in its own oil.",
      "rating": 2.0,
      "verified": true,
      "author": "Sheryl",
      "helpful_votes": 2,
      "publication_date": 20181116
    },
    {
      "title": "Great stuff and at such a easonable price",
      "text": "We love this stuff!! Someone gave it to me and when I began wearing it (because it smells so good!) I noticed I never got bitten by mosquitoes. I let my wife try it because she is a favorite meal for mosquitoes. She was really skeptical but discovered it's magic too and now swears by it as a great smelling mosquito control. This purchase was for a friend because we want to show the world what a great product it is.",
      "rating": 5.0,
      "verified": true,
      "author": "Breanna bell",
      "helpful_votes": 0,
      "publication_date": 20190614
    },
    {
      "title": "Awesome customer service.",
      "text": "Gosh this stuff was strong. And it didn't smell the way I thought it would. Everyone has different tastes tho. Didn't seem diluted. Great size bottle. I let the seller know I didn't like it and they refunded me, no questions asked. so no harm in trying it.",
      "rating": 2.0,
      "verified": true,
      "author": "Mz Po*Z",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "A favorite",
      "text": "I love this blend! I am not good at describing scents but I guess I would say it is minty and a bit earthy. I don't usually think of mint at calming, but it makes sense in this blend. I enjoy it any time of day, in my diffuser to scent my home or mixed in with some unscented lotion to scent my skin.",
      "rating": 5.0,
      "verified": true,
      "author": "Khrunch",
      "helpful_votes": 2,
      "publication_date": 20170825
    },
    {
      "title": "Love",
      "text": "This is by far my favorite oil blend. I use young living and doterra and the quality of this oil is on par. I had an issue where I only received one of my two oils but the company fixed this for me in no time and sent me the missing one. I will be ordering again. Thanks! :)",
      "rating": 5.0,
      "verified": true,
      "author": "Lexie Fretz",
      "helpful_votes": 0,
      "publication_date": 20200319
    },
    {
      "title": "Favorite EO blend!",
      "text": "This is one of my favorite essential oil blends. Just 4-5 drops in my large diffuser and it is just right for the living, kitchen and office area of my house. It takes less in a bedroom. Lasts a long time and smells amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Christie D. Steffey",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Don’t buy",
      "text": "Smells horrible. Gave me the worse headache. Smells like a chemical. I wasted my money. I tired to return and company will be not accept returns. Save your money and buy direct. I question is this is authentic.",
      "rating": 1.0,
      "verified": true,
      "author": "Christina Santistevan",
      "helpful_votes": 2,
      "publication_date": 20190810
    },
    {
      "title": "the best",
      "text": "this is my favorite smelling Essential oil blend.. its very strong and so affordable! love definitely recommend trying it out. peppermint sweet orange and pachouli are the oils that stand out in this blend",
      "rating": 5.0,
      "verified": true,
      "author": "Martha Anderson",
      "helpful_votes": 0,
      "publication_date": 20200417
    },
    {
      "title": "If you want a feeling of calm this is the oil to purchase.. 😍 Loving it!!",
      "text": "I love the soothing aroma of this combination oil. It will automatically elicit a feeling of calm. I dilute it because it is powerful and will irritate the skin if not used with a carrier oil. Perfect after a shower while the skin is still damp and pores open. You will fall into a nice sleep. Great for placing on a handkerchief and slowly inhaling through the nose and exhale through the mouth. Relieves anxiety.",
      "rating": 5.0,
      "verified": true,
      "author": "Brina",
      "helpful_votes": 0,
      "publication_date": 20181207
    },
    {
      "title": "This is my favorite essential oil! It smells so clean and good!",
      "text": "This is my favorite essential oil! It smells so clean and good!",
      "rating": 5.0,
      "verified": true,
      "author": "Roxie",
      "helpful_votes": 0,
      "publication_date": 20191028
    },
    {
      "title": "My favorite!",
      "text": "This is my favorite oil to use for the diffuser. I love the mint/patchouli smell and it's very fresh and smells great throughout the house. Not too strong.",
      "rating": 5.0,
      "verified": true,
      "author": "Molly",
      "helpful_votes": 0,
      "publication_date": 20200106
    },
    {
      "title": "Happy Consumer",
      "text": "Love this oil, the scent is good and long lasting",
      "rating": 5.0,
      "verified": true,
      "author": "Dawn B.",
      "helpful_votes": 0,
      "publication_date": 20191116
    },
    {
      "title": "Broken in shipment",
      "text": "This order came broken, I cannot return because of the fact it is liquid. So unfair.",
      "rating": 2.0,
      "verified": true,
      "author": "Dorothy",
      "helpful_votes": 0,
      "publication_date": 20200801
    },
    {
      "title": "Dog Calming...",
      "text": "I have a Corgi who totally freaks out in thunder storms...she trembles/shakes, paces incessantly and pants quicker than I can even count. I am so afraid that her heart is going to explode. It certainly helps when I know that a storm is coming, bet even if not...I put this oil on her neck, and fire it up in my diffuser...and honestly, she is just calm as a cucumber. she will lay down and actually sleep during a crazy storm...AMAZING product!",
      "rating": 5.0,
      "verified": true,
      "author": "Kerry Jones",
      "helpful_votes": 0,
      "publication_date": 20190615
    },
    {
      "title": "A heavenly scent!",
      "text": "Love this scent. I put in my diffuser almost immediately upon receiving it. This is my first time trying Now essential oils and I am impressed by the quality of the product. I will definitely be buying more. The fresh scent of peppermint and orange mixed just right with the patchouli and lavender. Oh it is heavenly !",
      "rating": 5.0,
      "verified": true,
      "author": "Babs",
      "helpful_votes": 0,
      "publication_date": 20170726
    },
    {
      "title": "Great clean scent",
      "text": "Wow, I was so pleasantly surprised by this oil. Frankincense can be very overwhelming but this mixture has a great clean scent. I received it yesterday and am back to order more, I love it!",
      "rating": 5.0,
      "verified": true,
      "author": "AP",
      "helpful_votes": 0,
      "publication_date": 20190714
    },
    {
      "title": "Bottle already opened before delivery",
      "text": "The bottle was opened prior to me getting it. So I don’t know if the oils are pure or if someone filled it up with other things. The smell is slightly different from one I have purchased before. Don’t like getting an already opened bottle of anything!",
      "rating": 1.0,
      "verified": true,
      "author": "A.A.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Great w/ Diffuser",
      "text": "I have used the Peace and Harmony essential oil blend in my diffuser. It is good to use daily as an aromatic scent to the air. I have found it also useful to assist with sleeping.",
      "rating": 5.0,
      "verified": true,
      "author": "Alisthegreatest",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Great Value-great scent!",
      "text": "I love the scent! I diffuse it at work-and coworkers like it also. I also have a lanyard with an essential oil aromatherapy felt pad in it and I have used this oil on it once and 3 weeks later I can still smell it. Very pleased!",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Clean smell",
      "text": "Smells okay if you like the smell of Pine sol. That's exactly what this smells like.",
      "rating": 3.0,
      "verified": true,
      "author": "Stephanie Smith",
      "helpful_votes": 0,
      "publication_date": 20200704
    },
    {
      "title": "I like NOW Oils",
      "text": "Use this scent in lotions, homemade cleaners, etc. It’s probably my favorite smell. And people that walk through my front door always comment about how wonderful my house smells.",
      "rating": 5.0,
      "verified": true,
      "author": "BritishHistoryNut",
      "helpful_votes": 0,
      "publication_date": 20181025
    },
    {
      "title": "Refreshing and calming... my favorite!",
      "text": "This has quickly become my favorite oil blend to diffuse. It has a clean, herbal, minty smell, that really is calming. The quality of NOW products are high and well worth the affordable price.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Soller",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Makes your anxiety disappear and your dreams come true",
      "text": "This product is great it literally smells like mint, lavender and like a unicorn farted in you. But in a good way. No regrets. I’ll get it again.",
      "rating": 5.0,
      "verified": true,
      "author": "Carolina",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Terrible smell",
      "text": "This smells terrible. Instead of calming me, it made me feel so rageful that I had to throw it away. The smell is like the taste of drinking orange juice after brushing your teeth combined with dirty dreads smell.",
      "rating": 1.0,
      "verified": true,
      "author": "chantal wagner",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Not a fan",
      "text": "I am not a fan of this scent. There's way too much patchouli in it.",
      "rating": 1.0,
      "verified": true,
      "author": "Janice Cahill",
      "helpful_votes": 0,
      "publication_date": 20200302
    },
    {
      "title": "LOVE this blend",
      "text": "LOVE this blend. Put it in the diffuser at night and sleep like a baby. I normally suffer from insomnia and this helps me fall asleep much more quickly. If I hadn't had the experience myself I would have called malarkey on anyone telling me how well it works. Try it, you'll love it!",
      "rating": 5.0,
      "verified": true,
      "author": "mathness",
      "helpful_votes": 3,
      "publication_date": 20150630
    },
    {
      "title": "this brand is really they best",
      "text": "I love the scent just wish they were a little cheaper on here you can find them in the stores for half the prices",
      "rating": 5.0,
      "verified": true,
      "author": "Katelyn",
      "helpful_votes": 0,
      "publication_date": 20190613
    },
    {
      "title": "Heavenly!",
      "text": "I love the way this blend smells. It is so relaxing. I put a few drops onto a cotton pad and tuck it into my steamer’s mop pad. Makes my entire apartment smell heavenly!",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Love it",
      "text": "I really like this scent. This is my second time purchasing and also bought a bottle for my friend. I sprinkle on our bed to help us sleep and it does. It's great. Thanks.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200531
    },
    {
      "title": "Smells fantastic.",
      "text": "Really like the scent. Be careful and test it before applying a lot as it's quite strong. One drop on one wrist and rub both wrists together works for me.",
      "rating": 5.0,
      "verified": true,
      "author": "Brody Avalon",
      "helpful_votes": 0,
      "publication_date": 20181002
    },
    {
      "title": "Relaxing blend",
      "text": "I like it but my husband hates it. I use in my office exclusively so he doesn't smell it. I find it relaxing.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Love this product!",
      "text": "I received this as a gift. When I ran out I had to get more!",
      "rating": 5.0,
      "verified": true,
      "author": "Kristen Tomko",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Lovely aroma",
      "text": "Really great blend of essential oils that make any room smell good and help relax the people in those rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "Doris E.",
      "helpful_votes": 0,
      "publication_date": 20200220
    },
    {
      "title": "Do not recommend",
      "text": "Really overpowering and obnoxious blend. I instantly get a headache upon diffusing. Sadly I disposed of it after 2 tries.",
      "rating": 1.0,
      "verified": true,
      "author": "alicia",
      "helpful_votes": 0,
      "publication_date": 20171230
    },
    {
      "title": "Unfortunately arrived 1/2 gone",
      "text": "This oil smells really nice however half my bottle is spilled when it arrived. It’s all over the bag and is wasted. It’s really disappointing that the packaging isn’t better. I saw others have the same problem.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201016
    },
    {
      "title": "Great",
      "text": "I love this scent. I've been using it in a diffuser in the evening after work. Smells great I would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Tamara",
      "helpful_votes": 0,
      "publication_date": 20181106
    },
    {
      "title": "Calming!",
      "text": "This scent is very calming. I use this in the diffuser when I come home from work and it sets the tone for relaxation",
      "rating": 5.0,
      "verified": true,
      "author": "Renee Grady",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "I LOVE this oil!",
      "text": "This is my absolute favorite smelling oil. I used to sell young living but I believe it is a scam. You can get these oils on amazon for so much cheaper and they work just as good.",
      "rating": 5.0,
      "verified": true,
      "author": "Maranda",
      "helpful_votes": 3,
      "publication_date": 20151106
    },
    {
      "title": "Great product",
      "text": "Live this scent, the baby can be fussing or It could have been a stressful day and put this in the diffuser and it is like a everything just melts away! The baby is even happier",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah B",
      "helpful_votes": 0,
      "publication_date": 20190919
    },
    {
      "title": "Relaxing and beautiful aroma",
      "text": "I suffer from anxiety and insomnia. Before bed I run a hot bath and put a few drops of this oil. It’s truly relaxing. Makes my home smell like a spa. I’ve used it nearly everyday for over a year and it has helped immensely.",
      "rating": 5.0,
      "verified": true,
      "author": "Maya Lias",
      "helpful_votes": 0,
      "publication_date": 20190111
    },
    {
      "title": "Need sleep?",
      "text": "Love, love, love NOW oil blends. I use this every night. 3 drops mixed into my lotion, rub on feet, put socks on and hello sleep!",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20170502
    },
    {
      "title": "Good",
      "text": "Very strong scent. Much more potent than most oils I've used. Smell is good, not my favorite. I enjoy it due to its potency.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191005
    },
    {
      "title": "Go-to essential oil",
      "text": "This is my go to essential oil to keep on hand. I have bought it 3 times. This essential oil is best used topiclally. When used before bed, few drops on the spine. I usually get the best sleep. It also smells great diffused if you can stand patchouli smell.",
      "rating": 5.0,
      "verified": true,
      "author": "meagan taylor",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Love it!!!",
      "text": "My new favorite oil for the diffuser! I placed another order yesterday.",
      "rating": 5.0,
      "verified": true,
      "author": "Eugenia",
      "helpful_votes": 0,
      "publication_date": 20181130
    },
    {
      "title": "Very Relaxing",
      "text": "I put this in an oil roller and it is super calming. I have a roller on my desk at work and one in my travel kit (I fly frequently). It truly helps calm me, which is great since I have bad anxiety.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190302
    },
    {
      "title": "Smells awful",
      "text": "The oil is fine, but I hate the scent; smells like straight up Turpentine.",
      "rating": 3.0,
      "verified": true,
      "author": "CM",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Spa worthy!",
      "text": "I absolutely LOVE this blend. They used this on me at a spa appointment I'd had and I was hooked. There are those that complain about the patchouli in here, but I love that scent anyway. I diffuse this at home in the evenings. It's very calming to me, and my husband likes it too. I also tried it in a homemade sugar scrub and it smells SO GOOD! I have ordered this at least 4 times. Again, if you love patchouli, you should love this.",
      "rating": 5.0,
      "verified": true,
      "author": "slkraso",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Great Oil Blend!!",
      "text": "I really love this oil. Mine has a pretty strong Patchouli smell, which I like, so I immediately made a room/pillow spray. Its very soothing and relaxing. I will continue to buy and keep on hand!",
      "rating": 5.0,
      "verified": true,
      "author": "tessa knowles",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Bought several.  This is my favorite",
      "text": "Headline says it all. Smells nice. Combines several scents. Lasts a long time. This is my favorite of the 8 or so I bought with a new diffuser.",
      "rating": 4.0,
      "verified": true,
      "author": "JCL",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "Leaking",
      "text": "I like this a lot I even bought another one. The only thing is when I received mine it was leaking. I probably lost half of oil when the package got to me.",
      "rating": 4.0,
      "verified": true,
      "author": "Annie R ",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "I was disappointed and hoping for something with other tones",
      "text": "This smells STRONLY of mint. That's all I smelled. I was disappointed and hoping for something with other tones. It's not what I expected. I think they should list it as primarily mint.",
      "rating": 2.0,
      "verified": true,
      "author": "Momof5",
      "helpful_votes": 2,
      "publication_date": 20141208
    },
    {
      "title": "Five Stars",
      "text": "Such a great scent. Clean, refreshing, and not too overpowering! Planning on buying in bulk. LOVE!",
      "rating": 5.0,
      "verified": true,
      "author": "Christina DeFelice",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "Very relaxing and a great value!",
      "text": "Very relaxing scent. I was at a yoga studio and the teacher at the end of the session gave us all a little face rub with this scented oil. It was amazing and the highlight of the class. It was very calming and relaxing the scent itself is hard for me to describe but its very pleasant has a little minty smell and feel so you get that nice tingle that mint products can give. Relaxing and mindfully stimulating and cooling if that makes sense. Love this and will order more when this bottle is gone. However given the bottle size I think this will last a LONG time which makes this an awesome value!",
      "rating": 5.0,
      "verified": true,
      "author": "Hypnoticfire",
      "helpful_votes": 3,
      "publication_date": 20160417
    },
    {
      "title": "It works",
      "text": "I just love this blend. It smells good and it does a great job of helping me relax.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle F",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Love this scent, great price!",
      "text": "Very happy with this scent! It is very calming and not overwhelming at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle Zeppieri",
      "helpful_votes": 0,
      "publication_date": 20190713
    },
    {
      "title": "Five Stars",
      "text": "Ordered several of these and love the scent. I love NOW oils!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171206
    },
    {
      "title": "Five Stars",
      "text": "Has a very nice smell and arrived a day early.",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "but I do like the scent",
      "text": "The scent is very strong in a small space, but I do like the scent. I will say it is not for everyone, but it is calming.",
      "rating": 4.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 0,
      "publication_date": 20170319
    },
    {
      "title": "Pepperminty",
      "text": "This oil is decent. The peppermint is a little overbearing. Was expecting a different scent. However, I am not displeased.",
      "rating": 3.0,
      "verified": true,
      "author": "MommaRu",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Love it",
      "text": "Great scent. Works great for my Autistic son mixed with his lotion.",
      "rating": 5.0,
      "verified": true,
      "author": "Heidi",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "Lovely scent!",
      "text": "Love this scent, lasts a long time. Works great in the essential oil diffuser.",
      "rating": 5.0,
      "verified": true,
      "author": "BSGF0201",
      "helpful_votes": 0,
      "publication_date": 20161101
    },
    {
      "title": "Wonderful blend of essential oils",
      "text": "My favorite blend. Such a soft subtle scent. Feel calm settling in as soon as the mist starts.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160611
    },
    {
      "title": "Highly recommend",
      "text": "Very happy with this purchase. Good quality and good price.",
      "rating": 5.0,
      "verified": true,
      "author": "kkelly",
      "helpful_votes": 0,
      "publication_date": 20180828
    },
    {
      "title": "Not quality",
      "text": "Smelled good in the bottle but has a weird scent when diffused. Definitely not high quality. Wouldn't buy again.",
      "rating": 3.0,
      "verified": true,
      "author": "Christy M",
      "helpful_votes": 0,
      "publication_date": 20161231
    },
    {
      "title": "One Star",
      "text": "Bottle was open already and doesn't smell like the real \"Peace & Harmony\".",
      "rating": 1.0,
      "verified": true,
      "author": "adrsmith",
      "helpful_votes": 2,
      "publication_date": 20170118
    },
    {
      "title": "Smells amazing!",
      "text": "This smells amazing! It’s a mix of everything good! Basil, lemon, patchouli. Will defiantly be buying again!",
      "rating": 5.0,
      "verified": true,
      "author": "jaime rucinski",
      "helpful_votes": 0,
      "publication_date": 20181124
    },
    {
      "title": "Not for me",
      "text": "I did not like this scent at all. It has a very distinct musky and almost earthy smell that is incredibly potent (and in a bad way in my opinion) It is so strong that the scent still remains in my diffuser to this day even after multiple cleanings with white vinegar. It also stunk up my cabinet where I keep my other oils. I had to eventually just throw it away. I almost wonder if I just got a \"bad batch\" or something because it seems that most of the reviewers on Amazon were pleased.",
      "rating": 1.0,
      "verified": true,
      "author": "studiotime",
      "helpful_votes": 2,
      "publication_date": 20160304
    },
    {
      "title": "I wanted to like this oil",
      "text": "I wanted to like this oil, and I do a little bit, but the peppermint smell is overpowering. If they cut back a little on it, it would smell amazing.",
      "rating": 3.0,
      "verified": true,
      "author": "JML",
      "helpful_votes": 0,
      "publication_date": 20160427
    },
    {
      "title": "Too much patchouli",
      "text": "I initially liked this product in my diffuser but it quickly became overwhelming. It is VERY strong. I used just two drops and the patchouli scent was too much for me.",
      "rating": 2.0,
      "verified": true,
      "author": "Brunson",
      "helpful_votes": 0,
      "publication_date": 20150315
    },
    {
      "title": "Great Scent",
      "text": "Now scented oils are the only oils that I use. Great price and the scents are long lasting. My favorite are the combo ones like this one.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Crockett",
      "helpful_votes": 0,
      "publication_date": 20181227
    },
    {
      "title": "Five Stars",
      "text": "Smells great and nice quality product. Lasts for a long time too.",
      "rating": 5.0,
      "verified": true,
      "author": "Lani32",
      "helpful_votes": 0,
      "publication_date": 20160526
    },
    {
      "title": "Wonderful Scent",
      "text": "This is our favorite scent. The name is very accurate.",
      "rating": 5.0,
      "verified": true,
      "author": "Roll Man",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "smells great!",
      "text": "This smells great! I use it in my diffuser and it seems to really bring peace and calming to the house.",
      "rating": 5.0,
      "verified": true,
      "author": "acastleberry",
      "helpful_votes": 0,
      "publication_date": 20150705
    },
    {
      "title": "Five Stars",
      "text": "My absolute favorite! Sometimes I put in a diffuser, other times I wear it!",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Stapperfenne",
      "helpful_votes": 0,
      "publication_date": 20170625
    },
    {
      "title": "Love it!",
      "text": "Love now oils! I have purchased oils before and was always dissapointed. Now oils brand is the best! Works great when im in my Zen state of mind. All natural and not to overpowering of a scent!",
      "rating": 5.0,
      "verified": true,
      "author": "I am NJ",
      "helpful_votes": 0,
      "publication_date": 20161126
    },
    {
      "title": "Lovely",
      "text": "This is a tranquil, calming scent any atmosphere will benefit from.",
      "rating": 5.0,
      "verified": true,
      "author": "Margarita",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Smells great",
      "text": "We use this in the diffuser and it smells great.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacie Burns",
      "helpful_votes": 0,
      "publication_date": 20190331
    },
    {
      "title": "A smell you wanna smell all the time",
      "text": "Smells amazing, you will not be disappointed I get compliments all the time on how good my house smells",
      "rating": 5.0,
      "verified": true,
      "author": "Troy Meyen",
      "helpful_votes": 0,
      "publication_date": 20181031
    },
    {
      "title": "Love this but have to be careful",
      "text": "We use this in our open living/dining room. We have a diffuser. It's amazing! I really like the smell. I got a second diffuser for the bedroom. I cosleep with my 2.5 year old son. I had it on and let him sleep. He woke up coughing. I read that peppermint can be irritating to their sinuses. I turned it off. I am getting plain lavender or a peppermint free one for the bedroom. Also, I used too many drops. It's a strong smell but I used too many drops :) in an open room it's fine, but in a bedroom it's too strong for my son. I still recommend it for an open room if you have kids!",
      "rating": 4.0,
      "verified": true,
      "author": "JL",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Unbalanced scent.",
      "text": "Basil really dominates this blend, followed by citrus. The patchouli didn't show up for hours. Didn't really like it, too bad.",
      "rating": 1.0,
      "verified": true,
      "author": "MyPublicName",
      "helpful_votes": 0,
      "publication_date": 20160627
    },
    {
      "title": "Love the wonderful scent and reasonable price",
      "text": "I use this on dryer balls and in the diffuser. Love the wonderful scent and reasonable price.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Martin",
      "helpful_votes": 0,
      "publication_date": 20180325
    },
    {
      "title": "The air is calming & smells wonderful.",
      "text": "I defuse this into the air with a Now diffuser in my home & business. The air is calming & smells wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer livingston",
      "helpful_votes": 0,
      "publication_date": 20150414
    },
    {
      "title": "LOVED THE AROMA 😀",
      "text": "LOVED THE AROMA Quick shipping would buy from this company again ! THANKS",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20181127
    },
    {
      "title": "Three Stars",
      "text": "My husband likes the more masculine scent to this blend.",
      "rating": 3.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "Smells great!",
      "text": "Love it,, wear this with carrier oil as perfume... daily.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180422
    },
    {
      "title": "Five Stars",
      "text": "This is the best essential oil I own, hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "Fallon",
      "helpful_votes": 0,
      "publication_date": 20170616
    }
  ],
  "product_meta": {
    "title": "NOW Essential Oils, Peace & Harmony Oil Blend, Calming Aromatherapy Scent, Blend of Pure Essential Oils, Vegan, Child Resistant Cap, 1-Ounce",
    "description": "The use of natural essential oils for aromatherapy is an ancient and time-honored tradition that’s been enhancing moods and lifting spirits for thousands of years. Essential oils are liquid plant essences that are genuine reflections of the botanicals from which they’re born. This centering blend consists of peppermint, patchouli, orange, lavender and basil oils only, created through a natural distillation and cold pressed processes, offering the purest and most potent natural essential oil available. Natural essential oils are highly concentrated and should be used with care.",
    "rating": 4.6,
    "feature_bullets": [
      "Essential Aromatherapy : Peace and Harmony is centering, calming and balancing with a minty, floral herb scent that promotes balance, relaxation and meditation. A natural and effective way to stay calm even during particularly stressful days",
      "Responsibly made: The orange oil is cold pressed, peppermint, patchouli, lavender and basil are extracted through steam distillation. Made in state-of-the-art laboratories, naturally derived, subject to purity testing, vegan with no animal testing",
      "Pure ingredients/undiluted: Our essential oils are highly concentrated and free of synthetic ingredients, delivering the very best benefits of the source of the plants, fruits, seeds, flowers, bark, stems, roots or leaves from which they come",
      "Multi-use/benefits : Aromatherapy is an ancient and time-honored tradition. Can be used in diffusers to breathe fresh air into a room or to enjoy aromas that relax or stimulate your mind. Melt away stress and tension in an instant with a simple drop",
      "Clean/safe alternative: Presents a safe, natural alternative to toxic, artificial aerosol sprays or messy candles. If you're concerned about keeping your home both clean and fire safe, we'd highly suggest throwing some essential oils in the mix"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "1.25 x 1.25 x 3.5 inches; 2.88 Ounces",
      "Item model number": "P29263",
      "UPC": "733739076083",
      "Manufacturer": "NOW FOODS",
      "ASIN": "B00GQVA8ZO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Health Care",
      "Aromatherapy",
      "Essential Oil Blends",
      "Health & Household",
      "Beauty & Personal Care",
      "Alternative Medicine",
      "Carrier & Essential Oils"
    ],
    "price": 9.07
  }
}