{
  "website_summaries": [
    {
      "verdict": "Great streaming abilities at a great price.",
      "pros": [
        "Effortlessly streams music from countless online sources and thousands of online radio stations",
        "Has a digital alarm clock function"
      ],
      "cons": [
        "The design is somewhat bulky, and the sound is not as rich as that of some high-end competitors"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Great...when it works",
      "text": "This is a lovely looking bit of kit that should appeal to fans of mid-century modern, space-age chic and utilitarian solidity alike. The sound is more than adequate for my small living room, if a little bass heavy. It's the connectivity that's the problem. Super, it aint. Whether on Spotify or internet radio, the Revo unexpectedly goes silent after a while, displaying 'press play' on the LCD. Unfortunately, pressing play does nothing and the only way to get further sound out of the thing is to unplug from the mains and plug back in. Contacting Revo was a waste of time as they simply blamed Spotify.",
      "rating": 2.0,
      "verified": true,
      "author": "red_monkey",
      "helpful_votes": 17,
      "publication_date": 20170520
    },
    {
      "title": "Looks and sounds wonderful, but build quality has a long way to go",
      "text": "This was a tough one. It looks beautiful, and the sound is everything that I had hoped - crisp, clear, natural and resonant. On the other hand, the facia was askew in the case and the wifi couldn't get a signal where other devices had no problem. I contacted Amazon who were out of stock for a replacement, and I'm not prepared to chance buying from another seller who mightn't be as accommodating of returns (I'm in Ireland). I therefore reluctantly returned it for a refund.",
      "rating": 2.0,
      "verified": true,
      "author": "AnanM",
      "helpful_votes": 7,
      "publication_date": 20170131
    },
    {
      "title": "Excellant radio - Wish the companion app wasn't so buggy",
      "text": "If you wish to use this as a standalone device and never control it from your phone then it's 5/5 wonderful product. However the third party app used to control it (Undok) is excessive in it's permission requests and that it keeps crashing (on android, no experience with iOS). If I could rate only the radio: 5/5 Sound 5/5 Versatility 5/5 Ease of use (just get used to the joystick and it's a much better input device as it saves retail space, love you can just put your hand over the speaker and it mutes the alarm!) The app (not developed by the makers of the radio) brings my rating down.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20180831
    },
    {
      "title": "New firmware update adds internet DASH streams",
      "text": "Wonderful radio with great sound, today's firmware update (16/9/16) has enabled mpeg-dash streaming for internet radio, now I am not limited to 128kbps MP3 format for BBC stations, I have a good unlimited internet connection and all BBC streams are now 320kbps AAC, also seems to be an improved buffer giving less dropouts on internet (Audiophile Jazz was a bit stop & go before). In addition the podcast or listen again service is working. Outstanding work from Revo and the BBC. I find the Undok app works well on my phone and would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "MJ",
      "helpful_votes": 4,
      "publication_date": 20160916
    },
    {
      "title": "Good sound qaulity, good customer service.",
      "text": "Very good sound qaulity. the product itself is very good, retro stylish, have to use internet radio as DAB and FM is virtually non existant where I live. Would have liked the option to plug an ethernet cable. wifi ok, needed to ring up for assistance. Customer services were on the ball and very helpfull. asked me what the router was and told me that the the WPS was turned off by my broadband supplier by default. Rang supplier, walked me through it, all good.",
      "rating": 4.0,
      "verified": true,
      "author": "Milan",
      "helpful_votes": 0,
      "publication_date": 20181104
    },
    {
      "title": "Half the price of the Bose Wave® SoundTouch® music system IV",
      "text": "Had purchased a £600 Bose Wave® SoundTouch® music system IV which I returned after it broke within a month. Purchased a Revo SuperConnect as a replacement for £300 and I'm delighted. The Revo is made of better materials, has a better screen, looks better, sounds better with more clarity, has better DAB reception, is easier to setup, doesn't crackle when moved, and is HALF THE PRICE.",
      "rating": 5.0,
      "verified": true,
      "author": "AJH",
      "helpful_votes": 3,
      "publication_date": 20170328
    },
    {
      "title": "Only lasted 18 months.",
      "text": "We were really happy with this radio until it died only after 18 months. We went for an expensive brand thinking it would last. Reading other reviews I now understand this seems to be a common problem with this make.",
      "rating": 1.0,
      "verified": true,
      "author": "StrategicA",
      "helpful_votes": 6,
      "publication_date": 20181104
    },
    {
      "title": "I looked at all the rest that were cheaper but if you want a good one get this",
      "text": "This radio has transformed my listening. I've bought another since for my wife. I looked at all the rest that were cheaper but if you want a good one get this. I love the weight, it's solid and the tone. It looks good on my desk and I listen as I work. Now which country shall I listen to today.................. PS when you use internet radio it eats into your download allocation which is fine if like me you have unlimited. Worth thinking about if you have a limit. It has DAB and FM of which there is an aerial to extend.",
      "rating": 5.0,
      "verified": true,
      "author": "Charles Dickens",
      "helpful_votes": 4,
      "publication_date": 20141029
    },
    {
      "title": "In a world full of low expectations isn't it great to find a product that not only meets them ...",
      "text": "In a world full of low expectations isn't it great to find a product that not only meets them but exceeds them by a mile. I have always been an avid radio listener and chosen my radios carefully. When it was time to replace my battered and trusted model I researched the market and this radio consistently came on top in owner reviews. It’s British and designed and built with love by people who care and appreciate their craft. Finally, it sounds better than I could ever imagine and isn't that all that really matters because radio is all about listening.",
      "rating": 5.0,
      "verified": true,
      "author": "BC",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Decent audio but should get a few software updates",
      "text": "Audio quality is fine, and that's what's essential. Remote control is rather basic and needs a lot of pushes to go up/down in the hierarchical menu structure: missing shortcuts here. A more elaborated remote control app like all the others have would be nice too. Losing internet connection by default is a bad choice, especially because (re)connecting can be slow. The dutch menu contains german item(s)... yikes!",
      "rating": 3.0,
      "verified": true,
      "author": "G V",
      "helpful_votes": 0,
      "publication_date": 20190307
    },
    {
      "title": "This is the way to listen to DAB and internet services.",
      "text": "Looks good, runs fast, works well, remote app is imperfect but powerful, actual remote is tiny (there's a cracking big remote you wont be losing). Lots of things that could be better but the essentials, DAB, Sound, Alarms, it's spot on.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Walker-morgan",
      "helpful_votes": 0,
      "publication_date": 20191011
    },
    {
      "title": "Great radio - alarm feature not that great",
      "text": "Great radio - alarm feature not that great This is a very good radio. The sound quality is excellent, the quality and look of the product is almost perfect for me. Only gripe is that I bought this as a bedside radio to wake me up in the morning; sadly the alarm is not that great - the snooze feature doesn't work that well (at 6am I cant get it to work) the software means I can only set two alarms and worse can only snooze once. Hopefully the software is easily fixed?",
      "rating": 4.0,
      "verified": true,
      "author": "Andrew Brown",
      "helpful_votes": 0,
      "publication_date": 20180118
    },
    {
      "title": "Excellent product from a 5 star company!!",
      "text": "This is a fantastic product from a stellar company!! Absolutely love our Superconnect. Aesthetically gorgeous and the sound is equally beautiful. We couldn’t be more satisfied with our purchase. We bought the Matt black/silver and it definitely has that 2001: A Space Odyssey/retro tech feel :-) Been in touch with a fella from the company up in Scotland for some advice and they’re just fantastic, lovely and offer 5-star customer service. Definitely recommend a REVO to anyone thinking of purchasing something in this field.",
      "rating": 5.0,
      "verified": true,
      "author": "miss cheng",
      "helpful_votes": 0,
      "publication_date": 20181009
    },
    {
      "title": "Not the cheapest, but gets the stations we want to listen to.",
      "text": "This is a well made \"solid\" unit. We purchased it for listening to the radio in the UK, specifically internet radio. Technical things usually baffle me when setting them up but once set the unit has worked very well. For once I worked through the technical manual and if I had a question a quick call to REVO sorted things out.",
      "rating": 5.0,
      "verified": true,
      "author": "Ian",
      "helpful_votes": 2,
      "publication_date": 20190201
    },
    {
      "title": "Excellent build, sound quality but let down by WiFi connection repeatedly dropping.",
      "text": "I love it's looks,vthe sound quality but at least every month it goes silent on using internet radio, constantly searching for connection. There's nothing wrong with the WiFi everything else is stable but this radio drops out! Have to factory reset which is ruining the experience. I really want to like this radio but this one annoyance defeats this function, a shame.",
      "rating": 4.0,
      "verified": true,
      "author": "Sch",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "A top quality radio for an outstanding price.",
      "text": "This radio is the answer to all your radio needs. Sounds excellent, build quality outstanding and really easy to use. I would even go as far as saying its superior to any other ive seen on the market in this price range. I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Music spinner",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Amazon replaced it with out any problem and this one is nearly perfect, the only complaint is that Spotify keeps freezing ...",
      "text": "First one was faulty a lot of vibration even on low volumes, Amazon replaced it with out any problem and this one is nearly perfect, the only complaint is that Spotify keeps freezing up, sometimes up to 3 times an hour even though I have a good internet connection, very frustrating.",
      "rating": 5.0,
      "verified": true,
      "author": "Mac",
      "helpful_votes": 0,
      "publication_date": 20170610
    },
    {
      "title": "Really happy with this purchase and Revos service",
      "text": "This product looks and feels absolutely amazing! The sound is great as well and the Spotify connect feature is a huge bonus. I am having issues with the remote however Revo are working hard to solve the problem and I am sure they'll pull through as the service is second to none. Really happy with the product, definitely recommend if you're looking for a good looking speaker with quality sound at this price.",
      "rating": 5.0,
      "verified": true,
      "author": "Safri",
      "helpful_votes": 2,
      "publication_date": 20160317
    },
    {
      "title": "Totally love my SuperConnect",
      "text": "Totally love my SuperConnect. The connectivity is brilliant - internet radio, FM radio, DAB, AUX, Bluetooth and Spotify. I have Spotify Premium so use this a lot and with internet radio I am spoilt to hundreds of stations. The sound from the speakers is fantastic. Its the best radio I have purchased.",
      "rating": 5.0,
      "verified": true,
      "author": "Nils",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "As new",
      "text": "The sound of the radio is very good. Good deep bass without losing quality of mid and high. Set up was easy. Packaging was good and was delivered very fast to Belgium. The box had a Little wear as it was described. The radio sound and looks like new. Very Satisfied Thx",
      "rating": 5.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Excellent Quality",
      "text": "Expensive but really solid and heavy bit of kit. Struggled to connect to my wifi & lost the setup menu! However, even on a Saturday Revo technical support were there to help. Soon got connected to wifi and the rest was really easy. It is mono, although with the solid walnut cabinet the sound is excellent. Really pleased with this and the usual Amazon Prime next day delivery.",
      "rating": 5.0,
      "verified": true,
      "author": "RogerRam",
      "helpful_votes": 0,
      "publication_date": 20140621
    },
    {
      "title": "An absolutely superb radio!",
      "text": "Can't believe how good this radio is! Spotify Connect works a treat, and so does everything else (Bluetooth, DAB, FM etc). The sound is magic; clear, punchy bass - all coming from only one speaker - magic! And to top it all: it's a Scottish product (OK, made in China). Bravo Revo. Buy this and you will love it.",
      "rating": 5.0,
      "verified": true,
      "author": "PP",
      "helpful_votes": 2,
      "publication_date": 20150320
    },
    {
      "title": "2 year review",
      "text": "2 year review Major issues with volume knob - bass vibrates through the knob frame and rattles the radio Struggle to turn down the volume as knob usually turns it up when it should be going down.........has almost left the device unusable Remote control has also given up the ghost Do Not recommend this machine, especially for the price",
      "rating": 1.0,
      "verified": true,
      "author": "Gareth Williams",
      "helpful_votes": 2,
      "publication_date": 20161230
    },
    {
      "title": "Excellent product and excellence service",
      "text": "The Revo SuperConnect is a very nice product and has a very good sound quality. I only miss a USB connector for pendrives or external hard drives and the joystick seems weak. I have tested all functions and works fine and with a perfect sound. The Amazon service was very good too.",
      "rating": 5.0,
      "verified": true,
      "author": "Cliente Amazon",
      "helpful_votes": 0,
      "publication_date": 20190118
    },
    {
      "title": "Great sound and features",
      "text": "The quality of the manufacture is very good, I appreciated the details, the finish, the graphic menu, and the sound is great. The price is a little high so I chose the refurbish variant from Revo which has the lowest price. The device received is impeccable. Thank you Revo for your support!",
      "rating": 5.0,
      "verified": true,
      "author": "Dan",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "Fantastic quality radio",
      "text": "Fantastic quality radio, the sound and tone are excellent. Easy to set up, although I did have to ring the Revo help line to initially set up the internet radio mode. They were very helpful and answered the call on the first ring. After that call everything is working brilliantly, I can't stop listening. Very pleased with this purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140910
    },
    {
      "title": "Gorgeous looks, lovely warm sound.",
      "text": "Bought this to stick in the bedroom for waking up to. Audio quality is excellent with a surprising amount of warmth which I wasn’t expecting. It looks absolutely gorgeous on the bedside cabinet too.",
      "rating": 5.0,
      "verified": true,
      "author": "THE_FACTS",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Great bit of kit",
      "text": "Really impressed with the sound quality and Spotify connectivity. Handles bass and treble almost up to full volume superbly. Fills the downstairs of the house. The DAB and FM connections are superb. Impresses audiophile friends and bass hungry youngsters alike",
      "rating": 5.0,
      "verified": true,
      "author": "Mr M",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Great look, great sound and features (from which I ...",
      "text": "Great look, great sound and features (from which I use just DAB+ and Internet Radio though). There is only one thing I would have changed, I would add select function (like press/push) directly to joystick as I always try to push it anyway during the manipulation, the combination of joystick and select button...you have got to get used to this.",
      "rating": 5.0,
      "verified": true,
      "author": "PETER TOMASEK",
      "helpful_votes": 0,
      "publication_date": 20170824
    },
    {
      "title": "A quality product",
      "text": "Looks superb, and the sound quality is the best I've heard on any radio.",
      "rating": 5.0,
      "verified": true,
      "author": "Condor",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "Fantastic!!!",
      "text": "Top quality product. Great sound and build quality. Wi-fi works flawlessly. Great job Revo!",
      "rating": 5.0,
      "verified": true,
      "author": "Arsen",
      "helpful_votes": 0,
      "publication_date": 20180210
    },
    {
      "title": "Brilliant",
      "text": "Beautiful bit of kit! Amazing clarity & bass even at higher volume. Excellent connectivity & intuitive controls. Could do with a short cut to the EQ settings but there are two spare buttons on the remote so maybe that feature could be added in future updates? A little disappointed with the finish of the wood but that wouldn't put me off. In fact I'm saving up for another one for the bedroom!",
      "rating": 5.0,
      "verified": true,
      "author": "MR PAUL RICHARDSON",
      "helpful_votes": 0,
      "publication_date": 20150202
    },
    {
      "title": "Simply great",
      "text": "This is a great radio, the sound quality is fabulous. I can‘t see why I‘d ever want to replace this piece!",
      "rating": 5.0,
      "verified": true,
      "author": "NS",
      "helpful_votes": 0,
      "publication_date": 20180305
    },
    {
      "title": "Revo SuperConnect.",
      "text": "You want the best.....well,you've got it. Looks fantastic.....easy to use and set up.....sounds amazing. What more could you possibly want.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. Michael J. Ketchell",
      "helpful_votes": 2,
      "publication_date": 20151011
    },
    {
      "title": "Five Stars",
      "text": "Third one I have bought for our house. Incredible sound. A well deserved What HiFi award winner.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. G. Parr",
      "helpful_votes": 2,
      "publication_date": 20151028
    },
    {
      "title": "Five Stars",
      "text": "Fantastic even though it is only mono,it has lovely build quality as well.I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr Michael Davidson,",
      "helpful_votes": 2,
      "publication_date": 20141216
    },
    {
      "title": "Sounds lovely",
      "text": "Works nicely and sounds lovely. Can’t really handle having the volume turned up though for bassy stuff",
      "rating": 4.0,
      "verified": true,
      "author": "Tomasf",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Five Stars",
      "text": "THIS RADIO IS REALLY GOOD FOR AUDIO PERFORMANCE, RECEPTION OF RADIO STATIONS, DESIGN AND QUALITY OF CONSTRUCTION.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160303
    },
    {
      "title": "Five Stars",
      "text": "I think this is a brilliant product,although,at first,I had trouble connecting to the internet.",
      "rating": 5.0,
      "verified": true,
      "author": "Philip Ward",
      "helpful_votes": 0,
      "publication_date": 20141115
    },
    {
      "title": "But looks great and sounds pretty good",
      "text": "Spotify connect sometimes pauses itself. Very expensive. But looks great and sounds pretty good.",
      "rating": 4.0,
      "verified": true,
      "author": "R. Jarman",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "Revo Superconnect",
      "text": "First class radio, excellent finish to the cabinet The sound is near perfect",
      "rating": 5.0,
      "verified": true,
      "author": "SM104",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "excellent radio, great sound",
      "text": "excellent radio, great sound, many listening options available, best radio I have ever had, one quibble, the Spotify connection is operative for the **Premium service only but the advertising blurb doesn't make that clear. * monthly subscription required",
      "rating": 5.0,
      "verified": true,
      "author": "damien geraghty",
      "helpful_votes": 0,
      "publication_date": 20160916
    },
    {
      "title": "Five Stars",
      "text": "My son loves this. We bought a wifi booster because without one this product wouldn't work consistently",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170309
    },
    {
      "title": "Impressed",
      "text": "Never was planning to spend this much, but after reading the reviews thought that most everything else would seem second best. No regrets. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Thomas Bush",
      "helpful_votes": 0,
      "publication_date": 20150212
    },
    {
      "title": "No regrets - excellent.",
      "text": "Excellent radio, Connectivity is fantastic, Audio quality very respectable for such a small device, very impressed and would buy again",
      "rating": 5.0,
      "verified": true,
      "author": "A. J. Norton",
      "helpful_votes": 0,
      "publication_date": 20160711
    },
    {
      "title": "Just what I wanted",
      "text": "So exactly what I wanted I bought two and later its baby brother the (refurb) Domino.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Thompson",
      "helpful_votes": 0,
      "publication_date": 20150916
    },
    {
      "title": "Five Stars",
      "text": "Very good radio. It was refurbished and in perfect conditions. Good quality and system",
      "rating": 5.0,
      "verified": true,
      "author": "Client d'Amazon",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "sound quality is excellent considering the units/speakers size",
      "text": "Only had the briefest of plays with it so far but it's already knocked the spots and socks off our old Roberts FM. Lovely build quality, solid and hefty, none of the lightweight cheap plasticky rubbish you get with a lot of gadgets nowadays. Very simple to get straight into the DAB, sound quality is excellent considering the units/speakers size. It's also made our Panasonic AirPlay speaker defunct as it has spottily connect and dnla! Looking forward to having a proper play over the weekend.",
      "rating": 5.0,
      "verified": true,
      "author": "Mr. M. R. Lewis",
      "helpful_votes": 3,
      "publication_date": 20150326
    },
    {
      "title": "Stunning look and even more stunning sound.",
      "text": "Impressive from the start, even the packaging is class. .. The sound is quality of course, but I was more impresses over the settings, how easy it was to set up. I must say this system has everything for everyone in a very compact package. the Internet connectivity, blue tooth and the clarity of Dab, and just to top it up the gorgeous retro look inside a wooden frame.",
      "rating": 5.0,
      "verified": true,
      "author": "prshrt",
      "helpful_votes": 2,
      "publication_date": 20140825
    },
    {
      "title": "Great retro look with modern insides.",
      "text": "This is a great piece of solid feeling kit. The buttons and dial move well and bluetooth connection is very simple. The sound is good for one of these sorts of radios and the sound resonates well in the solid body. The display is bright in all lights. The little joystick is a bit fiddly but works just fine. Once you have set it up you should not have to fiddle too much but if you like browsing the Internet for random radio stations you will struggle with putting text in. If you are like me and you know what you like you can set it it up once and be done with it!",
      "rating": 5.0,
      "verified": true,
      "author": "Alan Table",
      "helpful_votes": 0,
      "publication_date": 20150312
    },
    {
      "title": "The best geeky gadget I ever bought",
      "text": "The best geeky gadget I ever bought, I can listen to international radios on the internet, play music using bluetooth connectivity, play music with spotify, great quality of build, sound. I also love the chunky remote. If I really have to be critic on this, it's hard to tell what the buttons do on the device itself, I don't mind as I always use the remote.",
      "rating": 5.0,
      "verified": true,
      "author": "Antonio Terreno",
      "helpful_votes": 3,
      "publication_date": 20150101
    },
    {
      "title": "revo superconnect ..very good",
      "text": "Very nice radio with all the latest high tech features ( stereo effect very good with my sennheisers .purchased from amozon \"excellent\") make sure you balance the sound to your taste.. Got a bit fed up with purchasing radios (second hand) that never worked properly decided to buy brand new Recommended ...James Devine",
      "rating": 5.0,
      "verified": true,
      "author": "James Devine",
      "helpful_votes": 2,
      "publication_date": 20150309
    },
    {
      "title": "OMG",
      "text": "Oh my god, just played 'fade to black - metallica' through it at vol 20. and it sounds great! Very impressed with the whole 'premium' product. All features work well after testing. Spotify connect, DLNA to NAS, all work good. Happy days! It looks great in an old style lounge but would equally in a modern environment.",
      "rating": 5.0,
      "verified": true,
      "author": "R. TAPHOUSE",
      "helpful_votes": 4,
      "publication_date": 20160327
    },
    {
      "title": "Great Radio",
      "text": "We are really really pleased with this radio. The sound quality is excellent and the functionality of the radio overall is excellent as well. It's one of those rare beautifully designed and manufactured objects.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Crandall",
      "helpful_votes": 0,
      "publication_date": 20150429
    },
    {
      "title": "extremely easy to set up (have had various Logitech and Roku ...",
      "text": "Lovely sound, extremely easy to set up (have had various Logitech and Roku players over the years). What really sets it apart as it's good looks, and sound. The first one that came, the display failed but it was rectified within an hour of dealing with Revo customer services...guy called Stephen who could teach courses on looking after customers. Very happy.",
      "rating": 5.0,
      "verified": true,
      "author": "Kevin Casey",
      "helpful_votes": 0,
      "publication_date": 20141031
    },
    {
      "title": "A true home radio",
      "text": "wonderful radio. the sound is stunning. a real home radio that outperforms anything i have ever used in the home. no flashy gimmicks just a radio to listen to and enjoy.",
      "rating": 5.0,
      "verified": true,
      "author": "Sheila M. Smith",
      "helpful_votes": 0,
      "publication_date": 20150818
    },
    {
      "title": "Fantastic!",
      "text": "I love my new radio. It's is technical state of the art, absolutely. Its works perfect together with my iphone and spotify account. Sound is really warm and full.",
      "rating": 5.0,
      "verified": true,
      "author": "pst63",
      "helpful_votes": 3,
      "publication_date": 20140206
    },
    {
      "title": "The front facing facia/ grille is peeling off !",
      "text": "The \"anodised aluminium and mild-steel facia and speaker grille that compliment its advanced electronics beautifully\" is peeling off ! I would squirt some glue in there but I worry that might affect the \"tactility and sense of honesty that cannot be achieved with lesser materials\" ! Money back plus postage and inconvenience please",
      "rating": 2.0,
      "verified": true,
      "author": "James Wallace",
      "helpful_votes": 4,
      "publication_date": 20170529
    },
    {
      "title": "Great radio!",
      "text": "I have had the superconnect for about 3 months now and I am very happy with it.This was the second unit I have had as I had a problem with the first one. The Bluetooth Connectivity wasn't working but Amazon were very good and sent out a new one straight away. The sound is brilliant and considering that it is just one speaker it's excellent. I love the way you can connect to any device including streaming from your PCs network so you can play all the music from your computer, also you can get so many internet stations. It really is worth the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Suddick",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "All in one radio And much more ..... first class it if you can",
      "text": "This has to be the best radio I’ve ever purchased style design sound quality and ease of use All first-class clad in a solid walnut enclosure But is not just a radio it’s Bluetooth ‘Internet ,music And much more first class Before I have had pure h6, Roberts radio ,and many more",
      "rating": 5.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20171231
    },
    {
      "title": "Software update loses all settings",
      "text": "Great looking radio. For the most part works fine, though wifi pick up is weak compared to other devices, so numerous instances of Spotify and Internet Radio dropping. But the worst part of the Revo Superconnect (and why it only gets 3 stars) is that every time it asks you to update the software - twice so far in one year of ownership - the device completely loses your settings, including all stored stations, time, date etc. Tremendously annoying. So cannot recommend.",
      "rating": 3.0,
      "verified": true,
      "author": "I. Murhy",
      "helpful_votes": 0,
      "publication_date": 20161107
    },
    {
      "title": "Simply astounding sound quality, I bought on the back ...",
      "text": "Simply astounding sound quality, I bought on the back of reviews here, but I'm just blown away that such a compact unit can produce such rich and full sound. It's a lot for a radio but certainly worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Ed Yau",
      "helpful_votes": 0,
      "publication_date": 20140903
    },
    {
      "title": "Perfect for me",
      "text": "I have been using Roberts 83i for many years. Well made equipment, with something still missing: design, spotify and Bluetooth. Revo Superconnect adds them all. Plus a better sound experience. I am pleased with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Paolo",
      "helpful_votes": 2,
      "publication_date": 20160410
    },
    {
      "title": "A Rolls-Royce of a radio",
      "text": "This is a beautifully designed and made radio with superb attention to detail. I had it up and running with 8 internet radio presets within ten minutes and the customer service is superb. A Rolls Royce of radios.",
      "rating": 5.0,
      "verified": true,
      "author": "Graham",
      "helpful_votes": 0,
      "publication_date": 20141108
    },
    {
      "title": "Five Stars",
      "text": "Was a family gift and has been very well received.",
      "rating": 5.0,
      "verified": true,
      "author": "GCT",
      "helpful_votes": 0,
      "publication_date": 20170622
    },
    {
      "title": "Five Stars",
      "text": "This is better than i expected. Awesome sounds from a neat little unit. perfect in every way....",
      "rating": 5.0,
      "verified": true,
      "author": "James Masterton",
      "helpful_votes": 0,
      "publication_date": 20160124
    },
    {
      "title": "Revo Superconnect",
      "text": "The Revo has done almost everything it promises, almost all the time. I have lost the wifi connection twice so that Internet radio became temporarily unavailable, but managed to recover it. Reason for loss not known. Revo technical telephone support has been very good ( they answered the phone on first ring) and guided me on how to reconnect. Sound quality of Revo is very good. This is my second Revo product in our household and I happily recommend the company and its products.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Hjelt",
      "helpful_votes": 2,
      "publication_date": 20140127
    },
    {
      "title": "... expected and has a retro look which you either like or hate - however",
      "text": "A little larger than expected and has a retro look which you either like or hate - however, its an impressive radio and much better than the roberts radios I've had in the past.",
      "rating": 5.0,
      "verified": true,
      "author": "Graham R.",
      "helpful_votes": 2,
      "publication_date": 20150411
    },
    {
      "title": "A superb radio",
      "text": "This is as good as it gets for a table top radio. The sound is superb and a clear display adds to the package. A good range of sources built in including networking.",
      "rating": 5.0,
      "verified": true,
      "author": "TonyMK",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "El Revo SuperConnet es un equipo magnifico, estoy muy ...",
      "text": "El Revo SuperConnet es un equipo magnifico, estoy muy contento con la compra que hice, pero no tanto con el servicio post venta, les hice una consulta y me contestaron sin aclararme lo que les preguntaba. Asimismo les mande a ustedes un correo diciendoles que podia programar la FM dab y FM dab+ y no he recibido ninguna contestación. Entiendo que Amazón tiene esa obligación ya que el equipo se lo compre a ustedes. Atentamente Francesc",
      "rating": 5.0,
      "verified": true,
      "author": "Francesc Bataller",
      "helpful_votes": 0,
      "publication_date": 20141110
    },
    {
      "title": "Screams Quality",
      "text": "I bought the Superconnect because of two faulty radio returns from the Geneva sound world radio.(Amazon were fantastic) the Revo was £20 cheaper and packed with lots more features,all that worked! Firstly, the Revo is a beautiful looking radio, it is very well crafted, built to last and sounds wonderful. All its features have been carefully designed and thought out.Nothing gimicky here. All in all a real quality product. And British to boot! Tom",
      "rating": 5.0,
      "verified": true,
      "author": "Tom",
      "helpful_votes": 5,
      "publication_date": 20140307
    },
    {
      "title": "Beautiful item but multiple problems...",
      "text": "Hi. The radio is beautiful but the first item that arrived had some part of it out of place - a matter of aesthetics mostly but for its price, you need something properly working and looking! we asked for a replacement, the second item sent worked for 10 days, then it's display stopped working for another ten days, then it started working again. We decided to keep this one but it hasn't been a good experience so far....",
      "rating": 3.0,
      "verified": true,
      "author": "Vassiliki Papassouli",
      "helpful_votes": 7,
      "publication_date": 20140308
    },
    {
      "title": "Two Stars",
      "text": "well packed with features but very poor in audio quality.....one speaker only and lack of bass",
      "rating": 2.0,
      "verified": true,
      "author": "Guava",
      "helpful_votes": 3,
      "publication_date": 20150224
    },
    {
      "title": "One Star",
      "text": "The feedback is NEGATIVE, I have already complained via email and I got no response",
      "rating": 1.0,
      "verified": true,
      "author": "Massimo Ferretti",
      "helpful_votes": 7,
      "publication_date": 20140930
    },
    {
      "title": "Don't waste your time",
      "text": "This is a stylishly designed audio device with fairly robust sound. Unfortunately, it doesn't work. Specifically, it cannot (at least in my circumstance) maintain a connection to the internet. The internet radio, and Spotify disconnects frequently, and won't work again unless you unplug and re-plug in the unit. Revo's customer service blames the victim, blames the network and/or internet connection. Well, I have a new expensive router well within range along with a fast internet connection. More to the point, all of my other internet connected devices, my phone, my TV, etc. manage to maintain a connection. The radio can connect alright, it just can't maintain or re-acquire a connection. I'm returning it today.",
      "rating": 2.0,
      "verified": true,
      "author": "william Choi",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Minor issue, but overall happy with the purchase.",
      "text": "Solid built peace. Good sound quality, and pleasing aesthetically. Has countless stations from around the world. I mainly use internet radio stations port. The only drawback, sometimes when turning on, the radio gets hang up while trying to load station. Then have to reset it (by unplugging power cord) to keep it going.",
      "rating": 4.0,
      "verified": true,
      "author": "Saul Miasniot",
      "helpful_votes": 4,
      "publication_date": 20170927
    },
    {
      "title": "great design and function",
      "text": "we experienced this radio in our hotel room in nyc and i had to get one for my husband! love the design and the sound quality suits our needs!",
      "rating": 5.0,
      "verified": true,
      "author": "lara",
      "helpful_votes": 0,
      "publication_date": 20200114
    },
    {
      "title": "Looks good, sounds great",
      "text": "Looks good, sounds great ... wonky interface, cheap-feeling buttons, and unreliable Spotify and bluetooth connectivity. Kept having to \"factory reset\" the unit to get it back to normal. If the technology and OS were as good as the sound, this would be a winner. Unfortunately, it's not.",
      "rating": 2.0,
      "verified": true,
      "author": "Joe Smith",
      "helpful_votes": 0,
      "publication_date": 20170422
    },
    {
      "title": "Great but no AirPlay.",
      "text": "Great sound! Wish it had air play and would read Apple lossless music files. Otherwise perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Cheresh",
      "helpful_votes": 5,
      "publication_date": 20150111
    },
    {
      "title": "The best a radio can be",
      "text": "It's everything and more that you'd expect from a radio of this size. Stunning to look at with a solid full-bodied output. Infact, there isn't a single fault that I can find with any part of this product be it the software, the bluetooth linking, the material quality. However, if you're really into music and appreciate great sound, this by no means can replace a proper system. It is very very far removed from an amp-speaker setup. It works great for the bedroom, kitchen or a smallish living room.",
      "rating": 5.0,
      "verified": false,
      "author": "CARL DSOUZA",
      "helpful_votes": 6,
      "publication_date": 20141117
    }
  ],
  "product_meta": {
    "title": "Revo SuperConnect Multi Format Deluxe Table Radio",
    "description": "SuperConnect is the ultimate expression of REVO's design and engineering philosophy, and the culmination of everything we have learnt in 10 years of award-winning product design and development. Functionalism meets craft and technology, a next-generation audio device that beats at the heart of your musical ecosystem, providing whatever soundtrack you need. Radio from around the globe, access to your personal music collection or an almost limitless supply of songs from the world's leading music streaming service.SuperConnect is equipped to receive a wide range of digital radio standards including DAB, DAB+, FM with RDS and internet radio - providing access to over 16,000 stations from around the world. But the music doesn't stop there - SuperConnect's ability to communicate with external devices and services is unrivalled. DLNA and WLAN technology enables wireless audio playback from external computers and music servers, Bluetooth with aptX delivers CD quality streaming from smartphones, tablets etc., and Spotify Connect completes the proposition by unlocking over 20 million tracks from the Spotify archive. SuperConnect is crafted using the finest materials and components, its all-wood American Walnut cabinet with anodised aluminium and mild-steel facia and backplate complement its advanced electronics beautifully. A detailed graphical OLED display and joystick control add a touch of modernity, while patented audio electronics and driver technology deliver 15W of clear digital audio with clarity and deep, rich bass.",
    "rating": 3.9,
    "feature_bullets": [
      "DAB, DAB+ and FM Tuner with RDS",
      "Wi-Fi internet radio",
      "Bluetooth wireless streaming with aptX technology",
      "Spotify Connect Enabled for access to 20 million tracks",
      "Digital alarm clock functionality with sleep and snooze"
    ],
    "specifications": {
      "Product Dimensions": "10.63 x 4.72 x 7.09 inches",
      "Item Weight": "6.27 pounds",
      "Manufacturer": "REVO Technologies",
      "ASIN": "B00GA0805G",
      "Item model number": "Revo SuperConnect - Walnut",
      "Batteries": "2 AAA batteries required.",
      "Customer Reviews": "3.9 out of 5 stars131 ratings3.9 out of 5 stars",
      "Best Sellers Rank": "#231,961 in Electronics",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "February 11, 2014"
    },
    "categories": [
      "Home Audio",
      "Electronics",
      "Compact Radios & Stereos"
    ],
    "price": ""
  }
}