{
  "website_summaries": [
    {
      "verdict": "While its lifespan is just average, this mouse’s programmable settings and smooth ergonomics make it an essential gaming accessory.",
      "pros": [
        "Best button setup of any gaming mouse on the market",
        "Easy to program settings and buttons",
        "Controls can be quickly remapped to user preference",
        "Software easy to use",
        "Ergonomic shape fits hand well, and textured surface ensures grip"
      ],
      "cons": [
        "Left and right clicking and scroll wheel are tight and take effort to press and scroll rapidly",
        "Lasts only a year or two for most gamers",
        "Bulkier than other gaming mice",
        "Compatible with Windows only"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Good enough but 5 star service",
      "text": "Not as comfortable as the M601 it replaces. Smaller hands will find this bulky. Larger hands will find the sixteen side buttons awkward to access especially #7-#12. My package did not have useful printed instructions or software. The \"middle\" version of downloaded driver worked for me. As reported by others, running the setup program in administrator mode enabled the adjustments to be set. So far, I haven't been able to get the acceleration to work. EDIT: Seller immediately responded with url to new driver. Unfortunately, it did not fix my lack of acceleration. The seller then offered a refund and sent a postage paid label. I've gone back to the model 601 and will continue to patronize this company.",
      "rating": 3.0,
      "verified": true,
      "author": "Matsuoka",
      "helpful_votes": 0,
      "publication_date": 20190901
    },
    {
      "title": "Is not programable",
      "text": "Does not accept programming, works fine if you use the default settings. The user manual is useless unless you're interested in the names of the 19 buttons in many different languages. The software has to be downloaded from their site which isn't a problem but the mouse simply does not accept the programming, the software does but it doesn't get applied to the mouse. Either I have a defective unit or the other reviews on this are crap. It would be nice to have a better priced product then Logitech or Razer but this is a cheap look alike that doesn't work as described.",
      "rating": 1.0,
      "verified": true,
      "author": "Lane E.",
      "helpful_votes": 2,
      "publication_date": 20180828
    },
    {
      "title": "Feels cheap, left and right button died during setup",
      "text": "It comes in a nice package. Mouse itself feels cheap. I could not open the weight door (really really stuck and won't turn) and the weight carrier was empty. Not sure if there were any weights in the package or not. The usb plug feels insecure when plugging into port. During setup the left and right mouse buttons stopped working. There were other glitches as well that made me think there were other things wrong with this mouse. I am returning this item. I had the mouse for only a few hours. I used it for about 10 minutes. If this is representative of RedDragon products then I won't be getting them again.",
      "rating": 1.0,
      "verified": true,
      "author": "SM Carney",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Best \"MMO\" Mouse for the Price Range",
      "text": "Pros: +I got this mouse for $29.99 compared to my old Corsair Scimitar which was $49.99($74.99 MSRP IIRC) +RGB if you're into that thing +Settings are saved in the mouse itself which is useful if you want to use the mouse in a different computer/OS. +Pretty rugged considering I have this mouse for over a year now and it still works like brand new and it far outlived the Scimitar. +Extra button next to left click. I prefer to use it as mouse3 instead of the mouse wheel button. +Removable weights at the bottom. CONS: -The side buttons doesn't sit well with my thumb -Compared to Scimitar, the side button cluster doesn't move.",
      "rating": 5.0,
      "verified": true,
      "author": "AttilaTheHunk",
      "helpful_votes": 0,
      "publication_date": 20190706
    },
    {
      "title": "May have a cheap price but also keep in mind the quality",
      "text": "When I first saw such a cheap mouse looking good I was excited, but a few months after purchasing it malfunctions. It \"unplugs\" for 3-4 seconds without you even touching the cable. This might not sound like a big deal, but this is a gaming mouse. If you are going in and suddenly your mouse stops working while someone quickly kills you, that is a big deal. And it keeps happenings, once every minute (sometimes less, sometimes more). I would not recommend this mouse as you can get mice like the logtech g602, or g600 for slightly more expensive but they last for over a year. Quality is not worth the price.",
      "rating": 2.0,
      "verified": true,
      "author": "Shop2shop",
      "helpful_votes": 0,
      "publication_date": 20200515
    },
    {
      "title": "SOFTWARE REQUIRES PC RESTART",
      "text": "IMPORTANT IF YOU PLAN ON BUYING ONE The software for it requires you to restart you pc before it will actually bind any non default keys to the side. It gives no prompt to restart, if you dont see a loading bar after you apply new settings then it means you have to restart first. I was driving myself crazy trying to figure this out at first.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 2,
      "publication_date": 20190916
    },
    {
      "title": "THIS VS RAZER NAGA EPIC",
      "text": "The \"feel\" of it seems lightly of a lesser caliber then the solid Razer NAGA Epic.................... BUT, the overall features of the mouse and customize abilities through the software [downloaded] is AWESOME. You can pay this and still get the same usage as a Razer. I am happy, BUT... the different positioning of the side buttons will rrrrrrrrrreally need some getting use to. the Razer Naga is flush and feels more natural. The different placement of the buttons on the Perdition is probably so you dont miss press the wrong button. OVERALL: GRRRRRRRRRRREAT Price - Nice feel - AWESOME SOFTWARE [Razer is buggy]",
      "rating": 4.0,
      "verified": true,
      "author": "icu2 PRODUCTIONS",
      "helpful_votes": 2,
      "publication_date": 20170802
    },
    {
      "title": "An excellent MMO gaming Mouse.  Not perfect, but very good and inexpensive!",
      "text": "I really like this mouse. It's size is comfortable and the buttons on the side are angled in two sets angled towards each other, which makes them easy to find and press. The index finger, is good for working the long button on top which could be a trigger button, but I use it to swap skill sets in Elder Scroll Online. The programming is pretty straight forward. I need to change the mouse program from the default, when I am playing a game or working with a spreadsheet, etc. by pushing the program button on the bottom. I need to remember to do that, lol. I am happy with it.",
      "rating": 4.0,
      "verified": true,
      "author": "RSpirit22",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Over 3 years and still the best mouse I've ever owned",
      "text": "Originally came from the many buttoned Razer mouse which broke after about 1.5 years. Then I tried this as it was cheaper but very similar (many buttoned) and damn, this mouse blew me away. I use mine extensively everyday for hours and it hasn't faltered in even the slightest, same as new. Precision, number of buttons, ease of use. It's just the best 3+ years later and going strong. I'm here looking through Redragon products looking to see if there's a bluetooth version of this mouse but thought might as well leave a review while I found this old goodie is still in production.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Delgado",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "Nifty looking mouse BAD BAD software",
      "text": "Got this mouse and was so excited but then I had to download the software.... I wanted to change the buttons and set them up for World of Warcraft ARK and other games but sadly I could not. It would only use the \"default\" settings and they did not do much of anything. FINALLY I went and looked at other complaints and saw that I was not the only one with this problem. So reddragon work on that software and you will be a awesome company! I will be returning this mouse and not get another one made by this company. Hopefully in the future they fix their software problems",
      "rating": 2.0,
      "verified": true,
      "author": "Stevie Burdett",
      "helpful_votes": 0,
      "publication_date": 20190113
    },
    {
      "title": "Programming software does not work",
      "text": "Bought this mouse to replace a similar Logitech Gaming Mouse. While the quality of it is great to the feel, and it works fine as an ordinary mouse, when I went to Red Dragon's website and downloaded and installed the software to program the mouse, (the install worked fine, the software runs fine), the mouse did not respond to any of the programming changes I made in the software at all. Not the color, not the side buttons, nothing. Logitech's software was almost identical except for one difference - it actually worked to program their mouse. Costs a few bucks more. It's worth it.",
      "rating": 1.0,
      "verified": true,
      "author": "T. Allen",
      "helpful_votes": 0,
      "publication_date": 20190315
    },
    {
      "title": "Great mouse for the price",
      "text": "This is my third Redragon brand mouse. I now have two M901 (this review) and an M908. For half the price of the cheapest multi button mmo mouse these are excellent mice. If you are a palm grip it is dang comfortable. Programming the buttons is fairly easy with the software the you need to download. The only down side I have had is the dedicated 'Fire/Snipe' button failed mainly because I use it so much. But even though my first M901 failed after a bit over two years, it is inexpensive enough to just buy another one. I recommend this mouse for people who want a lot of buttons (mmo' are great). It is a great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Cheezenub",
      "helpful_votes": 0,
      "publication_date": 20190904
    },
    {
      "title": "Great alternative to Naga",
      "text": "I play World of Warcraft (For the Horde!) and had been using the Naga for years. I had constantly had issues with it glitching out after about a year of use. I bought this, because i figured if I was going to have to replace my mouse every year, I at least wouldn't have to pay an arm and a leg for it. This mouse has been fabulous. The side keys are a little different than Naga and take some getting used to, but this baby has been phenomenal. I got one for my husband and son, who also play. Quality mouse and a great buy!",
      "rating": 5.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 0,
      "publication_date": 20200728
    },
    {
      "title": "One bad part ruins an otherwise great product",
      "text": "This is my second Redragon gaming mouse. I bought it to replace my M805 Hydra when the Hydra's scroll wheel quit working after about eight months. I've been using this M901 for about nine months now, and the scroll wheel, which worked perfectly when it was new, now sometimes feels loose, and sometimes makes a grinding noise. That's two different models from the same manufacturer that failed in the same way after less than a year. I don't abuse my hardware. This is a quality issue. If the manufacturer fixed that one issue, I think they'd have the best overall value gaming mouses on the market.",
      "rating": 2.0,
      "verified": true,
      "author": "M. Russell",
      "helpful_votes": 0,
      "publication_date": 20190131
    },
    {
      "title": "Amazing gaming mouse if you don't want total customization",
      "text": "I play fps games and this mouse gets the job done. Pros: -Comes with software for customizing button operations -Feels weighty, thumb buttons easy to use Cons: -Software won't let you map buttons that you can't push on your keyboard. My keyboard doesn't have a number pad so I had to use a virtual keyboard to map those to the mouse. - Windows button can't be used as a macro so having a dedicated Win+PrtScr button wasn't an option. ie: no easy way to take screenshots",
      "rating": 5.0,
      "verified": true,
      "author": "Andrew Huff",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "Well worth it for the price",
      "text": "When I started playing FFXIV (mmo) I realized a gaming mouse may help me. However, since I'd never used one before I didn't want to purchase the $50+ ones just yet. I found this with decent reviews and decided to give it a try. I'm on my second one now, but the original lasted about a year and a half with HEAVY usage. It was seeing atleast 1 hour of use a day, often 8+ on the weekend days. At this point, I plan to just keep repurchasing this mouse because I have been extremely happy with it. I do find it hard to reach the 10, 11, and 12 buttons, but using 1-9 pretty much satisfies my need anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180919
    },
    {
      "title": "Excellent mouse",
      "text": "I bought this mouse for light gaming, mostly RPGs and some RTS where the extra macro buttons really come in handy. The settings are nice and simple, and it's nice to be able to switch them on the fly when I take a break from gaming and do some work-from-home. Ergonomically, it feels great in my hand and I really have nothing negative to say about the mouse. I will update this review if things change in the future over the next several months of daily use.",
      "rating": 5.0,
      "verified": true,
      "author": "E-money",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Redragon Impressed Me!",
      "text": "I used Razor Naga mouses for years but they always seem to fail around year two. I decided to go with this one because I already owned a Red Dragon Keyboard and was super impressed. I could not have made a better decision with this mouse. From now own I will only buy Redragon! This mouse is great, it has about the same weight and thickness of a Razor Naga. It also comes with weights so you can adjust it to your preference. You can change lightning schemes and DPI or rebind keys.",
      "rating": 5.0,
      "verified": true,
      "author": "DM Reviews",
      "helpful_votes": 0,
      "publication_date": 20200626
    },
    {
      "title": "Side Buttons Don't Work. Useless for a MMORPG.",
      "text": "While the mouse feels okay and looks nice, it's absolutely worthless as a mouse for games like FFXIV. I tried to program the side buttons to a combo keybind of shift + X. At first they just registered as the straight numbers. Finally after reading a bunch of forums and such (Evidently this is a MAJOR issue with this mouse), I was able to get the buttons programmed in. Unfortunately, they would only read the correct input about 1/3 of the time. The rest of the time the input would revert back to the original number. I wish I would have read the negative reviews more and saved myself the time.",
      "rating": 1.0,
      "verified": true,
      "author": "Hufflepuffle",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "It looks and feels like a pretty good gaming mouse",
      "text": "Overall, worth the price and really well done. It looks and feels like a pretty good gaming mouse. The cord is plently long and durable. Responsive buttons and the on the fly DPI switch is really nice. The software that comes with it is really lets you customize it well, although I was content with the way it came.The side buttons are nicely laid out but take a little getting used to. The only real drawback I found with it was the weight. Even with all of the weights in there, it still seemed sooooo light. Its tolerable and still an excellent mouse, just lighter than I would have liked.",
      "rating": 4.0,
      "verified": true,
      "author": "JoeH",
      "helpful_votes": 0,
      "publication_date": 20170626
    },
    {
      "title": "Macro Excecution Is Buggy",
      "text": "This mouse is above average in most aspects, except its software, which is average in terms of rebinding (it's functional). It does have one problem that prevents its use as a gaming mouse over Logitech alternatives. The software for macro creation overwrites all other user input (from the mouse) during the duration. If left click were to be held while a button was being pressed by a macro, left-click would stop being registered during macro behavior but then will be registered again, having left-click pressed again. This prevents its use as a gaming mouse with macro functionality handily. Decent hardware; godawful software.",
      "rating": 2.0,
      "verified": true,
      "author": "Alan J.",
      "helpful_votes": 0,
      "publication_date": 20190828
    },
    {
      "title": "Broken left click",
      "text": "Bought this In October, it's now May and since April the left clicker has had the same issue many mouses have and the clicks are not working correctly. Sometimes it registers as a quick double click, sometimes it drops the hold. Definitely a mechanical failure and it was such a nice mouse before that but it should have lasted a lot longer than just 6-7 months and I thought Redragons mouses were known for having better clicker lifespans.",
      "rating": 2.0,
      "verified": true,
      "author": "John Eung Soo Kim",
      "helpful_votes": 0,
      "publication_date": 20200511
    },
    {
      "title": "Do not buy this mouse for gaming",
      "text": "I had a naga before that I had to replace... I bought the red dragon thinking that I would save a little money and the reviews looked good. I had to reset the setting constantly... the movement would sometimes stick. If you are a serious gamer this is not the mouse for you unless you are ok dying standing in fire and unable to move out of it, if you are a casual it might work. I am throwing this one away and have replaced with the Naga Trinity.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebecca",
      "helpful_votes": 0,
      "publication_date": 20200203
    },
    {
      "title": "Great for me.",
      "text": "I like it a lot. I don’t use it to play games. I just need extra buttons for when I’m working on a spreadsheet or looking at multiple windows. Wish the manual was a bit more helpful on explaining its function. I have big hands so this was super welcoming. My boss was impressed with it and said he’d like one too. Don’t know how much it can handle long term and extended use. But for now, I love it. 10 out of 10.",
      "rating": 5.0,
      "verified": true,
      "author": "Jimmy Heng",
      "helpful_votes": 0,
      "publication_date": 20191212
    },
    {
      "title": "Mapping software doesn't work",
      "text": "The mapping software for this mouse doesn't work so unless you are okay with the buttons on the side being permanently mapped to 1, 2, 3, 4 etc... it's useless. When you try to apply changes in the software, you will get an error message asking to please install mouse before \"apply\" changes. Yes that's how it's spelled... There are some posted solutions at redit etc but none worked for me or most of the others looking for answers online.",
      "rating": 1.0,
      "verified": true,
      "author": "bytaur",
      "helpful_votes": 0,
      "publication_date": 20190727
    },
    {
      "title": "Scratches on replacement pads",
      "text": "I don't think my mouse was new. It had scratches on it like someone had opened it already. Then when I looked at the set of replacement pads, they both had huge scratches in them as well. Disappointed because this was before I even connected the product. This is my second Reddragon product and I had been really excited about it. I also looked at the instruction manual. It had massive grammatical issues. Doesn't affect the product, just disappointing.",
      "rating": 2.0,
      "verified": true,
      "author": "PSW",
      "helpful_votes": 0,
      "publication_date": 20200717
    },
    {
      "title": "5 years of happiness.",
      "text": "I got one for myself and my brother. I've used it, traveled with it, and played a good amount of games with it. It's a very good price for this mouse, and those that complain about cheapness either got an unlucky draw or want something that's significantly more expensive, but don't want to pay for it. The weights are great and I never changed it once I found my sweet spot. Alas, 5 years later, the USB plug went funny. Probably all the flexing it's had to do. Time to reorder!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "No real RGB",
      "text": "the only rgb on this mouse is the mouse wheel. nothing special about it.. most reviews with 5 stars are due to the seller offering a discount or free item with a 5 star... not impressed with this mouse at all.. even when changing the colors for the breathing on the program nothing changes.. the dragon stays red the 12 keys stay red... the only RGB is the wheel and it changes based on the DPI selected Very disappointing",
      "rating": 1.0,
      "verified": true,
      "author": "Vinnie Gunns",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Solid little mouse",
      "text": "I unboxed this hunk of a mouse. 1. The casing was clever. 2. It's a heavy little thing! feels great in my giant mits for hands.. 3. Plug-in was a breeze. Didn't even think. BLAM! on, working.. slides great. 4. The buttons probably could be spaced just a tad.. but I have sausage fingers! the curving fit the thumb rather well! Awesome mouse. I will update this over time of any malfunctions. 🤣",
      "rating": 5.0,
      "verified": true,
      "author": "brad brady",
      "helpful_votes": 0,
      "publication_date": 20181016
    },
    {
      "title": "Mouse is great, software eh..",
      "text": "I thought it would be cheap plastic, I was pleasantly surprised to see it isn't. Only the things in red are plastic, but the grip itself feels very, very nice! The mouse is very similar to the Corsair scimitar. The software is kinda clunky but it's straightforward. If you're having issues with it, run the software as administrator. Not super good for people with baby hands like me, but it's not bad in a claw grip. If you're looking for a budget mouse, I'd recommend this one.",
      "rating": 4.0,
      "verified": true,
      "author": "Aky",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Was great until it quit working out of the blue...",
      "text": "Was great until it quit working out of the blue... I had the previous version of this and still no problems. Figured I'd buy this one and use my old one on my laptop. Sadly this one just quit responding yesterday... just blinks some lights but won't work anymore. I'm out of the 30 day return window but I'll change my review if they send me a new working version. Guess it's back to the old one until then.",
      "rating": 1.0,
      "verified": true,
      "author": "Jason H",
      "helpful_votes": 0,
      "publication_date": 20190806
    },
    {
      "title": "Great mouse with many features",
      "text": "I am impressed by the quality of this gaming mouse.I do not game on my (kind of old) laptop,but I bought this mouse to make it easier to navigate my computer by mapping shortcuts to the keypad.Much easier to use than the native touchpad and surprisingly ergonomic,I like that you can adjust the DPI on the fly,though I don't really use it.I really like the mouse,and it has a lot of great features,like the adjustable weight settings.Only complaints are that it is kind of difficult to use without a mouse pad due to the Teflon feet and it isn't \"professional\" enough to use in an office setting,but these minor problems don't detract from extreme quality of the mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Actually really good! Much better then expected",
      "text": "Great mouse for MMOs. Looks amazing feels of high quality. I was very surprised especially for the price this is probably the best budget mouse I've felt. I put this up against the razer Naga (2014) and I'm not going to lie in done cases I preferred this mouse. The only complaints I have is that's it's a little too smooth. The paint finish on this mouse looks really good but when you play with it it's a little slick. Second is that the 12 programmable buttons on the side don't feel as great as the razer Nega but this was to be expected. Overall great mouse for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Jim Hacksmith",
      "helpful_votes": 0,
      "publication_date": 20200122
    },
    {
      "title": "High quality gaming mouse with adjustable weights!!!!",
      "text": "After reading many positive reviews I decided to purchase this mouse and I haven't regretted it. Pros: Buttons, buttons and more buttons. So many options!!!! Love the appearance and lights. The multi-colored braided cord makes it stand out from other corded mice that I've had in the past and I hope it ensures extra durability. Adjustable weights! Fairly ergonomic, though I wish there was a space for my pinky finger. Cons: Even though I didn't like the rough texture of the mouse at first, I hoped I would end up adjusting to it. 13 days later and I still like it at all.",
      "rating": 4.0,
      "verified": true,
      "author": "A. Morris",
      "helpful_votes": 3,
      "publication_date": 20160915
    },
    {
      "title": "Easily Compete's With The Naga",
      "text": "Works wonderfully, does everything the Naga from Razor does with the same quality and half the price. Even has easily removable tuner weights, which the Naga does not have. Also love how the side buttons are tilted to allow for easier recognition as to where your fingers are located on the button grid. And the nice grippy surface is a nice touch, if a bit strange for some reason. EDIT: A few months later and it is still working just fine, not a single problem and I use it daily for gaming. Still cheaper than the Naga, sale makes it half the price. So very worth it, buy it because you wont be disappointed.",
      "rating": 5.0,
      "verified": true,
      "author": "Dosypoo",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Still going strong...",
      "text": "Love this mouse. Had is over a year and zero issues at all. Fast and responsive - weight can be adjusted - huge DPI range. Software drivers are the only lacking thing. Would love some updated ones that work. If you lose you disc you are SOL trying to find matching drivers. Other than that I love it. Colors - feel - buttons....all work great for my personal tastes.",
      "rating": 5.0,
      "verified": true,
      "author": "TheHunterGT",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "This probably would have been a fine mouse otherwise",
      "text": "I can't honestly give this product more than 3 stars, because I ended up giving this away unused, but I'm not sure it was this product's fault. I wanted to try a mouse with more buttons for gaming, but I found that 12 thumb buttons just didn't work very well for me. This probably would have been a fine mouse otherwise, and I suspect I wouldn't like any other products with 12 buttons on the side (e.g. Razer Naga). I ended up just going with a Razer Deathadder.",
      "rating": 3.0,
      "verified": true,
      "author": "ZenithStorm",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "So far so good. I might be converted from Corsair / Razor / etc.",
      "text": "I've gone through several corsair / razor mice, picked this up on a whim. I think I'm in love. Software is typically absolute trash with gaming peripherals, and I have to say, it's not bad. The default configuration is also perfect if you just don't want do deal with any software. Probably going to buy a second one for the price. If it lasts longer than two years without having left/middle click start to wear out, I think I found a winner. Otherwise, it wasn't a fortune spent and lost. $30 is how much it should cost for a decent MMO mouse. Cheers.",
      "rating": 5.0,
      "verified": true,
      "author": "Edward",
      "helpful_votes": 0,
      "publication_date": 20190819
    },
    {
      "title": "Value for price",
      "text": "What you get for the price is great in value. The buttons are programmable though I initially had issues trying to get the programming functions to actually work. I believe I had to run the desktop application as administrator and it fixed the issues. Been a few months now and it's been working fine though I haven't done alot of gaming recently. Would definitely recommend at this price point.",
      "rating": 4.0,
      "verified": true,
      "author": "James E. Brewer",
      "helpful_votes": 0,
      "publication_date": 20190524
    },
    {
      "title": "Amazing mouse. Easily bind and customize all of the ...",
      "text": "Amazing mouse. Easily bind and customize all of the buttons and colors with the easy tonuse software. The only negative so far is the glossy finish of the mouse sometimes makes it difficult to pick up and move the mouse in game, especially when the weights are installed. I've noticed a few reviews saying that the weights weren't even included with other buyers mice, but as it turns out the weights are preinstalled so you have to remove them and put them in the included holding case if you don't like the weight.",
      "rating": 4.0,
      "verified": true,
      "author": "moose92",
      "helpful_votes": 0,
      "publication_date": 20180502
    },
    {
      "title": "Decent for casuals. Mouse wheel is like sandpaper. Better options at this price point.",
      "text": "This mouse is huge. Not ideal for precision gaming. The mouse wheel was horrific. It felt as if it was rubbing against something upon scrolling a full revolution. Compared side by side with a Logitech Mouse the DPI felt off. I set both mice to the same DPI within their proprietary programs and the Logitech mouse was much smoother and more precise. I would give the mouse 3 stars, as it's a decent mouse for casual stuff, but the mouse wheel was the killing blow.",
      "rating": 1.0,
      "verified": true,
      "author": "NJLEO",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "Was told by buddy optical was better. I dont see ANY issues with this laser mouse.",
      "text": "This mouse is close enough to perfect for me ill go ahead and call it perfect. Fits my hand very well. I like the side finger nest helps give me more control. I do think the LMB and RMB are a little too sensitive they hanrdly take ANY pressure to click. So im accidentally hitting them every now and then. And i also dont use any of the back 6 buttons on the side. I only use the front 6, and im kinda doubting they would be easy to reach. Then again ive never tried. Maybe they are. Bottom line HIGHLY reccomend for the price.",
      "rating": 5.0,
      "verified": true,
      "author": "JohnnyRottenAppleSeed",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Nice Mouse",
      "text": "The main reason I purchased it was that it's the companion to the keyboard I already had but it's actually a pretty good standalone purchase candidate also. I'd prefer that the thumb rest area be set out from the side of the mouse a little further as I don't seem to be able to keep from hitting the buttons by accident but that's probably just me. All in all, a good buy.",
      "rating": 4.0,
      "verified": true,
      "author": "Tom Bales",
      "helpful_votes": 0,
      "publication_date": 20190816
    },
    {
      "title": "seems ok",
      "text": "for a redragon product why are you programs unknown publishers? and why is it you don't print the download link in the instruction pamphlet? really the only down side of this mouse so far is that the wheel scroll lighting is the only light that you can't change the color. it is solid green and can't be changed to another color or changed to another pattern.",
      "rating": 4.0,
      "verified": true,
      "author": "walt",
      "helpful_votes": 0,
      "publication_date": 20201015
    },
    {
      "title": "Buy it without hesitation.",
      "text": "I'll never buy a Razer Naga again. This mouse is even better and at half the price. The software is a bit clunky, but full of functionality. Anytime someone tells me they need a mouse, I link them to this one. You will not regret your purchase. Update after 2 years of ownership: The mouse is still awesome and functioning flawlessly. The software is still amazing, despite very very very slightly clunky. It's really not bad at all. I'd still recommend this mouse and I'll be buying a second one as a backup, just in case. I love the hand-feel of this mouse, great texture and design!",
      "rating": 5.0,
      "verified": true,
      "author": "97344986612708",
      "helpful_votes": 0,
      "publication_date": 20170312
    },
    {
      "title": "Great mouse! Especially for the price.",
      "text": "This mouse works very well, I actually \"upgraded\" to this from a razer naga hex. The build quality is surprisingly very good it feels solid in my hand and the weight is adjustable, however it's worth noting that the buttons on the side of the mouse do not have any real \"click\" and as a result don't feel at all responsive. I did however like the included software as it seems very powerful in what can be adjusted without feeling like bloatware. Overall I would most definitely recommend this mouse to anyone looking for a mouse with many buttons, but i cannot give it five stars as the unresponsive feel of the side buttons is initially off-putting.",
      "rating": 4.0,
      "verified": true,
      "author": "Melinda Lote",
      "helpful_votes": 0,
      "publication_date": 20171004
    },
    {
      "title": "Just get one, you won't turn back.",
      "text": "I play WOW and this mouse is made for it. The extra button on the mouse left click can be setup to tab target and it just works. The thing weighs about right and I've replaced my $110 mouse with it and never turned back. Very comfortable, very easy to setup though some of the others are a bit easier. It just works, does what it's supposed to. It has weights in the bottom, but I've left them all in because it feels right. Resolution goes WAY up there, so if you get it, make sure you don't have that set wrong. I'll be buying 2 spares because the price and performance are top notch.",
      "rating": 5.0,
      "verified": true,
      "author": "BlazeTaylor",
      "helpful_votes": 0,
      "publication_date": 20170802
    },
    {
      "title": "Loved it the first time, love it the second",
      "text": "Bought it to replace the same one I bought three years ago since I had such good luck with this and the m601 centrophorus. Zero regrets, the left click failed and I was unable to fix it but that was three years in with LOTS of hours of heavy use in many online games. It fits my hand better than the Corsair scimitar and has enough buttons for any binds I want.",
      "rating": 5.0,
      "verified": true,
      "author": "S",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "Excelent bang for your buck",
      "text": "When playing MMO's at the competitive level, macros and quick actions can me the difference between a successful raid and wipes. For it's price point, very versatile and programmable. It will even save multiple sets of keybinds, so if you play different classes, you can switch with ease. My only downside is that after coming out of sleep mode or during a fresh reboot, your mouse won't move until the software loads (not long), so that might be a touch off putting. For the price though, this would be hard to beat.",
      "rating": 5.0,
      "verified": true,
      "author": "Robert Roy",
      "helpful_votes": 0,
      "publication_date": 20191127
    },
    {
      "title": "The side buttons are comfortable and I don't find myself ever hitting the wrong ...",
      "text": "This is a well made mouse that I haven't had any problems with. I recently used an older mouse when I was on vacation and noticed that I really missed the ring finger rest that this mouse has, little things I guess. The side buttons are comfortable and I don't find myself ever hitting the wrong button. The only knock I would give this is that the colored light on it are tied to the DPI settings and you'll probably want to make a separate user profile for basic web browsing so you can have a Forward and Back button. I've found myself exclusively using this mouse over my Corsair m65 for all games.",
      "rating": 5.0,
      "verified": true,
      "author": "Rob",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "I really like this mouse.",
      "text": "First off I bought this mouse to play The Elder Scrolls Online. It works perfect. Adjustable DPI and polling rate make it super versatile. Very comfortable even for small hands like mine. Slightly rough texture makes it not get sweaty like the smoother type plastic mice as well as making it nice and secure in your hand. Worth every penny.",
      "rating": 5.0,
      "verified": true,
      "author": "Karl G.Top Contributor: Coloring",
      "helpful_votes": 0,
      "publication_date": 20200219
    },
    {
      "title": "Not for PC games",
      "text": "Ive been playing for years with the razer naga and I thought I could replace it with this mouse. It looks pretty and its very colorful but when I use it during gameplay it would randomly spin out and make game-play frustrating enough to just avoid. SO, I just spent the extra 40 and got another naga. Theres also no option for a return even though I got it a couple of weeks ago. Unfortunate.",
      "rating": 3.0,
      "verified": true,
      "author": "K. Espinosa",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "Excellent mouse for Windows gaming and work",
      "text": "This mouse is wonderful, unfortunately there are only drivers for Windows, so I have to return it and purchase something else. It's a pity, because the mouse feels great, and the product is high quality even down to a tiny little case for the weights. I have owned razer nagas before, and this mouse was just as good, with the exception of the lack of mac drivers. Excellent value.",
      "rating": 5.0,
      "verified": true,
      "author": "Brandon Green",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "No software and website does not let you download",
      "text": "The mouse works and although a bit awkward coming from a razor naga. This mouse does not come with a software disc and I’ve spend 3 hours trying to download it from the website to no avail. It does work plug and play but if you need to alter the buttons or modify anything, this is not the mouse for you. Research the software and download the confit before you buy it. All over the forums almost everyone has this issue. Spend a little more and get a razor",
      "rating": 2.0,
      "verified": true,
      "author": "S & T",
      "helpful_votes": 0,
      "publication_date": 20190905
    },
    {
      "title": "Excellent Mouse!",
      "text": "My first gaming mouse was a Razor and it was dead in under a year. I replaced the Razor with a Redragon Perdition and never looked back. I used my first Redragon for over five years and I had no second thoughts in purchasing another. This mouse has multiple programmable side buttons that are easy to reach, is comfortable to hold especially during long gaming sessions, is better priced and certainly lasts MUCH longer than that other brand! Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "SunnySiesta",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Don’t buy",
      "text": "The product started to malfunction after 5 months. After 8 months it doesn’t work at all. The seller leaves no way to contact customer service. When I attempted to contact the manufacturer who offers a two year warranty, they said they don’t support Amazon sales since this isn’t an authorized selling platform. So I have exceeded Amazon’s 30 day return policy and the real company won’t recognize this purchase. So? Where does that leave me? Broken product without any means to resolve the issue.",
      "rating": 1.0,
      "verified": true,
      "author": "Cynthia Holt",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "Beats the 2014 mmo naga by leaps and bounds.",
      "text": "This mouse is a great buy if you like the naga mmo version. I think razor has dropped off over the years after my last 2 2014 mmo nagas messing up in less than 6 months so I figure try redragon brand. This was a wise choice for me as this fits my hand better the side key pad works out better than the naga the tracking/dpi is leaps above the naga and to top it off the finish is just wow. I would recommend this mouse to any mmo player or someone that's tired of the big boys charging way to much for a cheaper build than the redragon.",
      "rating": 5.0,
      "verified": true,
      "author": "Dennis R.",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Works for Me, Cheaper than Big Brands",
      "text": "Quite a bit cheaper than big name brands like the logitech I owned previously, but functions just as well for every day use. I'm not a hardcore gamer, but if you are, you would probably need to go up multiple price brackets to get a better mouse. All buttons work. The mouse software isn't better or worse than the logitech series. All thumb buttons are easy to find thanks to how the buttons are angled. If you've never had thumb buttons before, I HIGHLY recommend a mouse like this... thumb buttons are like second monitors, once you've had a taste there is no going back.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald Duck",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Great for girl gamers",
      "text": "I used to own multiple Razer mouses (including Naga, Chroma Naga, Molten Naga, and Abyssus) and, as a petite female gamer with tiny hands, the main issue for me with Razer was that the mice are two damn big. It became uncomfortable and actually affected my gaming experience. When buying a mouse, I was carefully looking at the measurements of the mouse because I wanted something smaller than my Naga but also had the buttons of the Naga. I bought this and it is the most comfortable and perfect sized mouse for a gamer with tiny, skinny hands. I've used it for half a year already and have no issues. Highly recommend for the girl gamers out there!",
      "rating": 5.0,
      "verified": true,
      "author": "ree",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "It has a Lag!",
      "text": "The program is a pain in the ...... to work! And no matter what settings I set there is still a lag as if it's going to sleep after a minute or 2. I've changed the Polling Rate to each setting but all seem to be exactly the same. I'm wanting to give it 1 less star for that but otherwise it feels nice and works great so 3 stars is the best I can do.",
      "rating": 3.0,
      "verified": true,
      "author": "epicfail",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "extra buttons not worth much on Mac, GLOWING LIGHT ALWAYS \"BREATHING\"",
      "text": "Feels very good, probably the best feel from a mouse I know of. I'm not a gamer or anything but it's basically great as far as a mouse goes. I just couldn't get the glowing light to shut off! And that was a deal breaker for me. Maybe on PC you can shut that off. IDK. Also, I was hoping I could get the buttons to map to some functions on my Mac, no such luck. Tried a few pieces of software that claim to help with that too. Put a few hours into it, no dice.",
      "rating": 3.0,
      "verified": true,
      "author": "SomeTinkererGuy",
      "helpful_votes": 0,
      "publication_date": 20180528
    },
    {
      "title": "Lasted 2 months...",
      "text": "Bought this for my son for a Christmas present. I figured I'd give ample time before a review. It was fine at first, and now all the buttons are sticking and barely runs across the mouse pad. I'd have to say that I would've expected a bit more for the price. I will not purchase again, and my son is disappointed at the fact that he can't use it anymore, after just 2 months.",
      "rating": 2.0,
      "verified": true,
      "author": "bonnie walker",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Got my mouse yesterday and I really like it. I bought to replace a razer naga ...",
      "text": "Got my mouse yesterday and I really like it. I bought to replace a razer naga epic which was not working well and I find the redragon perdition confortable and appropiate to play mmos. One thing that you need to keep in mind is that you are probable going to have to download the software and change some settings. The mouse by default is extremely sensitive and moves very fast on your screen, also if you want to use the numbers from the numpad instead of the regular numbers like I do you need to download the software to change the settings. I found it to be easy to handle I am quite happy with my purchase",
      "rating": 5.0,
      "verified": true,
      "author": "Rafael Santiago",
      "helpful_votes": 0,
      "publication_date": 20170831
    },
    {
      "title": "Software wont save remapped keybinds!!",
      "text": "Mouse generally works but the software to remap the keys wont save within the mouse even though it \"visually\" saves it on the software interface.. Using Windows 10 I tried installing different versions of the software multiple times and it wouldn't save remaps.. And yes, I've restarted the computer after each install and still no go with remapping the keys... I've heard this mouse works for some people but it isn't for me even after visiting countless tech forums... Buyer beware...",
      "rating": 1.0,
      "verified": true,
      "author": "John Knowles",
      "helpful_votes": 0,
      "publication_date": 20190329
    },
    {
      "title": "DRIVER IS NOT INCLUDED WITH NEWER VERSION M901W - BUT IF YOU EMAIL THEM THEY WILL SEND YOU DRIVER",
      "text": "This was a real pain in the butt because I love these for our office but the newer ones didn't come with the driver and would not work with our older drivers. The websites have drivers but they did not work, and also there are different sites and some have security flaws. They should really include a link to download here but I'm saving you the stress, just ask them until they do.",
      "rating": 5.0,
      "verified": true,
      "author": "MAT",
      "helpful_votes": 0,
      "publication_date": 20200213
    },
    {
      "title": "Worth it for the price.",
      "text": "Was well worth it for the price. Pro: DPI - AMAZING. I have it at 16k. Grip works well. Fits comfortably in my hands. The software is easy to use. Cons: The 12 button thumbpad is not that easy to use. My naga broke which led me to this. I have to slide my fingers down to get to the bottom 6 buttons. Takes a bit to get used to.",
      "rating": 4.0,
      "verified": true,
      "author": "tracy",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "stopped working after a year",
      "text": "i love the mouse. it feels great and the extra buttons are wonderful. The software is iffy. The mouse did start shorting out after a year. the computer would intermittently stop recognizing the mouse. I could SOMETIMES get it to start working by unplugging it and plugging it back in. I wish it lasted longer!",
      "rating": 3.0,
      "verified": true,
      "author": "Big Ben Wells",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Numbered side buttons work for MAC right out of the box!",
      "text": "I had purchased a gaming mouse in hopes that I could utilize the MMO programmable side buttons on my Mac. That one didn't work (well, I wasn't going to go through all the hoops to make it work). The Redragon Perdition worked RIGHT OUT OF THE BOX! This is going to help speed up my podcast editing! THANK YOU Redragon! Note: I won't be able to give it 5-stars yet because I literally plugged it into my Mac 10 minutes ago.",
      "rating": 4.0,
      "verified": true,
      "author": "SteveStewart.me",
      "helpful_votes": 0,
      "publication_date": 20180911
    },
    {
      "title": "The best quality gaming mouse I've ever owned.",
      "text": "This is such a nice quality mouse, I initially gave it 3 stars because the side number button's interfere with my gaming. When I get into a fire fight in game my mouse hand tenses up and I end up switching between guns when I should be sending lead to my foe. I cannot tell you how many times this happened. Make a model without the side button's and I'm in, otherwise avoid at all costs. UPDATE!!! I am updating my review to 5 stars. I downloaded the RedDragon Perdition tool and I am now able to disable the side number buttons. Game on!",
      "rating": 5.0,
      "verified": true,
      "author": "shannon m riley",
      "helpful_votes": 0,
      "publication_date": 20170621
    },
    {
      "title": "Junk.",
      "text": "I play a lot of Classic Wow PVP and BGs. I need the mouse to do it's job. If I move the mouse, it should respond. This doesn't, it stutters. Any tiny little crumb or dog hair on the mouse pad it itterupts the flow. Mine must be defective or something because this is a really bad mouse. My $5 mouse is better than this junk.",
      "rating": 1.0,
      "verified": true,
      "author": "ZombieBunny",
      "helpful_votes": 0,
      "publication_date": 20200726
    },
    {
      "title": "Highly recommend, especially for the price.",
      "text": "This mouse is a nice alternative to the Logitech or Razer multi-buttoned mouse and I'd highly recommend it for anyone wanted to see if they'd even like a multi-buttoned mouse but don't want to spend the money on a name brand one. This mouse works well, and if you're a nerd like me you like your colors on your computer and accessories to match, this one comes ina a wide array of lights and it matches my computer, it's great. My only problem is I feel like I've noticed a little bit of skipping while moving my mouse fast, not sure if that's just me or what but it's really my only issue with the mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "NWM",
      "helpful_votes": 0,
      "publication_date": 20151211
    },
    {
      "title": "Great at first but invariably breaks.",
      "text": "My brother, my dad, and I have each bought this mouse and all 3 worked great at first but after some months each one started having problems clicking. Some would occasionally double click instead of single click which only got worse and worse as time went on. On one you had to press the mouse button pretty hard to get it to click at all. On that same one it would not stay clicked to allow for click and dragging. If it weren't for these problems I would rate this mouse 5 stars but since I've had 3 separate failures there is clearly some kind of quality issue and cannot recommend this mouse.",
      "rating": 2.0,
      "verified": true,
      "author": "Cassie",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "It lasted me almost 5 years before I got a replacement",
      "text": "Great mouse, bought one in 2015 and another yesterday because the scroll wheel got stiff and annoying to use. I'm on my computer almost 24/7, and the fact it lasted that long makes it my favorite mouse ever. The textured material is very weird compared to your average plastic mouse, and there's an adjustment period, but I love it now.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Ramallo",
      "helpful_votes": 0,
      "publication_date": 20191031
    },
    {
      "title": "Worth the price, buttons have a nice feel to them. Adjustable weight for personal preference.",
      "text": "Bought this in need of a new gaming mouse. Will be used for more than just that, however. The feel is nice. I was using a Razer Naga before. The Red Dragon M901 is pretty up to par considering the price. Affordable, and will get the job done. I like the adjustable weight feature, and the color scheme suits me. (Item also arrived ahead of time which is awesome.) Very satisfied. Note, it did not come with a software installation disc. However you can find the software interface online, just be sure to search my product model number.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "Don't waste money on a higher price name brand. This has all the functions at a lower price.",
      "text": "Now this is an excellent mouse. Just as good as any higher price mouse. Fantastic lighting effects and the customized macro settings are saved on memory in the mouse so that it can be used on different computers without having to redo the settings. The macro keys took a couple days to adjust to, but definitely are worth it for quick in game combat.",
      "rating": 5.0,
      "verified": true,
      "author": "Myles A. Dickerson",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Its very flimsy..",
      "text": "This mouse would have been an excellent product, the programming feature has saved my hands endless repetitive clicking. But I treated mine with care and the left click randomly fell off. It was designed to break as all things are, just far too easily. Avoid this brand. - A fix for this was a simple piece of scotchtape to reattach the part that snapped off. Doesnt interfere with funtionality and has held for a year now. Best use of scotch tape ever. Great mouse again.",
      "rating": 2.0,
      "verified": true,
      "author": "DB",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great for WoW and a good mouse all around",
      "text": "Excellent for what I needed and reasonably priced compared to a lot of higher quality gaming mice. I play a lot of WoW and the side buttons come in handy. So far haven't had any connectivity issues or buttons breaking and I've had it for nearly a year. Highly recommend if you're looking for a cheaper alternative.",
      "rating": 5.0,
      "verified": true,
      "author": "Lucifer",
      "helpful_votes": 0,
      "publication_date": 20200314
    },
    {
      "title": "Was Skeptical, But This Mouse Is great",
      "text": "I thought this was going to be cheap crap because of the price... But no. This mouse is quality. It reminds of how Razer used to make their products, except for half the price. The only somewhat con I could list is that the two main button are a bit more far apart then the Naga Epic (gen 1) that I'm used to. I have adjusted now though.",
      "rating": 5.0,
      "verified": true,
      "author": "killean",
      "helpful_votes": 0,
      "publication_date": 20190408
    },
    {
      "title": "Decent MMO gaming mouse for Claw grip users",
      "text": "So let's be fair.. This mouse is not suited to my gaming style. This mouse is for most MMO style gamers, and maybe comfortable if you have a \"Claw\" style mouse grip. I play FPS games and have a \"palm\" style grip. As a result, this mouse was extremely uncomfortable to me and aggravated my Carpel. The software to program it, is \"okay\", and took a while to dial in the DPI settings to my liking. I honestly don't think the optics are very accurate. In the end, I went to a Logitech Proteus 502; which is much more comfortable to my grip, and more applicable to my gaming style.",
      "rating": 3.0,
      "verified": true,
      "author": "TMC",
      "helpful_votes": 0,
      "publication_date": 20160307
    },
    {
      "title": "Pretty Good.",
      "text": "Took a little to get used to the weight of the mouse but is good after a little. I have noticed that sometimes it doesn't track just right and will go off a little, and mine will double click or even triple click when hitting the scroll wheel. I use this to open other tabs and it will open multiple that i have to exit out of. It doesn't bother me that much but other people it will. The buttons on the side are nice for games that require a lot of buttons to do certain actions. Pretty decent mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael R",
      "helpful_votes": 0,
      "publication_date": 20200722
    },
    {
      "title": "Incredibly Comfortable. My new favorite mouse.",
      "text": "This is my first official gaming mouse with the 12 side buttons. I was concerned that it wouldn't be comfortable at all without working to get used to it, but this mouse is almost unreasonably comfortable. There's an indent on the right side for your ring finger to rest! WHAT!? The 12 key setup is surprisingly easy to use. The way the keys sit at different angles makes it incredibly easy to know which row you're on. The scroll wheel changes color as you adjust the sensitivity. The adjustable weights make the mouse feel incredibly sturdy, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Josh Needham",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "5 year update.",
      "text": "Okay it does feel cheap & doesn't feel quite as quality for the price. -The weights can be adjusted to how you like your mouse (I removed all of mine since I like light quick movement.) - I also like the customization with it. I have had it for 5 years & still good as it was on day one. if you are looking for a good gift or something that will last you a while before you can upgrade this will be a quality mouse.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Took 5 years to finally break.",
      "text": "I used and abused the hell out of this thing, it was my go-to mouse for over 5 years. Unfortunately, it finally broke last year and I went with another mouse. This thing was pretty awesome though, and I can't stress the bang for buck it brings. I never had any problems with it until it died. And make no mistake, I used it probably 6 hours a day on average, so it more than fulfilled it's purpose. The only reason I didn't get one more of these is that I wanted to have a complete set of Corsair gear.",
      "rating": 4.0,
      "verified": true,
      "author": "Arthur",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Great buy",
      "text": "I've been seriously impressed with this mouse, it has held up through hours (too many) of gaming. This is perfect for my mmorpg's has helped me easily incorporate more abilities. The bottom row can take a bit of getting use to the reach but it's not bad. I have small hands and this fits great, very comfortable - I really like the extra finger groove so the grip feels very natural. You can change the colors on the mouse which is a nice touch and the software it came with was straightforward and easy to use. They should make this in a left handed version too as it'd make a great gift. Will definitely repurchase when this one poops out.",
      "rating": 5.0,
      "verified": true,
      "author": "Sweetyheart",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Worthless knockoff",
      "text": "An absolute crap knockoff brand mouse that isn't worth the plastic it's printed on. Received the mouse broken with the '1' and '2' buttons constantly stuck, it feels cheap, the weights (while adjustable) never felt quite right, and the lighting barely shows. A waste of your time and money. Just go ahead and spend the extra $10-20 on a Razer/Logitech where you know the product will have quality control and last more than a few hours out of the box.",
      "rating": 1.0,
      "verified": true,
      "author": "Album",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "The software that comes with it is kinda crap. Unintuitive",
      "text": "The software that comes with it is kinda crap. Unintuitive. Razor Synapse looks good in comparison, and that's not a good sign. But if you're just looking for a 12-button mouse and don't want to shell out for a Naga, buy this! So long as you are the type of user that just modifies their settings one time and then never again, you're going to love this mouse and how much money you've saved. Very high quality product. I'm happy with my purchase and will seek out this brand for my next mouse.",
      "rating": 4.0,
      "verified": true,
      "author": "Sketch",
      "helpful_votes": 0,
      "publication_date": 20160716
    },
    {
      "title": "best mmo mouse",
      "text": "I highly recommend you consider this option if you play MMORPGs. It isn't certainly necessary, however it does give you the edge vs on your keyboard w/o looking directly at the keyboard. You could also change the button scheme purposely to your needs to add more actions if needed for your daily gaming purposes. If you play MMOs such as FFXIV, which has no shortcuts when performing combinations, this is highly recommended to play at a high skill level especially for PvP.",
      "rating": 5.0,
      "verified": true,
      "author": "W Akiro",
      "helpful_votes": 0,
      "publication_date": 20170518
    },
    {
      "title": "Better than higher end mmo mouses",
      "text": "This mouse far exceeded my expectations. Everything was packaged beautifully, it came with a case, a logo sticker and even a smaller case for the weights. Works beautifully. Software was easy to use to bind the keys. It has a nice feel to it, and I like how it's not super smooth. It makes the mouse easy to grip. I actually like it so much I'm buying a keyboard from this brand. I've had multiple razor naga mouses and I'm surprised this mouse seems to preform better.",
      "rating": 5.0,
      "verified": true,
      "author": "Jodi Loendorf",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Nice gaming mouse that won't break your budget.",
      "text": "This is nice mouse for those who aren't necessarily hardcore gamers but want an upgrade from your standard mouse. It's got a nice weight and balance to it and the programmable buttons are nice. I had some issues with the USB cord kinking where it meets up with the USB connector but after contacting customer service I got the issue resolved. Just to be on the safe side I do try to be careful about putting any unnecessary pressure on the cord. All in all a good little mouse for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "Josh F.",
      "helpful_votes": 0,
      "publication_date": 20171020
    },
    {
      "title": "Do not buy for gaming.",
      "text": "I ordered this mouse thinking buttons were programable but they aren't. The side buttons are set to the same values as the number buttons on a buttons are a total waste of time. I was hoping that like most multi button mice windows would assign them values like mb4, mb5, mb6 but nope. The mouse is heavy and the contours make it nearly impossible to raise the mouse without pushing side buttons while moving in game. This mouse is going in the garbage.",
      "rating": 1.0,
      "verified": true,
      "author": "GADE",
      "helpful_votes": 0,
      "publication_date": 20190313
    },
    {
      "title": "Best Gaming Mouse Around",
      "text": "I have purchased about 5 of these now (had to replace few due to puppies teething). This is the most comfortable gaming mouse I've ever used. I love the 12 buttons on the side makes gaming a breeze. Its programmable and you can adjust its looks somewhat to your choice. Also comes with weights to make the mouse more comfortable in your hand.",
      "rating": 5.0,
      "verified": true,
      "author": "Jolene  Bolin",
      "helpful_votes": 0,
      "publication_date": 20190624
    },
    {
      "title": "Great textured grip and form excellent upgrade from broken razer naga",
      "text": "4 month of aggressive use and mouse is still working great, which is 2 months longer then it took for my nagas middle click to fail. Multiple pro points for a midrange gaming mouse. Textured grip is something I did not expect to love but it just feels right and I'm already missing it on other mice I use. Weights included to allow for customization very nice. Side buttons angled and required minimal time to get used to. Only negative I have is the software drivers simply do not work and mouse is stuck breathing.",
      "rating": 4.0,
      "verified": true,
      "author": "Jeremy A Capodici",
      "helpful_votes": 0,
      "publication_date": 20181209
    },
    {
      "title": "USB Device Not Recognized",
      "text": "This is the only mouse I have ever plugged into my computer that it did not recognize. I researched the hardware and software issues for my machine, the hardware and software issue for the mouse, and came up with nothing to get this mouse working. I strongly recommend you don't buy this product. Maybe I got a defective device, maybe you'll get lucky, maybe I don't know what I'm talking about but alas this one is getting a return. I hate to spend twice this amount on a Razer Naga that wont last very long, but yeah that's what I'm about to do because this mouse can't even plug into a computer and be recognized. Horrible experience.",
      "rating": 1.0,
      "verified": true,
      "author": "Tim DuBose",
      "helpful_votes": 0,
      "publication_date": 20200330
    },
    {
      "title": "Favorite Mouse Ever",
      "text": "This lasted longer than any of my three previous Razer Nagas so now I'm finally writing a review. I love the weight and the way the buttons are not all completely flat. The software is great as well, you can make a variety of sensitivity settings you can change at the click of a button and you can customize the hue of the lights around the mousewheel, 12 buttons, and dragon icon per setting. The ability to adjust the weight was a nice perk, but I prefer it at it's heaviest so I never had to remove any weights from it, but if it was too heavy I would have appreciated that even more. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kitty",
      "helpful_votes": 0,
      "publication_date": 20170924
    },
    {
      "title": "Keeps disconnecting, the only mouse where I have this issue",
      "text": "I really wanted to like this mouse, truly I did, but as of June of last year, it's been nothing but headaches with this thing. It is CONSTANTLY disconnecting and after testing with other mouses it seems to be the only one with this issue. I wasn't expecting this to be one of those mouses that I use for 5+ years, but I was expecting it to last longer than a single year. I could live without being able to macro (though even that leaves a bit to be desired), but it feels unacceptable for this thing to not be useable after such a short about of time and with no damage done to it.",
      "rating": 1.0,
      "verified": true,
      "author": "Janet Jackson",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Software doesn't work well",
      "text": "I had the original version of this mouse (Model M901) which I liked very much. But this item is a new version (Model M901-1) and the software is buggy. The interface looks better but the macros are broken and some of the keys do not work. Also the LED colors are off so it does not light up evenly.",
      "rating": 2.0,
      "verified": true,
      "author": "SweetCandy",
      "helpful_votes": 0,
      "publication_date": 20191226
    },
    {
      "title": "Little different, but for the price, better than NAGA",
      "text": "I have always used a NAGA but have had a couple problems with the cord breaking at the connector joint because of the stupid material they wrap it in (that folds on itself). So I decided to try this mouse. It works great so far. I play a lot of online games and require the side keys. It took a bit to get used to switching from the NAGA but now that I am used to it, I appreciate the middle \"grove\" separating the upper and lower sets. The programming is nice and easy to customize macros. The speed adjuster right under the wheel is always nice. Overall a great product and much cheaper than the NAGA",
      "rating": 4.0,
      "verified": true,
      "author": "Just an Idaho Guy",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "The Mouse I've Always Dreamed Of! It's a Thing of Beauty.",
      "text": "How do I love thee,..let me count the ways: The feeling is elegant, how it slides like a teflon don, very deliberate, how it translates my slightest whim into meaning. I've programmed all the buttons I want, it is amazing,..the mouse pop-up program is a mini-masterpiece, very pretty piece of coding, boys,..I really appreciate the passion that went in to that. Seriously. I am a mouse freak,..a fanatic,..I'm the Kaptain Ahab and this mouse is my white whale. I've designed mice in my dreams, and someone out there must dream like me, cause I swear this is the mouse I always came up with! A perfect mix of great software and sublime hardware.",
      "rating": 5.0,
      "verified": true,
      "author": "Nath",
      "helpful_votes": 0,
      "publication_date": 20160304
    },
    {
      "title": "Almost perfect mouse for an incredible price",
      "text": "Honestly this mouse blows most other mice out of the water in straight value. The ONLY gripe I have with this mouse is that there is no left/right tilt action on the scroll wheel. That was something I used a lot in MMOs. But otherwise this is the best mouse I've owned.",
      "rating": 4.0,
      "verified": true,
      "author": "Tre",
      "helpful_votes": 0,
      "publication_date": 20181228
    },
    {
      "title": "Smaller than I honestly expected, but still okay.",
      "text": "It's uh.. pretty tiny. I wont lie. The side buttons are pretty small as well. They feel made of rather cheap plastic, and any sort of non-casual MMO fan would probably break these within a week or two. For a ham-hands person like myself, my thumb alone covers up about two buttons. As such, I've ordained to literally give it away to someone, versus keeping it for myself. I'm hoping to find a good mouse one day, though. Mouse customization buttons via the software are pretty nice though. They let you adjust a myriad of settings to really tailor-in that mouse that you can call yours.",
      "rating": 3.0,
      "verified": true,
      "author": "Cody Yarbery",
      "helpful_votes": 0,
      "publication_date": 20161209
    }
  ],
  "product_meta": {
    "title": "Redragon M901 Wired Gaming Mouse, MMO RGB LED Backlit Computer Mice, 12400 DPI Perdition with 18 Programmable Buttons, Weight Tuning Set for Windows PC Gaming (Black)",
    "rating": 4.4,
    "feature_bullets": [
      "WIRED GAMING MOUSE; built for PC Gamers -Optical Gaming Mouse up to 12400 DPI via software, 12000 FPS, 1000 Hz polling rate, 50G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Micro Switch ensure longevity, greater durability",
      "LED RGB BACKLIT PROGRAMMABLE GAMING MOUSE; 18 programmable buttons, 5 Memory Profiles each with distinct LED color option for quick identification. Comes with 8-piece weight tuning set (2.4g x8) and Breathing Effects. (LED Backlight can be disabled)",
      "ERGONOMIC GAMER MOUSE DESIGN; Ergonomic shape fits naturally in your hand, reduces stress with superior productivity and efficiency. Give an extremely gaming experience during sessions like league of legends, steam, Fortnite, PUGB, Overwatch, Call of Duty",
      "HIGH-END PC GAMING MOUSE FEATURES; 7 Mouse Buttons PLUS 12 MMO programmable side buttons. Total 19 buttons. Fire button, Pulsing Breathing light color modes. Durable smooth TEFLON feet pads for ultimate gaming control",
      "PC GAMING MOUSE COMPATIBILTY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Comes with 6 foot high-speed braided fibre cable and a gold-plated corrosion free USB connector for a reliable connection"
    ],
    "specifications": {
      "Product Dimensions": "4.65 x 2.95 x 1.54 inches",
      "Item Weight": "5.3 ounces",
      "Manufacturer": "Redragon",
      "ASIN": "B00GU8W5AE",
      "Item model number": "M901",
      "Customer Reviews": "4.4 out of 5 stars4,901 ratings4.4 out of 5 stars",
      "Best Sellers Rank": "#453 in Video Games",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 18, 2013"
    },
    "categories": [
      "PC",
      "Accessories",
      "Video Games",
      "Electronics",
      "Gaming Mice"
    ],
    "price": 31.99
  }
}