{
  "website_summaries": [
    {
      "verdict": "A large screen with multi-touch and full HD compatibility, the crystal clear display and ergonomic design beat out other high-priced monitors in its class.",
      "pros": [
        "Great for professional settings and home use, the size enables easy viewing of split screens or documents simultaneously",
        "Users find the touch feature extremely responsive and with low drag, even in the corners",
        "Can use it on the stand or wall mount"
      ],
      "cons": [
        "Side buttons for power and screen controls are too small and sensitive for some",
        "may inadvertently turn off monitor while adjusting it"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "The Acer T272HL is a striking 27-inch touch-screen monitor offering very accurate colors and responsive 10-point touch technology. It's a generally solid performer, but it loses some color fidelity when viewed from an angle, and it has a reflective coating.",
      "pros": [
        "Responsive touch screen",
        "Excellent color accuracy",
        "Stylish design"
      ],
      "cons": [
        "Reflective screen",
        "So-so viewing angles",
        "Pricey"
      ],
      "aspects": {},
      "publication_date": 20140219,
      "rating": 7.0,
      "source": "pcmag"
    }
  ],
  "customer_reviews": [
    {
      "title": "Do not buy this monitor if you have any expectations ...",
      "text": "Do not buy this monitor if you have any expectations for the touch screen to work with Windows 10 regardless of what it says in the FAQ! From Acer's Website: Why is my T272HL touchscreen not working in Windows 10? The touch functionality of the T272HL will not work in Windows 10. Your monitor will still display an image, however, the touchscreen functionality will not work in Windows 10.",
      "rating": 1.0,
      "verified": true,
      "author": "RMEE",
      "helpful_votes": 58,
      "publication_date": 20180217
    },
    {
      "title": "Worked erratic...died in 5 months. I purchased in February 2016, touch screen worked erratically ...",
      "text": "Worked erratic...died in 5 months. Please note most reviews on this product state , \"I just purchased and love it or I am enjoying the extra space on my desktop today\" etc. I purchased in late February 2016, after a month, the touch screen worked erratically (mouse okay). Stopped working completely in late July. Acer customer service told me they can't help me because it's only an Acer monitor and not an Acer computer?and there's no on and off switch for touchscreen? Mouse still works on screen, but I bought it for the touch screen capability. Bummed. I exceeded my 30 day window to return.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 11,
      "publication_date": 20160924
    },
    {
      "title": "Work great until you use it.",
      "text": "Initially, great deal. Bought 4, all worked. Day 6, 1 went bad. Sent it back to Amazon. Day 89, another one won't detect HDMI or VGA. Considering these are on a new tradeshow booth and have maybe 30 hours (including 24 of burn in testing, and have yet to be mounted, I'm not feeling warm and fuzzy. Yay!",
      "rating": 1.0,
      "verified": true,
      "author": "Al",
      "helpful_votes": 6,
      "publication_date": 20170403
    },
    {
      "title": "TOUCH does NOT work in Windows 10",
      "text": "Touch screen capability does not work in Windows 10, should mention that in product details and description. So pointless to buy a 10 point touch screen to be used solely as a PC Monitor. Also have a glass cover that is flush with the table or desk used on. So any cables have to be routed around it (ie mouse or keyboard).",
      "rating": 1.0,
      "verified": true,
      "author": "Rick",
      "helpful_votes": 3,
      "publication_date": 20190112
    },
    {
      "title": "A nice 27 inch touchscreen monitor",
      "text": "I am both a PC and Mac user. I use this side-by-side next to a 27 inch iMac. The color is on the Acer are not quite as sharp as the the colors on the iMac. But then again the iMac is not it touchscreen. It is a fixed base which does not allow for any angling raising or lowering. The touch so far has worked pretty well, so I definitely you enjoy and use the monitor. This is a good product, which has the potential to be an excellent one with a better design base.",
      "rating": 4.0,
      "verified": true,
      "author": "Murray Eisner",
      "helpful_votes": 3,
      "publication_date": 20160722
    },
    {
      "title": "Bought two of these, both had a broken screen upon unboxing",
      "text": "Good monitor with great image quality. Touch is very convenient as well. The 3 stars rating is because I bought 2 of these, and both came with a broken screen on the right bezel upon unboxing. Interestingly enough, both screens had the same crack at the same location of the screen surface. Had to return both. Third time was the charm though, now very happy with this monitor overall, although the webcam is very low quality, especially for the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Patrice Melekian",
      "helpful_votes": 2,
      "publication_date": 20200506
    },
    {
      "title": "Pass up on this monitor",
      "text": "Professional reviews liked the way this monitor tilts, but had concerns about the colors and the sound. They still rated it very positively. I’m afraid I can’t follow suit. They were right about ergonomics, color and sound. Wrong to rate it highly. I worked hard with the on-screen display (OSD) menus to calibrate the color. The interface is antiquated, ugly and difficult to use. And I was never satisfied with the color. The sound? Umm, my pocket transistor am radios from the 60’s sounded better. Worst user guide ever. Truly awful. Sent it back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "Jim Richardson",
      "helpful_votes": 3,
      "publication_date": 20171108
    },
    {
      "title": "Very good second monitor",
      "text": "Used as a second extended monitor for a laptop. No issues. Works quite well for excel, word and outlook. This monitor comes with all the cables necessary to connect. No need to buy cables. Screen quality is quite good. I do not play video games so I do not know how how well this monitor will perform. Otherwise, I recommend this monitor as a second monitor for your desk.",
      "rating": 4.0,
      "verified": true,
      "author": "Winslow",
      "helpful_votes": 0,
      "publication_date": 20200229
    },
    {
      "title": "Monitor is great; tech support",
      "text": "Monitor is great; tech support, not so great. Could not get the touchscreen to work and it was obvious the tech support had no tech training but was strictly following a troubleshooting guide. His solution - return the monitor because it \"might be defective\". after doing more research on my own, and contacting Startech support re: the pciexpress usb3.0 card I had the monitor plugged into, it turned out the card driver was incompatible with my motherboard (note - Startech support was awesome). switched out the card and touchscreen works. So great monitor, but zip for support.",
      "rating": 4.0,
      "verified": true,
      "author": "Publican",
      "helpful_votes": 2,
      "publication_date": 20160809
    },
    {
      "title": "Touch responsiveness is quite good, but don't expect to be able to draw ...",
      "text": "Visually - Great/clear monitor. Touch responsiveness is quite good, but don't expect to be able to draw on the screen or anything like that. The sound is below par. I got a tiny little speaker which is good enough for me, but the one on the monitor is terrible. Also, the placement of the volume buttons etc is pretty bad. You can't tell what button (on side of monitor) does what. The instructions that come with it are terrible.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Dorn",
      "helpful_votes": 2,
      "publication_date": 20161229
    },
    {
      "title": "Perfect with Surface Pro",
      "text": "I bought this after viewing the set-up in MS store. They didn't have any in stock and would not sell the display so I ordered this. Set-up was so simple. I am a photographer. This may save my eyes. I can see so much more detail now than on the Surface Pro set up. I HIGHLY recommend this monitor. The touch screen is fabulous!! You can't find a better monitor.",
      "rating": 5.0,
      "verified": true,
      "author": "ROS",
      "helpful_votes": 21,
      "publication_date": 20131230
    },
    {
      "title": "I love this touch-screen monitor",
      "text": "I actually dropped down in size from a 27\" curved monitor to this Acer touch-screen. This is my first experience with a touch screen for a desktop. Set up was easy, just don't gloss over the directions - you have to use the USB cable as well as an HDMI or other regular monitor cable. Without the USB cable, the touch screen won't work. All said, I will never go back to a non-touch monitor. I liked this one so much, I got one for work too!",
      "rating": 5.0,
      "verified": true,
      "author": "D Unthank",
      "helpful_votes": 0,
      "publication_date": 20190327
    },
    {
      "title": "Great size, perfect images",
      "text": "I bought this as a gift for my son, who was very happy to receive it. The screen is very large, perfect for web browsing, gaming, and music production without being too big to view it comfortably. The touch screen works perfectly, and the screen just looks amazing with great resolution. I'm very happy with my purchase and will continue to buy Acer products as they are always top quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20160520
    },
    {
      "title": "Awesome monitor, touch works well",
      "text": "Awesome monitor , touch works well. Using on a IMAC27 dual monitor set up.. works to some degree with MAC OS touching the icons, the search bars,I really don't use it much as anything other than a monitor when using MAC OS , running bootcamp and windows 10. works perfectly with windows.. I do recommend a precision stylus like the MEKO 2 pack. Would buy again for sure.. and this one was a used one from amazon warehouse deals.",
      "rating": 5.0,
      "verified": true,
      "author": "Jose L. Estrella Ramirez",
      "helpful_votes": 0,
      "publication_date": 20160414
    },
    {
      "title": "Wonderful touch monitor.",
      "text": "This is a wonderful touch monitor. I have it connected to a Surface pro and a Dell laptop through a switch device. I also have a Logitech wireless KB and mouse on the switchbox. One button switches the monitor from computer to computer. AND my old non-touch laptop functions with touch when connected to this monitor. I found out by accident when I happened to touch the monitor. really cool.",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin Edgerley",
      "helpful_votes": 0,
      "publication_date": 20170907
    },
    {
      "title": "Great touchscreen!",
      "text": "I was looking for 2 touch screens that that I could use to connect in a 3 screen setup with a Wacom 27\" tablet. These matched the screen resolution of the tablet. I'm using them for both audio and video production and the response so far has been great. I can easily drag the mixer faders up and down with descent precision. In the end I'm very pleased with my purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Good",
      "text": "Nice picture, nice stand that tilts way back, and touch control that works fine on my Win 7 system. If you can call a monitor elegant, this is it. Now, the first one of these I had to exchange, because the touch capability didn't work on that one. Amazon was excellent in shipping out the replacement immediatly and collecting the first one, conveniently and with no cost to me. So, if at first you don't touch screen...",
      "rating": 4.0,
      "verified": true,
      "author": "Kenneth Sullivan",
      "helpful_votes": 2,
      "publication_date": 20150901
    },
    {
      "title": "considering how much I love this product",
      "text": "I've owned this monitor for more than 2 months. A week or so ago I noticed the front of the screen began to separate from the base. However, considering how much I love this product, I told Amazon to just go ahead and exchange it. It has great response time, beautiful picture, and a wide range of adjustable settings. I shopped for a long time and picked this one for a reason! I ordered a replacement and I'm just waiting for it to get back into stock. The trouble is worth it to replace a simple defect on a great product!",
      "rating": 4.0,
      "verified": true,
      "author": "Dharma Kava Lounge",
      "helpful_votes": 0,
      "publication_date": 20160805
    },
    {
      "title": "Dream Monitor",
      "text": "The Acer T272HL bmjjz 27\" touch screen monitor is a dream! It is clear and crisp. The touch feature works perfectly. I loved it so much that I bought another one to extend my display.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Terrible purchase!",
      "text": "There is no driver for this monitor. Every day I have to do a driver update to get the touch display to work. Not worth $. Plus the screen has to be right in front of you or it is washed out. Terrible purchase! PS... Acer says the touch screen does not work on Windows 10 - looks like after this much time they do not plan on fixing the problem. WHY WOULD THEY NOT STATE THAT?",
      "rating": 2.0,
      "verified": true,
      "author": "JBL",
      "helpful_votes": 0,
      "publication_date": 20170224
    },
    {
      "title": "Great styling, but occasionally malfunctions",
      "text": "Very stylish bezel, cool hinge in the back that allows a variety of tilt angles. Love the 10-point touch feature. Got two monitors for my office, work like a dream. 27\" is a lot of property. Unfortunately, one of the monitors failed, the LED backlight went out within a month. Had to order a replacement.",
      "rating": 3.0,
      "verified": true,
      "author": "Andre G",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "My two year old can use ms paint like never before",
      "text": "My two year old can use ms paint like never before. Amazing! Edit: 3 months after purchase, the stand has lost its strength/tension and the monitor has fallen back. It cannot stand on its own.",
      "rating": 3.0,
      "verified": true,
      "author": "A. Baker",
      "helpful_votes": 3,
      "publication_date": 20160221
    },
    {
      "title": "This is a beautiful display. The image is bright and vibrant",
      "text": "This is a beautiful display. The image is bright and vibrant, and the overall aesthetic is really nice. The only downside I can think of is that it is a bit more difficult to run the keyboard cable around, since they have to go around the monitor. If you're using a wireless keyboard, of course, that's no issue at all. Very happy I went with this model.",
      "rating": 5.0,
      "verified": true,
      "author": "Thom Barclay",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "A Great Choice for Touchscreen",
      "text": "I switched to Windows 8 and, since I was used to a large 27\" screen, I chose this Acer model to accommodate it. No regrets at all. Bright, responsive and plenty of inputs. I eventually mounted this on a fully articulated arm but in the meantime, I found the built-in stand easy to use. Both the stand and the clear plastic front piece are removable to allow wall-mounting. The monitor even comes with a small plastic piece to cover the mounting bracket for the stand. No speakers (but I don't consider that a con, just a choice). Delivery was prompt, packaging more than adequate and the display was perfect. And it was a bargain!",
      "rating": 5.0,
      "verified": true,
      "author": "Art Encinias",
      "helpful_votes": 12,
      "publication_date": 20140425
    },
    {
      "title": "Great monitor, worked with no effort",
      "text": "I was surprised that the touch screen work instantly out of the box without having to manually install drivers or calibrate. Luckily the clear plastic strip does unscrew from the bottom of the monitor as I'll be using a rear mount eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ B.",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Great Touch Monitor",
      "text": "Great monitor at a great price. Sleek with a crisp vibrant display and fully adjustable tilt mechanism that allows for optimal viewing and use. The monitor alone is perfect and the added touch support makes it even better. Not only is it functional its very stylish, many coworkers have given their compliments and proceeded to get one of there own. I highly recommend this monitor as a stand alone for desktop or to add a second monitor workspace to any desk.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Salem",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "good screen, lots of glare",
      "text": "nice screen, has some glare if you have a background window or lightsource. perfect at night with low level ambient light.",
      "rating": 4.0,
      "verified": true,
      "author": "HVAC McPhillips",
      "helpful_votes": 0,
      "publication_date": 20200919
    },
    {
      "title": "Large Screen with Touch screen that beats them all!",
      "text": "A bit washed out colors and just a little more sharpness needed, but wow this monitor is killer 27\" touch screen that is so responsive makes a phone touch screen look like it's lagging input. Large screen is a plus, love that you can keep the leg mount on and use the VESA at the same time.",
      "rating": 5.0,
      "verified": true,
      "author": "GO DRAKEN",
      "helpful_votes": 0,
      "publication_date": 20160824
    },
    {
      "title": "great touchscreen lcd.",
      "text": "mounts to any mount, touchscreen is accurate and supports multi-touch my brother an apple fan is even likes this monitor for his apple even though apple does not support multi touch screens but it still works as select. i used this lcd on my loctek motion arm mount. also has 3 USB 3.0 ports on the backside. connected to my alienware and hp laptop as extended secondary screen.",
      "rating": 5.0,
      "verified": true,
      "author": "PJ",
      "helpful_votes": 0,
      "publication_date": 20151006
    },
    {
      "title": "The seller shipped it quickly and I am pleased with the purchase",
      "text": "This works as described and I have not encountered any problems. The seller shipped it quickly and I am pleased with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Cadali",
      "helpful_votes": 0,
      "publication_date": 20170303
    },
    {
      "title": "Great product and good customer service from Amazon",
      "text": "Great touchscreen. Love my set up. In addition, I had an issue with the order and their were quick to respond and fix the issue. Fantastic.",
      "rating": 5.0,
      "verified": true,
      "author": "Qomomoko",
      "helpful_votes": 0,
      "publication_date": 20190809
    },
    {
      "title": "Great touch screen",
      "text": "I bought this for my kids computer. They love it. The touch is very accurate and responsive. The display is great looking as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Inner Child",
      "helpful_votes": 0,
      "publication_date": 20190225
    },
    {
      "title": "Buy It!",
      "text": "Best monitor I have seen. Only drawback are the speakers, kind of poor. If you want decent sounds while listening to music while computing, set up separate speakers. I did. Monitor itself exceeds expectations re clarity and performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Bennett",
      "helpful_votes": 2,
      "publication_date": 20150430
    },
    {
      "title": "Terrible Acer Support",
      "text": "In less than 6 months I bought the product the LCD panel popped out. Terrible Acer support, when I called Acer support they said I need to pay for shipping the product to service center and they will repair the panel. I use the monitor for work and don't have alternate monitor.",
      "rating": 1.0,
      "verified": true,
      "author": "SJ",
      "helpful_votes": 2,
      "publication_date": 20170328
    },
    {
      "title": "You get what you pay for",
      "text": "Not a very good monitor to use with a laptop. Fuzzy image and touchscreen functions are extremely hard to calibrate when using in conjunction with non-touchscreen dual display set up. Price is reasonable compared to other touchscreens but in my opinion, it’s better to spend the extra money. I ended up passing it down to my son and went back to my original monitors.",
      "rating": 2.0,
      "verified": true,
      "author": "Carroll E Price",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Massively great",
      "text": "It took a few moments to figure out how to get 2560x1440 out of this monitor. My surface pro is running it fantastically. Colors are vibrant and keys correctly. Touch is amazing. Been editing photographs all afternoon and I can tell the space difference. I bought a refurbished unit. No manual but that was online. Packaging was minimal but it arrived and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20140607
    },
    {
      "title": "Great Touch 23\" Monitor!",
      "text": "I am very happy with this monitor! it works exactly as advertised. With the exception of an update from Microsoft that causes problems with the docking station, need to work around that problem, but Microsoft is working on that. It is NOT a problem with the monitor!",
      "rating": 5.0,
      "verified": true,
      "author": "Brenda R.",
      "helpful_votes": 2,
      "publication_date": 20151005
    },
    {
      "title": "This + Remix mini = Awesomeness!",
      "text": "This is the only touchscreen I could find that works with the new Android Remix mini desktop OS. The kids love having a 23 inch android tablet that functions as a desktop and a tablet! Watching them play fruit ninja is a blast!",
      "rating": 5.0,
      "verified": true,
      "author": "J. Childers",
      "helpful_votes": 2,
      "publication_date": 20160712
    },
    {
      "title": "The monitor looks good and works fine",
      "text": "The monitor looks good and works fine. The stand, however, is garbage. I returned my first one after only a week because the adjustable stand broke, and would not support the monitor in any position. My replacement lasted 2 weeks until the same problem occurred.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20160524
    },
    {
      "title": "Very Good touch screen monitor",
      "text": "I think my only disappointment is that the screen does not work with a Microsoft Surface pen. The touch screen is a nice feature over a standard screen.",
      "rating": 4.0,
      "verified": true,
      "author": "ChuckN",
      "helpful_votes": 0,
      "publication_date": 20191006
    },
    {
      "title": "The body of this product is quite large, but ...",
      "text": "The body of this product is quite large, but it fit our dual monitor mount and the touch screen component works really well.",
      "rating": 4.0,
      "verified": true,
      "author": "Ian Callahan",
      "helpful_votes": 0,
      "publication_date": 20170828
    },
    {
      "title": "Good but the stand makes it take up a lot ...",
      "text": "Good but the stand makes it take up a lot of room. Had to squeeze it in in a desk, and it fell onto my chair and the screen broke in a bunch of places.",
      "rating": 4.0,
      "verified": true,
      "author": "Victoria",
      "helpful_votes": 0,
      "publication_date": 20180714
    },
    {
      "title": "Great monitor, terrible kickstand",
      "text": "My only issue with this monitor is the kickstand. It's not sufficient to support the monitor unless it's at an ~45 angle. Anything beyond that and you risk knocking the monitor over and scratching the screen. I bought a VESA mount to address this, which added $35 to the price of this monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn B Mull",
      "helpful_votes": 2,
      "publication_date": 20151008
    },
    {
      "title": "Very Pleased",
      "text": "Great monitor, all I did is plug in the HDMI connector to my computer, plug it into the wall, and move the wireless USB into the side of the monitor. Turned in on and everything worked in a very short period of time. Very responsive on the touch screen. I have old eye balls and this is a very on the eyes.",
      "rating": 5.0,
      "verified": true,
      "author": "Retired Yooper RP Tech",
      "helpful_votes": 0,
      "publication_date": 20151030
    },
    {
      "title": "Touch screen works with my fat fingers.",
      "text": "This is the second of this family of displays for me. With this style of display Windows 8.1 is growing on me. This display is large enough that my fat fingers work with the tough screen well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 2,
      "publication_date": 20150326
    },
    {
      "title": "Fantastic touch screen monitor",
      "text": "Fantastic monitor, nice clarity, great touchscreen, and great stand to allow for easy in use adjusting for close to flat touch or up in your face viewing. Would give anoth half star if possible. Only knock is crappy speakers, but as I am an audiophile I always use external amp and speaker. Great price too.",
      "rating": 4.0,
      "verified": true,
      "author": "Stephen Kehoe",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Five Stars",
      "text": "It works out just fine for our desk. Easy to see.",
      "rating": 5.0,
      "verified": true,
      "author": "K.M.F.N.",
      "helpful_votes": 0,
      "publication_date": 20170102
    },
    {
      "title": "great picture! only drawback is the vertical height is ...",
      "text": "great picture! only drawback is the vertical height is much shorter than monitors of this size. the plastic clear plate on the bottom of the bezel deceives one into thinking the monitor is larger than it is...other than that awesome picture and touchscreen BUT only one monitor (I uses two) can be setup as touch. Not sure if its win8 or Acer",
      "rating": 4.0,
      "verified": true,
      "author": "David A.",
      "helpful_votes": 2,
      "publication_date": 20150529
    },
    {
      "title": "No complaints",
      "text": "This monitor is so good I bought it twice. I have included some of the tech specs that are tough to find on this product page in my image below.",
      "rating": 5.0,
      "verified": true,
      "author": "B. DON",
      "helpful_votes": 3,
      "publication_date": 20161230
    },
    {
      "title": "Great and affordable monitor.",
      "text": "Very nice, bright monitor. Very touch responsive with Windows 10. It's not an edge-to-edge screen, has about an inch border, but sleek looking and just what I was looking for.",
      "rating": 5.0,
      "verified": true,
      "author": "DaveNSpring",
      "helpful_votes": 0,
      "publication_date": 20160111
    },
    {
      "title": "Seems well",
      "text": "My wife effortlessly set this up. My daughter loves playing interactive games through websites like Nick Jr.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Varone",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Touchscreen more functional than I thought.",
      "text": "The monitor is great! Installation was very easy and the touch screen works flawlessly. The only issue I have is that the stand runs the entire length of the monitor somewhat limiting usable desk space.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180302
    },
    {
      "title": "Works like a charm",
      "text": "Works like a charm, faster than a mouse and keyboard and moves other body parts around while using it. Brilliant resolution!!",
      "rating": 5.0,
      "verified": true,
      "author": "Paul Trower",
      "helpful_votes": 0,
      "publication_date": 20151003
    },
    {
      "title": "Flawless performance",
      "text": "Flawless performance. I am able to disconnect and reconnect my laptop as needed without a problem. Touch screen is right on.",
      "rating": 5.0,
      "verified": true,
      "author": "Alan S. Mathias",
      "helpful_votes": 2,
      "publication_date": 20160908
    },
    {
      "title": "its a great looking monitor",
      "text": "You cant slide your finger across the screen as you would your table or phone. Too much friction. I hardly use the touch feature now. However, its a great looking monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "kerwin clarke",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "This monitor works great at conferences to do on the spot demos of ...",
      "text": "This monitor works great at conferences to do on the spot demos of our software. It allows conference attendees to try it out themselves as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Gina",
      "helpful_votes": 0,
      "publication_date": 20160923
    },
    {
      "title": "Don't buy from Rackgo",
      "text": "This product is not working and even though it has a 3 year warranty on it the reseller on here will not honor it.",
      "rating": 1.0,
      "verified": true,
      "author": "Kindle account",
      "helpful_votes": 2,
      "publication_date": 20170515
    },
    {
      "title": "Touch top",
      "text": "I am very pleased with the touch top. It does take a lot to get used to it, but it is worth it.",
      "rating": 5.0,
      "verified": true,
      "author": "Shar Hayes",
      "helpful_votes": 0,
      "publication_date": 20170926
    },
    {
      "title": "Five Stars",
      "text": "great color and the touch screen works well. ez to install. basically plug and play",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160701
    },
    {
      "title": "Beautiful picture quality",
      "text": "I bought this as the monitor for my gaming machine, but it quickly became the only screen I wanted to use. The picture is so crisp and clear. The touch screen works great, but I don't really use it for that purpose much. Hard to go back to a tiny work laptop screen after this.",
      "rating": 5.0,
      "verified": true,
      "author": "Mouse",
      "helpful_votes": 0,
      "publication_date": 20151012
    },
    {
      "title": "Beware the glare",
      "text": "The touch screen monitor worked as expected without problems. However, the screen surface is a solid very similar to glass, and caused too much reflective glare from the light in the room compared to my old LED monitor. I have passed it on to a family member who is very happy with the much larger screen size..",
      "rating": 4.0,
      "verified": true,
      "author": "Norm",
      "helpful_votes": 0,
      "publication_date": 20160904
    },
    {
      "title": "Huge 27\" monitor",
      "text": "I got the 27\" and it's way too huge. You can't swivel this at all. It's great if you want a huge screen. I returned it because the screen was defective.",
      "rating": 3.0,
      "verified": true,
      "author": "Carol",
      "helpful_votes": 0,
      "publication_date": 20200914
    },
    {
      "title": "DOES NOT WORK with Windows 10",
      "text": "This monitor DOES NOT WORK with Windows 10. I ignored all the reviews that mentioned this and now I am sending them back.",
      "rating": 1.0,
      "verified": true,
      "author": "Joe B",
      "helpful_votes": 0,
      "publication_date": 20190210
    },
    {
      "title": "Great monitor",
      "text": "Absolutely love this monitor! I am really happy w this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "MichaelC",
      "helpful_votes": 0,
      "publication_date": 20190206
    },
    {
      "title": "Good touch screen monitor",
      "text": "I had to buy a new monitor after the same model fell to the floor, shattering its screen. So I've had a lot of expericence with this Acer model. It's just fine. And I'm very content with it.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard Marcuse",
      "helpful_votes": 0,
      "publication_date": 20181027
    },
    {
      "title": "Five Stars",
      "text": "Go ahead and get yourself a touchscreen now. If you're on Windows 10, you'll thanks me later.",
      "rating": 5.0,
      "verified": true,
      "author": "Carl Barnwell Jr.",
      "helpful_votes": 2,
      "publication_date": 20160130
    },
    {
      "title": "Really nice display. I have now purchased three of these ...",
      "text": "Really nice display. I have now purchased three of these displays for myself and other family members. No issues. It works really well with Windows 10. I love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Moellenhoff",
      "helpful_votes": 2,
      "publication_date": 20151106
    },
    {
      "title": "This is a wonderful touch screen monitor",
      "text": "This is a wonderful touch screen monitor. I like having the additional USBs on the side. The only thing I wish it had is a headphone jack. I thought it might be too big, but it allows me to push it back on my credenza and have space to work. I will p[probably order more of these for my employees. Our software is written specifically for touch-screen and the way you can adjust it to almost lay down is also an asset.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Casey",
      "helpful_votes": 0,
      "publication_date": 20150523
    },
    {
      "title": "Great",
      "text": "This monitor is beautiful. Use for my ehr system to take notes. Highly recommend this for anyone that uses a touch screen to take notes.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Sheehan",
      "helpful_votes": 0,
      "publication_date": 20160710
    },
    {
      "title": "I love this monitor",
      "text": "I love this monitor. I want another. It has a shiny service that reflects light easily, but that was expected and is an easy work around.",
      "rating": 5.0,
      "verified": true,
      "author": "ADR",
      "helpful_votes": 0,
      "publication_date": 20150318
    },
    {
      "title": "Sleek looking",
      "text": "Such a sleek looking monitor, easy to set up and works great",
      "rating": 5.0,
      "verified": true,
      "author": "WindhamSD",
      "helpful_votes": 0,
      "publication_date": 20190817
    },
    {
      "title": "Four Stars",
      "text": "great monitor. could have had a better stand setup like a regular monitor.",
      "rating": 4.0,
      "verified": true,
      "author": "Chris Busch",
      "helpful_votes": 0,
      "publication_date": 20171205
    },
    {
      "title": "But I'm personally finding that I still like to navigate with the mouse more most of the ...",
      "text": "No problems. But I'm personally finding that I still like to navigate with the mouse more most of the time.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161213
    },
    {
      "title": "Beautiful, bright",
      "text": "Beautiful, bright, incredible viewing angle, flawless touch with Win10, and 23\" is huge. I found this to be an amazing monitor at a good price.",
      "rating": 5.0,
      "verified": true,
      "author": "Graysand",
      "helpful_votes": 0,
      "publication_date": 20160322
    },
    {
      "title": "Great Touch Screen for any O.S.",
      "text": "Best monitor I've ever bought. Normally use Windows 10 & Linux on my test computer and haven't had any issues with either. Didn't understand the need for the large borders on the screen at first, but they've come in handy when I run Android on my PC.",
      "rating": 5.0,
      "verified": true,
      "author": "RT",
      "helpful_votes": 0,
      "publication_date": 20151227
    },
    {
      "title": "Dim but functional",
      "text": "This model is very dim but the touch screen works great.",
      "rating": 2.0,
      "verified": true,
      "author": "MarkCJ",
      "helpful_votes": 0,
      "publication_date": 20170701
    },
    {
      "title": "Works great, looks even better!",
      "text": "I purchased this because my fore finger gets sore clicking the mouse button. It has helps drastically!",
      "rating": 5.0,
      "verified": true,
      "author": "Vj",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Acer T232HL",
      "text": "Love the monitor. It's wide, bright, and touchscreen. Reflective glare doesn't really bother me. When the monitor is on, I don't notice any reflective glare.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronald Gross",
      "helpful_votes": 0,
      "publication_date": 20151006
    },
    {
      "title": "A very good monitor that works well with my 4-port KVM switch ...",
      "text": "A very good monitor that works well with my 4-port KVM switch (with 2 Macs and 2 IBM-compatibles). Because the KVM supports a max resolution of 1920x1080, the lack of higher resolution was not an issue for me.. I also liked the HDMI support, USB connectors and touch screen capability; works great on Windows 7 with the touch screen drivers and also works fine with Linux. Display is clear and crisp, though the instructions for connecting it could use some work. A lot of the manual was in Chinese, and it was not obvious at first which one of the right-edge buttons was the power switch.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Rodriguez",
      "helpful_votes": 4,
      "publication_date": 20141216
    },
    {
      "title": "Five Stars",
      "text": "Easy to install, get started using. Many different connection options that help during different stages of PC building.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob S.",
      "helpful_votes": 0,
      "publication_date": 20170110
    },
    {
      "title": "Spend a little extra, get a lot more",
      "text": "Exactly as described and amazing color and clarity. No question about it, spend the extra 80 bucks and bypass the ViewSonic garbage",
      "rating": 5.0,
      "verified": true,
      "author": "Sweeney",
      "helpful_votes": 0,
      "publication_date": 20160404
    },
    {
      "title": "Works great, looks great, solid product",
      "text": "This monitor is awesome. It responds to touch great, the screen is solid and sturdy, and looks really nice. Perfect addition to my set up.",
      "rating": 5.0,
      "verified": true,
      "author": "JustAFriendFromLA",
      "helpful_votes": 0,
      "publication_date": 20150721
    },
    {
      "title": "Best touch screen monitor",
      "text": "Terrific touch screen monitor. Resolution is better than some non-touch monitors. Easy set-up. Wife's a big gamer with WOW. Fantastic colors. Highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Dave",
      "helpful_votes": 0,
      "publication_date": 20160306
    },
    {
      "title": "Two Stars",
      "text": "Replaced touch screen View Sonic which decided to quit. Unfortunately, touch screen feature on this one does not work.",
      "rating": 2.0,
      "verified": true,
      "author": "Jan G.",
      "helpful_votes": 0,
      "publication_date": 20180626
    },
    {
      "title": "Five Stars",
      "text": "Love the touch screen and the colors are the best I have seen in a monitor",
      "rating": 5.0,
      "verified": true,
      "author": "Barry",
      "helpful_votes": 0,
      "publication_date": 20160408
    },
    {
      "title": "Awesome, connecting the wires is not clear in the ...",
      "text": "Awesome, connecting the wires is not clear in the instructions nor is the specific order of things. Getting the sound to work took instructions from an internet forum- it might have been microsoft.",
      "rating": 5.0,
      "verified": true,
      "author": "michael stjohn",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "No more squinting!",
      "text": "I was at the point where sometimes I needed my reading glasses to see my monitor -- but, on other days, I didn't. My aging eyes are just at the stage where getting them to focus properly is a constant struggle. So, along with a new pc, I treated myself to this monster monitor and am so very glad I did. I also purchased Ergotron LX Desk Mount LCD Arm, Tall Pole (45-295-026)to hold the monitor. This setup is great because, with the monitor up off of the desk, I have substantially more work area. The monitor provides a LARGE crisp display. Not using my glasses at my pc any longer. Heavenly!",
      "rating": 5.0,
      "verified": true,
      "author": "Carrie",
      "helpful_votes": 17,
      "publication_date": 20140210
    },
    {
      "title": "27\" Touch Screen Monitor - Very clear and crisp images",
      "text": "This monitor is exactly what I wanted. Touch screen is sensitive and very easy to use.",
      "rating": 5.0,
      "verified": true,
      "author": "firedog83",
      "helpful_votes": 0,
      "publication_date": 20150607
    },
    {
      "title": "Has everything I want...",
      "text": "...except 4K! Bright accurate image (after calibration, like any monitor). Ten point touch screen and USB3.0 ports work well. Especially like the ability to change the vertical angle of the monitor easily.",
      "rating": 5.0,
      "verified": true,
      "author": "Greg Brown",
      "helpful_votes": 0,
      "publication_date": 20140115
    },
    {
      "title": "Didn’t receive product",
      "text": "If I could give a zero I would. I didn’t even receive the computer. I place of the computer we’re painting canvases. Don’t buy!",
      "rating": 1.0,
      "verified": true,
      "author": "Sareena Mum",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Five Stars",
      "text": "Great monitor really love it the touch works well wished I had bought the bigger size though",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160430
    },
    {
      "title": "Would have been 5 stars if higher resolution",
      "text": "I really like this monitor, although after using my new Lenovo Touch 2 Pro 13.3 Ultrabook with 3200x1800 resolution, I would expect better resolution for the size of this monitor. But for the price it was a good value. Picture quality is actually very good considering the resolution. The touch screen works flawlessly. I would recommend this to a friend.",
      "rating": 4.0,
      "verified": true,
      "author": "dscotta",
      "helpful_votes": 8,
      "publication_date": 20140405
    },
    {
      "title": "Great for my church's sound team. Used for a digital soundboard interface",
      "text": "works like a charm for a digital soundbard. paired with a intel i5 with 12gb of ram and running the Presonus StudioLive RM32ai with no problem.",
      "rating": 5.0,
      "verified": true,
      "author": "Justin Davidson",
      "helpful_votes": 0,
      "publication_date": 20151112
    },
    {
      "title": "I'm using TurboCad with two of these on WIN8 with ...",
      "text": "I'm using TurboCad with two of these on WIN8 with extended desktop and it is spectacular! Tou can get a lot of stuff on this screen and it's sharp.",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen Michael",
      "helpful_votes": 0,
      "publication_date": 20150117
    },
    {
      "title": "Makes windows 8 bearable.",
      "text": "Crystal clear, HD image, very responsive and accurate multi-touch. If you are less than happy with the new windows 8 interface, a touch screen will change your mind.",
      "rating": 5.0,
      "verified": true,
      "author": "Nathan Upchurch",
      "helpful_votes": 0,
      "publication_date": 20150222
    },
    {
      "title": "Four Stars",
      "text": "Excellent display qualiity. However, the touch screen sensitivity is not what I would prefer.",
      "rating": 4.0,
      "verified": true,
      "author": "twice99",
      "helpful_votes": 0,
      "publication_date": 20151204
    },
    {
      "title": "Attractive, Good Performance, Plug 'n Play with Windows 8.1 with One Usability Flaw",
      "text": "Attractive design, good performance. No issues with using touch with Windows 8.1. It was Plug 'n Play. The only issue so far is what others have pointed out. The power button is on the lower right hand side of the display - right where you grab the display to tilt the display. Oh yes, titling the display takes nerves of steel because the amount of pressure you have to exert feels like you're going to break something. The speakers are functional; however, don't expect Bose quality from them.",
      "rating": 4.0,
      "verified": true,
      "author": "Gerald",
      "helpful_votes": 3,
      "publication_date": 20150213
    },
    {
      "title": "Touchscreen function does not work on my Windows 10 PC",
      "text": "I had multiple issues with this monitor. First, I was not able to get the monitor to work with HDMI on my Lenovo PC. I had to revert to VGA with an HDMI adapter (which of course I had to supply). Once I got the monitor to come on I discovered that the touchscreen function wouldn't work. I attempted to contact Acer customer support, but gave up when the only customer support numbers I could find were long distance to India. I sent this monitor back and will buy one from another company.",
      "rating": 1.0,
      "verified": true,
      "author": "David M. Powers",
      "helpful_votes": 2,
      "publication_date": 20170127
    },
    {
      "title": "I love it",
      "text": "Beautiful touchscreen monitor and fun to use. I highly recommend this product.",
      "rating": 5.0,
      "verified": true,
      "author": "John Cowens",
      "helpful_votes": 2,
      "publication_date": 20140730
    },
    {
      "title": "The glossy finish ruins it",
      "text": "Great monitor and touchscreen functionality. Glossy finish creates horrible glare.",
      "rating": 3.0,
      "verified": true,
      "author": "Giancarlo",
      "helpful_votes": 0,
      "publication_date": 20171023
    }
  ],
  "product_meta": {
    "title": "Acer T272HL bmjjz 27-Inch (1920 x 1080) Touch Screen Widescreen Monitor, Black",
    "description": "Style:Full HD (1920 x 1080)| Size:27-InchExplore more on the Acer T-Series LCD featuring 10-point multi-touch technology on sleek edge-to-edge glass. This intuitive and fun LCD lets you take advantage of Windows 8 touch features and navigate web pages, flick through photos, paint and play games - all with your finger tips! Full HD resolution, incredible 100 Million : 1 contrast ratio and rapid 5ms response time highlight the advanced technology of this display. Connect to your devices via DVI or HDMI ports so you can instantly enjoy marvelous 1080p entertainment at home. On top of that this incredible design with edge-to-edge screen creates a floating design and looks amazing in any room or even hanging on the wall.",
    "rating": 4.2,
    "feature_bullets": [
      "This intuitive and fun LCD with 10-point touch screen lets you take advantage of touch features and navigate web pages, flick through photos, paint and play games - all with your finger tips!",
      "This large 27\" edge-to-edge widescreen display (1920 x 1080 resolution) brings the best viewing experience of Full High-Definition content",
      "With VGA, DVI & HDMI (MHL) inputs so you can easily power and extend the enjoyment from your smartphone or tablet on Full HD display. Connect a mobile device like a smartphone or media player to this monitor and play content from the mobile device without having to do any setup procedures.",
      "Brightness:300 nit"
    ],
    "specifications": {
      "Standing screen display size": "27 Inches",
      "Max Screen Resolution": "2560 x 1440",
      "Graphics Card Ram Size": "1 GB",
      "Brand": "Acer",
      "Series": "UM.HT2AA.003",
      "Item model number": "T272HL bmjjz",
      "Item Weight": "15.7 pounds",
      "Product Dimensions": "25.9 x 1.9 x 19.4 inches",
      "Item Dimensions  LxWxH": "25.9 x 1.9 x 19.4 inches",
      "Color": "Black",
      "Processor Count": "1",
      "Flash Memory Size": "1",
      "Hard Drive Interface": "ESATA",
      "Hard Drive Rotational Speed": "1 RPM",
      "Optical Drive Type": "No Optical Drive",
      "Manufacturer": "Acer",
      "ASIN": "B00G5AF1S0",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "November 1, 2013",
      "Customer Reviews": "4.2 out of 5 stars309 ratings4.2 out of 5 stars",
      "Best Sellers Rank": "#20,776 in Electronics",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Monitors",
      "Computers & Accessories",
      "Electronics"
    ],
    "price": 409.99
  }
}