{
  "website_summaries": [
    {
      "verdict": "Portable, wearable vacuum makes powerful cleaning possible no matter where you are.",
      "pros": [
        "10-quart container",
        "Designed to be whisper quiet and perfect for classrooms and offices",
        "Powerful four-level filtration system",
        "50-foot cord",
        "Received gold-level certification by the Carpet and Rug Institute",
        "Only weighs 11 pounds",
        "Comes with a commercial kit full of detailing tools"
      ],
      "cons": [
        "This fully featured model is an expensive option for a vacuum"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "The hose!",
      "text": "I have been using this brand of backpack vaccum for 3 years,5 days a week, 2 hours is the most I would use it each day. The vaccum itself is good,but the hose that is connected to the vaccum keeps breaking off, and it's so anotying that you have to keep snapping it back on and it's really time consumming. In the past 3 years I've used 5 of this vaccum with the same problem ( same brand but different models). It seems as if the company has ignored the costumers reviews and I've decided to go with a different brand.(I have pictures to prove) I'm disappointed because I loved the brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Nina",
      "helpful_votes": 54,
      "publication_date": 20181223
    },
    {
      "title": "The vacuum itself works great, however",
      "text": "The vacuum itself works great, however, there is a flaw in the end of the telescoping wand that holds the tools on in that it does not \"grab\" the tool and allow you to screw it on tightly, which means tools fall off a lot. I kinda figured out how to use suction to keep them on and then I ordered two more wands to keep in different locations as they are a pain to move around when not vacuuming, and lo and behold one of the two extra telescoping wands I purchased works as it should (world of difference) and the other one does not. So 2 out of 3 telescoping wands don't hold the tools on.",
      "rating": 3.0,
      "verified": true,
      "author": "MHM",
      "helpful_votes": 59,
      "publication_date": 20180219
    },
    {
      "title": "Very Disappointed",
      "text": "We needed a vacuum for all floor types and one that could tackle pet hair. This could not pick up pet hair. This vacuum was not easy to use and was not comfortable to put on. The harness was cheaply made and could not handle the weight of the vacuum. I felt as if I was being choked. Although, it had suction, the attachments kept falling off of the wand. We returned it. Don't waste your time buying it.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 52,
      "publication_date": 20181004
    },
    {
      "title": "Great vacuum if you have a hardwood floors in your ...",
      "text": "Great vacuum if you have a hardwood floors in your house., makes it a lot easier and faster to clean. I've been using them for last 10 years commercially to clean offices I only went through two of those, still using the second one, as long as you change bags on time and filters, but now I got one to clean our home, had it about for one month works as advertised!!!! But for those who's doing research on them; 1) Vacuum kind of on the heavy side, 2) Afterwhile your back starts sweating because vacuum blows out warm air at the bottom of it,",
      "rating": 5.0,
      "verified": true,
      "author": "bogdan voznyuk",
      "helpful_votes": 37,
      "publication_date": 20160613
    },
    {
      "title": "What else would you strap to your back",
      "text": "if you are a professional cleaner this is your floor machine. Outside of high pile carpet this will do it all. I recommend the floor brush attachment as it will remove and corral more debris on hard floors while stimulating carpet fibers to remove more dirt on rugs. Also the x over floor tools scratches the hell out of floors so get the brush",
      "rating": 5.0,
      "verified": true,
      "author": "C. Noonan III",
      "helpful_votes": 52,
      "publication_date": 20150313
    },
    {
      "title": "More of a hassle then worth",
      "text": "For the price of this vacuum I expected to have the “Porsche” of all vacuums! However I have used this twice for cleaning a business and swear it took me twice as long just fighting with cord that got caught in everything. I knew it was long but figured it had something to hook it to so you were in control of how much was loose. Then the house adapters are not easily changeable. The black part of the hose kept breaking- again after paying this price for vacuum not even an hour into using it there should not be anything breaking!! Very disappointed 😔",
      "rating": 1.0,
      "verified": true,
      "author": "Megan",
      "helpful_votes": 6,
      "publication_date": 20200118
    },
    {
      "title": "Not great",
      "text": "Sorry I bought this vacuum. Cheap hose and keeps coming off of the pole that holds the brush. Had to buy a different hose, and it still doesn't stay on. For the price, I'm extremely disappointed. I should have sent it back. A $400.00 mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "Robert E. Relle",
      "helpful_votes": 5,
      "publication_date": 20200330
    },
    {
      "title": "the connecting cord should have where to roll in the vacuum",
      "text": "buy one 4 months ago. and my experience has not been good with this vacuum cleaner. It needs more suction force. disappointed with the product. I find it expensive for the weak and not workable, it has no where to wind the rope on the back of the vacuum cleaner, it can not be separated into 2 parts the aluminum tube, it is fastened with pressure and a screw. The part that is used to clean the wooden floors leaves streaks on the floors. I really do not recommend it. It is uncomfortable and very soft in suction.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 7,
      "publication_date": 20190330
    },
    {
      "title": "Best purchase of my career.",
      "text": "Love this vacuum. I work in construction, so wheeling around a shop vac is A PAIN. This thing takes care of dust, drywall, and saw dust. It’s the best purchase I’ve made so far. All of my clients appreciate a clean job site after a long, messy day. It’s hepa filter is no joke. I can be busting up tile and have it collect dust. Affordable parts and filters. What more could you ask for.",
      "rating": 5.0,
      "verified": true,
      "author": "Gerald Barker",
      "helpful_votes": 3,
      "publication_date": 20181201
    },
    {
      "title": "Best central vac substitutes",
      "text": "Had mine for a month so far I love it. I had a home where I was spoiled with a central vac and was worried when I had to move into an older home I wouldn't find a good vacume replacement for the central vac. This is a great substitute! Love the long wand and the freedom to move around the house and vacume stairs without a bulky push vacume bumping walls and such. Good suction and easy to use. It's not heavy at all on my back.",
      "rating": 5.0,
      "verified": true,
      "author": "Mykle Whiting",
      "helpful_votes": 2,
      "publication_date": 20180726
    },
    {
      "title": "Died three months in",
      "text": "Absolute garbage. Vacuum completely died (wouldn't even switch on) after 3 months of light use. Manufacturer refused to refund purchase. DO NOT BUY ProTeam products.",
      "rating": 1.0,
      "verified": true,
      "author": "J. Lewis",
      "helpful_votes": 3,
      "publication_date": 20191216
    },
    {
      "title": "it ok",
      "text": "I am a professional house keeper, and I use this every day, the only thing that I don’t like about this are as follow: Back path is not comfortable to thin The top the vacuum have the tendency to open up and you loose suction, and you must take of the vacuum and tide again and put back again The black tuve also get lose often",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20190505
    },
    {
      "title": "Works Good",
      "text": "I work as a school custodian and this was the vacuum I used for 3 years, never really realized how great it was until I transferred to a new district that had nothing but push vacuums.. I had to order one of these for personal use. Not only will it save you frustration when vacuuming a room with lots of chairs/tables, but it honestly does a better job with suction and allows you to approach things from a multitude of angles.",
      "rating": 5.0,
      "verified": true,
      "author": "Ruben",
      "helpful_votes": 0,
      "publication_date": 20191128
    },
    {
      "title": "Solid vacuum",
      "text": "Solid vacuum, as you would expect from a product meant for commercial use. A disappointment is the cheap plastic hose that comes with it. After a year of light home use the plastic hose snapped in half near where it attaches to the metal handle. It's $27 to replace the hose, which isn't a lot, but it really should be able to stand up to light household use better than that. Edit: As discussed below, the swivel cuff can come unscrewed. which looks like a break. When screwing it back on note that the threading requires turning the cuff to the left to tighten, not to the right as you might expect.",
      "rating": 4.0,
      "verified": true,
      "author": "S. Holmes",
      "helpful_votes": 9,
      "publication_date": 20170828
    },
    {
      "title": "So easy to use with mobility problems",
      "text": "I love this vacuum. I could never manage our upright floor vacuum because of terrible nerve tension. It was too heavy and difficult to maneuver. This is so easy on my arms and hands, putting all the weight squarely on my hips. I use it for floors, shelves, walls, ceilings, fans, wood trim, and just any dusty surfaces.",
      "rating": 5.0,
      "verified": true,
      "author": "C. Naquin",
      "helpful_votes": 0,
      "publication_date": 20200425
    },
    {
      "title": "Good for Commercial Only",
      "text": "My husband and I thought of using a vac-pac to keep our floors and surfaces clean behind our golden-doodle. I can't say it was horrible. But way more cons than pros. The only pro was that it has good suction. The cons list: not good for back (started having back paiins), easily bumps into walls and doorways, hard to change head options). After this, I went over to a Bissell cordless and am loving it.",
      "rating": 3.0,
      "verified": true,
      "author": "Susan Pickett",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "great very handy for cleaning my car and studio",
      "text": "great very handy for cleaning my car and studio, helped deal with a dust mite problem very well",
      "rating": 5.0,
      "verified": true,
      "author": "ac",
      "helpful_votes": 3,
      "publication_date": 20180322
    },
    {
      "title": "Used Vacuum",
      "text": "This was way too much money for a used vacuum. It arrived with the box having tape on top of tape as it had been opened. There was a vacuum bag already in it. The cord was dirty. Dirt and hair was in the hose. I was extremely disappointed. Don't purchase unless you want a used vacuum.",
      "rating": 1.0,
      "verified": true,
      "author": "Scott Beckman",
      "helpful_votes": 2,
      "publication_date": 20200622
    },
    {
      "title": "IT SUCKS!!! In a good way....",
      "text": "Incredibly strong suction. It seems as though this is an actual HEPA filter unlike the particulate filters on some vacuums. That's why it costs more. My sisters house was in the Middletown fire area and she used this unit, and still uses it, to clean her house and property from windblown Ash that may have asbestos in it. It works great but in the house you need to get used to the idea that you have this bulky thing on your back that can knock over lamps, picture frames etc. not overly heavy either. We like.",
      "rating": 4.0,
      "verified": true,
      "author": "30 Weight",
      "helpful_votes": 3,
      "publication_date": 20160219
    },
    {
      "title": "great suction some plastic parts aren't made well but overall I love my vacuum",
      "text": "the plastic nut that attaches the wand aluminum handle to the bottom piece that goes over the floor cracked first use. it is cheap plastic. but amazon refunded my money for the part and i ordered another one. it isn't to heavy. I am five feet three inches 160 pounds in poor health and I can use it just fine. the suction is excellent. best vacuum i bought so far. I use it for my home. I have COPD so I need a good vacuum.",
      "rating": 4.0,
      "verified": true,
      "author": "Debbie Al-Harbi",
      "helpful_votes": 0,
      "publication_date": 20191008
    },
    {
      "title": "Great vacuum!",
      "text": "Awesome suction for hard floors. Don't think it would do good on long fiber carpets maybe could get away with using for the very short office type carpet. Cleans hard floors really well and easy to carry around. Convenient. Long enough cord and durable. Extra accessories are a plus and helpful for all jobs. Been using it for a few months now at commercial properties and it gets the job done in half time as if you were having to drag along a vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Ivana",
      "helpful_votes": 3,
      "publication_date": 20160724
    },
    {
      "title": "Five Stars",
      "text": "ordered it for my mom's cleaning business. this was definitely a game changer. she loves it",
      "rating": 5.0,
      "verified": true,
      "author": "SILVIA",
      "helpful_votes": 4,
      "publication_date": 20180806
    },
    {
      "title": "Poorly Conceived and Executed",
      "text": "This is one to avoid. Flexible hose does not stay in the wand. Cleaning attachments are difficult to get to stay firmly attached to wand. Must buy attachment that has felt on the bottom to get it to clean hardwood effectively at all..will not otherwise pick up smaller particles - just moving the dust around. No handle on the top to move it around when not sensible to put it onto back...etc. This is an example of a product that the engineers/designers themselves must not use.",
      "rating": 2.0,
      "verified": true,
      "author": "Sean",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Exceeds High Expectations!",
      "text": "Even better than expected! The wife loves it too - was worried since she is relatively small that 10 qt was too big, She loves it! The tools and setup are just super useful and it works exactly as expected if not better! I am a homeowner - large house - and I find it substantially reduces time to do vacuuming. We have a lot of tile and it does such a good job it almost seems like it polishes the wood tile floor! LOVE IT!!",
      "rating": 5.0,
      "verified": true,
      "author": "Uwe Beltz",
      "helpful_votes": 0,
      "publication_date": 20180725
    },
    {
      "title": "Floor attachment - You need to twist the connector a good 1/4 to 1/2 turn once tight",
      "text": "So I received this yesterday, unpacked it this morning. Pretty straight forward; However the floor tool did not securely attach at first. The instructions state “Align the brass ring with the indention on the floor took to ensure a secure fit”. Well that is great except there is 1/16 inch (roughly) of space between the brass ring and the indention so, subsequently, the floor tool constantly falls of while in use...Unless you tighten down the connector to compress down the brass ring, once this is done the vacuum is awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "celticknot",
      "helpful_votes": 0,
      "publication_date": 20200401
    },
    {
      "title": "I like this vacuum cleaner.  I'm NOT a professional, home use only.",
      "text": "Excellent vacuum cleaner. A lot of suction. Well made. Comfortable on back. Easier than pushing a big vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Intelligence",
      "helpful_votes": 0,
      "publication_date": 20191021
    },
    {
      "title": "Too heavy to lug around.",
      "text": "Hate Hate Hate it. It is too big. Too heavy. Too cumbersome. I was so excited to get a back pack vacuum to be able to get around my entire house. I am so disappointed. It is nothing like I wanted.",
      "rating": 1.0,
      "verified": true,
      "author": "Jean Adams",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Save Time / Vacuum Better",
      "text": "Better suction than anything else I have owned including the Ridgid 14-gal. Professional Wet/Dry 6 hp Vacuum. Definitely get the ProTeam 14 Hard Floor Tool  Or you will scratch hardwood floors; i did with the included floor tool.",
      "rating": 5.0,
      "verified": true,
      "author": "Virgil J Markwood",
      "helpful_votes": 8,
      "publication_date": 20141211
    },
    {
      "title": "would be nice if there were better attachments included, and a way to easily store and carry them",
      "text": "Overall it works well and has met my expectations except for the somewhat odd connection for attachments and rather poor included attachments. a nice brush head would be good to have.",
      "rating": 4.0,
      "verified": true,
      "author": "TX gadget nutTop Contributor: Smart Home",
      "helpful_votes": 0,
      "publication_date": 20200816
    },
    {
      "title": "Seriously awesome vacuum",
      "text": "We have very large dogs who shed quite a bit. All other vacuums failed at the task. Constantly having to unclog all the hoses or pull the hair out of the brush head wrapped around the brush wheel. This vac has more suction than my shop vac. Best tool for the house hands down.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190912
    },
    {
      "title": "Overall great product",
      "text": "Is a little heavy after awhile Suction is good wish it had a little more power but is an overall great product. First backpack vac I have bought for cleaning company.",
      "rating": 4.0,
      "verified": true,
      "author": "Scott Anderson",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Great and easy to use.",
      "text": "Great product makes my job a lot easier! Only wish the would make the carpet roller on a bigger size maybe a 15-20” and it would totally be the perfect vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Luis Paniagua",
      "helpful_votes": 0,
      "publication_date": 20191112
    },
    {
      "title": "Well equipped",
      "text": "All the parts on this back vac are high grade made for pros ready to rock durable stuff. Could do post construction cleaning or normal everyday maintenance with it and the filter is probably good enough for lead safe practices for drilling with a shroud.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob Potvin",
      "helpful_votes": 0,
      "publication_date": 20190703
    },
    {
      "title": "Great Product. Powerful and easy to use!",
      "text": "AWESOME! Works just as well as everyone says. Love it. It is heavier. I am fine with it but my wife will never use it. She doesn't vacuum anyway so it's really for me and it is the best vacuum I have ever had.",
      "rating": 5.0,
      "verified": true,
      "author": "Ray Nguyen",
      "helpful_votes": 3,
      "publication_date": 20150814
    },
    {
      "title": "Decent Suction, but Plastic Parts are Flimsy",
      "text": "The product is ok, but beware that nearly all the parts are in flimsy plastic. It's fine for certain items, but my hose has already broken in two places, and I've only used the vacuum a handful of times. If I could do it again, I'd buy a different brand.",
      "rating": 3.0,
      "verified": true,
      "author": "Steph",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "Very messy as the cap is not firmly secured.",
      "text": "We got this vacuum thinking it will speed our services, but it happened the opposite. Dust fall all over the place, the Parts are not well connected and dust will spread . Don’t recommend at all.",
      "rating": 1.0,
      "verified": true,
      "author": "Climeria",
      "helpful_votes": 0,
      "publication_date": 20200709
    },
    {
      "title": "Very quite, powerful suction, easy to maneuver",
      "text": "The ProTeam vacuum was easy to connect and start using immediately. The attachments are great for making specific jobs easy. I use this for commercial cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200630
    },
    {
      "title": "Love it!",
      "text": "The suction on this thing will lift the carpets up! Also it is pretty cool to feel like a Ghostbuster.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy G.",
      "helpful_votes": 0,
      "publication_date": 20200911
    },
    {
      "title": "Love it!",
      "text": "There was definitely a learning curve getting the nozzle on the first time but after that it was easy cleaning. They power is great.",
      "rating": 5.0,
      "verified": true,
      "author": "904Fitness",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Good for work.",
      "text": "I use this in my cleaning business. I is a little awkward for transporting to different jobs but is nice for easily getting under desks, etc. It takes a little while to get used to moving around with it on your back and not running into things in tight spaces but it has good suction and is easy to use attachments.",
      "rating": 5.0,
      "verified": true,
      "author": "Jon",
      "helpful_votes": 9,
      "publication_date": 20130205
    },
    {
      "title": "Works great. A little cumbersome to get on",
      "text": "Works great. A little cumbersome to get on, but very easy to carry once on. The extra bulk can make it difficult to get into narrow areas. Was missing a very small part essential to connecting tools when it arrived. I got the part from a local vacuum repair shop for about $3.",
      "rating": 4.0,
      "verified": true,
      "author": "Stuart G.",
      "helpful_votes": 0,
      "publication_date": 20180910
    },
    {
      "title": "The best! Worth every penny",
      "text": "Amazing!! I own a gym and needed a unit that was gonna save me time cleaning. This is the very best! Hands down I was able to go from 2 hours using a professional shark vacuum to 45/50 minutes! Loved it!",
      "rating": 5.0,
      "verified": true,
      "author": "David",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "Not a fan.",
      "text": "Didn't work for our cleaning company. We do residential homes and vacation rentals. Too bulky and heavy for any of our people to use. Marked up the walls by accidentally hitting as you turn..",
      "rating": 2.0,
      "verified": true,
      "author": "L. Jones",
      "helpful_votes": 0,
      "publication_date": 20180509
    },
    {
      "title": "Great suction!",
      "text": "This vacuum cleaner has great suction power and covers a lot of open area quicker, but very inconvenient for residential cleaning especially in small areas.",
      "rating": 5.0,
      "verified": true,
      "author": "Lou",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "Works Good",
      "text": "Love the suction on this vacuum. The handles are a bit tricky to get on and get used to using but overall pretty good. Even though I have found other backpacks on Amazon for the half the price that work just as great I just had to try this one as I always hear Pro Teams are good. I'm sure it'll last a long time.",
      "rating": 5.0,
      "verified": true,
      "author": "Zuiri",
      "helpful_votes": 0,
      "publication_date": 20181121
    },
    {
      "title": "Fantastic vacuum! Much more powerful",
      "text": "Fantastic vacuum! Much more powerful, versatile and maneuverable than a conventional unit. I opted for this vs a traditional vacuum for my home and havent regretted it once.",
      "rating": 5.0,
      "verified": true,
      "author": "nerd",
      "helpful_votes": 0,
      "publication_date": 20170906
    },
    {
      "title": "Awesome product.",
      "text": "Bought for our cleaning company. Someone recommended this for our business & we love it. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Clean & Sharp LLC",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "Great vac",
      "text": "Bought it for the HEPA feature and it works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Breeze Enterprises",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "Very satisfied with this product.",
      "text": "So far I had this product for over two months and it’s been great I waited around to do the review to make sure that this product is going to work. So far I’m very happy with the product is working awesome.",
      "rating": 5.0,
      "verified": true,
      "author": "Único ",
      "helpful_votes": 0,
      "publication_date": 20191225
    },
    {
      "title": "They work great",
      "text": "My son has 2 already. He loves them. He used them at work.",
      "rating": 5.0,
      "verified": true,
      "author": "sheila z.",
      "helpful_votes": 0,
      "publication_date": 20200723
    },
    {
      "title": "watch out it sucks! i mean it in a good way",
      "text": "watch out it sucks! i mean it in a good way. ergonomic enough, wish handle was more adjustable a little too long on stairs.",
      "rating": 5.0,
      "verified": true,
      "author": "Kostik",
      "helpful_votes": 0,
      "publication_date": 20170809
    },
    {
      "title": "wonderful vacuum, however the hose isnt the greatest after ...",
      "text": "wonderful vacuum, however the hose isnt the greatest after 3 uses it broke at the connection point. I am hoping the company offers a replacement hose of a better quality. that is the only downside. EVERYTHING ELSE IS GREAT!!!",
      "rating": 4.0,
      "verified": true,
      "author": "Brandie Kay",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Worth every penny",
      "text": "I've now bought TWO of these amazing Vacuums. One for my home and one for my office. THANK YOU!",
      "rating": 5.0,
      "verified": true,
      "author": "Miranda Phillips",
      "helpful_votes": 0,
      "publication_date": 20171023
    },
    {
      "title": "Five Stars",
      "text": "I love my back pack vaccum! My daughter tried it and she exclaimed: Mom! It keeps my back Straight!!",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie",
      "helpful_votes": 0,
      "publication_date": 20171106
    },
    {
      "title": "THIS IS ABSOULTELY THE BEST COMMERCIAL VACUUM I EVER HAVE PURCHASED",
      "text": "THIS IS ABSOULTELY THE BEST COMMERCIAL VACUUM I EVER HAVE PURCHASED ! I CANT EXPRESS HOW EFFICENT THIS VACUUM IS AND IT IS VERY POWEFUL . I HAD TO SANITAIRE BACK PACKS AND I HAVE TO SAY THE PERFORMANCE OF THIS VACUUM IS UNBELIEVABLE IT GETS THE JOB DONE!",
      "rating": 5.0,
      "verified": true,
      "author": "Toni",
      "helpful_votes": 2,
      "publication_date": 20160406
    },
    {
      "title": "vacuum is great wish it had come with the soft brush head ...",
      "text": "vacuum is great wish it had come with the soft brush head for my tile and wood floors.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel Koetje",
      "helpful_votes": 2,
      "publication_date": 20180327
    },
    {
      "title": "LOVE LOVE LOVE it",
      "text": "I have used these backpacks before when I cleaned new construction. I knew they were a good investment so I went with it and I am not disappointed!! The warranty is great, the product is great! The only thing I would change is it should come with a bristled brush for hardwood floors. Shipping was super fast! I love this thing.",
      "rating": 5.0,
      "verified": true,
      "author": "Miss M",
      "helpful_votes": 2,
      "publication_date": 20150306
    },
    {
      "title": "5 star vaccum",
      "text": "This is the most powerful vacuum I've ever owned. I like that you can reuse the bags several times before replacing with a new one. It is also quite comfortable for all different sizes of people. It adjust easily from one person to the next.",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Wife and kids like using it!",
      "text": "IT IS AWESOME. Wish it had a longer hose. Power cord is long enough to get to multiple rooms.",
      "rating": 5.0,
      "verified": true,
      "author": "SLSG Soccer",
      "helpful_votes": 0,
      "publication_date": 20180529
    },
    {
      "title": "Excellent machines. Used this brand for nearly 20 years",
      "text": "Excellent machines. Used this brand for nearly 20 years, and these outlast competitor's brands 3 to 1.",
      "rating": 5.0,
      "verified": true,
      "author": "AllInTheDetails",
      "helpful_votes": 0,
      "publication_date": 20171101
    },
    {
      "title": "Not good if you want to use on carpet.",
      "text": "Works great on hardwood, tile and marble floors. Does not work on carpet. It’s a lot heavier than I expected. Kind of awkward to use. But it does get those pesky spiders near the ceiling and high corners.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200517
    },
    {
      "title": "The back pack has great suction but the padding in the stfaps are very ...",
      "text": "The back pack has great suction but the padding in the stfaps are very thin which makes it very uncomfortable.",
      "rating": 3.0,
      "verified": true,
      "author": "Princess Zakiyah",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Uncomfortable",
      "text": "Dislike-gets hot warm on your back, the wand needs a grip or handle to be able to hold it better, needs different attachment more of a circle or just a bigger opening. I want be using it much at all. If I could return I would.",
      "rating": 2.0,
      "verified": true,
      "author": "Pamela Northcutt",
      "helpful_votes": 0,
      "publication_date": 20190412
    },
    {
      "title": "Awesome suction power",
      "text": "Love this vacuum for hardwood floors! Very lightweight and easy to use",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy B",
      "helpful_votes": 0,
      "publication_date": 20190507
    },
    {
      "title": "The power",
      "text": "Very good product but am 5 2 I think it's not for me my son loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Angelita Brown",
      "helpful_votes": 0,
      "publication_date": 20190823
    },
    {
      "title": "powerful",
      "text": "Very powerful, hope will work for long . Had ProTeam Commercial Backpack Vacuum before for about 6 years , was very happy with it .",
      "rating": 5.0,
      "verified": true,
      "author": "Elena V.",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Needs work",
      "text": "The vacuum is fine but the attachments are horrible. They are hard to get on and then fall off too easy. The telescoping wand needs just a straight attachment it’s curves make if cumbersome to maneuver",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200825
    },
    {
      "title": "CHEAP ATTACHMENTS",
      "text": "Cheap plastic attachments. Stripped threads changing from brush to hard floor surface attachments. Always difficult changing out attachments. Finally broke -- not even a year old!!",
      "rating": 2.0,
      "verified": true,
      "author": "cindy d.",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Life and time saver",
      "text": "It is so easy and fast to cover large areas with it. Lightweight and comfortable to work with. The suction power is awesome!!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeffrey J. Collazo",
      "helpful_votes": 0,
      "publication_date": 20200105
    },
    {
      "title": "Attachments lacking quality",
      "text": "The vacuum is great, but quality is lacking. The hose connecting the vacum to the wand broke after the 3rd use. It split at the cuff. I’ll be calling the company to see how their customer service is!",
      "rating": 3.0,
      "verified": true,
      "author": "AEK",
      "helpful_votes": 0,
      "publication_date": 20190407
    },
    {
      "title": "PROTEAM VACUUM IS THE BEST VACUUM EVER ON TODAY\"S MARKET.",
      "text": "There is no other Vacuum that will top ProTeam Backpack Vacuum. I LOVE IT. WELL WORTH THE $$$$ SPENT",
      "rating": 5.0,
      "verified": true,
      "author": "Romina Brakhia",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Five Stars",
      "text": "Not hard to use... it can go anywhere. It has its own LONG cord to plug it it.",
      "rating": 5.0,
      "verified": true,
      "author": "S. Downs",
      "helpful_votes": 0,
      "publication_date": 20151130
    },
    {
      "title": "We have 2 of these vacuums..",
      "text": "My husband uses this vacuum at work to clean carpeted steps...works great..saves alot of time to.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Gonzales",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Excellent product",
      "text": "We use this at church - cleaning crew loves it!",
      "rating": 4.0,
      "verified": true,
      "author": "J Haygood",
      "helpful_votes": 0,
      "publication_date": 20200306
    },
    {
      "title": "I would buy it again if needed!!",
      "text": "this is my hero. great for all non typical areas and any projects.",
      "rating": 5.0,
      "verified": true,
      "author": "Bladesj",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "This thing is awesome",
      "text": "This machine cut my Vacuum time in half. Super powerful suction. I can clean the floors and hit the windows and even ceiling vents as I go.",
      "rating": 5.0,
      "verified": true,
      "author": "Clay Cochran",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "High Dusting",
      "text": "The ProTeam Backpack Vacuums are a great investment, it works great for hard to reach areas and for High Dusting. It works great on hardwood floors, it has a good suction power and is light weight. I will buy another soon.",
      "rating": 5.0,
      "verified": true,
      "author": "BCFS",
      "helpful_votes": 0,
      "publication_date": 20200211
    },
    {
      "title": "Great in all ways",
      "text": "Phenomenal vacuum that does it all. if you are wanting a backpack vac, this is your huckleberry.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt S.",
      "helpful_votes": 0,
      "publication_date": 20200714
    },
    {
      "title": "excellent vacuum for hardwood floors",
      "text": "Works exactly as advertised, excellent vacuum for hardwood floors. No more scratching the wood with the rollers of a traditional vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennie H",
      "helpful_votes": 0,
      "publication_date": 20180402
    },
    {
      "title": "Your only as good as your equipment",
      "text": "Best for removing mold spores from my customers homes after a abatement has been completed.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201030
    },
    {
      "title": "Bad suction",
      "text": "Horrible vacuum! Suction power is very low. For a professional vacuum, this is not at all what I expected.",
      "rating": 1.0,
      "verified": true,
      "author": "Alana Crittenden",
      "helpful_votes": 0,
      "publication_date": 20200912
    },
    {
      "title": "Great for restoration Job !",
      "text": "Great for are Restoration services. Great suction power easy to clean and change bags.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200313
    },
    {
      "title": "Good Vac",
      "text": "Great vacuum with great suction. I do hard wood floors and this vacuum is great.",
      "rating": 5.0,
      "verified": true,
      "author": "ben smith",
      "helpful_votes": 0,
      "publication_date": 20160626
    },
    {
      "title": "works great on hard floors",
      "text": "Use for business but can't help but to use it around the house as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Kim Lampe",
      "helpful_votes": 0,
      "publication_date": 20190513
    },
    {
      "title": "This vacuum doesn't cut corners, it cleans them!",
      "text": "Great vacuum. I never knew why one would need a backpack vacuum, but boy or boy is it convenient in moving about detail cleaning around corners and such.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael P.",
      "helpful_votes": 0,
      "publication_date": 20140706
    },
    {
      "title": "Love this",
      "text": "I have a fitness studio and this is awesome for my gym mats. Light weight and very efficient.",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Rohde",
      "helpful_votes": 0,
      "publication_date": 20190314
    },
    {
      "title": "HEPA filter",
      "text": "No more dust bunnies. Machine is on your back, so everywhere is accessible and convenient. There is no cons to this machine.",
      "rating": 4.0,
      "verified": true,
      "author": "Thanh-nhan N.",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "Perfect vaccum for professional cleaning services.",
      "text": "I really loved this vacuum, but honestly it's a little heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Maria Aguilera",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "great vac cut time and is much better on your ...",
      "text": "great vac cut time and is much better on your back than a regular vac, for the price I wish I did not have to turn around right away and buy a hard floor tool but other than that it works great wish I done it sooner",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah S.",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "Best investment for my business so far.",
      "text": "Kinda bulky for small spaces but otherwise it is awesome on picking up dust and sand grain.",
      "rating": 5.0,
      "verified": true,
      "author": "Cartawong",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "hard to handle it.",
      "text": "I have a cleaning business and it is really hard to work with it.",
      "rating": 2.0,
      "verified": true,
      "author": "Katia Rivero",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Just about the best you can get!",
      "text": "Protean vacuum is the best on the market for large condominium building cleaning.",
      "rating": 5.0,
      "verified": true,
      "author": "T-Topps",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "Want to save time? Buy this!",
      "text": "What an awesome addition to our gym! Such a huge time saver!",
      "rating": 5.0,
      "verified": true,
      "author": "Marc Cox",
      "helpful_votes": 0,
      "publication_date": 20200103
    },
    {
      "title": "excelent",
      "text": "So far it is working perfectly no clogs no issues",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Good Suction",
      "text": "I use this vacuum for construction clean and work really good",
      "rating": 5.0,
      "verified": true,
      "author": "angel",
      "helpful_votes": 0,
      "publication_date": 20190609
    },
    {
      "title": "Is heavy, hard to work with the tube. ...",
      "text": "Is heavy, hard to work with the tube. The brush got broken with the minimum use I regret buying this vacuum.",
      "rating": 2.0,
      "verified": true,
      "author": "Mireya",
      "helpful_votes": 0,
      "publication_date": 20171228
    },
    {
      "title": "Ultimate vacuum.",
      "text": "Excellent buy. Very well made and thought out. Comfortable to use as well. Much more maneuverable than an upright vacuum.",
      "rating": 5.0,
      "verified": true,
      "author": "Daniel L. Shadoin",
      "helpful_votes": 0,
      "publication_date": 20140810
    },
    {
      "title": "Five Stars",
      "text": "I'm very pleased with this vaccum and how easily it makes the overall cleaning job. Great buy no complaints!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160603
    },
    {
      "title": "I'm a 60 year old female and I did not ...",
      "text": "I'm a 60 year old female and I did not find any problems with the weight. The straps and backpack format fit snugly with no slippage. Very powerful. Parts stay on firm as long as you put them in the correct configuration and make sure they are snugly fit. Thinking about getting ride of the canister and uprights.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 4,
      "publication_date": 20150228
    },
    {
      "title": "Not Happy!!",
      "text": "For the amount of money paid, I would have expected more. The hose that connects to the wand is not secure and keeps falling off when vacuuming. Why isn't the connection secure like the connection for the attachments. Also, the floor/carpet head should swivel as I have to bend down in order to have the vacuum head sit flush on the floor. If I stand up straight, the head as at too much of an angle to effectively pick up dirt, etc. Not much to a vacuum from a mechanical perspective, so these little things make the difference. I am not very happy. Should have purchased the ULine vacuum.",
      "rating": 2.0,
      "verified": true,
      "author": "Louis J. Schilt",
      "helpful_votes": 0,
      "publication_date": 20160815
    }
  ],
  "product_meta": {
    "title": "ProTeam Backpack Vacuums, Super CoachVac Commercial Backpack Vacuum Cleaner with HEPA Media Filtration and Telescoping Wand Tool Kit, 10 Quart, Corded",
    "description": "Style Name:7pc Commerical Tool Kit (Telescoping Wand)\n\n<P>The Super CoachVac commercial vacuum backpack is a productivity powerhouse designed to tackle the most demanding cleaning challenges. This powerful, high-filtration unit is ideal for vacuuming high square-footage areas that require the utmost cleanliness including universities, campuses, schools and meeting halls. Built for any cleaning challenge, the Super CoachVac is the perfect tool, providing versatility and performance in a lightweight, compact vacuum backpack.</P><P>The 10-quart Super CoachVac backpack vac features a powerful, 1188-watt, 9.9-amp motor that produces an airflow of 150 CFM and 100-inch static lift. At only 66 dBA, this vacuum backpack is one of the quietest in its class. This commercial backpack vacuum features an ergonomic, adjustable harness that responds to your motion as you're vacuuming for hours of comfortable cleaning. The extra-long 50-foot power cord allows you to clean large areas without having to unplug.</P>\n\n<P>The ProLevel Filtration with HEPA media filter captures and contains dust, allergens, and other particulates to produce cleaner, healthier air.</P>\n<P>This Super CoachVac backpack vacuum cleaner is loaded with accessories to get the job done including a 14-inch Xover multi-surface floor tool, 17-inch crevice tool, 3-inch dust brush, 5-inch upholstery tool, 1-1/2-inch diameter static-dissipating vacuum hose, 1-1/2-inch telescoping wand, 50-foot extension cord and 2 Intercept Micro Filter bags.</P><P>The Super CoachVac vacuum backpack is Carpet and Rug Institute (CRI) Approved and Certified Gold. All ProTeam vacuums qualify for US Green Building Council LEED (Leadership in Energy and Environmental Design) under current requirements.</P><P>For more than 25 years, ProTeam has designed vacuums with durability and quality in mind. These vacuums are low maintenance, long lasting, and feature meticulous workmanship and the finest materials available. Because of its uncompromising quality, ProTeam covers this vacuum with a 3-year warranty on parts, labor and motor and a lifetime warranty on molded body parts.</P>",
    "rating": 4.5,
    "feature_bullets": [
      "Xover Floor Tool - All-in-one tool for low-pile carpets and hard surfaces (not recommended for high pile carpets and delicate wood floors). Voltage: 120V",
      "LARGE CAPACITY - 10-quart filter provides maximum cleaning ability with 3 times the capacity of a standard upright vac making it perfect for large areas",
      "IMPROVED AIR QUALITY - Four Level Advanced Filtration with HEPA media filter to help students and teachers breathe better air; certified Gold by the Carpet and Rug Institute (CRI)",
      "Ideal vacuum backpack for high-traffic areas including schools, universities, and college campuses; the extra-long 50-foot power cord allows for more cleaning with less unplugging",
      "QUIET OPERATION - Not only does this backpack vac include accessories needed for classrooms and campuses, at only 66 dBA, this vacuum is one of the quietest in its class. Filtration : ProLevel Filtration w/ Four Levels of Filtration: 1190 square inch total area"
    ],
    "specifications": {
      "Product Dimensions": "8.5 x 8.5 x 25 inches",
      "Item Weight": "11 pounds",
      "Manufacturer": "ProTeam",
      "ASIN": "B00GM4YKWC",
      "Item model number": "107119",
      "Customer Reviews": "4.5 out of 5 stars497 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#5,032 in Industrial & Scientific",
      "Is Discontinued By Manufacturer": "No",
      "Specific Uses For Product": "Carpet, Hard floors, stairs and Upholstery",
      "Specification met": "Certified frustration-free",
      "Warranty Description": "3 years.",
      "Batteries Required": "No"
    },
    "categories": [
      "Home & Kitchen",
      "Vacuums & Floor Cleaning Machines",
      "Janitorial & Sanitation Supplies",
      "Vacuums",
      "Industrial & Scientific",
      "Canister Vacuums"
    ],
    "price": 390.1
  }
}