{
  "website_summaries": [
    {
      "verdict": "Versatile weight training rack that does it all.",
      "pros": [
        "Exercises chest, shoulders, back, biceps, triceps, and abdomen with multiple workouts"
      ],
      "cons": [
        "Limited safety features"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "This rack offers multiple ways to work out with power at an affordable price.",
      "pros": [
        "Design is fantastic, from the pulley system to the pull-up bar",
        "Excellent value",
        "Allows users to do a variety of different exercises on one machine"
      ],
      "cons": [
        "Instructions aren't the clearest, making assembly difficult"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Excellent rack especially considering price",
      "text": "This rack has met or exceeded my expectations (especially at this price point). It is very sturdy and able to support my weight easily (220#) while doing pull-ups. The finish is nice and is holding up well- I've had it for several months. The Instal was straight forward, but did take 2.5 hrs. A helper is required. The only things that could be improved: the spacing of the holes is a little far making precise bar heights challenging. Also the pulley system for the curl bar is a little tight but not as others described - adds 5 to 10# of resistance max. Overall very pleased!",
      "rating": 5.0,
      "verified": true,
      "author": "Jennifer Sager",
      "helpful_votes": 14,
      "publication_date": 20171106
    },
    {
      "title": "standard cable attachments (use a good lube and realize the swivel angle is limited on ...",
      "text": "The most important thing to remember is that this is a beginner set. The construction is not designed to withstand heavy loads (~400lb) and repeated use without bending/warping. That said, this is the most economical rack w/ accessories I found on the market, and it is designed well enough to last for years. It works well with 7ft Olympic Bars, standard cable attachments (use a good lube and realize the swivel angle is limited on this device), and benches.",
      "rating": 5.0,
      "verified": true,
      "author": "David Burch",
      "helpful_votes": 12,
      "publication_date": 20170219
    },
    {
      "title": "Overall good product for the price paid",
      "text": "Bought this during a long weekend. Was kinda skeptical about the producy and worried abt the safety, but looks like it looks super sturdy and rigid after installing. I read a lot of commmets about screws and bolts not aligning correctly. I too encountered the problem but, they had clearly mentioned to tighten the screws only after everything is assembled. So I did install it correctly and everything fell in place. Also saw a commmet about dip bar too small. I experienced it too. But later it was a mistake I had attached the handles other way round.",
      "rating": 5.0,
      "verified": true,
      "author": "Chet 👍🏿",
      "helpful_votes": 3,
      "publication_date": 20190122
    },
    {
      "title": "Great home gym",
      "text": "I love this little workout cage! It is sturdy and solid built. The instructions booklet could have been little better. It is a little confusing and the steps are not perfect. But once it is put together it is a great home gym that can be used for total body workout. It does not come with weights or bars. I purchased those separately and overall very happy with my purchase decision.",
      "rating": 5.0,
      "verified": true,
      "author": "Shana",
      "helpful_votes": 4,
      "publication_date": 20171010
    },
    {
      "title": "Missing instructions and tools.",
      "text": "The product looks sturdy and it might be nice but it didn’t come with instructions or screws and tools to put it together. I’ll update my review if I get help. I received the screws all thrown unorganized in a box. Thank goodness they have the manual for this machine online. I printed it out to put it together. It was definitely a challenge. This wasn’t a good experience for me at all. The product is okay.",
      "rating": 3.0,
      "verified": true,
      "author": "Michelle Cortez",
      "helpful_votes": 0,
      "publication_date": 20200805
    },
    {
      "title": "Great product",
      "text": "Anyone saying the bolts and stuff were mixed up were not paying attention. If you look carefully they are labeled on the cardboard behind them. The only thing not labeled were the actual structural pieces but it way kind of easy to figure out. The instructions had tiny numbers all over and it was hard to read. The product is great but the assembly was a hassle due to all that. (I had no problem fitting screws in. If someone did they probably were tightening every one before doing the next screw which isn’t the proper way.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon5x",
      "helpful_votes": 0,
      "publication_date": 20190119
    },
    {
      "title": "Great for price.",
      "text": "Purchased for home gym. Extensive assembly required, but diagram provided was very detailed. Can't give five stars: 1. Bolts holding pull up bar are too short. Need to be about 1/4 inch longer Had to leave off washers to install. Seems to be holding up ok. Now. 2. Pulleys are at an angle that makes it awkward to use them for some exercise. Ideal would be pulleys that swivel. 3. Some components are poorly assembled. The screws keep falling off one of the components. Still a great purchase. Much less exoensive than similar machines.",
      "rating": 4.0,
      "verified": true,
      "author": "M. Demartelaere",
      "helpful_votes": 2,
      "publication_date": 20170624
    },
    {
      "title": "Such a great bang for BUCK!",
      "text": "AWESOME! This cage for this price is just AWESOME! My only gripe has nothing to do with the product, but how it was shipped. I think it was bent a little during the shipping process, so while I was putting it together, it didn't come close to lining up. With a little ingenuity, I was able to force the ends together and it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Stephen D. Muraoka",
      "helpful_votes": 2,
      "publication_date": 20170411
    },
    {
      "title": "Need to prepare your tool box",
      "text": "I have been looked at it for months until the price reduced. It works great for me and took 3 hours to assemble it. I really like the pull up bar. I am 5’11 and 186lb, pretty steady! But it would be perfect if they came with tools!",
      "rating": 4.0,
      "verified": true,
      "author": "Troy You",
      "helpful_votes": 0,
      "publication_date": 20181219
    },
    {
      "title": "Perfect for a small area",
      "text": "I'm loving my new home gym. It fits in a small space and pretty much has everything you will need. Couple things I'm not able to do...cable kickbacks unless i use a bench and pull ups are hard because the slant in the bar hits right where my hand width should be which is a bummer but for the price of the gym it works great for a home workout. Putting it together did take some time but it wasn't that bad and it's sturdy.",
      "rating": 5.0,
      "verified": true,
      "author": "CHRISTIAN WALKER",
      "helpful_votes": 0,
      "publication_date": 20190321
    },
    {
      "title": "Happy with my purchase.  Attractive design for small space",
      "text": "This is a nice cage for a small space. Fairly easy to assemble with two people. The pulley system is decent and the squat bars are easy to reposition. However, dont expect to squat too heavy. But it's great for high to moderate volume training. It will definitely get the job done for me while the gyms are closed during the Covid 19 lockdown.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Wessol",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "Good Product at Fair Price",
      "text": "This was easy to build. I put it together on my own just followed instructions and left bolts hand tight and tightening once finished. Took about 2 hours to put together. This was need for my home set up. Have to say its a little tight in the cage to do some of the exercises and the pulleys do not swivel to adjust to angle out of the cage. Also bottom pulley is not fixed so you can't do some exercises like lateral shoulders and seated rows. But it gets the job done. Over all satisfied with price and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "DANIEL O.",
      "helpful_votes": 0,
      "publication_date": 20200906
    },
    {
      "title": "Directions terrible but sturdy product!",
      "text": "I am very pleased with this product. If you are looking for complaints, the only few I have are the directions are terrible! It took me 3.5 hours to put together, but that was without help. It was similar to ikea furniture directions (if not worse). Also if you are looking for the lower cable for leg pulls, the pulley is not stationary. It moves with the rope. The top pulley is stationary though. After complete assembly, this product is very sturdy and heavy duty. Great buy for the price!",
      "rating": 4.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20190122
    },
    {
      "title": "Better than expected",
      "text": "The unit arrived today and was assembled in about 2 hours. Minus a few areas where a socket wrench wouldn't fit, assembly was very easy. The unit feels very sturdy and well built. The only downside i see (and this is a matter of personal preference) Its painted gloss black. I would have liked to have seen a dull or matte finish.",
      "rating": 4.0,
      "verified": true,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20200408
    },
    {
      "title": "Great value! Best purchase this year!!",
      "text": "Best purchase I’ve made this year! The cage is extremely sturdy and still fits in our smaller apartment, the pulley system has normal resistance, and it comes with so many accessories for the cables. Really glad we bought this since all the gyms are closed!",
      "rating": 5.0,
      "verified": true,
      "author": "Dominique",
      "helpful_votes": 0,
      "publication_date": 20200809
    },
    {
      "title": "Great piece of equipment",
      "text": "Just got this yesterday and put it together in about 2 hours. Assembly is fairly easy, I did it by myself. Pay close attention to the instructions, they are kinda condensed and I had to turn a piece around when I was almost done. As for using it, it works as advertised. The cable pulley is pretty smooth and the dip bar is great. I wish the pull up bar allowed a wider grip but it will do. Overall, well worth the 300 bucks for a squat rack at home. Love it.",
      "rating": 4.0,
      "verified": true,
      "author": "Randall",
      "helpful_votes": 0,
      "publication_date": 20190202
    },
    {
      "title": "Missing parts",
      "text": "Great product, but it came missing with 2 pieces that were required to set up the footing for the sit up piece. Without this you can't do the sit ups. Everything else works great. 1/5 because I paid >500 for this product and nobody bothered to return my message about the missing part...?",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200902
    },
    {
      "title": "Everything you need and doesn’t take up a lot of room.",
      "text": "Great machine! I wound up turning the pulley system around because there wasn’t much room inside the cage and I can move between exercises more easily. Other than that slight change, I like it!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180715
    },
    {
      "title": "assembly was easy and straight forward for 2 people to accomplish",
      "text": "assembly was easy and straight forward for 2 people to accomplish. not the most overbuilt product but definitely within spec and should hold up for most people's uses",
      "rating": 5.0,
      "verified": true,
      "author": "Jim",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Great value",
      "text": "It's a great addition to our home gym. This rack replaced an old rack. We love it because of its accessories, like the pullup bars, dip handles, and cables. It's a great value for the price and features. Assembly was not difficult for 2 people.",
      "rating": 5.0,
      "verified": true,
      "author": "Tara P",
      "helpful_votes": 0,
      "publication_date": 20190622
    },
    {
      "title": "I love this thing",
      "text": "I love this thing!! Pullies are great, pull up bar is good, dip station and rack! Also the leg holders for setups and all the storage are nice additions. It's the focal point of my gym.",
      "rating": 5.0,
      "verified": true,
      "author": "AAAAT|G",
      "helpful_votes": 0,
      "publication_date": 20180129
    },
    {
      "title": "Great Purchase",
      "text": "Great quality gym. Very well packaged and simple assembly. Only a couple items were a little confusing when assembling.",
      "rating": 5.0,
      "verified": true,
      "author": "Leo",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "I do not see any options for safety catches. ...",
      "text": "I do not see any options for safety catches. And be cause of the angle of the frame, you would need to custom make catches. The plastic weight rack for the pulley system broke when I tried to secure it with the set screw.",
      "rating": 2.0,
      "verified": true,
      "author": "Robert B",
      "helpful_votes": 0,
      "publication_date": 20180218
    },
    {
      "title": "Good price good product",
      "text": "Easy to build once you stop looking at the crap instructions. Holds the weight and is easy to exercise on.",
      "rating": 4.0,
      "verified": true,
      "author": "Richard",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "perfect",
      "text": "This cage is perfect for home office. Took about 2 hours to assemble. After assembly it works perfectly. I wish there were more options to attach to it for different work outs, but I would highly recommend. Good value for the money.",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan",
      "helpful_votes": 0,
      "publication_date": 20200524
    },
    {
      "title": "Worth it",
      "text": "Sturdy, good. Stored indoors, have had it for for a few months already and no problems. Wish there were more height options, one setting is too high yet the one below it is too low. Other than that, no complaints.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170415
    },
    {
      "title": "Fantastic for use in home gym",
      "text": "Fantastic for use in home gym!! With a 7' Olympic bar I can squat, bench, and shoulder press with no issues. Pulley system is great as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Ryan S",
      "helpful_votes": 0,
      "publication_date": 20180419
    },
    {
      "title": "Awesome equipment",
      "text": "Solid fabrication. Exactly what I was looking for at a great price. The only issue that I had was a missing small piece. But I'm sure it's nothing that can't be resolved by calling customer service. Would buy again. Update: Great customer service! I sent an email to manufacturer's customer service and they responded within hours. They sent me the missing bracket on first class mail.",
      "rating": 5.0,
      "verified": true,
      "author": "Bham",
      "helpful_votes": 8,
      "publication_date": 20160321
    },
    {
      "title": "This squat cage is by far my most intelligent purchase for my home gym",
      "text": "This squat cage is by far my most intelligent purchase for my home gym. I do suggest having cables pull outward from cage when assembling.",
      "rating": 5.0,
      "verified": true,
      "author": "melinda banning",
      "helpful_votes": 0,
      "publication_date": 20180125
    },
    {
      "title": "Bad shipment",
      "text": "The shipment arrived.but both boxes very damaged. Parts missing so have no idea how to get this corrected.theres no reason for this.there are holes half the size of the boxes just tore wide open theres no reason for this",
      "rating": 1.0,
      "verified": true,
      "author": "Jeff mace",
      "helpful_votes": 0,
      "publication_date": 20200131
    },
    {
      "title": "Awesome",
      "text": "Great piece of gym equipment wish it could fit a large pull down bar comfortably or that the cable moved a little more Freely but an awesome piece for the price.",
      "rating": 4.0,
      "verified": true,
      "author": "francisco sanchez",
      "helpful_votes": 0,
      "publication_date": 20190312
    },
    {
      "title": "good",
      "text": "The cable system isn't great but the rest has been great so far",
      "rating": 4.0,
      "verified": true,
      "author": "Darrell keyes",
      "helpful_votes": 0,
      "publication_date": 20200908
    },
    {
      "title": "Four Stars",
      "text": "Wish it came with a safety rack, as I tend to bench home alone.",
      "rating": 4.0,
      "verified": true,
      "author": "Shawn",
      "helpful_votes": 3,
      "publication_date": 20161226
    },
    {
      "title": "Best cage",
      "text": "This cage was fairly easy to put together. I did need two for the pull up bar installation. Great product works well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Very Sturdy!",
      "text": "This is great! My only wish is that the cable machine could swivel. Everything else is great though.",
      "rating": 4.0,
      "verified": true,
      "author": "Devin",
      "helpful_votes": 0,
      "publication_date": 20181216
    },
    {
      "title": "The dip bars could be better strategically placed.",
      "text": "It is like having a full gym for a fraction of the room.",
      "rating": 4.0,
      "verified": true,
      "author": "B- No-Yes",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "Enjoying it so far",
      "text": "I put this together MOSTLY by myself, but I did need some help on a few things. So far I absolutely love it. I've been squatting, standing military presses, pull ups, I recommend this product. All I need is more weight and a bench.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180612
    },
    {
      "title": "Five Stars",
      "text": "This rack is incredible and very low in cost! Very sleek looking and functional",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180315
    },
    {
      "title": "EASY TO PUT TOGETHER",
      "text": "VERY SOLID STRUCTURE. EASY TO PUT TOGETHER. I DID IT MYSELF HOWEVER WOULD'VE BEEN BETTER WITH A SECOND SET OF HANDS.",
      "rating": 5.0,
      "verified": true,
      "author": "AUS216",
      "helpful_votes": 0,
      "publication_date": 20180318
    },
    {
      "title": "Great power cage",
      "text": "This home gym works perfect for areas that are not very large. It has pretty much everything you need to get your home gym started. i love that you can do so meny different exercises with it. It was very easy to put together but it dose need at least 2 people to get it put together. It is very sturdy dose not wobble around while using it. I would deffently recommend this to people that are wanting to have a gym at home instead of having to go to the gym",
      "rating": 5.0,
      "verified": true,
      "author": "Ejradel",
      "helpful_votes": 4,
      "publication_date": 20160428
    },
    {
      "title": "Used and defective",
      "text": "Parts 3 and 5 are severely bent making it so the top part of rack does not connect. When arrived looks like was previously used and hit with hammer. It took 3 weeks to deliver. Complete waste of time and money.",
      "rating": 1.0,
      "verified": true,
      "author": "Sebastian M.",
      "helpful_votes": 4,
      "publication_date": 20171101
    },
    {
      "title": "Good buy",
      "text": "Love this cage, one of the most affordable on the market. It's has storage for your Olympic weight, as well as a low and high pulley cable. You can't beat the price and quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Christopher",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "bang for your buck",
      "text": "Great prise for a great cage. Meet all of my expectations. Sturdy and versatile. You can definitely do a full body work out.",
      "rating": 5.0,
      "verified": true,
      "author": "Eddie rochin",
      "helpful_votes": 10,
      "publication_date": 20140625
    },
    {
      "title": "Four Stars",
      "text": "I like it. I just wish the attachment cables left more room​ for certain exercises =)",
      "rating": 4.0,
      "verified": true,
      "author": "Ms.Fitness",
      "helpful_votes": 0,
      "publication_date": 20160828
    },
    {
      "title": "... now and for him to have it is absolutely amazing because now he can do all kinds of things ...",
      "text": "So my husband just had knee surgery in the day that he had knee surgery he asked me to order this for him along with a flooring system and we put it up about the surgery and he's been using it to stay in shape while he is off work for the army and he loves the product has been asking for this for a while now and for him to have it is absolutely amazing because now he can do all kinds of things I cannot wait to add to this home Gemma bars",
      "rating": 5.0,
      "verified": true,
      "author": "stephanie gorey",
      "helpful_votes": 0,
      "publication_date": 20160523
    },
    {
      "title": "Not worth it",
      "text": "Easily one of my worst purchase decisions. I have only had this for a couple of weeks, but regret it entirely. If you want to do a bench press, you are going to run into a very specific problem. The bar holders (no idea what the technical term is) stick out about 6.5 inches. So when you grab the bar, you have to bring it forward a bit. Lowering the bar is fine. But then pushing the bar back up often leads to you hitting the holders from the underside. And then when you go to place the bar back, you really notice that 6.5 inches. I would not recommend this for anyone doing bench.",
      "rating": 2.0,
      "verified": true,
      "author": "David Shenton",
      "helpful_votes": 5,
      "publication_date": 20170215
    },
    {
      "title": "Great Product",
      "text": "Great Products, very sturdy!!! Husband wants more nothing compares to this equipment, good communication, and good feedback! Good everything, will buy more",
      "rating": 5.0,
      "verified": true,
      "author": "ana l lane",
      "helpful_votes": 7,
      "publication_date": 20140617
    }
  ],
  "product_meta": {
    "title": "Marcy Olympic Multi-Purpose Strength Training Cage with Pull Up Bars/Adjustable Bar Catchers and Pulley SM-3551",
    "description": "Allow yourself to exercise in the comfort of your own home with the Olympic Strength Cage from Marcy!\n\nTone your upper and lower body parts with this exceptional cage system. It is designed with an adjustable, commercial-style bar catcher to suit various users, letting you move from bench press to squat confidently with ease. Additionally, these commercial-style bar catches allow easy and hassle-free barbell replacements.\n\nBuild up your chest, shoulders, back, biceps, triceps, and abdomen using the cable pulleys to target all muscles. The high and low pulleys are made for intense upper and lower body exercises to help you build a strong, confident, and healthy physique.\n\nIf you’re not up for weightlifting, this workout machine also includes a pull-up station with multiple hand grip positions that allow a multitude of pull-up exercises. It offers you four possible hand grip positions to shift your exercises so you can use the wider grip for toning your back muscles and the narrower grip for strengthening your bicep muscles. It also includes foam-padded dip bars that are specially made for high-intensity triceps and chest development.\n\nTo keep everything in place, this cage features weight plate shelves on the bottom left, allowing you to pile dumbbells, kettle weights, and other gym accessories for easy access and storage. This weight store trolley holds 150 pounds.\n\nBurn calories and increase your lean muscle mass with the Marcy Olympic Strength Cage!",
    "rating": 4.2,
    "feature_bullets": [
      "ADJUSTABLE STYLE BAR CATCHES – This strength cage is designed with an adjustable, commercial-style bar catch so that you can move from bench press to squats easily. This workout machine also has a multi-handle pull up station with wide and narrow grips.",
      "HIGH AND LOW PULLEYS – The high and low pulleys offer a wide range of upper and lower body exercises for a strong and confident physique. Build up your chest, shoulders, back, biceps, triceps, and abdomen using the cable pulleys to target all muscles.",
      "WEIGHT PLATE STORAGE – The Olympic Strength Cage features weight plate shelves, allowing you to pile dumbbells and kettle weights for easy access and storage during workouts. This weight stack trolley, as well as weight plate storage rack holds 150lbs.",
      "HIGH- QUALITY CONSTRUCTION – This training machine is made with a commercial-grade solid steel frame to ensure years of use, making it a versatile machine that gives you the ability to exercise in the comfort of your home or office.",
      "Exercise Station Types: Pull-Up Bar, Low Pulley, Ab Crunch Station, High Pulley, Dips Bar"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "46 x 57 x 60 inches; 169.76 Pounds",
      "Item model number": "SM 3551",
      "Department": "Unisex-adult",
      "Date First Available": "January 9, 2014",
      "Manufacturer": "IMPEX INC - DROPSHIP",
      "ASIN": "B00GP4UODI",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Camping & Hiking",
      "Sports & Outdoors",
      "Outdoor Recreation"
    ],
    "price": ""
  }
}