{
  "website_summaries": [
    {
      "verdict": "The low drop at the back of this helmet is a good safety feature and offers a low, cut-away profile.",
      "pros": [
        "Comes with the assortment of self-sticking foam inserts that allows you to custom fit the helmet to your head",
        "Top and rear vents rate well for ventilation even in extreme heat",
        "Comes in a wide range of colors and designs, all with a rear reflective strip"
      ],
      "cons": [
        "Best for round head shapes",
        "doesn’t fit oval heads as well"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Thank you, Tipperary",
      "text": "Last week, my horse and I had a violent fall in a ditch, and then she crashed into a steel-railed pipe corral. Witnesses told me I hit it head first and slammed the back of my head again on the ground. Though I'm laid up for several weeks with bruising,a fractured leg, and a mild concussion, I realize things could have been so much worse had I not worn my Tipperary Sportage helmet. Bones heal, but brains, that's a different story. I am very grateful. Thank you, Tipperary!",
      "rating": 5.0,
      "verified": true,
      "author": "Trillium",
      "helpful_votes": 6,
      "publication_date": 20171117
    },
    {
      "title": "Nice looking helmet",
      "text": "Purchased for my husband for riding lessons. Very light and great fit, additional padding is supplied so you can get it just right. Air vents will be great in summer. Great looking helmet that would suit many equestrian disciplines.",
      "rating": 5.0,
      "verified": true,
      "author": "Jess",
      "helpful_votes": 0,
      "publication_date": 20160820
    },
    {
      "title": "Love, love, love it",
      "text": "We love this helmet! It is comfortable, it was a great price. I also liked how easy they directions were to follow in regards to adding more blocking to ensure a snug fit. This helmet is everything I was hoping it would be.",
      "rating": 5.0,
      "verified": true,
      "author": "skeenan",
      "helpful_votes": 0,
      "publication_date": 20170908
    },
    {
      "title": "I think it should at this price point but it is a very nice helmet and it is cool and comfortable",
      "text": "I would have given it 5 stars if it came with a built in helmet liner. I think it should at this price point but it is a very nice helmet and it is cool and comfortable. I bought the Troxel Helmet Headliner (Black, Large) to use with it and that works well for me as I needed a little extra padding in my helmet to fit so it worked out in the end.",
      "rating": 4.0,
      "verified": true,
      "author": "Nyneeve",
      "helpful_votes": 0,
      "publication_date": 20140907
    },
    {
      "title": "Tipperary Sportage Equestrian Helmet",
      "text": "This is the first time I have purchased a riding helmet other than a Troxel, which makes a fine helmet. However, this Tipperary helmet is awesome. It fits beautifully and is very comfortable no matter how hot it is in the park. I LOVE it and feel very protected when riding and wearing this Sportage Helmet.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan M. Hadley",
      "helpful_votes": 0,
      "publication_date": 20130708
    },
    {
      "title": "Five Stars",
      "text": "Most comfortable & most protective helmet I've ever owned. Very much worth the price.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin L. Kelley",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Helmet is light and comfortable. This is my second one",
      "text": "Fast shipping. Helmet is light and comfortable. This is my second one.",
      "rating": 5.0,
      "verified": true,
      "author": "CherylT",
      "helpful_votes": 0,
      "publication_date": 20161110
    },
    {
      "title": "She wearing it!",
      "text": "Bought for daughter 16 ,wont wear the other brand of helmet she had.(troxel).really likes this helmet and wears it.She says it is very light weight on her head.Measured her head and order the size that she was and it was a good fit.",
      "rating": 5.0,
      "verified": true,
      "author": "lynn",
      "helpful_votes": 0,
      "publication_date": 20131109
    },
    {
      "title": "I really like it It is so light and comfortable",
      "text": "A friend suggested this helmet. I really like it It is so light and comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Roberta Stoycoff",
      "helpful_votes": 0,
      "publication_date": 20141108
    },
    {
      "title": "Really well-made!",
      "text": "This is low in the back so it protects the back of the head very well. The visor is very narrow and flexible so if you do a \"face plant\" your neck willl not be snapped from a large, stiff visor. The air circulation is very good and the color is understated and nice. I feel very comfortable having my one and only daughter wear this helmet. I would NOT recommend this if it was cheaply made, our riding children are too precious too skimp on their safety products.",
      "rating": 5.0,
      "verified": true,
      "author": "BE",
      "helpful_votes": 2,
      "publication_date": 20130408
    },
    {
      "title": "Tipperary",
      "text": "I absolutely love my Tipperary! It's the only helmet I've found that doesn't give me a headache when I ride. It's one of the safest and most comfortable helmets out there.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany",
      "helpful_votes": 20,
      "publication_date": 20120319
    },
    {
      "title": "Comfortable and lightweight",
      "text": "I researched a lot before buying my helmet. I love how comfortably it fits and that it doesn't weigh that much at all. I also love the color and fit.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Stagman",
      "helpful_votes": 0,
      "publication_date": 20121226
    },
    {
      "title": "Sizing was tough Service was great",
      "text": "These run a bit large. The sizing chart wasn't provided by the seller from what I could see. I searched elsewhere for the sizing and ended up with a very large helmet. Return went smoothly.",
      "rating": 4.0,
      "verified": true,
      "author": "CrashingGirl",
      "helpful_votes": 3,
      "publication_date": 20120316
    },
    {
      "title": "Very nice helmet!!!",
      "text": "We had tried one before and we knew which size to buy. Looks very nice and we liked the nice selection of colors.",
      "rating": 5.0,
      "verified": true,
      "author": "Silvia Carvalho",
      "helpful_votes": 0,
      "publication_date": 20131021
    },
    {
      "title": "Best ever",
      "text": "I won't ride in anything else. My last two helmets have been Tipperary. Been in a lot of accidents. The stiff visor even saved me from a busted nose once. Ready to order a new one as my las test has been in two accidents now. Very comfortable, in winter or summer. Many times I just leave it on its so comfy.",
      "rating": 5.0,
      "verified": false,
      "author": "Reyvin Windwolf",
      "helpful_votes": 0,
      "publication_date": 20160328
    },
    {
      "title": "I was concussion free and other than bad bruising on my back",
      "text": "On my first ride with my new helmet, I had the incident that reminds us why we wear helmets. I landed on the back of my head and the helmet fractured - by my head did not. I was concussion free and other than bad bruising on my back, I walked away. It's why we where these bad-boys, and I'm glad I bought the low profile helmet in the nick of time.",
      "rating": 5.0,
      "verified": false,
      "author": "BrownieMix",
      "helpful_votes": 16,
      "publication_date": 20140728
    }
  ],
  "product_meta": {
    "title": "Tipperary Sportage Equestrian Sport Helmet",
    "description": "The Tipperary Sportage 8500 helmet is constructed of a lightweight high density ABS material that provides superior impact resistance. It has a contoured drop back shell and comfort foam interior to cradle the head, providing increased protection. It has functioning top and rear vents for high temperature relief. It also has a rear reflective strip and a flexible visor. ASTM-SEI certified (ASTM Standard F1163-04A).",
    "rating": 4.9,
    "feature_bullets": [
      "Contoured drop-back shell",
      "Comfort foam interior",
      "Flexible visor",
      "Rear reflective strip",
      "Lightweight"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "11 x 8.5 x 7.5 inches; 3 Pounds",
      "Item model number": "TIPP-8500.13-Sportage_Carbon_L-Parent",
      "Department": "Womens",
      "Date First Available": "February 8, 2008",
      "Manufacturer": "Tipperary",
      "ASIN": "B00GDE9ZJO",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Other Sports",
      "Sports & Outdoors",
      "Protective Gear",
      "Equestrian Sports",
      "Sports & Fitness"
    ],
    "price": 89.99
  }
}