{
  "website_summaries": [
    {
      "verdict": "Definitely not your typical dollhouse, this option adds a whole new dimension to a classic fairy tale.",
      "pros": [
        "Helps instill a love of reading by combining story time with playtime",
        "Brings stories to life",
        "little ones will love playing out their favorite scenes",
        "Charming “storybook” design with plenty of detail to capture attention and stimulate imagination",
        "Suitable for boys and girls"
      ],
      "cons": [
        "Lightweight eco-friendly construction is highly portable and easy to store, but may not be the most durable"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I'm IN LOVE with this playset",
      "text": "I'm IN LOVE with this playset. Everything is hand drawn and matches the illustrations in the book. The story is true to the three bears tale.its not too short nor is it too long of a story. It takes about 10-15 minutes to put together. I liked assembling it, it was fun..! My daughter*age 4.. Loves playing with the little house as I read which is the perfect concept for a story time activity. It brought us together as a family:) I FULLY recommend this and will purchase as a gift for someone soon!",
      "rating": 5.0,
      "verified": true,
      "author": "Mike and Laura ",
      "helpful_votes": 3,
      "publication_date": 20180224
    },
    {
      "title": "LOVE this set and so does my grand daughter!!",
      "text": "My grand daughter is autistic, and one of her \"stims\" is goldilocks (the story, and toys related). I searched and searched for a play set that would let her read and act out the book. this works so perfectly!! she truly adores this, thank you so much, it is very well made, very detailed (my grand daughter informed me I had put the table in the \"wrong room Gramma, that's for the chairs!\" lol). just so happy I found this, thank you!!",
      "rating": 5.0,
      "verified": true,
      "author": "nobluefood",
      "helpful_votes": 2,
      "publication_date": 20190707
    },
    {
      "title": "They loved the whole thing",
      "text": "I purchased the Goldilocks and the Three Bears Toy House for my grand-daughters (2 & 4) to play with at my house. They loved the whole thing; the story book, reading them the story, the house set up, and all the detailed pieces. Played with this for hours. Even when it was time to put toys away, the 4 year old liked putting the puzzle pieces back together. This helped make clean up fun and easy. This toy is so creative, not expensive, well made, easy to put together and easy to put away. Thank you Storytime Toys!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20161127
    },
    {
      "title": "Just buy it already!",
      "text": "My daughter is obsessed with goldylocks and the three bears. She wants me to read it to her every day. When I saw this, I was impressed by the detail and figured I would give it a shot. Absolutely amazing! The picture doesn't do it justice. It's the perfect size where it isn't an effort to bring it out everytime. Constructing it was fun, and it let's children use their imagination. I read while we both played with it and made the story come alive. As an avid reader myself, I think these kits bring the magic alive for young ones and reading. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "Flanclan.4",
      "helpful_votes": 3,
      "publication_date": 20161225
    },
    {
      "title": "Imaginative and creative play with classic story adaptation",
      "text": "This interactive story and play set was a hit in our house! Little one enjoyed acting out the story with the beautifully decorated figures and setting. Quick to put together. Smaller pieces (e.g., porridge bowls) can be saved until children are older if needed without taking away from the fun. No space for a doll house? This compact toy is easily stored or may be kept out without taking up half of the living room. It also allows for children to create their own stories and use their imaginations. Fast shipping too.",
      "rating": 5.0,
      "verified": true,
      "author": "Erika F.",
      "helpful_votes": 0,
      "publication_date": 20171105
    },
    {
      "title": "Hours of fun",
      "text": "Universally adored by all the children I've ever given it to.",
      "rating": 5.0,
      "verified": true,
      "author": "Katy",
      "helpful_votes": 2,
      "publication_date": 20191122
    },
    {
      "title": "Beautiful, but not easy to play with",
      "text": "I love the illustrations and the detail in this little kit. It was fun to read the stories, and have my daughter act it out simultaneously. The house kept falling apart, though, and it got frustrating. Getting chubby little arms inside, almost always results in furniture dislodging, and the walls tumbling down on poor Goldilocks. It is a lot bigger than I thought it would be, and it seems sturdy enough.",
      "rating": 3.0,
      "verified": true,
      "author": "D. Moller",
      "helpful_votes": 0,
      "publication_date": 20190103
    },
    {
      "title": "Great Buy",
      "text": "My kids love this and love to get it out and play with them all the time!",
      "rating": 5.0,
      "verified": true,
      "author": "ddemory",
      "helpful_votes": 2,
      "publication_date": 20190716
    },
    {
      "title": "Nice concept, cheaply made..",
      "text": "Nice concept but made out of foam and stuck with glue with glossy printouts on either side. 2 year old was able to shred the whole thing apart in matter of minutes. Would have loved it if it was made of cardboard or plastic. Did not last long enough to be played with.",
      "rating": 2.0,
      "verified": true,
      "author": "TwoLittleAngels",
      "helpful_votes": 6,
      "publication_date": 20150129
    },
    {
      "title": "Beautiful once assembled but difficult to maneuver pieces around the house.",
      "text": "This was easy to assemble and beautiful but difficult to maneuver pieces around the house. Also the cardboard pieces of Goldilocks and the 3 bears kept falling over and there wasn’t enough space to move pieces or bears around as you are telling the story bc it would knock into everything. Difficult for little fingers so I recommend this for ages 4 and up.",
      "rating": 3.0,
      "verified": true,
      "author": "Ann G.",
      "helpful_votes": 0,
      "publication_date": 20190709
    },
    {
      "title": "we love this toy",
      "text": "we love this toy. we purchased the three little pigs and my kids love to build the set and reenact the story over and over. they even like to combine the two to make a 'mega fairy tale.' it's durable and can be used repeatedly. i'd love more fairy tales to have these 3D story boards.",
      "rating": 5.0,
      "verified": true,
      "author": "padua",
      "helpful_votes": 0,
      "publication_date": 20170131
    },
    {
      "title": "Endless fun",
      "text": "Got this for my three year old grandbae. She loves it! She has played with it for hours and loves when I play too. We have told the story over and over and she gets such a kick out of the different voices we use for each little character.",
      "rating": 5.0,
      "verified": true,
      "author": "Mamadoo",
      "helpful_votes": 0,
      "publication_date": 20200402
    },
    {
      "title": "Fun with Goldie and the Three Bears.",
      "text": "the house was well made and my granddaughter enjoyed putting the house together.",
      "rating": 5.0,
      "verified": true,
      "author": "cheryl pirozzi",
      "helpful_votes": 2,
      "publication_date": 20191023
    },
    {
      "title": "Not great for the price paid",
      "text": "Not great for the price paid. It is a very cute display item, but not great for actually playing with. The characters fall over constantly. Some of the pieces had the decorative coating tear off as soon as they were punched out of the forms. I would expect this item to remain intact through the initial set up. After owning it for one day I can see it is going to have to be kept out of reach of my child, unless he is supervised during play. Assembles fairly easy. The story book was very lackluster and did not keep my pre-schoolers attention.",
      "rating": 2.0,
      "verified": true,
      "author": "Bruce Wolf",
      "helpful_votes": 0,
      "publication_date": 20170111
    },
    {
      "title": "Looks great but challenging to assemble",
      "text": "I bought this for my three-year-old niece. I knew that obviously she would not be able to put it together herself, but it took two instructions-savvy adults to figure out how to put everything together. There are no instructions, just like labels and numbers on the different pieces. It took a long time and my niece was starting to lose interest by the end. There are then a lot of small little bits and ends of cardboard leftover. I wish that we had put it together before presenting it to my niece.",
      "rating": 3.0,
      "verified": true,
      "author": "Elizabeth C. Brown",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Absolutely Lovely",
      "text": "I put this together for my 6 year old granddaughter to play with when she comes over. I had no trouble assembling it but I think she would have had a difficult time assembling it by herself. We leave it set up which makes it easier and helps the sticker decoration not to peel. It is one of her favorite toys! I will be ordering Hansel and Gretel too!!",
      "rating": 5.0,
      "verified": true,
      "author": "Lee Ann",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Wonderful toy!",
      "text": "This is a wonderful toy that will inspire a child's imagination. The colors, graphics and minute attention to details are superb. This is an interactive toy that both children and parents will enjoy. In a time where electronics have quashed imagination and creativity, Goldilocks by Storytime Toys will allow these joyful traits to blossom. I highly recommend this and all Storytime Toys!",
      "rating": 5.0,
      "verified": true,
      "author": "K Argue",
      "helpful_votes": 0,
      "publication_date": 20191221
    },
    {
      "title": "and she absolutely loved it. My 9-year-old niece really loved this too",
      "text": "I bought this for my niece for her 4th birthday, and she absolutely loved it. My 9-year-old niece really loved this too. She took over putting it together. It has many small \"pop-outs\" that you put together, and is relatively quick and easy to set up. I bought the \"Little Woodzeez\" bear family to go with it, and they were a little big, but still worked. This was an adorable, interactive toy for any child. So cute too.",
      "rating": 5.0,
      "verified": true,
      "author": "Rachael MacArthur",
      "helpful_votes": 0,
      "publication_date": 20160413
    },
    {
      "title": "Good seller",
      "text": "This is adorable. I got it to use as a decoration. It was a bit difficult to figure out how to put it together so I contacted the seller who sent me a link to the instructions. This was very helpful and I was finally able to put it together by myself❣️",
      "rating": 4.0,
      "verified": true,
      "author": "BetteAnn",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great for pretend play and storytelling",
      "text": "I got this for my 3 year old child after she surprised us by telling Santa she wanted Goldie locks for Christmas. She loves telling stories and pretending so this kit has been a fun addition to her pretend play area.",
      "rating": 5.0,
      "verified": true,
      "author": "Stacy Hudson",
      "helpful_votes": 0,
      "publication_date": 20200110
    },
    {
      "title": "Overpriced!",
      "text": "My 3 year old grandchild didn't care for this much. Maybe an older child would like it better. I feel it's way overpriced for what you get and I'm thinking of sending it back. For me it just isn't worth the money.... Thankfully I didn't purchase the other story sets like I was going to.",
      "rating": 2.0,
      "verified": true,
      "author": "Diane B",
      "helpful_votes": 0,
      "publication_date": 20190509
    },
    {
      "title": "but it would be nice to have some instructions",
      "text": "Very cute house and well made, however there are no instructions to assemble the house. I know it's not that complicated, but it would be nice to have some instructions. They do tell you to go on youtube, but they assemble the house in a matter of seconds and I had to stop the video several times, lol. I am not a idiot and my friend even asked for the instruction sheet. I would give it the 5 stars except for that. My daughter does love it and will probably play with it for a long time to come.",
      "rating": 4.0,
      "verified": true,
      "author": "A's Mom",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "Very pleased!",
      "text": "Very pleased! I'm a Speech Pathologist and this darling set will help to elicit language from my preschoolers. Unlike other reviews, I feel this is very well made. I like how it comes apart easily and comes in a sturdy container. Looking forward to buying the other sets!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Very cute.",
      "text": "Absolutely love this playset. I did take small wooden flat craft disks and hot-glued them to the bottom of the bears and Goldilocks to make stands so they can stand independently. They do not come with stands and will fall over. House and furnishings adorable and granddaughter plays with this house every day. Wish there was one for Red Riding Hood, but we plan to get the 3 pigs set and Hansel and Gretel.",
      "rating": 5.0,
      "verified": true,
      "author": "Jars59",
      "helpful_votes": 0,
      "publication_date": 20170308
    },
    {
      "title": "Beautiful toy.",
      "text": "This was by far the biggest hit with my 5 year old grandaughter , She plays with it for hours and hours , Now 6 months, Beautiful toy .",
      "rating": 5.0,
      "verified": true,
      "author": "L barb",
      "helpful_votes": 3,
      "publication_date": 20160208
    },
    {
      "title": "He tries to put it together himself and while the edges are pretty sturdy I don't think this toy can take the ...",
      "text": "My grandson loves this. Be prepared though for lengthy set up time. The problem with a 3 year old is, by the time you get this set up he no longer wants to play. He tries to put it together himself and while the edges are pretty sturdy I don't think this toy can take the wear and tear of set up and take down. We don't have the room unfortunately to leave this set up all the time. Its cramped and hard for adult hands to get inside the house to play. Wish the actual house was bigger for the furniture provided. Great graphics",
      "rating": 4.0,
      "verified": true,
      "author": "Rita Moeller",
      "helpful_votes": 0,
      "publication_date": 20151217
    },
    {
      "title": "Adorable!!!",
      "text": "Super cute! Small like others have mentioned, but adorable! The graphics and detail on the house are utterly amazing! I would definitely recommend this especially to those who don't want a huge dollhouse taking up space in your home. Note: we glued the pieces together so they were less wobbly, we don't intend to pack it up and put it back together on a frequent basis.",
      "rating": 5.0,
      "verified": true,
      "author": "helena joyce",
      "helpful_votes": 3,
      "publication_date": 20150425
    },
    {
      "title": "Fun toy loved by kids will be buying more!",
      "text": "I am so glad I came across this storytime toy for kids! Kids absolutely love playing with this toy, and I like the fact that they are using their own imagination for hours of playtime at a time. Very easy to put together and travels well wherever we go. I will be buying these as holiday gifts for sure!",
      "rating": 5.0,
      "verified": true,
      "author": "Lucky Finds",
      "helpful_votes": 0,
      "publication_date": 20171108
    },
    {
      "title": "Awesome playset to get the kids off the electronic screens.",
      "text": "This was a great present. I got it for my niece and nephew. They enjoyed putting it together and playing with the set. All the pieces fit well and are very well illustrated. It's really cool that they were able to bring the book's art into a three dimensional space for the kids to enjoy off the pages. I would recommend this to anyone looking to get their young ones off the iPads and smart phones for some actual playtime.",
      "rating": 5.0,
      "verified": true,
      "author": "Adam Dyer",
      "helpful_votes": 0,
      "publication_date": 20191204
    },
    {
      "title": "I like to read it and help him act it out ...",
      "text": "This is a really cute toy! Our 5 year old son loves it! He has a house toy without it being specifically a girl toy. I like to read it and help him act it out in order to assist his communication differences. He likes to put it together, but it stays together well. Very beautiful and detailed. Curious about the other stories. We needed string for the swing. The company helped us right away. Price seemed a little high, but sturdy for card board. Unique. Would make a good gift.",
      "rating": 5.0,
      "verified": true,
      "author": "Elizabeth Lane",
      "helpful_votes": 0,
      "publication_date": 20150105
    },
    {
      "title": "Encourages imagination, creativity, and love of reading!",
      "text": "I am mirroring the same comment I just left for the Hansel and Gretel set. The pieces are very sturdy and pretty. And my 3-year-old had a good time putting this together and using the pieces to tell her own extended version of the story. It is packaged very well also. Makes a great gift!",
      "rating": 5.0,
      "verified": true,
      "author": "bigfeet",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "The storybook comes alive in 3D!",
      "text": "This is sweet. Grandkids enjoy putting it together as much as playing with it. Pieces fit perfectly and stay together well. The artistic detail is amazing. It will take you back in time, into the story from your childhood.",
      "rating": 5.0,
      "verified": true,
      "author": "Yard Saler",
      "helpful_votes": 0,
      "publication_date": 20170531
    },
    {
      "title": "Cute, interactive story books",
      "text": "Very detailed pieces that help spark the imagination. The 3 year old girl I bought it for really loved it.",
      "rating": 4.0,
      "verified": true,
      "author": "S.E.F.",
      "helpful_votes": 0,
      "publication_date": 20191227
    },
    {
      "title": "Kids LOVE it!",
      "text": "It's like a puzzle and a play piece all in one. My 3 year old twins and 5 year old fight over who gets to play with this. Sometimes they even play together! Good quality and holding up to lots of play.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Holt",
      "helpful_votes": 0,
      "publication_date": 20180831
    },
    {
      "title": "Great idea, but not long-lasting",
      "text": "It's a wonderful idea, especially for anyone tired of plastic/battery-operated toys. The artwork is lovely. It is made entirely of foam with stickers over it. After some gentle use, many of the stickers are peeling up at the edges. It's so fragile that I don't want to risk putting it away in the box each time we are done with it. The pieces are already bending from the small amount of adjusting I've done. A major reason I bought this was thinking that it would tuck neatly away in the little box - instead, it's taking up space fully assembled and tiny accessories are easy to misplace. Sweet idea but definitely not worth the price.",
      "rating": 3.0,
      "verified": true,
      "author": "Kasey",
      "helpful_votes": 10,
      "publication_date": 20141208
    },
    {
      "title": "Amazing toy - Phenomenal customer service!",
      "text": "This little toy house is absolutely perfect! Our daughter adores it!!! Even better than the toy itself is the amazing customer service experience you will receive from Storytime Toys, if for some reason you should need to contact them, as we did. We could not be happier with the entire experience! The artwork is so rich and full of detail. Exceptional talent!!! And the engineering of the whole house, even the packaging, is absolutely genius! The instructions are simple and assembly is easy! Love everything about it!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Truth Be Told",
      "helpful_votes": 0,
      "publication_date": 20151228
    },
    {
      "title": "I like it but not for 30",
      "text": "It is cute but kind of poorly made....I like it but not for 30.00..at 15 it would be great though I have to say the maker did respond quickly and appropriately to me when I told them it was coming apart ... they sent me a new sheet...I just do not see it holding up very well...we shall see",
      "rating": 3.0,
      "verified": true,
      "author": "T Karnes",
      "helpful_votes": 3,
      "publication_date": 20151001
    },
    {
      "title": "Interactive and fun",
      "text": "I bought this as a gift for my 4 year old niece and she loves it. It is very interactive and fun! The story book is colorful and for the price a very good quality. I will be purchasing the other stories for future gifts for her.",
      "rating": 5.0,
      "verified": true,
      "author": "Teresa Howell",
      "helpful_votes": 0,
      "publication_date": 20180102
    },
    {
      "title": "The idea behind this toy is great, but it would be nice if it were ...",
      "text": "The idea behind this toy is great, but it would be nice if it were a little more kid-friendly when assembling it. The box is nice and sturdy, but its too much trouble to assemble and take apart each time to make it fit back into the box. All that said, this was bought for my 5 year old, but loved by all the others as well (9, 8, 4 year Olds)",
      "rating": 4.0,
      "verified": true,
      "author": "Jada",
      "helpful_votes": 0,
      "publication_date": 20161022
    },
    {
      "title": "Lets the imagination and creativity flow!",
      "text": "Bought for my grandchildren ages 4 & 7, they LOVE it. So great to hear their imaginations going as they play. Haven't had any trouble with the pieces. Book has adorable illustrations and is easy to read. It's easy to pack up the house and put on a shelf until next time. Plan on buying more sets!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer SA",
      "helpful_votes": 0,
      "publication_date": 20171201
    },
    {
      "title": "My 6-year-old granddaughter LOVES this. She asks to play ...",
      "text": "My 6-year-old granddaughter LOVES this. She asks to play with it every time she comes over. I read the book to her and she plays the parts of each character, adding her own dialogue. It's very well-made, too!",
      "rating": 5.0,
      "verified": true,
      "author": "Morninglori",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Sweet and Fun",
      "text": "This is a very sweet and well-thought out toy. I love the details in the house and am impressed by how efficiently it was engineered. Good value - great you!",
      "rating": 5.0,
      "verified": true,
      "author": "Susan",
      "helpful_votes": 0,
      "publication_date": 20161227
    },
    {
      "title": "Very nice quality, and the illustrations are beautiful",
      "text": "Very nice quality, and the illustrations are beautiful. My daughter loves setting it up and plays with it for hours. Would purchase again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ken Walker",
      "helpful_votes": 0,
      "publication_date": 20170608
    },
    {
      "title": "Great interactive toy",
      "text": "\"Santa\" brought this for my four-year-old granddaughter. She loves it! The included book with characters that match the toy house characters allows her to \"read\" the story to her little sister while acting/moving Goldilocks and her bear friends to their appropriate positions. A great product.",
      "rating": 5.0,
      "verified": true,
      "author": "mamaw48",
      "helpful_votes": 2,
      "publication_date": 20150319
    },
    {
      "title": "beautiful, can be played with as is or with ...",
      "text": "This is so cute! Well made, classic, beautiful, can be played with as is or with other small toys, and not too expensive. 4 children have played with it so far, 7, 10, and 12 yo girls, and one 8yo boy, bc there is something to love in it for everyone. PLEASE keep making beautiful toys like this!!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20161226
    },
    {
      "title": "Not what I was hoping for...",
      "text": "I was not terribly impressed with this. I bought this for my 3.5 year old daughter. We tried to put it together with the help of my 5 and 7 year olds without much luck. The pieces that needed to be punched out kept breaking and the older kids weeent able to line the pieces up well enough without a lot of help. Overall, pretty disappointed. Based on the great ratings, I was pretty surprised by our experience.",
      "rating": 2.0,
      "verified": true,
      "author": "Buyer",
      "helpful_votes": 0,
      "publication_date": 20170106
    },
    {
      "title": "Kid fun",
      "text": "The grand kids just love this puzzle book. It's really less of a puzzle and more like a construction project with lots of fun afterwards. I have bought two different ones and they are both well made, sturdy and easy to pack away.",
      "rating": 5.0,
      "verified": true,
      "author": "Mary E. Nagel",
      "helpful_votes": 0,
      "publication_date": 20161220
    },
    {
      "title": "Love this so much <3 Kids won't stop playing with ...",
      "text": "Love this so much <3 Kids won't stop playing with it. Very durable. I want them all",
      "rating": 5.0,
      "verified": true,
      "author": "SallyB",
      "helpful_votes": 0,
      "publication_date": 20171112
    },
    {
      "title": "Kids love it!",
      "text": "So so cute!! Wish I had this as a kid.",
      "rating": 5.0,
      "verified": true,
      "author": "Susan T.",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Disappointing - not ideal for active kids who actually want to play",
      "text": "I agree that it is cute with nice details, but not exactly kid friendly. Falls apart easily and is not fitting back together as nicely. Characters don't have stands and as a result are pretty useless. Also, like another review, the house is too small to fit all of the beds on the top floor and actually play. The 3 bowls of porridge cold have been so much cuter and whimsical. My kids could not even tell that's what they were. We will be making the acorn tops that are suggested in the book.",
      "rating": 1.0,
      "verified": true,
      "author": "Maria E.",
      "helpful_votes": 3,
      "publication_date": 20170105
    },
    {
      "title": "My children loved this. It brought reality to the story",
      "text": "I teach Head Start. My children loved this. It brought reality to the story. They had to think outside the box and rebuild the house. Hours of play and learning! Thank you so much!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Halverson",
      "helpful_votes": 2,
      "publication_date": 20170408
    },
    {
      "title": "Too many complicated tiny pieces.",
      "text": "Far too many pieces for my 2 grand girls. They were 4 and 5. Suggest you buy for an older child.",
      "rating": 3.0,
      "verified": true,
      "author": "Dee",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "The house was easy to assemble but pretty small",
      "text": "The house was easy to assemble but pretty small. I let my kids use the pieces with a real doll house instead. I think it would be great if you were collecting all the story book houses from this company, but as a stand a lone it is kinda small.",
      "rating": 3.0,
      "verified": true,
      "author": "dance mom",
      "helpful_votes": 0,
      "publication_date": 20170407
    },
    {
      "title": "Very pleased",
      "text": "Very sweet. The book is little more than a stapled collection of pages. But sweet illustrations and a fun change to the text with baby bear eager to see goldilocks again. House is well made, durable and easy to quickly construct. Box is great size for holding items with chairs intact but beds broken back down.",
      "rating": 4.0,
      "verified": true,
      "author": "EmilytheStrange",
      "helpful_votes": 0,
      "publication_date": 20141227
    },
    {
      "title": "This is such a sweet toy. Bought for my son's 4th birthday",
      "text": "This is such a sweet toy. Bought for my son's 4th birthday, hoping it would be a hit for both him and his 6 year old sister...and it is! They've played with it almost every day for the last two weeks, and love re-telling the story, or incorporating with other favorite toys. Great size and quality - we have a minimalist home with mostly wooden toys...this fits right in. Love it!",
      "rating": 5.0,
      "verified": true,
      "author": "JennySur",
      "helpful_votes": 0,
      "publication_date": 20160902
    },
    {
      "title": "Very sweet and very well contructed",
      "text": "This toy is very well made and the graphics are adorable. My Granddaughter plays with it more as a puzzle and really loves the challenge. It was easy to put together and I feel was well worth the price. This is a toy that will last for a good long time and has multiple play applications.",
      "rating": 5.0,
      "verified": true,
      "author": "rescuelady",
      "helpful_votes": 7,
      "publication_date": 20140117
    },
    {
      "title": "Daughter loves!",
      "text": "My Waldorf kid loves this toy. Hours of imaginative fun.",
      "rating": 5.0,
      "verified": true,
      "author": "Sunrise Sally",
      "helpful_votes": 0,
      "publication_date": 20180103
    },
    {
      "title": "My 4 year old was happily occupied for a long time putting this together and ...",
      "text": "My 4 year old was happily occupied for a long time putting this together and taking it apart. It's thick enough that it withstands multiple uses and a little abuse.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170323
    },
    {
      "title": "It was easy to assemble",
      "text": "This is just the cutest thing, It was easy to assemble, it's sturdy and perfect size. I don't know why but my daughter's don't really play with it, but their friends have. I always loved this story as a child.",
      "rating": 5.0,
      "verified": true,
      "author": "Ilse",
      "helpful_votes": 2,
      "publication_date": 20160127
    },
    {
      "title": "Too complicated",
      "text": "This was a great idea but way too many things to put together and things to loose! We have missing parts already and I found it too complicated for grandma to even attempt!",
      "rating": 3.0,
      "verified": true,
      "author": "The Whitehouse",
      "helpful_votes": 0,
      "publication_date": 20160109
    },
    {
      "title": "It was pretty disappointing considering the price and having to pay the ...",
      "text": "None of the pieces fit together it was as if the designs were put on backwards. It was pretty disappointing considering the price and having to pay the return shipping since it was non-functional.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170119
    },
    {
      "title": "this is amazing! I've been playing with my 4 yo for ...",
      "text": "God, this is amazing! I've been playing with my 4 yo for five days in a row. She can't get enough of the gorgeous house and bears. I am so thankful for it. I'm buying the \"Three Little Pigs\" and Hansel and Gretel\" asap!!!",
      "rating": 5.0,
      "verified": true,
      "author": "claudia elizabeth",
      "helpful_votes": 0,
      "publication_date": 20150701
    },
    {
      "title": "A nice toy for the active mind",
      "text": "This also is an excellent toy that allows a young mind to make up stories using the pieces included with the house. They are basic flat interlocking pieces with a laminated paper picture on each piece. Nothing fancy but it holds the attention of my 4 year old granddaughter! That's what's important.",
      "rating": 5.0,
      "verified": true,
      "author": "Subman",
      "helpful_votes": 0,
      "publication_date": 20141130
    },
    {
      "title": "Love!",
      "text": "This is such a cute toy! My four year old loves it. I'm planning on buying more for gifts!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary M.",
      "helpful_votes": 0,
      "publication_date": 20180225
    },
    {
      "title": "a perfect set up to act out the Goldilocks & 3 ...",
      "text": "very cute. a perfect set up to act out the Goldilocks & 3 bears story..sturdy, heavy cardboard. I was surprised at the good quality being that the pieces are foldable. Fun to play with independently or w/ Grandma helping to tell the story!",
      "rating": 5.0,
      "verified": true,
      "author": "sally",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "... (she's obsessed with the three little pigs) but was delighted with the house and the furnishings",
      "text": "She has only played with this once (she's obsessed with the three little pigs) but was delighted with the house and the furnishings. It will get a workout!",
      "rating": 5.0,
      "verified": true,
      "author": "Sara E Douglass",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Five Stars",
      "text": "this is great to extend play and the story in my classroom",
      "rating": 5.0,
      "verified": true,
      "author": "mary beth garrett",
      "helpful_votes": 0,
      "publication_date": 20160804
    },
    {
      "title": "Cute!",
      "text": "Ordered the 3 little pigs after playing with a 3 yr old. She had very cute imaginative play, and even though she hadn't heard the story before, knew what would happen. Very cute, well made, but I put it together for her so it wouldn't break. cute idea!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20150710
    },
    {
      "title": "The concept is really great.. she loved reading the story and playing ...",
      "text": "The concept is really great.. she loved reading the story and playing along... however for almost 30$ you get a tiny book and the pieces are like foam and the paper starts to come off extremely fast. Also the beds come apart and won't stay together. Had to glue pieces together the 2nd day we had it",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160102
    },
    {
      "title": "Five Stars",
      "text": "It's adorable and encourages creative play. Purchased for my great niece who is 4. She loves it!",
      "rating": 5.0,
      "verified": true,
      "author": "geraldine febbo",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Simple item, but is what it says.",
      "text": "Fun to put together, but not much fun after that. Kids lost interest fast. Tight areas don't really allow much room for playing once built.",
      "rating": 4.0,
      "verified": true,
      "author": "Happy customer",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Awesome imagination toy",
      "text": "Awesome imagination toy, much loved by 4 year old. This is paper on card board, the paper will peel from cardboard, not too easily. Have your glue handy to repair for enthusiastic players. Lovely toy!! Fun.",
      "rating": 4.0,
      "verified": true,
      "author": "Granny GP",
      "helpful_votes": 0,
      "publication_date": 20150720
    },
    {
      "title": "A tree house for trolls",
      "text": "This is a well constructed toy house. I purchased it because my great-niece wanted a house for her trolls! So even though Goldilocks, the bears and the book are cute, they were put aside.",
      "rating": 5.0,
      "verified": true,
      "author": "Barb Bergerson",
      "helpful_votes": 0,
      "publication_date": 20151210
    },
    {
      "title": "Fun and Easy",
      "text": "5-yr old granddaughter loved it. played with it over and over again when she received it.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Williams",
      "helpful_votes": 0,
      "publication_date": 20170405
    },
    {
      "title": "They both love it.",
      "text": "Delightful! We got this for our 4 year old grandaughter. Her 9 year old brother helped her assemble it and read the book to her. They both love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Kent Seldal",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Great idea but....",
      "text": "It's a cute toy but difficult to put together. I'm never taking it apart because I'd never get it back together again!",
      "rating": 3.0,
      "verified": true,
      "author": "Sterling",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "Three Stars",
      "text": "Very cute, but the two year old ripped off all the stickers that illustrate the house.",
      "rating": 3.0,
      "verified": true,
      "author": "Cherrychapstick",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "Quality Fun for Five Year Old",
      "text": "Great quality. Sturdy. Perfect gift for our 5 year old. Great for imaginary play. Easy assembly required.",
      "rating": 5.0,
      "verified": true,
      "author": "A. Findley",
      "helpful_votes": 2,
      "publication_date": 20160209
    },
    {
      "title": "Cute Idea but my 5 year old cannot put this ...",
      "text": "Cute Idea but my 5 year old cannot put this together alone nor can she play with it without it falling apart.",
      "rating": 3.0,
      "verified": true,
      "author": "Takomama",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "Great gift for older toddlers",
      "text": "This is a beautifully made toy set in really nice packaging for gifting. We've given this as a gift several times to 4yr olds and always hear glowing reviews. The pieces are sturdy cardboard covered in fabric, and glossy scenes. They are simple to punch out, and fun to fit together for little ones, who will need help with the swing, and maybe getting started, but otherwise should get the hang of it quickly. Putting it together may be more fun than actually playing with it, but no matter. Our daughter still enjoys keeping it set up for Goldilocks, the Bears, Peppa, Lego Friends, etc to populate. I expect we'll buy another soon, as its birthday party season. :)",
      "rating": 5.0,
      "verified": true,
      "author": "Kara A. Hughes",
      "helpful_votes": 2,
      "publication_date": 20160518
    },
    {
      "title": "Not worth it",
      "text": "Not worth it. Annoying to put together, too many pieces. Some were missing. Shouldn’t have gotten it.",
      "rating": 2.0,
      "verified": true,
      "author": "Allison",
      "helpful_votes": 0,
      "publication_date": 20200312
    },
    {
      "title": "It is very realistic and sturdy for a two and a half year old",
      "text": "This toy will keep my child busy. It is very realistic and sturdy for a two and a half year old. It's a great way to interact and play with your child.",
      "rating": 4.0,
      "verified": true,
      "author": "L. Tinkle",
      "helpful_votes": 0,
      "publication_date": 20151226
    },
    {
      "title": "Five Stars",
      "text": "Love these items...had to get Handel & Gretal, 3 Little Pigs, and Goldilocks",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170724
    },
    {
      "title": "Five Stars",
      "text": "Bought this as a gift for my 4 year old daughter. She loves it",
      "rating": 5.0,
      "verified": true,
      "author": "Diana B.",
      "helpful_votes": 0,
      "publication_date": 20170120
    },
    {
      "title": "LOVE IT!",
      "text": "During our fairy tales lesson my students couldn't get enough of this!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20160614
    },
    {
      "title": "Very cute and sturdy. Love that it's a playset for a classic ...",
      "text": "Very cute and sturdy. Love that it's a playset for a classic story, rather than all the licensed-character junk you usually find.",
      "rating": 5.0,
      "verified": true,
      "author": "AnnaMK",
      "helpful_votes": 0,
      "publication_date": 20150702
    },
    {
      "title": "I love it so much I bought the 3 Little Pigs ...",
      "text": "I bought this for my preschool classroom. You could have heard a pin drop when I read the story using the house and props. My students were enthralled! I love it so much I bought the 3 Little Pigs set too. Worth every penny!",
      "rating": 5.0,
      "verified": true,
      "author": "Tabatha Quinn",
      "helpful_votes": 0,
      "publication_date": 20160227
    },
    {
      "title": "Very Nice",
      "text": "Very well made My granddaughter loves the story and was so tickled to receive it for Christmas",
      "rating": 5.0,
      "verified": true,
      "author": "Granna",
      "helpful_votes": 0,
      "publication_date": 20141231
    },
    {
      "title": "Good choice",
      "text": "It's very nice. Colorful a d sturdy. My grandson loved it.",
      "rating": 5.0,
      "verified": true,
      "author": "susana porcu",
      "helpful_votes": 0,
      "publication_date": 20180228
    },
    {
      "title": "Five Stars",
      "text": "Our neice loved this toy, played with it for hours!",
      "rating": 5.0,
      "verified": true,
      "author": "Donna J.",
      "helpful_votes": 0,
      "publication_date": 20160101
    },
    {
      "title": "Five Stars",
      "text": "Great toy! Ideal to play with kids! Reading the story and roleplaying With the characters",
      "rating": 5.0,
      "verified": true,
      "author": "maria iavicoli",
      "helpful_votes": 0,
      "publication_date": 20170424
    },
    {
      "title": "I think I like it very much",
      "text": "This is a Christmas gift, so I have no idea what it is all about until my greatgrand daughter opens it.I think I like it very much.",
      "rating": 5.0,
      "verified": true,
      "author": "Shirley Lanzarotta",
      "helpful_votes": 0,
      "publication_date": 20161119
    },
    {
      "title": "Five Stars",
      "text": "Awesome toy and book. I bought as a gift for a little girl. Beautiful designed. I bought a second one another little girl! I love this playset. I wish there was something like this when I was growing up.",
      "rating": 5.0,
      "verified": true,
      "author": "Reem",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Makes story time even more fun!",
      "text": "This idea is genius! The little house is so cute when put together! My little girl is only 2 so currently it is used as a decoration on her book shelf. However I am looking forward to much imaginative play with this when she is a little older!",
      "rating": 5.0,
      "verified": true,
      "author": "Whitney S. Rice",
      "helpful_votes": 0,
      "publication_date": 20150930
    },
    {
      "title": "Great gift! High price for material.",
      "text": "We bought this for our 4 year-old daughter's birthday, recently. She loves it and has spent many hours playing with it. I like the easy storage. But buyer beware: the illustrations are glued to foam, not wood. Since Melissa and Doug sells a similar wooden \"piece together\" house for the same price, I'm not convinced this is $30 worth of toy. Within a few sessions of taking it apart and rebuilding it the pictures began separating from the foam and need to be glued.",
      "rating": 3.0,
      "verified": true,
      "author": "WFD426",
      "helpful_votes": 4,
      "publication_date": 20150917
    },
    {
      "title": "Fun to do",
      "text": "Fun activity to do with kids. Not very durable considering how rough children handle things",
      "rating": 4.0,
      "verified": true,
      "author": "Philip George",
      "helpful_votes": 0,
      "publication_date": 20151114
    },
    {
      "title": "Cute, classic-themed playset",
      "text": "Very cute playset. The price is a little steep, in my opinion, but it's kind of a unique item. Taking it apart and putting it back together multiple times does cause the corners of the pieces to wear.",
      "rating": 4.0,
      "verified": true,
      "author": "S H",
      "helpful_votes": 0,
      "publication_date": 20141124
    },
    {
      "title": "Four Stars",
      "text": "love it, we just need stronger string for the swing.",
      "rating": 4.0,
      "verified": true,
      "author": "The Lyons",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Three Stars",
      "text": "The small beds seem to easily collapse for a 4yr old.",
      "rating": 3.0,
      "verified": true,
      "author": "Roseannguillermo",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Grown ups love it too!",
      "text": "This was so cute and of high quality. My grandson and his parents got right to work putting it together. Ok, so it was my SON who couldn't wait to play with it! 😏",
      "rating": 5.0,
      "verified": true,
      "author": "G. Nicholson",
      "helpful_votes": 0,
      "publication_date": 20160710
    }
  ],
  "product_meta": {
    "title": "STORYTIME TOYS Goldilocks and The Three Bears 3D Puzzle - Book and Toy Set - 3 in 1 - Book, Build, and Play",
    "rating": 4.3,
    "feature_bullets": [
      "CLASSIC STORY Book gives kids a foundation for play and lets them create their own fairytales with the matching toy house and Goldilocks, Mama, Papa and Baby Bear dolls",
      "PLAYFUL DETAILS Explore the tree house with its working swing, ladder, doors and windows and arrange its chairs, beds and table",
      "ALL IN ONE TOY Comes with everything to play: book, toy house, dolls, furniture and accessories! No need for batteries or to make additional purchases",
      "BETTER THAN WOOD Made from eco-friendly material. As strong as a wooden dollhouse but light-weight and a soft, sensory experience",
      "COLLAPSIBLE AND PORTABLE Build it and take it apart, no tools! Stores flat in portable travel case. Take it along on playdates or grandparent visits. Or add a dab of glue to keep it together forever!"
    ],
    "specifications": {
      "Product Dimensions": "9 x 9 x 9 inches",
      "Item Weight": "2 pounds",
      "ASIN": "B00GQIHMB0",
      "Manufacturer recommended age": "3 years and up",
      "Best Sellers Rank": "#33,139 in Toys & Games",
      "Customer Reviews": "4.3 out of 5 stars248 ratings4.3 out of 5 stars",
      "Is Discontinued By Manufacturer": "No",
      "Mfg Recommended age": "3 year and up",
      "Department": "Girls",
      "Manufacturer": "Storytime Toys"
    },
    "categories": [
      "Dolls & Accessories",
      "Toys & Games",
      "Dollhouses"
    ],
    "price": 29.95
  }
}