{
  "website_summaries": [
    {
      "verdict": "If you prefer to carry a point-and-shoot, the Altura model will get the job done.",
      "pros": [
        "The lightweight Altura Photo comes with a screwplate so you can secure your camera firmly, and a small zipper for extra memory cards",
        "The screwplate can also mount to a tripod easily"
      ],
      "cons": [
        "Screwplate may loosen with time, but this can be avoided with a smaller camera"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "Lightweight and comfortable, this strap may be worn over the shoulder or around the neck for convenience.",
      "pros": [
        "Fits nearly any DSLR camera on the market",
        "Has an extra zipper pocket for storing small items, like memory cards",
        "Uses a metal latch for the quick release buckle, ensuring a high level of quality",
        "Includes an extra safety tether"
      ],
      "cons": [
        "Not made of the most durable materials",
        "Hook may bend when placed under extra stress"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "and the screw comes undone very easily. I used it at one wedding",
      "text": "The \"safety\" strap came apart before I even put it on the camera. I had to heavily sew it to keep the strap together. Then the plate does not stay in one place on the camera, and the screw comes undone very easily. I used it at one wedding, but had to constantly screw the plate back onto the bottom so it wouldn't fall off. This product is not safe for your gear.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 99,
      "publication_date": 20160912
    },
    {
      "title": "Not suitable for Heavy Camera",
      "text": "I does not work with Canon 5D Mark III with 70-200mm lens. Too heavy to handle in this strap. The mounting bracket has rubble and it cracks. Also the mount would twist and turn. It may works for lighter camera. I decide to return this and get something different.",
      "rating": 1.0,
      "verified": true,
      "author": "BlueCar",
      "helpful_votes": 42,
      "publication_date": 20171205
    },
    {
      "title": "Metal clip snapped in half after only 2 months",
      "text": "I bought this strap in August for a photo trip to Portugal and it was comfortable and worked well for my Canon 70D. Then, a few weeks after I got home I was out shooting for work and the base of metal clip just snapped on half. Thank goodness for the safety strap or my camera and my 2.8 24-70 IS lens would have been on the ground! Amazon is refunding me only a portion of the cost, but it's better than nothing. I guess I will keep searching for the perfect camera strap. I won't trust another one from this brand again.",
      "rating": 2.0,
      "verified": true,
      "author": "Dena Jenkins",
      "helpful_votes": 13,
      "publication_date": 20171011
    },
    {
      "title": "Bulky plate, design flaw",
      "text": "I hate to criticize this sling too much because it delivers what it promises and at a great price, BUT..... It has a design flaw. The plate is big and heavy and you attach the strap to the end of plate which will naturally cause torque. This torque is the reason so many people have complained about it coming unscrewed. I also found the plate incredibly bulky and cumbersome - especially when lying it down or putting into a camera bag. The large clip on the strap that connects to the plate just adds to the bulk. On the positive side, I have found all the materials to be well made.",
      "rating": 3.0,
      "verified": true,
      "author": "Peruna",
      "helpful_votes": 3,
      "publication_date": 20190201
    },
    {
      "title": "Strap Failed!",
      "text": "I purchased two of these over the past six months. Last weekend while photographing and the camera hanging on the strap by my side, my camera became disconnected from the screw/strap and fell to the ground. My lens was destroyed and nonfunctional afterwards. I have not been able to determine the damage to my camera. I am very upset and frustrated with this product. NO NOT BUY!",
      "rating": 1.0,
      "verified": true,
      "author": "Robert Meza",
      "helpful_votes": 8,
      "publication_date": 20180305
    },
    {
      "title": "Failed on the very first use.",
      "text": "Unfortunately, this broke on the very first use, and it broke in two different places which leads me to believe that the overall quality of this product is severely lacking. First, the zipper broke off of the shoulder pouch on the very first use. Second, the backup safety carabiner failed on the very first use. The main clip that goes onto the camera seems sturdy enough, but there's no way in heck I'm going to trust my $3000 camera to a product that's already failed twice. I would have returned it, but the return window closed by the time I actually used it for the first time.",
      "rating": 1.0,
      "verified": true,
      "author": "Adam L. Johnson",
      "helpful_votes": 6,
      "publication_date": 20170202
    },
    {
      "title": "work great",
      "text": "works great takes a bit to get it adjusted correctly. thought I would miss the under arm strap, but it works fine without one.. the one thing I added was quick clip & split ring to the safety strap.. so I could remove the whole strap easier. I had no problems with the click to the base plate.. I can't see how this could possibly self-release.. and if anyone say they dropped the $???? camera, well they just didn't use the safety strap.. I like the way the safety strap attaches to the Main strap.. most other clip to the buckle or to the camera clip.. very nice..",
      "rating": 5.0,
      "verified": true,
      "author": "bobxski",
      "helpful_votes": 0,
      "publication_date": 20200516
    },
    {
      "title": "I like it but it broke!",
      "text": "This lasted me 16 months until it broke. The scary thing is that it broke at the connection to the camera. If I hadn’t been holding my camera that moment, it would have surely fallen to the floor. Although minor, the zipper pull also came off after a few months of use. I would gladly pay $10-20 more for the same item but made with better marterials. My gear is too expensive to risk with a cheap strap so I switched to a Blackrapid now.",
      "rating": 2.0,
      "verified": true,
      "author": "JML",
      "helpful_votes": 2,
      "publication_date": 20190106
    },
    {
      "title": "worked great until my camera fell off and hit the ground",
      "text": "The attachment screw on the mounting bracket worked loose and the camera dropped to the (fortunately) soft dirt trail. They do supply an optional back up tether which is a pain in the butt to attach and remove quickly and easily and which seems like an afterthought, as well as making the strap much less versatile. Otherwise, the strap allows me to comfortable carry my DSLR and long zoom without neck pain. I now obsessively check the connections every few minutes. Even with all of that, I like the strap. But I don't completely trust it.",
      "rating": 2.0,
      "verified": true,
      "author": "D. Fox",
      "helpful_votes": 0,
      "publication_date": 20200321
    },
    {
      "title": "Perfect strap",
      "text": "I'm still getting used to this strap but I'm so glad I got it - it still feels a little long on me because the camera tilts down when you are using it - but it's much better than a traditional strap for what I'm looking for. You have access to the camera and can keep it off to the side if using two different cameras. Fits well - seems very secure and can release if you need it to. If I were taller it would feel a bit better I think. It is fully adjustable - just getting the hang of it. Great product.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Radcliff",
      "helpful_votes": 0,
      "publication_date": 20200331
    },
    {
      "title": "Strap hold camera good",
      "text": "Strap hold camera. Camera no floor anymore. Strap black, camera black. Strap hold and hold, not fly or throw, hold camera. $20, strap hold camera at hip, no bounce on belly anymore. Camera no street, no sidewalk, no shoe, no grass, no sand, thank you strap, you hold camera above camera hurt surfaces. Hold and hold and hold it! Thing strap do: Hold camera $20 Black Thing strap not do: Levitate camera with unseen force Securely attach strap to hips and raise camera upon thought command with a system of pulleys, levers and worm gears Possess antigravity properties Yellow, rainbow, lace, tulle, leather, dental floss Cost more than $20",
      "rating": 5.0,
      "verified": true,
      "author": "Nick W",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Not my favorite strap, but it gets the job done.",
      "text": "Black Rapid straps were recommended to me very fervently by a photography enthusiast friend. I bought this one instead as a cheaper alternative, since the pictures looked similar. And indeed, it is convenient to carry my camera at my hip instead of at my chest. But I find it annoying that the strap doesn't stay at my shoulder when I lift my camera up to shoot; instead, the movement of lifting my camera often knocks the strap off my shoulder (yes, I am moving the buckles first).",
      "rating": 4.0,
      "verified": true,
      "author": "JEB",
      "helpful_votes": 0,
      "publication_date": 20200406
    },
    {
      "title": "Finally",
      "text": "I had been looking for a shoulder strap for my camera for a while. Most of the other models either secure the camera on the bottom (unable to use a tripod without removing the strap) or only on the side which was dangerous. This one is perfect. It's fully adjustable with two points to the secure the camera: on the bottom and on the side. There is an opening for a tripod on the bottom attachment. It takes the weight of the camera off of my neck, and the wide strap is comfortable to use. There is a zipper on the strap which will hold several small items: a camera card, lens paper, remote, etc.",
      "rating": 5.0,
      "verified": true,
      "author": "E. Mayner",
      "helpful_votes": 2,
      "publication_date": 20170626
    },
    {
      "title": "Very satisfied with this product.",
      "text": "I have been wanting a shoulder strap for a very long time. The neck straps that come with camera are nice, but after being around your neck for a while, you end up holding your camera in one hand, to relieve the strain on your neck. using this strap relieves the strain, and the strap is not even around your neck. It's nice to have your camera rest be your side on the strap, and not have to worry about any neck strain. I give it a four star, due to the padded section. I don't think a zip pouch is truly necessary, and makes the padding a little too thick, but doesn't hinder me from not using it.",
      "rating": 4.0,
      "verified": true,
      "author": "Justin",
      "helpful_votes": 2,
      "publication_date": 20170719
    },
    {
      "title": "I wish it had a spinning swivel",
      "text": "You would be wise to check the tightness of the knob regularly to make sure it's secure. I have a strap from a different manufacturer and it has a swivel that spins to decrease the likelihood of it twists loose. I bought this strap for my sons camera, and in the first outing it started to loosen. The last thing you want is a camera dropping off the strap! Now we tighten it each time and check a couple of times while we're out to be certain it's secure. But it is comfortable and well made!",
      "rating": 4.0,
      "verified": true,
      "author": "Longazon",
      "helpful_votes": 0,
      "publication_date": 20200525
    },
    {
      "title": "Comfortable and convenient.",
      "text": "I have for years carried my camera off to the side with a conventional strap that connects to the camera strap holder. The problem was twofold: Long lenses torqued the camera down and made it uncomfortable and to take a picture, I generally needed to shift the camera to the front. This camera strap just went on vacation with me to Europe and was a pleasant change. It hangs to the side by the bottom of the camera making it comfortable and you can disconnect the main hook (with still a safety strap attached) to conveniently take pictures. Great Product.",
      "rating": 5.0,
      "verified": true,
      "author": "Peter D.",
      "helpful_votes": 0,
      "publication_date": 20190603
    },
    {
      "title": "Good strap with iffy main connection",
      "text": "The strap works exactly as advertised, but I'm a little worried about the main connection, the plate that screws onto the bottom of the camera (Nikon D90). After only a few minutes of moderate use it loosens enough that the plate can turn. It doesn't seem like it's enough for the camera to fall off the plate, though it's not inconceivable. It does have a sturdy backup strap, but I kinda wish it used the built-in camera strap loop as the primary connection.",
      "rating": 4.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great camera strap for mirrorless or DSLR",
      "text": "This cross body strap is extremely comfortable, and the sliding ring with quick release clasp and adjustable stops keeps your camera at the ready and secure between shots, never getting in the way of shooting. I am using two of these straps, each with a smaller mirrorless camera body to minimize lens changes. While crossed, they stay out of the way of each other well enough to let me grab and quickly shoot with either camera. Nice attention to detail, durable, and the zipper compartment is great placed for carrying extra SD cards. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 2,
      "publication_date": 20171012
    },
    {
      "title": "Best Camera Strap I've Ever Found in 30 Years of Photography...",
      "text": "This strap would normally not even get a look from me, but I read an article on it and had to learn more. I don't think I've ever spent less Than $50 for any of my dozens of straps, so I'm thinking, \"What can you expect for $18?\" Well, I was completely amazed at the functionality and quality of this strap. I've got 7 Pro Bodies (Canon & Fujifilm) and you can expect that each will be fitted with one of these straps. I'm that impressed. So, Op-Tec, LowePro, and the like -- watch out. You've got some major competitdion here. Highly Recommended. A++++++++++++++++++++++++++++",
      "rating": 5.0,
      "verified": true,
      "author": "Spike",
      "helpful_votes": 2,
      "publication_date": 20170430
    },
    {
      "title": "Just what I was wanting!",
      "text": "Very happy with this as I used to always put my regular camera strap on the side because I disliked how the camera would bounce when hiking. I do wish the straps were adjustable in a different way for folks who are shorter. I ended up having to cut the end of the strap so I could adjust the camera not too hang below my hip since I am shorter than average. Also love the pocket in the strap. It's great to store my ID and an extra battery when I don't want to take anything but my camera along.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda E.",
      "helpful_votes": 3,
      "publication_date": 20170311
    },
    {
      "title": "Won't stay put, items stored on strap don't sit well when wearing",
      "text": "So, I was excited to have a spot to keep my camera cards and batteries, but the pocket is in the bend of the strap pad and storing items in it makes it stiff and hard to bend. Also, the strap never stays put (I couldn't use the side strap to secure it to do my body size, I am a size 18). I am afraid that if I hit the clip wrong where the strap attaches to the camera, it may fall off. I don't like that there is only 1 contact point to the camera. There is no locking feature on the clip that holds the camera.",
      "rating": 3.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20190925
    },
    {
      "title": "I swear by this strap",
      "text": "After many months of extended use, I find this strap to be the best one I've ever used. Slung over my should, it is always ready for very quick shooting, and walk-about convenience and comfort. The tripod socket holds the heavy duty plate and screw securely in place without covering the camera's battery compartment. The tether connector adds a level of security. Also, the shoulder pad has a almost hidden zipper pouch intended for extra SD cards, but it can also be used as a secure money compartment when traveling. Love it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Florida K.",
      "helpful_votes": 0,
      "publication_date": 20190318
    },
    {
      "title": "Great Camera Strap for Active Photographers",
      "text": "Great camera sling. The adjustable strap makes it comfortable for both my husband and I to use. The lockable sliders that hold the camera in place are a great feature, especially when hiking, as it allows me to place my camera at my side and slightly behind me and it doesn't slide around. I have had this strap now for about 3 months and have used it indoor and outdoor sporting events, out hiking, and while photographing ranchers working their cows and remained comfortable with the strap and placement of the camera while not holding it the entire time, even when having to move out of the way quickly.",
      "rating": 5.0,
      "verified": true,
      "author": "Erin",
      "helpful_votes": 3,
      "publication_date": 20170605
    },
    {
      "title": "Perfect for my China trip.",
      "text": "I got a ton of use out of this in my trip to China. I watched some videos on how to properly position it. The security straps is a must and I’m glad it’s there although I never had an issue where I had to use it. For piece of mind though it’s perfect. I did carry extra memory cards in the strap. I didn’t find any issues when I was in our bus, or sitting down for dinner, etc. it’s way, way, way for comfortable than the standard neck strap. I saw a few people with the neck strap on our trip and was so glad that I had this. Hope you enjoy as much as I did.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Forbes",
      "helpful_votes": 0,
      "publication_date": 20181105
    },
    {
      "title": "Great cross-body strap.",
      "text": "I wish I had this strap sooner. This is perfect for carrying my Canon cross body, and still be able to the camera in to position for taking pictures. There's an additional retention feature beyond the piece that screws in to the tripod mount on the camera that gives a little more piece of mind. It also has a zippered compartment in the strap itself to put a few extra SD cards. I cared more about the cross-body strap, and didn't notice these in the description, so these were extra bonuses.",
      "rating": 5.0,
      "verified": true,
      "author": "Faloi",
      "helpful_votes": 2,
      "publication_date": 20170716
    },
    {
      "title": "I walk a lot with my camera and hate that it bounces around with a normal camera strap",
      "text": "I was looking for a longer strap, and thought this would work. I walk a lot with my camera and hate that it bounces around with a normal camera strap. This strap is good quality and seemed like it would be great, except....... when I walking around with my camera for the first time, the plate came loose and my camera came off!! If I didn't attach the safety tether, my camera would have been damaged. After that I really did not feel safe having expensive equipment hanging by the plate. I had to return. Sticking to my normal camera strap, for safety and comfort of my equipment.",
      "rating": 2.0,
      "verified": true,
      "author": "Colleen",
      "helpful_votes": 0,
      "publication_date": 20170921
    },
    {
      "title": "This is really well designed and made",
      "text": "About a year ago I decided it was time for a longer strap for my D800. I am over 6 ft tall. I bought a Movo NV-1. It was poorly made and the attachments kept coming free... yes dropping the camera. I bought this one based on ratings. It is completely different. It is well constructed and incredibly comfortable. Lets the camera hang by my waist. With the second attachment to the camera, I am not concerned with it coming free and dropping the camera. This is a great product.",
      "rating": 5.0,
      "verified": true,
      "author": "JD Flood",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Love everything about it",
      "text": "I've gone through quite a few camera straps and I never like the traditional style. I was looking for something different to make a heavy camera easier to carry and this is it! I LOVE this strap- the pocket on the pad is perfect for an sd card or two and it securely attaches to the bottom of the camera. I think it makes it easier to handle and maneuver the camera. I also love the design!",
      "rating": 5.0,
      "verified": true,
      "author": "Paige Carlson",
      "helpful_votes": 3,
      "publication_date": 20170706
    },
    {
      "title": "Metal Broke in Half",
      "text": "If you have a high quality camera, buy a high quality strap. I had this for about 7 months before the METAL part of the strap broke. (See photos) I was lucky that my camera was in my hand when it broke so no serious damage was done to my gear. Clearly poor quality.",
      "rating": 1.0,
      "verified": true,
      "author": "Andi Buescher",
      "helpful_votes": 6,
      "publication_date": 20180616
    },
    {
      "title": "Great strap, no problems so far!",
      "text": "So far I am very happy with this strap. I use this with a Pentax k-70 which is quite heavy and it takes the weight quite well. I took this for several day hikes in rocky mountain national park and forgot I was wearing my camera sometimes between shots. My only complaint is sometimes the quick release clip can get a little twisted and you have to position the camera to lay flat against your body, but once its set where you want it it pretty much stays put. Love the included storage pocket since I can put extra memory cards/battery in it and be ready for the day.",
      "rating": 4.0,
      "verified": true,
      "author": "Kevin Bell",
      "helpful_votes": 0,
      "publication_date": 20181126
    },
    {
      "title": "Altura has become my new favorite company for buying photo gear",
      "text": "I am not a paid comment, I wish I could give this 6 stars. Altura has become my new favorite company for buying photo gear, the quality is superb, and the price is amazing! Plus purple accents are pretty slick (just wish I knew about them before buying my backpack) I shoot pro No fear of my camera dropping! The latch is very secure! I have this set up with BOTH a battery grip and a hand grip (attached to the plate) They include a free micro fiber cloth too, can never have too many of those. I will be buying my camera accessories from Altura from now on.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff",
      "helpful_votes": 2,
      "publication_date": 20170327
    },
    {
      "title": "Possibly the best $20 I ever spent.",
      "text": "Took my Panasonic GH5 with me to Israel strapped to this baby. Amazing! Made my camera easily accessible, and I could conceal it nicely under my jacket so as not to look like too much of a tourist. It makes my DSLR comfortable and handy; almost like a part of my body. Great use of storage compartments for memory cards! NOT AN INCH OF THIS CAMERA STRAP IS WASTED!!!! A MUST BUY FOR BUDDING PHOTOGRAPHERS!!!!",
      "rating": 5.0,
      "verified": true,
      "author": "L. Stevie P.",
      "helpful_votes": 0,
      "publication_date": 20200221
    },
    {
      "title": "Did not work for me but well made",
      "text": "Unfortunately, I had to return this item. It appeared to be well made, but I was unable to keep the plate tight on my camera. I put it on a Sony A6000 with the Sony 100-400 lens. It didn't state a weight limit in the description, but it appeared that with this lens on it was too heavy to keep the plate tight. I contacted the manufacturer who suggested that I watch the videos for use, but I didn't find a fix for this issue. This item would probably be fine for a lighter set-up. I purchased a cheaper one, and it works fine, but it is not made as nice as this one.",
      "rating": 3.0,
      "verified": true,
      "author": "GypsyI",
      "helpful_votes": 0,
      "publication_date": 20180813
    },
    {
      "title": "The Quick release feature is amazing!",
      "text": "I really like this product from Altura. I've grown to like this brand. This DSLR strap is just as good as any product I've bought. It's very stylish and comfortable. The security features work flawlessly. I have it attached to a tripod release and it's still holds tightly and securely. One of my favorite features of this strap is the small bit storage it had for SD cards or small caps, very convenient. After using this product for a few months, I highly recommend it.",
      "rating": 5.0,
      "verified": true,
      "author": "Melvin Morgan Jr.",
      "helpful_votes": 0,
      "publication_date": 20200129
    },
    {
      "title": "Eh, it's not great, but it does serve the basic function of holding your camera for you.",
      "text": "Gotta be honest, I really don't like this at all. Maybe that's my own fault, but the rigidity of the \"padding\" makes the whole strap pop out and away from my body when I grab the camera. I thought it was because I had it too loose so the camera would hang down lower, but when I adjusted it to be tighter, I couldn't get the camera to my face comfortably. Oh well, still slightly better than the normal camera strap that came with the camera.",
      "rating": 3.0,
      "verified": true,
      "author": "SeattleSwade",
      "helpful_votes": 2,
      "publication_date": 20170806
    },
    {
      "title": "VERY comfortable for hikes and day excursions",
      "text": "This strap makes day long jaunts with a DSLR more comfortable. I have this attached to my Nikon D5500 DSLR at the mounting screw. The screw has another screw at the bottom so you can still attach to standard 1/4\" tripod. An additional nice touch is the backup attachment point to where you normally attach you camera strap to the DSLR. This gives me an extra sense of comfort knowing that if I fudge up and the main attach point unscrews itself, the camera will not fall into a potential catastrophe. Well thought out Design.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181015
    },
    {
      "title": "Comfortable, functional and sturdy",
      "text": "I had a bungee accident a few years ago and after spinal (neck)and shoulder(right shoulder) surgery I am not able to carry too much weight around my neck or on my right shoulder. This strap has made photography so much easier for me. It allows me to wear it across my body from the left shoulder so it does not bother my shoulder or neck. Generally speaking this strap is comfortable, sturdy, durable and very functional, the pocket for SD cards is very handy",
      "rating": 5.0,
      "verified": true,
      "author": "Bright Eyed Egyptologist",
      "helpful_votes": 0,
      "publication_date": 20190724
    },
    {
      "title": "Very secure",
      "text": "Very comfortable and feels very secure. The safety tether certainly gives you a piece of mind. Love the pouch part. I have put an extra memory card and battery. The position let’s uou quickly bring the camera up so that you are always ready for a quick capture. I also find myself taking more pictures with this strap as opposed to a camera bag because the camera is already out, ready and no hassle of pulling out and putting back into a bag. I have used this for my Sony A6000 and A6300 with my heavy Zeiss 24-70 with no problem and the secure screw has not loosened. Excellent product.",
      "rating": 5.0,
      "verified": true,
      "author": "R. Mack",
      "helpful_votes": 0,
      "publication_date": 20180609
    },
    {
      "title": "Easy to sling",
      "text": "I have used this as my main sling since buying it two years ago. It is comfortable even in the hot deserts of Arizona, and the sling is large enough to use outside a jacket in the cold of winter in Pittsburgh. I've never had it come undone as others of this type had in their reviews. I do keep the extra safety latch on. The clam clip and safety clip are easy to remove when you want to mount it on a tri-pod .",
      "rating": 5.0,
      "verified": true,
      "author": "Leonard",
      "helpful_votes": 0,
      "publication_date": 20200519
    },
    {
      "title": "Lifesaver",
      "text": "I honestly will never own another strap that doesn't have a zippered pocket. This one is sturdy. I've used it for a few years now and it's still going. It is comfortable, so there is no strain carrying my camera. The zippered pocket allows me to carry several sd cards. This way it doesn't matter where I am or what I'm doing, I can get a new card if needed.",
      "rating": 5.0,
      "verified": true,
      "author": "Callie D.",
      "helpful_votes": 0,
      "publication_date": 20200305
    },
    {
      "title": "Liked so much bought another",
      "text": "Love it. This is my second one. I recently purchased another Camara and needed another strap. The neck straps hurt my neck so much but this strap is so comfortable. I wear it for hours at wrestling meets and football games. I love how I can walk around with easy and still have my Camara right there. I am 5.3” and it adjust to a shorter length so fit is good. Plus has small storage for Camara cards or some cash.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190829
    },
    {
      "title": "Excellent product for travel photography",
      "text": "I like this type of strap very much from the traditional/default strap that comes with the camera. This strap makes easy to hold the camera and pull it up quickly to take pictures. I feel my camera (Nikon D5100) is more safe and protective because the camera hangs in the side. I wish they had more variety in pattern/color. The mount is also very sturdy and I can attach it with my tripod. In addition,I have also attached a hand strap on top of the mount",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190426
    },
    {
      "title": "Absolutely wonderful. Great quality",
      "text": "Wow. I wasn't expecting the quality of this strap for the price. So many other pricier straps but the reviews mad eme go through with buying this one. Absolutely wonderful. Great quality. The puch fits an extra battery, 2 SD cards, AA batteries, and USB cord. Doesn't feel heavy. Easy to release. My only suggestion is not to overtighten the screw. I placed on the tripod too lose and it rotated to the point it tightened to much. I had to get a rag and wrench to get it loose - user error. Love that I can leave strap on it while on tripod. Great purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Bookaholic",
      "helpful_votes": 2,
      "publication_date": 20170408
    },
    {
      "title": "Great quality for the price",
      "text": "Basically a knock off R-Strap and that’s ok with me! High quality that’s to be expected of Altura (I have their flashes too). The mounting screw plus security strap are nice and I feel confident my rig won’t snap off.",
      "rating": 5.0,
      "verified": true,
      "author": "TDo",
      "helpful_votes": 0,
      "publication_date": 20200108
    },
    {
      "title": "Comfortable and Convenient",
      "text": "This strap is great...it attaches easily and is very stable. The tether is easy to attach and is an excellent fail-safe. That said, the screw that attaches to the camera is very secure and I don't see it coming loose anytime soon. Many complained about the latch and clasp not being sturdy, but it seems fine to me. I haven't done a 4 or 5 mile hike with it yet, but in the 2-3 mile hikes I have done it has been fine. Overall, I am very happy with the purchase and I am looking forward to taking it on a wildlife excursion soon.",
      "rating": 4.0,
      "verified": true,
      "author": "Peter Kavouras",
      "helpful_votes": 0,
      "publication_date": 20190821
    },
    {
      "title": "Highly recommended",
      "text": "Bought this to replace my original Pentax strap. Despite the Pentax K5 being a very compact camera compared to comparable Canons and Nikons, my neck would still hurt. This strap is so relieving. Fantastic grip. Allows me to carry the camera whole day without any inconvenience or pain. The limiters prevent the camera from swinging around wildly when you bend and the strap has a handy pocket for keeping memory cards.",
      "rating": 5.0,
      "verified": true,
      "author": "strobe",
      "helpful_votes": 0,
      "publication_date": 20190726
    },
    {
      "title": "My favorite strap!",
      "text": "This is my favorite camera strap so far! I love that it’s a cross-body strap because it keeps the pressure off my neck and I can let the camera dangle without having to hold it. I also love that I can store extra batteries and memory cards in the strap pockets.",
      "rating": 5.0,
      "verified": true,
      "author": "MRHJ",
      "helpful_votes": 0,
      "publication_date": 20200109
    },
    {
      "title": "Comfortable camera strap",
      "text": "I have chronic neck/shoulder pain, so a lot of camera straps make the pain much worse, but this one has been great. I have had it for a couple months now and have taken it out on long 10+ mile hikes, and it was comfortable all day. I'm also a pretty small person (5'3, 110lbs), and I was able to adjust it to my size which is super important. I love that I can keep extra SD cards and a lens cloth in the strap pocket. You can also easily un-clip the camera from the strap so you can quickly put it on a tripod. Definitely recommend this if you're an avid photographer.",
      "rating": 5.0,
      "verified": true,
      "author": "Kerr",
      "helpful_votes": 0,
      "publication_date": 20180913
    },
    {
      "title": "I like it!",
      "text": "Mainly got this as a way to bike and safely carry the camera ... works great for that as well as long walks looking for the perfect shots. Hangs comfortably off your shoulder vs all that camera weight around your neck. Zippered storage for extra memory cards is nice but would not carry a spare battery without make the strap too rigid which made it sit on your shoulder in a uncomfortable manner. Receiving a new item that had been previously opened is disappointing but it appeared to be new and everything was there.",
      "rating": 4.0,
      "verified": true,
      "author": "Discovery",
      "helpful_votes": 0,
      "publication_date": 20181214
    },
    {
      "title": "Good product at a nice value",
      "text": "I got this for a week long hiking trip to Peru. It held up nicely. I have taken it on some day hikes and walks at the park with my dog to get a feel for it. The set up was easy. The camera feels secure on the strap. The base plate locks in well. I have put it on a tripod and that works well too. The strap wears comfortably. I have made a few adjustments on the strap length to get it to hang where I want it. That was easy. There was a product video too. I am satisfied with my purchase. Two thumbs up.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick M.",
      "helpful_votes": 0,
      "publication_date": 20170909
    },
    {
      "title": "really think about this one!",
      "text": "This is my second neck strap. The Anti slip pad peeled away from the first one. I think its because I constantly had to tighten the bolt that attaches the strap to the camera. I thought I was doing something wrong so I ordered another one but I'm having the same problem with the bolt continually coming loose!! Only this time I have a much larger and more expensive lens on my camera and the bolt does not stay tight!it loosens as soon as I let the camera hang. I absolutely do not trust this camera strap. The two stars are because I really love the idea of this strap, to bad the execution is not so great.",
      "rating": 2.0,
      "verified": true,
      "author": "mary",
      "helpful_votes": 0,
      "publication_date": 20180427
    },
    {
      "title": "Efficient, comfortable camera strap",
      "text": "This is a great camera strap! Much more efficient and more comfortable than hanging the camera around your neck.Also better than the one-shoulder type of strap. This one is a cross-body strap, and the camera rests at your waist, where you can easily grab it. I have a little bit of an objection to the way it attaches to the underside of the camera, as I also want to use a tripod occasionally. I had to tinker and slide things around in order to attach the tripod mounting brace. But I did get it to work eventually.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazoniac",
      "helpful_votes": 0,
      "publication_date": 20170825
    },
    {
      "title": "Love the product",
      "text": "Spoke to customer service and received a replacement which seems to be holding up much better thatn the adhesive on the original strap. Love the strap and the customer service. ****************************** Love the product but the rubber protective pad that goes on top of the mounting plate split and half of it is coming off. I have to be extra careful to fix it constantly so that the metal plate isn't rubbing against the bottom of my $750 camera. The adhesive is not strong enough to hold for anything more than an 18-55 kit lens it seems.",
      "rating": 4.0,
      "verified": true,
      "author": "Carrlos",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "One of the best purchase for my camera",
      "text": "One of the best purchase for my camera. I always had one hand to do things while going out but this made me into a regular human being with 2 hands. LOL Nicely build and very easy to take the camera off the strap. I just wished they had a shorter strap for a smaller individual like me. I get a little too much slack on the unused part of the strap.",
      "rating": 5.0,
      "verified": true,
      "author": "Kenny",
      "helpful_votes": 3,
      "publication_date": 20170603
    },
    {
      "title": "So much better!",
      "text": "I LOVE THIS! I love to pack my camera while hiking and the most annoying thing (for a woman especially) is having a larger chest it just bounces up and down and I always feel like I need to hold it. Not anymore! This goes on like a crossbody, the camera lays at my hip/side (I’m 5 feet tall but it’s very adjustable). The only thing that I’m scared of is the hook that holds your camera doesn’t feel very secure but it has never come apart on me. I did the extra security tether for good measure so that helps ease my mind.",
      "rating": 5.0,
      "verified": true,
      "author": "ERICA",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Great customer service, good product",
      "text": "Pros: durable, well-made, CUSTOMER SERVICE Cons: the online instruction was somewhat confusing to find, difficult to see in the video & time-consuming to watch. Also, the length is pretty long and difficult to make work for someone petite (I am 5’2”), although not impossible. I contacted their customer support to give them my feedback regarding the length, and how disappointed I was since I had really hoped for it to work after spending so much time trying to hook it onto my camera. They listened well and handled the return promptly & hassle-free. Hope they will come up with something for petite people in the future!",
      "rating": 5.0,
      "verified": true,
      "author": "JP00",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "Very Pleased!!",
      "text": "This is a preliminary review, I have not began shooting with it I will be out in the field with it shortly...when I open the package I was pleasantly surprised at the workmanship. I thought the shoulder strap would be too thick but it's actually very comfortable. I feel like it's a much much better alternative to the over the neck strap. The additional security strap is an awesome bonus. The strap is well designed and allows for talker for easy and quick access to the camera while keeping it out of the way when not in use.",
      "rating": 4.0,
      "verified": true,
      "author": "Kent Daniel",
      "helpful_votes": 0,
      "publication_date": 20170818
    },
    {
      "title": "Simple and effective, non-slip",
      "text": "This is an easy to use camera strap, and the safety tether is a nice addition. Even though it has never come loose, I feel better knowing there is a backup connection in case the main one would ever fail. The camera is easy to bring up to eye level quickly, and I don't get a sore neck like I do with the strap that comes with cameras.",
      "rating": 4.0,
      "verified": true,
      "author": "Alberta",
      "helpful_votes": 0,
      "publication_date": 20200817
    },
    {
      "title": "Does not work well with tripod",
      "text": "I bought this so I could use my strap and keep my tripod quick release plate attached to the camera. Using a Canon 6D with 24-105 lens, the camera is too heavy and slips/rotates around the mounting plate when the camera is in an upright position on the tripod. Tightened it down as hard as I could, but it still slips around the silver bolt. Not useful for what it was intended.",
      "rating": 2.0,
      "verified": true,
      "author": "Michael P",
      "helpful_votes": 3,
      "publication_date": 20170226
    },
    {
      "title": "Not what I expected",
      "text": "This item is not what I expected. I thought it was bluky when worn and uncomfortable. Item was made well, but I did not care for the material it was made from. Strap had a stiff feel. Overall, it was a good item and may suit your needs well. It just was not what I was looking for and I probably will never use it.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheryl ann",
      "helpful_votes": 0,
      "publication_date": 20201018
    },
    {
      "title": "Cross shoulder design helps in carrying heavy cameras all day",
      "text": "I have seen other people toting large cameras with straps that look like this one so my rating is just a preference issue. For me the benefit of a long cross shoulder strap for carrying any camera for a lengthy period, particularly a heavy full frame dSLR, is well proven in real world use. My main issue with this strap is the size of the slad that connects to the tripod screw. The strap has features that may make it desirable for some users but not for me. I prefer a different brand that has a simple screw in connection to the tripod socket on the base of the camera to minimize weight and complexity.",
      "rating": 4.0,
      "verified": true,
      "author": "bmoag",
      "helpful_votes": 0,
      "publication_date": 20180207
    },
    {
      "title": "nicely designed.",
      "text": "I like the idea of the quick release strap from the bottom of the camera. It is such a pain in the rear when the camera is placed on a tripod or monopod and the strap keeps getting in the way. The safety strap to insure you don't accidentally drop your camera when you unclip from the camera is an interesting idea, though I've not needed it thus far. I like the idea of the pocket on the shoulder strap. I've not used it yet, but the idea of not having to have my bag on me to carry little things like extra batteries and memory cards is a great idea.",
      "rating": 5.0,
      "verified": true,
      "author": "Patrick A.",
      "helpful_votes": 0,
      "publication_date": 20180501
    },
    {
      "title": "Not for the tall or overweight.",
      "text": "I am quite tall (6'5\") and the strap just isn't long enough even if fully extended. Makes it very awkward to carry around as it sits on your side rather than your waist and interferes with your arms, is hard to grab, and feel awkward to bring up to your eye. Its not a bad product, but they should give the length as a part of the description.",
      "rating": 3.0,
      "verified": true,
      "author": "Nathan Barnhill",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Terrible product!!",
      "text": "I read reviews and was highly excited to get it, as the strap that my camera came with was very uncomfortable. This one is better;however, my camera fell off (first day of use). I now have a very broken, very expensive DSLR that cannot be used. Do not purchase this!!",
      "rating": 1.0,
      "verified": true,
      "author": "BEH",
      "helpful_votes": 27,
      "publication_date": 20160424
    },
    {
      "title": "Rad sling!",
      "text": "Amazing sling. Of course first is the price. Then the build quality. The pad is a little stiff right out of the box but softens up quickly. Love the zipper pouch and two slots for SD cards built into the pad. The decorative woven strap looks sweet! The base plate that attaches to the camera is super sturdy steel, and is also threaded so you can quickly and easily attach to a tripod without having to take the strap off. But if you want to, it has a quick release and the extra safety strap carabiner all make removal a quick affair. One of my best purchases to date.",
      "rating": 5.0,
      "verified": true,
      "author": "Will Vonheeder",
      "helpful_votes": 0,
      "publication_date": 20170222
    },
    {
      "title": "Just what I wanted",
      "text": "The Altura Photo Rapid Fire Camera Neck Strap w/Quick Release and Safety Tether is made very well. it is very comfortable even after a full day of walking around and taking pictures with my camera. I have been using it for awhile now, and I am happy with my purchase. I would recommend it for those want a comfortable and secure strap, and the ease of quickly using your camera, without the strap getting in the way.",
      "rating": 5.0,
      "verified": true,
      "author": "Mike S",
      "helpful_votes": 0,
      "publication_date": 20190405
    },
    {
      "title": "The strap is comfortable, I used it on a Nikon B500 while ...",
      "text": "The strap is comfortable, I used it on a Nikon B500 while hiking. While that's not the biggest or heaviest camera, it did leave me with a sore neck when I used the neck strap it came with. This shoulder strap is much better, and I like the security of the safety tether. UPDATE: somehow the connector failed, I have no idea why, but my camera fell to the ground and broke. The safety tether wasn't on because it is too short when the strap is attached to a large lens.",
      "rating": 1.0,
      "verified": true,
      "author": "Kathleen Wright",
      "helpful_votes": 5,
      "publication_date": 20160822
    },
    {
      "title": "Great strap",
      "text": "Was second shooting at a wedding and saw the primary using this strap and knew I had to have one! I just bought my second one for my new camera and love these straps. The zippered compartment on the pad comes in handy to toss in extra SD cards, batteries, etc. Very comfortable and easy to grab the camera for the quick shots you don't want to miss...and best of all, my neck is thankful!",
      "rating": 5.0,
      "verified": true,
      "author": "CaptJJ",
      "helpful_votes": 0,
      "publication_date": 20200112
    },
    {
      "title": "Perfect for any photographer",
      "text": "This keeps my camera secure and safe, it’s not going anywhere and I put all my faith into letting my camera hang from it. The strap also has a spot for SD cards and cleaning cloth or w e else you can stuff into it, the strap is comfy on your shoulder and the adjustability is great. It has to clips on it so you can stop the camera and it stays in a certain spot on the strap. I love it",
      "rating": 5.0,
      "verified": true,
      "author": "Myles Hoffman",
      "helpful_votes": 0,
      "publication_date": 20190523
    },
    {
      "title": "This a great strap. The price is very reasonable considering what ...",
      "text": "This a great strap. The price is very reasonable considering what you get and other straps out there. The metal attaching plate combined with the metal clip is very secure. I feel very comfortable and do worry at all about my camera dropping. The strap is adjustable and allows your camera to ride safely and comfortable at you hip. If you have large telephoto lens like 150-600mm this is the perfect strap. You can attach the metal connector plate to the tripod mount on the lens avoiding stress on the camera itself. When you are hiking in the wild with a 6-8 pound lens attached to your camera you will be thankful you purchased the Quick release sling.",
      "rating": 5.0,
      "verified": true,
      "author": "Roy Michael Smarr",
      "helpful_votes": 0,
      "publication_date": 20160218
    },
    {
      "title": "Pretty nice.  No way to wear strap as shown for 5'9\" woman 135lbs  It sits on back",
      "text": "Wish the little pocket had a little more space. Otherwise very nice. Also, in making one size fits all the overlap is high. Should have looked for a kids version. Pretty nice. No way to wear strap as shown for 5'9\" woman 135lbs It sits on back",
      "rating": 4.0,
      "verified": true,
      "author": "rustlor",
      "helpful_votes": 4,
      "publication_date": 20170409
    },
    {
      "title": "Good product",
      "text": "Works great! I was used to the small shoulder strap that came with my T6i. So it took a little getting used to when I switched to this one. I love the zippered pocket to keep a microfiber cloth and extra SD card. The thing I dislike about it is the mount, it's big and bulky. I didn't have any issues with the thumb screw backing out. They use a rubber washer between the screw and mounting plate. This gives the screw some grip so it can't back out on its own very easily. I used the included safety strap just in case.",
      "rating": 4.0,
      "verified": true,
      "author": "Eymi",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Vast improvement over the factory strap",
      "text": "I really like this strap. Was on a trip and a friend had it. I ordered it as soon as I got home. The safety strap is a great idea. Not sure about the reviews saying the main hook broke and the camera dropped. Must not have hooked up the safety strap. It is 100 percent better than the strap that comes with the camera.",
      "rating": 5.0,
      "verified": true,
      "author": "Terry",
      "helpful_votes": 0,
      "publication_date": 20200214
    },
    {
      "title": "Great quality and works good for carrying camera around",
      "text": "Great quality and works good for carrying camera around. Pad has a small pocket in it that can hold SD cards or other small items. Strap is adjustable. Attachment bracket and clip are very high quality and will hold up nice. No worries of it breaking or camera coming unclipped from strap by accident, but it can be taken off really fast. Instruction video's for adjustment and different uses/mounting options was a plus as well.",
      "rating": 5.0,
      "verified": true,
      "author": "JasonM",
      "helpful_votes": 0,
      "publication_date": 20170912
    },
    {
      "title": "Sturdy and Makes Camera Secure",
      "text": "The product was as advertised and works great. But I'm not sure I will use it all of the time. I have another cross shoulder camera strap that is a little lighter and is a little less bulky. This strap does make me feel my camera is secure and the extra little connector strap is a major factor of this. I do not particularly light the connector that goes on the bottom of the camera (makes the camera sit awkwardly in my bags) but it is also a feature of the security arrangement. As for the quick access slide I feel my cross shoulder strap provides the same utility. Would I buy it again - yes.",
      "rating": 5.0,
      "verified": true,
      "author": "Bill S in Winchester VA",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "It’s good",
      "text": "I hate using straps but when I have to I use this one. I threw away the safety strap and the mounting plate and I attach the strap directly to the L bracket on my camera. Holds my 6d with a 70-200 f2.8 but makes me nervous. I usually keep my hand on the camera. With smaller lenses like the 24-105 f4 I have no worries. I’ve used this for over a year now. The bad reviews make you want to run and hide but my friend also uses this strap with his 80d and 70-200 f2.8 to shoot sports using the provided mounting bracket without any issues.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180628
    },
    {
      "title": "It's perfect. The strap has a zipped storage compartment to ...",
      "text": "I bought one of these to test it out. It's perfect. The strap has a zipped storage compartment to carry extra memory cards and a spare battery or two. The quick release works perfectly and allows you to disengage the camera quickly from the strap! It snaps back on in a split second. Ever want someone to take a picture of you using your camera? What a hassle to get it off from around your neck or shoulder. With this strap it unlatches in a split second. It's comfortable around your shoulder also. After taking this one for a test run I immediately bought two more. It's the best camera strap available.",
      "rating": 5.0,
      "verified": true,
      "author": "E M",
      "helpful_votes": 2,
      "publication_date": 20151214
    },
    {
      "title": "I really like how fast I can take the strap on and ...",
      "text": "I really like how fast I can take the strap on and off and it's comfortable and secure enough to wear all day. The screw that attaches to a tripod is a little loose but I haven't fiddled with it enough to see if there is a good solution to that yet. It isn't loose enough to be a safety concern, but it is loose enough that if the ball head on my tripod isn't quite loose enough when adjusting the camera, the camera still moves because of the loose screw on the strap. Not a huge deal, but I'd like it to be tighter.",
      "rating": 4.0,
      "verified": true,
      "author": "John Robinette",
      "helpful_votes": 0,
      "publication_date": 20180104
    },
    {
      "title": "The perfect alternative to around-the-neck straps",
      "text": "Far more superior then the standard around-the-neck strap. The reason I purchased this was because I grew very uncomfortable walking around for an entire day with a tradition strap. I've done some research about alternative camera straps and decided on this one. I could not be happier with my purchase. The comfort level is superb, and the camera suddenly felt \"lighter\" when strapped on this way when compared to around youe neck. I would recommend this strap to anyone looking for an alternative. Thank you",
      "rating": 5.0,
      "verified": true,
      "author": "JD",
      "helpful_votes": 2,
      "publication_date": 20170902
    },
    {
      "title": "Good but needs a tiny modification.",
      "text": "The padding is NOT thick enough on the base that screws onto the camera. This causes the screw to not be tight enough (on the Nikon D500 and D3500). To solve this, I used a piece of cork gasket material to add the extra thickness so the screw mount does not loosen when using the strap.",
      "rating": 4.0,
      "verified": true,
      "author": "Robert Briggs",
      "helpful_votes": 0,
      "publication_date": 20200111
    },
    {
      "title": "Very secure!!",
      "text": "This camera strap connects to the tripod screw hole very securely. The strap holds extra batteries, cards, and cleaning cloths without feeling bulky. I bought this after the \"stock\" strap on my Nikon slipped out of the bracket and damaged a valuable lens when it hit the ground. The only negative is that it does add some weight, but the security of the connection is well worth it to me.",
      "rating": 5.0,
      "verified": true,
      "author": "doc",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Very impressive",
      "text": "Just got this and I'm very impressed. It's pretty much a whole system. Everything is well made and looks very durable. I use a Manfrotto quick release plate and got this strap to attach on my video camera's carry strap - which it does very well. In addition, the base plate is well designed and could work with the quick release plate. There's a safety clip as well, and the shoulder pad has a zippered pocket for a couple of sd cards.",
      "rating": 5.0,
      "verified": true,
      "author": "David M. Williams",
      "helpful_votes": 0,
      "publication_date": 20170714
    },
    {
      "title": "Made my street photography 100x Better!!",
      "text": "Honestly if you want a good quality strap for your camera whatever size or weight it may be this is the strap you need. I’m able to slide my camera to eye level so quickly and precisely without people knowing I just took a picture of them for my street photography gallery! Haha not only is it convinent but it keep what truly matters safe. YOUR CAMERA will be secured! It comes with a padded strap and two metal security locks to make sure it won’t fall as you let it go! Great buy I really recommend it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Sanchez",
      "helpful_votes": 0,
      "publication_date": 20180602
    },
    {
      "title": "Perfect design , good for long shoots",
      "text": "After trying many straps, finally loved this one. This is perfect for long shoots. No shoulder or neck pain issue. It can carry full frame, telephoto lens with flash.",
      "rating": 5.0,
      "verified": true,
      "author": "MrCoolBlue",
      "helpful_votes": 0,
      "publication_date": 20191109
    },
    {
      "title": "Worked great on vacation!",
      "text": "This worked great for me on vacation. I could carry my camera at Disney World without having to stuff it in my pack or in a bag every time I need my hands. I didn't have to stuggle to get it out of a bag quickly to capture a image. The shoulder pads has storage for spare cards as well as other thin items, I carried some cash in mine the quick release is nice also.",
      "rating": 5.0,
      "verified": true,
      "author": "Jared",
      "helpful_votes": 0,
      "publication_date": 20190924
    },
    {
      "title": "Steer clear of this cheap junk",
      "text": "The clip for the emergency strap piece broke, used this maybe 10 Times. What a joke.",
      "rating": 1.0,
      "verified": true,
      "author": "Rob Baxter",
      "helpful_votes": 7,
      "publication_date": 20170830
    },
    {
      "title": "Good strap, awkward adjustment length.",
      "text": "Overall I’m happy with my new strap. The one thing I will complain about is the adjustable length strap gets in the way when I tighten it up, I don’t know what to do with it. It flaps around and if I try to pin it up, there is too much extra strap that hangs or flops. Other than that I like the option of carrying extra camera gear in the shoulder pad. Also I use the quick release hook but also have the back up “permanent” strap adjusted as extra back up encase my hook breaks. I hike and ride horses so I need something reliable and Strong",
      "rating": 4.0,
      "verified": true,
      "author": "Charbf22",
      "helpful_votes": 0,
      "publication_date": 20190415
    },
    {
      "title": "A word of caution!",
      "text": "I've used this camera sling for a couple years with a Nikon D800, and loved it. Then, without warning, the plastic buckle broke that keeps the strap you use to adjust the sling length and keep it cinched to that length. The sling immediately came apart. Fortunately I was able to keep the camera from hitting the ground. This is a great sling but the plastic buckle can make it unreliable over time. It would be much better if they made that part out of metal, to make it more durable.",
      "rating": 2.0,
      "verified": true,
      "author": "fairfield grands",
      "helpful_votes": 0,
      "publication_date": 20190611
    },
    {
      "title": "I really like this strap",
      "text": "I really like this strap. The straps that come with cameras are so uncomfortable (no padding), plus they announce what brand you are carrying. It allows the camera to be carried at my side instead of in front. There is also a little zipper compartment along the padding where you could put some emergency cash if needed. The safety tether is also a plus. Altura, from what i have seen, makes good quality products.",
      "rating": 5.0,
      "verified": true,
      "author": "Scott M.",
      "helpful_votes": 0,
      "publication_date": 20180908
    },
    {
      "title": "Just what I was looking for",
      "text": "I bought this for my Nikon d3500. It’s perfect! Easy to adjust, comfortable, and makes hiking with my camera easy for when I need those hands free moments. This strap is always attached to my camera. I love it. Great quality product for an affordable price. Very happy customer😊👍 oh and it holds my 2 extra batteries in the zippered pouch. Perfect!!",
      "rating": 5.0,
      "verified": true,
      "author": "asmith",
      "helpful_votes": 0,
      "publication_date": 20190406
    },
    {
      "title": "The camera is easily available to go to ready and shoot mode at ...",
      "text": "For photographers that take action pics, travel or to use a strap, get this strap. The camera is easily available to go to ready and shoot mode at any time. The pad provides additional pocket to carry extra cards, cleaning items or anything else one would need. I take photos of flag games and I am out there for hours, and this strap is comfortable and it carries the camera so well.",
      "rating": 5.0,
      "verified": true,
      "author": "W. Lee",
      "helpful_votes": 2,
      "publication_date": 20170725
    },
    {
      "title": "Working with it",
      "text": "I bought this so that I wouldn't have to carry my camera around my neck when we were on our cruise. It is still a work in progress for me but it is less stressful and less awkward than having a camera bouncing on you all day. Once i finally get it adjusted I think it will be great.",
      "rating": 4.0,
      "verified": true,
      "author": "Mike",
      "helpful_votes": 0,
      "publication_date": 20200101
    },
    {
      "title": "Great looking strap, but!",
      "text": "The idea of carrying my camera with its heavy lens, hanging down with just the tripod port to hold it to the cable, is a bit uncomfortable in reality. I'd prefer a long neck strap, that hooked onto the camera handles. So I won't being using this thing.",
      "rating": 3.0,
      "verified": true,
      "author": "MiamiOne",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Nice Strap",
      "text": "Nice, much better then the regular strap that comes with the camera. I like that I don’t have to take off the adapter to mount it to a tripod. Easy to setup and like that it keeps the camera hugged to the body.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191026
    },
    {
      "title": "Very comfortable and great camera strap!!",
      "text": "Altura makes great products for cameras. I have owned their products before. This strap is very comfortable and comes with secured \"L\" hook. Padding is thick and my shoulder and neck now have less pain after shooting all day for weddings!",
      "rating": 5.0,
      "verified": true,
      "author": "NYCPizza",
      "helpful_votes": 0,
      "publication_date": 20200815
    },
    {
      "title": "17 months of use, 5 days a week, finally broke.",
      "text": "This is a sturdy camera strap for almost all applications. It's comfortable, sturdy, and stylistically unremarkable. I used mine 5 days a week for 17 months and it finally failed. The swivel portion of the clamp gave out, separating the camera from the strap. Fortunately my camera did not fall. I think that's a good run for a strap, though. I wound up laying a little over a dollar a month for using this thing. If you're only using it on weekends it will probably last you forever.",
      "rating": 4.0,
      "verified": true,
      "author": "Michael Rouse",
      "helpful_votes": 0,
      "publication_date": 20180630
    },
    {
      "title": "I do like the way I can bring my camera up quickly",
      "text": "Ok, I read the \"warnings\" and the horror story of the strap clip breaking, but I have had no problems and my only grips are that my tripod mount is blocked and after a very long day my shoulder starts to feel sore. All in all, make sure to use the provided safety strap and check for signs of wear before using",
      "rating": 4.0,
      "verified": true,
      "author": "spincast1123",
      "helpful_votes": 0,
      "publication_date": 20190815
    },
    {
      "title": "Much better than the OEM",
      "text": "Using this with a Canon 6Dii with a 24 - 105 lens. I mainly shoot my kids and having to swap between camera man and dad was difficult with a strap that put the camera right out front where it could be kicked. This moves it to the side and out of the way when I'm not shooting. Moving it to my eye to get the perfect picture is fast and easy.",
      "rating": 5.0,
      "verified": true,
      "author": "GadgetGuyD.C.",
      "helpful_votes": 0,
      "publication_date": 20190402
    },
    {
      "title": "Great strap, but more detailed instructions, please?",
      "text": "I love this strap! It’s made of great materials. However, I’m still not sure I have it attached to the camera correctly. I’ve watched the video, followed instructions and, while I’m pretty sure the main strap is on correctly, I’m not sure I have it on backwards, and I don’t think the safety strap is on how it should be. I am pretty good at figuring stuff out, but this has me stumped.",
      "rating": 5.0,
      "verified": true,
      "author": "paleofemme",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "I would have quickly returned this item, but needed ...",
      "text": "I would have quickly returned this item, but needed a strap for a trip. The seller has all sorts of tutorial videos online, which I found to be confusing and/or meaningless. There are two \"limiter clips\" which are of no value. More importantly, the strap has very little adjustment for length and the camera wants to hang at mid-thigh level even for someone 6 ft tall. I could not find anything on the tutorials about adjusting the length.",
      "rating": 2.0,
      "verified": true,
      "author": "A Reader III",
      "helpful_votes": 0,
      "publication_date": 20170504
    }
  ],
  "product_meta": {
    "title": "Altura Photo Rapid Fire Camera Neck Strap w/Quick Release and Safety Tether",
    "description": "Color:Neck Strap\n\nRapid Fire Quick Release Sling Shoulder Neck Strap by Altura Photo for DSLR Cameras\n\nThe Rapid Rapid Fire Camera Shoulder Strap by Altura Photo is designed for ultimate comfort, security and speed. This cross-body design is ideal for all DSLR, mirrorless, or compact system cameras. The ergonomic shoulder pad fits on either shoulder allowing the camera to hang on either side, close to the hip, to capture the moment in a split second. Stress on your neck and back is a thing of the past. Whether you shoot indoors or out, weddings, wildlife, sports, or events the Rapid Fire Camera Strap by Altura Photo will have your camera secured close to your hip, out of the way, and ready in an instant.\n\nPackage includes:\n1x Rapid Fire strap\n1x Mounting Base Plate\n1x Camera Safety Tether\n\nProduct Features:\n\n- Durable all-metal clasp secures strap to the mounting base plate.\n- Adjustable strap length with soft non-slip ergonomic shoulder pad.\n- Zippered accessory pocket allows you to store small accessories for quick access.\n- New and reinforced extra strong metal mounting screw with anti-slip rubber pad for a secure fit.\n- The included strong camera safety tether provides a backup connection point between your camera and strap for additional security.\n- Attach your camera to a tripod without having to remove the mounting base.\n\nCompatibility:\n\n- Designed for DSLR, mirrorless, and compact system cameras with a standard 1/4 tripod mount.\n- e.g. Canon EOS 5D IV 7D MK II 80D 70D REBEL T6S T6I T3I SL1 XTI XSI\n- e.g. Nikon: D810 D750 D500 D7200 D5500 D5300 D3300 D3200 D90 D5000",
    "rating": 4.5,
    "feature_bullets": [
      "LIGHT AND COMFORTABLE: Neoprene pad distributes weight perfectly, with comfortable design shaped to fit perfectly around shoulder for constant use and travel. Even includes a zipper pocket for storing extra batteries, memory cards, etc.",
      "REINFORCED MATERIALS: Durable reinforced solid metal plate (not plastic!) securely fastens your camera onto the strap. The plate also features a protective rubber bottom layer to prevent slippage or scratches.",
      "FULLY ADAPTABLE: Plate and camera can be attached to a tripod without needing to remove the plate from the camera! Features quick-release design for easy attachment and removal while using your camera. Easy to take photos while on the go!",
      "UNIVERSAL COMPATIBILITY: Compatible with any DSLR Camera with a standard ¼\" tripod screw mount. (Includes: CANON EOS R RP 70D 80D 90D 77D 1D 6S 5D Rebel T7 T7i T6i T6s T5i T4i T3i T3 T2i SL1 SL2 SL3 NIKON Z6 Z7 D7100 D7200 D7500 D5500 D5600 D3500 D3400 D3300 D90 D80 D610 D750 D810 D850 SONY Alpha A7 A7ii A7iii A7Rii A7Riii A7Riv A7S A7Sii A9 A6000 A6100 A6300 A6400 A6500 A6600 A5100 A68)",
      "PREMIUM CUSTOMER SERVICE: Backed with DIGITAL GOJA 90-Day 100% Satisfaction Guarantee"
    ],
    "specifications": {
      "Package Dimensions": "15.2 x 2.7 x 0.4 inches",
      "Item Weight": "8 ounces",
      "ASIN": "B00GR8KEMS",
      "Item model number": "UZ0004",
      "Customer Reviews": "4.5 out of 5 stars2,321 ratings4.5 out of 5 stars",
      "Best Sellers Rank": "#8 in Binocular, Camera & Camcorder Straps",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "June 29, 2015",
      "Department": "Photography",
      "Manufacturer": "Altura Photo"
    },
    "categories": [
      "Binocular, Camera & Camcorder Straps",
      "Electronics",
      "Camera & Photo",
      "Bags & Cases"
    ],
    "price": 17.99
  }
}