{
  "website_summaries": [
    {
      "verdict": "A sturdy, safe mountain bike tire that will keep up with where you want to go.",
      "pros": [
        "Good traction and great performance on loose, rocky trails",
        "Features a puncture protection layer",
        "Black Chili Compound reduces rolling resistance by 26%",
        "Offers 30% more puncture protection"
      ],
      "cons": [
        "A little narrower than expected for a mountain bike tire"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "BEWARE! Planet Cyclery does not sell the Protection model!",
      "text": "I received the cheapo made in India model, not the Protection model with Black Chili compound that is made in Germany. Look at the table on the Conti website -- this model is supposed to be made in Germany. Also, no packing slip was included, and the packaging for the tires (which includes the part number) had been removed. This was very suspicious.",
      "rating": 3.0,
      "verified": true,
      "author": "Paulba",
      "helpful_votes": 17,
      "publication_date": 20150423
    },
    {
      "title": "Best Tire - don't waste your money on anything else",
      "text": "Been riding these with Stans for 4 years, mounting and sealing is faster than any other tubeless tire around. . The ProTection is a must, stiffer sidewalls. I'm only riding 26psi front & 30psi rear GREAT WEAR - I ran one tire a full year, riding 20-30 miles every weekend. No Flats for that entire year. Tried other tires for $90...they didn't last half as long",
      "rating": 5.0,
      "verified": true,
      "author": "Patti A.",
      "helpful_votes": 11,
      "publication_date": 20141017
    },
    {
      "title": "Very Pleased",
      "text": "I had a set of these previously on my Jamis 29'er and they worked great. I sold that bike (29 not for me) and got another Jamis only this time 26.5 with a smaller frame. Stock tires not so good, bought a set of 2.35 X 26.5 Bontranger X-4 Experts for way too much money on the sales man;s recommendation. Rode those for a few months and hated them. Too big, too floaty - maybe good for soft surface. Went back to the Conti's (smaller at 2.20) and they really dig in. Better steering, better traction on climbs. Nicequality as always from Conti, and easy to install.",
      "rating": 5.0,
      "verified": true,
      "author": "Douglas G. Mathewson",
      "helpful_votes": 0,
      "publication_date": 20180811
    },
    {
      "title": "Good overall, perhaps lacking in long term durability",
      "text": "I put the Mtn King 2.4 on front and a X King 2.2 on the rear. I primarily ride xc short distances (15 miles). Most trails I ride are dusty, rooted, and have some rocks. I've had both tires mounted for about 100 miles and the Mtn King had performed well and seems to be holding up decently. A few of the knobs have chipped off, which is a bit concerning given such low mileage. Overall, I think it's a good tire for the price. Hopefully it lasts for a few hundred miles.",
      "rating": 4.0,
      "verified": true,
      "author": "B. Sorensen",
      "helpful_votes": 5,
      "publication_date": 20160814
    },
    {
      "title": "Bad bead. Hopefully 2nd one is better.",
      "text": "I bought this tire for my rear wheel to aid in cornering and climbing. It seemed great but kept losing air. I tried more Stan's fluid but it kept losing air still. There was a noticeable break at the bead and the rim and I figured it just wasn't seating well. I brought it to a bike shop and they confirmed that the bead was just manufactured slightly warped and will never hold air in a tubeless setup. So I'm currently in the process of exchanging this. I'm not going to give up, hopefully this was an isolated incident.",
      "rating": 3.0,
      "verified": true,
      "author": "Mr. mixelpix",
      "helpful_votes": 0,
      "publication_date": 20181013
    },
    {
      "title": "narrower than advertised and will not mount tubeless",
      "text": "The 27.5 x 2.4 is not true to size. I'm running a 2.4 Trail King on the front and this Mountain King is noticeably narrower. Also, I could not get this tire to mount tubeless. I even took it to two separate bike shops and no one could get it setup. I think this may be a fake Conti.",
      "rating": 1.0,
      "verified": true,
      "author": "A. Kubik",
      "helpful_votes": 3,
      "publication_date": 20160514
    },
    {
      "title": "2 on another bike so it is not a perfect comparison. I think these would favor hard pack ...",
      "text": "I don't think they are as grippy as the Trail Kings but definitely a lot lighter. I have to say though, I have the TK 26 x 2.2 on another bike so it is not a perfect comparison. I think these would favor hard pack a little more than loose over hard but they still perform exceptionally well in most conditions (and I push every trail I ride to the brink of its limits, no Sunday cruising). Wear much better than Schwable Hans Dampfs of which I will never buy Schwables again (not worth the price). I will continue to buy Continental Black Chilli tires for as long as they are manufactured.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161017
    },
    {
      "title": "Great Grip and Wear, Not Perfect for Wider Rims",
      "text": "I really like these tires. They provide good grip and are quite manageable at the limits. They never just break away for me but allow me to compensate as they start to slide. They've also lasted me a long time so far. I have wide rims and the sidewalls of these tires bulge out a bit. I ride in rocky areas and the sidewalls are wearing faster than the tread. Still, even with all of the sidewall wear, there are no cuts and they still hold air with some help from Stans.",
      "rating": 4.0,
      "verified": true,
      "author": "K. Lewis",
      "helpful_votes": 0,
      "publication_date": 20160814
    },
    {
      "title": "I signed up to do the Fruita and Moab Kokopelli ride and the organizer recommended these tires",
      "text": "These are the bomb? I signed up to do the Fruita and Moab Kokopelli ride and the organizer recommended these tires. They are very stable and handle a lot a abuse. Not too soft so you can use them if you have Tarmac riding in the mix. I went 2.4 front and 2.2 back - really do love these tires they are my go to!",
      "rating": 5.0,
      "verified": true,
      "author": "Loyal Prime Member",
      "helpful_votes": 0,
      "publication_date": 20180519
    },
    {
      "title": "but the bike seems to handle a good bit better than it did",
      "text": "I used the 2.2-wide tire for the rear of my mountain bike. I have gone tubeless. It sealed up with no problem once I got the bead to pop into place. Not only did it replace my failed tire, but the bike seems to handle a good bit better than it did. I am happy with this tire.",
      "rating": 5.0,
      "verified": true,
      "author": "Liz Tailor",
      "helpful_votes": 0,
      "publication_date": 20180107
    },
    {
      "title": "Tough tires",
      "text": "Compared to Specialized Grid tires that I previously had they seem to be as narrow as the Specialized 2.1 I had despite having larger supposed width by number. They do seem to not wear as easily as the Soecialized Grid and still provide good grip on the trails I ride in Las Vegas. Side walls and knobs seem to be sturdier too as I have scraped against plenty of rocks with no damage so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Curtis H",
      "helpful_votes": 0,
      "publication_date": 20160901
    },
    {
      "title": "Air leaking",
      "text": "The tire sealed well but air leaks from the sides. Added more sealant but does not helped. Looks like defect of manufacturing because it leaking at too specific areas. Good traction. One more start for that. Too noisy one star minus. Wasted 40$ not big deal but annoying.",
      "rating": 1.0,
      "verified": true,
      "author": "Michael Shvartzman",
      "helpful_votes": 0,
      "publication_date": 20180722
    },
    {
      "title": "This looks like where it may have been folded during packaging",
      "text": "I road on this tire for 300 miles and then it developed a major leak at the base of the bead. This looks like where it may have been folded during packaging. I also noticed 2 other areas where small leaks had developed. This was set up tubeless when it failed using Stans sealant. Love the traction of this tire when it holds air.",
      "rating": 1.0,
      "verified": true,
      "author": "rod murison",
      "helpful_votes": 0,
      "publication_date": 20180417
    },
    {
      "title": "it might be fake, my bike store said they ...",
      "text": "it might be fake, my bike store said they even looked fake, the logo is blurry on the tire, is yours too?",
      "rating": 1.0,
      "verified": true,
      "author": "MasterTechnology",
      "helpful_votes": 2,
      "publication_date": 20160530
    },
    {
      "title": "Great all round MTB tire",
      "text": "Great all round MTB tire. Tubless setup was very easy on my sun single black flag wheels, even held pressure w/o sealant. Outstanding grip and pretty good rolling resistance for a knobby tire. Been running them at 30 psi and I'll probably still drop it a few lbs. The only reason for the 4 stars is they run small. I bought both a 2.4\" and 2.2\" and they measure 2.2\" and 2.0\" respectively when mounted",
      "rating": 4.0,
      "verified": true,
      "author": "Whatthewhat",
      "helpful_votes": 0,
      "publication_date": 20140710
    },
    {
      "title": "Outstanding Deal outstanding tires!",
      "text": "Outstanding deal, I even got the Black Chili compound and ProTection tubeless ready for $24 each what a smoking deal!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Justin  San Antonio",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Five Stars",
      "text": "Very good product, Highly recommended for mountain​ bike, definitely I buy again with the buyer.. Regards...",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170911
    },
    {
      "title": "65PSI tires love it!",
      "text": "Awesome tires I'm 6'0 and my weight is 350 pounds I don't have any problems with this tires, running rear tire with 55psi and the front one with 45psi I highly recommend this tires for anyone out there and more if you are trying to lose weight like me :D",
      "rating": 5.0,
      "verified": true,
      "author": "Qwerty-Keyboard-Fan",
      "helpful_votes": 0,
      "publication_date": 20151027
    },
    {
      "title": "Really good all around tire but you will need to add ...",
      "text": "Really good all around tire but you will need to add more Stan's (1-2 small bottles) after the first ride. Leaving the tire at 50 psi overnight helps too.",
      "rating": 5.0,
      "verified": true,
      "author": "jharvey24",
      "helpful_votes": 0,
      "publication_date": 20161122
    },
    {
      "title": "Decent",
      "text": "Decent tire for the money. Fairly aggressive tread pattern. Poor choice for the pavement.",
      "rating": 4.0,
      "verified": true,
      "author": "Steven D.",
      "helpful_votes": 0,
      "publication_date": 20180211
    },
    {
      "title": "Work perfectly with Stans ZTR Arch EX 29er wheels for tubeless setup",
      "text": "I mounted these on some Stan's wheels and didn't need to use a compressor to seat the bead, just quick pumping with a floor pump. They almost held pressure without any sealant! Used ~2.5oz sealant and now they are completely sealed. The interior wall construction is definitely thicker with ProTection, but this is what you want with a tubeless set up when you will be crushing the sidewalls constantly on the trail running sub-25 PSI.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Mason",
      "helpful_votes": 0,
      "publication_date": 20140522
    },
    {
      "title": "Great tires. Order two both made in germany",
      "text": "Great tires. Order two both made in germany. Installed them with continental tubeless liquid to make them work great. No air lost. Already put 559 km and have had no problems",
      "rating": 4.0,
      "verified": true,
      "author": "Javier",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Happy Customer! Getting Another!",
      "text": "Got the 26x2.4 for the front my my Giant and LOVE IT! Had the Nobby Nic 26x2.35 on there and I can definitely ride harder and more aggressive down. Rolling Resistance isn't bad either, but I'm 200 lbs without any gear, so I wouldn't know. There's a ton of tread on these! They actually rubbed a little on my front mini-fender. I'm in NorCal, Humboldt area, and these tires have performed very well. A big improvement! I'll probably get another continental tire when my rear Nobby Nic wears down. Price was fair, I'm not spending more than $40 on bicycle tire! Get em!",
      "rating": 5.0,
      "verified": true,
      "author": "Munichikin",
      "helpful_votes": 7,
      "publication_date": 20150401
    },
    {
      "title": "NOT TUBLESS ... NOT UST",
      "text": "Definitely NOT tubless No nope suck Leaking air right out of the sidewall around the complete tire JUNK",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20181225
    },
    {
      "title": "Junk!!!",
      "text": "Save your money. I have tried for a month to get these tires to seal up. It has a hundred tiny pin holes in the sidewall. The only reason I gave it a one star is because Amazon made me chose one to post this review.",
      "rating": 1.0,
      "verified": true,
      "author": "Brenda",
      "helpful_votes": 0,
      "publication_date": 20170731
    },
    {
      "title": "Five Stars",
      "text": "amazing is the only word for these little hard to stop the first time but they break in easily",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R.",
      "helpful_votes": 0,
      "publication_date": 20180301
    },
    {
      "title": "Five Stars",
      "text": "These tires run well on smooth pavement as well as on trails. They have a very well designed tread.",
      "rating": 5.0,
      "verified": true,
      "author": "gladius",
      "helpful_votes": 0,
      "publication_date": 20161130
    },
    {
      "title": "Good stuff",
      "text": "Great tire. Easy to seal with Stans on Stans rims. Great on the trail. A bit noisy on the pavement.",
      "rating": 5.0,
      "verified": true,
      "author": "John Deckmann",
      "helpful_votes": 0,
      "publication_date": 20170902
    },
    {
      "title": "Torn sidewall",
      "text": "Rode these about 2.5 months before the sidewall tore off from the tire bead. The tear was about an inch and looked like a defect since it was inside of the rim and not on the sidewall at all. I was going around a bermed turn when it happened and I had not hit any rocks.",
      "rating": 2.0,
      "verified": true,
      "author": "Pamela A Carrington",
      "helpful_votes": 0,
      "publication_date": 20180812
    },
    {
      "title": "Great tire.",
      "text": "Wow just wow. So much better grip all around. I am getting much better grip on all surfaces and also ran tubeless with these and they sealed right up.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180208
    },
    {
      "title": "After getting them installed on bike they developed a bulge ...",
      "text": "After getting them installed on bike they developed a bulge right off the bat. Maybe I'm being knit picket but could definitely tell I had a smoother ride when I switched to bontrager tires that didn't bulge",
      "rating": 2.0,
      "verified": true,
      "author": "eldest90",
      "helpful_votes": 0,
      "publication_date": 20180615
    },
    {
      "title": "Awesome",
      "text": "Amazon tires. Love it good grip and excellent endurance in splinters areas",
      "rating": 5.0,
      "verified": true,
      "author": "Zamir Alshech",
      "helpful_votes": 0,
      "publication_date": 20180404
    },
    {
      "title": "Great at low tire pressure...gets over slippery terrain.",
      "text": "Nice traction. Seems really solid on slippery conditions, which I like to go out in. I just let the air way out and it rolls over anything!",
      "rating": 5.0,
      "verified": true,
      "author": "cc",
      "helpful_votes": 0,
      "publication_date": 20160120
    },
    {
      "title": "Fake? Defective?",
      "text": "Not sure what is up with the tire I received... I was under the impression that \"ProTection\" indicates tubeless ready?? I have no issue mounting the tire or getting it to seat properly... The issue is with MASSIVE leaking from the sidewall of the tires. Once I had the tire mounted and seated properly, I deflated and added sealant... Then I pumped up the tire again and shook around to disperse sealant.... Low and behold.... I noticed the PSI was dropping slowly... Pulled out my spray bottle with soapy water, sprayed on the tire, and there were hundreds of leaks from the sidewalls all over the tire.... Really disappointing.",
      "rating": 1.0,
      "verified": true,
      "author": "Shredder",
      "helpful_votes": 2,
      "publication_date": 20161009
    },
    {
      "title": "Five Stars",
      "text": "Very good, inexpensive tires. I use them with tubes though.",
      "rating": 5.0,
      "verified": true,
      "author": "LukeDoodle",
      "helpful_votes": 0,
      "publication_date": 20151123
    },
    {
      "title": "They hook up great and roll really well for a pretty burly tire",
      "text": "Have ridden these for a year now with no flats or burps. They hook up great and roll really well for a pretty burly tire.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160301
    },
    {
      "title": "Five Stars",
      "text": "Got them mounted easily, upgraded my traction from previous tires, smooth quiet ride on street, good grip on trails.",
      "rating": 5.0,
      "verified": true,
      "author": "Oz",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Best tire for DH and also for trail",
      "text": "Wow Wow Wow 5 stars. The best tire for DH. Sticks like crazy,",
      "rating": 5.0,
      "verified": true,
      "author": "Technical quality Expert",
      "helpful_votes": 0,
      "publication_date": 20161123
    },
    {
      "title": "Recommend for the front.",
      "text": "Nice tire. Good cornering. Fast. Has given me more confidence to leave the ground and reconnect safely. It's on the front of my stump jumper FSR expert with a Tsali forte on the rear. Good fast combination.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160428
    },
    {
      "title": "set up tubeless very easily. It's going to Whistler this week",
      "text": "Have yet to extensively ride it, top notch construction, set up tubeless very easily. It's going to Whistler this week!",
      "rating": 4.0,
      "verified": true,
      "author": "root",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Great tires at a great price",
      "text": "Thanks for the quick shipping. Replaced the tires which had come on my Trek and were showing sidewall cord. The Contis are much higher quality!",
      "rating": 5.0,
      "verified": true,
      "author": "Doug Bradley",
      "helpful_votes": 0,
      "publication_date": 20140525
    },
    {
      "title": "Five Stars",
      "text": "Locally I'm known as THE Mountain King so that's why I bought them.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark Flatley",
      "helpful_votes": 0,
      "publication_date": 20150909
    },
    {
      "title": "Three Stars",
      "text": "One tire had a bad fold crease. Hope it still seals ! Great tires so far...",
      "rating": 3.0,
      "verified": true,
      "author": "Lee Tydlaska",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "Great front tire",
      "text": "Great front tire. Really like the grip and the how easy it was for it seal when I use it tubeless",
      "rating": 5.0,
      "verified": true,
      "author": "eranc",
      "helpful_votes": 0,
      "publication_date": 20150331
    },
    {
      "title": "Five Stars",
      "text": "Really happy with the trail performance of this tire after about 10 rides with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Gator1",
      "helpful_votes": 0,
      "publication_date": 20150926
    },
    {
      "title": "Five Stars",
      "text": "great tire a little hard to get on with out tools",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Great all-around tires.",
      "text": "I have bought 4 of these tires and have them on two bikes (one 26\" and one 29\"). Great all-around tires. No flats in the first year.",
      "rating": 5.0,
      "verified": true,
      "author": "Endre V.",
      "helpful_votes": 0,
      "publication_date": 20150625
    },
    {
      "title": "The best mtb tire I ever bought",
      "text": "Superb grip on all terrain. The best mtb tire I ever bought.",
      "rating": 5.0,
      "verified": true,
      "author": "eocamir",
      "helpful_votes": 0,
      "publication_date": 20160621
    },
    {
      "title": "BEST TIRE EVER",
      "text": "One of the best and affordable tires on the market! I have bought two sets of these tires on Amazon and they grip really well. Continental was not lying when they said that their Black Chili compound can grip to anything. I have not wiped out on my bike since buying these tires. They do not weigh much and can be converted to tubeless. The reason why I'm giving this product a four star rating is because the tire bead is very hard to set and it is a really tight fit. Other than than that, this is a great product.",
      "rating": 4.0,
      "verified": true,
      "author": "Shirley L.",
      "helpful_votes": 0,
      "publication_date": 20161120
    },
    {
      "title": "Great tire",
      "text": "I love this tire on the back of my bike to compliment my Continental Trail King in the front.",
      "rating": 5.0,
      "verified": true,
      "author": "J. Francis",
      "helpful_votes": 0,
      "publication_date": 20150904
    },
    {
      "title": "Good tire but the 2.2\" only measures 2.05\" wide",
      "text": "This is a well made tire but after mounting it on my bike it looked narrow. The 2.2\" tire measures 2.05\" wide mounted on Velocity Blunt rims. Sending it back and may try the 2.4\" version.",
      "rating": 3.0,
      "verified": true,
      "author": "..",
      "helpful_votes": 6,
      "publication_date": 20150503
    },
    {
      "title": "Great grip once they're mounted (though an awful pita to ...",
      "text": "Great grip once they're mounted (though an awful pita to mount due to shipping creases in the beads). It lasted about six months, mounted on the rear, before going completely wobbly (I thought I'd bent my rim, it rubbed the chainstay so badly). I tried remounting/reseating it about a half dozen times before a net search revealed others' reports of the inner cords breaking on this model, which seems like that's what's happened with mine: the bead is evenly seated but one section of the tire is offset about 30%. It was good while it lasted (and once I repressed the anguish of mounting it tubeless the first time), so still 3 stars.",
      "rating": 3.0,
      "verified": true,
      "author": "Edward V.",
      "helpful_votes": 0,
      "publication_date": 20150402
    },
    {
      "title": "Sweet!",
      "text": "They turn in great, rolls over many types of surfaces very well, grips on climbs. First ride thoughts; very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "skeaton250",
      "helpful_votes": 0,
      "publication_date": 20150919
    },
    {
      "title": "Knockoff continental tire",
      "text": "Item is a knockoff I was at a MTB even in Central Florida (Santos Fat Tire Festival) and Continental tires were there I ask the to check my tire because it seems weird and smaller then what is described and their answer was is not an original continental tire but a knockoff.",
      "rating": 1.0,
      "verified": true,
      "author": "Nelson",
      "helpful_votes": 3,
      "publication_date": 20150309
    },
    {
      "title": "Very good grip long lasting and durable",
      "text": "Second time I ordered this tire. Very good grip long lasting and durable. I run it tubeless and never had a flat. I ride hard on hard pack single tracks with rocks and gravel with some soft sandy and rutted terrain.Climbs great on loose gravel and sticks to the trail on those quick tight turns. I'm very happy with this tires performance.",
      "rating": 5.0,
      "verified": true,
      "author": "Graybeard",
      "helpful_votes": 0,
      "publication_date": 20150314
    },
    {
      "title": "Five Stars",
      "text": "Have it paired with trail king and it kicks butt on everything",
      "rating": 5.0,
      "verified": true,
      "author": "JB",
      "helpful_votes": 0,
      "publication_date": 20151203
    },
    {
      "title": "Now running MTN Kings both front and rear and think I like this setup even better than X-king R & MtnKing ...",
      "text": "As we ride many rock gardens throughout Central Texas, the Kevlar Sidewall protection worth every penny. I have worn the knobs down on two rear 2.2\" CrossKing ProTections before sidewall blowout while running a single 2.4 MTN King on the front. Now running MTN Kings both front and rear and think I like this setup even better than X-king R & MtnKing F.",
      "rating": 5.0,
      "verified": true,
      "author": "Richard Head",
      "helpful_votes": 0,
      "publication_date": 20150708
    },
    {
      "title": "Great tire",
      "text": "Have to add extra stans to get tires to seal. Otherwise great tough tire.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Five Stars",
      "text": "Great traction on all loose surfaces. Would definitely buy again.",
      "rating": 5.0,
      "verified": true,
      "author": "Todd Benton",
      "helpful_votes": 0,
      "publication_date": 20160121
    },
    {
      "title": "2.2 size is Small.",
      "text": "The 2.2 size in 29er is small. It looks just like my 2.1 WTB Nanos I replaced. The reason for buying a 2.2 was for more size. Buy the 2.4!",
      "rating": 3.0,
      "verified": true,
      "author": "Jeremy Bailey",
      "helpful_votes": 0,
      "publication_date": 20140606
    },
    {
      "title": "Appears very good sidewalls, which is why I purchased it - ...",
      "text": "Prior tire Specialized The Captain. Bike - Giant Trace X. Used as a rear tire. Appears very good sidewalls, which is why I purchased it - to avoid sidewall tears, which happed with The Captain. Good rolling ability and traction. Loose in the sand. Leave tire out in the sun for a few hours and it go on easily.",
      "rating": 5.0,
      "verified": true,
      "author": "paul kalfus",
      "helpful_votes": 0,
      "publication_date": 20150724
    },
    {
      "title": "Casing failed.",
      "text": "All that work to get the right tire and not worth it. Casing failure after maybe 200-300 mi. Per google this is a not uncommon issue. This is a newer tire (Dec 2015, had just arrived to amazon) which indicates to me that Conti hasn't fixed the issue as the internet implies. Have tried to contact Continental, but no luck. An expensive mistake.",
      "rating": 1.0,
      "verified": true,
      "author": "N. Meyer",
      "helpful_votes": 3,
      "publication_date": 20151213
    },
    {
      "title": "maybe better than ok",
      "text": "Beware! This is an ok, maybe better than ok, tire but I'm giving it one star to attract attention that the description is bs... these are not the black chlli as claimed. they're the 'normal' conti compound and labeled \"made in India\". I have no problem with a tire made in India, but Continental is pretty clear that the black chilli compound is only made in their German factories... If the price seems too good to be true (but these are not cheap), you should assume it is.",
      "rating": 1.0,
      "verified": true,
      "author": "jb",
      "helpful_votes": 5,
      "publication_date": 20150503
    },
    {
      "title": "Sent em back",
      "text": "Received the wrong tires. Supposed to be black chili and german mfg. they were neither.",
      "rating": 1.0,
      "verified": true,
      "author": "Greenly",
      "helpful_votes": 2,
      "publication_date": 20160122
    }
  ],
  "product_meta": {
    "title": "Continental Mountain King II Fold ProTection Bike Tire",
    "description": "Now in its second reign, the Mountain King II strengthens its rule over the all-round trail bike market. Available in 2.2 & 2.4, superb braking traction and optimum cornering are guaranteed in all types of conditions. The tread lug arrangement was developed in collaboration with professional mountain bikers, resulting in an easy-rolling, yet exceptionally versatile trail tire. Trail riders, Cross Country racers, Alpine tourists and Marathon riders - this is a serious all-condition tire option.",
    "rating": 3.9,
    "feature_bullets": [
      "BLACK CHILI- Features Continental’s revolutionary Black Chili Compound which reduces rolling resistance by 26% improves grip by 30% and adds 5% more mileage out of your tire.",
      "PROTECTION SYSTEM- Continentals ProTection system with an additional puncture protection layer, is 25% lighter and offers 30% more puncture protection.",
      "PRO TREAD LUG DESIGN- The tread lug arrangement was developed in collaborations with pro mountain bikers, resulting in an easy rolling and versatile tire.",
      "HANDMADE IN GERMANY-Continental has been hand making their tires since 1871, maintaining the integrity of tradition, while evolving with the most advanced technology.",
      "PROTECTION TUBELESS READY- The ProTection equipped tires are compatible with UST and tubeless ready rims, and when combined with Revo Sealant offer excellent tubeless performance."
    ],
    "specifications": {
      "Package Dimensions": "10 x 7.5 x 4 inches; 1.58 Pounds",
      "Item model number": "C1219020-Parent",
      "Date First Available": "November 17, 2009",
      "Manufacturer": "Continental",
      "ASIN": "B00HPS9FME",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Outdoor Recreation",
      "Sports & Outdoors",
      "Tires",
      "Tires & Tubes",
      "Cycling"
    ],
    "price": 63.42
  }
}