{
  "website_summaries": [
    {
      "verdict": "A graceful boot that stands up to tough wear.",
      "pros": [
        "Working boots that offer the beauty of a fashion boot.Good for skinny calves",
        "Wooden heel and square toe adds to comfort",
        "Made of a thick leather"
      ],
      "cons": [
        "These boots are made to last and will have to be broken in"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Beautiful Boots!!",
      "text": "Great looking boots! Love these boots.... These are my first pair of real cowgirl boots, and my husband told me that real boots need some breaking-in. Well, he wasn't kidding when he told me I would have blisters on my feet! These boots are working boots, not fashion boots, and they fit your foot like a glove. After the initial, and sometimes painful, breaking-in period, they are perfect and beautiful! I expect them to last quite a while.",
      "rating": 5.0,
      "verified": true,
      "author": "Michelle&Bryan",
      "helpful_votes": 2,
      "publication_date": 20170201
    },
    {
      "title": "Gorgeous boots!",
      "text": "Even with the square toe (which I like deliberately chose to give my toes some room!) and white stitching to the sole (a common thing for stock horse shows) these boots are feminine and graceful. My pair was true to size, and true to the picture. I have skinny calves, so the boot shaft fits me well, but if I had more robust calves, I'd look for a different style. Also, the sole is cushier than I had expected -- a pleasant surprise! I am still breaking these boots in, but they feel comfortable enough for all day wear -- as well as sturdy enough for riding. They're too pretty for barn chores, though.",
      "rating": 5.0,
      "verified": true,
      "author": "Beth",
      "helpful_votes": 23,
      "publication_date": 20140320
    },
    {
      "title": "fit as expected after going down a half of a size and look great!",
      "text": "These fit as expected. I normally wear a size 7.5 - 8 depending on the shoe (and I like to wear 2 pairs of socks in the winter in my boots) so being my first pair of Justin's I read the reviews, and went with a size 7 and they fit just how I want them too. they are slightly loose enough to be able to wear an extra pair of socks. They are absolutely beautiful, love the color and have worn them for about 4 days now all day everyday and have not had a problem with them hurting my feet. Will buy Justin's again.",
      "rating": 5.0,
      "verified": true,
      "author": "Jadine",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "LOVE MY JUSTINS!!!!",
      "text": "This is my second pair. I absolutely love them but they do run a little large, so I wear thick, ankle socks or boot socks in summer so I’m not as hot, and in the winter I can wear thicker socks to stay warmer.",
      "rating": 5.0,
      "verified": true,
      "author": "D. Daisy",
      "helpful_votes": 0,
      "publication_date": 20190702
    },
    {
      "title": "Run too narrow",
      "text": "I couldn't even get these boots on..,they were way to narrow. They are a beautiful boot but I would have to order a wide I guess and I never have to wear a wide shoe bcuz my feet tend to be narrow.",
      "rating": 1.0,
      "verified": true,
      "author": "Marym",
      "helpful_votes": 2,
      "publication_date": 20161231
    },
    {
      "title": "While I LOVE the way they look",
      "text": "While I LOVE the way they look, there are two places where they rub on my foot and I can't seem to break them in. Tried using coconut oil on the insides and out, and tried wetting the interior and wearing them around the house (as was suggested somewhere on line) and it still did not help. I love them and want to wear them more, but until I can break them in properly, these are not my go to boots. It's a bummer because they are lovely to look at.",
      "rating": 3.0,
      "verified": true,
      "author": "Lesliei",
      "helpful_votes": 2,
      "publication_date": 20150811
    },
    {
      "title": "Nice boots!",
      "text": "I love these boots! They fit great, look great with pants or skirts/dresses and fit like they should. I normally wear an 8 but got the 7.5 like others said to and they fit snug but great.",
      "rating": 5.0,
      "verified": true,
      "author": "T. Brooks",
      "helpful_votes": 0,
      "publication_date": 20181028
    },
    {
      "title": "She loves them",
      "text": "Very pretty boot. My wife wears a 7.5US but the 6 fits her perfectly in these. She has a narrow foot but doesn’t need to order narrow width shoes ever. She said the footbed is comfortable and took about 3 wearing to break in to a great comfortable boot. She loves them! I wish it was made in the good ole USA. That’s my only complaint.",
      "rating": 5.0,
      "verified": true,
      "author": "Gary Del Giorno",
      "helpful_votes": 0,
      "publication_date": 20190820
    },
    {
      "title": "Had to order a half size smaller",
      "text": "These boots are beautiful! I normally wear a 9 in boots but these were too loose and I had to return them and order a 8.5 size. The return process was very easy and quick. I will warn you that they will be tight and stiff when you first put them on, but they will soften up in a few hours of breaking in. The seam on the inside of the boot is pretty thick and rubs on my ankles but wearing thicker socks seems to help until they are completely broken in. They look very sturdy and are made of very thick leather. I've been wanting brown and turquoise boots for years and I'm extremely happy with my purchase!",
      "rating": 4.0,
      "verified": true,
      "author": "saved by grace",
      "helpful_votes": 11,
      "publication_date": 20140911
    },
    {
      "title": "I love these boots!",
      "text": "I love these boots! Bought a 11C. I usually wear an E for width but these fit nicely. I was worried about the calf not fitting but there is plenty of room.. They fit as I would expect a pair of new boots to fit. Tight across the top of my foot but very comfortable. I hope they last as long as mu last pair !",
      "rating": 5.0,
      "verified": true,
      "author": "Laura",
      "helpful_votes": 0,
      "publication_date": 20160919
    },
    {
      "title": "Cute and comfy",
      "text": "These boots are super comfy. I normally wear a size 6 medium and I downsized to a 5.5 medium after reading the reviews. They fit perfectly with just enough slip to fit a boot sock but not more. The footbed is well cushioned. They arrived today and I haven't taken them off! They are a bit stiff, as to be expected, but are loosening up as I wear them throughout the day. They are adorable and functional. I have a fairly muscular calf and they fit fine, with a bit of wiggle room to spare. I am 5'2\" and they hit me at the widest part of my calf. Overall, a great find!",
      "rating": 5.0,
      "verified": true,
      "author": "Tracy Loring",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Cute Boots!",
      "text": "Really nice boots! I really like them! Most shoes I could order a size 8 and the fit is just right but these are a little bit bigger which I will easily solve with thicker socks but may have purchased 7.5 if I would have had the opportunity to try them on first. Still great!",
      "rating": 4.0,
      "verified": true,
      "author": "Online guru",
      "helpful_votes": 0,
      "publication_date": 20161230
    },
    {
      "title": "Gorgeous! Buy 0.5 size up",
      "text": "Gorgeous boots. Ended up being my daughter's favorite Christmas present. She likes them so much she will not be wearing them in the stables, which was kind of the point. lol Like others have said, buy a half size up; daughter is a 7 and we bought a 7.5. Not too snug so she has sock options.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Thomas",
      "helpful_votes": 0,
      "publication_date": 20150113
    },
    {
      "title": "As advertised, on time",
      "text": "The boots arrived on time and were as advertised. They do not widen much at the top, so if you have large calf muscles, you will need to either use something to stretch the tops (they are good leather, so it is possible) or find a different boot.",
      "rating": 4.0,
      "verified": true,
      "author": "Bruce Hastie",
      "helpful_votes": 18,
      "publication_date": 20140425
    },
    {
      "title": "LOVE the design on these but both 6M and 6",
      "text": "LOVE the design on these but both 6M and 6.5 were too small where the same brand but different design fit perfectly.",
      "rating": 2.0,
      "verified": true,
      "author": "Rebecca Scholze",
      "helpful_votes": 0,
      "publication_date": 20170915
    },
    {
      "title": "Beautiful, comfortable boots",
      "text": "Justin boots are always well made and good looking, but these are exceptionally beautiful and comfortable. I love the shorter, square toe, the high quality leather, the cushy foot bed, and the fashionable, pretty uppers. The blue stitching is gorgeous! I will get a lot of use (and a lot of compliments) from these boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Diane Lee",
      "helpful_votes": 0,
      "publication_date": 20140925
    },
    {
      "title": "Perfect Boot",
      "text": "I am so in love with these boots! They are exactly what I expected in style, fit, color, everything. They do need to be broken in before wearing them for a long period of time. So comfortable! I'm so in love.",
      "rating": 5.0,
      "verified": true,
      "author": "Carla Krzyske",
      "helpful_votes": 0,
      "publication_date": 20160721
    },
    {
      "title": "Not quite as expected, but great quality boot",
      "text": "I purchased this for my wedding. Based on the picture I assumed the top was a light blue. When I received it I realized it is a teal/green color and will be returning them. The seller isn't to blame, they used the manufacturer's picture, but it wasn't as expected. I would also recommend almost a full size smaller. I am usually a 7 1/2 so I ordered a 7 based on other reviews. A 7 was too large unless worn with thick socks. However, all that aside the boots arrived quickly and the construction is very high quality.",
      "rating": 3.0,
      "verified": true,
      "author": "KP",
      "helpful_votes": 0,
      "publication_date": 20141218
    },
    {
      "title": "Too Small",
      "text": "I tried this brand and size on in the store but the style was different. I assumed they'd fit the same. I normally wear an 8.5-9 depending on the brand. These boots were so narrow that I thought they sent the wrong size. I checked the tag on the inside of the boot and they said 9C. I returned them and went back to the store where I tried them on and purchased them there. Even though I paid more at the store it was worth it!",
      "rating": 1.0,
      "verified": true,
      "author": "Dawn Mello",
      "helpful_votes": 0,
      "publication_date": 20141125
    },
    {
      "title": "Very good looking boots!",
      "text": "They look very good as I expected from picture, I wear size 8BM and ordered it and they fit as expected, with some extra space in front, but just a little more, usual for boots, so you can wear socks and be comfortable inside. My feet are slim, so are my calves so I had no problem with width. I haven`t used yet, so I do not know how comfortable they are for longer time. I hope they will turn out good!",
      "rating": 5.0,
      "verified": true,
      "author": "GP",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "Not made for wide feet.",
      "text": "So small! Too bad, cuz they're cute. But if you have wide feet steer clear. These are not wide in the slightest.",
      "rating": 3.0,
      "verified": true,
      "author": "Marianne",
      "helpful_votes": 0,
      "publication_date": 20170406
    },
    {
      "title": "Awesome",
      "text": "Love the boot wear them most of the time it's really great there very comfortable",
      "rating": 5.0,
      "verified": true,
      "author": "Lorie Mtz",
      "helpful_votes": 0,
      "publication_date": 20181220
    },
    {
      "title": "Gorgeous boots but must have slim legs",
      "text": "i purchased these boots for my wedding but will have to have them stretched out because they are sooooo small around the calf. Gorgeous boots but make sure you have thin legs or can get them stretched out.",
      "rating": 3.0,
      "verified": true,
      "author": "Cheri M.",
      "helpful_votes": 0,
      "publication_date": 20170123
    },
    {
      "title": "I already have a pair of these and I love them so much I had to get another for ...",
      "text": "I already have a pair of these and I love them so much I had to get another for when I wear out my 1st pair.",
      "rating": 5.0,
      "verified": true,
      "author": "machinistgirl",
      "helpful_votes": 0,
      "publication_date": 20180303
    },
    {
      "title": "Nice boots",
      "text": "These boots were nice but not what I ended up wanting. I returned them, I was looking for a boot with a more formal look. These were nice though.",
      "rating": 4.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 0,
      "publication_date": 20170603
    },
    {
      "title": "Gorgeous boot",
      "text": "Great boots especially for the price. The calf opening is a little big, but I have that problem with all boots. The boots ran a little big - I've been an 8.5 in all brands forever, but an 8 fits perfectly for me.",
      "rating": 4.0,
      "verified": true,
      "author": "Anonymous",
      "helpful_votes": 2,
      "publication_date": 20140822
    },
    {
      "title": "Poor craftsmanship",
      "text": "It took me a while to decide on these boots and when they arrived I was excited. Unfortunately, quality control did not inspect the stitches and I had to send these boots back. There were; however, extremely comfy (or at least the one that was made correctly)",
      "rating": 2.0,
      "verified": true,
      "author": "Heidi Tanner",
      "helpful_votes": 0,
      "publication_date": 20140817
    },
    {
      "title": "Beautiful only stitching on inner shaft.",
      "text": "These boots are gorgeous! The leather is sturdy. My only concern is the inner part of the shaft, I am not sure if it will rip a nylon tight or socks. Hopefully, it will not.",
      "rating": 5.0,
      "verified": true,
      "author": "Las tres Americas",
      "helpful_votes": 0,
      "publication_date": 20161125
    },
    {
      "title": "Four Stars",
      "text": "It was a nice boot but ran somewhat small. I have a high arch and couldn't get it on",
      "rating": 4.0,
      "verified": true,
      "author": "Pat Slaboch",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "Five Stars",
      "text": "Love it thanks amazon for making ordering things I love so easy",
      "rating": 5.0,
      "verified": true,
      "author": "Linz",
      "helpful_votes": 0,
      "publication_date": 20170830
    },
    {
      "title": "My daughter wanted these (13) and wears them almost every ...",
      "text": "My daughter wanted these (13) and wears them almost every day to school. They are real cowboy boots - not just for looks. When she goes riding this summer these will do the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "M. Rinehart",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Nice comfortable boots I normally wear a 9 1/2 these ...",
      "text": "Nice comfortable boots I normally wear a 9 1/2 these ran a little big on me. The color is more aqua than blue.",
      "rating": 5.0,
      "verified": true,
      "author": "LittleBits of Life",
      "helpful_votes": 0,
      "publication_date": 20161228
    },
    {
      "title": "Very nice boots for the money.",
      "text": "The inside binding rubs around my ankles, but the boots are very comfortable and the sizing is good. I am using foam cushioning on my ankles until the boots are broken in.",
      "rating": 5.0,
      "verified": true,
      "author": "Rascal",
      "helpful_votes": 0,
      "publication_date": 20151102
    },
    {
      "title": "Love them!",
      "text": "I bought these for a Stampede costume and loved them!!! They fit well. I was worried they wouldn't fit in the calf, but they were perfect. Not too tight. I usually wear a 8.5 and bought a 9 Fit perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "smilebright",
      "helpful_votes": 0,
      "publication_date": 20151008
    },
    {
      "title": "Love these boots",
      "text": "Love these boots. They fit just right and true to size for me, I wear a nine and they fit just fine. I get a lot of complements on these boots, they are as cute as I thought they would be just love the color. I would highly recommend these to anyone.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161027
    },
    {
      "title": "I have had a dozen pairs of Justin and bought ...",
      "text": "I have had a dozen pairs of Justin and bought these as a gift for my Spanish friend.They will look stunning on her and last a lifetime",
      "rating": 5.0,
      "verified": true,
      "author": "Jayman",
      "helpful_votes": 0,
      "publication_date": 20160221
    },
    {
      "title": "Nice boots!",
      "text": "Bought these for my daughter. She loves them and wears them constantly.",
      "rating": 5.0,
      "verified": true,
      "author": "Rich & Lena H.",
      "helpful_votes": 0,
      "publication_date": 20160622
    },
    {
      "title": "Boots are for my grand daughter. She loves them ...",
      "text": "Boots are for my grand daughter. She loves them .She does not wear them all day but will wear them off and on at various times.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160907
    },
    {
      "title": "Very comfortable - I have wide feet and a high arch ...",
      "text": "Very comfortable - I have wide feet and a high arch and they fit fine (I ordered wide width), Wear them all day right out of the box. Get a lot of compliments on them",
      "rating": 5.0,
      "verified": true,
      "author": "mkn",
      "helpful_votes": 0,
      "publication_date": 20150725
    },
    {
      "title": "Heel issue",
      "text": "I loved the boots design and look. However after wearing them almost daily for like 3 months was disapointed to find that the heels are not real wood, but rather a type of leather. When wet the outer layer starts to show wear and become really soft which results in it starting to come apart from the heel. Apart from that I love the boots. Always get compliments when I wear them.",
      "rating": 3.0,
      "verified": true,
      "author": "K.",
      "helpful_votes": 0,
      "publication_date": 20150413
    },
    {
      "title": "Cute and Comfy",
      "text": "I get constant compliments any time I wear these boots. I love the color and the fit. They are a little tough to ware in but that is with any cowgirl boot so not surprised and not a big deal.",
      "rating": 5.0,
      "verified": true,
      "author": "LilDini",
      "helpful_votes": 0,
      "publication_date": 20150627
    },
    {
      "title": "but any good boot should be doo y can break it in ...",
      "text": "Delivery went as planned, night then for my mom, she started that they were snug, but any good boot should be doo y can break it in properly.",
      "rating": 5.0,
      "verified": true,
      "author": "Jen B.",
      "helpful_votes": 0,
      "publication_date": 20150304
    },
    {
      "title": "And they look really nice.",
      "text": "A little tight at first after wearing for a couple days they stretch out. And they look really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason G",
      "helpful_votes": 0,
      "publication_date": 20160510
    },
    {
      "title": "A little stiff",
      "text": "Really nice looking boots, but a little tough breaking in. I would have given 5 stRs, but they are made in China. Had I known , I prob wouldn't have bought them, but priced at $49, I'll get over it.",
      "rating": 4.0,
      "verified": true,
      "author": "danielle",
      "helpful_votes": 0,
      "publication_date": 20140730
    },
    {
      "title": "Beautiful but too narrow.",
      "text": "Too tight and thumb pull half ripped off the first time I tried to pull these on. Has to return them.",
      "rating": 2.0,
      "verified": true,
      "author": "Katrina",
      "helpful_votes": 0,
      "publication_date": 20160722
    },
    {
      "title": "The shaft of the boot is pretty stiff.",
      "text": "The shaft of the boot is pretty stiff... unlike my Ariats, the Justin boots don't seem to stretch as well.",
      "rating": 4.0,
      "verified": true,
      "author": "GLyon",
      "helpful_votes": 0,
      "publication_date": 20160310
    },
    {
      "title": "My favorite western boots I have ever owned",
      "text": "My favorite western boots I have ever owned! The tops chaffed my calves a little when I first got them, but they've softened up. These are soooo pretty, I love them!",
      "rating": 5.0,
      "verified": true,
      "author": "Alicia",
      "helpful_votes": 0,
      "publication_date": 20150910
    },
    {
      "title": "Love the sizing consistency in Justin boots",
      "text": "Love the sizing consistency in Justin boots. These are soft, comfortable with a great sole for riding. Definitely would recommend them",
      "rating": 5.0,
      "verified": true,
      "author": "Arline P Jilek",
      "helpful_votes": 0,
      "publication_date": 20160320
    },
    {
      "title": "super cute though",
      "text": "These boots are made for no calves.. I have very muscular calves and are way to big for these boots. they left blisters even.. super cute though!!",
      "rating": 2.0,
      "verified": true,
      "author": "Shayla",
      "helpful_votes": 0,
      "publication_date": 20160929
    },
    {
      "title": "I love them! My normal shoe size is a 6",
      "text": "I love them! My normal shoe size is a 6.5/7, but I always get a 6 in my Justin Boots and they fit perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Sarah",
      "helpful_votes": 0,
      "publication_date": 20160825
    },
    {
      "title": "The boots were to narrow even though I ordered wide ...",
      "text": "The boots were to narrow even though I ordered wide. I originally had a regular width from another company but same brand. Those were too tight. The wide I cannot get on.",
      "rating": 3.0,
      "verified": true,
      "author": "Laurie Dolan",
      "helpful_votes": 0,
      "publication_date": 20170520
    },
    {
      "title": "These boots are beautiful very hard to wear at first as I can ...",
      "text": "These boots are beautiful very hard to wear at first as I can tell it will take a long time to break them in but the soul is very comfortable and the boots look axing with most anything u wear .",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "love them but a tad small.",
      "text": "super super cute, love them but very stiff and small in the top of boot.",
      "rating": 3.0,
      "verified": true,
      "author": "Akhippiechic",
      "helpful_votes": 0,
      "publication_date": 20151202
    },
    {
      "title": "The older pair is worn but still fits great!",
      "text": "Actually my daughter had an older pair of the same boot. We needed a new pair for showing. The older pair is worn but still fits great!",
      "rating": 5.0,
      "verified": true,
      "author": "Karen S.",
      "helpful_votes": 0,
      "publication_date": 20150715
    },
    {
      "title": "Cute but Need Time to Break In",
      "text": "Cute as can be but need some time to break them in. Size as expected.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160618
    },
    {
      "title": "Just as I expected - Excellent boots",
      "text": "I got these boots because I already had a pair of Justins that I loved and nearly wore out. I ordered these because I wanted Justins again but I wanted a different style and these certainly did not disappoint. Every time I put them on they are comfortable and I wear them nearly every day in the warm seasons.",
      "rating": 5.0,
      "verified": true,
      "author": "RowdyCowgirl",
      "helpful_votes": 0,
      "publication_date": 20141118
    },
    {
      "title": "EXCELLENT",
      "text": "THESE WERE FOR MY DAUGHTER'S BIRTHDAY AND SHE ABSOLUTELY LOVES THEM. SHE HAS WORN THEM EVERY DAY SINCE. WE ARE VERY PLEASED WITH THE QUALITY AS WELL.",
      "rating": 5.0,
      "verified": true,
      "author": "chickeeshanks",
      "helpful_votes": 3,
      "publication_date": 20140625
    },
    {
      "title": "Left and right boot are not the same!",
      "text": "One boot is smaller than the other!!! So frustrating. I am going to have to send them back. The left boot is smaller and tighter than the right. My feet don't have this problem...it's the boots!",
      "rating": 1.0,
      "verified": true,
      "author": "Danielle",
      "helpful_votes": 0,
      "publication_date": 20161215
    },
    {
      "title": "Five Stars",
      "text": "Best fitting boot I have found. Very comfortable and I get lots of complements.",
      "rating": 5.0,
      "verified": true,
      "author": "happy customer",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "Love them, they are beautiful!",
      "text": "I love how they look! Would have given it 5 stars except I don't like that you can feel the stitches.",
      "rating": 4.0,
      "verified": true,
      "author": "GretaD",
      "helpful_votes": 0,
      "publication_date": 20161214
    },
    {
      "title": "Good purchase!",
      "text": "Love these boots! They look exactly as pictured from the description. I have a medium width foot and ordered 10B. Very comfortable. Great value.",
      "rating": 5.0,
      "verified": true,
      "author": "Kathryn Neill",
      "helpful_votes": 0,
      "publication_date": 20170817
    },
    {
      "title": "Pretty but the crease creates digging on my anckles.",
      "text": "I love them but when the arrived both boots were bent at the ankle. So unless I'm wearing thick socks they dig in at my ankles and can be very uncomfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Amanda More",
      "helpful_votes": 0,
      "publication_date": 20150527
    },
    {
      "title": "my daughter didn't like the way they fit initially",
      "text": "my daughter didn't like the way they fit initially, but she soaked them in water and wore them for a couple of hours and now loves them:)",
      "rating": 4.0,
      "verified": true,
      "author": "M",
      "helpful_votes": 0,
      "publication_date": 20150514
    },
    {
      "title": "Fits but stiff",
      "text": "It does fit as I expected but the leather is pretty stiff. A good pair of tube socks and a little leather softener/stretch and I think they'll be perfect. Beautiful color and comfy soles as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amber",
      "helpful_votes": 0,
      "publication_date": 20141205
    },
    {
      "title": "High maintenance",
      "text": "The leather was pretty dry, plan on getting a good oil and having to polish every 1-2 use. Looks are great, fit runs large. My daughter loves them, but I'm the one caring for them. They are comfortable enough to work (as a cashier) in.",
      "rating": 3.0,
      "verified": true,
      "author": "Jackie Woodie",
      "helpful_votes": 0,
      "publication_date": 20150210
    },
    {
      "title": "Amazing!",
      "text": "Very comfortable and incredibly cute! My calves fit just fine and they are pretty roomy as my size.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160817
    },
    {
      "title": "Perfection",
      "text": "Loved the product. Looked exactly like it's picture was. Fit perfectly. I am so in love",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160802
    },
    {
      "title": "Need stretching and made in China but beautiful",
      "text": "They are beautiful. But I could not get my foot in them without putting it in a bag. I have a high arch and literally couldn't get my foot in. Usually boots rub the top of my foot but I can always get them on. My cobbler is stretching them for $20 and said it was designed to narrow. My biggest problem though is they are clearly stamped made in China. I am too lazy to return and like I said- they are great looking- assuming the cobbler can get them to go on.",
      "rating": 3.0,
      "verified": true,
      "author": "M. Ordway",
      "helpful_votes": 0,
      "publication_date": 20151205
    },
    {
      "title": "Four Stars",
      "text": "Bought these for tje wife and they looked great. Fit too tight around the calf, so had to return them.",
      "rating": 3.0,
      "verified": true,
      "author": "jason",
      "helpful_votes": 0,
      "publication_date": 20160418
    },
    {
      "title": "They've become her favorite and I think they've been worn nearly every day ...",
      "text": "My wife loves these boots. They've become her favorite and I think they've been worn nearly every day since she purchased them",
      "rating": 5.0,
      "verified": true,
      "author": "S. Peacock",
      "helpful_votes": 0,
      "publication_date": 20150515
    },
    {
      "title": "the insoles were really comfortable and did not require any insole to add cushion ...",
      "text": "They were a bit larger than expected but provided enough room for the cushion insoles I typically use. But, the insoles were really comfortable and did not require any insole to add cushion or comfort.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160229
    },
    {
      "title": "Five Stars",
      "text": "I love them. If I wear a thick sock they fit great. The quality is great.",
      "rating": 5.0,
      "verified": true,
      "author": "Celeste P.",
      "helpful_votes": 0,
      "publication_date": 20161019
    },
    {
      "title": "Many compliments!",
      "text": "I needed to take the insoles out and replace with a flatter one because they were hard to get my heel in. These are my favorite boots and fit great around my legs.",
      "rating": 5.0,
      "verified": true,
      "author": "Brooke Newman",
      "helpful_votes": 0,
      "publication_date": 20150420
    },
    {
      "title": "Super cute! I love these boots",
      "text": "Super cute! I love these boots! They are a little snug at the top of my foot is but they give a little with time and wear",
      "rating": 4.0,
      "verified": true,
      "author": "Vanessa",
      "helpful_votes": 0,
      "publication_date": 20140811
    },
    {
      "title": "Beautiful quality. Fast shipping",
      "text": "Fit as expected. Beautiful quality. Fast shipping. The calves do hurt a little with the stitching.",
      "rating": 4.0,
      "verified": true,
      "author": "Katelyn Bristol",
      "helpful_votes": 0,
      "publication_date": 20140830
    },
    {
      "title": "Love these. They are even better looking in person",
      "text": "Love these. They are even better looking in person. I usually wear a 10 but I ordered a 9.5 based on reviews saying they ran large. I had to return them and order a 10 C because they also run narrow. But the exchange was easy and they fit perfect! Love them.",
      "rating": 5.0,
      "verified": true,
      "author": "Kaykay",
      "helpful_votes": 0,
      "publication_date": 20140924
    },
    {
      "title": "I love the look and quality",
      "text": "I love the look and quality, but I'm a true 7 in most shoes and these were too big so I returned them for a 6 1/2. The return was easy and fast!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeniece R.",
      "helpful_votes": 2,
      "publication_date": 20141104
    },
    {
      "title": "Love them",
      "text": "Love them they fit great will be ordering more soon",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170314
    },
    {
      "title": "great  boot",
      "text": "I just got these can't wait to break them In! there not to tight they fit like a boot should ! Only thing is the top part shows more blue in the picture but when you get them there actually more of a turquoise but i still love the boots",
      "rating": 4.0,
      "verified": true,
      "author": "blaze landreth",
      "helpful_votes": 0,
      "publication_date": 20150217
    },
    {
      "title": "Walked thru pouring rain in them and they held up nicely!",
      "text": "I get tons of compliments when I wear these boots. Walked thru pouring rain in them and they held up nicely!",
      "rating": 5.0,
      "verified": true,
      "author": "C. Medina",
      "helpful_votes": 0,
      "publication_date": 20150410
    },
    {
      "title": "I love the teal detail though and the inner sole of ...",
      "text": "They fit well but it takes a few days of constant wear in order to break them in so my heel doesn't move anymore. I love the teal detail though and the inner sole of the shoe is super comfortable.",
      "rating": 4.0,
      "verified": true,
      "author": "Kaitlin Faguy",
      "helpful_votes": 0,
      "publication_date": 20150714
    },
    {
      "title": "Love these boots",
      "text": "Love these boots. True to size. I get so many compliments on my boots! Can't wait to get another pair!",
      "rating": 5.0,
      "verified": true,
      "author": "Christine Jones-Kerper",
      "helpful_votes": 0,
      "publication_date": 20150729
    },
    {
      "title": "I just love them. I'm glad that I didn't order a ...",
      "text": "I just love them. I'm glad that I didn't order a 6 since they would have just fit. The extra 1/2 size makes it possible to wear a thicker sock if I choose to, although it is not necessary, I have received a lot of compliments on them.",
      "rating": 5.0,
      "verified": true,
      "author": "Jo Ann Ramsdell",
      "helpful_votes": 0,
      "publication_date": 20150106
    },
    {
      "title": "Love them!!",
      "text": "I love my boots!! I got these for my wedding day and they fit and look great! Some other reviews say to order a whole size smaller, I ordered a half size smaller and it's a perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "Blakely Reed",
      "helpful_votes": 0,
      "publication_date": 20150823
    },
    {
      "title": "Nice boot",
      "text": "Very cool looking boot but could not get over my calf so I had to return.",
      "rating": 4.0,
      "verified": true,
      "author": "Fancy Nancy",
      "helpful_votes": 0,
      "publication_date": 20150908
    },
    {
      "title": "Four Stars",
      "text": "These are a little tight at the ankles compared to other Justin boots I have.",
      "rating": 4.0,
      "verified": true,
      "author": "Jamie Fassold",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Terrible",
      "text": "Product was not right size and the box was destroyed when I got it",
      "rating": 1.0,
      "verified": true,
      "author": "Katie",
      "helpful_votes": 0,
      "publication_date": 20161115
    },
    {
      "title": "The shaft is not made for fat calves! Lol ...",
      "text": "The shaft is not made for fat calves! Lol thw stitching rubs. I read where people put tape over it. Guess i will do the same.",
      "rating": 3.0,
      "verified": true,
      "author": "Lisa Ann Spinks",
      "helpful_votes": 2,
      "publication_date": 20140720
    },
    {
      "title": "Was very happy with them",
      "text": "Bought these for my granddaughter. She loves them and is wearing them almost everyday. Was very happy with them.",
      "rating": 4.0,
      "verified": true,
      "author": "Tancy Brown",
      "helpful_votes": 0,
      "publication_date": 20150821
    },
    {
      "title": "Beautiful boot.",
      "text": "Beautiful boot. It arrived on time. The fit is very narrow especially in the ankle area.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Magdich",
      "helpful_votes": 0,
      "publication_date": 20150419
    },
    {
      "title": "Five Stars",
      "text": "Made for BIG smiles on Christmas morning!! She LOVES them!!!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160312
    },
    {
      "title": "The boots are beautiful! They gave me blisters on my calves though",
      "text": "The boots are beautiful! They gave me blisters on my calves though. I'll have to figure out how to deal with that .",
      "rating": 4.0,
      "verified": true,
      "author": "A. Gonzales",
      "helpful_votes": 0,
      "publication_date": 20160327
    },
    {
      "title": "felt tight at first, have had to break them ...",
      "text": "felt tight at first, have had to break them in, leather is unforgiving, so I wear a little while each day and they are improving.",
      "rating": 4.0,
      "verified": true,
      "author": "Mary Dorrell",
      "helpful_votes": 0,
      "publication_date": 20160202
    },
    {
      "title": "... kneel but with a little thicker sock they are perfect!! I love the colors ♡",
      "text": "They are a little large in the kneel but with a little thicker sock they are perfect!! I love the colors ♡",
      "rating": 3.0,
      "verified": true,
      "author": "Barbara Davis",
      "helpful_votes": 0,
      "publication_date": 20140807
    },
    {
      "title": "Loveee",
      "text": "Love them!! Perfect size just the leathers hard at first but break it in and they are perfect",
      "rating": 5.0,
      "verified": true,
      "author": "Nicole",
      "helpful_votes": 0,
      "publication_date": 20140820
    },
    {
      "title": "Three Stars",
      "text": "Beautiful boots. VERY stiff material. And they hurt around ankles. A bit bigger to",
      "rating": 3.0,
      "verified": true,
      "author": "Allison Niven",
      "helpful_votes": 0,
      "publication_date": 20141214
    },
    {
      "title": "I bought the boots and when I got them I ...",
      "text": "I bought the boots and when I got them I saw they have some chemical stuff which produce cancer. They where a little to small. Anyways thery are gorgeous!!",
      "rating": 3.0,
      "verified": true,
      "author": "Lopez Monica",
      "helpful_votes": 0,
      "publication_date": 20150309
    },
    {
      "title": "Five Stars",
      "text": "Great boots! I wear them as much as I can. Were delivered on time as well.",
      "rating": 5.0,
      "verified": true,
      "author": "L.M Cuenca",
      "helpful_votes": 0,
      "publication_date": 20150422
    },
    {
      "title": "They are extremely cute I love them but like it says get them a half ...",
      "text": "They are extremely cute I love them but like it says get them a half size smaller than what you wear.",
      "rating": 5.0,
      "verified": true,
      "author": "Dahmar",
      "helpful_votes": 0,
      "publication_date": 20141102
    },
    {
      "title": "Comfortable",
      "text": "These boots are very comfortable and the color is beautiful. They did not rub my calves and they did not give me blisters. I bought them to wear in my friends wedding and I was not disappointed. I wore them the day before the wedding to stretch them out/break them in and they were perfect. I wear and 8 to 8 1/2 in shoes and bought an 8 1/2 in these boots because I wanted to make sure they fit and the size was perfect. I probably could have bought and 8 and they would have fit fine but I like wiggle room. I would recommend these boots.",
      "rating": 5.0,
      "verified": true,
      "author": "Alesha Clark",
      "helpful_votes": 0,
      "publication_date": 20140917
    }
  ],
  "product_meta": {
    "title": "Justin Boots Women's Stampede Sliver Collection Equestrian Boot",
    "description": "The Standard of the West Since 1879 The story of Justin Boots began in 1879, when H.J. Justin moved to Spanish Fort, Texas to become a boot repairman. He was a quick study, with an eye and talent for boot making. H.J. soon began his own boot company, Justin Boots, which he operated out of his home to serve cowboys passing though town. H.J. saw the potential for his business, so when a railroad was built ten years later in Nocona, Texas, he moved his family there to capitalize on a bigger market. In 1908, Justin Boots became a true family company when his sons, Earl and Avis, came to work for their father. Their combined efforts pushed the company forward, and just two years later, Justin Boots had doubled its production and was being sold in 26 states as well as Mexico, Canada, and Cuba. Seven years after their father´s death in 1918, his sons moved the company headquarters to Fort Worth where it still operates today. Every pair of Justin Boots is a salute to the spirit of independence, hard work and authenticity of the cowboys who have worn them since 1879. After more than 130 years of Western boot making, Justin Boots is still true to its roots. When you purchase a pair of Justin Boots you will own the most authentic and stylish Western footwear available. And with Justin´s patented J-Flex.Comfort System you will be wearing the most comfortable boots ever made. This is why Justin Boots has been crowned the Standard Of The West Since 1879.",
    "rating": 4.2,
    "feature_bullets": [
      "100% Leather",
      "Imported",
      "Rubber sole",
      "Shaft measures approximately 12\" from arch",
      "Heel measures approximately 1.75\"",
      "Platform measures approximately 0.50\"",
      "Boot opening measures approximately 14\" around",
      "All leather upper",
      "Rubber outsole",
      "Removeable orthotic"
    ],
    "categories": [
      "Boots",
      "Women",
      "Shoes",
      "Clothing, Shoes & Jewelry",
      "Mid-Calf"
    ],
    "price": 168.25,
    "specifications": {}
  }
}