{
  "website_summaries": [
    {
      "verdict": "A bit pricey when compared to similar products.",
      "pros": [
        "Accommodates rear-facing riders up to 40 lbs",
        "Lined with energy-absorbing foam for maximum protection during crashes"
      ],
      "cons": [
        "Heavier and bulkier than some competitors due to higher weight limit"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    },
    {
      "verdict": "A great choice for those who want an ultra-light car seat with superior safety technology.",
      "pros": [
        "The seat's lightweight design makes it easily portable between cars and strollers",
        "Employs the simple Click Connect safety system",
        "Has been thoroughly crash tested"
      ],
      "cons": [
        "Fabric feels low-quality, particularly the headrest",
        "Straps can dig into neck"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "It looks nice and isnt too heavy but it really bothers me ...",
      "text": "Just got it yesterday. It looks nice and isnt too heavy but it really bothers me that the manufacturing date is 2016. I feel like when you buy something that is good for only so many years you shouldn't have to pay full price for something that is already 2 years old.",
      "rating": 3.0,
      "verified": true,
      "author": "Heather Critch",
      "helpful_votes": 42,
      "publication_date": 20180116
    },
    {
      "title": "My car is totaled. My baby is fine.  Did buy again",
      "text": "Four days ago, I was in a car wreck while taking my 7-month-old to daycare. My poor old Corolla was hit in the front left side by a speeding SUV. It spun me around so then I slammed head on to a street sign. Car totaled, leaking oil, hood on the ground. A soon as I could think around my concussion flung my self around the car to see how my baby was. Not. A Scratch. On Her. Seriously, she was briefly startled by the crash. That was it. This was confirmed by both the ER and her pediatrician. You are supposed to replace your car seat after a crash. I got this exact same model again.",
      "rating": 5.0,
      "verified": true,
      "author": "DC",
      "helpful_votes": 8,
      "publication_date": 20190203
    },
    {
      "title": "Supportive & Stylish",
      "text": "I love how much support this carseat gives my son especially when he was a NB. My only complaint is its summer out and the seat doesn't seem to be very well ventilated, per my son's back is usually very sweaty when we come from running just a couple of errands. Other than that I'd def recommend this carseat! It clicks in and out with ease!",
      "rating": 4.0,
      "verified": true,
      "author": "Sherea",
      "helpful_votes": 3,
      "publication_date": 20190604
    },
    {
      "title": "I do not recommend purchasing this seat!",
      "text": "The mobility of both the umbrella and handle are so poorly designed. I have to push and shove each one in order to move it forward and back. Even putting it on and taking it off the base is difficult as it either takes multiple attempts for it to click into the base or won’t release. I have an older child and have had 2 other infant car seats and I’ve never encountered these issues with those seats. I wish I knew this before putting it in my baby registry as now it is too late to return it.",
      "rating": 2.0,
      "verified": true,
      "author": "Juel Merc",
      "helpful_votes": 2,
      "publication_date": 20180531
    },
    {
      "title": "Love yhe recline",
      "text": "This seat is perfect for my daughter. I love that the recline is just right. Her head never falls forward. I'd definitely recommend this seat all moms, dads, and whoever needs a great seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 9,
      "publication_date": 20170414
    },
    {
      "title": "Happy Mom",
      "text": "This is an excellent car seat. It's very easy to adjust, loosen, and tighten the straps (one button release/one strap pull); relatively light weight; and clicks easily into the older Click Connect stroller we have. My very minor complaints: the handlebar isn't as easy to adjust (I have to struggle a little bit with it); I wish the handlebar locked into several different positions rather than just a couple; and I wish the canopy was longer instead of stopping in the middle of the seat so that it provided more sun shade. Other than that, very happy with the product!",
      "rating": 5.0,
      "verified": true,
      "author": "Jessie Chin",
      "helpful_votes": 0,
      "publication_date": 20171124
    },
    {
      "title": "Saved my baby from injury",
      "text": "I was rear ended very hard (driver was probably going over 40 mph at impact) then my car was shoved into the car in front of me. My 3 week old daughter was in the back seat asleep in this car seat, she cried for a couple of minutes from being startled then fell back to sleep. I had her examined by the pediatrician and a chiropractor and she showed zero signs of injury. I am certain this car seat saved her from any injury or pain due to the crash. So after the accident I replaced the car seat with another Graco snugride click connect.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael Hyer",
      "helpful_votes": 2,
      "publication_date": 20180812
    },
    {
      "title": "light weight nice colors snaps into the base easily easy to use ...",
      "text": "We have been this for about 5 weeks now. Pros: light weight nice colors snaps into the base easily easy to use buckles easy installation Cons: I HATE that the canopy is so small and interferes with the handle (you can use one or the other). Terrible design. The insert isn't really that effective for a newborn. It could use a little bit more support It seems to make the baby hot.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180712
    },
    {
      "title": "Money well spent!",
      "text": "This is a top quality product and we're very glad we bought it! We purchased the car seat for our then 7-month-old grandson, so we could take him along when traveling/doing errands without having to borrow his mom's car, or change the car seat base--a complicated, time consuming task. We are thoroughly satisfied. The seat is extremely safe, yet comfortable, the instructions for installing and using it and the base were adequate (with more complete information easily obtained online) and it is easily snapped into his mother's Click Connect stroller. Now, if we could just get him to stop growing so fast, so we'd get a few more months' use out of it!",
      "rating": 5.0,
      "verified": true,
      "author": "Mrs.Robin",
      "helpful_votes": 0,
      "publication_date": 20160827
    },
    {
      "title": "SUPER NICE",
      "text": "super nice and functional. one of the best.. my only comment to improve is small newborns. they need a better insert ( different brand found at wally world) for tiny babies support. that made this purchase perfect until she grows into it a bit better.. otherwise this is a solid investment for babies safety. Very well made. THANK YOU.",
      "rating": 5.0,
      "verified": true,
      "author": "shoppers critique",
      "helpful_votes": 0,
      "publication_date": 20191208
    },
    {
      "title": "Good deal, hard to unclick out of base",
      "text": "For the most part I like this car seat. I’ve always had Britax infant car seats, also an urbini from Walmart. This is just as nice as those, and really great because it’s super light! I think it’s actually one of the lightest on the market! But I must say, my baby is one month old, & maybe I haven’t Figured out the trick yet, but it’s super tricky to get off of the base. Like it has to be at the perfect angle when you unclick & lift it off. Other than that-no complaints. Easy cleaning fabric-no frills, simple & effective.",
      "rating": 3.0,
      "verified": true,
      "author": "lala p",
      "helpful_votes": 0,
      "publication_date": 20181026
    },
    {
      "title": "Perfect for Premature Babies",
      "text": "My babies came home at 4 lbs each, and this carseat fully supported them and continues to as they grow. The nurses at the hospiral said it is one of the few seats that is approved for babies that small. They are nearly 4 months old now, and I still love this seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily Schmidt",
      "helpful_votes": 0,
      "publication_date": 20190712
    },
    {
      "title": "Shade funky to maneuver",
      "text": "Went with Graco again because our old infant seat was expiring in a couple of months. The seat is fine and I have no complaints about service or safety but we live in the desert and need a well-functioning sun cover. This one is different from the last and just doesn't fit quite right... it is a little bit of a struggle to move the shade under the handle forward and back. They definitely made the shade slightly too big on this one.",
      "rating": 3.0,
      "verified": true,
      "author": "cushizzle",
      "helpful_votes": 0,
      "publication_date": 20180524
    },
    {
      "title": "Fits the old base and carriage",
      "text": "Perfect fit. For reasons, my daughter needed another infant carrier. She still had the bases for hers and her husband's car. Baby was nearly at term and she was unable to retrieve the baby seat. Unfortunately you cannot purchase the seat without the base, but that just gives grandma an opportunity to have a base! Yea. These contraptions may be expensive but they are great for 0-6 or 7 months. very happy to have.",
      "rating": 5.0,
      "verified": true,
      "author": "Ngirilover",
      "helpful_votes": 0,
      "publication_date": 20180505
    },
    {
      "title": "Totally Recommended!",
      "text": "This was the first car seat that I've ever purchased. My wife and I did extensive research and really liked the idea of the Clinic Connect system. After purchasing this car seat, I can see why it got so many positive reviews. It is super easy to install in the car and remove as well. We've been using this for about a month and it remains very stable and has not been loosened over time. It is also easy to install in the Jogger stroller which also uses the Click Connect system. The seat appears to comfortable as our baby sleeps during every car ride. I would recommend this to anyone in need of a car seat, works perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Eric Ontiveros",
      "helpful_votes": 0,
      "publication_date": 20150326
    },
    {
      "title": "Practical and Protective",
      "text": "We already had one Grace Click Connect from our first child, but we chose to get a second seat when our youngest was born because it gave us the ability to transport both kids for a short time and, once our oldest moved to a bigger seat, gave us the ability to leave the entire system (base and seat) within both vehicles. We also had a jogging stroller that worked with the Click Connect system; this seat fit just fine. These seats can be fairly heavy once your child gets above the 13-15 lbs. mark, but that’s a small price to pay for the ease of use and peace of mind that comes with these seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Jacob",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "Love it.",
      "text": "I love this seat. I read a lot of reviews and some stated it's really hard to take it out of the base or to adjust the belts. It's not true, it's very easy. I also love that it weighs so little. I would recommend it to all. I did put in extra head support since I already had it from my first baby.",
      "rating": 5.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "A great car seat",
      "text": "I really love this car seat. It is light weight, and easily goes on and off the base. The straps rarely get twisted and are easy to fix when they do, which was a problem with my old car seat. The straps also tighten and loosen very easily. It doesn’t have a lot of bells and whistles, which I don’t need. I have been using it for 4 months.",
      "rating": 5.0,
      "verified": true,
      "author": "MellowYellow TTT",
      "helpful_votes": 0,
      "publication_date": 20180206
    },
    {
      "title": "4 stars",
      "text": "It’s a nice, secure car seat but after 5 months of use, the latch gets stuck and we have to fight with it to pull the seat off the base. This doesn’t go over well when you are trying to quietly move the seat & not wake your sleeping baby. Other than that one annoying flaw, it’s great.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171223
    },
    {
      "title": "Cheaply made and uncomfortable",
      "text": "This car seat has essentially no padding and no support. The head and body support insert is a joke. So if you want your baby to scream the entire time you go anywhere because their head in lopsided and their back is stiff and sweaty, by all means... otherwise just invest in something else!",
      "rating": 2.0,
      "verified": true,
      "author": "Becky Hundeby",
      "helpful_votes": 0,
      "publication_date": 20190219
    },
    {
      "title": "Not great as far as wear and tear",
      "text": "This is a comfortable, easy to use click connect model. My son never seems uncomfortable. I will say that the middle piece that goes across his chest seems to not be doing so well though and my son is only three months old. It's not clicking as snugly together as it should. Luckily we have another car seat already for when he outgrows the trace system stage.",
      "rating": 4.0,
      "verified": true,
      "author": "Blanche",
      "helpful_votes": 2,
      "publication_date": 20160630
    },
    {
      "title": "Good product up to 35lbs",
      "text": "I bought this to go with my jogging stroller. It’s really easy to install into your vehicle. Didn’t understand why people comment that car seats are hard to install. Even my mom was able to follow the instructions and has no issues. I appreciate the level at the side which indicates if it’s set flat enough. Only thing I would recommend is buying a more snug support for your baby’s body. Unless you live somewhere with perfect roads, but for a newborn the one it comes with may be too big to offer support.",
      "rating": 5.0,
      "verified": true,
      "author": "Cavied",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Easy to use",
      "text": "Such a convenient set! I got one seat, two bases and stroller. I'm the Gram and not used to these new fangled things but I'm amazed at how easy it is to use. I just set the seat on the base and it clicks in place. I don't dread having to get in and out of the car to do errands.",
      "rating": 5.0,
      "verified": true,
      "author": "Sharon Hanley",
      "helpful_votes": 0,
      "publication_date": 20171008
    },
    {
      "title": "My infant did not fit well in the car sear ...",
      "text": "My infant did not fit well in the car sear even after buying a snuzzler and he was not a small baby. . After he grew closer to 4 weeks he fits well in but must have the snuzzler inside otherwise it will be very uncomfortable and he will be falling all over the place",
      "rating": 4.0,
      "verified": true,
      "author": "Judith",
      "helpful_votes": 0,
      "publication_date": 20170923
    },
    {
      "title": "Used it for two daughters",
      "text": "Great car seat, seems really comfortable, judging by how often our infant daughters have fallen asleep in one. A bit heavy, but that's too be expected. We've used with and without the seat adapter. Using it means the car seat snaps into position quickly and easily. Without the adapter (as when we're riding in a relative's car), a seatbelt can still be easily used.",
      "rating": 5.0,
      "verified": true,
      "author": "B.D. Page",
      "helpful_votes": 0,
      "publication_date": 20171016
    },
    {
      "title": "Looks and works great.",
      "text": "This is a great car seat. It was easy to buckle into the car. Easy to drop into the base and retrieve. Simple locking mechanism. Fits our newborn grandson perfectly. It is also convenient that they sell separate bases so the seat can be used in multiple vehicles.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeremy B",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Love this lightweight carseat!",
      "text": "When I saw this carseat in the box at my doorstep, I thought I would have to get my husband to bring it inside for me but it was so light I was like \"Is there really even a carseat in here?\" I love this carseat. It's so light and and I love the black(I bought the gotham style). We also have the Graco Modes Click Connect stroller and the carseat does click into the stroller for anyone wondering! My only complaint with this carseat is the canopy. I can't get it to go all the down and I can't let the handle down over the canopy.",
      "rating": 5.0,
      "verified": true,
      "author": "ak2012",
      "helpful_votes": 0,
      "publication_date": 20160119
    },
    {
      "title": "Great car seat for infant",
      "text": "I purchased this as a baby shower gift since I had the same one for my baby. It's extremely lightweight and simple to install. I appreciate that it fits in the snap and go stroller so it does minimize the extra heavy weight of a full stroller and space in the trunk.",
      "rating": 4.0,
      "verified": true,
      "author": "JCheng",
      "helpful_votes": 0,
      "publication_date": 20190410
    },
    {
      "title": "Great infant car seat for the price",
      "text": "Purchased this with an extra base (1 comes with it). We have loved it so far. I would say it would be easier to carry if the handle was an ergonomic handle instead so you aren't twisting your wrist the whole time carrying it. My baby is 9 months now and just now starting to get a little big for it. I would definitely recommend this car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "Danyellbopray",
      "helpful_votes": 0,
      "publication_date": 20191213
    },
    {
      "title": "Easy choice",
      "text": "Reliable brand, washes well, works with base and multiple click connect Graco strollers. Also can be used with out the base and just with a seat belt. It’s easy to carry an infant in this. We sometimes put it in a shopping cart. And we will be using the same car seat twice since our one year old out grew it and we have another on the way. Boy or girl it works!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180716
    },
    {
      "title": "I'm disappointed. This seat is too hot for my LO",
      "text": "Did a ton of research on this car seat and was excited when it arrived before I had my LO. But now that we have been using it for 4 weeks on a daily basis, I'm disappointed. This seat is too hot for my LO. I live in Boston and it's summer time right now so my LO gets pretty hot in it and he's only wearing a onesies with no socks and blanket.",
      "rating": 2.0,
      "verified": true,
      "author": "Charita C.",
      "helpful_votes": 0,
      "publication_date": 20170815
    },
    {
      "title": "Good infant car seat for the price",
      "text": "Good infant car seat for the price. I did not use one with my first son we used the gravo 4ever since birth, however this car seat is sturdy and works well. I have no complaints. It’s easy to carry a sleeping baby Into the house and not disturb him. Straps stay tight. perfect for infant.",
      "rating": 5.0,
      "verified": true,
      "author": "RJ2727",
      "helpful_votes": 0,
      "publication_date": 20180809
    },
    {
      "title": "Love it, works great and whole Graco quick connect ...",
      "text": "Love it, works great and whole Graco quick connect system is awesome. Like most car seats however your little one can get a bit hot but not much can be done as just about all of them suffer from this. So I always make sure to have a clip fan handy for just this reason.",
      "rating": 5.0,
      "verified": true,
      "author": "Pedro M. De Leon III",
      "helpful_votes": 0,
      "publication_date": 20180531
    },
    {
      "title": "Highly recommend",
      "text": "Love the quality, durability, easy of use, and the color and design. With a base in both cars and the stroller it has never been easier to transport the baby from one place to the next. Seems to be very comfortable and I feel safe knowing he is protected in this car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "ZPTN615Top Contributor: Makeup",
      "helpful_votes": 0,
      "publication_date": 20190220
    },
    {
      "title": "We love it, but...",
      "text": "This car seat is so light and easy to carry. We have bought many Graco car seats in the past 6 years and this one is my favorite! My only complaint is the release button for the latch straps are nearly impossible to release when you need to take the car seat out of your car. I'm talking major frustration. It's good in the sense that it's not coming out or loosening up on it's own, but at the same time, my husband and I about lose our marbles every time we need to remove car seats with this new latch mechanism because it's so hard to loosen.",
      "rating": 5.0,
      "verified": true,
      "author": "Allison Williamson",
      "helpful_votes": 0,
      "publication_date": 20160222
    },
    {
      "title": "Love this car seat!",
      "text": "This car seat is working out great! It's really simple to use, the base stays in the car and the seat detaches very easily. I am only 5'2\" and very petite, and I can carry the seat around. I love the insert to keep newborns in a comfortable position, it must be super comfy because my son stays asleep in the seat for usually an hour or two after we get home. It's very nice-looking and I love that it doesn't make my car look like the baby fairy redecorated it.",
      "rating": 5.0,
      "verified": true,
      "author": "cornflake girl",
      "helpful_votes": 3,
      "publication_date": 20160323
    },
    {
      "title": "Great seat! Perfect for girl or boy!",
      "text": "Ordered this carseat for our baby due in January. Love how the fabric is easy to wipe if needed. The color is perfect for girl or boy. (we are having a girl) The shade cover gets kinda stuck when you're lifting it up or down, but it'll do. Look forward to filling the seat up with our little person next month!",
      "rating": 5.0,
      "verified": true,
      "author": "MomtoAnaston&McKenna",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Used it for all my kids",
      "text": "Love graco it’s affordable and not crazy heavy plus it’s usable til a little over a year depending on your children’s growth",
      "rating": 5.0,
      "verified": true,
      "author": "superradicalxo",
      "helpful_votes": 0,
      "publication_date": 20200209
    },
    {
      "title": "2nd purchase of this item",
      "text": "Our car was totaled in an accident with our 16 month old grandson in an older model of this car seat. We replaced it with this current model because we were so satisfied with its safety features.",
      "rating": 5.0,
      "verified": true,
      "author": "teachermouse",
      "helpful_votes": 0,
      "publication_date": 20190422
    },
    {
      "title": "Recommended by Car Seat Safety Technician",
      "text": "After much research about car seats and strollers, I settled on the Graco FastAction Sport...and I'm glad I did! I love how easy it is to click the car seat in place and remove with the push of a button. The stroller folds quickly with the pull of a tab and fits nicely in the trunk of my car. The final selling point was a recommendation from my sister who is a car seat safety technician and she said that this is one of the most recommended products on the blogs she reads. Sold.",
      "rating": 5.0,
      "verified": true,
      "author": "FLtoUT",
      "helpful_votes": 0,
      "publication_date": 20150604
    },
    {
      "title": "Great product.",
      "text": "I love how light weight this car seat is compared to others. Only thing I don't love is the release. It's tucked under the fabric but it works great.",
      "rating": 5.0,
      "verified": true,
      "author": "hortmel",
      "helpful_votes": 0,
      "publication_date": 20190711
    },
    {
      "title": "Great car seat",
      "text": "Great first car seat. We used this for my song until he was almost a year old. It fit great in the car and I loved that it was compatible with our Graco stroller",
      "rating": 5.0,
      "verified": true,
      "author": "Nadia",
      "helpful_votes": 0,
      "publication_date": 20190802
    },
    {
      "title": "Good but why the different infant insert?",
      "text": "We have this same car seat in teal that we got from Baby's R Us, but needed 2. For some reason, this seat has a plasticy infant insert where the teal one was fabric. -1 star because of that. Other whys, it takes up less room and is lighter than a lot of other car seat.",
      "rating": 4.0,
      "verified": true,
      "author": "GQBert",
      "helpful_votes": 2,
      "publication_date": 20160414
    },
    {
      "title": "Cute and safe! The baby loves it!",
      "text": "Love the product for the most part. Beautiful design, easy to keep clean. The removal button is hard to push so getting the car seat out of the base is difficult. Also, having to put the straps in and out of the back slots as child grows taller is time consuming but I still love the product. Some of the models have an easier system that doesn't require manual changes and I would buy that model if I needed to buy another car seat.",
      "rating": 5.0,
      "verified": true,
      "author": "mendomermaid",
      "helpful_votes": 0,
      "publication_date": 20180515
    },
    {
      "title": "Lightweight but very bad head support",
      "text": "Pros - easy to install, very lightweight, easy to get baby in and out of Cons - and this caused us to return this car seat and swap it out for a different Graco - terrible head support!! We used it for a week for our newborn and his head had barely any support, was at almost a 90 degree angle by the time we arrived at our destination. Upgraded to the snugride snuglock 35 elite and it is far better and only about 2 pounds heavier.",
      "rating": 2.0,
      "verified": true,
      "author": "julie b",
      "helpful_votes": 0,
      "publication_date": 20190511
    },
    {
      "title": "Canopy isn't so great.",
      "text": "Car seat just arrived today; baby won't be here until August. I'm having trouble moving the canopy up and down. I have to move it with two hands, as it won't go up or down evenly with just one. Not sure if I'm doing something wrong. I ordered this because it was on sale. Seems durable and safe. Easily connects to the base and disconnects. Haven't put in car yet.",
      "rating": 3.0,
      "verified": true,
      "author": "Joshua",
      "helpful_votes": 3,
      "publication_date": 20170420
    },
    {
      "title": "Safe, lightweight, and comfy",
      "text": "Seems like a safe car seat to put baby in, the Click Connect system is a little hard to get used to but that could just be because I'm 8 months pregnant and easily frustrated with just about everything :-) Overall it's exactly what I expected and I'd definitely buy this again if I had to. But I won't have to because I got 2 at my baby shower! ^_^ Must be a good brand if all the moms I know are buying these for other moms-to-be!!",
      "rating": 5.0,
      "verified": true,
      "author": "Cassandra",
      "helpful_votes": 0,
      "publication_date": 20151024
    },
    {
      "title": "Great Light Weight Seat!",
      "text": "We love this seat. Our newborn baby fits nice and snug in it and the best part is it does not weigh a ton. Very light weight and super easy to carry as well as get on and off of base! I would highly recommend this car seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Kayla",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "Graco snugride car seat",
      "text": "I bought this for a baby shower, and it matches the stroller I also bought for the new baby. It got great reviews, so I hope when the baby comes...it'll be perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Lynne T",
      "helpful_votes": 0,
      "publication_date": 20181006
    },
    {
      "title": "Good product",
      "text": "Wife and I are having twins and decided to give this car seat a shot. We received them pretty fast (even though we live in Fairbanks, AK). You can see that this is a good product right away. Another reason why we chose this carseat is because it is lightweight. My wife is small and this being lightweight helps out a ton with her being able to carry them pretty easy. The click connect is really handy when you put 2 car seats in either the stroller and in the car. I will give a better update when the little ones arrive in a few weeks. But so far so good!",
      "rating": 5.0,
      "verified": true,
      "author": "Gui",
      "helpful_votes": 0,
      "publication_date": 20150815
    },
    {
      "title": "Not good for smaller babies",
      "text": "Sturdy, durable. The only problem is the car seat is too steep so my baby keep having to curled up and looked so uncomfortable. Ended up buying a different brand car seat and giving this one away.",
      "rating": 3.0,
      "verified": true,
      "author": "L",
      "helpful_votes": 3,
      "publication_date": 20170224
    },
    {
      "title": "I love, love",
      "text": "I love, love, love this car seat! I am so glad I went with this one other than some of the more expensive models. The material is way softer than I expected it to be, and I love that the infant head support is removable for when baby gets bigger. The base was very easy to install in my car, and I love that I can adjust the base to an incline for my newborn. Thank you Graco. Highly recommend!",
      "rating": 5.0,
      "verified": true,
      "author": "HaleyG",
      "helpful_votes": 2,
      "publication_date": 20170920
    },
    {
      "title": "Great car seat!",
      "text": "We’ve been very satisfied with the car seat. I’ve owned several models over the course of the last 9 years and 4 children. Would recommend to anyone! Easy to use and clean.",
      "rating": 5.0,
      "verified": true,
      "author": "Brittany Y.",
      "helpful_votes": 0,
      "publication_date": 20181123
    },
    {
      "title": "Lightweight, sturdy and great value",
      "text": "GREAT CARSEAT! The value of this carseat is unbeatable, it's lightweight, durable, great color, easy to use and comfortable for baby. When looking at other similarly rated carseats (Britax, Chicco) this one seemed to be the best for the price and after receiving it, my predictions were confirmed! Definitely love it.",
      "rating": 5.0,
      "verified": true,
      "author": "Alex Branam",
      "helpful_votes": 0,
      "publication_date": 20161021
    },
    {
      "title": "Perfect for My twins",
      "text": "Perfect for my twin girls. I wish the hood went down a little further to protector from the elements and I replaced the inner head padding to a nicer, softer one from Target, but overall, it is a really great carseat and the price point is wonderful.",
      "rating": 5.0,
      "verified": true,
      "author": "Natalie_Mac",
      "helpful_votes": 0,
      "publication_date": 20180516
    },
    {
      "title": "Baby gift starts at 4 pounds perfect for the Preemies",
      "text": "It’s a gift for a baby shower next weekend the little guy was 3 months early so I’m glad it starts at 4 pounds!",
      "rating": 5.0,
      "verified": true,
      "author": "Vickie M.",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Great car seat",
      "text": "Great car seat. The straps adjust easily and have lots of room for growth. Right now I have the straps on the second rung for an infant. He sits well in it and is cozy. The base secures to a seat with only the seat belt easily and securely. We love it.",
      "rating": 5.0,
      "verified": true,
      "author": "camecol",
      "helpful_votes": 0,
      "publication_date": 20171229
    },
    {
      "title": "Makes life with twins easier",
      "text": "Its si much easier to get babies ready in the carry car seat and just SNAP it into the holder already in the car. Great with the stroller as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Maryellen T Rowley",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "My package was already open when it got off the ...",
      "text": "My package was already open when it got off the delivery truck per my home cameras.. There were a couple oil spots on the car seat fabric, it could have been due to my package being open already before delivery.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180517
    },
    {
      "title": "Great car seat for your child",
      "text": "We've had this car seat for 3 months now and don't have any complaints. We have the LATCH system in our cars so that makes installing the base very easy. The shoulder straps are easy to get my baby in and out of. He seems very secure in the seat even when he was very little. The seat is very light which helps Mom carry him to appointments and the store. Overall solid car seat!",
      "rating": 5.0,
      "verified": true,
      "author": "Guz",
      "helpful_votes": 0,
      "publication_date": 20150727
    },
    {
      "title": "Sturdy and easy to handle",
      "text": "Sturdy and easy to handle. Somewhat heavy; however, like many things of this nature I may purchase I consider this a safety trade-off. Would prefer any easier access and marking of the tension adjustment for security strap.",
      "rating": 5.0,
      "verified": true,
      "author": "SLB",
      "helpful_votes": 0,
      "publication_date": 20160717
    },
    {
      "title": "too sweaty!",
      "text": "Bought this because it was the lightest one and not overly expensive but my daughter always gets too sweaty in this no matter what’s shes wearing and it doesn’t seem too comfy tbh.",
      "rating": 2.0,
      "verified": true,
      "author": "Appollonia",
      "helpful_votes": 0,
      "publication_date": 20180605
    },
    {
      "title": "This is my third graco and best one so far",
      "text": "Car seats have came along way. This is my third graco and best one so far. Love how this one lays down almost level compared to older models! Will recommend",
      "rating": 5.0,
      "verified": true,
      "author": "Momof3R’s",
      "helpful_votes": 0,
      "publication_date": 20180420
    },
    {
      "title": "Graco car seats are awesome.",
      "text": "We love graco clicks. Makes in and out of the car so much easier. He’s little yet so he has plently if room. But definitely can’t wait to see how long he’ll enjoy his car seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley Hoffman",
      "helpful_votes": 0,
      "publication_date": 20190417
    },
    {
      "title": "Base seems unstable",
      "text": "I like it in general, my only complaint is it seems super wiggly when connected to the car base, no matter how tight we strap it down. Works great in the click connect fast action jogging stroller!",
      "rating": 5.0,
      "verified": true,
      "author": "Kelsey Top Contributor: Baby",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "Works great",
      "text": "Had for about 3 weeks so far and it is great. Light weight and appears comfortable for our little one. Would recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Tiphany Price",
      "helpful_votes": 0,
      "publication_date": 20180709
    },
    {
      "title": "Great for your infant",
      "text": "Another quality Graco product. Easy to use and well made.",
      "rating": 5.0,
      "verified": true,
      "author": "Matt Rusiewicz",
      "helpful_votes": 0,
      "publication_date": 20190505
    },
    {
      "title": "which made it even better.",
      "text": "We searched long and hard for a car seat. We knew it was likely that our little one would be born early. Our NICU let’s babies go home at as little as 4lbs. So in all ways, this car seat met our needs. Plus it’s affordable, which made it even better.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171018
    },
    {
      "title": "Good car seat",
      "text": "The top awning on this car seat is not strong and doesn't pull forward as much as expected. Overall, it's a good car seat though. My only issue is with the cover.",
      "rating": 4.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Five stars",
      "text": "This came with the car sear connector ...this carrier is so simple I am in love. Arrived on time I'm super happy I chose this product I'm getting the Gotham three wheel click connect jogger stroller to go with it..i def recommend this car seat! I'd prefer if it was softer and more cozy but I read other car seat reviews and it really doesn't matter as long as it's safe",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160309
    },
    {
      "title": "Safety",
      "text": "Loved this Infant carrier! Easy to use and clicked right into any Graco strollers. I have 2 strollers a Graco Remix and Double stroller. This seat worked perfectly with both of them!",
      "rating": 5.0,
      "verified": true,
      "author": "Katrina",
      "helpful_votes": 0,
      "publication_date": 20180929
    },
    {
      "title": "Excellent Condition",
      "text": "The only thing wrong with this item was a hole in the box. Car seat in perfect condition, perfect color and still in original packaging. Always check Amazon Warehouse before paying full price for any product.",
      "rating": 5.0,
      "verified": true,
      "author": "Kimmer ",
      "helpful_votes": 0,
      "publication_date": 20190123
    },
    {
      "title": "This was a great Infant seat for the new baby",
      "text": "This was a great Infant seat for the new baby. He has outgrown it and we purchased a larger one. Very happy with your products",
      "rating": 5.0,
      "verified": true,
      "author": "JoAnn S. Parker",
      "helpful_votes": 0,
      "publication_date": 20180410
    },
    {
      "title": "Love this car seat",
      "text": "Love this car seat. We used it for our sons first year before he finally grew out of it. Our son loved it so I suppose it’s comfy :) No issues with it.",
      "rating": 5.0,
      "verified": true,
      "author": "I Tell it Like it is..",
      "helpful_votes": 0,
      "publication_date": 20180407
    },
    {
      "title": "Great car seat",
      "text": "Great car seat, got it as a baby shower gift for my brother, he and the wife love it, and actually ended up saving almost 40$ off of retail",
      "rating": 5.0,
      "verified": true,
      "author": "Craig B",
      "helpful_votes": 0,
      "publication_date": 20170107
    },
    {
      "title": "Great Carseat!",
      "text": "I absolutely love this carseat. Its light, easy to clean and super convenient and easy to click in and out of the car. It's also rated one of the best seats.",
      "rating": 5.0,
      "verified": true,
      "author": "Emily",
      "helpful_votes": 0,
      "publication_date": 20180807
    },
    {
      "title": "EASY to use!",
      "text": "This is a great car seat! It is very light weight. Snaps in to base with ease. Straps are easy to adjust as baby grows. No complaints from this first time mom.",
      "rating": 5.0,
      "verified": true,
      "author": "KB",
      "helpful_votes": 0,
      "publication_date": 20180620
    },
    {
      "title": "It is super light and seems durable",
      "text": "Went from the biggest and heaviest carseat Graco made to this one....what a back lifesaver. It is super light and seems durable. I don't think it will breathe much in hot weather though. Which should not be a issue as baby is coming in the winter and by the time the hot weather is here he wont be staying in it for long periods of time.",
      "rating": 5.0,
      "verified": true,
      "author": "fuzzybird6",
      "helpful_votes": 0,
      "publication_date": 20150109
    },
    {
      "title": "Great buy for a safe car seat",
      "text": "Easy to install. I replaced the head pillow with another since it looked cheap. Overall a great buy for safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Idaho Spud 69",
      "helpful_votes": 0,
      "publication_date": 20180702
    },
    {
      "title": "Great baby gift",
      "text": "Purchased for my niece. This was the one she really wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret Tufts",
      "helpful_votes": 0,
      "publication_date": 20190429
    },
    {
      "title": "Lightweight carseat and easy to get in and out of the car",
      "text": "Lightweight carseat and easy to get in and out of the car. I love the gender neutral color. The shade usually gets stuck behind the handle which is kind of a pain, but I have a blanket cover so I don't use the shade anyway. I wouldn't plan on actively using it because it is a pain to get it back and forth with the handle down.",
      "rating": 5.0,
      "verified": true,
      "author": "Megan Leach",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Easy to carry and lightweight.",
      "text": "I like the car seat but I’m disappointed because it did it comes with head support and boot to keep baby’s legs warm and it didn’t come with it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jessica",
      "helpful_votes": 0,
      "publication_date": 20180730
    },
    {
      "title": "Light and Easy",
      "text": "Love this carseat. This is our second carseat. Our first was a Graco Snugride Ckick Connect 30, and we should have gone with the 35 the first time around! It's light, easy to clean, user friendly, and large enough to keep baby rear facing a little longer than the 30.",
      "rating": 5.0,
      "verified": true,
      "author": "Lindsey Maurer",
      "helpful_votes": 0,
      "publication_date": 20161113
    },
    {
      "title": "Good looking",
      "text": "I like the all black. It looks very nice and sleek. It works great too.",
      "rating": 5.0,
      "verified": true,
      "author": "Bmh099",
      "helpful_votes": 0,
      "publication_date": 20180917
    },
    {
      "title": "Was a gift and got good feedback. Seems like Graco seats are the brand ...",
      "text": "Was a gift and got good feedback. Seems like Graco seats are the brand to buy- good features and good reputation.",
      "rating": 5.0,
      "verified": true,
      "author": "dbd27",
      "helpful_votes": 0,
      "publication_date": 20180707
    },
    {
      "title": "The best carseat for the price",
      "text": "We've loved all of our Graco carseats, but these are our favorites we've owned!! Our twins love them too! I recommend them to everyone!",
      "rating": 5.0,
      "verified": true,
      "author": "Hayley BradshawTop Contributor: Guitars",
      "helpful_votes": 0,
      "publication_date": 20170812
    },
    {
      "title": "Good price",
      "text": "The insert doesn’t do anything to keep baby out but it’s a standard car seat",
      "rating": 4.0,
      "verified": true,
      "author": "Candi",
      "helpful_votes": 0,
      "publication_date": 20180724
    },
    {
      "title": "... as a backup for my grandson and my daughter loved it so much more than the one she already ...",
      "text": "Bought this to have as a backup for my grandson and my daughter loved it so much more than the one she already had. It's nice because it lays them back just a little bit more, so as to avoid so much of their heads drooping forward when in the car.",
      "rating": 5.0,
      "verified": true,
      "author": "Juliet S. Freeto",
      "helpful_votes": 0,
      "publication_date": 20160407
    },
    {
      "title": "This was a great carseat for my little one though piling does happen ...",
      "text": "This was a great carseat for my little one though piling does happen after a few months of use, it's just a cosmetic issue and it didn't bother me or affect its function and safety.",
      "rating": 5.0,
      "verified": true,
      "author": "Ambar",
      "helpful_votes": 0,
      "publication_date": 20171001
    },
    {
      "title": "Click connect is amazing.",
      "text": "I haven’t been able to actually use this yet, my baby won’t be making an appearance for another two weeks, but I did take it all out and I tried it out with my Graco TRAX stroller and it seems easy enough to click in and take out of place. I’m very excited to get to use this.",
      "rating": 5.0,
      "verified": true,
      "author": "Danielle Strong",
      "helpful_votes": 0,
      "publication_date": 20180111
    },
    {
      "title": "My daughter has been in this seat for 11 months ...",
      "text": "My daughter has been in this seat for 11 months now. No problems. I do think she's ready for a bigger seat though. So, we'll probably have to move out of it at her 1 year mark.",
      "rating": 5.0,
      "verified": true,
      "author": "Girlsmitten",
      "helpful_votes": 0,
      "publication_date": 20180526
    },
    {
      "title": "Five Stars",
      "text": "Love this car seat. Unfortunately had to return it because wife had another one as a present",
      "rating": 5.0,
      "verified": true,
      "author": "Francisco Torres ",
      "helpful_votes": 0,
      "publication_date": 20180306
    },
    {
      "title": "We bought the \"summer\" brand car seat headrest thing for newborns and it fits beautifully with it without any worry of her head bobbing ...",
      "text": "I will be buying this again for our next child. Plenty of room to grow and still light weight. We bought the \"summer\" brand car seat headrest thing for newborns and it fits beautifully with it without any worry of her head bobbing around so much.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170620
    },
    {
      "title": "it's so easy to handle",
      "text": "We bought this to go with the graco lightweight 3 wheels stroller, it's so easy to handle, just listen for the 3 clicks, and you have a complete travel system. My baby lives his carseat, no issues at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Aaron",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Love this car seat from the color to the product",
      "text": "Love this car seat from the color to the product. Love that it is not to bulky or too heavy.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20171204
    },
    {
      "title": "Four Stars",
      "text": "This isn't as bad as the reviews say. It does the job. I am a pleased customer",
      "rating": 4.0,
      "verified": true,
      "author": "Panicdanic",
      "helpful_votes": 0,
      "publication_date": 20170115
    },
    {
      "title": "Awesome car seat",
      "text": "Awesome, safe, well built, easy to use/install. Also have the stroller this seat works with and it is perfect with that as well.",
      "rating": 5.0,
      "verified": true,
      "author": "ronnie",
      "helpful_votes": 0,
      "publication_date": 20170616
    },
    {
      "title": "Five Stars",
      "text": "I love the Graco brand and the click connect is everything.",
      "rating": 5.0,
      "verified": true,
      "author": "DMoore",
      "helpful_votes": 0,
      "publication_date": 20180123
    },
    {
      "title": "Very light",
      "text": "We really like this car seat. It's super light and looks comfortable. It's easy to install in the car and it clicks easily when transporting. So far very satisfied.",
      "rating": 5.0,
      "verified": true,
      "author": "JenniH",
      "helpful_votes": 0,
      "publication_date": 20160615
    },
    {
      "title": "car seat",
      "text": "OMG so with it fit as a new born and still using it at 6 months sure will be using it for quite a while longer. works great and easy carry too!",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara",
      "helpful_votes": 0,
      "publication_date": 20161012
    }
  ],
  "product_meta": {
    "title": "Graco SnugRide 35 Infant Car Seat | Baby Car Seat, Gotham",
    "description": "The SnugRide Click Connect 35 infant car seat is designed to protect babies rear-facing from 4-35 lbs and features a comfortable seat to keep baby safe and cozy. SnugRide Click Connect 35 is equipped with Click Connect technology providing a one-step secure attachment to all Graco Click Connect strollers making it easy to create a travel system that best fits your lifestyle.. Machine-washable seat cushion, Metal and plastic parts may be cleaned with mild soap and water, Buckle may be cleaned with a damp cloth, Rear-Facing Only. Weight- 4-35 pounds Height- up to 32 inches Head must be more than 1 inches from the top of the headrest Infant car seats made 2011 or after have an expiration date of 7 years from manufactured date. STOP using this car seat and throw it away 7 years after the date of manufacture. Look for date of manufacture label on back of the car seat. Infant car seats made prior to 2011 have an expiration date 6 years from manufactured date.(General Warnings) The American Academy of Pediatricians (AAP) and National Highway Safety Administration (NHTSA) recommend that children ride rear-facing until the age of 2 or until they reach the maximum rear facing height or weight rating for their car seat. Always remember to check your local or state laws regarding car seat usage. No bleach",
    "rating": 4.8,
    "feature_bullets": [
      "Ultra-lightweight infant car seat is easy to transport from the car to the stroller and everywhere in between",
      "Rear-facing newborn car seat helps protect infants from 4 - 35 pounds; and up to 32\", making it an excellent first car seat for baby",
      "Click Connect system provides a one-step secure attachment between the rear facing car seat to all Graco Click Connect Strollers to create a travel system",
      "These Graco infant car seats are rigorously crash tested to meet or exceed US safety standards and reassure safety-conscious parents",
      "SafeSeat Engineered and crash tested to meet or exceed US standard FMVSS 213. EPS, energy absorbing foam for effective impact energy management"
    ],
    "specifications": {
      "Product Dimensions": "28 x 18.7 x 15.6 inches",
      "Item Weight": "7.5 pounds",
      "Department": "Baby-boys",
      "Manufacturer": "Graco",
      "ASIN": "B00H8MQ4US",
      "Item model number": "1893807",
      "Customer Reviews": "4.8 out of 5 stars540 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#28,112 in Baby",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "December 11, 2013"
    },
    "categories": [
      "Car Seats & Accessories",
      "Home & Kitchen",
      "Baby Products",
      "Car Seats",
      "Infant"
    ],
    "price": ""
  }
}