{
  "website_summaries": [
    {
      "verdict": "An attractive choice at an unbeatable price, yet quality is uncompromised. The best product for budget-minded consumers.",
      "pros": [
        "Traditional shape and pleated fabric match almost any décor",
        "Spider fitting is white to match the shade",
        "Provides perfect amount of light shading"
      ],
      "cons": [
        "Color may seem more \"bright white\" than \"antique white.\"",
        "Otherwise, few complaints about this well-made and affordable shade"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "talk about excellent packaging, it could have survived an earthquake",
      "text": "Wow, talk about excellent packaging, it could have survived an earthquake. Nice shade, decent quality. Just don't let the words Antique White fool you into thinking this is an off white or vanilla type of color. The word Antique must refer to the style because it's a bright white. Not really what I wanted but it's now on the lamp and staying there, hopefully it will darken a little over time.",
      "rating": 4.0,
      "verified": true,
      "author": "LINDA C.",
      "helpful_votes": 24,
      "publication_date": 20170211
    },
    {
      "title": "This is a beautiful mushroom pleated lamp shade",
      "text": "This is a beautiful mushroom pleated lamp shade. I was worried that, because it said \"antique white \"in the description, it would be beige but it turned out to be a nice white color after all. It was priced well, arrived quickly and packed well.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 16,
      "publication_date": 20180223
    },
    {
      "title": "Very nice lamp shade",
      "text": "As many people have mentioned, this shade was packed really (really!) well. I wanted it for a bedroom lamp and it looks good. I would have given it 5 stars if it had been a bit cheaper.",
      "rating": 4.0,
      "verified": true,
      "author": "Pat",
      "helpful_votes": 9,
      "publication_date": 20180330
    },
    {
      "title": "The Perfect Lampshade",
      "text": "This perfect lampshade arrived today in perfect condition...very carefully packed to protect it. Bought it so I could get better light from the lamp as the previous one was paper backed and only let light out the top and bottom. Bought new LED bulbs and wanted the most light possible. This is the perfect shade to do just that. Had to use the old harp because my arthritis hands could not squeeze the strong, new one, but the fit is perfect, so no problem. The next owner of the older lampshade will have a nice, shiny new harp and we both will be happy. Will gladly do business with these sellers again.",
      "rating": 5.0,
      "verified": true,
      "author": "N. A. Wysock",
      "helpful_votes": 8,
      "publication_date": 20170907
    },
    {
      "title": "Great Shade Replacement - Much more light transmitted",
      "text": "I replaced a Stiffle lampshade which was abut 20 years old and yellowing - this new lampshade, which is much whiter, transmits a lot more light from a 100 watt equivalent (18 watt LED) making the room much brighter. I definitely accomplished what I set out to do!",
      "rating": 5.0,
      "verified": true,
      "author": "TW",
      "helpful_votes": 18,
      "publication_date": 20160822
    },
    {
      "title": "Really awesome shade. Great price.",
      "text": "I love the size and shape. But what I love the most is the white color is actually really white. The old shade was white too, but it looked off white almost yellow. This is a nice bright white. Seems like a well build shade. The fan of is well attached. The plastic shade material is nice and think. It even came with a new harp, although my old harp was a bit taller and looked better on my lamp. Very well packaged. Came in perfect shape.",
      "rating": 5.0,
      "verified": true,
      "author": "AmazonShopperDavidTop Contributor: Camping",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Had to replace a lamp shade",
      "text": "It's a white pleated-fabric lamp shade. Not quite big enough for the lamp and would have preferred off-white/beige to coordinate with other lamps, but it's the closest I could find to match the one it replaced. Just a comment about lamp shades in general - prices seem exorbitant for what you get (clothes hanger wire, cardboard and fabric), and I can never seem to find the exact size or style needed at any price.",
      "rating": 3.0,
      "verified": true,
      "author": "Kent Sowers",
      "helpful_votes": 7,
      "publication_date": 20170909
    },
    {
      "title": "Beautiful shade, came with an 8\" harp and top ...",
      "text": "Beautiful shade, came with an 8\" harp and top nob. I was so surprised to see the added pieces to the shade. I made it extremely worth it as you would have to buy the harp and top nob and that could easily cost you $10-$15 extra after the price of the shade. It really the perfect size for what we wanted and looks great on a lamp that sits on a side table. THANK YOU SELLER!!",
      "rating": 5.0,
      "verified": true,
      "author": "Smoggy66",
      "helpful_votes": 2,
      "publication_date": 20180718
    },
    {
      "title": "The product offers exactly what is advertised",
      "text": "I am very pleased with the appearance. The lamp shade that we had was old and dingy looking and made the lamp look old (which it is). But a new shade with a different shape and off white color really brightened the lamp and it looks great. Didn't have to buy a new lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "pwi",
      "helpful_votes": 2,
      "publication_date": 20180821
    },
    {
      "title": "Lamps Plus exceeded My Expectations",
      "text": "Lamps Plus exceeded my expectations. The lamp shade was super securely wrapped and protected. I'm very glad Lamps Plus wrote that a correct size harp was included with the shade. They know their business. My old harp didn't work with this new shade. I'm very happy with my purchase. I will definitely buy from Lamps Plus again.",
      "rating": 5.0,
      "verified": true,
      "author": "Ferdie",
      "helpful_votes": 0,
      "publication_date": 20190506
    },
    {
      "title": "It is a beautiful shade and exactly what I was looking for to ...",
      "text": "This shade arrived on time and carefully packaged. It is a beautiful shade and exactly what I was looking for to replace an old damaged shade that was an original that came with the lamp... I am very pleased with this purchase and will be sure to purchase from this vendor again in the future...",
      "rating": 5.0,
      "verified": true,
      "author": "map",
      "helpful_votes": 2,
      "publication_date": 20180524
    },
    {
      "title": "I love this lampshade and will order more!",
      "text": "I love this lampshade!! It’s so pretty in white and extremely well made. The company packed did an exceptional job packing it in the box. My package started it’s journey in CA and made it to NY without a single dent to box or lampshade! Definitely purchase this lampshade!",
      "rating": 5.0,
      "verified": true,
      "author": "JS",
      "helpful_votes": 0,
      "publication_date": 20190317
    },
    {
      "title": "Nice lampshade for the money",
      "text": "I was replacing a lampshade that I had purchased about 8-10 years ago, when I received this shade it was just like my previous shade. The inside is a hard plastic which is covered with the pleated material on the outside. I was replacing because my previous shade had discolored a tiny bit over the years but primarily because the plastic inside had started to crack and break apart, although I thought for 8 years or so, it held up way with kids and time",
      "rating": 5.0,
      "verified": true,
      "author": "Pamela J",
      "helpful_votes": 0,
      "publication_date": 20200215
    },
    {
      "title": "Very nice well made shade",
      "text": "Very nice shade for the money. Is definitely a true white color as mentioned in other reviews. Was packaged well and arrived in perfect condition. Was just what I was looking for",
      "rating": 5.0,
      "verified": true,
      "author": "Janice Wheelbarger",
      "helpful_votes": 2,
      "publication_date": 20180804
    },
    {
      "title": "Great buy!",
      "text": "On opening the box I saw that the shade was very well packed -- quite impressive. Of course the shade was in perfect condition and looks just right...terrific in fact. The price was great and I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Jane Doe",
      "helpful_votes": 0,
      "publication_date": 20200202
    },
    {
      "title": "Very Happy",
      "text": "Beautiful lamp shade at a great price. I ordered a pleated shade for an antique lamp. This shade was the perfect complement, I was surprised at the high quality based on the low price.",
      "rating": 5.0,
      "verified": true,
      "author": "Sally Shopper",
      "helpful_votes": 0,
      "publication_date": 20201005
    },
    {
      "title": "Great company",
      "text": "Very nice, well packaged and delivered on time. Looks just like what I wanted and the light is so much brighter now. Dimensions are perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "Joel C. Walker",
      "helpful_votes": 2,
      "publication_date": 20180820
    },
    {
      "title": "Low cost, great fit!!!",
      "text": "Been looking for a shade for this particular lamp for a while, whenever I did find one it was either the wrong size, cost too much or both. This fits perfectly!",
      "rating": 5.0,
      "verified": true,
      "author": "Kindle Customer",
      "helpful_votes": 0,
      "publication_date": 20200107
    },
    {
      "title": "Beautiful, great bargain",
      "text": "Just what I needed to update our old, but still useful lamps. The bright white of the shades added a lot of light to our living room.",
      "rating": 5.0,
      "verified": true,
      "author": "Lorena Keech",
      "helpful_votes": 0,
      "publication_date": 20200807
    },
    {
      "title": "They arrived in perfect condition with environmentally correct packing",
      "text": "This shade is just what I was looking for. The right size for my two bedside lamps. A White that allows lots of light with out glare. They arrived in perfect condition with environmentally correct packing.",
      "rating": 5.0,
      "verified": true,
      "author": "Grandma Donna",
      "helpful_votes": 6,
      "publication_date": 20160730
    },
    {
      "title": "Good buy!",
      "text": "Nice product, fits perfectly as I measure, sturdy and attractive. Replacing an old lampshade that just was crumbling.",
      "rating": 5.0,
      "verified": true,
      "author": "F. Patterson",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Lovely Lampshade !",
      "text": "This item is of good quality, better than picture, very happy with the product ! I highly recommend it !!!",
      "rating": 5.0,
      "verified": true,
      "author": "LH",
      "helpful_votes": 0,
      "publication_date": 20200606
    },
    {
      "title": "Great value, packaging,  harp included, but connecting saddle NOT included",
      "text": "Like: packaging, color, value Dislike: description could include harp included but saddle for the harp is NOT included",
      "rating": 4.0,
      "verified": true,
      "author": "QAWeb",
      "helpful_votes": 0,
      "publication_date": 20190628
    },
    {
      "title": "They were just fine and packaged really well",
      "text": "They were just fine and packaged really well. On a personal note (no reflection on product), the white is REALLY white and I wish I had gotten the cream color.",
      "rating": 5.0,
      "verified": true,
      "author": "P B Hinton",
      "helpful_votes": 0,
      "publication_date": 20180525
    },
    {
      "title": "Perfect for my needs",
      "text": "Just perfect for what I bought it for. Classy, well constructed and perfect fit",
      "rating": 5.0,
      "verified": true,
      "author": "Regis",
      "helpful_votes": 0,
      "publication_date": 20200430
    },
    {
      "title": "Works great!",
      "text": "Simple basic shade for a reasonable price after my previous one fell apart. The white material lets a lot of light shine through, which is what we wanted. It's great!",
      "rating": 5.0,
      "verified": true,
      "author": "Pam Bruno",
      "helpful_votes": 0,
      "publication_date": 20190304
    },
    {
      "title": "Very nice",
      "text": "Matched the other shades in the room. Very nice quality.",
      "rating": 5.0,
      "verified": true,
      "author": "Don",
      "helpful_votes": 0,
      "publication_date": 20200426
    },
    {
      "title": "White is really, really white",
      "text": "Really bright and will match my others once it ages a little.",
      "rating": 5.0,
      "verified": true,
      "author": "Bob Cat",
      "helpful_votes": 0,
      "publication_date": 20200310
    },
    {
      "title": "Perfect fit",
      "text": "This lamp shade is replacing the original shade. It is much brighter which is perfect for my reading nook.",
      "rating": 4.0,
      "verified": true,
      "author": "Nina S.",
      "helpful_votes": 0,
      "publication_date": 20190308
    },
    {
      "title": "Very good lampshade",
      "text": "Exactly what I was hoping for. Very well made. Very well packaged. Good value for your money",
      "rating": 5.0,
      "verified": true,
      "author": "Bruce Higginbotham",
      "helpful_votes": 0,
      "publication_date": 20190826
    },
    {
      "title": "Great value beautiful lampshade.",
      "text": "Upgraded my lamps. This shade is beautiful and sturdy. Looks great.",
      "rating": 5.0,
      "verified": true,
      "author": "Barbara Basile",
      "helpful_votes": 0,
      "publication_date": 20191124
    },
    {
      "title": "Lovely",
      "text": "It was just perfect & half the price of Wayfair.",
      "rating": 5.0,
      "verified": true,
      "author": "maureen lawrence",
      "helpful_votes": 0,
      "publication_date": 20200423
    },
    {
      "title": "Great Shade for the Money",
      "text": "arrived on time and was very well packed - excellent shade for the low price",
      "rating": 5.0,
      "verified": true,
      "author": "W.C.",
      "helpful_votes": 0,
      "publication_date": 20200206
    },
    {
      "title": "Lamp Shade was perfect!",
      "text": "The lamp shade arrived today in one of the sturdiest boxes I've seen. With all the packaging inside it was in perfect condition, and exactly as described and as I expected. Putting the new shade on the lamp was very easy and it made it look like I have a new lamp. I'm thrilled with both the product and the service.",
      "rating": 5.0,
      "verified": true,
      "author": "Vicki",
      "helpful_votes": 0,
      "publication_date": 20190716
    },
    {
      "title": "Antique",
      "text": "I had an antique lamp and it was a perfect fit!",
      "rating": 5.0,
      "verified": true,
      "author": "Nana",
      "helpful_votes": 0,
      "publication_date": 20200427
    },
    {
      "title": "Really good product and customer service rep.",
      "text": "I liked the quality, the fast shipping and excellent packing and the man at customer service was helpful and polite and really nice.",
      "rating": 5.0,
      "verified": true,
      "author": "B McMillian",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "As Advertised",
      "text": "Item arrived promptly, was well packaged, no damage. Just as advertised, the right size and style for the lamp I purchased it for. I would buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200226
    },
    {
      "title": "Lamp shade",
      "text": "Exactly as described. Perfect replacement for an old shade. It is white-which was what we wanted.",
      "rating": 5.0,
      "verified": true,
      "author": "Melody Grosskopf",
      "helpful_votes": 0,
      "publication_date": 20191023
    },
    {
      "title": "Just what our living room needed.",
      "text": "By simply purchasing this lamp shade, you can't tell that one of the lamps isn't exactly the same as the other two lamps we already had.",
      "rating": 5.0,
      "verified": true,
      "author": "Roseanne M. Pickering",
      "helpful_votes": 0,
      "publication_date": 20180802
    },
    {
      "title": "Very nice and fit our pole lamp.",
      "text": "Looks great and the white adds more light to the room.",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah S. Howlett",
      "helpful_votes": 0,
      "publication_date": 20200223
    },
    {
      "title": "Shade",
      "text": "Wasn't the size I really wanted but it did the trick.",
      "rating": 5.0,
      "verified": true,
      "author": "Denis",
      "helpful_votes": 0,
      "publication_date": 20190606
    },
    {
      "title": "Nice style",
      "text": "The shade is classic and looks lovely. Just what I wanted. Pleated and perfect for my lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "grandmaluvs16",
      "helpful_votes": 0,
      "publication_date": 20181210
    },
    {
      "title": "Cost more than I wanted to pay.",
      "text": "Attractive and sturdy, but a little shorter than I expected. The price was higher than I wanted to pay, but other sites were about the same.",
      "rating": 4.0,
      "verified": true,
      "author": "Genie C.",
      "helpful_votes": 0,
      "publication_date": 20190804
    },
    {
      "title": "Perfect",
      "text": "Looks like the one that we had to replace. Arrived intact and on time.",
      "rating": 5.0,
      "verified": true,
      "author": "JJ",
      "helpful_votes": 0,
      "publication_date": 20200514
    },
    {
      "title": "The lamp shade is exactly what I wanted except I ...",
      "text": "The lamp shade is exactly what I wanted except I guess I didn't know how to measure properly. It is too small for my lamp but I am using it anyway.",
      "rating": 5.0,
      "verified": true,
      "author": "Rose Shannon",
      "helpful_votes": 0,
      "publication_date": 20180222
    },
    {
      "title": "Perfect Experience",
      "text": "Arrived the following day in perfect condition. Very nice looking shade. Happy with the purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "mark vest",
      "helpful_votes": 0,
      "publication_date": 20180826
    },
    {
      "title": "Nice inexpensive lamp shade",
      "text": "I needed a replacement lampshade for an inexpensive floor lamp. So I didn't want to spend a lot. This fit the bill. Nice quality and looks good.",
      "rating": 5.0,
      "verified": true,
      "author": "Donald1323",
      "helpful_votes": 0,
      "publication_date": 20200905
    },
    {
      "title": "Great shade, good service from seller, and everything as expected.",
      "text": "The quality was just as stated and included a high quality heavy duty shade harp. My old lamp had a standard harp bracket and could not use the new harp. An option for a standard harp would be a good add to the offer.",
      "rating": 5.0,
      "verified": true,
      "author": "Jack",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "I'm very happy with them the quality is great and the added ...",
      "text": "I like this product SO much I bought a second set. the workmanship speaks for itself. customer service was great and Dawn was so helpful getting my second shipped out. shipping is free a big plus and they used fed ex. just a very nice product",
      "rating": 5.0,
      "verified": true,
      "author": "jasper",
      "helpful_votes": 0,
      "publication_date": 20170504
    },
    {
      "title": "An Excellent Value",
      "text": "This is the second time I've purchased this shade for a lamp and as before, was delighted with it. It arrived intact, on time, and as shown.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper Dave",
      "helpful_votes": 7,
      "publication_date": 20141229
    },
    {
      "title": "Perfect replacement.  Right fit. Right color.",
      "text": "Included harp was easy to fit. Shade was the best it could have been. Delivered on time. Yay!",
      "rating": 5.0,
      "verified": true,
      "author": "Peggy M.",
      "helpful_votes": 0,
      "publication_date": 20190605
    },
    {
      "title": "Great lamp shade!",
      "text": "Arrived in great condition. I was a little leery of ordering something as fragile as a lampshade, to be shipped half way across the county. But it was extremely well packed in a very sturdy box. The lampshade is of high quality, and nice looking. Couldn't ask for more!",
      "rating": 4.0,
      "verified": true,
      "author": "arkansan",
      "helpful_votes": 0,
      "publication_date": 20170128
    },
    {
      "title": "Well made",
      "text": "This was a replacement shade, and was exactly the same",
      "rating": 5.0,
      "verified": true,
      "author": "Alfie E.",
      "helpful_votes": 0,
      "publication_date": 20200225
    },
    {
      "title": "Nice product at a reasonable price compared to the relatively ...",
      "text": "Nice product at a reasonable price compared to the relatively high cost of lamp shade alternatives vs. the original lamp cost!",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180426
    },
    {
      "title": "great shades.",
      "text": "Colir is more of a pure white than cream. Otherwise, great shades.",
      "rating": 4.0,
      "verified": true,
      "author": "Lynn Klein",
      "helpful_votes": 0,
      "publication_date": 20171024
    },
    {
      "title": "Perfect Fit",
      "text": "I'd been looking for months for a specific lampshade and in desperation tried Amazon. I knew exactly what I wanted and thanks to Lamps Plus, I got it!",
      "rating": 5.0,
      "verified": true,
      "author": "Kadlady",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Highly reflective",
      "text": "A perfect fit for an old Italian ceramic lamp base. Elegant and highly reflective for great overall lighting. Great price.",
      "rating": 5.0,
      "verified": true,
      "author": "little thinker",
      "helpful_votes": 0,
      "publication_date": 20170823
    },
    {
      "title": "Nice shades.",
      "text": "These were very nice. Sized as noted and look good. Not a bright white, but definitely a nice white.",
      "rating": 5.0,
      "verified": true,
      "author": "Catherine R",
      "helpful_votes": 0,
      "publication_date": 20171029
    },
    {
      "title": "Four Stars",
      "text": "a little pricey, but exactly what I needed. very white and bright.",
      "rating": 4.0,
      "verified": true,
      "author": "Trump Train",
      "helpful_votes": 0,
      "publication_date": 20180415
    },
    {
      "title": "Great Value",
      "text": "Allows much light through the fabric. Shallow pleats so casual appearance. Money well spent",
      "rating": 5.0,
      "verified": true,
      "author": "Unsuk W.",
      "helpful_votes": 0,
      "publication_date": 20200403
    },
    {
      "title": "Quality Lampshade Source.",
      "text": "Just as advertised. Appear to be quality lamp shades. Recommend as a source for lamp shades. Will use again.",
      "rating": 5.0,
      "verified": true,
      "author": "J. McGonnell",
      "helpful_votes": 0,
      "publication_date": 20171015
    },
    {
      "title": "Perfect!",
      "text": "Replaced old yellowed lamp shades.I searched for months and finally found these. They brighten the whole room.",
      "rating": 5.0,
      "verified": true,
      "author": "dona",
      "helpful_votes": 0,
      "publication_date": 20191207
    },
    {
      "title": "A Perfect Replacement",
      "text": "This shade appears to be well constructed and is a perfect replacement for my old worn shade. It is perfect for my needs. It is a nice soft white, but not a bright white.",
      "rating": 5.0,
      "verified": true,
      "author": "MercedesMom",
      "helpful_votes": 0,
      "publication_date": 20161006
    },
    {
      "title": "Grate Shades",
      "text": "Just perfect for my lamps? The height is just right, and the color fits my room perfectly. Good that they came with the spider.",
      "rating": 5.0,
      "verified": true,
      "author": "ECG and beyond",
      "helpful_votes": 0,
      "publication_date": 20170212
    },
    {
      "title": "Looks great.",
      "text": "Living room and it lights up the room more than my old one.",
      "rating": 5.0,
      "verified": true,
      "author": "Nando",
      "helpful_votes": 0,
      "publication_date": 20200304
    },
    {
      "title": "Just right",
      "text": "This is exactly what I wanted and at the right price.",
      "rating": 5.0,
      "verified": true,
      "author": "Hannah Banana",
      "helpful_votes": 0,
      "publication_date": 20180616
    },
    {
      "title": "Very pretty shades at a good price",
      "text": "Nice shades, fast and safe delivery, the addition of harps is a pleasant bonus.",
      "rating": 5.0,
      "verified": true,
      "author": "ThinkFirst",
      "helpful_votes": 0,
      "publication_date": 20171011
    },
    {
      "title": "Looks good.",
      "text": "Very nice. Wish it came in a nice off white. But it works.",
      "rating": 5.0,
      "verified": true,
      "author": "suziQ",
      "helpful_votes": 0,
      "publication_date": 20180424
    },
    {
      "title": "Great if you need a new lamp shade",
      "text": "Box was not in good condition when delivered but the lamp shade was. Easy to replace old lamp shade with new one and brightens up the room. Thanks",
      "rating": 5.0,
      "verified": true,
      "author": "Matthew Sheldon",
      "helpful_votes": 0,
      "publication_date": 20180625
    },
    {
      "title": "lamp shade",
      "text": "it has the wires for the brace for the shade to sit on",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20191211
    },
    {
      "title": "This is a nice lampshade. It's exactly as described on the website ...",
      "text": "This is a nice lampshade. It's exactly as described on the website and the service was great. I'll order from this store again.",
      "rating": 5.0,
      "verified": true,
      "author": "Caroline Johnsen",
      "helpful_votes": 0,
      "publication_date": 20160812
    },
    {
      "title": "both are great.",
      "text": "This was a very high quality shade, much nicer than anything I had seen at Bed, Bath & Beyond or Target and less expensive. I have ordered from Frenchel before, this is my second shade, both are great.",
      "rating": 5.0,
      "verified": true,
      "author": "Jason Rauschelbach",
      "helpful_votes": 0,
      "publication_date": 20170420
    },
    {
      "title": "Three Stars",
      "text": "I expected something better for the price, but it's okay.",
      "rating": 3.0,
      "verified": true,
      "author": "Joan B. Smith",
      "helpful_votes": 0,
      "publication_date": 20180717
    },
    {
      "title": "A perfect basic shade - and so much easier ordering online ...",
      "text": "A perfect basic shade - and so much easier ordering online than trying to find the right lamp shade shop - who has the exact size you need.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20180326
    },
    {
      "title": "Great shade",
      "text": "The perfect size I was looking for . Packaged very good .",
      "rating": 5.0,
      "verified": true,
      "author": "christina",
      "helpful_votes": 0,
      "publication_date": 20190514
    },
    {
      "title": "Love it! Perfect",
      "text": "Love it! Perfect, as described. Allows a lot of light through it while still looking soft and cream colored. Quick delivery, too.",
      "rating": 5.0,
      "verified": true,
      "author": "Laurie Divine",
      "helpful_votes": 0,
      "publication_date": 20170223
    },
    {
      "title": "Very pleased!",
      "text": "These are beautiful shades- plus quick delivery, great packaging, well made, perfect fit.",
      "rating": 5.0,
      "verified": true,
      "author": "joanie p.",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Great Product!!",
      "text": "This lamp shade is perfect. I installed it on an old, ET (yes, the Extraterrestrial) lamp after cleaning and repairing. Tons of compliments.",
      "rating": 5.0,
      "verified": true,
      "author": "Carlton Belcher",
      "helpful_votes": 0,
      "publication_date": 20180406
    },
    {
      "title": "Excellent",
      "text": "excellent delivery with no damage. delivery was faster then stated. Shades fit well and look very good.",
      "rating": 5.0,
      "verified": true,
      "author": "ben franklin",
      "helpful_votes": 0,
      "publication_date": 20170728
    },
    {
      "title": "Excellent service and product",
      "text": "The shades are perfect for our family room lamps. They arrived quickly and in excellent condition. They brighten up our family room because you had the off white color that we needed as opposed to the beige ones we removed.",
      "rating": 5.0,
      "verified": true,
      "author": "Russ Roper",
      "helpful_votes": 0,
      "publication_date": 20161221
    },
    {
      "title": "Top quality",
      "text": "Top quality and was here faster then anything I have ever bought.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20170324
    },
    {
      "title": "Just what I was looking for",
      "text": "I needed a replacement shade for my lamp and this is perfect.",
      "rating": 5.0,
      "verified": true,
      "author": "D Huntington",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Perfect",
      "text": "It fit perfect and shipped quickly. It is very nice.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronda Gray",
      "helpful_votes": 0,
      "publication_date": 20200410
    },
    {
      "title": "Five Stars",
      "text": "The lamp shade fit just like it was supposed to. Looks great",
      "rating": 5.0,
      "verified": true,
      "author": "Belinda",
      "helpful_votes": 0,
      "publication_date": 20180317
    },
    {
      "title": "Good quality.  Accurate definition of product online.",
      "text": "Color and size are perfect. Thanks for including the new harps to fit the lamp shades.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200507
    },
    {
      "title": "Perfect Lampshades",
      "text": "The shades are exactly what I wanted and fit my lamps perfectly. The color is a brighter white than I expected, but they look great. Additionally, they arrived ahead of schedule!",
      "rating": 5.0,
      "verified": true,
      "author": "Mary B.",
      "helpful_votes": 0,
      "publication_date": 20170215
    },
    {
      "title": "Very pretty shade. I have this on a floor lamp ...",
      "text": "Very pretty shade. I have this on a floor lamp next to my piano. The shade softens the light just enough.",
      "rating": 5.0,
      "verified": true,
      "author": "Judith L. Glick-smith",
      "helpful_votes": 0,
      "publication_date": 20180108
    },
    {
      "title": "A++",
      "text": "Exactly what I wanted. Looks great. I'd buy from them again.",
      "rating": 5.0,
      "verified": true,
      "author": "B+Top Contributor: Pets",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Perfect for my lamp!",
      "text": "This arrived in perfect condition and it was easy to put together.",
      "rating": 5.0,
      "verified": true,
      "author": "Adelle",
      "helpful_votes": 0,
      "publication_date": 20190416
    },
    {
      "title": "I Agree With Jersey Reader",
      "text": "I've been replacing my lamps and shades, one at a time, for over a month now. This shade came in a large box full of plastic bubble packing material and guess what? It wasn't damaged like many of the other shades I've received recently. It also looks exactly like its picture and fits in with my decor perfectly. It's the nicest shade in the house and I look forward to purchasing other lamps and shades from this supplier.",
      "rating": 5.0,
      "verified": true,
      "author": "Shopper Dave",
      "helpful_votes": 5,
      "publication_date": 20120110
    },
    {
      "title": "Pretty",
      "text": "It's a well made shade, and it's pretty. And, it's White, as advertised. If you need an attractive White shade, you can't go wrong.",
      "rating": 5.0,
      "verified": true,
      "author": "Denise Ingraldi",
      "helpful_votes": 0,
      "publication_date": 20181229
    },
    {
      "title": "Five Stars",
      "text": "It was just the right size for my table lamp.",
      "rating": 5.0,
      "verified": true,
      "author": "nessm",
      "helpful_votes": 0,
      "publication_date": 20180215
    },
    {
      "title": "Very nice.",
      "text": "Very nice, excellent quality product. It looks better than the original shade!",
      "rating": 5.0,
      "verified": true,
      "author": "Sandra 0356",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Great Lampshades",
      "text": "These are great for the price. Came well packed. I give them a five out of five rating. they make my bedroom lights look great.",
      "rating": 5.0,
      "verified": true,
      "author": "Fred Hartkopf",
      "helpful_votes": 2,
      "publication_date": 20130316
    },
    {
      "title": "Arrived quickly & in perfect condition.",
      "text": "These shades arrived in perfect condition and are very nice replacements for the ones I had.",
      "rating": 5.0,
      "verified": true,
      "author": "Margaret",
      "helpful_votes": 0,
      "publication_date": 20170423
    },
    {
      "title": "Perfect. These were to replace some that I had ...",
      "text": "Perfect. These were to replace some that I had that were falling apart from age. They came with new harps and twist on caps for the top. Good color, not too bright a white but not quite ivory. Great value as well!",
      "rating": 5.0,
      "verified": true,
      "author": "Deborah Mallon",
      "helpful_votes": 0,
      "publication_date": 20180413
    },
    {
      "title": "Very happy with purchase",
      "text": "The lampshade is exactly the size and shape and color I was looking for. Does not look cheap or flimsy. Arrived well packaged. Reasonably priced. Am glad I found it!!",
      "rating": 5.0,
      "verified": true,
      "author": "Docmamasam",
      "helpful_votes": 0,
      "publication_date": 20180310
    },
    {
      "title": "Good value",
      "text": "Product was ordered to match an older lamp shade. It arrived promptly, appeared as advertised and matched perfectly.",
      "rating": 5.0,
      "verified": true,
      "author": "Marguerite D. Witten",
      "helpful_votes": 0,
      "publication_date": 20181008
    },
    {
      "title": "Lovely shade.",
      "text": "Exactly as pictured. It is replacing an existing duplicate shade.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160926
    },
    {
      "title": "They all look great and they were reasonable in price",
      "text": "I had to replace several shade for some lamps I had inherited. They all look great and they were reasonable in price.",
      "rating": 5.0,
      "verified": true,
      "author": "Mom in the Mountains",
      "helpful_votes": 0,
      "publication_date": 20161206
    }
  ],
  "product_meta": {
    "title": "Vintage Empire Lamp Shade with Harp Pleated Cone White Fabric 6.5x15x11 (Spider) - Brentwood",
    "description": "From the Brentwood lamp shade collection. Antique white shade with pleats. Brass finish spider. From the Brentwood lamp shade collection.- 6 1/2\" across the top x 15\" across the bottom x 11\" on the slant x 10 1/2\" high overall.- Brass finish spider fitting.- Antique white mushroom pleat fabric.- A Brentwood brand lamp shade.- The correct size harp is included with this shade.",
    "rating": 4.8,
    "feature_bullets": [
      "6 1/2\" across the top x 15\" across the bottom x 11\" on the slant x 10 1/2\" high overall.",
      "Brass finish spider fitting.",
      "Antique white mushroom pleat fabric.",
      "A Brentwood brand lamp shade.",
      "The correct size harp is included with this shade."
    ],
    "specifications": {
      "Manufacturer": "Lamps Plus",
      "Part Number": "ALL-13040203",
      "Item Weight": "2 pounds",
      "Product Dimensions": "6.5 x 11 x 15 inches",
      "Item model number": "2M863",
      "Is Discontinued By Manufacturer": "No",
      "Color": "Single - Antique White",
      "Style": "Traditional",
      "Finish": "Antique",
      "Shape": "Barrel",
      "Wattage": "100.00",
      "Item Package Quantity": "1",
      "Special Features": "Pleats",
      "Batteries Included?": "No",
      "Batteries Required?": "No",
      "ASIN": "B00HNQ0MUC",
      "Customer Reviews": "4.8 out of 5 stars323 ratings4.8 out of 5 stars",
      "Best Sellers Rank": "#68,362 in Tools & Home Improvement",
      "Date First Available": "August 31, 2010"
    },
    "categories": [
      "Lighting & Ceiling Fans",
      "Tools & Home Improvement",
      "Lamps & Shades",
      "Lamp Shades"
    ],
    "price": ""
  }
}