{
  "website_summaries": [
    {
      "verdict": "Two of BOSU's best products in one package.",
      "pros": [
        "This combo kit pairs the BOSU ballast ball and balance trainer and includes 2 workout DVDs"
      ],
      "cons": [
        "The included foot pump doesn't inflate very well"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "This is such a great product for home workouts",
      "text": "This is such a great product for home workouts. Both are sturdy and i have jumped on the BOSU multiple times. The products come with instructions on how to inflate and how you can workout with them. I would recommend this to anyone who wants an at home quick workout.",
      "rating": 5.0,
      "verified": true,
      "author": "NadinaEngel",
      "helpful_votes": 2,
      "publication_date": 20170926
    },
    {
      "title": "Good",
      "text": "Both balls are great. The pump it comes with doesn't work very well. The hose is plastic and had several holes in it so it was difficult to inflate the balls.",
      "rating": 4.0,
      "verified": true,
      "author": "AS",
      "helpful_votes": 2,
      "publication_date": 20150411
    },
    {
      "title": "Love it!",
      "text": "Love it!!! N i save money on it by getting an Amazon credit card I live my bosu and ballast ball",
      "rating": 5.0,
      "verified": true,
      "author": "Yesenia kitty cat ",
      "helpful_votes": 0,
      "publication_date": 20171113
    },
    {
      "title": "Would return but I like the Ballastic Ball",
      "text": "Did not receive 4 in 1 DVD nor plug for BOSU Balance Trainer. Would return but I like the Ballastic Ball. Will have to order replacement plugs from BOSU so can use Balance Trainer. Arrived quickly but not worth it if parts are missing.",
      "rating": 3.0,
      "verified": true,
      "author": "Crystal Bailey",
      "helpful_votes": 4,
      "publication_date": 20150201
    },
    {
      "title": "Bosu with Balast Ball is like Bogie and Bacall",
      "text": "What a combo .... Bosu with Balast Ball is like Bogie and Bacall ... they just naturally go together. I use both of them every day for not only balance work but for strength training .... I would suggest this to anyone who wants to make a minimal investment for maximum health benefits at any age.",
      "rating": 5.0,
      "verified": true,
      "author": "JKS",
      "helpful_votes": 7,
      "publication_date": 20141205
    },
    {
      "title": "Awesome deal and great quality!",
      "text": "Awesome deal and great quality overall except for the pump, which needs two persons to pump because the hose kept detaching. Needed an extra hand to hold it in place",
      "rating": 5.0,
      "verified": true,
      "author": "P Dipeso",
      "helpful_votes": 0,
      "publication_date": 20150608
    },
    {
      "title": "Does what is supposed to",
      "text": "The BOSU balance trainer and ballast ball do what they are supposed to. The reason for the 4 stars is that the ball came with an oily residue both on the inner and on the outer surface. The Multi-Dimensional Load was partly stuck to the inner surface. I had to wash the ball several times on the outside to get the residue out. I believe this is a problem with vinyl and heat, but if that is the case, then storage and shipping of the product should be taken into consideration by the manufacturer so that it doesn't become the problem of the purchaser of the product upon receipt of it.",
      "rating": 4.0,
      "verified": true,
      "author": "Outdoor aficionado",
      "helpful_votes": 14,
      "publication_date": 20141202
    },
    {
      "title": "Very high quality product. It seems we are slipping ...",
      "text": "Very high quality product. It seems we are slipping off the Busu ball but I think thats just because its new.",
      "rating": 5.0,
      "verified": true,
      "author": "Christine L.",
      "helpful_votes": 0,
      "publication_date": 20150416
    },
    {
      "title": "Don't buy the Combo!",
      "text": "The Bosu Balance Trainer is great but the Ballast Ball is horrible. It took 2 people to get the plug out and while one person pushed on the plug the other person had to grap it (used a pair of channel locks) to pull the plug out to fill it with air. Once you fill it and try to get the plug back in half the air has come out. Worst system I ever saw. Can't use the ball because I can't get enough air to stay in.",
      "rating": 3.0,
      "verified": true,
      "author": "Speedracer",
      "helpful_votes": 7,
      "publication_date": 20150227
    },
    {
      "title": "good product",
      "text": "Love the bosu, jury is still out on the ballast ball. Great addition to the home gym.",
      "rating": 5.0,
      "verified": true,
      "author": "Bryan123",
      "helpful_votes": 0,
      "publication_date": 20150509
    },
    {
      "title": "Great price, delivered very quickly",
      "text": "Great price, delivered very quickly. Easy to use. Bosu ball seems to not inflate to full capacity and not as firm as ones you find in gyms.",
      "rating": 4.0,
      "verified": true,
      "author": "AZ Realtor",
      "helpful_votes": 0,
      "publication_date": 20150521
    },
    {
      "title": "Five Stars",
      "text": "Works great! Now, it's up to me to use it.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160707
    },
    {
      "title": "Super versatile piece",
      "text": "One of my favorite things in my home gym. You can do a ton of stuff with the bosu that helps take moves to another level.",
      "rating": 5.0,
      "verified": true,
      "author": "Sara Davis",
      "helpful_votes": 0,
      "publication_date": 20150507
    },
    {
      "title": "Exactly what I need",
      "text": "Products are great, My expectation is met. Thank you for your cooperations.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160724
    },
    {
      "title": "Two Stars",
      "text": "The balance trainer had a pin hole in it will not hold air.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20161229
    },
    {
      "title": "Great products. Both are essential in developing core strength ...",
      "text": "Great products. Both are essential in developing core strength and improved balance.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20150723
    },
    {
      "title": "Luv this product!!!! Would recommend to all!!!!",
      "text": "I already had one, so I gave this one as a gift and she loves it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jill S. Kamareddine",
      "helpful_votes": 0,
      "publication_date": 20150609
    },
    {
      "title": "Nice training set",
      "text": "perfect home training set! Injecting air into a ball was a little tricky. However I could do it without any help.",
      "rating": 4.0,
      "verified": true,
      "author": "son",
      "helpful_votes": 0,
      "publication_date": 20150223
    },
    {
      "title": "disappointed and irritated",
      "text": "This was either a return and sold to me as \"new\", or the ball measurement piece to inflate it was missing. It bothers me that this happened.",
      "rating": 1.0,
      "verified": true,
      "author": "Shannon",
      "helpful_votes": 0,
      "publication_date": 20150525
    },
    {
      "title": "Five Stars",
      "text": "Love this set. Bought it for my daughter but we both us it now. Great purchase.",
      "rating": 5.0,
      "verified": true,
      "author": "Ajsmason",
      "helpful_votes": 2,
      "publication_date": 20150120
    },
    {
      "title": "Four Stars",
      "text": "Great product, air pump works but is very poor quality,",
      "rating": 4.0,
      "verified": true,
      "author": "Machinist",
      "helpful_votes": 0,
      "publication_date": 20141226
    },
    {
      "title": "the delivery went beautifully and the gift was well received",
      "text": "This was a gift request for Christmas, the delivery went beautifully and the gift was well received.",
      "rating": 5.0,
      "verified": true,
      "author": "Blanche Gunther",
      "helpful_votes": 0,
      "publication_date": 20141226
    }
  ],
  "product_meta": {
    "title": "Bosu Balance Trainer and Ballast Ball Combo Kit",
    "description": "From the elite athlete to weekend warriors trying to stay in shape, the BOSU Balance Trainer helps to strengthen and coordinate your body (including the muscles that you don't see). The trainer targets the core muscles of your body--those muscles around your abdominal and back area--helping you to not only gain strength, trim and tone, but to help coordinate your entire body. The BOSU Balance Trainer is a versatile piece of equipment that is ideal for static and dynamic balance training. The BOSU Balance Trainer can be used to integrate balance challenges into cardiovascular, endurance, core and flexibility training. BOSU is an acronym for \"both sides up.\" The BOSU Balance Trainer can be used with the platform side either up or down to challenge balance with different body positions. Includes BOSU Balance Trainer 4-in1 Workout DVD, owner's manual and foot pump. Proudly Made in the USA BOSU Ballast Ball PRO stays put, so that balls don't wander around the floor. Constructed of high-quality, burst-resistant material, it has a six-sided design for proper alignment and positioning. With the BOSU Ballast Ball, individuals can perform exercise progressions and dynamic drills that aren't possible on a regular stability ball. The product is translucent light blue with 2.5 lbs. of white multi-dimensional material and includes a foot pump and workout DVD. Product can be inflated between 55cm and 65 cm, 6.5 lbs. Maximum user weight is 300 lbs. Made in the USA.",
    "rating": 3.9,
    "feature_bullets": [
      "Combines Cardio, toning and flexibility",
      "Helps Target Core Muscles",
      "Includes DVD with 4 Balance Trainer Workouts as well as a DVD with Ballast Ball Workouts",
      "Proudly Made in the USA",
      "Includes Foot Pump"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "25.3 x 25.3 x 5.8 inches; 22 Pounds",
      "Item model number": "72-10850-BB",
      "Date First Available": "December 3, 2013",
      "Manufacturer": "Ball, Bounce and Sport, Inc.",
      "ASIN": "B00H5IGOKA",
      "Domestic Shipping": "Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S.",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Scales & Balances",
      "Sports & Outdoors",
      "Mechanical Balances",
      "Test, Measure & Inspect",
      "Industrial & Scientific",
      "Laboratory Balances"
    ],
    "price": 158.42
  }
}