{
  "website_summaries": [
    {
      "verdict": "This dual-band WiFi extender significantly boosts your WiFi signal and it doesn't require any technical know-how to set up.",
      "pros": [
        "Extends dual-band WiFi up to 750 Mbps",
        "Plugs into a wall outlet",
        "External antennas help to boost performance",
        "Easy for beginners to set up",
        "Gigabit Ethernet port",
        "Compatible with all brands of routers"
      ],
      "cons": [
        "Users have complained that the extender sometimes loses its connection to the router"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Not Impressed",
      "text": "Got it home and had it set up within 30 minutes. Worked OK but not great. Network speed through an extender is reduced but had no idea it would be reduced that much. Extender worked longer than the store return period but not as long as the manufacturer warranty. Only gave it a one-star rating because I could not give it zero stars. Instead of an extender - If you need extended network access, I would highly recommend looking at YouTube videos to set up an old/used wireless router as a wireless access point (WAP). You get full router speed at an extended distance. Can be set up within 30 minutes. Much easier than I expected.",
      "rating": 1.0,
      "verified": true,
      "author": "tsjwein",
      "helpful_votes": 0,
      "publication_date": 20191019
    },
    {
      "title": "Extreme difficulties setting up mesh network",
      "text": "I bought this for the mesh network capability. The provided instructions don’t tell you how to enable mesh. I called tech support and the guy was very good, but we still struggled to get it to work. It required a firmware update just to get the mesh option, and there were other issues. The end result is that my laptop’s internet will break when it transfers from one access point to another. My phone won’t do that, but for a while it seemed like it would stay connected to the weaker access point. Lately, it seems to be working well, though.",
      "rating": 3.0,
      "verified": true,
      "author": "P. Mullaney",
      "helpful_votes": 0,
      "publication_date": 20200808
    },
    {
      "title": "Never buying a Netgear product again.",
      "text": "I had difficulty getting the Wi-Fi extender to work. Called tech-support and was transferred no less than six times. Possibly eight times. The last technician ran a test of my computer and told me I had numerous viruses from China that were interfering with the installation. They wanted to sell me a $400 a year and anti virus Software. When I balked At the price they said I could have it for half price since I was in AARP Member. I told them no thanks. I hung up and installed software on my laptop but found no viruses at all. The technical support is awful And I do not trust them.",
      "rating": 1.0,
      "verified": true,
      "author": "Customer",
      "helpful_votes": 0,
      "publication_date": 20200210
    },
    {
      "title": "Got me wifi in the backyard",
      "text": "Formsome reason, this works better for laptops than for mobile phones in my experience. Took video meetings, and didn't work from my backyard now that we are stay-at-home workers. So nice to be outside whenever I want and still get the work done with a stable connection. We are the second floor in a 2-flat condo building, so it has to push a signal both out and down. Set up is not as easy as it's made out to be, but once you figure it out, it works and works well..",
      "rating": 4.0,
      "verified": true,
      "author": "explainer guy",
      "helpful_votes": 0,
      "publication_date": 20200725
    },
    {
      "title": "Seamless Wi-Fi Extender",
      "text": "I purchased this extender not certain if I could use it to extend my home Wi-Fi signal while using the same SSID. I also was not sure if it would extend both the 2.4 and 5 GHz signals or just one. Upon this arriving yesterday, I found my answers: you can choose to extend either the 2.4 or 5 or both. You can choose to use the same SSID or a different one. It is all your choice (Netgear says in the operational manual they do not recommend using the same SSID, but I did any way). I am liking its improved coverage so far.",
      "rating": 5.0,
      "verified": true,
      "author": "Faris",
      "helpful_votes": 0,
      "publication_date": 20191205
    },
    {
      "title": "I thought I bought a new unit, but refurbished?",
      "text": "This extender is working, just as I hoped. The set up was relatively easy, but information is kind of scattered on the internet. But I passed. I began with a link-rate of 11mbps to now on the extension a rate of 84mbps. Intermittent problem solved. But I did NOT buy a refurbished unit. But the unit I received was banged up on its face, like it was used and dropped. When I buy new, I expect new UPDATE: contacted the business and they extended a refund for the unit because of this damage. They did not have to, they did and I’m very thankful. Thank you for your consideration and service. Overall a good experience.",
      "rating": 3.0,
      "verified": true,
      "author": "Marty",
      "helpful_votes": 0,
      "publication_date": 20190602
    },
    {
      "title": "Netgear won't honor the warranty unless we pay them $50 for support service",
      "text": "After 6 months of use without issues, the 5G will suddenly disappear on a daily basis. The 2G is fine and the 5G from our router is still available - just not the 5G from the extender. We have to restart it to get the 5G back. What makes me upset is the fact that this is still under warranty, yet in order to get it fixed, we have to talk to tech support, but they won't talk to us unless we pay them $50 for support service. What kind of useless warranty is that? I've purchased many Netgear products over the years but they have just lost me as a customer.",
      "rating": 1.0,
      "verified": true,
      "author": "Pink Packer Backer",
      "helpful_votes": 0,
      "publication_date": 20190915
    },
    {
      "title": "Difficult to setup",
      "text": "I didn't like that it arrived in the actual packaging, no outer box. It was very frustrating to set up, actually took multiple tries. Was about to give up and throw it back in the box and return when magically it started to work. I'm sure this could be a lot less frustrating, but who knows. I guess I can't complain. Signal did improve from 'weak' to 'strong' according to my daughter's laptop, so I guess it's a win. But the setup will make you wanna cuss. IJS",
      "rating": 3.0,
      "verified": true,
      "author": "Angie",
      "helpful_votes": 0,
      "publication_date": 20200827
    },
    {
      "title": "Just what we needed!",
      "text": "Exactly what we were looking for! Our router is located downstairs of our 3500 sqft home and our wifi would not catch upstairs and in certain areas of our home. After being frustrated and having to use cellular data we finally decided to purchase this wifi extender and it has worked wonders! I can know stream videos upstairs and outside. If you're in need of something similar I would highly recommend this product! Wish we purchased sooner!",
      "rating": 5.0,
      "verified": true,
      "author": "uhhdorkable",
      "helpful_votes": 4,
      "publication_date": 20170428
    },
    {
      "title": "lasted 5 months and then kaput!",
      "text": "this extender did not deliver as promised. it struggled to hold speed of signal for meetings with work, leaving me embarrassed and having to relog in multiple times or taking time to change rooms in the middle of a meeting. also the whole thing just stopped working and sending signal to my computer after 5 months. i went to netgear's websites and looked for assistance in re-establishing it with my computer, but found nothing that worked including factory reset in the end. i am so disappointed and frustrated and am now spending even more money to get a new extender here asap.",
      "rating": 1.0,
      "verified": true,
      "author": "michelle emerick",
      "helpful_votes": 0,
      "publication_date": 20200930
    },
    {
      "title": "Excellent coverage, speed and speedy setup. NetGear built this one right the first time!!",
      "text": "I’ve always been a Netgear fan. Although I have brand loyalty I’m not above buying a product from another vendor if it or they are better at providing what I need to get a job done correctly. This was used to extend a wi-if network in a multi floor office building where clients needed access to WiFi. I’ve tested the devil out of the extender and it setup quickly, installed in moments and has been running perfectly since installing it. No maintenance needed. All the updates applied when I configured it. The advances WiFi provisioning wizard was nice. Overall a very good product. Nothing I would change.",
      "rating": 5.0,
      "verified": true,
      "author": "Feel The Need, To Read!",
      "helpful_votes": 0,
      "publication_date": 20181115
    },
    {
      "title": "Great Signal Booster!",
      "text": "Compliments my NetGear Nighthawk X6S which is set 8 ft atop a book shelf. Easy to ‘sync’ WPS signal (5 mins tops). Walked down the hall to electrical outlet 10” off the floor; waited 5-10 mins for extender to power up & sync with X6S—be patient. If extender lite remains ‘amber’, find another spot, you may be too far away or obstructed. Kids stay on one freq, TV streaming on another and adults on other...Have not needed tech support as product is straight forward to use.",
      "rating": 5.0,
      "verified": true,
      "author": "SandSurfer",
      "helpful_votes": 0,
      "publication_date": 20191224
    },
    {
      "title": "Great product - fast speeds and consistent connection",
      "text": "Great range and speeds from the the first floor covering the entire second floor. Easy and quick setup. No lost connections. Excellent product and price. I'm using the extender to connect to an Xfinity cable modem/router and extend the wi-fi range upstairs in a big house where the wi-fi was always cutting out upstairs. I use this on a MacBook Pro, Apple TV, Amazon Echo, iPhone and iPad and speeds are consistently 80% of the Xfinity speed so I'm very pleased with the connection and extender.",
      "rating": 5.0,
      "verified": true,
      "author": "Keith A Anderson",
      "helpful_votes": 0,
      "publication_date": 20200308
    },
    {
      "title": "Didn't work for me",
      "text": "I thought that I'd give this a try to use solely as an extender. My goal was to mprove my wifi signal out in the garage. Once the 6100 was connected to my network I moved it to a midway point between my router and the garage. To say that the signal and connectivity was usntsable and erratic would be an understatement. FYI; I'm on AT&T Uverse (NVG599 home gateway/router). You may have better results with a different ISP/router, but if you're ISP is AT&T you may want to look elsewhere.",
      "rating": 1.0,
      "verified": true,
      "author": "Andycapt",
      "helpful_votes": 0,
      "publication_date": 20190618
    },
    {
      "title": "I obtained worse performance than connecting directly to my NetGear NightHawk AC1900 ...",
      "text": "After setting everything up, I obtained worse performance than connecting directly to my NetGear NightHawk AC1900 Router from the far corners of my house. My cable service provides 120 Mbps, but I only get 45 Mbps from the far corners of my house. I hoped this device would boost that outcome, but, instead, my connections dropped to 20 Mbps. I then spent 90 minutes with NetGear tech support, they confirmed I set up everything correctly, and none of their suggestions improved the outcome. I'm baffled by those who believe this device actually extends a router's coverage.",
      "rating": 1.0,
      "verified": true,
      "author": "Question All Dogma",
      "helpful_votes": 7,
      "publication_date": 20150806
    },
    {
      "title": "Half Works",
      "text": "It mostly half works. I have a 50Mbps internet connection, and when I connect my laptop wirelessly to the Range Extender, I get around 5Mbps, but when I connect directly to it with an Ethernet cable, I get 25Mbps. The 25Mbps is enough for the Arlo Pro I bought it for, so it's hard to complain too much. I expected better, because the Extender is just a room and a half away from the router. I'm sure the Access Point mode would be a better idea, but I don't want to go around drilling holes.",
      "rating": 2.0,
      "verified": true,
      "author": "Louis B.",
      "helpful_votes": 0,
      "publication_date": 20180416
    },
    {
      "title": "Didn't connect to my Xfinity router",
      "text": "I have a pretty standard Xfinity router with WPS. This wifi extender was supposed to easily connect to it, but did not. I have been back and forth and back and forth some more with NETGEAR support, to no avail. This has been a real time suck for me. Now, of course, the Amazon return date has passed. I'm sorry I bought this product. If their support eventually helps me to get it going, I will only be SORT OF sorry I bought this product. It sounded like it would be a snap, but it has been a pain.",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Simple to Setup and Adequate For Most Uses",
      "text": "I’ve have been using a NETGEAR WiFi Mesh Range Extender EX6100 for two years and find it adequate for my purpose. The advertised range is a bit of a stretch and may work in an open lab but it’s nowhere near that in my stick built house, at best I am getting a usable signal no more than 50 feet from the extender through a single 6 inch exterior wall, less through multiple interior walls. However, as I said it serves my purpose and I recently bought a second one. One issue I have had repeatedly is the need to power cycle the extender ever couple of months. It seems to crash and stop responding until power cycled.",
      "rating": 4.0,
      "verified": true,
      "author": "Tim H",
      "helpful_votes": 0,
      "publication_date": 20200831
    },
    {
      "title": "Works great, need the initial wifi speed though.",
      "text": "This range extender worked great for our purposes. We had a smart TV upstairs in our bedroom that had a poor signal. Like other reviewers state this will cut your actual internet speed quite considerably when going through the extender, however if your internet speed is fast enough, you will not notice a difference. If I had 25 Mbps speed the results probably would not have been as good. But our provider gave us a great deal on 100 Mbps internet package so even if it was cut in half, 50 Mbps is more than enough to power a smart TV.",
      "rating": 5.0,
      "verified": true,
      "author": "NB23",
      "helpful_votes": 0,
      "publication_date": 20170913
    },
    {
      "title": "Good quality and powerful extender.",
      "text": "I am very happy with this booster. It allows me to be anywhere on my property, up to 50+ feet away from the house, and still have connection with my WiFi. This has really out performed the modem/router provided by my ISP. If placed outside the house, it would probably reach up to 200 feet. The internet streaming to my smart TV, positioned about 20 feet from the extender, has been flawless after many frustrating experiences of inadequate signal before obtaining this device. I removed one star because the pairing function was needlessly complicated due to unclear instructions, which may be me. But I called customer service and received some hand holding and got it up and running.",
      "rating": 4.0,
      "verified": true,
      "author": "Russ Chris",
      "helpful_votes": 0,
      "publication_date": 20160602
    },
    {
      "title": "Works Like a Charm",
      "text": "The NETGEAR AC750 WiFi Range Extender (EX6100) works very well – as advertised. I use it to reach beyond my home in order to enable WiFi access from my detached garage. It extends both the the 2.4 GHz and 5 GHz bands transmitted from my main WiFi router. Very easy set up using an intuitive web interface, with its Smart Setup option. Basically, it receives and retransmits WiFi signals to reach nooks and crannies, and far away locations that your main WiFi router may not reach. Highly recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Brad",
      "helpful_votes": 0,
      "publication_date": 20200126
    },
    {
      "title": "Works Well",
      "text": "Our Verizon fios router is in our basement closet and we set this up on the 2nd floor of the house. It extends the signal by creating both a 2.4ghz and 5ghz wifi networks that is supported by our router and is able to extend it up through the 3rd floor and onto the roof. I had some trouble setting it up with the router but going through the multiple methods and learning about my router by googling how my router works got it working perfectly. There's a definite need to have some understanding how modems/routers work but once you do it's pretty much plug and play. It took me ~15 minutes to get it set up correctly.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201007
    },
    {
      "title": "It's fine",
      "text": "It's built well. I initially could not get it to register my WPS, but was able to connect it with a laptop and registering it on the netgear website. The internet speeds are good depending on how well your internet is in your house. It will cut your internet speeds by anywhere from 20-50% depending on where you place it, so location is key. While I feel there are more than likely better alternatives to improve your wifi range, this is a fairly cheap solution.",
      "rating": 3.0,
      "verified": true,
      "author": "William",
      "helpful_votes": 0,
      "publication_date": 20190121
    },
    {
      "title": "I would LOVE to know how that happened and whether the seller ...",
      "text": "This is a total piece of rubbish. I bought this at the suggestion of my TWC installer. Amazingly enough, the nearly plug-n-go system when I needed tech support, was shown as owned by someone else entirely, yet I had bought it brand new! Thanks to that, I was not able to get tech support nor a proper warranty for the hardware itself. I would LOVE to know how that happened and whether the seller plans to make good. So far, no response.",
      "rating": 1.0,
      "verified": true,
      "author": "tnypco",
      "helpful_votes": 4,
      "publication_date": 20160316
    },
    {
      "title": "Poor product for Wi-Fi range extension.",
      "text": "Does not work at all and horrible support from netgear. I purchased this as a replacement for a separate wi-fi extender I purchased from netgear. This like the last one dropped the signal and fluctuated in signal strength. When I contacted netgear, even thoguh I was told I should have had 90 days of support, I was told there is none and really nothing they can do.",
      "rating": 1.0,
      "verified": true,
      "author": "Andre B",
      "helpful_votes": 8,
      "publication_date": 20150722
    },
    {
      "title": "Works fine for extending wifi signals, but I haven't tested it for distance yet.",
      "text": "I use this in a living room to extend wifi reach from my router in a back room office. You can set it up with the same or different id's to really confuse your neighbors with a name like \"FBI\". It works for short distances and I haven't tested for reach. If I test it for distance, I will possibly revise this rating. The manual was very clear how to set up the software, and that is worth a point alone. It worked the first time I followed the detailed steps.",
      "rating": 5.0,
      "verified": true,
      "author": "Vance Jochim",
      "helpful_votes": 0,
      "publication_date": 20180731
    },
    {
      "title": "Waste of Time and Money",
      "text": "Don't waste your time and money if your looking for signal strength increase with this extender. Don't waste your time and money with this product. I installed and never worked or would drop WiFi every time i connected to it. I sent item back for full refund and would not recommend to buy,",
      "rating": 1.0,
      "verified": true,
      "author": "Troy Martin",
      "helpful_votes": 0,
      "publication_date": 20200522
    },
    {
      "title": "Amazing Tool",
      "text": "My family and I make visits to my Dads house and his Internet does not work well in all areas of the house. Before buying the Google Mesh system, I decided to try this first to save money. This little baby is powerful. You do need to follow the steps to make this work. When you purchase this, review the directions multiple times so you know what sequence needs to be done. Once you have it done, the extender works like a gem and the family is happy!",
      "rating": 5.0,
      "verified": true,
      "author": "Eric P. Wilson",
      "helpful_votes": 0,
      "publication_date": 20181024
    },
    {
      "title": "not what I was expecting",
      "text": "The bummer is that it essentially creates an entirely new router to connect to, it does not simply extend the original signal. So you have to set up two different wifi connections with your mobile device. So, if you walk from one end of the house to the other (with your mobile device), you might still be connected to the router at the end you started in as long as you still have a signal (no matter how faint). If you want to then switch to the better connection, you have to manually switch to the better connection. I could see this working best for wireless devices that stay put (smart tv, desktop pc, etc.)",
      "rating": 2.0,
      "verified": true,
      "author": "Trago Wallace",
      "helpful_votes": 0,
      "publication_date": 20160506
    },
    {
      "title": "Not so good",
      "text": "This product has to be within 25 feet of your router . Nowhere does it say this on the description or anywhere. So if you try to use it in the room where you need it and it is more than 25 feet away it does not work. I also think I had a defective one because tech support could not get it to work either. You are better off getting a device that has multiple units you can spread throughout your house",
      "rating": 2.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "What’s the use of “extender” functionality??",
      "text": "So, the instructions are great and the product is fairly easy to set up (4/5 stars). But, I bought this Wi-Fi “Extender” for just that; use an existing signal and extend that signal around a 90-degree corner. However, buyer beware - extenders do not boost the signal from their own hardware. Ended up not having use since I could get ~50 to 55 mbps without it, but extending the signal dropped its speed to ~25 to 30 mbps. If I wanted to wire in another stand-alone Wi-Fi router, which is the alternate function of the hardware, I would have purchased a better stand-alone router.",
      "rating": 2.0,
      "verified": true,
      "author": "Jason",
      "helpful_votes": 0,
      "publication_date": 20190529
    },
    {
      "title": "Easy, good signal, not really seamless",
      "text": "Easy set up with the WPS button. Good signal strength. Not quite seamless. Streaming video, etc freezes when switching between router and extender. Must be restarted. No need to go to WiFi settings or anything, but I was hoping for truly seamless transition.",
      "rating": 4.0,
      "verified": true,
      "author": "churchlady",
      "helpful_votes": 0,
      "publication_date": 20200731
    },
    {
      "title": "Perfect for extending service to back rooms in apartment!",
      "text": "This a great wifi extender. I specifically bought it because my router does not cover well into the back of my apartment and my TIVO connection is always in and out making it impossible to watch anything sometimes. So I bought this extender to help my wifi reach and cover my back rooms. This did the job 100% and I'm very pleased with my purchase. The setup didn't take long, I just plugged it next to my router in the living room, turned it on and from my computer did the setup and then plugged in the extender in my back room and voila! I have connection!! no more interruptions! YAY!!",
      "rating": 5.0,
      "verified": true,
      "author": "Sprinklesღ♥^_^",
      "helpful_votes": 0,
      "publication_date": 20160610
    },
    {
      "title": "They are working well as access points",
      "text": "I had wifi problems with my router, which auxiliary Apple equipment only complicated. I disconnected the Airports (Extreme and ?Express), turned off my router's wifi, and simply created two ethernet-connected access points. (Access points are by definition hardline-connected.) Wifi is now excellent everywhere. My two access points are geographically separated by a couple of floors and my mobile has no trouble transitioning from one to the other.",
      "rating": 5.0,
      "verified": true,
      "author": "BookStruck",
      "helpful_votes": 0,
      "publication_date": 20180821
    },
    {
      "title": "Don't even bother with this old GARBAGE",
      "text": "What an expensive set up I've purchased. $300 router. $75 extender. and none of this netgear stuff works. This is old technology that is cumbersome and never works. drops out all the time. plus between the router and extender you have 4 options to always choose from, 2G, 5G, extender 2G, extender 5G. you have to choose your network every time you move around your house. what a bunch of overpriced and frustrating garbage this stuff is. Again this is an old antiquated way to connect your house with routers. For $400 there has to be a better way set up a network.",
      "rating": 1.0,
      "verified": true,
      "author": "wolff1",
      "helpful_votes": 0,
      "publication_date": 20200921
    },
    {
      "title": "Useless system",
      "text": "I normally get 250 mbps download in my living room from a NetGear modem/router combo. 20 feet away it drops to 4 mbps. I purchased this NetGear extender and it only could get me 8mbps. Purchased two eeros and I got 100 mbps! Save your money for a modern system like the eero.",
      "rating": 1.0,
      "verified": true,
      "author": "C + N",
      "helpful_votes": 0,
      "publication_date": 20200413
    },
    {
      "title": "Easy set up and works great!",
      "text": "My husband's man cave is in our basement and our router is upstairs on the opposite side of the house. I'm not terribly tech savvy, but I hooked it up and had it working in 10 minutes. I game upstairs and my husband streams TV shows downstairs and there is great reception and no lag at all.",
      "rating": 5.0,
      "verified": true,
      "author": "K. Allen",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "solid signal",
      "text": "this is a great gadget for your home its will extend the signal further away i bought it because my ring camera in the back yard was having trouble connecting to internet and with this it solved the problem",
      "rating": 5.0,
      "verified": true,
      "author": "Danielrt23",
      "helpful_votes": 0,
      "publication_date": 20191001
    },
    {
      "title": "Slower than molasses on a cold winter day",
      "text": "Yes, it will extend the wifi range slightly. But the speed is soooo slow, it's just not practical for surfing the web let alone doing any streaming. We've taken it out of service and it's just collecting dust now.",
      "rating": 1.0,
      "verified": true,
      "author": "Stumo",
      "helpful_votes": 0,
      "publication_date": 20190914
    },
    {
      "title": "Easy setup great signal",
      "text": "Omg I have had several and returned all of them and finally found another NETGEAR router this one bought it and I finally have working internet with protection in my home Again thank You NETGEAR for making the set up so easy",
      "rating": 5.0,
      "verified": true,
      "author": "MaryBeth",
      "helpful_votes": 0,
      "publication_date": 20200810
    },
    {
      "title": "Issues",
      "text": "I have this one, a 7500, and an 8000.....thinking this would cover every inch of my house BUT if you run them all together, it seems like they compete with each other and I have had all kinds of slowness issues. I have relocated them all multiple times and that does not work. I end up using just one unit and even then have issues. Not very happy 😞",
      "rating": 2.0,
      "verified": true,
      "author": "PSH",
      "helpful_votes": 0,
      "publication_date": 20200730
    },
    {
      "title": "Worst extender ever!",
      "text": "This is not a good extender. I kept being kicked off of the extender non-stop. I wish I had not missed the deadline to return back to Amazon to get my money back. I had to call Netgear customer support three times and stay on the phone for hours and nothing. The last thing was they stated the product was defective and were going to send a replacement to me but did not state until I received the email for the return, that I had to pay out of my pocket to send the defective one back. Bad customer service!!! I would not by from them again.",
      "rating": 1.0,
      "verified": true,
      "author": "AG",
      "helpful_votes": 0,
      "publication_date": 20200618
    },
    {
      "title": "Stopped working after 6 months - DO NOT BUY",
      "text": "I strongly recommend you avoid this product. Lasted about 6 months before the firmware got corrupted and it bricked itself. Now it will no longer boot up (stuck on the solid amber light, booting phase). Tried to get some guidance on how to fix the issue from Netgear Support but they ask for an extortion fee of $89.99 in order to talk to their support staff which is twice what I paid for this device. While looking online for help I ran across countless posts from people who ran into the same problem as me and with no remedy to fix the issue had to just toss their router and buy a new one.",
      "rating": 1.0,
      "verified": true,
      "author": "Colby Beacham",
      "helpful_votes": 0,
      "publication_date": 20191029
    },
    {
      "title": "don't waste your time very disappointed in this",
      "text": "Returned, would not connect to my Comcast gateway modem it is brand new one the latest. The online option is a joke, don't waste your time very disappointed in this. Since I had comcast replace my gateway box the newest of equipment, my buffering has been a minimal, I wanted this for a bedroom TV that is away from the box, but it didn't connect. A waste of 2 hours thinking it would work. I had others that connected instantly, not this one and I even bought another net gear same thing, maybe the upgraded box blocks it and you don't need it.",
      "rating": 1.0,
      "verified": true,
      "author": "BLUESKYS4ME",
      "helpful_votes": 3,
      "publication_date": 20150510
    },
    {
      "title": "Poor performance and Reliability",
      "text": "Works quite well extending wifi to remote end of house. Completely lost it's mind once and had to re-set to factory setting and redo manual setup. The automatic setup (WPS) never functioned properly, however I have other devices where this process functioned flawlessly. Do like the dual band feature, movie streaming seems to work better with the 5 GHz. Update: Every time there is a glitch in the system anywhere (due to a power outage, weather or my provider which is TWC and the crappiest I have ever seen) this piece of junk has to be manually reset. Find something better than this device.",
      "rating": 2.0,
      "verified": true,
      "author": "Frog",
      "helpful_votes": 0,
      "publication_date": 20150804
    },
    {
      "title": "WORKS LIKE A CHARM!!!",
      "text": "Did a lil bit of research....had a constant dead zone towards the back of my house......the place where the installer set up my modem was all the way in the front office of my home. Followed the instructions that came with the extender....and set the whole thing up in less than 5 minutes. Just what I needed!! Thanks!",
      "rating": 5.0,
      "verified": true,
      "author": "Kiba Ranger",
      "helpful_votes": 0,
      "publication_date": 20191220
    },
    {
      "title": "Worst technical support experience and a garbage product",
      "text": "Technical support person completely incompetent. I can provide Netgear case ID if Negear to investigate. About the product now, I bought it 2/7/2020 and today 3/25/2020 stopped working completely. I cannot even do a factory reset. Lights stay red forever and power light stays amber. Literally a piece of garbage. It deserves no stars.",
      "rating": 1.0,
      "verified": true,
      "author": "Theo",
      "helpful_votes": 0,
      "publication_date": 20200325
    },
    {
      "title": "Satisfied also unsatisfied",
      "text": "It worked great for about a year then it stopped working. I tried to have Netgear replace it they said no because it was out of warranty. I told them that I have purchased several of them but that didn’t help. Not sure if I would purchase another because of that.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeff Gourson",
      "helpful_votes": 0,
      "publication_date": 20201009
    },
    {
      "title": "Yeah it's okay.",
      "text": "I bought this for vacation so we would have signal out on the dock. It was easy to setup and connect to, but the range was pretty bad. I had a line of site to the extender and maybe 300 feet distance. It really didn't help that much. I was disappointed, but I will put it in my dad's garage as an Access Point.",
      "rating": 3.0,
      "verified": true,
      "author": "Scotty J",
      "helpful_votes": 0,
      "publication_date": 20190725
    },
    {
      "title": "Tech Sucks!!",
      "text": "when i had to switch networks it was impossible to get it to drop the old network. Called tech service and is now the norm I got a hold of soemone from India who I coundn't understand.But NO MORE!! I wasted $70.00",
      "rating": 1.0,
      "verified": true,
      "author": "Gary Engle",
      "helpful_votes": 0,
      "publication_date": 20200813
    },
    {
      "title": "do not buy",
      "text": "This product did not work for my apartment. I continue to have wifi signal issues and according to the seller, the product is suppose to help with network connectivity issues however it does not work. Also, the installation process was difficult for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Casey Collen",
      "helpful_votes": 0,
      "publication_date": 20200505
    },
    {
      "title": "Works great",
      "text": "I did a great deal of research and reading prior to making this purchase. On various sites and for various products I read a great deal about difficult installation and products which did not perform. I own a house which has many additions and thus a number of brick walls internally making wifi connections difficult This product was easy to install and connect and provides a great signal. I am very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20200208
    },
    {
      "title": "Great for a big old house with log walls!",
      "text": "It works! We live in an old farmhouse built around a log cabin many years old. Even though I had already installed a Netgear extender to my network, it still did not reach into that area. The extender AC750 does! It is nice to have a strong signal in there for the Smart tv and my iPhone. Pretty easy to set up but I did read several other reviews on Amazon that simplified the directions that came with the router. Those directions were written for a higher level tech person. It seemed they assumed you knew certain steps and terms. But...the reviews often contain good tips.",
      "rating": 5.0,
      "verified": true,
      "author": "N. Grimes",
      "helpful_votes": 2,
      "publication_date": 20150102
    },
    {
      "title": "Works great with my Verizon router",
      "text": "Read and Follow directions!!!. Even if you know I.T. Follow the directions to know the order of the lights. It works well. My Verizon outer is upstairs about 40ft away from my extender. My greenhouse outside is about another 30 feet away. I finally have a good signal, my music kept dropping off. Not anymore.",
      "rating": 5.0,
      "verified": true,
      "author": "MonicaDS",
      "helpful_votes": 0,
      "publication_date": 20190420
    },
    {
      "title": "Easy set up.",
      "text": "The setup was super easy! With the off brand WiFi range extender we had before, it barley made a difference. With the net gear range extender we now have WiFi throughout our home including our back patio.",
      "rating": 5.0,
      "verified": true,
      "author": "RandJ H.",
      "helpful_votes": 0,
      "publication_date": 20200529
    },
    {
      "title": "... access point on my wired network and it worked like a charm",
      "text": "I bought this to use as an access point on my wired network and it worked like a charm. Open the box, flip the switch on outside of device from \"extender\" to \"access point\" then connect Ethernet between device and the network. There are some setup screens to configure the access point so you will need a phone or tablet or laptop with wifi access. I had it up and running off my network in 4 minutes. Thanks to everyone that answered my question about which device to by, particularly the folks at Netgear.",
      "rating": 5.0,
      "verified": true,
      "author": "tech_guy",
      "helpful_votes": 0,
      "publication_date": 20160915
    },
    {
      "title": "Much better connection!",
      "text": "Our home has a weird spot right in the center where our wifi connection is blocked. So glad we decided to buy this extender. We stuck it right in that troublesome location and now have a strong signal like the remainder of our house. It can take a minute to find the best location, but once you do, you don't have to fiddle with it any more. Setup process is very straight forward.",
      "rating": 4.0,
      "verified": true,
      "author": "CGT",
      "helpful_votes": 0,
      "publication_date": 20200818
    },
    {
      "title": "So easy your grandma can do it!",
      "text": "Works out of the box as expected with my ATT Uverse Pace modem. Take out of box, plug into wall, wait for power light to go green, push the WPS button, then go push WPS on your existing router, wait for 2nd light to go green. Very device shows up as a connection on your devices and connect to it with same password/phrase. The extender takes the existing router name and adds \"ext\" to the name. This also has a single NIC port so it can be configured as a access point also.(vs a extender)",
      "rating": 5.0,
      "verified": true,
      "author": "Don Wendel",
      "helpful_votes": 0,
      "publication_date": 20200115
    },
    {
      "title": "WiFi signal is worse with this product",
      "text": "Set this up per instructions (confirmed by green light and WiFi connections). The WiFi signal was actually worse using this product. There are some five star reviews that try to blame the poor signal on the error but this is not correct. Anyway, if there are so many users as seen in the reviews, then the product is not user friendly. Also, it takes a long time to get a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "TED",
      "helpful_votes": 0,
      "publication_date": 20200806
    },
    {
      "title": "Do not buy.",
      "text": "Worked fine for 6 months. Netgear will not honor their warranty. It's not a hardware problem they state. It's a glitch or a setting issue. Oh they want a $89 service contract for 3 months to fix their software issue because their 90 day free support is ended. Never purchasing a Netgear product again!",
      "rating": 1.0,
      "verified": true,
      "author": "R W",
      "helpful_votes": 0,
      "publication_date": 20200920
    },
    {
      "title": "Worth the extra cost.",
      "text": "Not the clearest setup instructions in the world, but I figured it out. The app makes it tolerable. Signal really gets boosted. I use it for tv streaming and its plenty fast for that.",
      "rating": 5.0,
      "verified": true,
      "author": "scotty z",
      "helpful_votes": 0,
      "publication_date": 20200614
    },
    {
      "title": "Great Product - 1400sq ft home fully covered including garage & backyard",
      "text": "I had extremely poor reception in the bedroom furthest from my modem / router and absolutely no reception in the garage. This little wonder did the trick and I know have great reception everywhere and am super happy with this WiFi Range extender (ex6100v2) from Netgear. Super easy to install and a no brainer if you are looking for something to extend your wifi range. No stars for tech support as I did not need to contact them as this product is genuine, super easy to set up and does what it is supposed to do.",
      "rating": 5.0,
      "verified": true,
      "author": "Zenzeka",
      "helpful_votes": 0,
      "publication_date": 20190730
    },
    {
      "title": "Difficult to install",
      "text": "Difficult to install, even managed to stump their tech support people. Probably works well if your home wifi is Netgear top to bottom, but I was disappointed, especially after reading that it was a cinch to set up. Went out and bought a new nighthawk router, well they only work as advertised on one of the 5 top cable/ADSL providers, configuring for a Fairpoint system is challenging to say the loads, but that's another story. Stumped Tech support on that one too, had to return the router.",
      "rating": 2.0,
      "verified": true,
      "author": "B",
      "helpful_votes": 0,
      "publication_date": 20160128
    },
    {
      "title": "3 Years On and Still Working",
      "text": "I got this to extend our wi-fi to the second floor of the house. The only \"issue\" is that the 5G signal often goes in and out but the 2G signal is very reliable. Setup was done online - not too complicated. Supporting several portable devices with no problem.",
      "rating": 4.0,
      "verified": true,
      "author": "Tape Doctor",
      "helpful_votes": 0,
      "publication_date": 20180808
    },
    {
      "title": "Effortlessly Imprve Your WiFi",
      "text": "Great device, plug it in an electric outlet, follow some on line instructions at NETGEAR's website and its up and running. It is a tiny discreet box with no additional antennas or cables needed. Used this to improve link to security cameras now have 5 bars on all.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190625
    },
    {
      "title": "Buyer beware",
      "text": "This product did work. However the WiFi signal is reduced by at least 50%. This should have been disclosed in the product info. In fact, the seller implies just the opposite. When researching that is just how they work. But not disclosing this is a deceptive trade practice. Secondly, it does take some technical expertise to install. The directions assume you have network experience. If you don’t you will need help.",
      "rating": 3.0,
      "verified": true,
      "author": "J. Robinson",
      "helpful_votes": 0,
      "publication_date": 20191121
    },
    {
      "title": "Easy and Quick Setup, works Okay",
      "text": "Setup was simple and fast and the unit does help; however it has a very poor 5GHz. receiver and low power 5GHz. transmitter, almost a bad as my Motorola SURFboard SBG6782-AC * after 4-months of interrupted use i have to say DO NOT BUY THIS UNIT, it stopped working every few weeks and had to be restarted but now it doesn't boot up at all. Netgear tech support is just as reliable as their products. the US based tech's answer was \"it's not working\" i said it's under warranty he answered \"not from Netgear\" don't buy any Netgear range extender.",
      "rating": 1.0,
      "verified": true,
      "author": "R. A. Majestic",
      "helpful_votes": 0,
      "publication_date": 20150107
    },
    {
      "title": "Setup was extremely easy. Signal is very strong",
      "text": "This is not a technical review, just my general observations. I'm using it as an access point. Setup was extremely easy. Signal is very strong. I get full set of bars where I used to get one and sometimes two bars. However, things don't all seem to work. The internet connecting drops. Sometimes it won't connect. My \"tested\" download speed is fantastic but my \"gut level\" observed download speed is no better than with my old one or two bar signal strength. So there's the good and bad from my experience.",
      "rating": 3.0,
      "verified": true,
      "author": "Slayda",
      "helpful_votes": 2,
      "publication_date": 20140831
    },
    {
      "title": "Works Great!",
      "text": "Have had it and used it for the past year and a half. Works Great! Followed the directions to install it on the first floor of our house. The router is in the walkout basement as we live on a slope, so we needed to boost the signal above ground. Without it, we couldn't get a signal at the far end of the INSIDE of the house. Now, we get a signal everywhere inside and we can pick up the wifi outside for about 100 to 200 feet from the house. I'm very pleased with this purchase!",
      "rating": 5.0,
      "verified": true,
      "author": "Richard A",
      "helpful_votes": 0,
      "publication_date": 20161121
    },
    {
      "title": "It worked exactly as advertised!",
      "text": "Honestly I was a bit skeptical. I needed to extend WiFi to an area of an older building that just could not hold a signal from the Apple AirPort Extreme down the hall. Getting a wire connection was going to be costly and troublesome. I elected to give the Netgear AC750 a try. The installation was simple, the connection immediate and the performance above expectations. If I have a similar situation again I will buy the identical product. (All Mac building - Airport, AppleTV, iPhone, iPad and Mac Air)",
      "rating": 5.0,
      "verified": true,
      "author": "K. Compton",
      "helpful_votes": 2,
      "publication_date": 20150117
    },
    {
      "title": "Works Great!",
      "text": "I bought this to extend router coverage to my outdoor patio. It was easy to install and program. My router is dual-band (2.4 and 5.0 GHz) and I was able to extend both frequencies. The Wi-Fi SIDs show up as \"<router-name>_ext2\" and \"<router-name>_ext5\" so you know if you're connecting directly to the router or one of the extender frequencies. My devices (PC, Wi-Fi printer, and phones) connected to it with no problem. My router is in my basement, so I put this in an upstairs bedroom. The coverage is great. It turned the signal strength of my upstairs devices from 3-bars to a full 5-bars. It also covered my outdoor patio... from no bars to full signal strength.",
      "rating": 4.0,
      "verified": true,
      "author": "DarkMatter",
      "helpful_votes": 0,
      "publication_date": 20140526
    },
    {
      "title": "Strong signal and large coverage",
      "text": "I installed the Netgear EX 6100 very easily and I was able to link my Hello Nest Doorbell to my Wi-Fi network without any problems. Before that, I tried the Google Wifi devices without good results. I want to emphasize that between the nearest outlet and the nest hello there are about 15 feet with a wall of concrete blocks in between.",
      "rating": 5.0,
      "verified": true,
      "author": "Williams Pacheco",
      "helpful_votes": 0,
      "publication_date": 20190719
    },
    {
      "title": "Stopped working! Bad Manafacture Warrenty",
      "text": "The extender stopped working! After many hours troubleshooting following their user manual and on line resources you have to go directly to the company which is overseas. (International Long Distant phone call). Then they ask you to stay on the phone with them to troubleshoot the extender. If they can not fix it over the now $20-$40 phone call then they will consider replacing it. I don't usually give such bad ratings but this has been horrific!",
      "rating": 1.0,
      "verified": true,
      "author": "The Dog",
      "helpful_votes": 2,
      "publication_date": 20151023
    },
    {
      "title": "Excellent product. Just follow directions.",
      "text": "Received the Extender in the mail around 1:30pm. By 1:45pm it was unpacked, setup and working and significantly increased the signal in an area that previously had weak reception. The directions are simple and easy to follow. If you read and follow them, you should be up and running pretty quick. It takes a minute or two when first plugged in for setup to find the wifi signal but the rest of the programming is quick. I had an Ott box hooked up to MBR TV which required a download speed of 10mbps but was only getting 5. After setting up the extender, it was getting 25mbps; more than adequate.",
      "rating": 5.0,
      "verified": true,
      "author": "Jerry C",
      "helpful_votes": 0,
      "publication_date": 20160620
    },
    {
      "title": "Works perfectly to half below ground art studio",
      "text": "Tried to use the first setup method when received. Didn't work. Then used the web browser to define settings. It was incredibly easy. Don't even bother using the first setup method. My destination location is part way down a hill, through a cinder block wall, and is half underground, to a chromecast device. I had to move the AC750 to the second floor and it worked perfectly. My wife's and my androids get a fair signal level. The chromecast works. The AC 750 is definitely recommended.",
      "rating": 5.0,
      "verified": true,
      "author": "Ranchodoug",
      "helpful_votes": 0,
      "publication_date": 20160826
    },
    {
      "title": "This product is easy to set up and so far we are able ...",
      "text": "We bought this product to help extend our wireless connection so that it can be used all over the house. This product is easy to set up and so far we are able to use the Internet on the second floor of our home for the first time in over a year. The signal is strong and does not waver when we are using the Internet on a Nook on the second floor of our home. Truly a purchase worth investing in if you want to avoid installing wires all over your home or some other complicated system to expand your wireless connection throughout your home.",
      "rating": 5.0,
      "verified": true,
      "author": "Chris Donner",
      "helpful_votes": 0,
      "publication_date": 20141208
    },
    {
      "title": "Connectivity is intermittent",
      "text": "The \"extender\" capability provides marginal improvement (5-6 Mbps) after experimenting and placing it in the optimal location. I could live with that however, the connection is constantly going to either limited connectivity or \"freezing\" altogether. This happens several times within a half hour that requires disconnecting the connection and reconnecting it to gain access again. I've resigned to connect to my main router and deal with slower performance. At least it's consistent",
      "rating": 2.0,
      "verified": true,
      "author": "Bob Cooke",
      "helpful_votes": 3,
      "publication_date": 20141215
    },
    {
      "title": "For the tech savy",
      "text": "This was hard to set up. After it was set up, several things in the house were not working. I had to disconnect the item. This is sure not for those who are not tech savy.",
      "rating": 2.0,
      "verified": true,
      "author": "Annie",
      "helpful_votes": 0,
      "publication_date": 20200419
    },
    {
      "title": "big improvement but microwave stops signal",
      "text": "get you popcorn ready before the Netflix movie, every time I use the microwave it stops the signal, have to sign out then in again, but big improvement overall, try putting movie on pause sometimes this helps during microwave use",
      "rating": 4.0,
      "verified": true,
      "author": "sue p",
      "helpful_votes": 0,
      "publication_date": 20181022
    },
    {
      "title": "The unit worked fine in the beginning",
      "text": "The unit worked fine in the beginning, but after 2 months it just quit! The transmitter would not sync with the receiver. I may have received a bad unit as Netgear is a very reputable comany. I finally used a Eithernet cable as it is more dependable but also more expensive. This is a very good item, when it did work, but just didn't work for me.",
      "rating": 1.0,
      "verified": true,
      "author": "Steve Burkey",
      "helpful_votes": 6,
      "publication_date": 20150113
    },
    {
      "title": "Does not work with proxy.",
      "text": "Does not work in all environments, I get this extender to use it for my office at work to extend my wireless, we use proxy, but the extender didn't connect to the internet, I called customer service several times, most of them are located in different country, when they don't know what to do they hang the phone on me, every single time. And the wireless keeps dropping the signal on its own. I gave it 3 stars because I think it might work in different environment with no proxy like at home or small office.",
      "rating": 3.0,
      "verified": true,
      "author": "Sam",
      "helpful_votes": 2,
      "publication_date": 20140921
    },
    {
      "title": "Does what it says it does!",
      "text": "I have about a 3,500 square foot home and my wireless router is located in the basement next to our cable modem. Before purchasing this product I was unable to use wifi outside of the house, or at any of the extreme corners. Now, with this wifi range extender, I am able to sit in the back yard and watch TV with my Amazon Fire Stick and my outdoor TV seamlessly. It even provides enough bandwidth to stream using my slingbox, which I would have never been able to do before. Absolutely no complaints about this device, there has been no downside since I've owned it.",
      "rating": 5.0,
      "verified": true,
      "author": "Jayi8",
      "helpful_votes": 0,
      "publication_date": 20150204
    },
    {
      "title": "Didn't work for our small house",
      "text": "I really REALLY wanted to like this product. We have an 1100 sq ft home and I think it's ridiculous that sometimes our wifi signal drops. We researched a lot and thought this would make the cut. The signal for this stays up, but it stops picking up the original signal from our Mac Airport. I wanted to return this item, but it was past the return date by the time I got around to it. I would save your money and skip this purchase.",
      "rating": 1.0,
      "verified": true,
      "author": "leylabot",
      "helpful_votes": 3,
      "publication_date": 20150709
    },
    {
      "title": "Easy to install! Affordable too!",
      "text": "Perfect! Easy for an old lady to install. It’s a no brainer! I have a big house and the main wifi will not connect into my bedroom, so this was affordable and it is always giving me fast speed throughout the house.",
      "rating": 5.0,
      "verified": true,
      "author": "Hill",
      "helpful_votes": 0,
      "publication_date": 20180909
    },
    {
      "title": "Works with Airplay!",
      "text": "Really expanded the internet in our large home to our patio! Works great! Our apple TV and other airplay devices are connected straight to the wall. This allows us to use airplay when connected to either our main network or the second network that this creates! Note that this product does create it's own network the way we set it up, so you have to disconnect from the old one and reconnect to this one inside our house. I thought this would be inconvenient, but it actually isn't for our home setup.",
      "rating": 4.0,
      "verified": true,
      "author": "Brandon",
      "helpful_votes": 0,
      "publication_date": 20160103
    },
    {
      "title": "Definately DOUBLED our WIFI coverage.",
      "text": "This item works as advertised. Using just my wireless router, which is in my basement, I used to get coverage pretty much just on the first floor. When I connected this device to an outlet right by the stairs leading to the second floor, I instantly got coverage everywhere in my home. It was extremely easy to program and worked right away. It has been a few months since I had it, and not once did I need to restart it. My kids even broke one of the antennas off, and it still works just as well.",
      "rating": 5.0,
      "verified": true,
      "author": "Ronnie",
      "helpful_votes": 2,
      "publication_date": 20141226
    },
    {
      "title": "It works!",
      "text": "I am not a techy person. It took a little while to read the signal and for the lights to go green, but once it was set up it works great!",
      "rating": 5.0,
      "verified": true,
      "author": "Jewels",
      "helpful_votes": 0,
      "publication_date": 20200716
    },
    {
      "title": "Simplifies Wi-Fi",
      "text": "Trivially easy to install and configure, my house finally has 5Ghz coverage throughout. Downside is I find myself resetting the unit at least a couple of times a week in extender mode. Issue goes away almost entirely when hard-wired as an access point but that sort of defeats the whole purpose as far as convenience goes for a lot of people. All in all however,especially for the price, it's a simple and effective way to solve coverage issues.",
      "rating": 4.0,
      "verified": true,
      "author": "T. D. Kozan",
      "helpful_votes": 0,
      "publication_date": 20151104
    },
    {
      "title": "Unreliable as a device",
      "text": "I've had 3 of these. They just aren't reliable. Their connections are up and down periodically through out the day. I've used them for several years now in multiple environments and they are always unreliable and frustrating to use.",
      "rating": 1.0,
      "verified": true,
      "author": "Patrick",
      "helpful_votes": 0,
      "publication_date": 20190610
    },
    {
      "title": "Range of WIFI and Increase Speed a Big Plus",
      "text": "After reviewing the negative reviews I took a chance made the purchase. With the ease of set up and noticeable increase speed was a good choice would highly recommend.",
      "rating": 5.0,
      "verified": true,
      "author": "Michael R. Van Leer",
      "helpful_votes": 0,
      "publication_date": 20200307
    },
    {
      "title": "Awful.",
      "text": "Constantly crashes forcing reboot, already has up to date firmware. Works well when in range of the device your trying to extend range of, it doesn't extend however. Whether in speed or performance mode it will not connect to the internet despite having signal and a DNS address. In either mode my iPad connects farther from the router than the extender does. A waste of money. Netgear continues its trend of making crap. Now I'm stuck overseas with a paper weight. Wireless pos.",
      "rating": 1.0,
      "verified": true,
      "author": "Myria",
      "helpful_votes": 0,
      "publication_date": 20150807
    },
    {
      "title": "Great Product",
      "text": "I took it out of the box, followed the instructions and it was working great in a very short time period. I use it to hook up my desktop computer via the ethernet connection and it is excellent. It is about 40 feet and 1 floor level from the modem and I have very good signal.",
      "rating": 5.0,
      "verified": true,
      "author": "John Gilchrist",
      "helpful_votes": 0,
      "publication_date": 20200622
    },
    {
      "title": "Save Up for Tech Support",
      "text": "Unintelligbile manual--help needed to set it up. When your router or the extender become disconnected, you must first reset the extender and then go through a baroque procedure to reset your wifi settings. This must be done with help from their phone bank, few of whom speak good English. To add insult to the painful process the charge for help exceeds the cost of the extender itself. Next time I have a failure, I'll simply buy someone else's extender and toss the Netgear....",
      "rating": 2.0,
      "verified": true,
      "author": "Book Nut",
      "helpful_votes": 2,
      "publication_date": 20161105
    },
    {
      "title": "I needed this for whole house coverage",
      "text": "Finally I have wi-fi in every room of my home. I have xfinity and it just covered 4-5 rooms. What about upstairs and down the hall? Solved that problem with this extender. I use the 5 and the 2 G settings and I don't have any dead spots in the whole house. I'm glad I bought it. You would think, though, that xfinity would give me better coverage.",
      "rating": 5.0,
      "verified": true,
      "author": "Mark N.",
      "helpful_votes": 0,
      "publication_date": 20171121
    },
    {
      "title": "Separate password than router",
      "text": "Really you can have your own password different from the router! Great for use when you’re not the only one using the router! Not as easy to set up as some but better features. Too bad it doesn’t use a tether app, but overall very pleased",
      "rating": 5.0,
      "verified": true,
      "author": "life journey",
      "helpful_votes": 0,
      "publication_date": 20190306
    },
    {
      "title": "Not Sure if the Signal is Stronger",
      "text": "Not sure that my WiFi reception is that much better with this device. The big question for everyone with web access is IF/WHEN the service providers are \"adjusting\" the transmission speed coming into (our) modem & router...",
      "rating": 3.0,
      "verified": true,
      "author": "SanibelMike",
      "helpful_votes": 0,
      "publication_date": 20190518
    },
    {
      "title": "IT WORKED LIKE A CHARM!",
      "text": "I'm not so tech savvy so I will review in lay-ladies terms. We have Time Warner WiFi/Cable in a large 2 story house. We were not able to get our WiFi upstairs in the loft so we bought a Netgear extender ($35 variety) It worked fine but the signal was still not strong enough to get to my IPad or Smart TV in the bedroom. I replaced the extended at the bottom of the stairs with this on and used the old one in my bedroom. There was a bit of network re-gigging on the electronics (laptop, ipads etc) but all in all.....IT WORKED LIKE A CHARM!",
      "rating": 5.0,
      "verified": true,
      "author": "Jeaniem",
      "helpful_votes": 0,
      "publication_date": 20140721
    },
    {
      "title": "Did not work",
      "text": "I received this unit and could not get it syncinized with my Netgear WiFi unit. I called customer service and the person on the other end could not get it working either. I had to return this Netgear WiFi Range Extender. I was disappointed but found another MFG WiFi to give me complete WiFi throughout my home.",
      "rating": 1.0,
      "verified": true,
      "author": "TFA",
      "helpful_votes": 0,
      "publication_date": 20180421
    },
    {
      "title": "Signal boost",
      "text": "Works as promised. Very easy set-up (10 minutes or less) and provides coverage on the lower level of a home of ~1700 sq ft.",
      "rating": 5.0,
      "verified": true,
      "author": "Fire100",
      "helpful_votes": 0,
      "publication_date": 20200629
    },
    {
      "title": "Not worth the money",
      "text": "I bought this unit to make my wireless signal downstairs more robust for my XBOX One and its proven to be fairly useless. My games and Netflix spool far more often with the extender than they did without. Totally defeated the purpose. Set up was not as easy as it should of been. It took me multiple tries to get it to marry my router. Once it did it worked decently with handheld devices and I stayed connected in my backyard and front yard.",
      "rating": 3.0,
      "verified": true,
      "author": "GY",
      "helpful_votes": 0,
      "publication_date": 20151113
    }
  ],
  "product_meta": {
    "title": "NETGEAR WiFi Mesh Range Extender EX6100 - Coverage up to 1000 sq.ft. and 15 Devices with AC750 Dual Band Wireless Signal Booster & Repeater (up to 750Mbps Speed), Plus Mesh Smart Roaming",
    "description": "Model:AC750 Plug-InBoost your existing Wi-Fi with the AC750 Wi-Fi Range Extender. Enjoy improved wireless coverage on your Wi-Fi devices such as laptops, tablets, and smartphones throughout your home and even your backyard. Eliminate dead zones in hard-to-reach areas, simply plug it into any outlet and experience the difference.",
    "rating": 4,
    "feature_bullets": [
      "EXTENDED WIRELESS COVERAGE: Adds WiFi range coverage up to 1000 sq ft, and connects up to 15 devices such as laptops, smartphones, speakers, IP cameras, tablets, IoT devices, and more.",
      "SEAMLESS SMART ROAMING: Uses your existing network SSID name so you never get disconnected as you move around your home or office",
      "AC750 WIFI SPEED: Provides up to 750Mbps performance using dual-band and patented FastLane(TM) technology for demanding HD streaming and online gaming.",
      "UNIVERSAL COMPATIBILITY: Works with any wireless router, gateway, or cable modem with WiFi.",
      "WIRED ETHERNET PORT: Simply plug in game consoles, streaming players, or other wired devices into the one Gigabit port for maximum speed.",
      "SAFE & SECURE: Supports WEP and WPA/WPA2 wireless security protocols.",
      "SIMPLE TO SETUP: Use the Nighthawk app for setup, to view WiFi settings, and see devices on your network with the network map."
    ],
    "specifications": {
      "Wireless Type": "802.11a/b/g/n/ac",
      "Brand": "NETGEAR",
      "Item model number": "EX6100-100NAS",
      "Item Weight": "7.5 ounces",
      "Product Dimensions": "7.09 x 5.71 x 3.98 inches",
      "Item Dimensions  LxWxH": "7.09 x 5.71 x 3.98 inches",
      "Color": "White",
      "Batteries": "1 Product Specific batteries required.",
      "Manufacturer": "Netgear",
      "ASIN": "B00HHRP11C",
      "Is Discontinued By Manufacturer": "No",
      "Date First Available": "January 23, 2014",
      "Customer Reviews": "4.0 out of 5 stars14,388 ratings4.0 out of 5 stars",
      "Best Sellers Rank": "#36 in Repeaters",
      "Domestic Shipping": "Item can be shipped within U.S.",
      "International Shipping": "This item can be shipped to select countries outside of the U.S. Learn More"
    },
    "categories": [
      "Computers & Accessories",
      "Electronics",
      "Repeaters",
      "Networking Products"
    ],
    "price": 74.99
  }
}