{
  "website_summaries": [
    {
      "verdict": "Smaller than its travel bag cousin but with just as much panache, fans of the brand will thrill to the lower price tag.",
      "pros": [
        "The medium side is great for everyday use, holding enough items for work or an outing",
        "Dressy enough for a night out",
        "Some users find it great for travel",
        "The strong straps are long enough to wear the bag over the shoulder"
      ],
      "cons": [
        "Some users would like to see trim that matches the color of the bag instead of in brown"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "Real or Fake?",
      "text": "I was hesitent to buy this bag off of amazon, because I was afraid of a knock-off, but the one I recieved had the \"diamond\" stamped leather, stitching on both sides of the flap, correct logo on the back seam, and the large handles. I love the bag I bought from this seller. Double check the link below to make sure you got the real bag: [...]",
      "rating": 5.0,
      "verified": true,
      "author": "Kalli Kay Whitney Guyett",
      "helpful_votes": 38,
      "publication_date": 20161019
    },
    {
      "title": "Great Tote Bag",
      "text": "My wife loves this tote bag. This is her 2nd one. She uses it every day to work. It fits all the stuff she brings to work.",
      "rating": 5.0,
      "verified": true,
      "author": "GL Engraving",
      "helpful_votes": 0,
      "publication_date": 20200713
    },
    {
      "title": "One Star",
      "text": "BE CAREFUL!!! The bag I got was clearly counterfeit and I'm very mad about this! DO NOT SUGGEST BUYING!",
      "rating": 1.0,
      "verified": true,
      "author": "Julie",
      "helpful_votes": 16,
      "publication_date": 20161116
    },
    {
      "title": "Good experience",
      "text": "It was a gift but the recipient was very pleased.",
      "rating": 5.0,
      "verified": true,
      "author": "Bookluver",
      "helpful_votes": 0,
      "publication_date": 20190208
    },
    {
      "title": "Great travel bags",
      "text": "It was a replacement. I gave my older one to my daughter. These are great travel bags",
      "rating": 5.0,
      "verified": true,
      "author": "dking",
      "helpful_votes": 0,
      "publication_date": 20200915
    },
    {
      "title": "Violeta",
      "text": "Great product. Love the size of the bag . Excellent for traveling.",
      "rating": 5.0,
      "verified": true,
      "author": "Miro",
      "helpful_votes": 0,
      "publication_date": 20191016
    },
    {
      "title": "The bag is folded!!!",
      "text": "I received the bag thinking I ordered the wrong size and was about to return when I realized the bag is folded. Silly me! The bag is actually a nice size and can carry all of my things.",
      "rating": 5.0,
      "verified": true,
      "author": "Ashley",
      "helpful_votes": 0,
      "publication_date": 20200913
    },
    {
      "title": "Wonderful multipurpose bag",
      "text": "I love this bag! Its so thin and light weight yet it is of superb quality. I use it as my everyday purse (i keep a smaller purse inside that i can take with me on a night out to dinner, etc. and then leave my large Longchamp bag in the car). It's perfect for those that like keeping everything in their purse! Down to the makeup, etc. This would be a good size for use as an overnight bag or beach bag as well. If it were a little less expensive I would buy it in multiple colors. But it is worth the price!",
      "rating": 5.0,
      "verified": true,
      "author": "R & L Eskew",
      "helpful_votes": 5,
      "publication_date": 20160802
    },
    {
      "title": "I've owned several Longchamps before and have loved them. This is not real and is HORRIBLE ...",
      "text": "FAKE! Do not buy this bag! I've owned several Longchamps before and have loved them. This is not real and is HORRIBLE quality. Plus it look over three weeks to receive. You're much better off going to Nordstrom and buying a real one.",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 12,
      "publication_date": 20160926
    },
    {
      "title": "Who packed this item?",
      "text": "Sorry to say that I'm a little disappointed . I ordered this gift for my daughter for Christmas . It was supposed to be Black and I received D. Coffee. The price was great, but I don't know if she will keep it since it is the wrong color.",
      "rating": 3.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 3,
      "publication_date": 20170102
    },
    {
      "title": "Gotta Make Your Light-weight Bag Heavy",
      "text": "I like my tote ....but how do others deal with the empty look of it- most of the time? I'd like to use it as my everyday pocketbook, but I feel its shape is compromised with just pocketbook stuff. Great for shopping and stuffing much into it!",
      "rating": 4.0,
      "verified": true,
      "author": "Phyllis Steiner",
      "helpful_votes": 0,
      "publication_date": 20161210
    },
    {
      "title": "Loving this bag!",
      "text": "This has been one of the best bagsI've owned in a while. Very practical yet stylish! Good for school, work, or just hanging out. The shipping was lightning fast. A bit overpriced here on Amazon, but definitely worth the splurge! Go Longchamp!",
      "rating": 5.0,
      "verified": true,
      "author": "Steven B.",
      "helpful_votes": 3,
      "publication_date": 20150714
    },
    {
      "title": "Not what expected",
      "text": "Size is good - medium/large. No inside pockets drives me crazy for a bag this price! Also although it's a canvas bag it feels flimsy. Probably won't use it much.",
      "rating": 3.0,
      "verified": true,
      "author": "Jpp",
      "helpful_votes": 5,
      "publication_date": 20150314
    },
    {
      "title": "It's perfect for travel",
      "text": "This is a classy, commodious bag. It's perfect for travel, looks great, and will take in as much as you can lift. If used for everyday, it might be nice to have some smaller organizer bags inside, because it has only one small pocket. It's like a comfortable beach bag, but way more elegant.",
      "rating": 5.0,
      "verified": true,
      "author": "Eba",
      "helpful_votes": 2,
      "publication_date": 20150923
    },
    {
      "title": "MAGNIFIQUE",
      "text": "ITS JUST PERFECT, I LOVE IT! I CAN USE IT LOT OF TIMES, MOVIES, SHOPPING, DINNER...ETC=)",
      "rating": 5.0,
      "verified": true,
      "author": "AGNIES",
      "helpful_votes": 0,
      "publication_date": 20100303
    },
    {
      "title": "great handbag",
      "text": "Love this handbag. This tote is very large and great to take when going around town",
      "rating": 5.0,
      "verified": true,
      "author": "Gorgeous",
      "helpful_votes": 5,
      "publication_date": 20150125
    },
    {
      "title": "to closing this account. I don't want to have to go through this hell again. I returned this bag",
      "text": "Nothing but a head ache with this order. I returned the item and Amazon is saying I did not! It's been returned back in September 2016 and I'm very close to closing this account. I don't want to have to go through this hell again. I returned this bag",
      "rating": 1.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 14,
      "publication_date": 20161101
    },
    {
      "title": "REALLY USEFUL",
      "text": "This is my second Longchamps of this size. I have the smaller one and a much larger one that I bought in Paris Duty free around 6 years ago, but this is an ideal size. I can't travel without it. It takes up very little space in my bag, but holds an amazing amount of \"stuff\" when it is unfolded. It is a little pricey for nylon with a little leather trim, but I haven't found anything else that works as well for that task.",
      "rating": 5.0,
      "verified": true,
      "author": "C. J.",
      "helpful_votes": 0,
      "publication_date": 20201117
    },
    {
      "title": "Great Bags...What's with the Amazon price?",
      "text": "These are excellent quality bags. My wife loves them and they literally last for years (with daily use and travel). But this same bag retails for $145.00 everywhere Longchamp is sold (excluding Paris- where it's cheaper)) so why would anyone buy it here? Amazon is way off the mark on this one!",
      "rating": 5.0,
      "verified": false,
      "author": "JamesM",
      "helpful_votes": 13,
      "publication_date": 20160715
    },
    {
      "title": "The bag would be nice for a beach bag or something but not for ...",
      "text": "Kind of regret buying this bag. I've use it for about 6 months now it has not been holding up very well. The corners are already showing some wear. The bag would be nice for a beach bag or something but not for every day, it doesn't seem great quality.",
      "rating": 2.0,
      "verified": false,
      "author": "Layla",
      "helpful_votes": 4,
      "publication_date": 20150927
    },
    {
      "title": "One Star",
      "text": "I found the same bag at a better website for 145$ and the bags are actually real :)",
      "rating": 1.0,
      "verified": false,
      "author": "Elizabeth",
      "helpful_votes": 11,
      "publication_date": 20160404
    }
  ],
  "product_meta": {
    "title": "Longchamp Le Pliage Large Shoulder Tote Bag",
    "description": "Embossed leather trims a water-resistant nylon tote that folds into a compact shape for travel and storage. Top zip with snap-flap closure. Interior wall pocket. Folds flat for storage. Nylon with leather trim 12.25\"L x 7.5\"W x 11.75\"H; 9\" strap drop\n\n\n\n\nPRODUCT DETAILS\n * Is Discontinued By Manufacturer :No\n * Product Dimensions :12.2 x 7.48 x 11.81 inches; 11.99 Ounces\n * Item model number :1899089_NOIR\n * Department :Womens\n * Date First Available :March 9, 2009\n * Manufacturer :Longchamp\n * ASIN :B00H1H65AY\n\n * Amazon Best Sellers Rank: #98,647 in Clothing, Shoes & Jewelry (See Top 100 in Clothing, Shoes & Jewelry)  *  #45429 inWomen's Shops \n    *  #531 inWomen's Shoulder Handbags \n    *  #366 inWomen's Tote Handbags \n   \n   \n\n * Customer Reviews:4.3 out of 5 stars43 ratings Embossed leather trims a water-resistant nylon tote that folds into a compact shape for travel and storage. Top zip with snap-flap closure. Interior wall pocket. Folds flat for storage. Nylon with leather trim 12.25\"L x 7.5\"W x 11.75\"H; 9\" strap drop",
    "rating": 4.3,
    "feature_bullets": [
      "Nylon",
      "Imported",
      "Zipper closure",
      "Shoulder Strap (12\" Drop)",
      "Measures 13 x 13 x 7.5",
      "Top Zipper closure",
      "Best Selling bag! Take it to School , work, and around the world!!",
      "Folds for Travel"
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.2 x 7.48 x 11.81 inches; 11.99 Ounces",
      "Item model number": "1899089_NOIR",
      "Department": "Womens",
      "Date First Available": "March 9, 2009",
      "Manufacturer": "Longchamp",
      "ASIN": "B00H1H65AY"
    },
    "categories": [
      "Shoulder Bags",
      "Women",
      "Handbags & Wallets",
      "Clothing, Shoes & Jewelry"
    ],
    "price": 145.0
  }
}