{
  "website_summaries": [
    {
      "verdict": "An organic shampoo that nourishes your hair back to health by removing impurities and starting over from scratch.",
      "pros": [
        "Gentle enough to use daily and can leave your hair soft, shiny, and so strong you can do away with using product",
        "Returns hair to its natural, healthy state",
        "We love that the bottle of shampoo can last nearly half the year"
      ],
      "cons": [
        "Some note they've seen an increase in flyaway hair since using this product, however this doesn't seem to be the norm"
      ],
      "aspects": {},
      "publication_date": "",
      "rating": "",
      "source": "bestreviews"
    }
  ],
  "customer_reviews": [
    {
      "title": "I do not recommend",
      "text": "I love Alaffia products. I bought this shampoo hoping I’d love it as much as their lotions and toner. I have straight hair and a lot of it. However, when I wash my hair with this, I cannot comb my straight, rarely tangled hair. It doesn’t fully rinse out. It weighs down my hair and leaves a residue that makes my hair feel like I Pet a dog that just played in the mud and dried off. It makes it straw like, tangled, and look and feel dirtier than before it was washed.",
      "rating": 1.0,
      "verified": true,
      "author": "SandySR",
      "helpful_votes": 5,
      "publication_date": 20190108
    },
    {
      "title": "A good shampoo",
      "text": "The first time I used this I felt like it wasn't doing anything, and decided that since I paid for it I would continue to use it until it ran out or something else came up to make me dislike it. Well, it certainly felt like I wasn't doing anything at first but after a few times using it my hair stopped requiring serums for heat protection, and unlike what others have said, it never made my hair feel like straw.",
      "rating": 5.0,
      "verified": true,
      "author": "Lexi",
      "helpful_votes": 10,
      "publication_date": 20150128
    },
    {
      "title": "Good Product",
      "text": "I love the scent and the fact that it’s natural, but I need to use SO much to feel like I’ve thoroughly washed my hair. Good thing it comes in a huge bottle! Would purchase again, since it doesn’t irritate my skin and works decently.",
      "rating": 4.0,
      "verified": true,
      "author": "HHopkins",
      "helpful_votes": 0,
      "publication_date": 20180621
    },
    {
      "title": "Best Natural Shampoo!",
      "text": "This is the best natural shampoo that I have tried. It leaves my hair feeling clean and light unlike some others. It does make suds but is made of very safe ingredients according to EWG's Skin Deep website. I have been using this shampoo for over 2 years and continue to order it again and again. My hair is short and I don't use conditioner. I also color my hair and when using this shampoo my color seems to last longer. I only need to recolor because of new growth. I would recommend this shampoo to anyone wanting to use a safe gentle product.",
      "rating": 5.0,
      "verified": true,
      "author": "S Huber",
      "helpful_votes": 13,
      "publication_date": 20160223
    },
    {
      "title": "Low price, high quality",
      "text": "I had used their African black soap body wash before so I figured I would give their shampoo and conditioner a shot. So far it's been great for my hair, it feels clean but still has body and doesn't get dried out. It's also half the price as most of the other natural brands which is amazing.",
      "rating": 5.0,
      "verified": true,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20190108
    },
    {
      "title": "Love that this is all natural",
      "text": "Hair feels very very clean. Love that this is all natural. Trying to eliminate chemicals as much as possible. Wish it smelled better but it is cleansing. The conditioner that goes with this is another story. No hydration at all.",
      "rating": 5.0,
      "verified": true,
      "author": "Suzanne",
      "helpful_votes": 4,
      "publication_date": 20150301
    },
    {
      "title": "Great for sensitive skin!",
      "text": "The only soap that doesn’t flair up my kids eczema. Love it !",
      "rating": 4.0,
      "verified": true,
      "author": "Darkcar",
      "helpful_votes": 0,
      "publication_date": 20180414
    },
    {
      "title": "Wonderful",
      "text": "Wonderful shampoo! TRULY natural (not just labeled \"natural\", which means nothing) and feels great and works great.",
      "rating": 5.0,
      "verified": true,
      "author": "FLO",
      "helpful_votes": 0,
      "publication_date": 20180403
    },
    {
      "title": "The shampoo itself is kind of thin, and also ...",
      "text": "The shampoo itself is kind of thin, and also not a lot of shampoo comes out of the pump. I have to pump at least 3 times to get an adequate amount for my hair, which only goes to my shoulders. However, I appreciate that the shampoo is more eco-friendly and fair trade.",
      "rating": 3.0,
      "verified": true,
      "author": "Glori Chavez",
      "helpful_votes": 0,
      "publication_date": 20160203
    },
    {
      "title": "This is my favorite shampoo. It makes my hair extremely soft",
      "text": "This is my favorite shampoo. It makes my hair extremely soft, has a great scent, no chemicals to worry about, Smells great too! Packaging was excellent.",
      "rating": 5.0,
      "verified": true,
      "author": "Cats Everywhere",
      "helpful_votes": 0,
      "publication_date": 20170705
    },
    {
      "title": "Five Stars",
      "text": "Love all the suds and how it leaves my hair.",
      "rating": 5.0,
      "verified": true,
      "author": "NANCY K HOLST",
      "helpful_votes": 0,
      "publication_date": 20151107
    },
    {
      "title": "Love this shampoo",
      "text": "Love this shampoo!!!!! I made sure i completely combed out my hair before use and followed up with a deep conditioner!!! This completely strips your hair of oil, pollution, and dirt. My hair is growing in nice and evenly too!",
      "rating": 5.0,
      "verified": true,
      "author": "Prime shopper ",
      "helpful_votes": 0,
      "publication_date": 20141222
    },
    {
      "title": "Moisture fix",
      "text": "Love it.. Moisturizing and washes off clean. Helps reduce winter dryness.",
      "rating": 5.0,
      "verified": true,
      "author": "Jeri L Thompson",
      "helpful_votes": 0,
      "publication_date": 20150323
    },
    {
      "title": "Terrible chemical smell",
      "text": "This shampoo has a terrible chemical smell. I am sending it back for a refund.",
      "rating": 1.0,
      "verified": true,
      "author": "TD Karantsalis",
      "helpful_votes": 0,
      "publication_date": 20180131
    },
    {
      "title": "I'm so happy i can buy it on Amazon",
      "text": "Makes my hair so soft and manageable! I've been using alaffia for years, and I'm so happy i can buy it on Amazon.",
      "rating": 5.0,
      "verified": true,
      "author": "Love and Hate equally.",
      "helpful_votes": 0,
      "publication_date": 20150812
    },
    {
      "title": "I have tried EVERYTHING else...but this is \"the one\".",
      "text": "I absolutely love this. I have dry, cracked baby-fine hair that is super frizzy. I have tried EVERYTHING else...but this is \"the one\". After years of fighting my hair, I finally now have soft touchable hair. I have used this shampoo for 2 months and I do not plan on switching. Yes, it is more expensive than greocery store shampoo, but 100% worth it!",
      "rating": 5.0,
      "verified": true,
      "author": "AM",
      "helpful_votes": 0,
      "publication_date": 20151109
    },
    {
      "title": "This is by far the best shampoo I've ever used",
      "text": "This is by far the best shampoo I've ever used. I have a dry scalp and fine thin hair. I've tried hundreds of products including so called \"natural, organic\" products, but most of them made my scalp even drier. I really wanted to find shampoo that doesn't dry my scalp, but the most expensive shampoos out there still dried out my scalp. This everyday coconut hydrating shampoo is the only one that doesn't dry my scalp. I don't have to scratch my scalp every night anymore. I will keep using this product.",
      "rating": 5.0,
      "verified": true,
      "author": "Emerald City",
      "helpful_votes": 2,
      "publication_date": 20170809
    },
    {
      "title": "Great product, great price",
      "text": "This is the second bottle of this shampoo that I purchased from Alaffia, through Amazon smile. The Alaffia company provides jobs for people in need and goes beyond what most companies do to support the people that help create these products. I will continue to buy Allaffia products because the are high quality, priced well and the company does good things for people.",
      "rating": 5.0,
      "verified": true,
      "author": "Chuck Brown",
      "helpful_votes": 0,
      "publication_date": 20181129
    },
    {
      "title": "Great, mild shampoo. Can use as body wash too!",
      "text": "Our whole family has been using this for a couple of years now. It suds up very well for a more natural shampoo. It's mild, so great for the kiddos. It smells good but the smell is not very strong, which I like. It works well as body wash too.",
      "rating": 5.0,
      "verified": true,
      "author": "K.f. H",
      "helpful_votes": 0,
      "publication_date": 20190223
    },
    {
      "title": "Not a Good Product",
      "text": "I wanted to love this, as the company is wonderful and does so much good with their profits, however this just wasn't a fantastic product. It left my hair feeling very fry and almost sticky, as if I'd washed it with regular soap, my hair was super frizzy when it dried and I wasn't a fan. Wouldn't recommend",
      "rating": 1.0,
      "verified": true,
      "author": "Renee",
      "helpful_votes": 0,
      "publication_date": 20180611
    },
    {
      "title": "I like it but I don't love it",
      "text": "This shampoo is ok. I like it but I don't love it. Leaves a slight residue and is a little harsh for my hair sort of like using Dr. Bronner's on your hair but not as bad. I had to use a lot of conditioner. Woks nicely for shaving ;)",
      "rating": 4.0,
      "verified": true,
      "author": "G. Dame",
      "helpful_votes": 2,
      "publication_date": 20170531
    },
    {
      "title": "My favorite shampoo of all time",
      "text": "My favorite shampoo of all time! I have long fine hair, and this has been the only shampoo that cleanses, nourishes, adds volume, and gives back to a great cause.",
      "rating": 5.0,
      "verified": true,
      "author": "Seattle",
      "helpful_votes": 0,
      "publication_date": 20171028
    },
    {
      "title": "Shampoo=Good. Conditioner=Not so much.",
      "text": "Love this. It lathers nicely. Smell is no Herbal Essences or Pantene Pro V, but it makes my hair feel clean and I can wash in good conscience! If you are in the market to replace the less \"environmentally inclined\" brands, I would suggest this shampoo. Also, you can offset costs by JUST getting the shampoo and passing on the conditioner. I bought the conditioner too and it's not very moisturizing. I feel like it contributes nothing to my hair and I have thin, short hair so if I get nothing out of it, I'm sure a thick, long haired person would need the whole bottle!",
      "rating": 5.0,
      "verified": true,
      "author": "Samantha Gans",
      "helpful_votes": 4,
      "publication_date": 20160725
    },
    {
      "title": "Cleans and feels great",
      "text": "I wash my (long) hair once a week and this shampoo works great. My husband likes it too - the fragrance is mild and the shampoo leaves our hair feeling clean. I have continued my practice of using a vinegar rinse after I shampoo and my hair feels great. (1:10 apple cider vinegar:water with a few drops of essential oils)",
      "rating": 5.0,
      "verified": true,
      "author": "Colleen",
      "helpful_votes": 0,
      "publication_date": 20180101
    },
    {
      "title": "I love this stuff",
      "text": "It smells nice, make your hair clean without drying it, and is inexpensive. It's kind of a conditioning shampoo. I use it in combination with another lighter weight shampoo. First I use the lighter shampoo to clean the hair, then rinse and repeat with Alaffia. Great results!",
      "rating": 5.0,
      "verified": true,
      "author": "Pyracantha",
      "helpful_votes": 0,
      "publication_date": 20160831
    },
    {
      "title": "COCONUT SHAMPOO",
      "text": "Alaffia is just darn good stuff! So there. . . . .",
      "rating": 5.0,
      "verified": true,
      "author": "DEBBIE C.",
      "helpful_votes": 0,
      "publication_date": 20141006
    },
    {
      "title": "Terrible",
      "text": "Not only does the shampoo AND conditioner leave your hair like straw, the stench is literally nauseating. Im done with \"organic , natural\" shampoos & conditioners after two years of trying to find ones that work. None of them do and they all leave your hair dried out. I will stick to ones with no sulfates but as far as all natural no way. They flat out dont work. But the stench that clings to your hair for days from Alaffia is truly nauseating.",
      "rating": 1.0,
      "verified": false,
      "author": "J",
      "helpful_votes": 0,
      "publication_date": 20180904
    },
    {
      "title": "This shampoo does not clean hair. It leaves a ...",
      "text": "This shampoo does not clean hair. It leaves a funky film on my hair that stays on after I towel dry. The conditioner doesn’t rinse well either.",
      "rating": 1.0,
      "verified": false,
      "author": "Nicole Dagerman",
      "helpful_votes": 0,
      "publication_date": 20180327
    },
    {
      "title": "Disappointed...Smells awful",
      "text": "The smell is awful. I keep thinking I can handle it, but the smell gets even worse when I dry my hair. This is probably normal for a more natural shampoo, but it doesn't really lather so I have to use at least three pumps to cover my long hair and my hair feels dry and stiff after using it. I could get past the feel, but the smell literally makes me turn up my nose and I don't want to start my day that way.",
      "rating": 1.0,
      "verified": false,
      "author": "Kevin Jones",
      "helpful_votes": 0,
      "publication_date": 20171109
    },
    {
      "title": "great for you scalp and hair",
      "text": "this is a big bottle of shampoo and it lasts forever. so when it was done i went back to the shampoo i had been using before....OMG my scalp itches soooooo much its making me crazy. it just doesn't feel as clean as it did with Alaffia everyday. i'm getting another bottle now!!!",
      "rating": 5.0,
      "verified": false,
      "author": "Amazon Customer",
      "helpful_votes": 0,
      "publication_date": 20160810
    },
    {
      "title": "Just SO SO",
      "text": "I'm not crazy about it. Did not work for my hair. It made my hair heavy and greasy; while straw like all at the same time. Though it did not have a distasteful smell, it has a plastic like aroma.",
      "rating": 2.0,
      "verified": false,
      "author": "BAR",
      "helpful_votes": 0,
      "publication_date": 20160508
    }
  ],
  "product_meta": {
    "title": "Alaffia - Everyday Coconut Shampoo, Normal to Dry Hair, Helps Gently Clean Scalp and Hair of Impurities with Ginger and Coconut Oil, Fair Trade, Coconut and Ginger, 32 Ounces (FFP)",
    "description": "With a luxurious creamy lather, this Certified Fair Trade virgin coconut oil shampoo gently washes away impurities without stripping hair's natural oils. African ginger mildly stimulates scalp circulation while coconut water nourishes hair with vitamins, minerals and essential amino acids. Equality-Empowerment-Beauty. These are the three principles that Alaffia follows to not only bring customers the best natural, fair trade skin and hair care, but also to help relieve the cycle of poverty in Togo. Alaffia empowers West African communities to become sustainable through the fair trade of indigenous resources. We encourage empowerment through our community projects, our women's cooperatives, and through education and involvement in our local customer communities. We firmly believe that the cooperation of people across the world is an essential part of building sustainability in all communities.",
    "rating": 3.9,
    "feature_bullets": [
      "100% FAIR TRADE: Feel good about how you are getting your products with 100% Certified Fair Trade Ingredients.",
      "LUXURIOUS CREAMY LATHER: This Certified Fair Trade virgin coconut oil shampoo gently washes away impurities without stripping hairs natural oils.",
      "FULL OF BENEFICIAL INGREDIENTS: African ginger mildly stimulates scalp circulation while coconut water nourishes hair with vitamins, minerals and essential amino acids.",
      "FFP PACKAGING: Protected with Certified Frustration-Free Packaging so it's easy to open, recyclable, and comes without excess packaging materials.",
      "EQUALITY- EMPOWERMENT- BEAUTY: All sales of Alaffia products contribute to empowerment projects to help break the cycle of poverty in Togo."
    ],
    "specifications": {
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "12.3 x 4.4 x 4.8 inches; 2.8 Pounds",
      "UPC": "730669479267",
      "Manufacturer": "Alaffia",
      "ASIN": "B00HUDTT02",
      "Customer Reviews": "/** Fix for UDP-1061. Average customer reviews has a small extra line on hover* https://omni-grok.amazon.com/xref/src/appgroup/websiteTemplates/retail/SoftlinesDetailPageAssets/udp-intl-lock/src/legacy.css?indexName=WebsiteTemplates#40*/.noUnderline a:hover {text-decoration: none;}"
    },
    "categories": [
      "Shampoos",
      "Shampoo & Conditioner",
      "Hair Care",
      "Beauty & Personal Care"
    ],
    "price": ""
  }
}